{
    "id": "mzjgr1",
    "title": "Facial Recognition for COVID-19 vaccines? The Unconstitutionality of the Aadhaar Good Governance Rules",
    "url": "https://www.reddit.com/r/india/comments/mzjgr1/facial_recognition_for_covid19_vaccines_the/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/9khzt1mgbov61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=685c79f4759d20d09aaa1073359f208bd66f74c0\n\n### Tldr\n\nThe COVID-19 pandemic has brought long-standing criticisms of Aadhaar to the fore, with reports of an Aadhaar-based facial recognition system being used in the vaccine rollout. Today, we explore why the Aadhaar Good Governance Rules are unconstitutional in how they exceed the limits of the parent Act, violate the Puttaswamy judgement and proportionality test, and are vague and non-voluntary. We have written to the Chairpersons of the Lok Sabha and Rajya Sabha Committees on Subordinate Legislation petitioning them to take up the Rules for review, in the hope that others will take up the mantle and write to the committee as well.\n\n### The Aadhaar Good Governance Rules\n\nThe [**Aadhaar (Targeted Delivery of Financial and Other Subsidies, Benefits and Services) Act, 2016**](https://uidai.gov.in/images/targeted_delivery_of_financial_and_other_subsidies_benefits_and_services_13072016.pdf) (“Aadhaar Act”) gives the UIDAI unfettered discretion to set the policy on issues crucial to the scope, security and ambit of Aadhaar and its uses. This broad power warrants close parliamentary scrutiny over each regulation that the UIDAI adopts, including the rules in question, which were framed by the Central Government in consultation with UIDAI.\n\nUnder sub – section (1) of section 53 and clause (aa) of sub-section (2) of section 53 of the Aadhaar Act, the [**Aadhaar Authentication for Good Governance (Social Welfare, Innovation, Knowledge) Rules, 2020**](https://www.uidai.gov.in//images/Aadhaar_Authentication_for_Good_Governance_Rules_2020.pdf) were notified on 5th August, 2020t, 2016 and laid on the table of the Lok Sabha on 3rd January, 2021. Essentially, the Rules state that the Central government may allow “requesting entities” to engage in Aadhaar Based Authentication in the interest of good governance, preventing the leakage of public funds, or promoting ease of living and enabling better access to services for residents. Aadhaar authentication can be proposed for the following purposes under Rule 3(1):\n\n1. usage of digital platforms to ensure good governance;\n2. prevention of dissipation of social welfare benefits;\n3. enablement of innovation and the spread of knowledge.\n\nAs per the consolidated response to certain RTIs filed by us, as of 1st April, 2021, 53 proposals from Ministries or Departments of the Central government or State governments for permission to use Aadhaar authentication under these Rules. Of these 53 proposals, 32 have been referred to the Unique Identification Authority of India under Rule 5 of the Rules, out of which 22 proposals have been accepted and 10 proposals are under examination.\n\nWhat this indicates is that wide-spread Aadhaar based authentication is no longer a proposal  and is now a reality. For example, on March 3, 2020, the Ministry of Road Transport and Highways [**issued a notification**](https://www.medianama.com/wp-content/uploads/2021/03/225616.pdf) allowing for the voluntary use of the Aadhaar number which can be used “by any individual, desirous of availing various contactless services. Alternatively, the Ministry of Health and Family Welfare has [**issued a notification**](http://egazette.nic.in/WriteReadData/2021/224099.pdf) by which it proposes to use Aadhaar authentication to generate a unique Health identifier.\n\nThe Aadhaar project has [**faced several criticisms**](https://internetfreedom.in/aadhaar-undermines-informational-privacy-and-data-protection/) since its inception; such criticisms have only heightened after its implementation, with a diverse set of actors from the Supreme Court to CAG of India to various civil society bodies [**questioning the use of Aadhaar based authentication**](https://www.livemint.com/Home-Page/s22gUzxOULwQxqukfcBMiM/The-economics-of-Aadhaar.html). Indeed, the [**Economic Survey 2016-17 (para 9.67)**](https://www.indiabudget.gov.in/budget2017-2018/es2016-17/echapter.pdf#page=210) has acknowledged the existence of severe exclusion errors due to authentication failure, with failure rates ranging from 5% in Gujarat to 37% in Rajasthan and 49% in Jharkhand! This is before considering the wide range of [**data security issues**](https://jsis.washington.edu/news/the-aadhaar-card-cybersecurity-issues-with-indias-biometric-experiment/) and [**privacy issues**](https://thewire.in/government/privacy-aadhaar-supreme-court) that are associated with Aadhaar, especially in the absence of an adequate data protection law. The COVID-19 pandemic has [**brought these concerns to the fore**](https://internetfreedom.in/aadhaar-good-governance-rules/), with reports of an [**Aadhaar-based facial recognition**](https://internetfreedom.in/sign-on-and-support-close-to-10-organisations-and-158-individuals-who-are-warning-against-aadhaar-based-facial-recognition-for-vaccination/) system being used in the vaccine rollout and Aadhaar being [**mandatory for admission into COVID-19 wards in hospitals**](https://timesofindia.indiatimes.com/city/gurgaon/aadhaar-rule-for-hospital-beds-leaves-many-stumped/articleshow/82188572.cms).\n\nThus, it is now critical that greater Parliamentary scrutiny into the Rules takes place.\n\n### The unconstitutional nature of the Rules\n\nUpon analysis, several major issues with the Rules have emerged:\n\n1. **The Rules travel outside the parent legislation and exceed the limits of the Aadhaar Act:** It is settled jurisprudence that the rules framed under an Act cannot travel beyond the boundaries of the Act. According to the preamble, and Section 7 of the Aadhaar Act, the Aadhaar number can be mandated as proof of authentication of identities for the receipt of certain subsidies, benefits and services, which have been funded by the Consolidated Fund of India (or the Consolidated fund of states). Thus, the objectives provided under Clause 3(1) of the Rules, must fall within these boundaries. But due to the expansive wording of these purposes, any government project could come under the ambit of these objectives, some of which will go beyond the scope of the Aadhaar Act. It must also be recalled that the Aadhaar Act was certified as a money bill, on the grounds that it was linked to welfare goods and services which were funded by the Consolidated Fund of India through Section 7. The Rules expand the ambit and scope of the Act, which would sever the connection to the Act as a Money Bill.\n2. **The Rules violate the Supreme Court’s Aadhaar Judgement:** In [***Justice (Retd.)*** ***KS Puttaswamy v Union of India***](https://indiankanoon.org/doc/127517806/) , a majority bench of the Supreme Court found the Aadhaar Act constitutional, but only after drawing strict lines in the sand for how Aadhaar could be used. The Court held that the government was permitted to use Aadhaar authentication for a limited set of purposes and struck down Section 57, which permitted private parties to use Aadhaar authentication, as there was a possibility of it being commercially exploited by private entities. Clause 4 of the Rules mentions that ‘requesting entities’ could be  the Ministry, Department of the Government of India or any State Government that wants to use Aadhaar for the purposes specified in the Rules. In this regard, the question to be asked is what if the ‘requesting entity’ is applying for the purpose of a public-private partnership project? In this case, it would be impossible for the private entity to not get access to the Aadhaar numbers of individuals. Additionally, the Aadhaar Amendment Act, 2019, which permits private parties access to Aadhaar numbers is pending challenge in the Supreme Court, for violating the *Puttaswamy* judgement.\n3. **The Rules are only voluntary in name:** Clause 3(2) of the Rules states that the process of authentication for the purposes set out in the rules is ‘voluntary’. However, the experience with Aadhaar authentication and recent instances like the roll-out of the Covid vaccination have shown that  the Government has pushed Aadhaar so that it becomes the ‘preferred’ mode of verification and authentication. This could eventually lead it to becoming mandatory for government services, in direct violation of the Supreme Court judgement. Thus, even though it is voluntary on paper, it de-facto becomes mandatory in usage. There is also no assurance in the rules about the status of those who choose not to provide their Aadhaar numbers for authentication purposes. This can also take the form of financial compulsions. For example, at the All India Institute of Medical Sciences, the premier government hospital, a patient can get the registration charges of Rs. 100 waived off if they provide their Aadhaar ID to authenticate their identity. Such a policy significantly privileges the usage of Aadhaar and thus effectively amounts to financial coercion towards the adoption of the Health ID. For the Good Governance rules, some Ministries have stated that Aadhaar authentication is “voluntary,” as it is only required if a citizen wants to access a public service online. For example, the Ministry of Road Transport has applied for permission under the Good Governance Rules to use Aadhaar authentication for online applications for licenses/ learners’ licenses, and other related services. Through this method, Aadhaar becomes de-facto mandatory to access public services online, thus creating a barrier to the right to the internet and to public services. Additionally, technology failures plague the Aadhaar authentication system, and have already led to serious issues of exclusion from welfare benefits, which are likely to be aggravated.The linkage of Aadhaar to welfare services has caused large numbers of people to be excluded from their welfare benefits, which has caused immeasurable hardship. Increasing the use cases for Aadhaar authentication would only exacerbate this problem, and increases the risk of infringement of the right to privacy. The CEO of UIDAI had noted that in 2018 authentication failure for government services[ **was as high as 12%.**](https://www.thequint.com/news/india/uidai-ceo-admits-aadhaar-authentication-failure-rate-12) A recent J-PAL study in Jharkhand also found that Aadhaar based verification [**“either did not reduce errors of inclusion or leakage or did so at the cost of increased exclusion error”**](https://econweb.ucsd.edu/~kamurali/papers/Working%20Papers/ABBA%20(NBER%20WP%2026744).pdf), with an error of between 22% and 34% of reduced disbursals. Reports of starvation deaths [**due to a lack of Aadhaar linkage or biometric failure**](https://thewire.in/rights/of-42-hunger-related-deaths-since-2017-25-linked-to-aadhaar-issues) have also been repeatedly highlighted.\n4. **The Rules are unconstitutionally vague:** The Rules include vague terms like ‘good governance’, ‘social welfare benefits’, ‘innovation’, ‘spread of knowledge’, and ‘satisfied;/ These terms are not defined either in the Rules or Aadhaar Act or even the Information Technology Act, 2000, and could possibly include every government and administrative function. The rules lack guidelines which would help the administrative authorities decide the various circumstances under which the rules would become operative, or the limits to which its power could be extended. The wide discretionary power of the Rules amounts to excessive delegation, which would be illegal.\n5. **The Rules violate the proportionality test:** The rules also fail to fulfil the test of proportionality, confirmed by the *Puttaswamy* judgement. In order for the Rules to be accepted, the following conditions must be met: 1) Legality or the existence of a law , 2) Need, defined in terms of a legitimate state aim, and 3) Proportionality which ensures a rational nexus between the objects and the means adopted to achieve them. The objectives of the Rules, however, are vague, and do not define the particular aim that the State intends to achieve through the Rules. Hence, they fail to fulfill the second and third conditions of the proportionality test.\n\n### Letters to the Committees\n\nThe presence of such significant issues further increases the need for Parliamentary oversight. However, a curtailed Budget session has meant that the Rules have not been debated on the floor of the house. Thus, we have written to the Chairpersons of the both the Lok Sabha and Rajya Sabha Committees on Subordinate Legislation which scrutinise subordinate legislation such as rules, regulations, and bye-laws that emerge from Acts (for example, in the past, the Lok Sabha Committee on Subordinate Legislation has provided [**its recommendations on the Information Technology (Intermediary Guidelines), 2011**](https://www.prsindia.org/sites/default/files/bill_files/IT_Rules_Subordinate_committee_Report.pdf)). Through our letter, we have petitioned the Committees to take up the Rules for review and test them on the grounds of constitutional principles. We hope that others will take up the mantle and write to the committee as well.\n\n### Documents\n\n1. Aadhaar Authentication for Good Governance (Social Welfare, Innovation, Knowledge) Rules, 2020 ([**link**](https://www.uidai.gov.in//images/Aadhaar_Authentication_for_Good_Governance_Rules_2020.pdf))\n2. IFF’s Letter to the Chairperson of the Lok Sabha Committee on Subordinate Legislation regarding a petition to review the Aadhaar Authentication for Good Governance Rules, 2020([**link**](https://drive.google.com/file/d/15jYhQoNZCMLgu0AY9GgKzNjHntrI_935/view?usp=sharing))\n3. IFF’s Letter to the Chairperson of the Rajya Sabha Committee on Subordinate Legislation regarding a petition to review the Aadhaar Authentication for Good Governance Rules, 2020 ([**link**](https://drive.google.com/file/d/1urS0CeTTECq8lJJ5RroN-G4kDbh0GdlS/view?usp=sharing))",
    "flair": "Policy/Economy",
    "score": 30,
    "num_comments": 1,
    "created_utc": 1619510818,
    "convurl": "https://b.thumbs.redditmedia.com/L8Lg70h8Ho04jO4XQVA51GLsgsMTjvMvi7YAyi4KEZE.jpg",
    "comments": [
        "Can anybody raise a petition in Highcourts or does this not come under their purview?"
    ],
    "cleaned_text": "facial recognition covid vaccines unconstitutionality aadhaar good governance rules ampxb tldr covid pandemic brought longstanding criticisms aadhaar fore reports aadhaarbased facial recognition system used vaccine rollout today explore aadhaar good governance rules unconstitutional exceed limits parent act violate puttaswamy judgement proportionality test vague nonvoluntary written chairpersons lok sabha rajya sabha committees subordinate legislation petitioning take rules review hope others take mantle write committee well aadhaar good governance rules aadhaar targeted delivery financial subsidies benefits services act httpsuidaigovinimagestargeteddeliveryoffinancialandothersubsidiesbenefitsandservicespdf aadhaar act gives uidai unfettered discretion set policy issues crucial scope security ambit aadhaar uses broad power warrants close parliamentary scrutiny regulation uidai adopts including rules question framed central government consultation uidai sub section section clause aa subsection section aadhaar act aadhaar authentication good governance social welfare innovation knowledge rules httpswwwuidaigovinimagesaadhaarauthenticationforgoodgovernancerulespdf notified th august laid table lok sabha rd january essentially rules state central government may allow requesting entities engage aadhaar based authentication interest good governance preventing leakage public funds promoting ease living enabling better access services residents aadhaar authentication proposed following purposes rule usage digital platforms ensure good governance prevention dissipation social welfare benefits enablement innovation spread knowledge per consolidated response certain rtis filed us st april proposals ministries departments central government state governments permission use aadhaar authentication rules proposals referred unique identification authority india rule rules proposals accepted proposals examination indicates widespread aadhaar based authentication longer proposal reality example march ministry road transport highways issued notificationhttpswwwmedianamacomwpcontentuploadspdf allowing voluntary use aadhaar number used individual desirous availing various contactless services alternatively ministry health family welfare issued notificationhttpegazettenicinwritereaddatapdf proposes use aadhaar authentication generate unique health identifier aadhaar project faced several criticismshttpsinternetfreedominaadhaarunderminesinformationalprivacyanddataprotection since inception criticisms heightened implementation diverse set actors supreme court cag india various civil society bodies questioning use aadhaar based authenticationhttpswwwlivemintcomhomepagesguzxoulwqxqukfcbmimtheeconomicsofaadhaarhtml indeed economic survey para httpswwwindiabudgetgovinbudgetesechapterpdfpage acknowledged existence severe exclusion errors due authentication failure failure rates ranging gujarat rajasthan jharkhand considering wide range data security issueshttpsjsiswashingtonedunewstheaadhaarcardcybersecurityissueswithindiasbiometricexperiment privacy issueshttpsthewireingovernmentprivacyaadhaarsupremecourt associated aadhaar especially absence adequate data protection law covid pandemic brought concerns forehttpsinternetfreedominaadhaargoodgovernancerules reports aadhaarbased facial recognitionhttpsinternetfreedominsignonandsupportclosetoorganisationsandindividualswhoarewarningagainstaadhaarbasedfacialrecognitionforvaccination system used vaccine rollout aadhaar mandatory admission covid wards hospitalshttpstimesofindiaindiatimescomcitygurgaonaadhaarruleforhospitalbedsleavesmanystumpedarticleshowcms thus critical greater parliamentary scrutiny rules takes place unconstitutional nature rules upon analysis several major issues rules emerged rules travel outside parent legislation exceed limits aadhaar act settled jurisprudence rules framed act travel beyond boundaries act according preamble section aadhaar act aadhaar number mandated proof authentication identities receipt certain subsidies benefits services funded consolidated fund india consolidated fund states thus objectives provided clause rules must fall within boundaries due expansive wording purposes government project could come ambit objectives go beyond scope aadhaar act must also recalled aadhaar act certified money bill grounds linked welfare goods services funded consolidated fund india section rules expand ambit scope act would sever connection act money bill rules violate supreme courts aadhaar judgement justice retd ks puttaswamy v union indiahttpsindiankanoonorgdoc majority bench supreme court found aadhaar act constitutional drawing strict lines sand aadhaar could used court held government permitted use aadhaar authentication limited set purposes struck section permitted private parties use aadhaar authentication possibility commercially exploited private entities clause rules mentions requesting entities could ministry department government india state government wants use aadhaar purposes specified rules regard question asked requesting entity applying purpose publicprivate partnership project case would impossible private entity get access aadhaar numbers individuals additionally aadhaar amendment act permits private parties access aadhaar numbers pending challenge supreme court violating puttaswamy judgement rules voluntary name clause rules states process authentication purposes set rules voluntary however experience aadhaar authentication recent instances like rollout covid vaccination shown government pushed aadhaar becomes preferred mode verification authentication could eventually lead becoming mandatory government services direct violation supreme court judgement thus even though voluntary paper defacto becomes mandatory usage also assurance rules status choose provide aadhaar numbers authentication purposes also take form financial compulsions example india institute medical sciences premier government hospital patient get registration charges rs waived provide aadhaar id authenticate identity policy significantly privileges usage aadhaar thus effectively amounts financial coercion towards adoption health id good governance rules ministries stated aadhaar authentication voluntary required citizen wants access public service online example ministry road transport applied permission good governance rules use aadhaar authentication online applications licenses learners licenses related services method aadhaar becomes defacto mandatory access public services online thus creating barrier right internet public services additionally technology failures plague aadhaar authentication system already led serious issues exclusion welfare benefits likely aggravatedthe linkage aadhaar welfare services caused large numbers people excluded welfare benefits caused immeasurable hardship increasing use cases aadhaar authentication would exacerbate problem increases risk infringement right privacy ceo uidai noted authentication failure government services high httpswwwthequintcomnewsindiauidaiceoadmitsaadhaarauthenticationfailurerate recent jpal study jharkhand also found aadhaar based verification either reduce errors inclusion leakage cost increased exclusion errorhttpseconwebucsdedukamuralipapersworkingpapersabbanberwppdf error reduced disbursals reports starvation deaths due lack aadhaar linkage biometric failurehttpsthewireinrightsofhungerrelateddeathssincelinkedtoaadhaarissues also repeatedly highlighted rules unconstitutionally vague rules include vague terms like good governance social welfare benefits innovation spread knowledge satisfied terms defined either rules aadhaar act even information technology act could possibly include every government administrative function rules lack guidelines would help administrative authorities decide various circumstances rules would become operative limits power could extended wide discretionary power rules amounts excessive delegation would illegal rules violate proportionality test rules also fail fulfil test proportionality confirmed puttaswamy judgement order rules accepted following conditions must met legality existence law need defined terms legitimate state aim proportionality ensures rational nexus objects means adopted achieve objectives rules however vague define particular aim state intends achieve rules hence fail fulfill second third conditions proportionality test letters committees presence significant issues increases need parliamentary oversight however curtailed budget session meant rules debated floor house thus written chairpersons lok sabha rajya sabha committees subordinate legislation scrutinise subordinate legislation rules regulations byelaws emerge acts example past lok sabha committee subordinate legislation provided recommendations information technology intermediary guidelines httpswwwprsindiaorgsitesdefaultfilesbillfilesitrulessubordinatecommitteereportpdf letter petitioned committees take rules review test grounds constitutional principles hope others take mantle write committee well documents aadhaar authentication good governance social welfare innovation knowledge rules linkhttpswwwuidaigovinimagesaadhaarauthenticationforgoodgovernancerulespdf iffs letter chairperson lok sabha committee subordinate legislation regarding petition review aadhaar authentication good governance rules linkhttpsdrivegooglecomfiledjyhqonzcmlguayggkznjhntriviewuspsharing iffs letter chairperson rajya sabha committee subordinate legislation regarding petition review aadhaar authentication good governance rules linkhttpsdrivegooglecomfiledurscettecqljjrrongkdbhgdlsviewuspsharing ",
    "cleaned_title": "facial recognition covid vaccines unconstitutionality aadhaar good governance rules",
    "cleaned_selftext": "ampxb tldr covid pandemic brought longstanding criticisms aadhaar fore reports aadhaarbased facial recognition system used vaccine rollout today explore aadhaar good governance rules unconstitutional exceed limits parent act violate puttaswamy judgement proportionality test vague nonvoluntary written chairpersons lok sabha rajya sabha committees subordinate legislation petitioning take rules review hope others take mantle write committee well aadhaar good governance rules aadhaar targeted delivery financial subsidies benefits services act httpsuidaigovinimagestargeteddeliveryoffinancialandothersubsidiesbenefitsandservicespdf aadhaar act gives uidai unfettered discretion set policy issues crucial scope security ambit aadhaar uses broad power warrants close parliamentary scrutiny regulation uidai adopts including rules question framed central government consultation uidai sub section section clause aa subsection section aadhaar act aadhaar authentication good governance social welfare innovation knowledge rules httpswwwuidaigovinimagesaadhaarauthenticationforgoodgovernancerulespdf notified th august laid table lok sabha rd january essentially rules state central government may allow requesting entities engage aadhaar based authentication interest good governance preventing leakage public funds promoting ease living enabling better access services residents aadhaar authentication proposed following purposes rule usage digital platforms ensure good governance prevention dissipation social welfare benefits enablement innovation spread knowledge per consolidated response certain rtis filed us st april proposals ministries departments central government state governments permission use aadhaar authentication rules proposals referred unique identification authority india rule rules proposals accepted proposals examination indicates widespread aadhaar based authentication longer proposal reality example march ministry road transport highways issued notificationhttpswwwmedianamacomwpcontentuploadspdf allowing voluntary use aadhaar number used individual desirous availing various contactless services alternatively ministry health family welfare issued notificationhttpegazettenicinwritereaddatapdf proposes use aadhaar authentication generate unique health identifier aadhaar project faced several criticismshttpsinternetfreedominaadhaarunderminesinformationalprivacyanddataprotection since inception criticisms heightened implementation diverse set actors supreme court cag india various civil society bodies questioning use aadhaar based authenticationhttpswwwlivemintcomhomepagesguzxoulwqxqukfcbmimtheeconomicsofaadhaarhtml indeed economic survey para httpswwwindiabudgetgovinbudgetesechapterpdfpage acknowledged existence severe exclusion errors due authentication failure failure rates ranging gujarat rajasthan jharkhand considering wide range data security issueshttpsjsiswashingtonedunewstheaadhaarcardcybersecurityissueswithindiasbiometricexperiment privacy issueshttpsthewireingovernmentprivacyaadhaarsupremecourt associated aadhaar especially absence adequate data protection law covid pandemic brought concerns forehttpsinternetfreedominaadhaargoodgovernancerules reports aadhaarbased facial recognitionhttpsinternetfreedominsignonandsupportclosetoorganisationsandindividualswhoarewarningagainstaadhaarbasedfacialrecognitionforvaccination system used vaccine rollout aadhaar mandatory admission covid wards hospitalshttpstimesofindiaindiatimescomcitygurgaonaadhaarruleforhospitalbedsleavesmanystumpedarticleshowcms thus critical greater parliamentary scrutiny rules takes place unconstitutional nature rules upon analysis several major issues rules emerged rules travel outside parent legislation exceed limits aadhaar act settled jurisprudence rules framed act travel beyond boundaries act according preamble section aadhaar act aadhaar number mandated proof authentication identities receipt certain subsidies benefits services funded consolidated fund india consolidated fund states thus objectives provided clause rules must fall within boundaries due expansive wording purposes government project could come ambit objectives go beyond scope aadhaar act must also recalled aadhaar act certified money bill grounds linked welfare goods services funded consolidated fund india section rules expand ambit scope act would sever connection act money bill rules violate supreme courts aadhaar judgement justice retd ks puttaswamy v union indiahttpsindiankanoonorgdoc majority bench supreme court found aadhaar act constitutional drawing strict lines sand aadhaar could used court held government permitted use aadhaar authentication limited set purposes struck section permitted private parties use aadhaar authentication possibility commercially exploited private entities clause rules mentions requesting entities could ministry department government india state government wants use aadhaar purposes specified rules regard question asked requesting entity applying purpose publicprivate partnership project case would impossible private entity get access aadhaar numbers individuals additionally aadhaar amendment act permits private parties access aadhaar numbers pending challenge supreme court violating puttaswamy judgement rules voluntary name clause rules states process authentication purposes set rules voluntary however experience aadhaar authentication recent instances like rollout covid vaccination shown government pushed aadhaar becomes preferred mode verification authentication could eventually lead becoming mandatory government services direct violation supreme court judgement thus even though voluntary paper defacto becomes mandatory usage also assurance rules status choose provide aadhaar numbers authentication purposes also take form financial compulsions example india institute medical sciences premier government hospital patient get registration charges rs waived provide aadhaar id authenticate identity policy significantly privileges usage aadhaar thus effectively amounts financial coercion towards adoption health id good governance rules ministries stated aadhaar authentication voluntary required citizen wants access public service online example ministry road transport applied permission good governance rules use aadhaar authentication online applications licenses learners licenses related services method aadhaar becomes defacto mandatory access public services online thus creating barrier right internet public services additionally technology failures plague aadhaar authentication system already led serious issues exclusion welfare benefits likely aggravatedthe linkage aadhaar welfare services caused large numbers people excluded welfare benefits caused immeasurable hardship increasing use cases aadhaar authentication would exacerbate problem increases risk infringement right privacy ceo uidai noted authentication failure government services high httpswwwthequintcomnewsindiauidaiceoadmitsaadhaarauthenticationfailurerate recent jpal study jharkhand also found aadhaar based verification either reduce errors inclusion leakage cost increased exclusion errorhttpseconwebucsdedukamuralipapersworkingpapersabbanberwppdf error reduced disbursals reports starvation deaths due lack aadhaar linkage biometric failurehttpsthewireinrightsofhungerrelateddeathssincelinkedtoaadhaarissues also repeatedly highlighted rules unconstitutionally vague rules include vague terms like good governance social welfare benefits innovation spread knowledge satisfied terms defined either rules aadhaar act even information technology act could possibly include every government administrative function rules lack guidelines would help administrative authorities decide various circumstances rules would become operative limits power could extended wide discretionary power rules amounts excessive delegation would illegal rules violate proportionality test rules also fail fulfil test proportionality confirmed puttaswamy judgement order rules accepted following conditions must met legality existence law need defined terms legitimate state aim proportionality ensures rational nexus objects means adopted achieve objectives rules however vague define particular aim state intends achieve rules hence fail fulfill second third conditions proportionality test letters committees presence significant issues increases need parliamentary oversight however curtailed budget session meant rules debated floor house thus written chairpersons lok sabha rajya sabha committees subordinate legislation scrutinise subordinate legislation rules regulations byelaws emerge acts example past lok sabha committee subordinate legislation provided recommendations information technology intermediary guidelines httpswwwprsindiaorgsitesdefaultfilesbillfilesitrulessubordinatecommitteereportpdf letter petitioned committees take rules review test grounds constitutional principles hope others take mantle write committee well documents aadhaar authentication good governance social welfare innovation knowledge rules linkhttpswwwuidaigovinimagesaadhaarauthenticationforgoodgovernancerulespdf iffs letter chairperson lok sabha committee subordinate legislation regarding petition review aadhaar authentication good governance rules linkhttpsdrivegooglecomfiledjyhqonzcmlguayggkznjhntriviewuspsharing iffs letter chairperson rajya sabha committee subordinate legislation regarding petition review aadhaar authentication good governance rules linkhttpsdrivegooglecomfiledurscettecqljjrrongkdbhgdlsviewuspsharing",
    "cleaned_comments": "anybody raise petition highcourts come purview",
    "light_cleaned_title": "Facial Recognition for COVID-19 vaccines? The Unconstitutionality of the Aadhaar Good Governance Rules",
    "light_cleaned_selftext": "### Tldr The COVID-19 pandemic has brought long-standing criticisms of Aadhaar to the fore, with reports of an Aadhaar-based facial recognition system being used in the vaccine rollout. Today, we explore why the Aadhaar Good Governance Rules are unconstitutional in how they exceed the limits of the parent Act, violate the Puttaswamy judgement and proportionality test, and are vague and non-voluntary. We have written to the Chairpersons of the Lok Sabha and Rajya Sabha Committees on Subordinate Legislation petitioning them to take up the Rules for review, in the hope that others will take up the mantle and write to the committee as well. ### The Aadhaar Good Governance Rules The [**Aadhaar (Targeted Delivery of Financial and Other Subsidies, Benefits and Services) Act, 2016**](https://uidai.gov.in/images/targeted_delivery_of_financial_and_other_subsidies_benefits_and_services_13072016.pdf) (“Aadhaar Act”) gives the UIDAI unfettered discretion to set the policy on issues crucial to the scope, security and ambit of Aadhaar and its uses. This broad power warrants close parliamentary scrutiny over each regulation that the UIDAI adopts, including the rules in question, which were framed by the Central Government in consultation with UIDAI. Under sub – section (1) of section 53 and clause (aa) of sub-section (2) of section 53 of the Aadhaar Act, the [**Aadhaar Authentication for Good Governance (Social Welfare, Innovation, Knowledge) Rules, 2020**](https://www.uidai.gov.in//images/Aadhaar_Authentication_for_Good_Governance_Rules_2020.pdf) were notified on 5th August, 2020t, 2016 and laid on the table of the Lok Sabha on 3rd January, 2021. Essentially, the Rules state that the Central government may allow “requesting entities” to engage in Aadhaar Based Authentication in the interest of good governance, preventing the leakage of public funds, or promoting ease of living and enabling better access to services for residents. Aadhaar authentication can be proposed for the following purposes under Rule 3(1): 1. usage of digital platforms to ensure good governance; 2. prevention of dissipation of social welfare benefits; 3. enablement of innovation and the spread of knowledge. As per the consolidated response to certain RTIs filed by us, as of 1st April, 2021, 53 proposals from Ministries or Departments of the Central government or State governments for permission to use Aadhaar authentication under these Rules. Of these 53 proposals, 32 have been referred to the Unique Identification Authority of India under Rule 5 of the Rules, out of which 22 proposals have been accepted and 10 proposals are under examination. What this indicates is that wide-spread Aadhaar based authentication is no longer a proposal and is now a reality. For example, on March 3, 2020, the Ministry of Road Transport and Highways [**issued a notification**](https://www.medianama.com/wp-content/uploads/2021/03/225616.pdf) allowing for the voluntary use of the Aadhaar number which can be used “by any individual, desirous of availing various contactless services. Alternatively, the Ministry of Health and Family Welfare has [**issued a notification**](http://egazette.nic.in/WriteReadData/2021/224099.pdf) by which it proposes to use Aadhaar authentication to generate a unique Health identifier. The Aadhaar project has [**faced several criticisms**](https://internetfreedom.in/aadhaar-undermines-informational-privacy-and-data-protection/) since its inception; such criticisms have only heightened after its implementation, with a diverse set of actors from the Supreme Court to CAG of India to various civil society bodies [**questioning the use of Aadhaar based authentication**](https://www.livemint.com/Home-Page/s22gUzxOULwQxqukfcBMiM/The-economics-of-Aadhaar.html). Indeed, the [**Economic Survey 2016-17 (para 9.67)**](https://www.indiabudget.gov.in/budget2017-2018/es2016-17/echapter.pdf#page=210) has acknowledged the existence of severe exclusion errors due to authentication failure, with failure rates ranging from 5% in Gujarat to 37% in Rajasthan and 49% in Jharkhand! This is before considering the wide range of [**data security issues**](https://jsis.washington.edu/news/the-aadhaar-card-cybersecurity-issues-with-indias-biometric-experiment/) and [**privacy issues**](https://thewire.in/government/privacy-aadhaar-supreme-court) that are associated with Aadhaar, especially in the absence of an adequate data protection law. The COVID-19 pandemic has [**brought these concerns to the fore**](https://internetfreedom.in/aadhaar-good-governance-rules/), with reports of an [**Aadhaar-based facial recognition**](https://internetfreedom.in/sign-on-and-support-close-to-10-organisations-and-158-individuals-who-are-warning-against-aadhaar-based-facial-recognition-for-vaccination/) system being used in the vaccine rollout and Aadhaar being [**mandatory for admission into COVID-19 wards in hospitals**](https://timesofindia.indiatimes.com/city/gurgaon/aadhaar-rule-for-hospital-beds-leaves-many-stumped/articleshow/82188572.cms). Thus, it is now critical that greater Parliamentary scrutiny into the Rules takes place. ### The unconstitutional nature of the Rules Upon analysis, several major issues with the Rules have emerged: 1. **The Rules travel outside the parent legislation and exceed the limits of the Aadhaar Act:** It is settled jurisprudence that the rules framed under an Act cannot travel beyond the boundaries of the Act. According to the preamble, and Section 7 of the Aadhaar Act, the Aadhaar number can be mandated as proof of authentication of identities for the receipt of certain subsidies, benefits and services, which have been funded by the Consolidated Fund of India (or the Consolidated fund of states). Thus, the objectives provided under Clause 3(1) of the Rules, must fall within these boundaries. But due to the expansive wording of these purposes, any government project could come under the ambit of these objectives, some of which will go beyond the scope of the Aadhaar Act. It must also be recalled that the Aadhaar Act was certified as a money bill, on the grounds that it was linked to welfare goods and services which were funded by the Consolidated Fund of India through Section 7. The Rules expand the ambit and scope of the Act, which would sever the connection to the Act as a Money Bill. 2. **The Rules violate the Supreme Court’s Aadhaar Judgement:** In [***Justice (Retd.)*** ***KS Puttaswamy v Union of India***](https://indiankanoon.org/doc/127517806/) , a majority bench of the Supreme Court found the Aadhaar Act constitutional, but only after drawing strict lines in the sand for how Aadhaar could be used. The Court held that the government was permitted to use Aadhaar authentication for a limited set of purposes and struck down Section 57, which permitted private parties to use Aadhaar authentication, as there was a possibility of it being commercially exploited by private entities. Clause 4 of the Rules mentions that ‘requesting entities’ could be the Ministry, Department of the Government of India or any State Government that wants to use Aadhaar for the purposes specified in the Rules. In this regard, the question to be asked is what if the ‘requesting entity’ is applying for the purpose of a public-private partnership project? In this case, it would be impossible for the private entity to not get access to the Aadhaar numbers of individuals. Additionally, the Aadhaar Amendment Act, 2019, which permits private parties access to Aadhaar numbers is pending challenge in the Supreme Court, for violating the *Puttaswamy* judgement. 3. **The Rules are only voluntary in name:** Clause 3(2) of the Rules states that the process of authentication for the purposes set out in the rules is ‘voluntary’. However, the experience with Aadhaar authentication and recent instances like the roll-out of the Covid vaccination have shown that the Government has pushed Aadhaar so that it becomes the ‘preferred’ mode of verification and authentication. This could eventually lead it to becoming mandatory for government services, in direct violation of the Supreme Court judgement. Thus, even though it is voluntary on paper, it de-facto becomes mandatory in usage. There is also no assurance in the rules about the status of those who choose not to provide their Aadhaar numbers for authentication purposes. This can also take the form of financial compulsions. For example, at the All India Institute of Medical Sciences, the premier government hospital, a patient can get the registration charges of Rs. 100 waived off if they provide their Aadhaar ID to authenticate their identity. Such a policy significantly privileges the usage of Aadhaar and thus effectively amounts to financial coercion towards the adoption of the Health ID. For the Good Governance rules, some Ministries have stated that Aadhaar authentication is “voluntary,” as it is only required if a citizen wants to access a public service online. For example, the Ministry of Road Transport has applied for permission under the Good Governance Rules to use Aadhaar authentication for online applications for licenses/ learners’ licenses, and other related services. Through this method, Aadhaar becomes de-facto mandatory to access public services online, thus creating a barrier to the right to the internet and to public services. Additionally, technology failures plague the Aadhaar authentication system, and have already led to serious issues of exclusion from welfare benefits, which are likely to be aggravated.The linkage of Aadhaar to welfare services has caused large numbers of people to be excluded from their welfare benefits, which has caused immeasurable hardship. Increasing the use cases for Aadhaar authentication would only exacerbate this problem, and increases the risk of infringement of the right to privacy. The CEO of UIDAI had noted that in 2018 authentication failure for government services[ **was as high as 12%.**](https://www.thequint.com/news/india/uidai-ceo-admits-aadhaar-authentication-failure-rate-12) A recent J-PAL study in Jharkhand also found that Aadhaar based verification [**“either did not reduce errors of inclusion or leakage or did so at the cost of increased exclusion error”**](https://econweb.ucsd.edu/~kamurali/papers/Working%20Papers/ABBA%20(NBER%20WP%2026744).pdf), with an error of between 22% and 34% of reduced disbursals. Reports of starvation deaths [**due to a lack of Aadhaar linkage or biometric failure**](https://thewire.in/rights/of-42-hunger-related-deaths-since-2017-25-linked-to-aadhaar-issues) have also been repeatedly highlighted. 4. **The Rules are unconstitutionally vague:** The Rules include vague terms like ‘good governance’, ‘social welfare benefits’, ‘innovation’, ‘spread of knowledge’, and ‘satisfied;/ These terms are not defined either in the Rules or Aadhaar Act or even the Information Technology Act, 2000, and could possibly include every government and administrative function. The rules lack guidelines which would help the administrative authorities decide the various circumstances under which the rules would become operative, or the limits to which its power could be extended. The wide discretionary power of the Rules amounts to excessive delegation, which would be illegal. 5. **The Rules violate the proportionality test:** The rules also fail to fulfil the test of proportionality, confirmed by the *Puttaswamy* judgement. In order for the Rules to be accepted, the following conditions must be met: 1) Legality or the existence of a law , 2) Need, defined in terms of a legitimate state aim, and 3) Proportionality which ensures a rational nexus between the objects and the means adopted to achieve them. The objectives of the Rules, however, are vague, and do not define the particular aim that the State intends to achieve through the Rules. Hence, they fail to fulfill the second and third conditions of the proportionality test. ### Letters to the Committees The presence of such significant issues further increases the need for Parliamentary oversight. However, a curtailed Budget session has meant that the Rules have not been debated on the floor of the house. Thus, we have written to the Chairpersons of the both the Lok Sabha and Rajya Sabha Committees on Subordinate Legislation which scrutinise subordinate legislation such as rules, regulations, and bye-laws that emerge from Acts (for example, in the past, the Lok Sabha Committee on Subordinate Legislation has provided [**its recommendations on the Information Technology (Intermediary Guidelines), 2011**](https://www.prsindia.org/sites/default/files/bill_files/IT_Rules_Subordinate_committee_Report.pdf)). Through our letter, we have petitioned the Committees to take up the Rules for review and test them on the grounds of constitutional principles. We hope that others will take up the mantle and write to the committee as well. ### Documents 1. Aadhaar Authentication for Good Governance (Social Welfare, Innovation, Knowledge) Rules, 2020 ([**link**](https://www.uidai.gov.in//images/Aadhaar_Authentication_for_Good_Governance_Rules_2020.pdf)) 2. IFF’s Letter to the Chairperson of the Lok Sabha Committee on Subordinate Legislation regarding a petition to review the Aadhaar Authentication for Good Governance Rules, 2020([**link**](https://drive.google.com/file/d/15jYhQoNZCMLgu0AY9GgKzNjHntrI_935/view?usp=sharing)) 3. IFF’s Letter to the Chairperson of the Rajya Sabha Committee on Subordinate Legislation regarding a petition to review the Aadhaar Authentication for Good Governance Rules, 2020 ([**link**](https://drive.google.com/file/d/1urS0CeTTECq8lJJ5RroN-G4kDbh0GdlS/view?usp=sharing))",
    "light_cleaned_comments": "Can anybody raise a petition in Highcourts or does this not come under their purview?"
}