{
    "id": "1e28j4f",
    "title": "The world’s next food superpower",
    "url": "https://www.economist.com/asia/2024/07/11/the-worlds-next-food-superpower",
    "selftext": "What are your thoughts on this topic? Good to see something different than the usual snide article from this publication.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1720871288.0,
    "convurl": "https://external-preview.redd.it/gGJw4Tu4xNwrqHXaDpH-JSf9ORA4GxA4bGy0nb_Vkjo.jpg?auto=webp&s=50b82d762230cbb6cc44cf53ffe4e876ba8ef986",
    "comments": [
        "Oh yes totally.\n\nExcept whats the use when we have kids dying from hunger and starvation just like Bangladesh and pokemonistan \n\nGovt isn't banning sucrose addition in baby formulas as fillers.\n\nThe food prices are at 20% inflation for like last 10 yrs.\n\nA simple kebab available for 1 rupees per kebab in 2010 is like 10 rupees now \nA rumali roti was 1 rupees and now at minimum 5 usually  8-10."
    ],
    "cleaned_text": "worlds next food superpower thoughts topic good see something different usual snide article publication ",
    "cleaned_title": "worlds next food superpower",
    "cleaned_selftext": "thoughts topic good see something different usual snide article publication",
    "cleaned_comments": "oh yes totally except whats use kids dying hunger starvation like bangladesh pokemonistan govt isnt banning sucrose addition baby formulas fillers food prices inflation like last yrs simple kebab available rupees per kebab like rupees rumali roti rupees minimum usually",
    "light_cleaned_title": "The world’s next food superpower",
    "light_cleaned_selftext": "What are your thoughts on this topic? Good to see something different than the usual snide article from this publication.",
    "light_cleaned_comments": "Oh yes totally. Except whats the use when we have kids dying from hunger and starvation just like Bangladesh and pokemonistan Govt isn't banning sucrose addition in baby formulas as fillers. The food prices are at 20% inflation for like last 10 yrs. A simple kebab available for 1 rupees per kebab in 2010 is like 10 rupees now A rumali roti was 1 rupees and now at minimum 5 usually 8-10."
}