{
    "id": "17d079e",
    "title": "Getting the Essence of income disparity in India.",
    "url": "https://www.reddit.com/r/india/comments/17d079e/getting_the_essence_of_income_disparity_in_india/",
    "selftext": "**Disclaimer**: This represents my personal analysis, and I welcome constructive criticism or corrections if any errors are identified. \n\n**Sources and data before going ahead:**\n\n* The top 10% of the Indian population holds 77% of the total national wealth \\[[Oxfam](https://www.oxfam.org/en/india-extreme-inequality-numbers)\\]\n* The top 1% owned more than 40.5% of India's total wealth in 2021 \\[[BBC](https://www.bbc.com/news/world-asia-india-64286673)\\]\n* The wealthiest 10% own more than 72% of wealth, and the top 5% own nearly 62% of the total wealth \\[[IndianExpress](https://indianexpress.com/article/business/economy/indias-richest-1-own-more-than-40-of-total-wealth-oxfam-8384156/)\\]\n* **Between 2012 and 2021, 40% of the wealth created in India has gone to just 1% of the population, while only a mere 3% of the wealth has gone to the bottom 50%** \\[[IndianExpress](https://indianexpress.com/article/business/economy/indias-richest-1-own-more-than-40-of-total-wealth-oxfam-8384156/)\\]\n\n**Some Assumptions based on research and trends:**\n\n* Wealth is not GDP, but there the ratio of GDP to Wealth often comes between 2 to 6, India being a developing country lies at the lower end. Let's take it 3 here for example.\n* Current GDP: $3.73 Trillion\n* Current Population: 1.43 Billion\n\nSo the total wealth of the country can be **stated as $11.19 trillion**, which also aligns with some reports from the IMF.\n\n**Top 10% of the population holds about $8.62 trillion of it, crazy!!**\n\n143 million people have this amount of wealth, which equals a GDP contribution of $2.87 trillion. This means a per capita income of about $20,084.\n\nThe PPP conversion factor for India (GDP PPP/GDP) currently stands at 3.4, which is considerably high. **As a result, the GDP PPP per capita for the top 10% of the population is approximately $68,425, surpassing the GDP per capita (PPP) of the United States, which is $64,702**. This highlights that the top 10% of India's population possesses financial resources almost on par with those in the USA. Although services in India are still developing, there is a noticeable increase in investments in this sector, indicating promising progress and potential for improvement.\n\nThis is somewhat similar to China as well, illustrating that the upper echelon of the population gains purchasing power and, consequently, a better quality of life, akin to that of a developed country. Meanwhile, the situation continues to deteriorate for the bottom 90% in a highly populated nation like ours.\n\n**Conclusion:** If these 14 million people were the only ones in the country, our nation would easily be considered developed, with vast resources and numerous opportunities. Additionally, we are currently witnessing the rise of the middle class and an all-time high growth rate. **However, it is primarily the top 10% who are contributing to or benefiting the most from these positive changes in the end.**",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697886703.0,
    "convurl": "https://external-preview.redd.it/Zq5-Bg_nehiTtfz4wpncDpreJFikbf6dmFlLGtvAsZ4.jpg?auto=webp&s=4e6f21a9fbc1d6f0c9e464e8fecd20fcc54d8066",
    "comments": [
        "How rich would one have to be for being in the top 1%? (And top 10%)",
        "I mean top 10 percent is still 140 million not a small number lol",
        "Yes, this is very true.\n\nThe sad part is the bottom 90 percent are very destitute, which is troubling",
        "Answer I got from google for being in the 1 percent club in india you need to have ₹1.4cr \nCan anyone verify this?",
        "Definitely more then that, especially when your 3bhk bungalow itself costs 1.5-2cr in tier1/tier2 cities.",
        " 1% population is 1.425cr people. Source of above is https://www.knightfrank.com/research/article/2021-03-01-how-much-wealth-gets-you-into-the-global-top-1",
        "That is shared by the whole family.",
        ">Meanwhile, the situation continues to deteriorate for the bottom 90% in a highly populated nation like ours.\n\nIt is not deteriorating in absolute terms but in relative terms. There is improvement but the pace of improvement for the poor is not keeping up with that for the rich. Like before economic liberalization even if you had money you could only get a Maruti 800. So the rich and poor were at par. Now you have facilities for people who can afford them."
    ],
    "cleaned_text": "getting essence income disparity india disclaimer represents personal analysis welcome constructive criticism corrections errors identified sources data going ahead top indian population holds total national wealth oxfamhttpswwwoxfamorgenindiaextremeinequalitynumbers top owned indias total wealth bbchttpswwwbbccomnewsworldasiaindia wealthiest wealth top nearly total wealth indianexpresshttpsindianexpresscomarticlebusinesseconomyindiasrichestownmorethanoftotalwealthoxfam wealth created india gone population mere wealth gone bottom indianexpresshttpsindianexpresscomarticlebusinesseconomyindiasrichestownmorethanoftotalwealthoxfam assumptions based research trends wealth gdp ratio gdp wealth often comes india developing country lies lower end lets take example current gdp trillion current population billion total wealth country stated trillion also aligns reports imf top population holds trillion crazy million people amount wealth equals gdp contribution trillion means per capita income ppp conversion factor india gdp pppgdp currently stands considerably high result gdp ppp per capita top population approximately surpassing gdp per capita ppp united states highlights top indias population possesses financial resources almost par usa although services india still developing noticeable increase investments sector indicating promising progress potential improvement somewhat similar china well illustrating upper echelon population gains purchasing power consequently better quality life akin developed country meanwhile situation continues deteriorate bottom highly populated nation like conclusion million people ones country nation would easily considered developed vast resources numerous opportunities additionally currently witnessing rise middle class alltime high growth rate however primarily top contributing benefiting positive changes end ",
    "cleaned_title": "getting essence income disparity india",
    "cleaned_selftext": "disclaimer represents personal analysis welcome constructive criticism corrections errors identified sources data going ahead top indian population holds total national wealth oxfamhttpswwwoxfamorgenindiaextremeinequalitynumbers top owned indias total wealth bbchttpswwwbbccomnewsworldasiaindia wealthiest wealth top nearly total wealth indianexpresshttpsindianexpresscomarticlebusinesseconomyindiasrichestownmorethanoftotalwealthoxfam wealth created india gone population mere wealth gone bottom indianexpresshttpsindianexpresscomarticlebusinesseconomyindiasrichestownmorethanoftotalwealthoxfam assumptions based research trends wealth gdp ratio gdp wealth often comes india developing country lies lower end lets take example current gdp trillion current population billion total wealth country stated trillion also aligns reports imf top population holds trillion crazy million people amount wealth equals gdp contribution trillion means per capita income ppp conversion factor india gdp pppgdp currently stands considerably high result gdp ppp per capita top population approximately surpassing gdp per capita ppp united states highlights top indias population possesses financial resources almost par usa although services india still developing noticeable increase investments sector indicating promising progress potential improvement somewhat similar china well illustrating upper echelon population gains purchasing power consequently better quality life akin developed country meanwhile situation continues deteriorate bottom highly populated nation like conclusion million people ones country nation would easily considered developed vast resources numerous opportunities additionally currently witnessing rise middle class alltime high growth rate however primarily top contributing benefiting positive changes end",
    "cleaned_comments": "rich would one top top mean top percent still million small number lol yes true sad part bottom percent destitute troubling answer got google percent club india need cr anyone verify definitely especially bhk bungalow costs cr tiertier cities population cr people source shared whole family meanwhile situation continues deteriorate bottom highly populated nation like deteriorating absolute terms relative terms improvement pace improvement poor keeping rich like economic liberalization even money could get maruti rich poor par facilities people afford",
    "light_cleaned_title": "Getting the Essence of income disparity in India.",
    "light_cleaned_selftext": "**Disclaimer**: This represents my personal analysis, and I welcome constructive criticism or corrections if any errors are identified. **Sources and data before going ahead:** * The top 10% of the Indian population holds 77% of the total national wealth \\[[Oxfam](https://www.oxfam.org/en/india-extreme-inequality-numbers)\\] * The top 1% owned more than 40.5% of India's total wealth in 2021 \\[[BBC](https://www.bbc.com/news/world-asia-india-64286673)\\] * The wealthiest 10% own more than 72% of wealth, and the top 5% own nearly 62% of the total wealth \\[[IndianExpress](https://indianexpress.com/article/business/economy/indias-richest-1-own-more-than-40-of-total-wealth-oxfam-8384156/)\\] * **Between 2012 and 2021, 40% of the wealth created in India has gone to just 1% of the population, while only a mere 3% of the wealth has gone to the bottom 50%** \\[[IndianExpress](https://indianexpress.com/article/business/economy/indias-richest-1-own-more-than-40-of-total-wealth-oxfam-8384156/)\\] **Some Assumptions based on research and trends:** * Wealth is not GDP, but there the ratio of GDP to Wealth often comes between 2 to 6, India being a developing country lies at the lower end. Let's take it 3 here for example. * Current GDP: $3.73 Trillion * Current Population: 1.43 Billion So the total wealth of the country can be **stated as $11.19 trillion**, which also aligns with some reports from the IMF. **Top 10% of the population holds about $8.62 trillion of it, crazy!!** 143 million people have this amount of wealth, which equals a GDP contribution of $2.87 trillion. This means a per capita income of about $20,084. The PPP conversion factor for India (GDP PPP/GDP) currently stands at 3.4, which is considerably high. **As a result, the GDP PPP per capita for the top 10% of the population is approximately $68,425, surpassing the GDP per capita (PPP) of the United States, which is $64,702**. This highlights that the top 10% of India's population possesses financial resources almost on par with those in the USA. Although services in India are still developing, there is a noticeable increase in investments in this sector, indicating promising progress and potential for improvement. This is somewhat similar to China as well, illustrating that the upper echelon of the population gains purchasing power and, consequently, a better quality of life, akin to that of a developed country. Meanwhile, the situation continues to deteriorate for the bottom 90% in a highly populated nation like ours. **Conclusion:** If these 14 million people were the only ones in the country, our nation would easily be considered developed, with vast resources and numerous opportunities. Additionally, we are currently witnessing the rise of the middle class and an all-time high growth rate. **However, it is primarily the top 10% who are contributing to or benefiting the most from these positive changes in the end.**",
    "light_cleaned_comments": "How rich would one have to be for being in the top 1%? (And top 10%) I mean top 10 percent is still 140 million not a small number lol Yes, this is very true. The sad part is the bottom 90 percent are very destitute, which is troubling Answer I got from google for being in the 1 percent club in india you need to have ₹1.4cr Can anyone verify this? Definitely more then that, especially when your 3bhk bungalow itself costs 1.5-2cr in tier1/tier2 cities. 1% population is 1.425cr people. Source of above is That is shared by the whole family. >Meanwhile, the situation continues to deteriorate for the bottom 90% in a highly populated nation like ours. It is not deteriorating in absolute terms but in relative terms. There is improvement but the pace of improvement for the poor is not keeping up with that for the rich. Like before economic liberalization even if you had money you could only get a Maruti 800. So the rich and poor were at par. Now you have facilities for people who can afford them."
}