{
    "id": "j7tqlj",
    "title": "Criminal Law Reforms - Many Concerns that need addressing",
    "url": "https://www.reddit.com/r/india/comments/j7tqlj/criminal_law_reforms_many_concerns_that_need/",
    "selftext": "Hello All, the committee responsible for reforms in the Criminal Laws has allowed consultations only until today as the deadline. There are some serious concerns with the way this committee has been constituted and the speed with which they are trying to reform Indian Criminal Laws. As of now, they have the IPC, CRPC and IEA under the scanner.\n\nThe following picture highlights the concerns with this reform committee.\n\nhttps://preview.redd.it/5d0pcwk1f0s51.jpg?width=1739&amp;format=pjpg&amp;auto=webp&amp;s=db9c4a1b3090851acde267634020773e84f49560\n\nPlease take some time to visit [disbandthecommittee.in](https://disbandthecommittee.in) and send in your mails. This is the time to raise our voices.\n\nHere's a video where Anubha Bhonsle explains the issues with this reform committee too. [https://www.youtube.com/watch?v=dftNVOmmdfM](https://www.youtube.com/watch?v=dftNVOmmdfM)",
    "flair": "Policy/Economy",
    "score": 12,
    "num_comments": 3,
    "created_utc": 1602223524,
    "convurl": "https://b.thumbs.redditmedia.com/uidCCbnmpaAJ-CpISFKalGwV6Ie4wbSQS9-ZCvoaMIs.jpg",
    "comments": [
        "Committee under the home ministry? Masterstroke incoming",
        "So basically, 5 guys coordinating on Zoom calls, will rewrite 250 year old laws within 6 months? In a pandemic under Amit Shah's directions? Can't see that going wrong...",
        "Exactly.. We know how much the Home Ministry cares about laws that support people."
    ],
    "cleaned_text": "criminal law reforms many concerns need addressing hello committee responsible reforms criminal laws allowed consultations today deadline serious concerns way committee constituted speed trying reform indian criminal laws ipc crpc iea scanner following picture highlights concerns reform committee please take time visit disbandthecommitteeinhttpsdisbandthecommitteein send mails time raise voices heres video anubha bhonsle explains issues reform committee httpswwwyoutubecomwatchvdftnvommdfmhttpswwwyoutubecomwatchvdftnvommdfm ",
    "cleaned_title": "criminal law reforms many concerns need addressing",
    "cleaned_selftext": "hello committee responsible reforms criminal laws allowed consultations today deadline serious concerns way committee constituted speed trying reform indian criminal laws ipc crpc iea scanner following picture highlights concerns reform committee please take time visit disbandthecommitteeinhttpsdisbandthecommitteein send mails time raise voices heres video anubha bhonsle explains issues reform committee httpswwwyoutubecomwatchvdftnvommdfmhttpswwwyoutubecomwatchvdftnvommdfm",
    "cleaned_comments": "committee home ministry masterstroke incoming basically guys coordinating zoom calls rewrite year old laws within months pandemic amit shahs directions cant see going wrong exactly know much home ministry cares laws support people",
    "light_cleaned_title": "Criminal Law Reforms - Many Concerns that need addressing",
    "light_cleaned_selftext": "Hello All, the committee responsible for reforms in the Criminal Laws has allowed consultations only until today as the deadline. There are some serious concerns with the way this committee has been constituted and the speed with which they are trying to reform Indian Criminal Laws. As of now, they have the IPC, CRPC and IEA under the scanner. The following picture highlights the concerns with this reform committee. Please take some time to visit [disbandthecommittee.in](https://disbandthecommittee.in) and send in your mails. This is the time to raise our voices. Here's a video where Anubha Bhonsle explains the issues with this reform committee too. [https://www.youtube.com/watch?v=dftNVOmmdfM](https://www.youtube.com/watch?v=dftNVOmmdfM)",
    "light_cleaned_comments": "Committee under the home ministry? Masterstroke incoming So basically, 5 guys coordinating on Zoom calls, will rewrite 250 year old laws within 6 months? In a pandemic under Amit Shah's directions? Can't see that going wrong... Exactly.. We know how much the Home Ministry cares about laws that support people."
}