{
    "id": "13kkkpr",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/13kkkpr/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&format=png&auto=webp&v=enabled&s=79f0d698e4abf87f45628ddd3057be3fe4b83435",
    "flair": "Scheduled",
    "score": 17,
    "num_comments": 7,
    "created_utc": 1684373411.0,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "Hiring Sales agents for established SaaS company\n\nWork from home\n\nMust understand Lead Generation, sales calls, deal closing etc.\n\nDM for more details",
        "Hiring .Net + Azure Developers, 3+ YoE based out of Bangalore. This is for a Big 4.\nDM me for more details.",
        "How much experience are you looking for?",
        "[B.COM](https://B.COM) graduate 2018. Haven't had a job till now. I have been learning web development But with the recent advancement in technology. I think having a proper degree will be good. Thinking enrolling in IIT madras online degree program. Need some guidance. I plan to work and study through the degree. Can people  who have industry experience give some guidance?",
        "No minimum requirement",
        "I see a section for gaming but do you also have section for game development?"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall",
    "cleaned_comments": "hiring sales agents established saas company work home must understand lead generation sales calls deal closing etc dm details hiring net azure developers yoe based bangalore big dm details much experience looking bcomhttpsbcom graduate havent job till learning web development recent advancement technology think proper degree good thinking enrolling iit madras online degree program need guidance plan work study degree people industry experience give guidance minimum requirement see section gaming also section game development",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Hiring Sales agents for established SaaS company Work from home Must understand Lead Generation, sales calls, deal closing etc. DM for more details Hiring .Net + Azure Developers, 3+ YoE based out of Bangalore. This is for a Big 4. DM me for more details. How much experience are you looking for? [B.COM](https://B.COM) graduate 2018. Haven't had a job till now. I have been learning web development But with the recent advancement in technology. I think having a proper degree will be good. Thinking enrolling in IIT madras online degree program. Need some guidance. I plan to work and study through the degree. Can people who have industry experience give some guidance? No minimum requirement I see a section for gaming but do you also have section for game development?"
}