{
    "id": "15w5zkm",
    "title": "Dog oozing with the blood from the eye",
    "url": "https://www.reddit.com/gallery/15w5zkm",
    "selftext": "I saw this dog in rangehills pune area. His eye is oozing with blood. I tried to feed him and thankfully he ate it. I had a word with vet and now I'm taking him to the hospital for the treatment. I'll need an ambulance or pet taxi to take him to the hospital. Ambulance is charging 1500. Since I'm student, its quite expensive for me. Can anyone assist taking him to the hospital?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692520794.0,
    "convurl": "https://i.redd.it/phqqz45a98jb1.jpg",
    "comments": [
        "While i cant help in any way but hope someone else help u here but should've put the pic as nsfw or atleast a spoiler op.",
        "thanks, please keep him in prayers"
    ],
    "cleaned_text": "dog oozing blood eye saw dog rangehills pune area eye oozing blood tried feed thankfully ate word vet im taking hospital treatment ill need ambulance pet taxi take hospital ambulance charging since im student quite expensive anyone assist taking hospital ",
    "cleaned_title": "dog oozing blood eye",
    "cleaned_selftext": "saw dog rangehills pune area eye oozing blood tried feed thankfully ate word vet im taking hospital treatment ill need ambulance pet taxi take hospital ambulance charging since im student quite expensive anyone assist taking hospital",
    "cleaned_comments": "cant help way hope someone else help u shouldve put pic nsfw atleast spoiler op thanks please keep prayers",
    "light_cleaned_title": "Dog oozing with the blood from the eye",
    "light_cleaned_selftext": "I saw this dog in rangehills pune area. His eye is oozing with blood. I tried to feed him and thankfully he ate it. I had a word with vet and now I'm taking him to the hospital for the treatment. I'll need an ambulance or pet taxi to take him to the hospital. Ambulance is charging 1500. Since I'm student, its quite expensive for me. Can anyone assist taking him to the hospital?",
    "light_cleaned_comments": "While i cant help in any way but hope someone else help u here but should've put the pic as nsfw or atleast a spoiler op. thanks, please keep him in prayers"
}