{
    "id": "1655kx6",
    "title": "ARCHIES film cast blocks WESTERN EXPRESS HIGHWAY of Mumbai for movie promotions. The corrupt cops beat the public for walking on Public sidewalk cause shah Rukh khan doesn’t like peasants on the public roads and sidewalks paid for by the public",
    "url": "https://www.reddit.com/r/india/comments/1655kx6/archies_film_cast_blocks_western_express_highway/",
    "selftext": "For those of you not familiar with Mumbai. Western Express Highway is the main arterial road that everyone uses to travel from suburbs to the financial district, airport and so on. \n\nArchies film cast blocked the road to make a cringe promotional video for their show. \n\nWhy hasn’t the Mumbai police registered an FIR or beat them just like they beat innocent tax payers from walking on the bandstand public side walks ? \n\nIt’s clearly a system designed for the rich and elite class who can do whatever they want even if it means disrupting the busiest road on Mumbai. \n\nhttps://www.indiatimes.com/amp/entertainment/binge/suhana-khan-khushi-kapoor-announce-the-archies-release-date-613448.html",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693372390.0,
    "convurl": "https://external-preview.redd.it/KlC9BRfGXX7zRx_AIg1vDhB3F3LY46tcio0QkcZWBto.jpg?auto=webp&s=df5a9c54f6f4f4a491870b3205f324ef9f8bf7b2",
    "comments": [
        "I'm getting tired of srk in long hair."
    ],
    "cleaned_text": "archies film cast blocks western express highway mumbai movie promotions corrupt cops beat public walking public sidewalk cause shah rukh khan doesnt like peasants public roads sidewalks paid public familiar mumbai western express highway main arterial road everyone uses travel suburbs financial district airport archies film cast blocked road make cringe promotional video show hasnt mumbai police registered fir beat like beat innocent tax payers walking bandstand public side walks clearly system designed rich elite class whatever want even means disrupting busiest road mumbai ",
    "cleaned_title": "archies film cast blocks western express highway mumbai movie promotions corrupt cops beat public walking public sidewalk cause shah rukh khan doesnt like peasants public roads sidewalks paid public",
    "cleaned_selftext": "familiar mumbai western express highway main arterial road everyone uses travel suburbs financial district airport archies film cast blocked road make cringe promotional video show hasnt mumbai police registered fir beat like beat innocent tax payers walking bandstand public side walks clearly system designed rich elite class whatever want even means disrupting busiest road mumbai",
    "cleaned_comments": "im getting tired srk long hair",
    "light_cleaned_title": "ARCHIES film cast blocks WESTERN EXPRESS HIGHWAY of Mumbai for movie promotions. The corrupt cops beat the public for walking on Public sidewalk cause shah Rukh khan doesn’t like peasants on the public roads and sidewalks paid for by the public",
    "light_cleaned_selftext": "For those of you not familiar with Mumbai. Western Express Highway is the main arterial road that everyone uses to travel from suburbs to the financial district, airport and so on. Archies film cast blocked the road to make a cringe promotional video for their show. Why hasn’t the Mumbai police registered an FIR or beat them just like they beat innocent tax payers from walking on the bandstand public side walks ? It’s clearly a system designed for the rich and elite class who can do whatever they want even if it means disrupting the busiest road on Mumbai.",
    "light_cleaned_comments": "I'm getting tired of srk in long hair."
}