{
    "id": "1fyyif1",
    "title": "Must watch: Why India can’t grow like China ",
    "url": "https://youtu.be/srVMf9JlpR8?si=zHqmgWcyb9DpzCFX",
    "selftext": "“India is not a nation”\n“I would much prefer working with the Chinese and China”\nThese are some of the quotes from people like Charlie Munger (Warren Buffet’s partner) and Lee Kuan Yew (transformational leader of Singapore) \n\nEvery Indian must watch this video. Take it in their stride and have an honest dialogue on why India is unable to reach its potential. \n\nThe CASTE system is killing us. People world over look down upon India because of this. A lot of times this is the first and only thing they know of India. High time people give up these tags to hit our potential.\n\nGENDER EQUALITY is not translating into economic output due to the horrible violence we see against women. We need all the brains of the country!\n\nINFIGHTING We are busy fighting about our languages and cultures. When countries need one language to have an effective economic leadership and coordination. We can celebrate our languages but should have a common language applicable to all. I don’t care if it’s English, Hindi, Tamil or whatever. \n\nMEDIOCRITY, LACK OF QUALITY, SHORT SIGHTEDNESS, FAKE PRIDE, DIRTINESS…\n\nWe have to invest in Human Capital through quality education, research, nutrition and health. \n\nWe can’t keep blaming politicians. Only when people realize and adopt these principles will the politicians change. \n",
    "flair": "Policy/Economy",
    "score": 8,
    "num_comments": 10,
    "created_utc": 1728390309.0,
    "convurl": "https://external-preview.redd.it/8EHBXDUGLfESIrhIXz6cGe5Rqip2M7z6HtUJzFu4HCM.jpg?auto=webp&s=0062349a4b19089625eca8f35bcde30b5d8fae0d",
    "comments": [
        "We cannot. That’s it. Accept it. Move on.",
        "You don't want to grow like China. That country is in fucking shambles selling shitty products and scamming it's own populace to keep itself afloat. The China powerhouse exists because of its low prices which it achieves by providing terrible products. That's the reality of it.\n\n\n\n\nWe should focus on making quality products. And not salivate at the mindless chest thumping China does",
        "We should stop discounting everything that an adversary does, just because. China has many flaws just like even the US does.\n\nBut to correct your point, China did indeed start at the bottom of the value chain through low cost, low quality, low innovation products. But they have gone far past it. They are a research power house and build some of the most cutting edge stuff with very high quality and precision. I can speak to it with first hand knowledge.\n\nWe don’t need to be inspired by or despise China. This is about us. The point to take is that we are unable to hit our potential due to faults which are rightly pointed.",
        "Not even try? Not to compete with China or someone else. But just for ourselves. To live up to our own potential. “Aim for the starts, maybe you will reach the sky”.",
        "I'd rather get out of this country, thanks",
        "Sorry if I’m being cynical. I can’t see us competing. It’s just a broken man talking though.",
        "I say that in respect to what they have had to do to get where they are. China is a very very exploitative country. Slave labor, sweat shops, perhaps the most brutal work conditions that can only be rivaled by Africa.\n\n\n\n Should we look into ourself and do better? Yea. Using China as an example however is absolutely not the way. \n\n\n\nWe have lots of ways to go about employing and growing that doesn’t require taking the most extreme of steps. I hope development while protecting human rights isn’t a controversial statement",
        "I agree. I don’t think any of the points mentioned violate human rights. Only improve it. The points referred are valid and indeed holding us back.",
        "I'd rather get \"Made in China\" product than \"Made in India\". At least that shitty product works decent enough for what its worth.\n\nNot that I am agaist India's progress. But, I see more efforts put into scamming people out off their hard-earned money than making a decent product."
    ],
    "cleaned_text": "must watch india cant grow like china india nation would much prefer working chinese china quotes people like charlie munger warren buffets partner lee kuan yew transformational leader singapore every indian must watch video take stride honest dialogue india unable reach potential caste system killing us people world look upon india lot times first thing know india high time people give tags hit potential gender equality translating economic output due horrible violence see women need brains country infighting busy fighting languages cultures countries need one language effective economic leadership coordination celebrate languages common language applicable dont care english hindi tamil whatever mediocrity lack quality short sightedness fake pride dirtiness invest human capital quality education research nutrition health cant keep blaming politicians people realize adopt principles politicians change ",
    "cleaned_title": "must watch india cant grow like china",
    "cleaned_selftext": "india nation would much prefer working chinese china quotes people like charlie munger warren buffets partner lee kuan yew transformational leader singapore every indian must watch video take stride honest dialogue india unable reach potential caste system killing us people world look upon india lot times first thing know india high time people give tags hit potential gender equality translating economic output due horrible violence see women need brains country infighting busy fighting languages cultures countries need one language effective economic leadership coordination celebrate languages common language applicable dont care english hindi tamil whatever mediocrity lack quality short sightedness fake pride dirtiness invest human capital quality education research nutrition health cant keep blaming politicians people realize adopt principles politicians change",
    "cleaned_comments": "thats accept move dont want grow like china country fucking shambles selling shitty products scamming populace keep afloat china powerhouse exists low prices achieves providing terrible products thats reality focus making quality products salivate mindless chest thumping china stop discounting everything adversary china many flaws like even us correct point china indeed start bottom value chain low cost low quality low innovation products gone far past research power house build cutting edge stuff high quality precision speak first hand knowledge dont need inspired despise china us point take unable hit potential due faults rightly pointed even try compete china someone else live potential aim starts maybe reach sky id rather get country thanks sorry im cynical cant see us competing broken man talking though say respect get china exploitative country slave labor sweat shops perhaps brutal work conditions rivaled africa look ourself better yea using china example however absolutely way lots ways go employing growing doesnt require taking extreme steps hope development protecting human rights isnt controversial statement agree dont think points mentioned violate human rights improve points referred valid indeed holding us back id rather get made china product made india least shitty product works decent enough worth agaist indias progress see efforts put scamming people hardearned money making decent product",
    "light_cleaned_title": "Must watch: Why India can’t grow like China",
    "light_cleaned_selftext": "“India is not a nation” “I would much prefer working with the Chinese and China” These are some of the quotes from people like Charlie Munger (Warren Buffet’s partner) and Lee Kuan Yew (transformational leader of Singapore) Every Indian must watch this video. Take it in their stride and have an honest dialogue on why India is unable to reach its potential. The CASTE system is killing us. People world over look down upon India because of this. A lot of times this is the first and only thing they know of India. High time people give up these tags to hit our potential. GENDER EQUALITY is not translating into economic output due to the horrible violence we see against women. We need all the brains of the country! INFIGHTING We are busy fighting about our languages and cultures. When countries need one language to have an effective economic leadership and coordination. We can celebrate our languages but should have a common language applicable to all. I don’t care if it’s English, Hindi, Tamil or whatever. MEDIOCRITY, LACK OF QUALITY, SHORT SIGHTEDNESS, FAKE PRIDE, DIRTINESS… We have to invest in Human Capital through quality education, research, nutrition and health. We can’t keep blaming politicians. Only when people realize and adopt these principles will the politicians change.",
    "light_cleaned_comments": "We cannot. That’s it. Accept it. Move on. You don't want to grow like China. That country is in fucking shambles selling shitty products and scamming it's own populace to keep itself afloat. The China powerhouse exists because of its low prices which it achieves by providing terrible products. That's the reality of it. We should focus on making quality products. And not salivate at the mindless chest thumping China does We should stop discounting everything that an adversary does, just because. China has many flaws just like even the US does. But to correct your point, China did indeed start at the bottom of the value chain through low cost, low quality, low innovation products. But they have gone far past it. They are a research power house and build some of the most cutting edge stuff with very high quality and precision. I can speak to it with first hand knowledge. We don’t need to be inspired by or despise China. This is about us. The point to take is that we are unable to hit our potential due to faults which are rightly pointed. Not even try? Not to compete with China or someone else. But just for ourselves. To live up to our own potential. “Aim for the starts, maybe you will reach the sky”. I'd rather get out of this country, thanks Sorry if I’m being cynical. I can’t see us competing. It’s just a broken man talking though. I say that in respect to what they have had to do to get where they are. China is a very very exploitative country. Slave labor, sweat shops, perhaps the most brutal work conditions that can only be rivaled by Africa. Should we look into ourself and do better? Yea. Using China as an example however is absolutely not the way. We have lots of ways to go about employing and growing that doesn’t require taking the most extreme of steps. I hope development while protecting human rights isn’t a controversial statement I agree. I don’t think any of the points mentioned violate human rights. Only improve it. The points referred are valid and indeed holding us back. I'd rather get \"Made in China\" product than \"Made in India\". At least that shitty product works decent enough for what its worth. Not that I am agaist India's progress. But, I see more efforts put into scamming people out off their hard-earned money than making a decent product."
}