{
    "id": "18wmt4k",
    "title": "Queues at fuel pumps, some running dry, amid nationwide strike by truckers",
    "url": "https://www.hindustantimes.com/india-news/fuel-pumps-running-dry-across-india-amid-widespread-protests-bytruckdrivers-101704187355024.html",
    "selftext": "The beginning of the end. The laws central government is implementing without discussions in parliament without opposition will soon create such situations frequently.\n\nAtleast in mumbai petrol pumps are dry. Traffic everywhere and its not even peak time.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1704193037.0,
    "convurl": "https://external-preview.redd.it/X_D02-yPiW-LmU0RWYxiVdP1Cao6he_sDfVc0vjiYUU.jpg?auto=webp&s=b369240fd0272b7ca60fe95c0b5707bd1efd2876",
    "comments": [
        "Same situation in Punjab and Delhi as well. I just filled up both my cars.",
        "Clowns protesting for right to hit & run without repercussions.",
        "It’s not necessary that only truckers or car drivers are at fault in every accident. The way of issuing driving license to individuals is very dangerous rn in the country. Proper tests, road/traffic knowledge is not taken into consideration at the RTO offices. The government should look into these matters before making such laws. It’s very well known how corrupt the rto is across the country. Such laws are great in countries where the citizens are disciplined willingly, not because of fear of law. In India, people don’t even know how to drive safely.",
        "This country is never ever competing with Vietnam, China or Indonesia in terms of getting manufacturing investments at this rate. Everyday everyone wants to protest and not follow any law or regulations",
        "Nah. That's the failure of law and order which is common in India. The fact that a group of people can disrupt the supply chain of a critical resource speaks volumes about India's infrastructure problems. The government must heavily invest alternate transport modes."
    ],
    "cleaned_text": "queues fuel pumps running dry amid nationwide strike truckers beginning end laws central government implementing without discussions parliament without opposition soon create situations frequently atleast mumbai petrol pumps dry traffic everywhere even peak time ",
    "cleaned_title": "queues fuel pumps running dry amid nationwide strike truckers",
    "cleaned_selftext": "beginning end laws central government implementing without discussions parliament without opposition soon create situations frequently atleast mumbai petrol pumps dry traffic everywhere even peak time",
    "cleaned_comments": "situation punjab delhi well filled cars clowns protesting right hit run without repercussions necessary truckers car drivers fault every accident way issuing driving license individuals dangerous rn country proper tests roadtraffic knowledge taken consideration rto offices government look matters making laws well known corrupt rto across country laws great countries citizens disciplined willingly fear law india people dont even know drive safely country never ever competing vietnam china indonesia terms getting manufacturing investments rate everyday everyone wants protest follow law regulations nah thats failure law order common india fact group people disrupt supply chain critical resource speaks volumes indias infrastructure problems government must heavily invest alternate transport modes",
    "light_cleaned_title": "Queues at fuel pumps, some running dry, amid nationwide strike by truckers",
    "light_cleaned_selftext": "The beginning of the end. The laws central government is implementing without discussions in parliament without opposition will soon create such situations frequently. Atleast in mumbai petrol pumps are dry. Traffic everywhere and its not even peak time.",
    "light_cleaned_comments": "Same situation in Punjab and Delhi as well. I just filled up both my cars. Clowns protesting for right to hit & run without repercussions. It’s not necessary that only truckers or car drivers are at fault in every accident. The way of issuing driving license to individuals is very dangerous rn in the country. Proper tests, road/traffic knowledge is not taken into consideration at the RTO offices. The government should look into these matters before making such laws. It’s very well known how corrupt the rto is across the country. Such laws are great in countries where the citizens are disciplined willingly, not because of fear of law. In India, people don’t even know how to drive safely. This country is never ever competing with Vietnam, China or Indonesia in terms of getting manufacturing investments at this rate. Everyday everyone wants to protest and not follow any law or regulations Nah. That's the failure of law and order which is common in India. The fact that a group of people can disrupt the supply chain of a critical resource speaks volumes about India's infrastructure problems. The government must heavily invest alternate transport modes."
}