{
    "id": "1h1bgic",
    "title": "Election Commission of India Compromised",
    "url": "https://www.reddit.com/r/india/comments/1h1bgic/election_commission_of_india_compromised/",
    "selftext": "**The Honest Election Commissioner**   \nAshok Lavasa, an election commissioner between 2018 and 2020, dissented against Modi and Shah's behaviour, and he and his family were witch-hunted by the Income-Tax Department [\\[1\\].](https://frontline.thehindu.com/cover-story/article29618205.ece)\n\n**Modi's Man**\n\nRajiv Kumar, a former finance secretary, was appointed as CEC in 2022 during the Modi government [\\[2\\]](https://indianexpress.com/article/india/rajiv-kumar-chief-election-commissioner-7913065/).\n\n**Change in Law**\n\nIn December 2023, the Modi government rammed the CEC and Other Election Commissioners Bill, 2023, through Parliament. The bill eliminated the Chief Justice of India's inclusion in the selection of Election Commissioners [\\[3\\]](https://www.livemint.com/news/india/lok-sabha-passes-bill-on-appointment-of-chief-election-commissioner-election-commissioners-parliament-winter-session-11703148084130.html). \n\n**More Yes Men**\n\nIn March 2024, Modi and Shah appointed Gyanesh Kumar, Sukhbir Singh Sandhu as Election Commissioners. The then leader of opposition, Adhir Ranjan Chowdhury submitted a dissent note asshortlisted names were shared with him just 10 minutes before the meeting [\\[4\\]](https://www.thehindu.com/news/national/ex-bureaucrats-sukhbir-sandhu-gyanesh-kumar-named-election-commissioners/article67949991.ece). \n\n\n\nSource: \n\n\\[1\\] [https://frontline.thehindu.com/cover-story/article29618205.ece](https://frontline.thehindu.com/cover-story/article29618205.ece) \n\n\\[2\\] [https://indianexpress.com/article/india/rajiv-kumar-chief-election-commissioner-7913065/](https://indianexpress.com/article/india/rajiv-kumar-chief-election-commissioner-7913065/) \n\n\\[3\\] [https://www.livemint.com/news/india/lok-sabha-passes-bill-on-appointment-of-chief-election-commissioner-election-commissioners-parliament-winter-session-11703148084130.html](https://www.livemint.com/news/india/lok-sabha-passes-bill-on-appointment-of-chief-election-commissioner-election-commissioners-parliament-winter-session-11703148084130.html)\n\n\\[4\\] [https://www.thehindu.com/news/national/ex-bureaucrats-sukhbir-sandhu-gyanesh-kumar-named-election-commissioners/article67949991.ece](https://www.thehindu.com/news/national/ex-bureaucrats-sukhbir-sandhu-gyanesh-kumar-named-election-commissioners/article67949991.ece)\n\n",
    "flair": "Rant / Vent",
    "score": 557,
    "num_comments": 120,
    "created_utc": 1732732752.0,
    "convurl": "https://external-preview.redd.it/1QcXBzExURD2Lg40zr6S4l-89ukaEgkcIQd8Ui15Qh4.jpg?auto=webp&s=89b639c2b805b7f695a04170ff84180207f0e8af",
    "comments": [
        "Shout all you want with reports & facts, still will remain a conspiracy theory. We just want more temples and minorities beaten and shot.",
        "Great post!\n\n\nThere are still various idiots who ironically can't fathom the fact that the EVMs can be compromised when the entire ECI has been compromised already. \n\n\n\nThe institution has been compromised but the machines under their control are completely fair and unbiased, saar! Yeah, right.",
        "There have been multiple opportunities given for anyone to come and try hack/inspect the EVMs. No one could do it. So I'd imagine the machines are fair and unbiased. Saar.",
        "The ECI stated in the terms and conditions of that stupid \"Challenge\" that you can't even touch the machine. In order to hack something you first need to know about its schematic and code both of which were not provided to the parties, so how exactly could they hack it? It's reminiscent of giving a test without knowing the syllabus. \n\n\n\nWhat action was taken exactly against BJ party workers' with whom the EVMs were found in Maha elections? What action was taken against the BJ party member who was distributing money blatantly in a hotel and actively violating the MCC? I'll tell you, the police came to disperse the crowd and didn't even arrest him.\n\n\n\nThe ECI hasn't even specified all companies involved in manufacturing the EVM and the 2 companies which we are aware of are under the control of the Ministry of Defense which falls under the control of the ruling party. How can neutrality be ensured then?\n\n\nLink for above- https://www.business-standard.com/elections/lok-sabha-election/ecil-bel-refuse-to-disclose-names-of-manufacturers-of-evm-vvpat-parts-124042400684_1.html\n\n\n\nCountries like The Netherlands have even phased out EVMs in 2007 as they found that they could be tampered with easily.",
        "This is the easiest way to manipulate a billion people. Own all the major.media channels so they hear what you what them to hear. Creat a false sense of frenzy for an incompetent PM. They know that their Hindu Muslim angle has limited shelf life espec6after they remain incumbent for a decade plus years and still things get worse. \n\nThe unfortunate thing is that people take election verdicts as a guarantee of popularity when it's so clear that they've bought over the entire ma hinery including ECI and babus",
        "New toolkit just dropped.",
        "I guess this ECI is too lazy and needs to be changed since it didn't work in J&K or in Karnataka, TN or Jharkhand? /s",
        "Point 3 is just blatantly misinformation. The chief justice was never involved in the selection of the ECs. The supreme Court shat all over the constitution to force themselves into that process and parliament rightly fixed it by pushing them back out. The supreme Court has a nasty habit of inventing unconstitutional systems with no legal basis just to give itself more authority.",
        "Amd there are those who have hacked it outside of the restrictive time base event held by ECI.",
        "I was not aware of this. Could you share a news article or any technical paper on that?",
        "duh thats obvious.",
        "Why don't they just build a place where minorities can be sent specifically for this purpose - they can call it a \"camp\", or \"lager\" if they want to be fancy & use some foreign word (/s)",
        "Why did they lose in Karnataka, Jammu & kashmir and Jharkhand recently?",
        "NO. The point is that it's much easier to compromise ballot papers than EVM. One can moan about any number of problems in India but unless they have a better solution they need to stfu.\n\nI guarantee that if the BJP introduces ballot papers the first people opposing it would be the opposition because the BJP machinery is much more powerful than Congress now. This ain't 1970.",
        "Netherlands evms were different from the indian ones they weren't standalone like the indian ones.",
        "Watch the imitation game",
        "My man, that's not true at all..EVM is a much easier target to compromise.",
        "It’s still hard to believe that there is not a single whistleblower who can get evidence against EVM. Maybe congress should pay an insider to get good evidence that can be presented to Supreme Court.",
        "Fear of rebuttal. They have still won seats they shouldn't have",
        "If EVM is compromised by BJP why did they lose heavily in Lok Sabha elections and other states. Try something else sucker !",
        "You are smart country you will fix it unlike Pakistan.",
        "Until the supreme Court order, every CEC was appointed by the PM of the day. The court order instructed the government to form an appointment process and to make a three person committee and to include the Leader of opposition in the CEC appointment process, and until the new committee was formed the CJ was to stay in this CEC appointment process. CJ wasn't supposed to stay in that role permanently. The government formed a new committee with PM, HM (technically a minister the PM nominates), and the LOP as the three members. To clarify Ashok Lavassa was hand picked by PM Modi and so were the  guys before and after. The current CEC is appointed by the new committee and in this and every other future and past CEC appointments, the candidates favored by the government was/will be appointed. Now, the opposition has a means to express their opinions but it never had/will hold much impact as the government has the votes to override the opposition. \n\nYour point about Lavassa being targeted by the income tax might carry some weight but the overall idea that suddenly the PM got power hungry and overrode the supreme Court order and removed the chief justice from the committee is total bullshit. Chief justices have no role in appointing the CEC, them inserting themselves was a judicial over reach. In fact in the western world (US for example) the justices themselves are appointed by the elected representatives of the country, in India justices appoint themselves through their collegium which should be illegal. As no other branch of the government has an oversight of the judiciary in India.",
        "Why couldn't they win a single seat in Tamil Nadu.",
        "how come supreme court allowed the desecration of election commission?",
        "Machiavellian ends justify all means. Absolute powers corrupts absolutely.",
        "Possibilities:\n\nPossibility 1. If they exchange the machine \n\nScenario 1. They exchange the machines after the mock polling.\n\nScenario 2. Exchange the machine even before the mock polling.\n\nPossibility 2. If they Temper with the machine.\n\nScenario 1 : machine gives more votes to a party like 1:2 or something.\n\nScenario 2 : same machine but at the polling booth more votes are given by booth management of polling officials.\n\nIt's likely they use all the above method for different states and constituency.\n\nThey do this to prevent too much discontent among the voters.\n\nThis explains why in some places more polling Booths are compromised as the method of compromise was different at different places.",
        "This is just another “EVM hacked” kinda excuse. Blame the opposition. They’ll keep losing big as long as you keep defending them.",
        "RSS wanted to teach a lesson to the supreme leader.",
        "As someone who has worked as preceding officer in both election booths and counting centres , this comment is beyond stupid.",
        "When did you work as one and where ? \n\nBecause things change man.",
        "Bruh. Indian EVMs are nothing like the Western/American ones where they're using modern consumer tech like phones, faxes connected to a vulnerable common civilian networks and protocols. \n\nOur EVMs are a glorified electronic abacus. They store a count of the votes in electronic format and most importantly, accessible ONLY physically when voting.\n\nTheir reliability is proven by the fact that no party has ever proven any fault with EVMs. It's much easier to just capture booths like they do in WB or voter intimidation like in UP, than mess with EVMs.\n\nAll we have at this time are laughable allegations like OP. Apparently the sitting government appointing their own guy at EC is somehow suspicious because political patronage was invented by the BJP 😂",
        "This is the kind of discourse which is making the opposition look like a joker and is in fact helping the BJP\n\nI would rather ask you to focus your efforts on making the opposition accountable to its failure and work on improvement points",
        "You need to stfu without any knowledge. \n\nEvm is a machine which can be compromised with public knowledge. Ballot if rigged by muscles will somehow video's will make into social media. Passport ballot should be returned. Chandigarh mayor ejection is a prime example where the protector turned into killer of democracy. Hadn't it be for paper ballot fraud caught on camera, he would have gone Scott free. \n\nSo i once again say to your gfys.",
        "Election hacking has been happening since 2019. People were made to believe that the Balakot strikes gave BJP above 400 seats. Cannot believe that they voted enmasse for BJP after the demonetization disaster. ",
        "There’s always a very thin line between Babus and politicians. Even the famed non partisan CEC Mr. TN Seshan went on to join INC just a year after retiring.",
        "No one's saying all EVMs are compromised all of the time. Manipulation of a small number of EVMs can also result in a big difference in the final seats and be the difference between a party losing power or maintaining majority. The fear is that the ruling party has the power to do this as and when they feel necessary.",
        "They didn't lose the lok sabha election though? They won 240 seats which was more the entire opposition and did form the government.",
        "Being one of the private citizen who was roped into conducting the Maharashtra polls as one of the official poll booth officer I can describe the procedure of conducting the polls on EVM machine .This polls was fully webcasted and video streamed throughout its duration .\n\nEarly morning the EVM VPAT and control unit is connected .Then we conduct a mock poll with minimum 50 votes that is cross checked with the booth agent of respective parties.This is cross checked with the VVPAT slips that is printed.Also each candidate is given minimum 2 votes each.\n\nThe device is then cleared and sealed in front of the agent and the seal numbers are noted.The device is started at 7:00am sharp and the whole voting is done.Each voter count is recorded in a book called 17C which will be tallied with the number of votes.Later all this information is recorded and also given to each polling booth agent.\n\nEach booth has minimum 5 people to do all this work .It is highly improbable to go manipulate the results of EVM without the connivance of the poll booth officials .If any government is able to do this then paper vote is also not going to help.\n\nBeing a political neutral person what we had seen  in that booth that day is BJP agents being proactive in getting people to vote and the ladki been scheme.We should put the manipulation of EVM to rest because there is no better alternative to it.(Millenial kids talking of ballot papers should be revisit articles of election prior to 2000 )",
        "This post was needed.",
        "You are like you audience of a magic show believing that the magician has real super powers.. \n\nThe fact is that there was no BJP wave in Maharashtra... In Modi's rallies in the state more than 60% of seats were empty despite mobilisation by karyalartas...\n\nBooth mobilisation is a bullshit logic as the people bought to the booth can vote for anyone... unless you have paid them and know that they are going to vote for you...\n\n78 lakh additional votes in the last hour is logistically not possible...\n\nIn 2014 and 2019 assembly elections the last hour polling was around 0.5%. .. far from the 8% that happened in 2024...",
        "Untill unless BJP doesn't win any seats, you will still say that they congress have not won fairly? Wow",
        "The national elections almost proved it. There is something very fishy with our EVMs",
        "What public knowledge? Maybe the thing is paper ballot was so easy to fraud that the person even did it on the first place, you will it can be conpromised but that isn't true.",
        "This guy needs medical help. You’re already into civil war 🤣🤣",
        "I never said congress haven't won fairly. I am implying if they can cheat why leave karnataka? Especially at a time when there is language politics going on there? And it is a state with huge contribution to India.",
        "You are using the Modi Tactics of just abusing or infatilising the person instead of talking on the subject. Also being an engineer myself in the field where EVM are designed I can claim to at least be sure of no tampering happening.If you like ballot votes please do and explain then how will you stop the tampering .\n\nThe additional votes are because some booths votes are not tallied or delayed and information is not uploaded because of the sheer number of booths. \n\nI have put a point to explain that it is very hard to manipulate the EVM without anybody knowing since there is huge number of personnel deputed but still you want to believe that it is manipulated it is OK .",
        "Stfu, let's say evm's can't be compromised but they can be replaced easily. Also EVM's were not made by God it's an man made machine and can be manipulated just like your thick brain.",
        "Because numbers were against them, rigging those elections would have caused a nation wide protest.",
        "Who told you that? BJP owned media??",
        "Even if there is, how do you expect him to voice his concerns without getting jailed or disappearing overnight ? Through opposition? or through godi media? Or courts that turned law into a joke ??",
        "Has any of the parties provided reliable proof apart from subah ko I was winning but sha ko I was trailing type of proofs.\nThe shivsena UBT has asked.fo4 verification of vvpata Let us  see how EC responds .\nNot saying there is no chance of manipulation but it the clear.case.of boy crying wolf in this case if it actually turns out to be true",
        "When ballot papers are counted on the same night while machines require 2 months, you know it is compromised.",
        "Please. There is tampering for sure. EVM or otherwise.",
        "Have they in Turkey, in Hungry, in Russia?",
        "They cheated in 79 seats during the Lok Sabha. There is an entire paper on this. Go and check it out yourself.",
        "\n\nThe judges are recommend at the HC level,  then the SC level and then sent to the government. The appointments are made by the President, who is in effect appointed by the government. \n\nOver time,  a collegium could entire be composed of members appointed by a specific government. \n\nWhile what you say about the CJI is true, it does raise an eyebrow when the government tries to get rid of him in the process. In conjunction with other facts, the government's behaviour must be questioned?",
        "We, the People of India, are asking questions.\n\nIt is a fact that there was no on the ground wave for the BJP. It is also a fact that Modi's own rally 6 days before the elections had 60% of chairs empty despite the karyakarta mobilisation.",
        "Classic example of ignorant people thinking they are the expert. EVMs don't have a brain of their own. EVMs need to be programmed to count votes. And that program can very easily be modified by a simple flash. \nHere is one example:\nWrite a program such that first 700 (put any random number here) votes are counted as per actual vote, but everything thereafter, count of BJP candidate gets increased by +1 regardless of the button pressed. EVM checking is done by casting 50 votes. So the EVM won't be caught. This program is not a rocket science. Most engineering graduates do this when they learn PLC. You don't need big hackers to do this.\n\nRegarding the claim that no party has proven anything, I recall when the EC invited all parties to show how it can be done. It was just the kind of drama that Bakendra Chodi keeps doing. But when the opposition took the challenge, the EC sprang a new condition that they will not be allowed access to the code. How else will anybody tamper with an electronic machine?? By beating it with a stick?\nLastly, when you have men of dignity and honesty occupying the top post, you can trust the system. When low life criminals and shameless, outright liars are in those chairs, you need to be suspect.",
        "Election commission has challenged the opposition parties multiple times to try to hack the EVM but they never accept it. All these are just allegations without any proof and are only made to waste the time of public. How can you expect that the politicians who can't even take the blame for their defeat will  be held accountable if they ever for a govt. In future",
        "So you are saying numbers were in favor of BJP in other states and still they rigged it? Hahaha do you hear yourself? \n\nRead again what you wrote.",
        "I have no convictions one way or another on this topic.\n\nBut, even in 2014 North Korean elections, Kim Jong-un's party won 607 out of 687 total seats.\n\nThe people in powers are not mindless goblins hoarding money and power. They can strategize.",
        "This is how godi media manipulated people into thinking what they want. If you think they aren't rigging numbers must be in their favours right?? Or are you saying numbers were not in their favour but they still won? How? Read what you wrote again yourself first.",
        "Yes I believe it is possible if done smartly.",
        "What they gonna do with that? If I provide you a device that you know nothing about and don't provide any other info and ask you to hack it would you be able to do that? \n\nAlso people are blaming opposition for crying about evm's, the same BJP that is saying evm's can't be backed were crying about evm manipulation when congress was in power.\n\nhttps://www.hindustantimes.com/india/bjp-blames-evms-for-defeat-backtracks/story-qOeuhnBqqUikQd5K3KxxXO.html\n\n\n\nAs for your proof that evm's can be hacked or not, read this article\n\nhttps://www.bbc.com/news/10123478\n\nhttps://timesofindia.indiatimes.com/india/evm-controversy-takes-a-political-turn/articleshow/6438841.cms",
        "https://m.economictimes.com/news/politics-and-nation/et-special-can-the-electronic-voting-machine-be-manipulated/articleshow/6556429.cms",
        "hey, thanks for explaining. \n\n\nI have a doubt: People are saying that votes polled vs votes counted has a discrepancy of about 8% in Maharashtra while historically this number has been around 1%. Can you please explain why this is so ? Thanks in advance. ",
        "You are right about the EVM tech. It is not tampered. But ECI has not given account of 20 lakh EVMs which were purchased apart from the 20 lakh EVMs in use. So what happened to those EVMs, they are loaded with false votes and machines replaced after voting and before counting. They're has been multiple instances of machine IDs not matching pointed out by the opposition, cctv mysteriously not working, these complaints have been ignored by EC.",
        "Many more countries have started using EVMs since 2007 than not started using it so I'd disregard your stupid logic about NL not using it.\n\nAnyway, you said that EVMs have been hacked outside the time specified by ECI. That is not true, no one has shared a single source about that.\n\nAgain, I'm not saying BJP isn't corrupt or morally bankrupt, I am just saying that the claim that EVMs are hackable is stupid.",
        "Also there is an increase of approx 8% votes or 76 lakh votes after 5 pm on 20th Nov in Maharashtra.\n\nHaryana is also around 6% increase. Jharkhand was less than 2% which is 2.02 lakh.\n\nThe norm is under 1% additional votes after 5 pm.",
        "No your dad.",
        "This is a solid explanation. But my apprehension lies in the fact that just because the booth you saw or worked first hand with had no tampering doesn't necessarily mean all booths were fine. I also don't think paper vote is the answer. The problem is ECI is no longer autonomous. It is fairly under the government and it is not far fetched to consider they would compromise on their duties if it comes from top.\n\nIf as a BJP supporter, you are hurt when people attribute the success of your party to EVM manipulation, you should ask your branch and head office why did the central government appoint people allegedly close to BJP as election commissioner.",
        "The point that I am making is this EVM passes through so many hands and cross checks that do it at large level with nobody coming up with proof of cheating is pretty low.if the bjp govt is able to do this without a whistle blower is pretty smart and will be considered as one the best cheating scandal ever.",
        "Agreed. But a lot of scams when they come out, the first thing that everybody questions is how was it missed for so long. Not saying there is something wrong happening, but if the central government was not upto anything shady, they could have put the entire matter to rest by putting a truly independent person incharge of ECI and not removi CJI from the selection panel, thereby undermining the process.\n\n  \nI am still not sure the rationale of those actions, but it raises questions. And people will try to connect the dots in their spare time.",
        "The post mentions Rajiv Kumar was appointed as CEC in 2022. Why do you think he is 'close to the BJP' or like OP declares, a 'Modi's man'?",
        "Sources please",
        "I am not a political supporter .I am part of the swing vote public.When people accuse of EVM tampering they are also accusing the lakhs of people who worked as polling officers.I worked for absolutely no pay for 24 hour straight with 4 hours of sleep .That is why I am getting irritated with this kind of bull shut posting .The MVA was complacent ,lazy and incompetent so they lost.The MBT was cunning ,worked hard gave hollow but fantastic promise and won .Posting from mobile but I will try to give the  ways cross checking are done and the somebody can point out how it can be tampered.",
        "[https://www.youtube.com/watch?v=3B4GC39nALU](https://www.youtube.com/watch?v=3B4GC39nALU)",
        "'Classic example of ignorant people thinking they are the expert'",
        "Source please",
        "I understand your frustation and would apologise for insinuating that you compromised your integrity. That was not my intention. What you did is a service to the state and country and I appreciate your efforts.",
        "https://www.bbc.com/news/10123478",
        "Looks like Congress IT cell got new orders..",
        "The zonal officers are supposed to update the election commission website every 2 hours .The last update happens at 5pm and the final one after 7pm .The polling ends at 6pm but whoever is present inside the polling premise and standing in line is allowed to vote .The Presiding officers give out numbered chits with the last person of the line getting the chit with Serial number 1 to avoid people jumping walls and joining the queues. So poll can happen till 7:00pm also.Later the final votes are tallied checked with polling agents and then updated on the websites .Maybe last minute voting happened because of BJP agent getting their voters out or Zonal officers being lazy and incompetent .There is fairly good enough explanation for this instead of EVM fraud.",
        "I am not saying that it is because of EVM fraud. I want to believe that it's not. EC should come out and give explanation for these large discrepancies. \n\n\n8% is huge, when you think about it.\nLast minute voting and Zonal officers being lazy does not explain it. ",
        "That's all you are capable of?? Copy, paste.",
        "Is there an acceptable range observed previously to say whether or not 8% is high?",
        "My point is this is quite a manual process so maybe inconsistency can creep in .\nFor fraud people are looking at wrong place.There is a voter listing done before election by klock level officer .If I can influence he can easily remove him/her from voter list claiming he is shifted from the region .\nVoter apathy is one of the biggest reason (like in Loksabha  election ) happened.",
        "rally chairs not being filled does not equal election fraud",
        "Aankhe kholo. Stop being a sheep. \n\nDo a simple google search ffs. \n\nWhenever elections are happening in BJP controlled states, vote % is shooting up avg 5-7%, this margin is actually the margin to win elections in India. This same thing happened during General elections 2024 where additional 5 crore voters were added after voting closed and form 17c data which gives the actual number of people who voted. They have started doing this now because they know they are losing elections. Do you all not read the news? UP gunda CM was saying that ROs didn't cooperate with UP govt that's why they lost elections in June. \n\nThey lost Karnataka last year because they believed they will win that's why didn't bother to manipulate votes on large scale. Now, they KNOW everyone is fed up of them, so they have started mass rigging of elections. \n\nDemocracy is dead in India.",
        "It happens in every election. I guess it is because percentage can't be compiled in real time, and data is compiled as and when it is received (which can be upto the morning of the next day). There are more questions raise on such discrepancies, like here: [https://m.thewire.in/article/news/504313-additional-votes-maharashtra-data-mismatch-between-votes-polled-and-counted/amp](https://m.thewire.in/article/news/504313-additional-votes-maharashtra-data-mismatch-between-votes-polled-and-counted/amp)   \nThe ECI reply seems reasonable. The fact that many inconsistencies in the reported data were pointed out by ECI, and were later updated in the article by the editor, shows that the initial reporting was not done with due diligence. It is good to question though.",
        "I dont think Hindu Muslim angle has a short shelf life. Everytime the fire starts to die down, they will add fuel to fire by creating unnecessary and non existing issues.\n\n\nJust see how the Ppl in esteemed positions like CMs and more are peddling the same bullshit..",
        "Yes too much data involved, agree, chances of error are there. Could be a case of inefficiency. However I was talking about the voting done after close of timing. Additional votes, there could be a discrepancy of 1% or <, but this seems to be a big anomaly (7.8%).",
        "Till 5pm, the data is only approximate. They have to count from the voter list & then reconfirm from the EVMs. My guess is the 5pm data is from manual counting of the ticks in voter list. Also, all centers are not able to communicate their tally to the central office, due to various logistical issues. It is only when the EVMs are brought back to the centers, can the real tally be confirmed. It would be nice of ECI if they make a video of the process.",
        "Not standalone. Taken together with the other abnormalities, I will say that there is definitely smoke.\n\nYou are not answerable. The ECI very much is.",
        "Dr. Parakala also mentions about the manual paper ballot regime where data would be available in a short time despite the logistical difficulties due to technology. In today's world of internet and mobile, the delay and discrepancy seems absurd, creates more suspicion and mistrust, plus ECs reluctance to be transparent.\n\nEVM tampering is not possible I agree, but additional voting after the election time is over is a possibility, after all the govt machinery is under the political leadership. The answers from EC are not forthcoming and deflective at best and doesn't give confidence. The truth will prevail one day. Till then we can't do anything about it.",
        "There is no credible evidence of fraud, the fact that you have to drop to saying Modi's rally was empty really weakens your case and lets the Opposition keep blaming rigging instead of making serious changes",
        "ECI doesn't use internet in the voting process. It's how EVMs are ensured to be safe. But regarding the votes added after voting hours, it may be possible that manual votes can be added. But isn't there something like a seal on the EVMs, which is applied when voting ends? I'm not sure how the system works.  \n And I think you're implying that ECI officials manually add votes after voting hours are done. This is quite risky because government officials have different party orientations. Also, in this world of internet, something like that can leak quickly & lead to suspensions. No officer would risk his permanent government job for a temporary government.",
        "I agree but EC should clarify as such doubts are not good for aby democracy. ",
        "Based on the discussion I saw on TV between Karan Thapar and Parkala P , it used to be under 1% but in recent LS, HR elections and MH elections it has been in the range of 8-12%. \n\n\nIn Jharkhand it was 1%",
        "Agree.\n\nLet the ECI give responses to the questions.",
        "yes",
        "Some machines and officials with favourable orientation is all is needed to swing the result. The delay could be explained by that. I meant internet and mobile used for reporting, not for the EVM's operation. Anyways, our opinions doesn't matter.",
        "Unless there is booth capturing it’s near impossible to manipulate elections according to my dad who is a retired gov employee and been on election duty for over 40 years.",
        "How delusional are you?? Do you live in maharashtra? Do you have any idea what was rahul Gandhi speaking about in his rally? Completely unrelated to the topics of election?  RSS has been actively going door to door urging people to vote, they where placing pamphlets not evidently naming the bjp but just asking for votes, they have been to my house saying that you can vote anyone you want but please vote, less participation resulting in unwanted candidates getting elected, signaling their recent loss in general election. I can't think of any reasons that this elections voting turnout is less than last year's. ECI should definitely give explanation about why the stagerring 8% increase in the last hour, but voting turnout should be more than last elections.",
        "For everyone thinking that BJP has hacked EVMs, ask yourself this, why would they give themselves not even simple majority in LS Elections let alone 400 paar, and why would they lose Ayodhya? Why did they not ensure Annamalai won in TN?\n\nThis is the worst hacking scheme ever",
        "it is a conspiracy theory, just because your candidate didn't win doesn't mean there was foul play...",
        "Firstly, if there is no issues then the ECI should respond to all the questions of the people. Including releasing the videography of the slip distribution and voting for votes polled after 5 p.m.\n\n\nYou need the local state with you to tamper. In UP, Yogi didn't allow it as there was a plan to replace him with a puppet CM.",
        "They changed the EVM hardware. This is not what hacking is. Even BBC had to use inverted commas on the word hack. But yeah, believe what you want to.",
        "I mean there can be a fair play but u can observe the reportings of Maharashtra, 5 lakh more voter count appearing after polling numbers were closed, how? \nMany Evm machines running all day and still at a 99% battery, how? \nUP- cops and b party checking voter’s ID, they dont have permission to, but still do, and send back folks from minority communities, not allowed to enter polling booth stations, how? \nAll this is there out in open, we can obviously close our eyes and say everything is fair in country like India which breathes on corruption and incompetence. :)",
        "Do you have enough proof to stand in the courts? if not then it is just your feelings. It is ironic EVMs are only \"hacked\" when bjp wins and in other states where bjp lost, it works somehow...\n\nyou have to realize there is no conspiracy, the public has rejected dynastic politics...",
        "So the proof of EVM not being tampered is bjp loosing few states? That’s just a strawman argument. Also, its a lil delusional to think Dynasty politics is not in BJP. \nAnyways i rest my case cuz our discussion will lead to no point since i am discussing about EVM and u are discussing about political parties, hence ur biasness is but obvious here.",
        "alright, provide one credible piece of evidence which will stand in the courts that shows evm is tampered with."
    ],
    "cleaned_text": "election commission india compromised honest election commissioner ashok lavasa election commissioner dissented modi shahs behaviour family witchhunted incometax department httpsfrontlinethehinducomcoverstoryarticleece modis man rajiv kumar former finance secretary appointed cec modi government httpsindianexpresscomarticleindiarajivkumarchiefelectioncommissioner change law december modi government rammed cec election commissioners bill parliament bill eliminated chief justice indias inclusion selection election commissioners httpswwwlivemintcomnewsindialoksabhapassesbillonappointmentofchiefelectioncommissionerelectioncommissionersparliamentwintersessionhtml yes men march modi shah appointed gyanesh kumar sukhbir singh sandhu election commissioners leader opposition adhir ranjan chowdhury submitted dissent note asshortlisted names shared minutes meeting httpswwwthehinducomnewsnationalexbureaucratssukhbirsandhugyaneshkumarnamedelectioncommissionersarticleece source httpsfrontlinethehinducomcoverstoryarticleecehttpsfrontlinethehinducomcoverstoryarticleece httpsindianexpresscomarticleindiarajivkumarchiefelectioncommissionerhttpsindianexpresscomarticleindiarajivkumarchiefelectioncommissioner httpswwwlivemintcomnewsindialoksabhapassesbillonappointmentofchiefelectioncommissionerelectioncommissionersparliamentwintersessionhtmlhttpswwwlivemintcomnewsindialoksabhapassesbillonappointmentofchiefelectioncommissionerelectioncommissionersparliamentwintersessionhtml httpswwwthehinducomnewsnationalexbureaucratssukhbirsandhugyaneshkumarnamedelectioncommissionersarticleecehttpswwwthehinducomnewsnationalexbureaucratssukhbirsandhugyaneshkumarnamedelectioncommissionersarticleece ",
    "cleaned_title": "election commission india compromised",
    "cleaned_selftext": "honest election commissioner ashok lavasa election commissioner dissented modi shahs behaviour family witchhunted incometax department httpsfrontlinethehinducomcoverstoryarticleece modis man rajiv kumar former finance secretary appointed cec modi government httpsindianexpresscomarticleindiarajivkumarchiefelectioncommissioner change law december modi government rammed cec election commissioners bill parliament bill eliminated chief justice indias inclusion selection election commissioners httpswwwlivemintcomnewsindialoksabhapassesbillonappointmentofchiefelectioncommissionerelectioncommissionersparliamentwintersessionhtml yes men march modi shah appointed gyanesh kumar sukhbir singh sandhu election commissioners leader opposition adhir ranjan chowdhury submitted dissent note asshortlisted names shared minutes meeting httpswwwthehinducomnewsnationalexbureaucratssukhbirsandhugyaneshkumarnamedelectioncommissionersarticleece source httpsfrontlinethehinducomcoverstoryarticleecehttpsfrontlinethehinducomcoverstoryarticleece httpsindianexpresscomarticleindiarajivkumarchiefelectioncommissionerhttpsindianexpresscomarticleindiarajivkumarchiefelectioncommissioner httpswwwlivemintcomnewsindialoksabhapassesbillonappointmentofchiefelectioncommissionerelectioncommissionersparliamentwintersessionhtmlhttpswwwlivemintcomnewsindialoksabhapassesbillonappointmentofchiefelectioncommissionerelectioncommissionersparliamentwintersessionhtml httpswwwthehinducomnewsnationalexbureaucratssukhbirsandhugyaneshkumarnamedelectioncommissionersarticleecehttpswwwthehinducomnewsnationalexbureaucratssukhbirsandhugyaneshkumarnamedelectioncommissionersarticleece",
    "cleaned_comments": "shout want reports facts still remain conspiracy theory want temples minorities beaten shot great post still various idiots ironically cant fathom fact evms compromised entire eci compromised already institution compromised machines control completely fair unbiased saar yeah right multiple opportunities given anyone come try hackinspect evms one could id imagine machines fair unbiased saar eci stated terms conditions stupid challenge cant even touch machine order hack something first need know schematic code provided parties exactly could hack reminiscent giving test without knowing syllabus action taken exactly bj party workers evms found maha elections action taken bj party member distributing money blatantly hotel actively violating mcc ill tell police came disperse crowd didnt even arrest eci hasnt even specified companies involved manufacturing evm companies aware control ministry defense falls control ruling party neutrality ensured link countries like netherlands even phased evms found could tampered easily easiest way manipulate billion people majormedia channels hear hear creat false sense frenzy incompetent pm know hindu muslim angle limited shelf life especafter remain incumbent decade plus years still things get worse unfortunate thing people take election verdicts guarantee popularity clear theyve bought entire hinery including eci babus new toolkit dropped guess eci lazy needs changed since didnt work jk karnataka tn jharkhand point blatantly misinformation chief justice never involved selection ecs supreme court shat constitution force process parliament rightly fixed pushing back supreme court nasty habit inventing unconstitutional systems legal basis give authority amd hacked outside restrictive time base event held eci aware could share news article technical paper duh thats obvious dont build place minorities sent specifically purpose call camp lager want fancy use foreign word lose karnataka jammu kashmir jharkhand recently point much easier compromise ballot papers evm one moan number problems india unless better solution need stfu guarantee bjp introduces ballot papers first people opposing would opposition bjp machinery much powerful congress aint netherlands evms different indian ones werent standalone like indian ones watch imitation game man thats true allevm much easier target compromise still hard believe single whistleblower get evidence evm maybe congress pay insider get good evidence presented supreme court fear rebuttal still seats shouldnt evm compromised bjp lose heavily lok sabha elections states try something else sucker smart country fix unlike pakistan supreme court order every cec appointed pm day court order instructed government form appointment process make three person committee include leader opposition cec appointment process new committee formed cj stay cec appointment process cj wasnt supposed stay role permanently government formed new committee pm hm technically minister pm nominates lop three members clarify ashok lavassa hand picked pm modi guys current cec appointed new committee every future past cec appointments candidates favored government waswill appointed opposition means express opinions never hadwill hold much impact government votes override opposition point lavassa targeted income tax might carry weight overall idea suddenly pm got power hungry overrode supreme court order removed chief justice committee total bullshit chief justices role appointing cec inserting judicial reach fact western world us example justices appointed elected representatives country india justices appoint collegium illegal branch government oversight judiciary india couldnt win single seat tamil nadu come supreme court allowed desecration election commission machiavellian ends justify means absolute powers corrupts absolutely possibilities possibility exchange machine scenario exchange machines mock polling scenario exchange machine even mock polling possibility temper machine scenario machine gives votes party like something scenario machine polling booth votes given booth management polling officials likely use method different states constituency prevent much discontent among voters explains places polling booths compromised method compromise different different places another evm hacked kinda excuse blame opposition theyll keep losing big long keep defending rss wanted teach lesson supreme leader someone worked preceding officer election booths counting centres comment beyond stupid work one things change man bruh indian evms nothing like westernamerican ones theyre using modern consumer tech like phones faxes connected vulnerable common civilian networks protocols evms glorified electronic abacus store count votes electronic format importantly accessible physically voting reliability proven fact party ever proven fault evms much easier capture booths like wb voter intimidation like mess evms time laughable allegations like op apparently sitting government appointing guy ec somehow suspicious political patronage invented bjp kind discourse making opposition look like joker fact helping bjp would rather ask focus efforts making opposition accountable failure work improvement points need stfu without knowledge evm machine compromised public knowledge ballot rigged muscles somehow videos make social media passport ballot returned chandigarh mayor ejection prime example protector turned killer democracy hadnt paper ballot fraud caught camera would gone scott free say gfys election hacking happening since people made believe balakot strikes gave bjp seats believe voted enmasse bjp demonetization disaster theres always thin line babus politicians even famed non partisan cec mr tn seshan went join inc year retiring ones saying evms compromised time manipulation small number evms also result big difference final seats difference party losing power maintaining majority fear ruling party power feel necessary didnt lose lok sabha election though seats entire opposition form government one private citizen roped conducting maharashtra polls one official poll booth officer describe procedure conducting polls evm machine polls fully webcasted video streamed throughout duration early morning evm vpat control unit connected conduct mock poll minimum votes cross checked booth agent respective partiesthis cross checked vvpat slips printedalso candidate given minimum votes device cleared sealed front agent seal numbers notedthe device started sharp whole voting doneeach voter count recorded book called c tallied number voteslater information recorded also given polling booth agent booth minimum people work highly improbable go manipulate results evm without connivance poll booth officials government able paper vote also going help political neutral person seen booth day bjp agents proactive getting people vote ladki schemewe put manipulation evm rest better alternative itmillenial kids talking ballot papers revisit articles election prior post needed like audience magic show believing magician real super powers fact bjp wave maharashtra modis rallies state seats empty despite mobilisation karyalartas booth mobilisation bullshit logic people bought booth vote anyone unless paid know going vote lakh additional votes last hour logistically possible assembly elections last hour polling around far happened untill unless bjp doesnt win seats still say congress fairly wow national elections almost proved something fishy evms public knowledge maybe thing paper ballot easy fraud person even first place conpromised isnt true guy needs medical help youre already civil war never said congress havent fairly implying cheat leave karnataka especially time language politics going state huge contribution india using modi tactics abusing infatilising person instead talking subject also engineer field evm designed claim least sure tampering happeningif like ballot votes please explain stop tampering additional votes booths votes tallied delayed information uploaded sheer number booths put point explain hard manipulate evm without anybody knowing since huge number personnel deputed still want believe manipulated ok stfu lets say evms cant compromised replaced easily also evms made god man made machine manipulated like thick brain numbers rigging elections would caused nation wide protest told bjp owned media even expect voice concerns without getting jailed disappearing overnight opposition godi media courts turned law joke parties provided reliable proof apart subah ko winning sha ko trailing type proofs shivsena ubt askedfo verification vvpata let us see ec responds saying chance manipulation clearcaseof boy crying wolf case actually turns true ballot papers counted night machines require months know compromised please tampering sure evm otherwise turkey hungry russia cheated seats lok sabha entire paper go check judges recommend hc level sc level sent government appointments made president effect appointed government time collegium could entire composed members appointed specific government say cji true raise eyebrow government tries get rid process conjunction facts governments behaviour must questioned people india asking questions fact ground wave bjp also fact modis rally days elections chairs empty despite karyakarta mobilisation classic example ignorant people thinking expert evms dont brain evms need programmed count votes program easily modified simple flash one example write program first put random number votes counted per actual vote everything thereafter count bjp candidate gets increased regardless button pressed evm checking done casting votes evm wont caught program rocket science engineering graduates learn plc dont need big hackers regarding claim party proven anything recall ec invited parties show done kind drama bakendra chodi keeps opposition took challenge ec sprang new condition allowed access code else anybody tamper electronic machine beating stick lastly men dignity honesty occupying top post trust system low life criminals shameless outright liars chairs need suspect election commission challenged opposition parties multiple times try hack evm never accept allegations without proof made waste time public expect politicians cant even take blame defeat held accountable ever govt future saying numbers favor bjp states still rigged hahaha hear read wrote convictions one way another topic even north korean elections kim jonguns party total seats people powers mindless goblins hoarding money power strategize godi media manipulated people thinking want think arent rigging numbers must favours right saying numbers favour still read wrote first yes believe possible done smartly gon na provide device know nothing dont provide info ask hack would able also people blaming opposition crying evms bjp saying evms cant backed crying evm manipulation congress power proof evms hacked read article hey thanks explaining doubt people saying votes polled vs votes counted discrepancy maharashtra historically number around please explain thanks advance right evm tech tampered eci given account lakh evms purchased apart lakh evms use happened evms loaded false votes machines replaced voting counting theyre multiple instances machine ids matching pointed opposition cctv mysteriously working complaints ignored ec many countries started using evms since started using id disregard stupid logic nl using anyway said evms hacked outside time specified eci true one shared single source im saying bjp isnt corrupt morally bankrupt saying claim evms hackable stupid also increase approx votes lakh votes pm th nov maharashtra haryana also around increase jharkhand less lakh norm additional votes pm dad solid explanation apprehension lies fact booth saw worked first hand tampering doesnt necessarily mean booths fine also dont think paper vote answer problem eci longer autonomous fairly government far fetched consider would compromise duties comes top bjp supporter hurt people attribute success party evm manipulation ask branch head office central government appoint people allegedly close bjp election commissioner point making evm passes many hands cross checks large level nobody coming proof cheating pretty lowif bjp govt able without whistle blower pretty smart considered one best cheating scandal ever agreed lot scams come first thing everybody questions missed long saying something wrong happening central government upto anything shady could put entire matter rest putting truly independent person incharge eci removi cji selection panel thereby undermining process still sure rationale actions raises questions people try connect dots spare time post mentions rajiv kumar appointed cec think close bjp like op declares modis man sources please political supporter part swing vote publicwhen people accuse evm tampering also accusing lakhs people worked polling officersi worked absolutely pay hour straight hours sleep getting irritated kind bull shut posting mva complacent lazy incompetent lostthe mbt cunning worked hard gave hollow fantastic promise posting mobile try give ways cross checking done somebody point tampered httpswwwyoutubecomwatchvbgcnaluhttpswwwyoutubecomwatchvbgcnalu classic example ignorant people thinking expert source please understand frustation would apologise insinuating compromised integrity intention service state country appreciate efforts looks like congress cell got new orders zonal officers supposed update election commission website every hours last update happens pm final one pm polling ends pm whoever present inside polling premise standing line allowed vote presiding officers give numbered chits last person line getting chit serial number avoid people jumping walls joining queues poll happen till pm alsolater final votes tallied checked polling agents updated websites maybe last minute voting happened bjp agent getting voters zonal officers lazy incompetent fairly good enough explanation instead evm fraud saying evm fraud want believe ec come give explanation large discrepancies huge think last minute voting zonal officers lazy explain thats capable copy paste acceptable range observed previously say whether high point quite manual process maybe inconsistency creep fraud people looking wrong placethere voter listing done election klock level officer influence easily remove himher voter list claiming shifted region voter apathy one biggest reason like loksabha election happened rally chairs filled equal election fraud aankhe kholo stop sheep simple google search ffs whenever elections happening bjp controlled states vote shooting avg margin actually margin win elections india thing happened general elections additional crore voters added voting closed form c data gives actual number people voted started know losing elections read news gunda cm saying ros didnt cooperate govt thats lost elections june lost karnataka last year believed win thats didnt bother manipulate votes large scale know everyone fed started mass rigging elections democracy dead india happens every election guess percentage cant compiled real time data compiled received upto morning next day questions raise discrepancies like httpsmthewireinarticlenewsadditionalvotesmaharashtradatamismatchbetweenvotespolledandcountedamphttpsmthewireinarticlenewsadditionalvotesmaharashtradatamismatchbetweenvotespolledandcountedamp eci reply seems reasonable fact many inconsistencies reported data pointed eci later updated article editor shows initial reporting done due diligence good question though dont think hindu muslim angle short shelf life everytime fire starts die add fuel fire creating unnecessary non existing issues see ppl esteemed positions like cms peddling bullshit yes much data involved agree chances error could case inefficiency however talking voting done close timing additional votes could discrepancy seems big anomaly till pm data approximate count voter list reconfirm evms guess pm data manual counting ticks voter list also centers able communicate tally central office due various logistical issues evms brought back centers real tally confirmed would nice eci make video process standalone taken together abnormalities say definitely smoke answerable eci much dr parakala also mentions manual paper ballot regime data would available short time despite logistical difficulties due technology todays world internet mobile delay discrepancy seems absurd creates suspicion mistrust plus ecs reluctance transparent evm tampering possible agree additional voting election time possibility govt machinery political leadership answers ec forthcoming deflective best doesnt give confidence truth prevail one day till cant anything credible evidence fraud fact drop saying modis rally empty really weakens case lets opposition keep blaming rigging instead making serious changes eci doesnt use internet voting process evms ensured safe regarding votes added voting hours may possible manual votes added isnt something like seal evms applied voting ends im sure system works think youre implying eci officials manually add votes voting hours done quite risky government officials different party orientations also world internet something like leak quickly lead suspensions officer would risk permanent government job temporary government agree ec clarify doubts good aby democracy based discussion saw tv karan thapar parkala p used recent ls hr elections mh elections range jharkhand agree let eci give responses questions yes machines officials favourable orientation needed swing result delay could explained meant internet mobile used reporting evms operation anyways opinions doesnt matter unless booth capturing near impossible manipulate elections according dad retired gov employee election duty years delusional live maharashtra idea rahul gandhi speaking rally completely unrelated topics election rss actively going door door urging people vote placing pamphlets evidently naming bjp asking votes house saying vote anyone want please vote less participation resulting unwanted candidates getting elected signaling recent loss general election cant think reasons elections voting turnout less last years eci definitely give explanation stagerring increase last hour voting turnout last elections everyone thinking bjp hacked evms ask would give even simple majority ls elections let alone paar would lose ayodhya ensure annamalai tn worst hacking scheme ever conspiracy theory candidate didnt win doesnt mean foul play firstly issues eci respond questions people including releasing videography slip distribution voting votes polled pm need local state tamper yogi didnt allow plan replace puppet cm changed evm hardware hacking even bbc use inverted commas word hack yeah believe want mean fair play u observe reportings maharashtra lakh voter count appearing polling numbers closed many evm machines running day still battery cops b party checking voters id dont permission still send back folks minority communities allowed enter polling booth stations open obviously close eyes say everything fair country like india breathes corruption incompetence enough proof stand courts feelings ironic evms hacked bjp wins states bjp lost works somehow realize conspiracy public rejected dynastic politics proof evm tampered bjp loosing states thats strawman argument also lil delusional think dynasty politics bjp anyways rest case cuz discussion lead point since discussing evm u discussing political parties hence ur biasness obvious alright provide one credible piece evidence stand courts shows evm tampered",
    "light_cleaned_title": "Election Commission of India Compromised",
    "light_cleaned_selftext": "**The Honest Election Commissioner** Ashok Lavasa, an election commissioner between 2018 and 2020, dissented against Modi and Shah's behaviour, and he and his family were witch-hunted by the Income-Tax Department [\\[1\\].](https://frontline.thehindu.com/cover-story/article29618205.ece) **Modi's Man** Rajiv Kumar, a former finance secretary, was appointed as CEC in 2022 during the Modi government [\\[2\\]](https://indianexpress.com/article/india/rajiv-kumar-chief-election-commissioner-7913065/). **Change in Law** In December 2023, the Modi government rammed the CEC and Other Election Commissioners Bill, 2023, through Parliament. The bill eliminated the Chief Justice of India's inclusion in the selection of Election Commissioners [\\[3\\]](https://www.livemint.com/news/india/lok-sabha-passes-bill-on-appointment-of-chief-election-commissioner-election-commissioners-parliament-winter-session-11703148084130.html). **More Yes Men** In March 2024, Modi and Shah appointed Gyanesh Kumar, Sukhbir Singh Sandhu as Election Commissioners. The then leader of opposition, Adhir Ranjan Chowdhury submitted a dissent note asshortlisted names were shared with him just 10 minutes before the meeting [\\[4\\]](https://www.thehindu.com/news/national/ex-bureaucrats-sukhbir-sandhu-gyanesh-kumar-named-election-commissioners/article67949991.ece). Source: \\[1\\] [https://frontline.thehindu.com/cover-story/article29618205.ece](https://frontline.thehindu.com/cover-story/article29618205.ece) \\[2\\] [https://indianexpress.com/article/india/rajiv-kumar-chief-election-commissioner-7913065/](https://indianexpress.com/article/india/rajiv-kumar-chief-election-commissioner-7913065/) \\[3\\] [https://www.livemint.com/news/india/lok-sabha-passes-bill-on-appointment-of-chief-election-commissioner-election-commissioners-parliament-winter-session-11703148084130.html](https://www.livemint.com/news/india/lok-sabha-passes-bill-on-appointment-of-chief-election-commissioner-election-commissioners-parliament-winter-session-11703148084130.html) \\[4\\] [https://www.thehindu.com/news/national/ex-bureaucrats-sukhbir-sandhu-gyanesh-kumar-named-election-commissioners/article67949991.ece](https://www.thehindu.com/news/national/ex-bureaucrats-sukhbir-sandhu-gyanesh-kumar-named-election-commissioners/article67949991.ece)",
    "light_cleaned_comments": "Shout all you want with reports & facts, still will remain a conspiracy theory. We just want more temples and minorities beaten and shot. Great post! There are still various idiots who ironically can't fathom the fact that the EVMs can be compromised when the entire ECI has been compromised already. The institution has been compromised but the machines under their control are completely fair and unbiased, saar! Yeah, right. There have been multiple opportunities given for anyone to come and try hack/inspect the EVMs. No one could do it. So I'd imagine the machines are fair and unbiased. Saar. The ECI stated in the terms and conditions of that stupid \"Challenge\" that you can't even touch the machine. In order to hack something you first need to know about its schematic and code both of which were not provided to the parties, so how exactly could they hack it? It's reminiscent of giving a test without knowing the syllabus. What action was taken exactly against BJ party workers' with whom the EVMs were found in Maha elections? What action was taken against the BJ party member who was distributing money blatantly in a hotel and actively violating the MCC? I'll tell you, the police came to disperse the crowd and didn't even arrest him. The ECI hasn't even specified all companies involved in manufacturing the EVM and the 2 companies which we are aware of are under the control of the Ministry of Defense which falls under the control of the ruling party. How can neutrality be ensured then? Link for above- Countries like The Netherlands have even phased out EVMs in 2007 as they found that they could be tampered with easily. This is the easiest way to manipulate a billion people. Own all the major.media channels so they hear what you what them to hear. Creat a false sense of frenzy for an incompetent PM. They know that their Hindu Muslim angle has limited shelf life espec6after they remain incumbent for a decade plus years and still things get worse. The unfortunate thing is that people take election verdicts as a guarantee of popularity when it's so clear that they've bought over the entire ma hinery including ECI and babus New toolkit just dropped. I guess this ECI is too lazy and needs to be changed since it didn't work in J&K or in Karnataka, TN or Jharkhand? /s Point 3 is just blatantly misinformation. The chief justice was never involved in the selection of the ECs. The supreme Court shat all over the constitution to force themselves into that process and parliament rightly fixed it by pushing them back out. The supreme Court has a nasty habit of inventing unconstitutional systems with no legal basis just to give itself more authority. Amd there are those who have hacked it outside of the restrictive time base event held by ECI. I was not aware of this. Could you share a news article or any technical paper on that? duh thats obvious. Why don't they just build a place where minorities can be sent specifically for this purpose - they can call it a \"camp\", or \"lager\" if they want to be fancy & use some foreign word (/s) Why did they lose in Karnataka, Jammu & kashmir and Jharkhand recently? NO. The point is that it's much easier to compromise ballot papers than EVM. One can moan about any number of problems in India but unless they have a better solution they need to stfu. I guarantee that if the BJP introduces ballot papers the first people opposing it would be the opposition because the BJP machinery is much more powerful than Congress now. This ain't 1970. Netherlands evms were different from the indian ones they weren't standalone like the indian ones. Watch the imitation game My man, that's not true at all..EVM is a much easier target to compromise. It’s still hard to believe that there is not a single whistleblower who can get evidence against EVM. Maybe congress should pay an insider to get good evidence that can be presented to Supreme Court. Fear of rebuttal. They have still won seats they shouldn't have If EVM is compromised by BJP why did they lose heavily in Lok Sabha elections and other states. Try something else sucker ! You are smart country you will fix it unlike Pakistan. Until the supreme Court order, every CEC was appointed by the PM of the day. The court order instructed the government to form an appointment process and to make a three person committee and to include the Leader of opposition in the CEC appointment process, and until the new committee was formed the CJ was to stay in this CEC appointment process. CJ wasn't supposed to stay in that role permanently. The government formed a new committee with PM, HM (technically a minister the PM nominates), and the LOP as the three members. To clarify Ashok Lavassa was hand picked by PM Modi and so were the guys before and after. The current CEC is appointed by the new committee and in this and every other future and past CEC appointments, the candidates favored by the government was/will be appointed. Now, the opposition has a means to express their opinions but it never had/will hold much impact as the government has the votes to override the opposition. Your point about Lavassa being targeted by the income tax might carry some weight but the overall idea that suddenly the PM got power hungry and overrode the supreme Court order and removed the chief justice from the committee is total bullshit. Chief justices have no role in appointing the CEC, them inserting themselves was a judicial over reach. In fact in the western world (US for example) the justices themselves are appointed by the elected representatives of the country, in India justices appoint themselves through their collegium which should be illegal. As no other branch of the government has an oversight of the judiciary in India. Why couldn't they win a single seat in Tamil Nadu. how come supreme court allowed the desecration of election commission? Machiavellian ends justify all means. Absolute powers corrupts absolutely. Possibilities: Possibility 1. If they exchange the machine Scenario 1. They exchange the machines after the mock polling. Scenario 2. Exchange the machine even before the mock polling. Possibility 2. If they Temper with the machine. Scenario 1 : machine gives more votes to a party like 1:2 or something. Scenario 2 : same machine but at the polling booth more votes are given by booth management of polling officials. It's likely they use all the above method for different states and constituency. They do this to prevent too much discontent among the voters. This explains why in some places more polling Booths are compromised as the method of compromise was different at different places. This is just another “EVM hacked” kinda excuse. Blame the opposition. They’ll keep losing big as long as you keep defending them. RSS wanted to teach a lesson to the supreme leader. As someone who has worked as preceding officer in both election booths and counting centres , this comment is beyond stupid. When did you work as one and where ? Because things change man. Bruh. Indian EVMs are nothing like the Western/American ones where they're using modern consumer tech like phones, faxes connected to a vulnerable common civilian networks and protocols. Our EVMs are a glorified electronic abacus. They store a count of the votes in electronic format and most importantly, accessible ONLY physically when voting. Their reliability is proven by the fact that no party has ever proven any fault with EVMs. It's much easier to just capture booths like they do in WB or voter intimidation like in UP, than mess with EVMs. All we have at this time are laughable allegations like OP. Apparently the sitting government appointing their own guy at EC is somehow suspicious because political patronage was invented by the BJP 😂 This is the kind of discourse which is making the opposition look like a joker and is in fact helping the BJP I would rather ask you to focus your efforts on making the opposition accountable to its failure and work on improvement points You need to stfu without any knowledge. Evm is a machine which can be compromised with public knowledge. Ballot if rigged by muscles will somehow video's will make into social media. Passport ballot should be returned. Chandigarh mayor ejection is a prime example where the protector turned into killer of democracy. Hadn't it be for paper ballot fraud caught on camera, he would have gone Scott free. So i once again say to your gfys. Election hacking has been happening since 2019. People were made to believe that the Balakot strikes gave BJP above 400 seats. Cannot believe that they voted enmasse for BJP after the demonetization disaster. There’s always a very thin line between Babus and politicians. Even the famed non partisan CEC Mr. TN Seshan went on to join INC just a year after retiring. No one's saying all EVMs are compromised all of the time. Manipulation of a small number of EVMs can also result in a big difference in the final seats and be the difference between a party losing power or maintaining majority. The fear is that the ruling party has the power to do this as and when they feel necessary. They didn't lose the lok sabha election though? They won 240 seats which was more the entire opposition and did form the government. Being one of the private citizen who was roped into conducting the Maharashtra polls as one of the official poll booth officer I can describe the procedure of conducting the polls on EVM machine .This polls was fully webcasted and video streamed throughout its duration . Early morning the EVM VPAT and control unit is connected .Then we conduct a mock poll with minimum 50 votes that is cross checked with the booth agent of respective parties.This is cross checked with the VVPAT slips that is printed.Also each candidate is given minimum 2 votes each. The device is then cleared and sealed in front of the agent and the seal numbers are noted.The device is started at 7:00am sharp and the whole voting is done.Each voter count is recorded in a book called 17C which will be tallied with the number of votes.Later all this information is recorded and also given to each polling booth agent. Each booth has minimum 5 people to do all this work .It is highly improbable to go manipulate the results of EVM without the connivance of the poll booth officials .If any government is able to do this then paper vote is also not going to help. Being a political neutral person what we had seen in that booth that day is BJP agents being proactive in getting people to vote and the ladki been scheme.We should put the manipulation of EVM to rest because there is no better alternative to it.(Millenial kids talking of ballot papers should be revisit articles of election prior to 2000 ) This post was needed. You are like you audience of a magic show believing that the magician has real super powers.. The fact is that there was no BJP wave in Maharashtra... In Modi's rallies in the state more than 60% of seats were empty despite mobilisation by karyalartas... Booth mobilisation is a bullshit logic as the people bought to the booth can vote for anyone... unless you have paid them and know that they are going to vote for you... 78 lakh additional votes in the last hour is logistically not possible... In 2014 and 2019 assembly elections the last hour polling was around 0.5%. .. far from the 8% that happened in 2024... Untill unless BJP doesn't win any seats, you will still say that they congress have not won fairly? Wow The national elections almost proved it. There is something very fishy with our EVMs What public knowledge? Maybe the thing is paper ballot was so easy to fraud that the person even did it on the first place, you will it can be conpromised but that isn't true. This guy needs medical help. You’re already into civil war 🤣🤣 I never said congress haven't won fairly. I am implying if they can cheat why leave karnataka? Especially at a time when there is language politics going on there? And it is a state with huge contribution to India. You are using the Modi Tactics of just abusing or infatilising the person instead of talking on the subject. Also being an engineer myself in the field where EVM are designed I can claim to at least be sure of no tampering happening.If you like ballot votes please do and explain then how will you stop the tampering . The additional votes are because some booths votes are not tallied or delayed and information is not uploaded because of the sheer number of booths. I have put a point to explain that it is very hard to manipulate the EVM without anybody knowing since there is huge number of personnel deputed but still you want to believe that it is manipulated it is OK . Stfu, let's say evm's can't be compromised but they can be replaced easily. Also EVM's were not made by God it's an man made machine and can be manipulated just like your thick brain. Because numbers were against them, rigging those elections would have caused a nation wide protest. Who told you that? BJP owned media?? Even if there is, how do you expect him to voice his concerns without getting jailed or disappearing overnight ? Through opposition? or through godi media? Or courts that turned law into a joke ?? Has any of the parties provided reliable proof apart from subah ko I was winning but sha ko I was trailing type of proofs. The shivsena UBT has asked.fo4 verification of vvpata Let us see how EC responds . Not saying there is no chance of manipulation but it the clear.case.of boy crying wolf in this case if it actually turns out to be true When ballot papers are counted on the same night while machines require 2 months, you know it is compromised. Please. There is tampering for sure. EVM or otherwise. Have they in Turkey, in Hungry, in Russia? They cheated in 79 seats during the Lok Sabha. There is an entire paper on this. Go and check it out yourself. The judges are recommend at the HC level, then the SC level and then sent to the government. The appointments are made by the President, who is in effect appointed by the government. Over time, a collegium could entire be composed of members appointed by a specific government. While what you say about the CJI is true, it does raise an eyebrow when the government tries to get rid of him in the process. In conjunction with other facts, the government's behaviour must be questioned? We, the People of India, are asking questions. It is a fact that there was no on the ground wave for the BJP. It is also a fact that Modi's own rally 6 days before the elections had 60% of chairs empty despite the karyakarta mobilisation. Classic example of ignorant people thinking they are the expert. EVMs don't have a brain of their own. EVMs need to be programmed to count votes. And that program can very easily be modified by a simple flash. Here is one example: Write a program such that first 700 (put any random number here) votes are counted as per actual vote, but everything thereafter, count of BJP candidate gets increased by +1 regardless of the button pressed. EVM checking is done by casting 50 votes. So the EVM won't be caught. This program is not a rocket science. Most engineering graduates do this when they learn PLC. You don't need big hackers to do this. Regarding the claim that no party has proven anything, I recall when the EC invited all parties to show how it can be done. It was just the kind of drama that Bakendra Chodi keeps doing. But when the opposition took the challenge, the EC sprang a new condition that they will not be allowed access to the code. How else will anybody tamper with an electronic machine?? By beating it with a stick? Lastly, when you have men of dignity and honesty occupying the top post, you can trust the system. When low life criminals and shameless, outright liars are in those chairs, you need to be suspect. Election commission has challenged the opposition parties multiple times to try to hack the EVM but they never accept it. All these are just allegations without any proof and are only made to waste the time of public. How can you expect that the politicians who can't even take the blame for their defeat will be held accountable if they ever for a govt. In future So you are saying numbers were in favor of BJP in other states and still they rigged it? Hahaha do you hear yourself? Read again what you wrote. I have no convictions one way or another on this topic. But, even in 2014 North Korean elections, Kim Jong-un's party won 607 out of 687 total seats. The people in powers are not mindless goblins hoarding money and power. They can strategize. This is how godi media manipulated people into thinking what they want. If you think they aren't rigging numbers must be in their favours right?? Or are you saying numbers were not in their favour but they still won? How? Read what you wrote again yourself first. Yes I believe it is possible if done smartly. What they gonna do with that? If I provide you a device that you know nothing about and don't provide any other info and ask you to hack it would you be able to do that? Also people are blaming opposition for crying about evm's, the same BJP that is saying evm's can't be backed were crying about evm manipulation when congress was in power. As for your proof that evm's can be hacked or not, read this article hey, thanks for explaining. I have a doubt: People are saying that votes polled vs votes counted has a discrepancy of about 8% in Maharashtra while historically this number has been around 1%. Can you please explain why this is so ? Thanks in advance. You are right about the EVM tech. It is not tampered. But ECI has not given account of 20 lakh EVMs which were purchased apart from the 20 lakh EVMs in use. So what happened to those EVMs, they are loaded with false votes and machines replaced after voting and before counting. They're has been multiple instances of machine IDs not matching pointed out by the opposition, cctv mysteriously not working, these complaints have been ignored by EC. Many more countries have started using EVMs since 2007 than not started using it so I'd disregard your stupid logic about NL not using it. Anyway, you said that EVMs have been hacked outside the time specified by ECI. That is not true, no one has shared a single source about that. Again, I'm not saying BJP isn't corrupt or morally bankrupt, I am just saying that the claim that EVMs are hackable is stupid. Also there is an increase of approx 8% votes or 76 lakh votes after 5 pm on 20th Nov in Maharashtra. Haryana is also around 6% increase. Jharkhand was less than 2% which is 2.02 lakh. The norm is under 1% additional votes after 5 pm. No your dad. This is a solid explanation. But my apprehension lies in the fact that just because the booth you saw or worked first hand with had no tampering doesn't necessarily mean all booths were fine. I also don't think paper vote is the answer. The problem is ECI is no longer autonomous. It is fairly under the government and it is not far fetched to consider they would compromise on their duties if it comes from top. If as a BJP supporter, you are hurt when people attribute the success of your party to EVM manipulation, you should ask your branch and head office why did the central government appoint people allegedly close to BJP as election commissioner. The point that I am making is this EVM passes through so many hands and cross checks that do it at large level with nobody coming up with proof of cheating is pretty low.if the bjp govt is able to do this without a whistle blower is pretty smart and will be considered as one the best cheating scandal ever. Agreed. But a lot of scams when they come out, the first thing that everybody questions is how was it missed for so long. Not saying there is something wrong happening, but if the central government was not upto anything shady, they could have put the entire matter to rest by putting a truly independent person incharge of ECI and not removi CJI from the selection panel, thereby undermining the process. I am still not sure the rationale of those actions, but it raises questions. And people will try to connect the dots in their spare time. The post mentions Rajiv Kumar was appointed as CEC in 2022. Why do you think he is 'close to the BJP' or like OP declares, a 'Modi's man'? Sources please I am not a political supporter .I am part of the swing vote public.When people accuse of EVM tampering they are also accusing the lakhs of people who worked as polling officers.I worked for absolutely no pay for 24 hour straight with 4 hours of sleep .That is why I am getting irritated with this kind of bull shut posting .The MVA was complacent ,lazy and incompetent so they lost.The MBT was cunning ,worked hard gave hollow but fantastic promise and won .Posting from mobile but I will try to give the ways cross checking are done and the somebody can point out how it can be tampered. [https://www.youtube.com/watch?v=3B4GC39nALU](https://www.youtube.com/watch?v=3B4GC39nALU) 'Classic example of ignorant people thinking they are the expert' Source please I understand your frustation and would apologise for insinuating that you compromised your integrity. That was not my intention. What you did is a service to the state and country and I appreciate your efforts. Looks like Congress IT cell got new orders.. The zonal officers are supposed to update the election commission website every 2 hours .The last update happens at 5pm and the final one after 7pm .The polling ends at 6pm but whoever is present inside the polling premise and standing in line is allowed to vote .The Presiding officers give out numbered chits with the last person of the line getting the chit with Serial number 1 to avoid people jumping walls and joining the queues. So poll can happen till 7:00pm also.Later the final votes are tallied checked with polling agents and then updated on the websites .Maybe last minute voting happened because of BJP agent getting their voters out or Zonal officers being lazy and incompetent .There is fairly good enough explanation for this instead of EVM fraud. I am not saying that it is because of EVM fraud. I want to believe that it's not. EC should come out and give explanation for these large discrepancies. 8% is huge, when you think about it. Last minute voting and Zonal officers being lazy does not explain it. That's all you are capable of?? Copy, paste. Is there an acceptable range observed previously to say whether or not 8% is high? My point is this is quite a manual process so maybe inconsistency can creep in . For fraud people are looking at wrong place.There is a voter listing done before election by klock level officer .If I can influence he can easily remove him/her from voter list claiming he is shifted from the region . Voter apathy is one of the biggest reason (like in Loksabha election ) happened. rally chairs not being filled does not equal election fraud Aankhe kholo. Stop being a sheep. Do a simple google search ffs. Whenever elections are happening in BJP controlled states, vote % is shooting up avg 5-7%, this margin is actually the margin to win elections in India. This same thing happened during General elections 2024 where additional 5 crore voters were added after voting closed and form 17c data which gives the actual number of people who voted. They have started doing this now because they know they are losing elections. Do you all not read the news? UP gunda CM was saying that ROs didn't cooperate with UP govt that's why they lost elections in June. They lost Karnataka last year because they believed they will win that's why didn't bother to manipulate votes on large scale. Now, they KNOW everyone is fed up of them, so they have started mass rigging of elections. Democracy is dead in India. It happens in every election. I guess it is because percentage can't be compiled in real time, and data is compiled as and when it is received (which can be upto the morning of the next day). There are more questions raise on such discrepancies, like here: [https://m.thewire.in/article/news/504313-additional-votes-maharashtra-data-mismatch-between-votes-polled-and-counted/amp](https://m.thewire.in/article/news/504313-additional-votes-maharashtra-data-mismatch-between-votes-polled-and-counted/amp) The ECI reply seems reasonable. The fact that many inconsistencies in the reported data were pointed out by ECI, and were later updated in the article by the editor, shows that the initial reporting was not done with due diligence. It is good to question though. I dont think Hindu Muslim angle has a short shelf life. Everytime the fire starts to die down, they will add fuel to fire by creating unnecessary and non existing issues. Just see how the Ppl in esteemed positions like CMs and more are peddling the same bullshit.. Yes too much data involved, agree, chances of error are there. Could be a case of inefficiency. However I was talking about the voting done after close of timing. Additional votes, there could be a discrepancy of 1% or <, but this seems to be a big anomaly (7.8%). Till 5pm, the data is only approximate. They have to count from the voter list & then reconfirm from the EVMs. My guess is the 5pm data is from manual counting of the ticks in voter list. Also, all centers are not able to communicate their tally to the central office, due to various logistical issues. It is only when the EVMs are brought back to the centers, can the real tally be confirmed. It would be nice of ECI if they make a video of the process. Not standalone. Taken together with the other abnormalities, I will say that there is definitely smoke. You are not answerable. The ECI very much is. Dr. Parakala also mentions about the manual paper ballot regime where data would be available in a short time despite the logistical difficulties due to technology. In today's world of internet and mobile, the delay and discrepancy seems absurd, creates more suspicion and mistrust, plus ECs reluctance to be transparent. EVM tampering is not possible I agree, but additional voting after the election time is over is a possibility, after all the govt machinery is under the political leadership. The answers from EC are not forthcoming and deflective at best and doesn't give confidence. The truth will prevail one day. Till then we can't do anything about it. There is no credible evidence of fraud, the fact that you have to drop to saying Modi's rally was empty really weakens your case and lets the Opposition keep blaming rigging instead of making serious changes ECI doesn't use internet in the voting process. It's how EVMs are ensured to be safe. But regarding the votes added after voting hours, it may be possible that manual votes can be added. But isn't there something like a seal on the EVMs, which is applied when voting ends? I'm not sure how the system works. And I think you're implying that ECI officials manually add votes after voting hours are done. This is quite risky because government officials have different party orientations. Also, in this world of internet, something like that can leak quickly & lead to suspensions. No officer would risk his permanent government job for a temporary government. I agree but EC should clarify as such doubts are not good for aby democracy. Based on the discussion I saw on TV between Karan Thapar and Parkala P , it used to be under 1% but in recent LS, HR elections and MH elections it has been in the range of 8-12%. In Jharkhand it was 1% Agree. Let the ECI give responses to the questions. yes Some machines and officials with favourable orientation is all is needed to swing the result. The delay could be explained by that. I meant internet and mobile used for reporting, not for the EVM's operation. Anyways, our opinions doesn't matter. Unless there is booth capturing it’s near impossible to manipulate elections according to my dad who is a retired gov employee and been on election duty for over 40 years. How delusional are you?? Do you live in maharashtra? Do you have any idea what was rahul Gandhi speaking about in his rally? Completely unrelated to the topics of election? RSS has been actively going door to door urging people to vote, they where placing pamphlets not evidently naming the bjp but just asking for votes, they have been to my house saying that you can vote anyone you want but please vote, less participation resulting in unwanted candidates getting elected, signaling their recent loss in general election. I can't think of any reasons that this elections voting turnout is less than last year's. ECI should definitely give explanation about why the stagerring 8% increase in the last hour, but voting turnout should be more than last elections. For everyone thinking that BJP has hacked EVMs, ask yourself this, why would they give themselves not even simple majority in LS Elections let alone 400 paar, and why would they lose Ayodhya? Why did they not ensure Annamalai won in TN? This is the worst hacking scheme ever it is a conspiracy theory, just because your candidate didn't win doesn't mean there was foul play... Firstly, if there is no issues then the ECI should respond to all the questions of the people. Including releasing the videography of the slip distribution and voting for votes polled after 5 p.m. You need the local state with you to tamper. In UP, Yogi didn't allow it as there was a plan to replace him with a puppet CM. They changed the EVM hardware. This is not what hacking is. Even BBC had to use inverted commas on the word hack. But yeah, believe what you want to. I mean there can be a fair play but u can observe the reportings of Maharashtra, 5 lakh more voter count appearing after polling numbers were closed, how? Many Evm machines running all day and still at a 99% battery, how? UP- cops and b party checking voter’s ID, they dont have permission to, but still do, and send back folks from minority communities, not allowed to enter polling booth stations, how? All this is there out in open, we can obviously close our eyes and say everything is fair in country like India which breathes on corruption and incompetence. :) Do you have enough proof to stand in the courts? if not then it is just your feelings. It is ironic EVMs are only \"hacked\" when bjp wins and in other states where bjp lost, it works somehow... you have to realize there is no conspiracy, the public has rejected dynastic politics... So the proof of EVM not being tampered is bjp loosing few states? That’s just a strawman argument. Also, its a lil delusional to think Dynasty politics is not in BJP. Anyways i rest my case cuz our discussion will lead to no point since i am discussing about EVM and u are discussing about political parties, hence ur biasness is but obvious here. alright, provide one credible piece of evidence which will stand in the courts that shows evm is tampered with."
}