{
    "id": "14omyhf",
    "title": "Sharad Pawar says Ajit's rebellion individual decision; 'Happy that PM Modi...'",
    "url": "https://www.hindustantimes.com/india-news/sharad-pawar-says-ajits-rebellion-individual-happy-that-pm-modi-101688296065886-amp.html",
    "selftext": "Sharad Pawar said he knows how to resurrect the party. Disowning Ajit Pawar, the NCP chief said Mamata Banerjee and Mallikarjun Kharge called him.",
    "flair": "Politics",
    "score": 36,
    "num_comments": 4,
    "created_utc": 1688300439.0,
    "convurl": "https://external-preview.redd.it/YaNTtxJCmNgjnO4tAnStCpRWLbyg2lDa4bWZBImMROQ.jpg?auto=webp&s=2409c28d9b626f06637b7f5a648276e7bde0d5c2",
    "comments": [
        "Others react:\n\n[‘People are watching’: Akhilesh Yadav's attack after Ajit Pawar joins Shinde-Fadnavis govt](https://www.hindustantimes.com/india-news/sp-akhilesh-yadav-ajit-pawar-shinde-fadnavis-govt-ncp-supriya-sule-101688294705278-amp.html)\n\n[‘Mother of democracy…’: Kapil Sibal's dig after Ajit Pawar joins Maharshtra govt](https://www.hindustantimes.com/india-news/congress-kapil-sibal-ncp-ajit-pawar-pm-modi-maharashtra-eknath-shinde-fadnavis-govt-101688299182693-amp.html)\n\n>Heartbroken to see political state of Maharashtra: Raj Thackeray\n\n>Maharashtra Navnirman Sena chief Raj Thackeray lamented the political environment in Maharashtra and said Ajit Pawar's move today was the first act of a process to \"discard the burden of Uddhav Thackeray\". \"The first team from the NCP camp has left to join hands with power. The remaining team will join in soon,\" he said.\n\n>\"The Maharashtra BJP was not liking the unnecessary importance being given to Eknath Shinde and they have now found a counter to him. What this has highlighted is the muddied political environment in Maharashtra. I feel heartbroken to see the political state or Maharashtra which has provided direction to the country,\" he said.",
        ">Sharad Pawar said he is happy that PM Modi freed some NCP leaders of corruption charges now that they are Maharashtra ministers.\n\n>Sharad Pawar said he was not worried over what happened today. \"Got a call from Mamata Banerjee and Mallikarjun Kharge. They have extended their support. There is no problem if someone is claiming ownership over NCP. We will got to the people and seek their support. I am confident they will support us. Tomorrow, I will take the blessings of YB Chavan (former Maharashtra CM) and will hold a public meeting,\" Sharad Pawar said.\n\n>Credit goes to PM Modi; My home is not split\n\n\n>\"I will never say that my home has split, this issue is not regarding my home, this is the issue of people. I am worried about the future of those who left. I want to give the credit for this to PM Modi. Two days ago, he had made statements and after that statement, some people started feeling uneasy, some of them were also facing ED actions,\" Sharad Pawar said.\n\n>“Two days ago the PM had said about NCP... He had said two things in his statement that NCP is a finished party. He mentioned irrigation complaints and allegations of corruption. I am happy that some of my colleagues have taken oath. From this (joining the NDA government) it is clear that all the charges have been cleared. I am thankful to him,” Sharad Pawar said.\n\n>Action against Praful Patel\n\n>\"Being the president, I had appointed Praful Patel and Sunil Tatkare but they did not follow their responsibilities. Therefore, I have to take some action against them,\" Sharad Pawar said. Praful Patel was present at Ajit Pawar's swearing-in and also at the press conference after that\n\n>Won't fight legally: Sharad Pawar on future course of action\n\n>Sharad Pawar said he won't fight with Ajit Pawar over election symbol, but will go to the people",
        "When Ajit invariably changes teams again he will be welcomed with open arms, we all know the drill.",
        "Love this guy"
    ],
    "cleaned_text": "sharad pawar says ajits rebellion individual decision happy pm modi sharad pawar said knows resurrect party disowning ajit pawar ncp chief said mamata banerjee mallikarjun kharge called ",
    "cleaned_title": "sharad pawar says ajits rebellion individual decision happy pm modi",
    "cleaned_selftext": "sharad pawar said knows resurrect party disowning ajit pawar ncp chief said mamata banerjee mallikarjun kharge called",
    "cleaned_comments": "others react people watching akhilesh yadavs attack ajit pawar joins shindefadnavis govthttpswwwhindustantimescomindianewsspakhileshyadavajitpawarshindefadnavisgovtncpsupriyasuleamphtml mother democracy kapil sibals dig ajit pawar joins maharshtra govthttpswwwhindustantimescomindianewscongresskapilsibalncpajitpawarpmmodimaharashtraeknathshindefadnavisgovtamphtml heartbroken see political state maharashtra raj thackeray maharashtra navnirman sena chief raj thackeray lamented political environment maharashtra said ajit pawars move today first act process discard burden uddhav thackeray first team ncp camp left join hands power remaining team join soon said maharashtra bjp liking unnecessary importance given eknath shinde found counter highlighted muddied political environment maharashtra feel heartbroken see political state maharashtra provided direction country said sharad pawar said happy pm modi freed ncp leaders corruption charges maharashtra ministers sharad pawar said worried happened today got call mamata banerjee mallikarjun kharge extended support problem someone claiming ownership ncp got people seek support confident support us tomorrow take blessings yb chavan former maharashtra cm hold public meeting sharad pawar said credit goes pm modi home split never say home split issue regarding home issue people worried future left want give credit pm modi two days ago made statements statement people started feeling uneasy also facing ed actions sharad pawar said two days ago pm said ncp said two things statement ncp finished party mentioned irrigation complaints allegations corruption happy colleagues taken oath joining nda government clear charges cleared thankful sharad pawar said action praful patel president appointed praful patel sunil tatkare follow responsibilities therefore take action sharad pawar said praful patel present ajit pawars swearingin also press conference wont fight legally sharad pawar future course action sharad pawar said wont fight ajit pawar election symbol go people ajit invariably changes teams welcomed open arms know drill love guy",
    "light_cleaned_title": "Sharad Pawar says Ajit's rebellion individual decision; 'Happy that PM Modi...'",
    "light_cleaned_selftext": "Sharad Pawar said he knows how to resurrect the party. Disowning Ajit Pawar, the NCP chief said Mamata Banerjee and Mallikarjun Kharge called him.",
    "light_cleaned_comments": "Others react: [‘People are watching’: Akhilesh Yadav's attack after Ajit Pawar joins Shinde-Fadnavis govt](https://www.hindustantimes.com/india-news/sp-akhilesh-yadav-ajit-pawar-shinde-fadnavis-govt-ncp-supriya-sule-101688294705278-amp.html) [‘Mother of democracy…’: Kapil Sibal's dig after Ajit Pawar joins Maharshtra govt](https://www.hindustantimes.com/india-news/congress-kapil-sibal-ncp-ajit-pawar-pm-modi-maharashtra-eknath-shinde-fadnavis-govt-101688299182693-amp.html) >Heartbroken to see political state of Maharashtra: Raj Thackeray >Maharashtra Navnirman Sena chief Raj Thackeray lamented the political environment in Maharashtra and said Ajit Pawar's move today was the first act of a process to \"discard the burden of Uddhav Thackeray\". \"The first team from the NCP camp has left to join hands with power. The remaining team will join in soon,\" he said. >\"The Maharashtra BJP was not liking the unnecessary importance being given to Eknath Shinde and they have now found a counter to him. What this has highlighted is the muddied political environment in Maharashtra. I feel heartbroken to see the political state or Maharashtra which has provided direction to the country,\" he said. >Sharad Pawar said he is happy that PM Modi freed some NCP leaders of corruption charges now that they are Maharashtra ministers. >Sharad Pawar said he was not worried over what happened today. \"Got a call from Mamata Banerjee and Mallikarjun Kharge. They have extended their support. There is no problem if someone is claiming ownership over NCP. We will got to the people and seek their support. I am confident they will support us. Tomorrow, I will take the blessings of YB Chavan (former Maharashtra CM) and will hold a public meeting,\" Sharad Pawar said. >Credit goes to PM Modi; My home is not split >\"I will never say that my home has split, this issue is not regarding my home, this is the issue of people. I am worried about the future of those who left. I want to give the credit for this to PM Modi. Two days ago, he had made statements and after that statement, some people started feeling uneasy, some of them were also facing ED actions,\" Sharad Pawar said. >“Two days ago the PM had said about NCP... He had said two things in his statement that NCP is a finished party. He mentioned irrigation complaints and allegations of corruption. I am happy that some of my colleagues have taken oath. From this (joining the NDA government) it is clear that all the charges have been cleared. I am thankful to him,” Sharad Pawar said. >Action against Praful Patel >\"Being the president, I had appointed Praful Patel and Sunil Tatkare but they did not follow their responsibilities. Therefore, I have to take some action against them,\" Sharad Pawar said. Praful Patel was present at Ajit Pawar's swearing-in and also at the press conference after that >Won't fight legally: Sharad Pawar on future course of action >Sharad Pawar said he won't fight with Ajit Pawar over election symbol, but will go to the people When Ajit invariably changes teams again he will be welcomed with open arms, we all know the drill. Love this guy"
}