{
    "id": "13s6nr5",
    "title": "Help me find this song stuck in my head",
    "url": "https://www.reddit.com/r/india/comments/13s6nr5/help_me_find_this_song_stuck_in_my_head/",
    "selftext": "I heard a song a month or two back, it was a hindi Indie song by a female singer. Got the tune stuck in my head today randomly but I can't remember the name of the song or the artist, for the life of me. The music is somewhat EDM-ish (very Ritviz like), and in the lyrics the girl's asking whoever she's in love with to come and hurt her again. I guess some parts of the lyrics go like *Aao na*..... something something.....*dard deke jao na*  \n\nBeen trying to google those lyrics for an hour now but NOTHING, searched through all possible Spotify playlists but NOTHING. I think it's a fairly new song\n\n\nEDIT: Found it finally after endless browsing through Spotify: [Silly by Rii](https://open.spotify.com/track/1JouRQ8Ak8nwCKFXm7JojK?si=1vZjgPkDQ8eqapfdSs9B9A).",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 5,
    "created_utc": 1685087199.0,
    "convurl": "https://external-preview.redd.it/Hv7HgKm75MvtVIBZQkLCGzm9kJOiF_0ByUL6hpo3LDA.jpg?auto=webp&v=enabled&s=a002a6aa9650a114ef17181750ff4515b4de18a4",
    "comments": [
        "Liggi",
        "😑 Female singer hai Liggi ki? Jo maine bola uss se match kr rahe hain lyrics? 😑",
        "Noooooo, ugh 😫  \nRead the post again. It's not even a bollywood song (much less an item song), it's indie. And the music is EDM",
        "Use Google assistant to just sing a tune of song.\nWatches a video where Google assistant was able to find song just with a little bit of tune.\n\nSay \" find this song (your tune)\""
    ],
    "cleaned_text": "help find song stuck head heard song month two back hindi indie song female singer got tune stuck head today randomly cant remember name song artist life music somewhat edmish ritviz like lyrics girls asking whoever shes love come hurt guess parts lyrics go like aao na something somethingdard deke jao na trying google lyrics hour nothing searched possible spotify playlists nothing think fairly new song edit found finally endless browsing spotify silly riihttpsopenspotifycomtrackjourqaknwckfxmjojksivzjgpkdqeqapfdssba ",
    "cleaned_title": "help find song stuck head",
    "cleaned_selftext": "heard song month two back hindi indie song female singer got tune stuck head today randomly cant remember name song artist life music somewhat edmish ritviz like lyrics girls asking whoever shes love come hurt guess parts lyrics go like aao na something somethingdard deke jao na trying google lyrics hour nothing searched possible spotify playlists nothing think fairly new song edit found finally endless browsing spotify silly riihttpsopenspotifycomtrackjourqaknwckfxmjojksivzjgpkdqeqapfdssba",
    "cleaned_comments": "liggi female singer hai liggi ki jo maine bola uss se match kr rahe hain lyrics noooooo ugh read post even bollywood song much less item song indie music edm use google assistant sing tune song watches video google assistant able find song little bit tune say find song tune",
    "light_cleaned_title": "Help me find this song stuck in my head",
    "light_cleaned_selftext": "I heard a song a month or two back, it was a hindi Indie song by a female singer. Got the tune stuck in my head today randomly but I can't remember the name of the song or the artist, for the life of me. The music is somewhat EDM-ish (very Ritviz like), and in the lyrics the girl's asking whoever she's in love with to come and hurt her again. I guess some parts of the lyrics go like *Aao na*..... something something.....*dard deke jao na* Been trying to google those lyrics for an hour now but NOTHING, searched through all possible Spotify playlists but NOTHING. I think it's a fairly new song EDIT: Found it finally after endless browsing through Spotify: [Silly by Rii](https://open.spotify.com/track/1JouRQ8Ak8nwCKFXm7JojK?si=1vZjgPkDQ8eqapfdSs9B9A).",
    "light_cleaned_comments": "Liggi 😑 Female singer hai Liggi ki? Jo maine bola uss se match kr rahe hain lyrics? 😑 Noooooo, ugh 😫 Read the post again. It's not even a bollywood song (much less an item song), it's indie. And the music is EDM Use Google assistant to just sing a tune of song. Watches a video where Google assistant was able to find song just with a little bit of tune. Say \" find this song (your tune)\""
}