{
    "id": "1dcq7wr",
    "title": "Neet 2024 even results of some students were discarded .",
    "url": "https://youtu.be/77pFAMOePxg?si=bpq2lR119g2gLExL",
    "selftext": "Girl whose result was discarded. The girl had worked her year in preparation and they will discard it just cause OMR sheet was torn. If automated OMR evaluation is not working they can use a manual method. Or was this done intentionally to sabotage the result.",
    "flair": "Rant / Vent",
    "score": 332,
    "num_comments": 42,
    "created_utc": 1718038133.0,
    "convurl": "https://external-preview.redd.it/DzwBJWa2OS9MhLOsq-JIhP_S4dyd3kMP5JO2_PwiIEQ.jpg?auto=webp&s=4e2e9f585a0cdc26374f3a25db3258e84b36701c",
    "comments": [
        "we Indians are with you. This system f\\*cked us badly.",
        "Is NEET not a computerized test because there aren't enough computers? Maybe they can conduct it like JEE Mains with multiple shifts.",
        "This girls is a fraud, whatever mail she is showing in the video is from some unknown source most probably she did all this for fame.",
        "Source: I am an andhbhakt",
        "Guys upvote it. \n\nThis is a scam of magnanimous level. Please visit, learn and review the results and you will likely infer someone is literally selling the seats with co-ordination of people in high level.",
        "It is verified. There is court order also posted. \n\nHave a look.",
        "No it's exposed she changed her application number 3 with 8 check",
        "So where is the source?",
        "Wai on sec",
        "She is fraud, most probably a move by NTA to disregard claims and PIL’s filed by people",
        "https://preview.redd.it/opfbc7e70t5d1.png?width=1080&format=pjpg&auto=webp&s=0c8b9c236cd41c9e04a67dbf607c478bd3d1e5b7",
        "This is her real application no. : 240411340741\n\nAnd her DOB: 07/11/2003\n\ncheck for yourself.",
        "Can you explain what you mean? Some say she is fraud because she is trying to discredit NTA. You seem to be saying she is fraud because she somehow discredits other PILs. So many people saying she is fraud but for opposite reasons",
        "Its was just my opinion that this was planned and executed by NTA, to divert the public attention, alakh sir said that many fake cases are arising amidst all of these chaos, they are trying to suppress the voices of those who are truly affected(NEET students)",
        "True even I checked… comments on that video is also turned off.. it’s just a scam.\n\nhttps://preview.redd.it/wr28109y9t5d1.jpeg?width=1170&format=pjpg&auto=webp&s=959aecc56d0166d25681cbe561cedf368bd3124e",
        "https://preview.redd.it/qjkv25epot5d1.jpeg?width=1080&format=pjpg&auto=webp&s=fb73a26255d4d7c3cd99303bc44604c50ea7af13",
        "this is fake",
        "Lol https://youtu.be/ch9uNpsy7rM?si=KBVtbE6NxWeY6tvT",
        "https://youtu.be/ch9uNpsy7rM?si=KBVtbE6NxWeY6tvT",
        "Oh my god… OG artist",
        "Depression kya hai bhai ? Someone cheated me , so I am going into depression ??? What the hell !!",
        "The source is right below you, how does it feel now?",
        "That's just a bullshit excuse. If Bank exams can be conducted using computerized test then definitely Neet can have it similarly.",
        "Link for the marksheet \nhttps://neet.ntaonline.in/frontend/web/scorecard/resultqr?applicationNumber=240411340741&apprefno=NTA739877941",
        "Ahh yes COVID 19 ki vaccine bnane wali didi ki neet bhi clear ho hai hai but result nahi de rahe neet wale. Ese wahiyad scammers hi apda mai avsar dundhkar apna matlab sadhne mai Lage rhete hai jisse Jo asli victim's  hai uski authenticity km hoti jati hai in short these society cancer's are the other reason why we are an falling society",
        "this girl also claimed that she made covid vaccine in 2020",
        "Man everything is a fraud these days",
        "Thanks. Seems I reacted too quickly.",
        "Since it's there, I have changed my mind.",
        "Source:https://youtu.be/ch9uNpsy7rM?si=KBVtbE6NxWeY6tvT"
    ],
    "cleaned_text": "neet even results students discarded girl whose result discarded girl worked year preparation discard cause omr sheet torn automated omr evaluation working use manual method done intentionally sabotage result ",
    "cleaned_title": "neet even results students discarded",
    "cleaned_selftext": "girl whose result discarded girl worked year preparation discard cause omr sheet torn automated omr evaluation working use manual method done intentionally sabotage result",
    "cleaned_comments": "indians system fcked us badly neet computerized test arent enough computers maybe conduct like jee mains multiple shifts girls fraud whatever mail showing video unknown source probably fame source andhbhakt guys upvote scam magnanimous level please visit learn review results likely infer someone literally selling seats coordination people high level verified court order also posted look exposed changed application number check source wai sec fraud probably move nta disregard claims pils filed people real application dob check explain mean say fraud trying discredit nta seem saying fraud somehow discredits pils many people saying fraud opposite reasons opinion planned executed nta divert public attention alakh sir said many fake cases arising amidst chaos trying suppress voices truly affectedneet students true even checked comments video also turned scam fake lol oh god og artist depression kya hai bhai someone cheated going depression hell source right feel thats bullshit excuse bank exams conducted using computerized test definitely neet similarly link marksheet ahh yes covid ki vaccine bnane wali didi ki neet bhi clear ho hai hai result nahi de rahe neet wale ese wahiyad scammers hi apda mai avsar dundhkar apna matlab sadhne mai lage rhete hai jisse jo asli victims hai uski authenticity km hoti jati hai short society cancers reason falling society girl also claimed made covid vaccine man everything fraud days thanks seems reacted quickly since changed mind sourcehttpsyoutubechunpsyrmsikbvtbenxweytvt",
    "light_cleaned_title": "Neet 2024 even results of some students were discarded .",
    "light_cleaned_selftext": "Girl whose result was discarded. The girl had worked her year in preparation and they will discard it just cause OMR sheet was torn. If automated OMR evaluation is not working they can use a manual method. Or was this done intentionally to sabotage the result.",
    "light_cleaned_comments": "we Indians are with you. This system f\\*cked us badly. Is NEET not a computerized test because there aren't enough computers? Maybe they can conduct it like JEE Mains with multiple shifts. This girls is a fraud, whatever mail she is showing in the video is from some unknown source most probably she did all this for fame. Source: I am an andhbhakt Guys upvote it. This is a scam of magnanimous level. Please visit, learn and review the results and you will likely infer someone is literally selling the seats with co-ordination of people in high level. It is verified. There is court order also posted. Have a look. No it's exposed she changed her application number 3 with 8 check So where is the source? Wai on sec She is fraud, most probably a move by NTA to disregard claims and PIL’s filed by people This is her real application no. : 240411340741 And her DOB: 07/11/2003 check for yourself. Can you explain what you mean? Some say she is fraud because she is trying to discredit NTA. You seem to be saying she is fraud because she somehow discredits other PILs. So many people saying she is fraud but for opposite reasons Its was just my opinion that this was planned and executed by NTA, to divert the public attention, alakh sir said that many fake cases are arising amidst all of these chaos, they are trying to suppress the voices of those who are truly affected(NEET students) True even I checked… comments on that video is also turned off.. it’s just a scam. this is fake Lol Oh my god… OG artist Depression kya hai bhai ? Someone cheated me , so I am going into depression ??? What the hell !! The source is right below you, how does it feel now? That's just a bullshit excuse. If Bank exams can be conducted using computerized test then definitely Neet can have it similarly. Link for the marksheet Ahh yes COVID 19 ki vaccine bnane wali didi ki neet bhi clear ho hai hai but result nahi de rahe neet wale. Ese wahiyad scammers hi apda mai avsar dundhkar apna matlab sadhne mai Lage rhete hai jisse Jo asli victim's hai uski authenticity km hoti jati hai in short these society cancer's are the other reason why we are an falling society this girl also claimed that she made covid vaccine in 2020 Man everything is a fraud these days Thanks. Seems I reacted too quickly. Since it's there, I have changed my mind. Source:https://youtu.be/ch9uNpsy7rM?si=KBVtbE6NxWeY6tvT"
}