{
    "id": "mh1c5p",
    "title": "#MobiKwikDataLeak: Our representation to CERT-IN asking for an inquiry under Section 70B(6) of the IT Act",
    "url": "https://www.reddit.com/r/india/comments/mh1c5p/mobikwikdataleak_our_representation_to_certin/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/79nt4hnhobq61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=528285f603f55431e992abff6d09b7ff375eb1be\n\n&amp;#x200B;\n\n**Tl;dr**  \n\n\nIndia is witnessing one of the most significant data breaches in history. Users, security researchers and news organisations have reported that data of 10 crore Indians, including their passport details, addresses and phone numbers, is available for sale on the dark web. As per press reports, the data was in the custody of MobiKwik, which provides a mobile based payment system. While MobiKwik has denied the data breach, independent security researchers and [**Indian Express**](https://indianexpress.com/article/business/companies/as-data-leak-claims-resurface-mobikwik-plans-forensic-audit-7251966/) have verified that details of MobiKwik users are available on the dark web. We have [**written**](https://drive.google.com/file/d/1cXXVX2qqqCx0SRo8DuoZHa4wFM682-c8/view?usp=sharing) to the Computer Emergency Response Team (CERT-IN) asking them to initiate an inquiry over the data breach in terms of Section 70B(6) of the Information Technology Act, 2000. In this post, we point out the five steps MobiKwik must take to alleviate the situation.\n\n### Background\n\nOver the past month, several users, [**independent security researchers**](https://www.deccanherald.com/business/technology/data-of-10-crore-mobikwik-users-on-sale-on-darknet-elliot-anderson-backs-researchers-claim-company-denies-breach-967962.html) and [**news organisations**](https://indianexpress.com/article/technology/tech-news-technology/mobikwik-database-leaked-on-dark-web-company-denies-any-data-breach-7251448/) have reported that data - over 8.2 TB in size - of MobiKwik users has been put on sale over the dark web with an asking price of 1.5 Bitcoin which is approximately equal to INR 65 Lakhs. This data leak contains Know Your Customer (KYC) details, passport details, addresses, email ids, phone numbers and aadhar card details of around 10 Crore Indians and violates their right to privacy. The data breach follows a [**number of other data breaches**](https://internetfreedom.in/security-incidents-and-the-personal-data-protection-bill/) that have affected Indians.\n\n### MobiKwik’s response\n\nMobiKwik provides access to mobile based payment systems developed by the National Payments Corporation of India. The breach was [**first uncovered**](https://twitter.com/rajaharia/status/1367438237921243142) on 4th March 2021. MobiKwik responded by denying the breach and [**threatened**](https://twitter.com/MobiKwik/status/1367489330902675463) to take legal action against the security researcher who uncovered the  breach and suggested that the researcher was ‘*trying to grab media attention*’. In the past few days, in wake of [**numerous reports**](https://indianexpress.com/article/business/companies/as-data-leak-claims-resurface-mobikwik-plans-forensic-audit-7251966/) verifying the data breach, MobiKwik released a [**blogpost**](https://blog.mobikwik.com/message-from-the-company/) where they again denied the data breach and have claimed that the breach could be because users ‘*have uploaded their information on multiple platforms’.*  \n\n\nMobiKwik’s denial, which shifts the blame upon users, must be taken with a pinch of salt. Independent researchers have [**indicated**](https://www.databreaches.net/in-threat-actor-offers-to-sell-8-tb-of-mobikwiks-personal-and-financial-data-on-almost-100m-consumers/) that a data breach has occurred. [**Indian Express**](https://indianexpress.com/article/business/companies/as-data-leak-claims-resurface-mobikwik-plans-forensic-audit-7251966/) has verified that details of MobiKwik users are available on the dark web. Other [**reports**](https://techcrunch.com/2021/03/30/mobikwik-investigating-data-breach-after-100m-user-records-found-online/) even suggest that MobiKwik has sought help from Amazon last month after they discovered that some person who did not belong to their organisation, downloaded their ‘*S3 data*’.\n\n### What we expect from MobiKwik\n\nWe believe that MobiKwik, like many Indian technology companies, need to do better given they are today driving global innovation. It is disappointing for MobiKwik, to dismiss reports of a data breach and also issue threats against a security researcher - both steps which are against the interests of its users. We think it is necessary for MobiKwik to immediately undertake the following five steps to alleviate the situation:  \n\n\n1. **Inform users:** MobiKwik should individually inform each affected user of the extent to which the data breach has impacted them.\n2. **Provide redressal to users:** MobiKwik should devise and implement a strategy to provide adequate remedies to such users, including but not limited to compensation to the users in terms of Section 43A of the Information Technology Act, 2000.\n3. **Fix accountability:** MobiKwik should provide an explanation on why such a breach took place, provide details of the breach, including the number of users affected by the breach and the date and time on which the breach took place, and issue a statement explaining the steps taken to ensure such a breach does not occur in the future.\n4. **Permit a third-party audit**: The circumstances require that an independent agency conducts a forensic data security audit. We commend MobiKwik for making a public commitment to conduct it but it must be done independently through a firm of repute and its findings must be made public.\n5. **Recall threat of legal action:** As mentioned above, MobiKwik has threatened to take legal steps against the cyber security researcher who uncovered the data breach. As we have pointed out [**previously**](https://internetfreedom.in/security-researchers-need-legislative-protection-from-vexatious-lawsuits/), cyber security researchers constantly face threats of legal prosecution even when they disclose data breaches in good faith. While there [**remains a need**](https://www.bbc.com/news/world-asia-india-50583733) to provide legislative protection to such researchers, threatening researchers with legal prosecution is irresponsible. MobiKwik should immediately recall such threats especially since many users and other independent cybersecurity researchers have also claimed that a data breach has occurred.\n\n### Letter to Computer Emergency Response Team (CERT-IN)\n\nIn view of the massive data breach, violation of the right to privacy and the lack of a response by MobiKwik, we wrote a letter to CERT-IN. Under the Information Technology Act, 2000, CERT-IN is responsible for collecting, analysing, and disseminating information on cyber incidents and undertaking measures to handle cybersecurity incidents. In the letter, we have highlighted the concerns we have raised above and requested CERT-IN to conduct an inquiry into the data breach and conduct of MobiKwik, and require executives of MobiKwik to provide detailed explanations to their office in terms of Section 70B(6) of the Information Technology Act, 2000. We are hopeful that an enquiry by CERT-IN may compel MobiKwik to act responsibly and even provide compensation to its users as per Section 43A of the Information Technology Act, 2000.\n\n### Personal Data Protection Bill does not provide safeguards #SaveOurPrivacy\n\nA broader policy ask also arises from this specific incident as we have highlighted it in the past with respect to data breaches by other entities, both public and private. Considering the frequency and the scale of such data breaches, Parliament must provide statutory protections to users whose rights are violated. As we have [**pointed out**](https://internetfreedom.in/security-incidents-and-the-personal-data-protection-bill/) previously, the Personal Data Protection Bill, 2019 (PDPB) does contain several clauses relating to security and breaches. For example, Clause 25 deals with the breach of personal data. The clause states that in cases where a data breach may cause harm to the data principal, the data fiduciary must inform the proposed Data Protection Authority. However, the clause does not require the data fiduciary (in this case, MobiKwik) to inform the data principal (in this case, users whose data is now public). It is instead left to the Authority to decide: a) whether the data fiduciary must inform the data principal, b) the remedial action the data fiduciary must undertake, and c) the details of the data breach that can be made public.\n\nIn contradistinction to PDPB, a private member bill [**(the Personal Data and Information Privacy Code Bill, 2019)**](https://drive.google.com/file/d/1DReq96e-FLsSoKUvK94_-VCtu2Y1PE97/view) introduced by MP D. Ravikumar guarantees data subjects the right to be informed about any breaches of their personal information, and also asks organisations to designate privacy officers to ensure security compliance.\n\nCurrently, PDPB is being reviewed by a Joint Parliamentary Committee. A conversation around PDPB is the need of the hour and we have [**started**](https://internetfreedom.in/startfromscratch-the-data-bill-series-part-1/) a four-part series where we will talk about the need for a data law, the current bill’s provisions and loopholes, what good data bills actually look like, where accountability from authorities is needed, and what you can do to advocate for your rights.\n\nApart from providing statutory protection to data principals, a crucial aspect of data regulation is ‘data minimization’. The principle of [**data minimization**](https://www.trendmicro.com/vinfo/us/security/definition/Data-Minimization) involves limiting data collection to only what is required to fulfill a specific purpose. Cumbersome KYC processes result in companies having access to large amounts of data without necessarily having the ability to securely store such data.\n\n### Important Documents\n\n1. Our letter dated 31.03.2021 to the Indian Computer Emergency Response Team to conduct an inquiry into the data breach and conduct of MobiKwik ([**link**](https://drive.google.com/file/d/1cXXVX2qqqCx0SRo8DuoZHa4wFM682-c8/view?usp=sharing))\n2. IFF post highlighting other recent security breaches ([**link**](https://internetfreedom.in/security-incidents-and-the-personal-data-protection-bill/))\n3. IFF post pointing out the security vulnerability of a website that provided for on-boarding services with BHIM ([**link**](https://internetfreedom.in/its-time-to-stop-data-breaches-and-security-vulnerabilities-we-write-to-the-it-ministry/))\n4. IFF post discussing the need to provide legislative protection to security researchers for responsible disclosures ([**link**](https://internetfreedom.in/security-researchers-need-legislative-protection-from-vexatious-lawsuits/))\n5. Public Brief and Analysis of the Personal Data Protection Bill, 2019. ([**link**](https://saveourprivacy.in/media/all/Brief-PDP-Bill-25.12.2020.pdf))",
    "flair": "Policy/Economy",
    "score": 370,
    "num_comments": 23,
    "created_utc": 1617178534,
    "convurl": "https://b.thumbs.redditmedia.com/8HCCz8lMPLqOOoD5tVNrtYtsRKrgZaOUrqM5MZyaqns.jpg",
    "comments": [
        "Mobikwik should also allow users to delete their profile and all related Person data if user wants too.",
        "Quick tip: On android, if you want to delete saved cards from Mobikwik, hold for 2 seconds on the card, delete option will appear.  \n\nI had to threaten a Mobikwik executive with RBI complaint to get this information.",
        "We need a GDPR for India as soon as we can!",
        "That will just delete the data for you,  for compliance purposes your data is still stored in the backend.",
        "One of the main principles of AWS security is that your data is yours to secure. Amazon’s responsibility is limited to the integrity of the infrastructure. If some has indeed downloaded data from S3, that’d mean mobikwik followed poor data security practices.",
        "Many have reported that the card details they deleted long ago are still in the leak. That means they just marked it as \"no-show\" to only you, but kept it saved on their end \"just-in-case.\"",
        "Lmao.",
        "that's how my card data got leaked. I requested many times to delete my saved card, but no response. So I just forgot about it until yesterday.",
        "I just asked Mobikwik and PhonePe today to give me a list of data stored even after when a user gets their account deleted on their platforms.  \n\nI'm gonna do this with every app/service where I have an account.  \n\nWaiting for their response. I'll take them to courts if they do monkey-business.",
        "I doubt you have a legal recourse for this. Because every country has laws for data retention for compliance purposes however, I’m unsure about the retention duration in India. The company I work for get legal threats from European customers covered by the GDPR to delete their data from our servers everyday and what we do is toss their legal threat into the trash can because privacy laws do not cover certain aspects of your data from a retention perspective because it’s absolutely vital for us to have that information. Not for ad targeting or building a user profile, but to ensure safety. Unfortunately, many companies do not secure those data well enough and here we are.",
        "Incompetent companies are also calling out \"Fake news\". Wonder if the govt. will bend over or actually investigate this.",
        "Mobikwik is hosted on AWS ?",
        "IFF is doing a great job here. Keep it up guys",
        "Yes, according to tech crunch. It’s mentioned in this post.",
        "You guys are best thing happen to Indian internet users.\nYet another amazing work.",
        "&gt;S3 data\n\nOh god, when will people learn ~_~\n\nEven Amazon doesn't manage to properly secure it the first time. Remember when Alexa audio records were available in a public bucket?",
        "It's already in works look up data protection bill india",
        "nah it will be suicidal for them. They going to have IPO launch soon.",
        "As a side note, check to see if you are in bad waters- [https://haveibeenpwned.com/](https://haveibeenpwned.com/)",
        "What kind of safety?",
        "For instance, card theft and  cloning.",
        "But do you delete it after the retention period or is it stored permanently on the servers?",
        "It’s removed after the retention period. A 10 year old expired card is of no use except for taking up server space."
    ],
    "cleaned_text": "mobikwikdataleak representation certin asking inquiry section b act ampxb ampxb tldr india witnessing one significant data breaches history users security researchers news organisations reported data crore indians including passport details addresses phone numbers available sale dark web per press reports data custody mobikwik provides mobile based payment system mobikwik denied data breach independent security researchers indian expresshttpsindianexpresscomarticlebusinesscompaniesasdataleakclaimsresurfacemobikwikplansforensicaudit verified details mobikwik users available dark web writtenhttpsdrivegooglecomfiledcxxvxqqqcxsroduozhawfmcviewuspsharing computer emergency response team certin asking initiate inquiry data breach terms section b information technology act post point five steps mobikwik must take alleviate situation background past month several users independent security researchershttpswwwdeccanheraldcombusinesstechnologydataofcroremobikwikusersonsaleondarknetelliotandersonbacksresearchersclaimcompanydeniesbreachhtml news organisationshttpsindianexpresscomarticletechnologytechnewstechnologymobikwikdatabaseleakedondarkwebcompanydeniesanydatabreach reported data tb size mobikwik users put sale dark web asking price bitcoin approximately equal inr lakhs data leak contains know customer kyc details passport details addresses email ids phone numbers aadhar card details around crore indians violates right privacy data breach follows number data breacheshttpsinternetfreedominsecurityincidentsandthepersonaldataprotectionbill affected indians mobikwiks response mobikwik provides access mobile based payment systems developed national payments corporation india breach first uncoveredhttpstwittercomrajahariastatus th march mobikwik responded denying breach threatenedhttpstwittercommobikwikstatus take legal action security researcher uncovered breach suggested researcher trying grab media attention past days wake numerous reportshttpsindianexpresscomarticlebusinesscompaniesasdataleakclaimsresurfacemobikwikplansforensicaudit verifying data breach mobikwik released blogposthttpsblogmobikwikcommessagefromthecompany denied data breach claimed breach could users uploaded information multiple platforms mobikwiks denial shifts blame upon users must taken pinch salt independent researchers indicatedhttpswwwdatabreachesnetinthreatactorofferstoselltbofmobikwikspersonalandfinancialdataonalmostmconsumers data breach occurred indian expresshttpsindianexpresscomarticlebusinesscompaniesasdataleakclaimsresurfacemobikwikplansforensicaudit verified details mobikwik users available dark web reportshttpstechcrunchcommobikwikinvestigatingdatabreachaftermuserrecordsfoundonline even suggest mobikwik sought help amazon last month discovered person belong organisation downloaded data expect mobikwik believe mobikwik like many indian technology companies need better given today driving global innovation disappointing mobikwik dismiss reports data breach also issue threats security researcher steps interests users think necessary mobikwik immediately undertake following five steps alleviate situation inform users mobikwik individually inform affected user extent data breach impacted provide redressal users mobikwik devise implement strategy provide adequate remedies users including limited compensation users terms section information technology act fix accountability mobikwik provide explanation breach took place provide details breach including number users affected breach date time breach took place issue statement explaining steps taken ensure breach occur future permit thirdparty audit circumstances require independent agency conducts forensic data security audit commend mobikwik making public commitment conduct must done independently firm repute findings must made public recall threat legal action mentioned mobikwik threatened take legal steps cyber security researcher uncovered data breach pointed previouslyhttpsinternetfreedominsecurityresearchersneedlegislativeprotectionfromvexatiouslawsuits cyber security researchers constantly face threats legal prosecution even disclose data breaches good faith remains needhttpswwwbbccomnewsworldasiaindia provide legislative protection researchers threatening researchers legal prosecution irresponsible mobikwik immediately recall threats especially since many users independent cybersecurity researchers also claimed data breach occurred letter computer emergency response team certin view massive data breach violation right privacy lack response mobikwik wrote letter certin information technology act certin responsible collecting analysing disseminating information cyber incidents undertaking measures handle cybersecurity incidents letter highlighted concerns raised requested certin conduct inquiry data breach conduct mobikwik require executives mobikwik provide detailed explanations office terms section b information technology act hopeful enquiry certin may compel mobikwik act responsibly even provide compensation users per section information technology act personal data protection bill provide safeguards saveourprivacy broader policy ask also arises specific incident highlighted past respect data breaches entities public private considering frequency scale data breaches parliament must provide statutory protections users whose rights violated pointed outhttpsinternetfreedominsecurityincidentsandthepersonaldataprotectionbill previously personal data protection bill pdpb contain several clauses relating security breaches example clause deals breach personal data clause states cases data breach may cause harm data principal data fiduciary must inform proposed data protection authority however clause require data fiduciary case mobikwik inform data principal case users whose data public instead left authority decide whether data fiduciary must inform data principal b remedial action data fiduciary must undertake c details data breach made public contradistinction pdpb private member bill personal data information privacy code bill httpsdrivegooglecomfileddreqeflssokuvkvctuypeview introduced mp ravikumar guarantees data subjects right informed breaches personal information also asks organisations designate privacy officers ensure security compliance currently pdpb reviewed joint parliamentary committee conversation around pdpb need hour startedhttpsinternetfreedominstartfromscratchthedatabillseriespart fourpart series talk need data law current bills provisions loopholes good data bills actually look like accountability authorities needed advocate rights apart providing statutory protection data principals crucial aspect data regulation data minimization principle data minimizationhttpswwwtrendmicrocomvinfoussecuritydefinitiondataminimization involves limiting data collection required fulfill specific purpose cumbersome kyc processes result companies access large amounts data without necessarily ability securely store data important documents letter dated indian computer emergency response team conduct inquiry data breach conduct mobikwik linkhttpsdrivegooglecomfiledcxxvxqqqcxsroduozhawfmcviewuspsharing iff post highlighting recent security breaches linkhttpsinternetfreedominsecurityincidentsandthepersonaldataprotectionbill iff post pointing security vulnerability website provided onboarding services bhim linkhttpsinternetfreedominitstimetostopdatabreachesandsecurityvulnerabilitieswewritetotheitministry iff post discussing need provide legislative protection security researchers responsible disclosures linkhttpsinternetfreedominsecurityresearchersneedlegislativeprotectionfromvexatiouslawsuits public brief analysis personal data protection bill linkhttpssaveourprivacyinmediaallbriefpdpbillpdf ",
    "cleaned_title": "mobikwikdataleak representation certin asking inquiry section b act",
    "cleaned_selftext": "ampxb ampxb tldr india witnessing one significant data breaches history users security researchers news organisations reported data crore indians including passport details addresses phone numbers available sale dark web per press reports data custody mobikwik provides mobile based payment system mobikwik denied data breach independent security researchers indian expresshttpsindianexpresscomarticlebusinesscompaniesasdataleakclaimsresurfacemobikwikplansforensicaudit verified details mobikwik users available dark web writtenhttpsdrivegooglecomfiledcxxvxqqqcxsroduozhawfmcviewuspsharing computer emergency response team certin asking initiate inquiry data breach terms section b information technology act post point five steps mobikwik must take alleviate situation background past month several users independent security researchershttpswwwdeccanheraldcombusinesstechnologydataofcroremobikwikusersonsaleondarknetelliotandersonbacksresearchersclaimcompanydeniesbreachhtml news organisationshttpsindianexpresscomarticletechnologytechnewstechnologymobikwikdatabaseleakedondarkwebcompanydeniesanydatabreach reported data tb size mobikwik users put sale dark web asking price bitcoin approximately equal inr lakhs data leak contains know customer kyc details passport details addresses email ids phone numbers aadhar card details around crore indians violates right privacy data breach follows number data breacheshttpsinternetfreedominsecurityincidentsandthepersonaldataprotectionbill affected indians mobikwiks response mobikwik provides access mobile based payment systems developed national payments corporation india breach first uncoveredhttpstwittercomrajahariastatus th march mobikwik responded denying breach threatenedhttpstwittercommobikwikstatus take legal action security researcher uncovered breach suggested researcher trying grab media attention past days wake numerous reportshttpsindianexpresscomarticlebusinesscompaniesasdataleakclaimsresurfacemobikwikplansforensicaudit verifying data breach mobikwik released blogposthttpsblogmobikwikcommessagefromthecompany denied data breach claimed breach could users uploaded information multiple platforms mobikwiks denial shifts blame upon users must taken pinch salt independent researchers indicatedhttpswwwdatabreachesnetinthreatactorofferstoselltbofmobikwikspersonalandfinancialdataonalmostmconsumers data breach occurred indian expresshttpsindianexpresscomarticlebusinesscompaniesasdataleakclaimsresurfacemobikwikplansforensicaudit verified details mobikwik users available dark web reportshttpstechcrunchcommobikwikinvestigatingdatabreachaftermuserrecordsfoundonline even suggest mobikwik sought help amazon last month discovered person belong organisation downloaded data expect mobikwik believe mobikwik like many indian technology companies need better given today driving global innovation disappointing mobikwik dismiss reports data breach also issue threats security researcher steps interests users think necessary mobikwik immediately undertake following five steps alleviate situation inform users mobikwik individually inform affected user extent data breach impacted provide redressal users mobikwik devise implement strategy provide adequate remedies users including limited compensation users terms section information technology act fix accountability mobikwik provide explanation breach took place provide details breach including number users affected breach date time breach took place issue statement explaining steps taken ensure breach occur future permit thirdparty audit circumstances require independent agency conducts forensic data security audit commend mobikwik making public commitment conduct must done independently firm repute findings must made public recall threat legal action mentioned mobikwik threatened take legal steps cyber security researcher uncovered data breach pointed previouslyhttpsinternetfreedominsecurityresearchersneedlegislativeprotectionfromvexatiouslawsuits cyber security researchers constantly face threats legal prosecution even disclose data breaches good faith remains needhttpswwwbbccomnewsworldasiaindia provide legislative protection researchers threatening researchers legal prosecution irresponsible mobikwik immediately recall threats especially since many users independent cybersecurity researchers also claimed data breach occurred letter computer emergency response team certin view massive data breach violation right privacy lack response mobikwik wrote letter certin information technology act certin responsible collecting analysing disseminating information cyber incidents undertaking measures handle cybersecurity incidents letter highlighted concerns raised requested certin conduct inquiry data breach conduct mobikwik require executives mobikwik provide detailed explanations office terms section b information technology act hopeful enquiry certin may compel mobikwik act responsibly even provide compensation users per section information technology act personal data protection bill provide safeguards saveourprivacy broader policy ask also arises specific incident highlighted past respect data breaches entities public private considering frequency scale data breaches parliament must provide statutory protections users whose rights violated pointed outhttpsinternetfreedominsecurityincidentsandthepersonaldataprotectionbill previously personal data protection bill pdpb contain several clauses relating security breaches example clause deals breach personal data clause states cases data breach may cause harm data principal data fiduciary must inform proposed data protection authority however clause require data fiduciary case mobikwik inform data principal case users whose data public instead left authority decide whether data fiduciary must inform data principal b remedial action data fiduciary must undertake c details data breach made public contradistinction pdpb private member bill personal data information privacy code bill httpsdrivegooglecomfileddreqeflssokuvkvctuypeview introduced mp ravikumar guarantees data subjects right informed breaches personal information also asks organisations designate privacy officers ensure security compliance currently pdpb reviewed joint parliamentary committee conversation around pdpb need hour startedhttpsinternetfreedominstartfromscratchthedatabillseriespart fourpart series talk need data law current bills provisions loopholes good data bills actually look like accountability authorities needed advocate rights apart providing statutory protection data principals crucial aspect data regulation data minimization principle data minimizationhttpswwwtrendmicrocomvinfoussecuritydefinitiondataminimization involves limiting data collection required fulfill specific purpose cumbersome kyc processes result companies access large amounts data without necessarily ability securely store data important documents letter dated indian computer emergency response team conduct inquiry data breach conduct mobikwik linkhttpsdrivegooglecomfiledcxxvxqqqcxsroduozhawfmcviewuspsharing iff post highlighting recent security breaches linkhttpsinternetfreedominsecurityincidentsandthepersonaldataprotectionbill iff post pointing security vulnerability website provided onboarding services bhim linkhttpsinternetfreedominitstimetostopdatabreachesandsecurityvulnerabilitieswewritetotheitministry iff post discussing need provide legislative protection security researchers responsible disclosures linkhttpsinternetfreedominsecurityresearchersneedlegislativeprotectionfromvexatiouslawsuits public brief analysis personal data protection bill linkhttpssaveourprivacyinmediaallbriefpdpbillpdf",
    "cleaned_comments": "mobikwik also allow users delete profile related person data user wants quick tip android want delete saved cards mobikwik hold seconds card delete option appear threaten mobikwik executive rbi complaint get information need gdpr india soon delete data compliance purposes data still stored backend one main principles aws security data secure amazons responsibility limited integrity infrastructure indeed downloaded data thatd mean mobikwik followed poor data security practices many reported card details deleted long ago still leak means marked noshow kept saved end justincase lmao thats card data got leaked requested many times delete saved card response forgot yesterday asked mobikwik phonepe today give list data stored even user gets account deleted platforms im gon na every appservice account waiting response ill take courts monkeybusiness doubt legal recourse every country laws data retention compliance purposes however im unsure retention duration india company work get legal threats european customers covered gdpr delete data servers everyday toss legal threat trash privacy laws cover certain aspects data retention perspective absolutely vital us information ad targeting building user profile ensure safety unfortunately many companies secure data well enough incompetent companies also calling fake news wonder govt bend actually investigate mobikwik hosted aws iff great job keep guys yes according tech crunch mentioned post guys best thing happen indian internet users yet another amazing work gts data oh god people learn even amazon doesnt manage properly secure first time remember alexa audio records available public bucket already works look data protection bill india nah suicidal going ipo launch soon side note check see bad waters httpshaveibeenpwnedcomhttpshaveibeenpwnedcom kind safety instance card theft cloning delete retention period stored permanently servers removed retention period year old expired card use except taking server space",
    "light_cleaned_title": "#MobiKwikDataLeak: Our representation to CERT-IN asking for an inquiry under Section 70B(6) of the IT Act",
    "light_cleaned_selftext": "**Tl;dr** India is witnessing one of the most significant data breaches in history. Users, security researchers and news organisations have reported that data of 10 crore Indians, including their passport details, addresses and phone numbers, is available for sale on the dark web. As per press reports, the data was in the custody of MobiKwik, which provides a mobile based payment system. While MobiKwik has denied the data breach, independent security researchers and [**Indian Express**](https://indianexpress.com/article/business/companies/as-data-leak-claims-resurface-mobikwik-plans-forensic-audit-7251966/) have verified that details of MobiKwik users are available on the dark web. We have [**written**](https://drive.google.com/file/d/1cXXVX2qqqCx0SRo8DuoZHa4wFM682-c8/view?usp=sharing) to the Computer Emergency Response Team (CERT-IN) asking them to initiate an inquiry over the data breach in terms of Section 70B(6) of the Information Technology Act, 2000. In this post, we point out the five steps MobiKwik must take to alleviate the situation. ### Background Over the past month, several users, [**independent security researchers**](https://www.deccanherald.com/business/technology/data-of-10-crore-mobikwik-users-on-sale-on-darknet-elliot-anderson-backs-researchers-claim-company-denies-breach-967962.html) and [**news organisations**](https://indianexpress.com/article/technology/tech-news-technology/mobikwik-database-leaked-on-dark-web-company-denies-any-data-breach-7251448/) have reported that data - over 8.2 TB in size - of MobiKwik users has been put on sale over the dark web with an asking price of 1.5 Bitcoin which is approximately equal to INR 65 Lakhs. This data leak contains Know Your Customer (KYC) details, passport details, addresses, email ids, phone numbers and aadhar card details of around 10 Crore Indians and violates their right to privacy. The data breach follows a [**number of other data breaches**](https://internetfreedom.in/security-incidents-and-the-personal-data-protection-bill/) that have affected Indians. ### MobiKwik’s response MobiKwik provides access to mobile based payment systems developed by the National Payments Corporation of India. The breach was [**first uncovered**](https://twitter.com/rajaharia/status/1367438237921243142) on 4th March 2021. MobiKwik responded by denying the breach and [**threatened**](https://twitter.com/MobiKwik/status/1367489330902675463) to take legal action against the security researcher who uncovered the breach and suggested that the researcher was ‘*trying to grab media attention*’. In the past few days, in wake of [**numerous reports**](https://indianexpress.com/article/business/companies/as-data-leak-claims-resurface-mobikwik-plans-forensic-audit-7251966/) verifying the data breach, MobiKwik released a [**blogpost**](https://blog.mobikwik.com/message-from-the-company/) where they again denied the data breach and have claimed that the breach could be because users ‘*have uploaded their information on multiple platforms’.* MobiKwik’s denial, which shifts the blame upon users, must be taken with a pinch of salt. Independent researchers have [**indicated**](https://www.databreaches.net/in-threat-actor-offers-to-sell-8-tb-of-mobikwiks-personal-and-financial-data-on-almost-100m-consumers/) that a data breach has occurred. [**Indian Express**](https://indianexpress.com/article/business/companies/as-data-leak-claims-resurface-mobikwik-plans-forensic-audit-7251966/) has verified that details of MobiKwik users are available on the dark web. Other [**reports**](https://techcrunch.com/2021/03/30/mobikwik-investigating-data-breach-after-100m-user-records-found-online/) even suggest that MobiKwik has sought help from Amazon last month after they discovered that some person who did not belong to their organisation, downloaded their ‘*S3 data*’. ### What we expect from MobiKwik We believe that MobiKwik, like many Indian technology companies, need to do better given they are today driving global innovation. It is disappointing for MobiKwik, to dismiss reports of a data breach and also issue threats against a security researcher - both steps which are against the interests of its users. We think it is necessary for MobiKwik to immediately undertake the following five steps to alleviate the situation: 1. **Inform users:** MobiKwik should individually inform each affected user of the extent to which the data breach has impacted them. 2. **Provide redressal to users:** MobiKwik should devise and implement a strategy to provide adequate remedies to such users, including but not limited to compensation to the users in terms of Section 43A of the Information Technology Act, 2000. 3. **Fix accountability:** MobiKwik should provide an explanation on why such a breach took place, provide details of the breach, including the number of users affected by the breach and the date and time on which the breach took place, and issue a statement explaining the steps taken to ensure such a breach does not occur in the future. 4. **Permit a third-party audit**: The circumstances require that an independent agency conducts a forensic data security audit. We commend MobiKwik for making a public commitment to conduct it but it must be done independently through a firm of repute and its findings must be made public. 5. **Recall threat of legal action:** As mentioned above, MobiKwik has threatened to take legal steps against the cyber security researcher who uncovered the data breach. As we have pointed out [**previously**](https://internetfreedom.in/security-researchers-need-legislative-protection-from-vexatious-lawsuits/), cyber security researchers constantly face threats of legal prosecution even when they disclose data breaches in good faith. While there [**remains a need**](https://www.bbc.com/news/world-asia-india-50583733) to provide legislative protection to such researchers, threatening researchers with legal prosecution is irresponsible. MobiKwik should immediately recall such threats especially since many users and other independent cybersecurity researchers have also claimed that a data breach has occurred. ### Letter to Computer Emergency Response Team (CERT-IN) In view of the massive data breach, violation of the right to privacy and the lack of a response by MobiKwik, we wrote a letter to CERT-IN. Under the Information Technology Act, 2000, CERT-IN is responsible for collecting, analysing, and disseminating information on cyber incidents and undertaking measures to handle cybersecurity incidents. In the letter, we have highlighted the concerns we have raised above and requested CERT-IN to conduct an inquiry into the data breach and conduct of MobiKwik, and require executives of MobiKwik to provide detailed explanations to their office in terms of Section 70B(6) of the Information Technology Act, 2000. We are hopeful that an enquiry by CERT-IN may compel MobiKwik to act responsibly and even provide compensation to its users as per Section 43A of the Information Technology Act, 2000. ### Personal Data Protection Bill does not provide safeguards #SaveOurPrivacy A broader policy ask also arises from this specific incident as we have highlighted it in the past with respect to data breaches by other entities, both public and private. Considering the frequency and the scale of such data breaches, Parliament must provide statutory protections to users whose rights are violated. As we have [**pointed out**](https://internetfreedom.in/security-incidents-and-the-personal-data-protection-bill/) previously, the Personal Data Protection Bill, 2019 (PDPB) does contain several clauses relating to security and breaches. For example, Clause 25 deals with the breach of personal data. The clause states that in cases where a data breach may cause harm to the data principal, the data fiduciary must inform the proposed Data Protection Authority. However, the clause does not require the data fiduciary (in this case, MobiKwik) to inform the data principal (in this case, users whose data is now public). It is instead left to the Authority to decide: a) whether the data fiduciary must inform the data principal, b) the remedial action the data fiduciary must undertake, and c) the details of the data breach that can be made public. In contradistinction to PDPB, a private member bill [**(the Personal Data and Information Privacy Code Bill, 2019)**](https://drive.google.com/file/d/1DReq96e-FLsSoKUvK94_-VCtu2Y1PE97/view) introduced by MP D. Ravikumar guarantees data subjects the right to be informed about any breaches of their personal information, and also asks organisations to designate privacy officers to ensure security compliance. Currently, PDPB is being reviewed by a Joint Parliamentary Committee. A conversation around PDPB is the need of the hour and we have [**started**](https://internetfreedom.in/startfromscratch-the-data-bill-series-part-1/) a four-part series where we will talk about the need for a data law, the current bill’s provisions and loopholes, what good data bills actually look like, where accountability from authorities is needed, and what you can do to advocate for your rights. Apart from providing statutory protection to data principals, a crucial aspect of data regulation is ‘data minimization’. The principle of [**data minimization**](https://www.trendmicro.com/vinfo/us/security/definition/Data-Minimization) involves limiting data collection to only what is required to fulfill a specific purpose. Cumbersome KYC processes result in companies having access to large amounts of data without necessarily having the ability to securely store such data. ### Important Documents 1. Our letter dated 31.03.2021 to the Indian Computer Emergency Response Team to conduct an inquiry into the data breach and conduct of MobiKwik ([**link**](https://drive.google.com/file/d/1cXXVX2qqqCx0SRo8DuoZHa4wFM682-c8/view?usp=sharing)) 2. IFF post highlighting other recent security breaches ([**link**](https://internetfreedom.in/security-incidents-and-the-personal-data-protection-bill/)) 3. IFF post pointing out the security vulnerability of a website that provided for on-boarding services with BHIM ([**link**](https://internetfreedom.in/its-time-to-stop-data-breaches-and-security-vulnerabilities-we-write-to-the-it-ministry/)) 4. IFF post discussing the need to provide legislative protection to security researchers for responsible disclosures ([**link**](https://internetfreedom.in/security-researchers-need-legislative-protection-from-vexatious-lawsuits/)) 5. Public Brief and Analysis of the Personal Data Protection Bill, 2019. ([**link**](https://saveourprivacy.in/media/all/Brief-PDP-Bill-25.12.2020.pdf))",
    "light_cleaned_comments": "Mobikwik should also allow users to delete their profile and all related Person data if user wants too. Quick tip: On android, if you want to delete saved cards from Mobikwik, hold for 2 seconds on the card, delete option will appear. I had to threaten a Mobikwik executive with RBI complaint to get this information. We need a GDPR for India as soon as we can! That will just delete the data for you, for compliance purposes your data is still stored in the backend. One of the main principles of AWS security is that your data is yours to secure. Amazon’s responsibility is limited to the integrity of the infrastructure. If some has indeed downloaded data from S3, that’d mean mobikwik followed poor data security practices. Many have reported that the card details they deleted long ago are still in the leak. That means they just marked it as \"no-show\" to only you, but kept it saved on their end \"just-in-case.\" Lmao. that's how my card data got leaked. I requested many times to delete my saved card, but no response. So I just forgot about it until yesterday. I just asked Mobikwik and PhonePe today to give me a list of data stored even after when a user gets their account deleted on their platforms. I'm gonna do this with every app/service where I have an account. Waiting for their response. I'll take them to courts if they do monkey-business. I doubt you have a legal recourse for this. Because every country has laws for data retention for compliance purposes however, I’m unsure about the retention duration in India. The company I work for get legal threats from European customers covered by the GDPR to delete their data from our servers everyday and what we do is toss their legal threat into the trash can because privacy laws do not cover certain aspects of your data from a retention perspective because it’s absolutely vital for us to have that information. Not for ad targeting or building a user profile, but to ensure safety. Unfortunately, many companies do not secure those data well enough and here we are. Incompetent companies are also calling out \"Fake news\". Wonder if the govt. will bend over or actually investigate this. Mobikwik is hosted on AWS ? IFF is doing a great job here. Keep it up guys Yes, according to tech crunch. It’s mentioned in this post. You guys are best thing happen to Indian internet users. Yet another amazing work. &gt;S3 data Oh god, when will people learn ~_~ Even Amazon doesn't manage to properly secure it the first time. Remember when Alexa audio records were available in a public bucket? It's already in works look up data protection bill india nah it will be suicidal for them. They going to have IPO launch soon. As a side note, check to see if you are in bad waters- [https://haveibeenpwned.com/](https://haveibeenpwned.com/) What kind of safety? For instance, card theft and cloning. But do you delete it after the retention period or is it stored permanently on the servers? It’s removed after the retention period. A 10 year old expired card is of no use except for taking up server space."
}