{
    "id": "14z6nzq",
    "title": "Why India needs a uniform civil code for certain functions",
    "url": "https://www.reddit.com/r/india/comments/14z6nzq/why_india_needs_a_uniform_civil_code_for_certain/",
    "selftext": "Just to name a few - there are aspects of UCC that are not only intuitive but also should be universally acceptable to all religions. Ideally we should have already introduced a uniform civil code when it comes to these, and not focus on marriage laws and women's rights - which are more attractive politically. \n\nBut these will not secure votes so political parties wrangling about UCC will never focus on these aspects for sure. \n\nAdoption is a case. \n\n[https://www.legalserviceindia.com/legal/article-9192-need-of-uniform-civil-code-for-adoption-laws-in-india-a-critical-analysis.html](https://www.legalserviceindia.com/legal/article-9192-need-of-uniform-civil-code-for-adoption-laws-in-india-a-critical-analysis.html)\n\n[https://vakilsearch.com/blog/adoption-laws-in-india/#:\\~:text=In%20India%2C%20there%20is%20no,as%20being%20a%20biological%20kid](https://vakilsearch.com/blog/adoption-laws-in-india/#:~:text=In%20India%2C%20there%20is%20no,as%20being%20a%20biological%20kid).\n\nThere is no legal way for non-Hindus to adopt a child. Instead they have to take guardianship under the 1980 guardianship act (which does not bestow upon the child either the legal umbrella or adequate security as adoption law. \n\nTaxation\n\nCreation of a undivided family entity to aid everyone irrespective of religion (Vs the current HUF) \n\nLaws of inheritance and succession \n\nThe current personal laws makes property dealings extremely complicated when it comes to parties belonging to different religions. A uniform law of succession will help ease inter-faith business dealings. \n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689310149.0,
    "convurl": "https://external-preview.redd.it/W0HMCQ4FUSvChfJ1Qfux-Aye6uCHyf1ItYgdeyQOHr4.jpg?auto=webp&s=be080889ea04d0e61b937f67743198875c899373",
    "comments": [
        "As a Muslim im not at all against ucc but im only skeptical the intentions of bjp, it's either to legally harass Muslims or turn something into vote bank or publicity. \n\nUCC is a necessity but at the same time is being implemented by a party that says Hindus and Muslims are not same and they cannot live together.",
        "Yep, the uniform civil code is there by BJP to harass the Muslims.\nIt's not applicable to northeast states or tribals of various states ,\n\n\nThey do not know the meaning of \"uniform\"",
        "What is the guarantee the *uniform* civil code addresses the issues you mentioned?\n\nRe adoption, why can't Hindu law amended to include new stuff?\n\nUniform Civil Code is aimed to hurt a section of the population. The intention is wrong.",
        "Where is the draft ?"
    ],
    "cleaned_text": "india needs uniform civil code certain functions name aspects ucc intuitive also universally acceptable religions ideally already introduced uniform civil code comes focus marriage laws womens rights attractive politically secure votes political parties wrangling ucc never focus aspects sure adoption case httpswwwlegalserviceindiacomlegalarticleneedofuniformcivilcodeforadoptionlawsinindiaacriticalanalysishtmlhttpswwwlegalserviceindiacomlegalarticleneedofuniformcivilcodeforadoptionlawsinindiaacriticalanalysishtml httpsvakilsearchcomblogadoptionlawsinindiatextinindiacthereisnoasbeingabiologicalkidhttpsvakilsearchcomblogadoptionlawsinindiatextinindiacthereisnoasbeingabiologicalkid legal way nonhindus adopt child instead take guardianship guardianship act bestow upon child either legal umbrella adequate security adoption law taxation creation undivided family entity aid everyone irrespective religion vs current huf laws inheritance succession current personal laws makes property dealings extremely complicated comes parties belonging different religions uniform law succession help ease interfaith business dealings xb ",
    "cleaned_title": "india needs uniform civil code certain functions",
    "cleaned_selftext": "name aspects ucc intuitive also universally acceptable religions ideally already introduced uniform civil code comes focus marriage laws womens rights attractive politically secure votes political parties wrangling ucc never focus aspects sure adoption case httpswwwlegalserviceindiacomlegalarticleneedofuniformcivilcodeforadoptionlawsinindiaacriticalanalysishtmlhttpswwwlegalserviceindiacomlegalarticleneedofuniformcivilcodeforadoptionlawsinindiaacriticalanalysishtml httpsvakilsearchcomblogadoptionlawsinindiatextinindiacthereisnoasbeingabiologicalkidhttpsvakilsearchcomblogadoptionlawsinindiatextinindiacthereisnoasbeingabiologicalkid legal way nonhindus adopt child instead take guardianship guardianship act bestow upon child either legal umbrella adequate security adoption law taxation creation undivided family entity aid everyone irrespective religion vs current huf laws inheritance succession current personal laws makes property dealings extremely complicated comes parties belonging different religions uniform law succession help ease interfaith business dealings xb",
    "cleaned_comments": "muslim im ucc im skeptical intentions bjp either legally harass muslims turn something vote bank publicity ucc necessity time implemented party says hindus muslims live together yep uniform civil code bjp harass muslims applicable northeast states tribals various states know meaning uniform guarantee uniform civil code addresses issues mentioned adoption cant hindu law amended include new stuff uniform civil code aimed hurt section population intention wrong draft",
    "light_cleaned_title": "Why India needs a uniform civil code for certain functions",
    "light_cleaned_selftext": "Just to name a few - there are aspects of UCC that are not only intuitive but also should be universally acceptable to all religions. Ideally we should have already introduced a uniform civil code when it comes to these, and not focus on marriage laws and women's rights - which are more attractive politically. But these will not secure votes so political parties wrangling about UCC will never focus on these aspects for sure. Adoption is a case. [https://www.legalserviceindia.com/legal/article-9192-need-of-uniform-civil-code-for-adoption-laws-in-india-a-critical-analysis.html](https://www.legalserviceindia.com/legal/article-9192-need-of-uniform-civil-code-for-adoption-laws-in-india-a-critical-analysis.html) [https://vakilsearch.com/blog/adoption-laws-in-india/#:\\~:text=In%20India%2C%20there%20is%20no,as%20being%20a%20biological%20kid](https://vakilsearch.com/blog/adoption-laws-in-india/#:~:text=In%20India%2C%20there%20is%20no,as%20being%20a%20biological%20kid). There is no legal way for non-Hindus to adopt a child. Instead they have to take guardianship under the 1980 guardianship act (which does not bestow upon the child either the legal umbrella or adequate security as adoption law. Taxation Creation of a undivided family entity to aid everyone irrespective of religion (Vs the current HUF) Laws of inheritance and succession The current personal laws makes property dealings extremely complicated when it comes to parties belonging to different religions. A uniform law of succession will help ease inter-faith business dealings. &#x200B;",
    "light_cleaned_comments": "As a Muslim im not at all against ucc but im only skeptical the intentions of bjp, it's either to legally harass Muslims or turn something into vote bank or publicity. UCC is a necessity but at the same time is being implemented by a party that says Hindus and Muslims are not same and they cannot live together. Yep, the uniform civil code is there by BJP to harass the Muslims. It's not applicable to northeast states or tribals of various states , They do not know the meaning of \"uniform\" What is the guarantee the *uniform* civil code addresses the issues you mentioned? Re adoption, why can't Hindu law amended to include new stuff? Uniform Civil Code is aimed to hurt a section of the population. The intention is wrong. Where is the draft ?"
}