{
    "id": "1fp5mir",
    "title": "Sensitive Aadhaar, PAN, and passport details of Indians are openly available on Google, posing a serious data security threat",
    "url": "https://www.reddit.com/gallery/1fp5mir",
    "selftext": "I just searched \"index of Aadhaar card\" on Google and bam!\n\nMillions of Aadhaar card details are freely available on Google from various websites, like schools, colleges, corporate offices and many others.\n\nNot just Aadhaar card.\n\nPAN, voter and passport ID, etc, are also very common there.\n\nNot a techno guy, so can't exactly say how it leaks like that.\n\nBut these websites definitely don't have any security on their client's data.\n\nThe keyword reveals certain PAGES of these websites that are not found directly on their site but are visible to Google, without protection.\n\nThese pages should be hidden, but they aren't.\n\nWeird!\n\nThere are so many websites like that, so many, and each website is leaking thousands of data like that.\n\nThese documents are so important and connected to our bank accounts and SIM cards.\n\nIt can be used to scam anyone with our details and see the keyword suggestion.\n\nMany people search these long tail keywords on Google, for what?.. get it? ☠️\n\nIt's giving me anxiety now!",
    "flair": "Rant / Vent",
    "score": 1986,
    "num_comments": 198,
    "created_utc": 1727274046.0,
    "convurl": "https://i.redd.it/1cpff0tisyqd1.png",
    "comments": [
        "Lo krlo baat. How big this issue can evolve into before steps are taken to curb it",
        "https://preview.redd.it/qlulo6x8uyqd1.jpeg?width=554&format=pjpg&auto=webp&s=5bff0dbec1e8507938b2c213a5768b155194e2c7\n\nIndian data privacy be like",
        "At this point i am thinking Why tf am i living in this shit hole",
        "If your data is leaked, hackers can’t hack it",
        "believe me the Information Technology Act, 2000 is outdated and it doesnt even have provisions for modern technologies like AI, blockchain etc.",
        "you shouldnt have posted the index, now many people will go and see.",
        "When you have 99% reservations in jobs for upper castes and every company is hiring basis sub caste and native place this is what you get!",
        "It's similar to open hotspot that anyone can connect to.\n\n\nThese institutions (both public & private) do not bother to encrypt or at the very least put up a password to their database. They appear to have to taken it for granted that they will not be held accountable. Privacy indeed is a joke in this hinterland.",
        "Also govt was blocking apps left & right during the time of covid but didn't even request the companies to delete the user data of Indians nor citizens were instructed to delete the account/data associated with the app. Even today if you login to those apps (like tik tok) with vpn, you can see indian user data.",
        "Indians be like....\n\nData privacy... what does that Mean?",
        "The root problem is the pervasive use of Aadhaar in every single thing. Just yesterday, I received an ultimatum from my kid's school with hints that if I continue to refuse to provide Aadhaar for him, myself & my wife, my kid may not be able to register for his board exams.\n\nI'd provided them with our passport copies until now, but it seems the department of education's internal portal requires Aadhaar. I don't have the will to fight this anymore, and I will be providing it tomorrow.\n\nCurse Nilekani & everyone else in my industry who worked on this monstrosity. All this horror lies squarely at your footsteps. Moronic \"digitalisation specialists\" assisting moronic bureaucrats.",
        "4d move by our government",
        "Stop worrying man, your data is encircled by 5 foot thick & 13 foot high wall. No one can steal it. /s",
        "It’s not some top secret . Normal index of Aadhar search will give you these details",
        "Batao abb koi kya kare? ye log itne jhatu hain ki data encrypt na kar paye? bass paisa khane ko bol do sara din.",
        "Are you sure?....*Dhoom music rolls*",
        "Kuchh nai hone wala. Humara pyaara “Bharat” hai ye. 🙂",
        "99% reservation in jobs for upper castes?\n\nYeh kab hua?",
        "What movie is this from?",
        "Even Voter Helpline app can give more info about a person openly which is a risk actually.\nBut govt doesn't care about it.",
        "At the rate we are giving away photocopies every few days for every damn thing we shouldn’t be surprised",
        "Where the fuck do you live? Where I live, \"backward caste\" has reservation (I don't consider anyone backward but the government has certified some people to be and they are happy with that).",
        "Data privacy? Yeh kaunsa naya janvar hai? Jo bhi ho, humari sanskriti aur parampara ka koi jawab nahi.",
        "now try reverse image searching an aadhar card photo on a site like [yandex.com](http://yandex.com)",
        "They literally copied this segment from Johnny English wtf",
        "dhamaal",
        "Yeah right mate, I just checked, only Dalits and Muslims are in private sector jobs, upper castes are all jobless, I am sorry, I misspoke.\n\nAlso there is no Casteism so getting riled up with my post seems counter intuitive, but nevertheless first you need to make up your mind about you identity -- is it Hindu, middle class, comman man or honest tax prayer cos there is nothing like 'upper castes'.",
        "This isn't new though...years ago I ordered something from eBay (India to US), and the box came with the sender's aadhar card copy with the customs form.",
        "Ragebait",
        "a2 + b2 se nikalne wali extra energy hai modi ji ki😉",
        "how bro its is not showing for me",
        "Oh shit. There is so much data there",
        ">Where the fuck do you live? \n\nYou should check where you live, all upper castes have gotten together can created a reservation for themself called EWS... They don't seem to be happy but they want all the reservations for themself and they have special merit glands in their behind and need to sh*t merits wherever they go!",
        "Hahaha this is exactly what I was trying to say\n\nhttps://www.reddit.com/r/india/s/OFMIg4Sabx",
        "Yeah you need to go to famous youtuber coaching centre to get this!",
        "Mat kro isse behas Sirf ek hi comment copy paste karte Jaa rha hai. Profile dekh lo",
        "😂😂\n\nSo, people who are poor should not get anything and people who are smart shouldn't get anything either, right?",
        "We cannot get scammed because\n\nWE ARE THE SCAMMERS\n\nI AM THE ONE WHO KNOCKS!!!!!\n\nhttps://preview.redd.it/bd90g7aj1zqd1.jpeg?width=1920&format=pjpg&auto=webp&s=778a7f1f24df21dbf2f31b251c0106fbdbfb9185",
        "Sholay maine bhi dekhi h",
        "It means somewhere on Google our aadhar cards are also available for free :(",
        "I see. Thanks for the heads-up. I won't argue further with him. Thanks!",
        "/s",
        "Yeah everyday I see 'smart' people by birth asking how to get EWS reservations on legal India sub reddit.\n\nAlso upper castes earning 8L per anum is poor, but the maid who is lower caste coming to you house to do your household work is driving bmw and living in bunglow.",
        "I don't want to argue with you. Believe what you want because you are too blinded by hate and I have no time to keep engaging with rhetoric.",
        "The data is so huge, people are ignoring it.",
        "I've said it before I'll say it again - Aadhar is a disaster waiting to happen. And when it does, God save all.",
        "EU when it comes to privacy ♾️/100 \nIndia when the same -69/100\nThere's a reason why Truecaller shifted their hq in india...",
        "At this point why do you guys keep voting for bjp lmao\n\nIt feels like every other day there is a fuck up.",
        "Masterstroke move by our supreme lodu",
        "Johnny English",
        "You should make up your mind, does casteism exists or not? As per you it doesn't exist, then you should not care about my comments on 'upper castes'.\n\nAlso there is no identity like 'upper castes' there is for subhumans like Dalits and Muslims.\n\nBut yet you think so called 'upper castes' are poor and smart and deserve everything. If someone is born dalit or muslim automatically he is not smart and rich, right? \n\nEWS reservations is 'only' for upper castes, as someone who is SC ST or Muslims cannot be poor...\n\nAlso for SC, ST, Muslims etc to be a poor person annual income should be less than 15000 (eligibility for yellow and green card). While getting EWS reservations, upper castes need to have annual income of 8,00,000.\n\nYou are smart, and born with merits in upper caste, a superior human, you should understand the difference between 15000 and 8,00,000.\n\nBut I am just filled with hate, you all are right... I am not seeing what you could see, cos I got no merits. I am not born smart and superior like you.",
        "Share on X, tag ppl and media and we make it viral",
        "Developer here. Everything on internet is indexed by search engines like Google so that it shows up when searched. The developers have to manually disable indexing so that sensitivity documents and pages are not indexed. To comprehend the shear incompetence on display, just know that it's LITERALLY AS EASY AS FLIPPING A SWITCH and no one did it.",
        "Privacy is a western concept. Here, we share aadhar number even for getting a haircut.",
        "We pushed for more digital but we dont have better digital securities..",
        "Bhai logo ne Facebook Dp pe laga rakhi hai aadhar pics.",
        "Sh*t man, you checked my profile, now you go find a nearest cow and take a golden shower to purify yourself.\n\nAlso need to find a fat bruhmaan and feed him 7 course meal to get more purity.",
        "They will go after the people who post this, not the orignal people who allowed this to happen in the first place.",
        "Free scratch milega kya for my aadhar?",
        "I know that I am going to get downvoted, but the reason for these leaks aren't Indian govt UDAI Security issues. \nIf you observe most of these photos are not IDs but photo of ID. i.e the places which collected your ID is negligent with your xerox Copies and photos. even in US the SSN aren't shared freely but here Aadhar is shared however we want indiscriminately this is the cause of above photos we see on net. \nThese are not leaked from govt Website. \n\nNow to protect yourself from these issue , the best you can do is use masked ID (or) Virtual ID. These will reduce your risk of exposure to any said scams, and please ensure that Your ID is linked with your phone number and mail such that if anyone access your Aadhar for verification, you get notified and you may rise complaint against authentication of aadhar . \n\nAlso verify if any sim cards are taken using your aadhar . [verification link](https://tafcop.sancharsaathi.gov.in/)",
        "The school is doing this to minimise errors. My birth certificate and aadhar card had different surnames for my father, on top of that I discovered that my mother used her maiden name for my birth certificate. Thanks to my teacher I was able to correct my fathers name and start using my mothers maiden name on all documents.",
        "If everything is open, nothing is secret.",
        "Companies need to protect confidential data properly and have proper security set-up.\nThey just don't want to invest in data security and don't care if they get hacked.",
        "Data privacy is a joke in India.",
        "Now this is something",
        "There are people posting their adhar card on fake spam posts.",
        "Unless PII of politicians and their relatives are not leaked, no action would be taken. \n\nThis is my assumption.",
        "The thing is this shouldn't be a problem if this info is stored securely and deleted after it's not needed (1 year in this case) . However, that doesn't happen in most cases.",
        "This would be immediate lawsuits of millions in a lot of countries for organizations not sticking to GDPR compliance in EU. If this happened in European or western countries, the company would have been sued by now.",
        "I remember applying a long time back and since I don’t live in the country, never had to use mine. Now every time I visit it’s a pain with everyone asking and I have no clue where it is. \n\nI wonder if I can find it here.",
        "They all seem to be coming from one website: [indianaerospaceandengineering.com](http://indianaerospaceandengineering.com)",
        "This is the carelessness of the website owner and builder. You have to disallow those URLs in robots.txt that contain sensitive information.",
        "why is it that when stuff like this happens, Wordpress is somehow involved. The old admin admin",
        "bahut phle ki leak hai yeh jab new me aaya tha tabhi ki",
        "u changing subject like avg typical indian",
        "It looks more and more like the wall is 13 foot thick and 5 foot high.",
        "😂😂😂",
        "Biggest flaw is all institutions asking for aadhar copy. Why would you need that?",
        "Digital public infrastructure cannot be designed on an assumption of security (that's not to say security shouldn't be invested in). Instead, design should be based on blast radius minimisation and isolation. Centralisation of ID has the exact opposite effect. The larger the system, the more it needs to be designed to minimise blast radius.\n\nAnd I'm not even getting into whether an ID should be needed here at all. Education is a matter of RTE, not a KYC thing.",
        "Way secure than Pakistani Admin's Country's future.",
        "you dont need to search it, it already available on dark web and you can access it through one million places. google is just a spill.\n\nyour aadhar info was never safe",
        "A country where you can urinate publicly so privacy is definitely an alien term here",
        "congratulations on making it even more popular , great fucking work buddy",
        "https://preview.redd.it/at6bu5weqzqd1.jpeg?width=500&format=pjpg&auto=webp&s=91bef687d2f336932f02308caf06753086273294",
        "I just checked it I am not a software guy, I think senior today relax bikes, asian Bariatrics are companies and the aadhar cards on there are of their employees or clients(which is a bad thing) Indian aerospace closed their server or something  another site shows access denied it is probably some mistake in the backend that allows anyone to access their data or something idk",
        "Man just go to any random organisation, you will see the hiring the done in this fashion-\n\n1. Immediate Family members \n2. Extended family \n3. Same sub caste and native\n4. Same sub not same native but same mother tongue \n5. Same caste\n6. Token woman/dalit/muslim \n\nYou think anyone cares about ability, when every uppercaste is meritorious, chaste, innocent and pious person.",
        "I have 47gb of text info of aadhar card holders( non image/only details in text format).\nDownloaded from telegram SUPA leak back in 2023 in which all the aadhar details of vaccinated Indians was leaked.\n\nThere was a couple tb of image data too.",
        "Actual post repost kardete. Wasn't this already posted to \nr/unitedstatesofindia 10 hours ago.",
        "omg i just found out people have uploaded their adhar cards on fucking pinterest",
        "No way to end this",
        "https://preview.redd.it/qfnnk8oxwzqd1.jpeg?width=1396&format=pjpg&auto=webp&s=7ee5fccb94a739e83ef4e0d13e7c9aa000e26934\n\nGoing to get downvoted , comment deleted and permanently banned from the sub 🤔",
        "#Vishawaguru",
        "What else will happen when KYC is mandated every so often. And so many different agencies and people ask for your documents.",
        "I just tried it out and 💀.. even fing passports!",
        "Chai wale ko PM ban ayenge to kya hi ummeed karen is desh se.\n\nWahan seer body Hinduon ko cow urine consume karne bolrahi hai to purify after the accidental consumption of mandir laddus.\n\nKya hoga is desh ki janta ka!\n\nInternational level pe bezzati ke saare records todenge hum. 🤦‍♂️",
        "Were they ever secure to begin with? It's that one ID everyone asks for. So many hotels, academic institutes, travel agencies, telecom service providers,  etc already have my Aadhar (against my wishes, had no choice).\n\nI treat it like that one document which I use everywhere now, so my other important IDs like PAN, Ration Card and Passport are secure. A sacrificial ID, that's all it's worth.",
        "When you (aka gov and industry) want aadhaar for everything, it simply can't be private.",
        "Thanks for bringing this issue up. Now the next question is, how do we get these databases secured and inaccessible to the public?",
        "And the fact that we are born in india makes it even harder to migrate even if we wanted to. In this era being born in india is a curse.",
        "Can you give the masked Aadhar?",
        "Lmaoo",
        "Welcome to imperialism. Congress began aadhar with the precise intention to make it mandatory everywhere. BJP played token opposition going against it before 2014. Any sane person would have known BJP would not retract something that is so useful to the central government based in delhi",
        "One of the reasons that people rarely pay attention to is providing their Aadhar details anywhere if asked. I have come across such apps while testing the same. Numerous loan apps ask for an Aadhar card, and they don't even go for the verification via the Aadhar site for confirmation if it belongs to the person or not. But, people provide it. In the past 3 years, there has been an abundance of such apps and millions of people have used these apps as they do not require collateral or anything for the loans. They are data-gathering scam sites.",
        "elaborate",
        "India produces the most number of IT engineers , it's crazy how bad our basic infrastructure is.",
        "was this data leaked from a government source or a private source",
        "Data privacy is a western concept it's not a part of our culture, just like weekends, work life balance and reasonable working hours per day.",
        "Guys just blur your digits when sharing with anyone less other than government",
        "Gives lectures about western concepts while wearing suits, using mobile phones, social media and using all sort of technologies which are western concepts. Bunch of mindless hypocrites. Smh.",
        "It's just the surface level, the rabbit hole goes deep. It's horrifying.",
        "It’s not a “leak”. A leak happens when a hacker deliberately steals data or accidentally the data became public. These websites had served these documents in a public directory where anyone with internet can see. It’s the websites’ fault.",
        "what about logic? is it?",
        "CBI wants to know your location",
        "The government itself sells off our data \n\nIf you have applied for NEET, the government officials sell out your Aadhar card details along with your marks to scammers and agents",
        "India mein privacy naam ki ki cheez nai hai. Angrez chale gaye ab corrupt neta ki gulami kar rhe",
        "It's sarcasm and irony and jokes my dude. I'm mocking the Indian ceos and startup founders who justify malpractices by invoking Indian culture.",
        "How many entries as in the number of people present in the file of yours?",
        "Hacker: _I know your address_ 😈\n\nMe: _Thanks but I already know my address_ 🗿",
        "Who is responsible",
        "Oh u mean 90% of 90s movies in Bollywood.",
        "I mean the blast radius is 'exposure of every student or every bank customer's aadhar details (address, date of birth, phone number)",
        "fEeLiNg Parowd endian",
        "Linked to pancard linked to bank account and linked to what not",
        "It was just a political move they don't give a shit about us",
        "Masked Aadhaar has almost zero acceptance in my experience. It only works as an identity proof in Airports as far as I understand.",
        "Hope you did the most ethical thing, i.e. get a bunch if Indian SIM cards in his name...",
        "still don't how it will affect us.  \nif my aadhaar details are leaked I could easily be scammed by some other person with the data that aadhaar has about me but nothing more than afaik  \nyour opinion?",
        "pretty sure this was pretty known when aadhar cards initially were introduced,the main problem is the government in their infinite wisdom didn't encrypt the aadhar card information saved on cloud servers which made them easilly available using a google search and since aadhar card can be used for all your other documents this situation was inevitable",
        "If only there was a hacker that targetted politicians ",
        "This is strictly for comedy purposes, but there could be ways for certain groups to crowdfund this.\n\n\n\n#Note: My lawyer asked me to say, this is just for comedic purposes.",
        "Oh that is hilarious. Where though? Imagine if someone hacks into the godi channel feeds across the cable to telecast the shenanigans. 😂\n\n\n Of course that would be soooo unethical.../s",
        "So unethical and anti national. \n\nI actually want to see someone hack Trump's instagram and start spamming stuff. Wonder if the followers will ever figure out if it has been hacked.\n\nI'm joking obviously.",
        "Superpower 2020 SaaAaArr",
        "Yeah, a few years ago I was having the exact same discussion with my relatives that our database security is really abysmal which can be hacked easily by anyone who is half competent in hacking and the relatives who are, let's say, \"patriotic\" labelled me anti-national for saying that as we have the \"best security measures\" in the world, as the govt. said.\n\nI am gonna send this post to them.",
        ">Not a techno guy, so can't exactly say how it leaks like that.\n\nBro clearly hasn't been to a rave.",
        "digital india train running on loose unmaintained tracks, risk of derailments and accidents all around. \n\nbasically like our actual trains",
        "even if adhar is requested for kyc,\n\ngovernment has failed or regulare collection, processing and proteyif data.\n\nthere are modes of authenticating adhar without actually having to submit a copy of unmasked adhaar, but government doesn't promote it or mandate it.",
        "I'll just leave this here. Whoever is studying here please contact them to take these down or atleast stop it from being indexed by google crawler or any other search engine crawlers by setting up a robots.txt.\n\n[https://indianaerospaceandengineering.com/media/student/aadharcard/](https://indianaerospaceandengineering.com/media/student/aadharcard/)",
        "If you do a google search with the following: `intitle:\"index of\" aadhaar`, there are many website in which aadhaar cards are just visible without any authentications. Some websites have denied access for \"guest\" accounts but then those can also be bypassed.",
        "It shows just one SIM in my name whereas i have myself taken more than one.",
        "https://i.redd.it/scg4agskk6rd1.gif",
        "Looks like the digi yatra gate at an airport.",
        "Every hacker already has our Aadhar by now ",
        "Yeah, this isn't news. For example, a few months ago I was trying to apply to a certain big government education institute. Creating an account wasn't working, so I looked a bit into what was happening in the site, and bam. Stupid SQLi vulnerability allowing logging in as admin. Had people's personal details (including banking/aadhar) right in the open.\n\nEven after warning there tech team about it, the issue is still present almost a year after the incident."
    ],
    "cleaned_text": "sensitive aadhaar pan passport details indians openly available google posing serious data security threat searched index aadhaar card google bam millions aadhaar card details freely available google various websites like schools colleges corporate offices many others aadhaar card pan voter passport id etc also common techno guy cant exactly say leaks like websites definitely dont security clients data keyword reveals certain pages websites found directly site visible google without protection pages hidden arent weird many websites like many website leaking thousands data like documents important connected bank accounts sim cards used scam anyone details see keyword suggestion many people search long tail keywords google get giving anxiety ",
    "cleaned_title": "sensitive aadhaar pan passport details indians openly available google posing serious data security threat",
    "cleaned_selftext": "searched index aadhaar card google bam millions aadhaar card details freely available google various websites like schools colleges corporate offices many others aadhaar card pan voter passport id etc also common techno guy cant exactly say leaks like websites definitely dont security clients data keyword reveals certain pages websites found directly site visible google without protection pages hidden arent weird many websites like many website leaking thousands data like documents important connected bank accounts sim cards used scam anyone details see keyword suggestion many people search long tail keywords google get giving anxiety",
    "cleaned_comments": "lo krlo baat big issue evolve steps taken curb indian data privacy like point thinking tf living shit hole data leaked hackers cant hack believe information technology act outdated doesnt even provisions modern technologies like ai blockchain etc shouldnt posted index many people go see reservations jobs upper castes every company hiring basis sub caste native place get similar open hotspot anyone connect institutions public private bother encrypt least put password database appear taken granted held accountable privacy indeed joke hinterland also govt blocking apps left right time covid didnt even request companies delete user data indians citizens instructed delete accountdata associated app even today login apps like tik tok vpn see indian user data indians like data privacy mean root problem pervasive use aadhaar every single thing yesterday received ultimatum kids school hints continue refuse provide aadhaar wife kid may able register board exams id provided passport copies seems department educations internal portal requires aadhaar dont fight anymore providing tomorrow curse nilekani everyone else industry worked monstrosity horror lies squarely footsteps moronic digitalisation specialists assisting moronic bureaucrats move government stop worrying man data encircled foot thick foot high wall one steal top secret normal index aadhar search give details batao abb koi kya kare ye log itne jhatu hain ki data encrypt na kar paye bass paisa khane ko bol sara din suredhoom music rolls kuchh nai hone wala humara pyaara bharat hai ye reservation jobs upper castes yeh kab hua movie even voter helpline app give info person openly risk actually govt doesnt care rate giving away photocopies every days every damn thing shouldnt surprised fuck live live backward caste reservation dont consider anyone backward government certified people happy data privacy yeh kaunsa naya janvar hai jo bhi ho humari sanskriti aur parampara ka koi jawab nahi try reverse image searching aadhar card photo site like yandexcomhttpyandexcom literally copied segment johnny english wtf dhamaal yeah right mate checked dalits muslims private sector jobs upper castes jobless sorry misspoke also casteism getting riled post seems counter intuitive nevertheless first need make mind identity hindu middle class comman man honest tax prayer cos nothing like upper castes isnt new thoughyears ago ordered something ebay india us box came senders aadhar card copy customs form ragebait b se nikalne wali extra energy hai modi ji ki bro showing oh shit much data fuck live check live upper castes gotten together created reservation themself called ews dont seem happy want reservations themself special merit glands behind need sht merits wherever go hahaha exactly trying say yeah need go famous youtuber coaching centre get mat kro isse behas sirf ek hi comment copy paste karte jaa rha hai profile dekh lo people poor get anything people smart shouldnt get anything either right get scammed scammers one knocks sholay maine bhi dekhi h means somewhere google aadhar cards also available free see thanks headsup wont argue thanks yeah everyday see smart people birth asking get ews reservations legal india sub reddit also upper castes earning l per anum poor maid lower caste coming house household work driving bmw living bunglow dont want argue believe want blinded hate time keep engaging rhetoric data huge people ignoring ive said ill say aadhar disaster waiting happen god save eu comes privacy india theres reason truecaller shifted hq india point guys keep voting bjp lmao feels like every day fuck masterstroke move supreme lodu johnny english make mind casteism exists per doesnt exist care comments upper castes also identity like upper castes subhumans like dalits muslims yet think called upper castes poor smart deserve everything someone born dalit muslim automatically smart rich right ews reservations upper castes someone sc st muslims poor also sc st muslims etc poor person annual income less eligibility yellow green card getting ews reservations upper castes need annual income smart born merits upper caste superior human understand difference filled hate right seeing could see cos got merits born smart superior like share x tag ppl media make viral developer everything internet indexed search engines like google shows searched developers manually disable indexing sensitivity documents pages indexed comprehend shear incompetence display know literally easy flipping switch one privacy western concept share aadhar number even getting haircut pushed digital dont better digital securities bhai logo ne facebook dp pe laga rakhi hai aadhar pics sht man checked profile go find nearest cow take golden shower purify also need find fat bruhmaan feed course meal get purity go people post orignal people allowed happen first place free scratch milega kya aadhar know going get downvoted reason leaks arent indian govt udai security issues observe photos ids photo id ie places collected id negligent xerox copies photos even us ssn arent shared freely aadhar shared however want indiscriminately cause photos see net leaked govt website protect issue best use masked id virtual id reduce risk exposure said scams please ensure id linked phone number mail anyone access aadhar verification get notified may rise complaint authentication aadhar also verify sim cards taken using aadhar verification linkhttpstafcopsancharsaathigovin school minimise errors birth certificate aadhar card different surnames father top discovered mother used maiden name birth certificate thanks teacher able correct fathers name start using mothers maiden name documents everything open nothing secret companies need protect confidential data properly proper security setup dont want invest data security dont care get hacked data privacy joke india something people posting adhar card fake spam posts unless pii politicians relatives leaked action would taken assumption thing shouldnt problem info stored securely deleted needed year case however doesnt happen cases would immediate lawsuits millions lot countries organizations sticking gdpr compliance eu happened european western countries company would sued remember applying long time back since dont live country never use mine every time visit pain everyone asking clue wonder find seem coming one website indianaerospaceandengineeringcomhttpindianaerospaceandengineeringcom carelessness website owner builder disallow urls robotstxt contain sensitive information stuff like happens wordpress somehow involved old admin admin bahut phle ki leak hai yeh jab new aaya tha tabhi ki u changing subject like avg typical indian looks like wall foot thick foot high biggest flaw institutions asking aadhar copy would need digital public infrastructure designed assumption security thats say security shouldnt invested instead design based blast radius minimisation isolation centralisation id exact opposite effect larger system needs designed minimise blast radius im even getting whether id needed education matter rte kyc thing way secure pakistani admins countrys future dont need search already available dark web access one million places google spill aadhar info never safe country urinate publicly privacy definitely alien term congratulations making even popular great fucking work buddy checked software guy think senior today relax bikes asian bariatrics companies aadhar cards employees clientswhich bad thing indian aerospace closed server something another site shows access denied probably mistake backend allows anyone access data something idk man go random organisation see hiring done fashion immediate family members extended family sub caste native sub native mother tongue caste token womandalitmuslim think anyone cares ability every uppercaste meritorious chaste innocent pious person gb text info aadhar card holders non imageonly details text format downloaded telegram supa leak back aadhar details vaccinated indians leaked couple tb image data actual post repost kardete wasnt already posted runitedstatesofindia hours ago omg found people uploaded adhar cards fucking pinterest way end going get downvoted comment deleted permanently banned sub vishawaguru else happen kyc mandated every often many different agencies people ask documents tried even fing passports chai wale ko pm ban ayenge kya hi ummeed karen desh se wahan seer body hinduon ko cow urine consume karne bolrahi hai purify accidental consumption mandir laddus kya hoga desh ki janta ka international level pe bezzati ke saare records todenge hum ever secure begin one id everyone asks many hotels academic institutes travel agencies telecom service providers etc already aadhar wishes choice treat like one document use everywhere important ids like pan ration card passport secure sacrificial id thats worth aka gov industry want aadhaar everything simply cant private thanks bringing issue next question get databases secured inaccessible public fact born india makes even harder migrate even wanted era born india curse give masked aadhar lmaoo welcome imperialism congress began aadhar precise intention make mandatory everywhere bjp played token opposition going sane person would known bjp would retract something useful central government based delhi one reasons people rarely pay attention providing aadhar details anywhere asked come across apps testing numerous loan apps ask aadhar card dont even go verification via aadhar site confirmation belongs person people provide past years abundance apps millions people used apps require collateral anything loans datagathering scam sites elaborate india produces number engineers crazy bad basic infrastructure data leaked government source private source data privacy western concept part culture like weekends work life balance reasonable working hours per day guys blur digits sharing anyone less government gives lectures western concepts wearing suits using mobile phones social media using sort technologies western concepts bunch mindless hypocrites smh surface level rabbit hole goes deep horrifying leak leak happens hacker deliberately steals data accidentally data became public websites served documents public directory anyone internet see websites fault logic cbi wants know location government sells data applied neet government officials sell aadhar card details along marks scammers agents india mein privacy naam ki ki cheez nai hai angrez chale gaye ab corrupt neta ki gulami kar rhe sarcasm irony jokes dude im mocking indian ceos startup founders justify malpractices invoking indian culture many entries number people present file hacker know address thanks already know address responsible oh u mean movies bollywood mean blast radius exposure every student every bank customers aadhar details address date birth phone number feeling parowd endian linked pancard linked bank account linked political move dont give shit us masked aadhaar almost zero acceptance experience works identity proof airports far understand hope ethical thing ie get bunch indian sim cards name still dont affect us aadhaar details leaked could easily scammed person data aadhaar nothing afaik opinion pretty sure pretty known aadhar cards initially introducedthe main problem government infinite wisdom didnt encrypt aadhar card information saved cloud servers made easilly available using google search since aadhar card used documents situation inevitable hacker targetted politicians strictly comedy purposes could ways certain groups crowdfund note lawyer asked say comedic purposes oh hilarious though imagine someone hacks godi channel feeds across cable telecast shenanigans course would soooo unethicals unethical anti national actually want see someone hack trumps instagram start spamming stuff wonder followers ever figure hacked im joking obviously superpower saaaaarr yeah years ago exact discussion relatives database security really abysmal hacked easily anyone half competent hacking relatives lets say patriotic labelled antinational saying best security measures world govt said gon na send post techno guy cant exactly say leaks like bro clearly hasnt rave digital india train running loose unmaintained tracks risk derailments accidents around basically like actual trains even adhar requested kyc government failed regulare collection processing proteyif data modes authenticating adhar without actually submit copy unmasked adhaar government doesnt promote mandate ill leave whoever studying please contact take atleast stop indexed google crawler search engine crawlers setting robotstxt httpsindianaerospaceandengineeringcommediastudentaadharcardhttpsindianaerospaceandengineeringcommediastudentaadharcard google search following intitleindex aadhaar many website aadhaar cards visible without authentications websites denied access guest accounts also bypassed shows one sim name whereas taken one looks like digi yatra gate airport every hacker already aadhar yeah isnt news example months ago trying apply certain big government education institute creating account wasnt working looked bit happening site bam stupid sqli vulnerability allowing logging admin peoples personal details including bankingaadhar right open even warning tech team issue still present almost year incident",
    "light_cleaned_title": "Sensitive Aadhaar, PAN, and passport details of Indians are openly available on Google, posing a serious data security threat",
    "light_cleaned_selftext": "I just searched \"index of Aadhaar card\" on Google and bam! Millions of Aadhaar card details are freely available on Google from various websites, like schools, colleges, corporate offices and many others. Not just Aadhaar card. PAN, voter and passport ID, etc, are also very common there. Not a techno guy, so can't exactly say how it leaks like that. But these websites definitely don't have any security on their client's data. The keyword reveals certain PAGES of these websites that are not found directly on their site but are visible to Google, without protection. These pages should be hidden, but they aren't. Weird! There are so many websites like that, so many, and each website is leaking thousands of data like that. These documents are so important and connected to our bank accounts and SIM cards. It can be used to scam anyone with our details and see the keyword suggestion. Many people search these long tail keywords on Google, for what?.. get it? ☠️ It's giving me anxiety now!",
    "light_cleaned_comments": "Lo krlo baat. How big this issue can evolve into before steps are taken to curb it Indian data privacy be like At this point i am thinking Why tf am i living in this shit hole If your data is leaked, hackers can’t hack it believe me the Information Technology Act, 2000 is outdated and it doesnt even have provisions for modern technologies like AI, blockchain etc. you shouldnt have posted the index, now many people will go and see. When you have 99% reservations in jobs for upper castes and every company is hiring basis sub caste and native place this is what you get! It's similar to open hotspot that anyone can connect to. These institutions (both public & private) do not bother to encrypt or at the very least put up a password to their database. They appear to have to taken it for granted that they will not be held accountable. Privacy indeed is a joke in this hinterland. Also govt was blocking apps left & right during the time of covid but didn't even request the companies to delete the user data of Indians nor citizens were instructed to delete the account/data associated with the app. Even today if you login to those apps (like tik tok) with vpn, you can see indian user data. Indians be like.... Data privacy... what does that Mean? The root problem is the pervasive use of Aadhaar in every single thing. Just yesterday, I received an ultimatum from my kid's school with hints that if I continue to refuse to provide Aadhaar for him, myself & my wife, my kid may not be able to register for his board exams. I'd provided them with our passport copies until now, but it seems the department of education's internal portal requires Aadhaar. I don't have the will to fight this anymore, and I will be providing it tomorrow. Curse Nilekani & everyone else in my industry who worked on this monstrosity. All this horror lies squarely at your footsteps. Moronic \"digitalisation specialists\" assisting moronic bureaucrats. 4d move by our government Stop worrying man, your data is encircled by 5 foot thick & 13 foot high wall. No one can steal it. /s It’s not some top secret . Normal index of Aadhar search will give you these details Batao abb koi kya kare? ye log itne jhatu hain ki data encrypt na kar paye? bass paisa khane ko bol do sara din. Are you sure?....*Dhoom music rolls* Kuchh nai hone wala. Humara pyaara “Bharat” hai ye. 🙂 99% reservation in jobs for upper castes? Yeh kab hua? What movie is this from? Even Voter Helpline app can give more info about a person openly which is a risk actually. But govt doesn't care about it. At the rate we are giving away photocopies every few days for every damn thing we shouldn’t be surprised Where the fuck do you live? Where I live, \"backward caste\" has reservation (I don't consider anyone backward but the government has certified some people to be and they are happy with that). Data privacy? Yeh kaunsa naya janvar hai? Jo bhi ho, humari sanskriti aur parampara ka koi jawab nahi. now try reverse image searching an aadhar card photo on a site like [yandex.com](http://yandex.com) They literally copied this segment from Johnny English wtf dhamaal Yeah right mate, I just checked, only Dalits and Muslims are in private sector jobs, upper castes are all jobless, I am sorry, I misspoke. Also there is no Casteism so getting riled up with my post seems counter intuitive, but nevertheless first you need to make up your mind about you identity -- is it Hindu, middle class, comman man or honest tax prayer cos there is nothing like 'upper castes'. This isn't new though...years ago I ordered something from eBay (India to US), and the box came with the sender's aadhar card copy with the customs form. Ragebait a2 + b2 se nikalne wali extra energy hai modi ji ki😉 how bro its is not showing for me Oh shit. There is so much data there >Where the fuck do you live? You should check where you live, all upper castes have gotten together can created a reservation for themself called EWS... They don't seem to be happy but they want all the reservations for themself and they have special merit glands in their behind and need to sh*t merits wherever they go! Hahaha this is exactly what I was trying to say Yeah you need to go to famous youtuber coaching centre to get this! Mat kro isse behas Sirf ek hi comment copy paste karte Jaa rha hai. Profile dekh lo 😂😂 So, people who are poor should not get anything and people who are smart shouldn't get anything either, right? We cannot get scammed because WE ARE THE SCAMMERS I AM THE ONE WHO KNOCKS!!!!! Sholay maine bhi dekhi h It means somewhere on Google our aadhar cards are also available for free :( I see. Thanks for the heads-up. I won't argue further with him. Thanks! /s Yeah everyday I see 'smart' people by birth asking how to get EWS reservations on legal India sub reddit. Also upper castes earning 8L per anum is poor, but the maid who is lower caste coming to you house to do your household work is driving bmw and living in bunglow. I don't want to argue with you. Believe what you want because you are too blinded by hate and I have no time to keep engaging with rhetoric. The data is so huge, people are ignoring it. I've said it before I'll say it again - Aadhar is a disaster waiting to happen. And when it does, God save all. EU when it comes to privacy ♾️/100 India when the same -69/100 There's a reason why Truecaller shifted their hq in india... At this point why do you guys keep voting for bjp lmao It feels like every other day there is a fuck up. Masterstroke move by our supreme lodu Johnny English You should make up your mind, does casteism exists or not? As per you it doesn't exist, then you should not care about my comments on 'upper castes'. Also there is no identity like 'upper castes' there is for subhumans like Dalits and Muslims. But yet you think so called 'upper castes' are poor and smart and deserve everything. If someone is born dalit or muslim automatically he is not smart and rich, right? EWS reservations is 'only' for upper castes, as someone who is SC ST or Muslims cannot be poor... Also for SC, ST, Muslims etc to be a poor person annual income should be less than 15000 (eligibility for yellow and green card). While getting EWS reservations, upper castes need to have annual income of 8,00,000. You are smart, and born with merits in upper caste, a superior human, you should understand the difference between 15000 and 8,00,000. But I am just filled with hate, you all are right... I am not seeing what you could see, cos I got no merits. I am not born smart and superior like you. Share on X, tag ppl and media and we make it viral Developer here. Everything on internet is indexed by search engines like Google so that it shows up when searched. The developers have to manually disable indexing so that sensitivity documents and pages are not indexed. To comprehend the shear incompetence on display, just know that it's LITERALLY AS EASY AS FLIPPING A SWITCH and no one did it. Privacy is a western concept. Here, we share aadhar number even for getting a haircut. We pushed for more digital but we dont have better digital securities.. Bhai logo ne Facebook Dp pe laga rakhi hai aadhar pics. Sh*t man, you checked my profile, now you go find a nearest cow and take a golden shower to purify yourself. Also need to find a fat bruhmaan and feed him 7 course meal to get more purity. They will go after the people who post this, not the orignal people who allowed this to happen in the first place. Free scratch milega kya for my aadhar? I know that I am going to get downvoted, but the reason for these leaks aren't Indian govt UDAI Security issues. If you observe most of these photos are not IDs but photo of ID. i.e the places which collected your ID is negligent with your xerox Copies and photos. even in US the SSN aren't shared freely but here Aadhar is shared however we want indiscriminately this is the cause of above photos we see on net. These are not leaked from govt Website. Now to protect yourself from these issue , the best you can do is use masked ID (or) Virtual ID. These will reduce your risk of exposure to any said scams, and please ensure that Your ID is linked with your phone number and mail such that if anyone access your Aadhar for verification, you get notified and you may rise complaint against authentication of aadhar . Also verify if any sim cards are taken using your aadhar . [verification link](https://tafcop.sancharsaathi.gov.in/) The school is doing this to minimise errors. My birth certificate and aadhar card had different surnames for my father, on top of that I discovered that my mother used her maiden name for my birth certificate. Thanks to my teacher I was able to correct my fathers name and start using my mothers maiden name on all documents. If everything is open, nothing is secret. Companies need to protect confidential data properly and have proper security set-up. They just don't want to invest in data security and don't care if they get hacked. Data privacy is a joke in India. Now this is something There are people posting their adhar card on fake spam posts. Unless PII of politicians and their relatives are not leaked, no action would be taken. This is my assumption. The thing is this shouldn't be a problem if this info is stored securely and deleted after it's not needed (1 year in this case) . However, that doesn't happen in most cases. This would be immediate lawsuits of millions in a lot of countries for organizations not sticking to GDPR compliance in EU. If this happened in European or western countries, the company would have been sued by now. I remember applying a long time back and since I don’t live in the country, never had to use mine. Now every time I visit it’s a pain with everyone asking and I have no clue where it is. I wonder if I can find it here. They all seem to be coming from one website: [indianaerospaceandengineering.com](http://indianaerospaceandengineering.com) This is the carelessness of the website owner and builder. You have to disallow those URLs in robots.txt that contain sensitive information. why is it that when stuff like this happens, Wordpress is somehow involved. The old admin admin bahut phle ki leak hai yeh jab new me aaya tha tabhi ki u changing subject like avg typical indian It looks more and more like the wall is 13 foot thick and 5 foot high. 😂😂😂 Biggest flaw is all institutions asking for aadhar copy. Why would you need that? Digital public infrastructure cannot be designed on an assumption of security (that's not to say security shouldn't be invested in). Instead, design should be based on blast radius minimisation and isolation. Centralisation of ID has the exact opposite effect. The larger the system, the more it needs to be designed to minimise blast radius. And I'm not even getting into whether an ID should be needed here at all. Education is a matter of RTE, not a KYC thing. Way secure than Pakistani Admin's Country's future. you dont need to search it, it already available on dark web and you can access it through one million places. google is just a spill. your aadhar info was never safe A country where you can urinate publicly so privacy is definitely an alien term here congratulations on making it even more popular , great fucking work buddy I just checked it I am not a software guy, I think senior today relax bikes, asian Bariatrics are companies and the aadhar cards on there are of their employees or clients(which is a bad thing) Indian aerospace closed their server or something another site shows access denied it is probably some mistake in the backend that allows anyone to access their data or something idk Man just go to any random organisation, you will see the hiring the done in this fashion- 1. Immediate Family members 2. Extended family 3. Same sub caste and native 4. Same sub not same native but same mother tongue 5. Same caste 6. Token woman/dalit/muslim You think anyone cares about ability, when every uppercaste is meritorious, chaste, innocent and pious person. I have 47gb of text info of aadhar card holders( non image/only details in text format). Downloaded from telegram SUPA leak back in 2023 in which all the aadhar details of vaccinated Indians was leaked. There was a couple tb of image data too. Actual post repost kardete. Wasn't this already posted to r/unitedstatesofindia 10 hours ago. omg i just found out people have uploaded their adhar cards on fucking pinterest No way to end this Going to get downvoted , comment deleted and permanently banned from the sub 🤔 #Vishawaguru What else will happen when KYC is mandated every so often. And so many different agencies and people ask for your documents. I just tried it out and 💀.. even fing passports! Chai wale ko PM ban ayenge to kya hi ummeed karen is desh se. Wahan seer body Hinduon ko cow urine consume karne bolrahi hai to purify after the accidental consumption of mandir laddus. Kya hoga is desh ki janta ka! International level pe bezzati ke saare records todenge hum. 🤦‍♂️ Were they ever secure to begin with? It's that one ID everyone asks for. So many hotels, academic institutes, travel agencies, telecom service providers, etc already have my Aadhar (against my wishes, had no choice). I treat it like that one document which I use everywhere now, so my other important IDs like PAN, Ration Card and Passport are secure. A sacrificial ID, that's all it's worth. When you (aka gov and industry) want aadhaar for everything, it simply can't be private. Thanks for bringing this issue up. Now the next question is, how do we get these databases secured and inaccessible to the public? And the fact that we are born in india makes it even harder to migrate even if we wanted to. In this era being born in india is a curse. Can you give the masked Aadhar? Lmaoo Welcome to imperialism. Congress began aadhar with the precise intention to make it mandatory everywhere. BJP played token opposition going against it before 2014. Any sane person would have known BJP would not retract something that is so useful to the central government based in delhi One of the reasons that people rarely pay attention to is providing their Aadhar details anywhere if asked. I have come across such apps while testing the same. Numerous loan apps ask for an Aadhar card, and they don't even go for the verification via the Aadhar site for confirmation if it belongs to the person or not. But, people provide it. In the past 3 years, there has been an abundance of such apps and millions of people have used these apps as they do not require collateral or anything for the loans. They are data-gathering scam sites. elaborate India produces the most number of IT engineers , it's crazy how bad our basic infrastructure is. was this data leaked from a government source or a private source Data privacy is a western concept it's not a part of our culture, just like weekends, work life balance and reasonable working hours per day. Guys just blur your digits when sharing with anyone less other than government Gives lectures about western concepts while wearing suits, using mobile phones, social media and using all sort of technologies which are western concepts. Bunch of mindless hypocrites. Smh. It's just the surface level, the rabbit hole goes deep. It's horrifying. It’s not a “leak”. A leak happens when a hacker deliberately steals data or accidentally the data became public. These websites had served these documents in a public directory where anyone with internet can see. It’s the websites’ fault. what about logic? is it? CBI wants to know your location The government itself sells off our data If you have applied for NEET, the government officials sell out your Aadhar card details along with your marks to scammers and agents India mein privacy naam ki ki cheez nai hai. Angrez chale gaye ab corrupt neta ki gulami kar rhe It's sarcasm and irony and jokes my dude. I'm mocking the Indian ceos and startup founders who justify malpractices by invoking Indian culture. How many entries as in the number of people present in the file of yours? Hacker: _I know your address_ 😈 Me: _Thanks but I already know my address_ 🗿 Who is responsible Oh u mean 90% of 90s movies in Bollywood. I mean the blast radius is 'exposure of every student or every bank customer's aadhar details (address, date of birth, phone number) fEeLiNg Parowd endian Linked to pancard linked to bank account and linked to what not It was just a political move they don't give a shit about us Masked Aadhaar has almost zero acceptance in my experience. It only works as an identity proof in Airports as far as I understand. Hope you did the most ethical thing, i.e. get a bunch if Indian SIM cards in his name... still don't how it will affect us. if my aadhaar details are leaked I could easily be scammed by some other person with the data that aadhaar has about me but nothing more than afaik your opinion? pretty sure this was pretty known when aadhar cards initially were introduced,the main problem is the government in their infinite wisdom didn't encrypt the aadhar card information saved on cloud servers which made them easilly available using a google search and since aadhar card can be used for all your other documents this situation was inevitable If only there was a hacker that targetted politicians This is strictly for comedy purposes, but there could be ways for certain groups to crowdfund this. #Note: My lawyer asked me to say, this is just for comedic purposes. Oh that is hilarious. Where though? Imagine if someone hacks into the godi channel feeds across the cable to telecast the shenanigans. 😂 Of course that would be soooo unethical.../s So unethical and anti national. I actually want to see someone hack Trump's instagram and start spamming stuff. Wonder if the followers will ever figure out if it has been hacked. I'm joking obviously. Superpower 2020 SaaAaArr Yeah, a few years ago I was having the exact same discussion with my relatives that our database security is really abysmal which can be hacked easily by anyone who is half competent in hacking and the relatives who are, let's say, \"patriotic\" labelled me anti-national for saying that as we have the \"best security measures\" in the world, as the govt. said. I am gonna send this post to them. >Not a techno guy, so can't exactly say how it leaks like that. Bro clearly hasn't been to a rave. digital india train running on loose unmaintained tracks, risk of derailments and accidents all around. basically like our actual trains even if adhar is requested for kyc, government has failed or regulare collection, processing and proteyif data. there are modes of authenticating adhar without actually having to submit a copy of unmasked adhaar, but government doesn't promote it or mandate it. I'll just leave this here. Whoever is studying here please contact them to take these down or atleast stop it from being indexed by google crawler or any other search engine crawlers by setting up a robots.txt. [https://indianaerospaceandengineering.com/media/student/aadharcard/](https://indianaerospaceandengineering.com/media/student/aadharcard/) If you do a google search with the following: `intitle:\"index of\" aadhaar`, there are many website in which aadhaar cards are just visible without any authentications. Some websites have denied access for \"guest\" accounts but then those can also be bypassed. It shows just one SIM in my name whereas i have myself taken more than one. Looks like the digi yatra gate at an airport. Every hacker already has our Aadhar by now Yeah, this isn't news. For example, a few months ago I was trying to apply to a certain big government education institute. Creating an account wasn't working, so I looked a bit into what was happening in the site, and bam. Stupid SQLi vulnerability allowing logging in as admin. Had people's personal details (including banking/aadhar) right in the open. Even after warning there tech team about it, the issue is still present almost a year after the incident."
}