{
    "id": "10ot00w",
    "title": "I believe someone is tried to phish me..",
    "url": "https://www.reddit.com/r/india/comments/10ot00w/i_believe_someone_is_tried_to_phish_me/",
    "selftext": "Downloading Movies from torrents for years using my mobile but never seen this notification. Redirected to this web page while tried to download a movie torrent from YTS using my laptop for the first time. \n\nI Believe in India we can download torrents it's not much of a crime but we are not allowed to run a torrent providing servers.\n\nAm I correct?\n\nhttps://preview.redd.it/zgxaef0p04fa1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=9e2f7cc11f600128cd321d92a27960a8cde3e862",
    "flair": "AskIndia",
    "score": 10,
    "num_comments": 12,
    "created_utc": 1675053915,
    "convurl": "https://b.thumbs.redditmedia.com/mZULVhYSYSR-yvMwEdY0EpL34NAvNPjvmXxdHf0ug9c.jpg",
    "comments": [
        "This is just a phishing attack. This  [link](https://gbhackers.com/fake-address-bar/) shows you how it's done.\n\nHowever a torrent will amount legally to distribution since each peer acts as a server too. Now sharing a file is not illegal if there is permission to do so. However movies etc are protected by copyright so technically you are committing a crime. This violation is punishable with detention for a period that is not less than six months and can extend to three years. There will also be a fine of fifty thousand rupees extending up to two lakh rupees. The penalty can be less than six months and less than fifty thousand when the violation was not for gains or profits during the business.\n\nEnforcement in India is lax on such matters. However that's not a pass to commit the crime. \"If you can't do the time don't do the crime\"",
        "I knew it..  \n\n\nThanks for sharing !!",
        "Send the link.",
        "Use a VPN, make your browser settings restrictive, block ads in general, and change your DNS when doing not so legal work ;)",
        "Why is it asking for 33,500? Is it scammer's emi or some shit?",
        "But the guy seems to be on his laptop.\n\nSo, that doesn't explain how the URL on his address bar seems to be pointing to a legitimate domain of the  Indian government.",
        "\"The police will come to your house to arrest you\".\n\nLol.",
        "maybe the indian film producers' union?",
        "Yes I noticed that too, wtf",
        "Maybe the domain is compromised but the govt doesn’t do jack shit? Maybe one of the govt employee is running this scam?",
        "They should have added challan at a state Treasury to fake some authenticity.",
        "Nah, more likely his browser has been compromised and there is an extension that is doing the tricks or his filesystem has been compromised and they've modified his hosts file."
    ],
    "cleaned_text": "believe someone tried phish downloading movies torrents years using mobile never seen notification redirected web page tried download movie torrent yts using laptop first time believe india download torrents much crime allowed run torrent providing servers correct ",
    "cleaned_title": "believe someone tried phish",
    "cleaned_selftext": "downloading movies torrents years using mobile never seen notification redirected web page tried download movie torrent yts using laptop first time believe india download torrents much crime allowed run torrent providing servers correct",
    "cleaned_comments": "phishing attack linkhttpsgbhackerscomfakeaddressbar shows done however torrent amount legally distribution since peer acts server sharing file illegal permission however movies etc protected copyright technically committing crime violation punishable detention period less six months extend three years also fine fifty thousand rupees extending two lakh rupees penalty less six months less fifty thousand violation gains profits business enforcement india lax matters however thats pass commit crime cant time dont crime knew thanks sharing send link use vpn make browser settings restrictive block ads general change dns legal work asking scammers emi shit guy seems laptop doesnt explain url address bar seems pointing legitimate domain indian government police come house arrest lol maybe indian film producers union yes noticed wtf maybe domain compromised govt doesnt jack shit maybe one govt employee running scam added challan state treasury fake authenticity nah likely browser compromised extension tricks filesystem compromised theyve modified hosts file",
    "light_cleaned_title": "I believe someone is tried to phish me..",
    "light_cleaned_selftext": "Downloading Movies from torrents for years using my mobile but never seen this notification. Redirected to this web page while tried to download a movie torrent from YTS using my laptop for the first time. I Believe in India we can download torrents it's not much of a crime but we are not allowed to run a torrent providing servers. Am I correct?",
    "light_cleaned_comments": "This is just a phishing attack. This [link](https://gbhackers.com/fake-address-bar/) shows you how it's done. However a torrent will amount legally to distribution since each peer acts as a server too. Now sharing a file is not illegal if there is permission to do so. However movies etc are protected by copyright so technically you are committing a crime. This violation is punishable with detention for a period that is not less than six months and can extend to three years. There will also be a fine of fifty thousand rupees extending up to two lakh rupees. The penalty can be less than six months and less than fifty thousand when the violation was not for gains or profits during the business. Enforcement in India is lax on such matters. However that's not a pass to commit the crime. \"If you can't do the time don't do the crime\" I knew it.. Thanks for sharing !! Send the link. Use a VPN, make your browser settings restrictive, block ads in general, and change your DNS when doing not so legal work ;) Why is it asking for 33,500? Is it scammer's emi or some shit? But the guy seems to be on his laptop. So, that doesn't explain how the URL on his address bar seems to be pointing to a legitimate domain of the Indian government. \"The police will come to your house to arrest you\". Lol. maybe the indian film producers' union? Yes I noticed that too, wtf Maybe the domain is compromised but the govt doesn’t do jack shit? Maybe one of the govt employee is running this scam? They should have added challan at a state Treasury to fake some authenticity. Nah, more likely his browser has been compromised and there is an extension that is doing the tricks or his filesystem has been compromised and they've modified his hosts file."
}