{
    "id": "1bg4eoc",
    "title": "What tf is this packaging. Has this happened to anyone else?",
    "url": "https://www.reddit.com/gallery/1bg4eoc",
    "selftext": "I didn't join shit. How to opt out from this 😭.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 10,
    "created_utc": 1710590209.0,
    "convurl": "https://i.redd.it/y47bt4axqooc1.jpg",
    "comments": [
        "It's good packaging. There is already a box, so it doesn't make sense to pack it in another box. Though, the wire shouldn't have been sent without packaging.",
        "Yes, recently in two cases. One time a birthday gift toy which was not packed and original packing totally mangled due to the way their courier guys handle. Couldn't return due to lack of time. \n\nAnother instance of they sent mens briefs in original packing.",
        "Yes it's a box cost saving strategy. You gon throw the box anyway so why rant ? If it's damaged send it back . Simple",
        "This is common now, especially for one day/same day delivery. They sent my Rs 14000 Amazon Kindle with no extra box.",
        "Now they are just putting bill stickers",
        "didn’t opt in to save the environment? yea, opt out, let the planet die…",
        "S",
        "There is a small issue with that logic. If the item was damaged due to poor packing,it will be returned by the customer and the advantage of environment friendly package is lost.\n\nSo environment friendly package shall be used for non fragile items and for items with their own damage proof box.\n\nThe initiative is good if properly implemented.",
        "Amazon doesn’t give two shits about the environment. This is just an excuse to lower their packaging costs at warehouse level",
        "It is always about the money."
    ],
    "cleaned_text": "tf packaging happened anyone else didnt join shit opt ",
    "cleaned_title": "tf packaging happened anyone else",
    "cleaned_selftext": "didnt join shit opt",
    "cleaned_comments": "good packaging already box doesnt make sense pack another box though wire shouldnt sent without packaging yes recently two cases one time birthday gift toy packed original packing totally mangled due way courier guys handle couldnt return due lack time another instance sent mens briefs original packing yes box cost saving strategy gon throw box anyway rant damaged send back simple common especially one daysame day delivery sent rs amazon kindle extra box putting bill stickers didnt opt save environment yea opt let planet die small issue logic item damaged due poor packingit returned customer advantage environment friendly package lost environment friendly package shall used non fragile items items damage proof box initiative good properly implemented amazon doesnt give two shits environment excuse lower packaging costs warehouse level always money",
    "light_cleaned_title": "What tf is this packaging. Has this happened to anyone else?",
    "light_cleaned_selftext": "I didn't join shit. How to opt out from this 😭.",
    "light_cleaned_comments": "It's good packaging. There is already a box, so it doesn't make sense to pack it in another box. Though, the wire shouldn't have been sent without packaging. Yes, recently in two cases. One time a birthday gift toy which was not packed and original packing totally mangled due to the way their courier guys handle. Couldn't return due to lack of time. Another instance of they sent mens briefs in original packing. Yes it's a box cost saving strategy. You gon throw the box anyway so why rant ? If it's damaged send it back . Simple This is common now, especially for one day/same day delivery. They sent my Rs 14000 Amazon Kindle with no extra box. Now they are just putting bill stickers didn’t opt in to save the environment? yea, opt out, let the planet die… S There is a small issue with that logic. If the item was damaged due to poor packing,it will be returned by the customer and the advantage of environment friendly package is lost. So environment friendly package shall be used for non fragile items and for items with their own damage proof box. The initiative is good if properly implemented. Amazon doesn’t give two shits about the environment. This is just an excuse to lower their packaging costs at warehouse level It is always about the money."
}