{
    "id": "153n8gr",
    "title": "Beware of Flipkart. You might end up losing a big sum of money, avoid them.",
    "url": "https://www.reddit.com/r/india/comments/153n8gr/beware_of_flipkart_you_might_end_up_losing_a_big/",
    "selftext": "Recently Flipkart scammed me.\n\nSo I ordered a bunch of T-shirts from Flipkart, and I wanted to return one of them. I instantly generated the return request within just 24 hours. It was on 31st May 2023.\n\n[As you can see i generated the return req on 31st may 2023.](https://preview.redd.it/r65l1rtoavcb1.png?width=2314&format=png&auto=webp&s=ff8ec9b11e751439f98e414f732ab7a4534bf8f9)\n\nToday is the 19th of July, and it's still not picked up. I have received numerous calls from Flipkart that they are working on the issue \"it will take 24 to 48 hrs,\" I even filed a complaint on: [https://consumerhelpline.gov.in/](https://consumerhelpline.gov.in/)\n\nOn the portal, they replied to my comment with this:\n\n[What kind of joke it is, I made the return req on 31st May already.](https://preview.redd.it/tq33alavavcb1.png?width=2604&format=png&auto=webp&s=492cd24484673a0310b6281414bccca4f7b3b866)\n\nSo what options am i left with? It's the consumer court, and Flipkart knows that probably less than 0.1% of the people will go to consumer court in my scenario. And hence they don't care!!!\n\nNow, imagine how many people must have gone through this and mentally harasses when they call you and repeat same thing again and again that \"We are working on the issue, please wait for 24 to 48 hours,\" Yes! I think it's mentally harassing something to that point that the person end up, \"Please don't call me again.\"\n\nAlso, 800 is not a big amount, imagine they put you in my situation with some huge sum?? TBH it has never happed with me on Amazon ever.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689749328.0,
    "convurl": "https://b.thumbs.redditmedia.com/5Ut3P7mo1rCdP-u-seID81jvHoX4GgeoUp_4UbwGH7Q.jpg",
    "comments": [
        "I swear this is the third time I am seeing a Flipkart post today in r/India",
        "True idk why they re going all out on flipkart at the same time today.",
        "Is it Flipkart day today? I am not complaining though",
        "Maybe all these people ordered on the looks like it",
        "Same thing happened with me but with amazon . I returned it but it wasn’t showing in their system. One tweet and it was sorted",
        "Looks like we all wanna vent together.",
        "I had received a weird Chinese headphones (150-200 one’s) instead of boat headphones, which were ordered by me. It wasn’t resolved and somehow I let go my ₹1000 back then. One year later, there was a sale and had the new gen headphones for 1100. I remembered my 1000 lost at Amazon. I again raised a concern and got my 1000 back. \n\nAmazon resolved my issue which was 1 year old, even after closing it back then. Damn their service and value for customers. I never order anything on Flipkart ever since. Amazon is always the way to go for me.",
        "\nJoin the guy who took revenge on Flipkart by ordering 3 refrigerators to 3 random addresses lol",
        "It's always a gamble my friend.",
        "Too many redflags lately from Flipkart avoid any electronic purchases",
        "I just bought a Laptop from Flipkart during the sale. Now I feel like I should probably cancel it.",
        "That's me, let's do it together, flipkart must pay",
        "Maybe trying to dissuade us from buying on flipkart Big Billions Day?",
        "Sb apni bhadas nikal rhe hai aaj",
        "You should always buy from Amazon.",
        "Same thing happened with me on 4th of July I am still complaining them but they are just taking time and delaying the time to resolve my issue. My product cost was 2300 rupees. Honestly it hurts when your hard earned money is lost  like that.",
        "Tjese Flipkart mofos sent me a washing machine which already had water inside. Assholes",
        "Similar thing happened with me a few months back. Got a wrong product delivered in grocery order. Lost around 500 rs. Uninstalled the app.",
        "True and they don't care because they know the state of our judiciary system.",
        "No, u need to be aware about Digital security.",
        "Not sure how much water was present in your machine, but some moisture in a newly delivered machine is fine. It shows that there was a final inspection done before it was delivered to you. So, not always a red flag.",
        "Beware of Flipkart. They don't have return for most of their items. Even if they have it's through the manufacturer side. So look for other options."
    ],
    "cleaned_text": "beware flipkart might end losing big sum money avoid recently flipkart scammed ordered bunch tshirts flipkart wanted return one instantly generated return request within hours st may see generated return req st may httpspreviewredditrlrtoavcbpngwidthformatpngautowebpsffecbefefababff today th july still picked received numerous calls flipkart working issue take hrs even filed complaint httpsconsumerhelplinegovinhttpsconsumerhelplinegovin portal replied comment kind joke made return req st may alreadyhttpspreviewreddittqalavavcbpngwidthformatpngautowebpscdabbcccafbb options left consumer court flipkart knows probably less people go consumer court scenario hence dont care imagine many people must gone mentally harasses call repeat thing working issue please wait hours yes think mentally harassing something point person end please dont call also big amount imagine put situation huge sum tbh never happed amazon ever ",
    "cleaned_title": "beware flipkart might end losing big sum money avoid",
    "cleaned_selftext": "recently flipkart scammed ordered bunch tshirts flipkart wanted return one instantly generated return request within hours st may see generated return req st may httpspreviewredditrlrtoavcbpngwidthformatpngautowebpsffecbefefababff today th july still picked received numerous calls flipkart working issue take hrs even filed complaint httpsconsumerhelplinegovinhttpsconsumerhelplinegovin portal replied comment kind joke made return req st may alreadyhttpspreviewreddittqalavavcbpngwidthformatpngautowebpscdabbcccafbb options left consumer court flipkart knows probably less people go consumer court scenario hence dont care imagine many people must gone mentally harasses call repeat thing working issue please wait hours yes think mentally harassing something point person end please dont call also big amount imagine put situation huge sum tbh never happed amazon ever",
    "cleaned_comments": "swear third time seeing flipkart post today rindia true idk going flipkart time today flipkart day today complaining though maybe people ordered looks like thing happened amazon returned wasnt showing system one tweet sorted looks like wan na vent together received weird chinese headphones ones instead boat headphones ordered wasnt resolved somehow let go back one year later sale new gen headphones remembered lost amazon raised concern got back amazon resolved issue year old even closing back damn service value customers never order anything flipkart ever since amazon always way go join guy took revenge flipkart ordering refrigerators random addresses lol always gamble friend many redflags lately flipkart avoid electronic purchases bought laptop flipkart sale feel like probably cancel thats lets together flipkart must pay maybe trying dissuade us buying flipkart big billions day sb apni bhadas nikal rhe hai aaj always buy amazon thing happened th july still complaining taking time delaying time resolve issue product cost rupees honestly hurts hard earned money lost like tjese flipkart mofos sent washing machine already water inside assholes similar thing happened months back got wrong product delivered grocery order lost around rs uninstalled app true dont care know state judiciary system u need aware digital security sure much water present machine moisture newly delivered machine fine shows final inspection done delivered always red flag beware flipkart dont return items even manufacturer side look options",
    "light_cleaned_title": "Beware of Flipkart. You might end up losing a big sum of money, avoid them.",
    "light_cleaned_selftext": "Recently Flipkart scammed me. So I ordered a bunch of T-shirts from Flipkart, and I wanted to return one of them. I instantly generated the return request within just 24 hours. It was on 31st May 2023. [As you can see i generated the return req on 31st may 2023.](https://preview.redd.it/r65l1rtoavcb1.png?width=2314&format=png&auto=webp&s=ff8ec9b11e751439f98e414f732ab7a4534bf8f9) Today is the 19th of July, and it's still not picked up. I have received numerous calls from Flipkart that they are working on the issue \"it will take 24 to 48 hrs,\" I even filed a complaint on: [https://consumerhelpline.gov.in/](https://consumerhelpline.gov.in/) On the portal, they replied to my comment with this: [What kind of joke it is, I made the return req on 31st May already.](https://preview.redd.it/tq33alavavcb1.png?width=2604&format=png&auto=webp&s=492cd24484673a0310b6281414bccca4f7b3b866) So what options am i left with? It's the consumer court, and Flipkart knows that probably less than 0.1% of the people will go to consumer court in my scenario. And hence they don't care!!! Now, imagine how many people must have gone through this and mentally harasses when they call you and repeat same thing again and again that \"We are working on the issue, please wait for 24 to 48 hours,\" Yes! I think it's mentally harassing something to that point that the person end up, \"Please don't call me again.\" Also, 800 is not a big amount, imagine they put you in my situation with some huge sum?? TBH it has never happed with me on Amazon ever.",
    "light_cleaned_comments": "I swear this is the third time I am seeing a Flipkart post today in r/India True idk why they re going all out on flipkart at the same time today. Is it Flipkart day today? I am not complaining though Maybe all these people ordered on the looks like it Same thing happened with me but with amazon . I returned it but it wasn’t showing in their system. One tweet and it was sorted Looks like we all wanna vent together. I had received a weird Chinese headphones (150-200 one’s) instead of boat headphones, which were ordered by me. It wasn’t resolved and somehow I let go my ₹1000 back then. One year later, there was a sale and had the new gen headphones for 1100. I remembered my 1000 lost at Amazon. I again raised a concern and got my 1000 back. Amazon resolved my issue which was 1 year old, even after closing it back then. Damn their service and value for customers. I never order anything on Flipkart ever since. Amazon is always the way to go for me. Join the guy who took revenge on Flipkart by ordering 3 refrigerators to 3 random addresses lol It's always a gamble my friend. Too many redflags lately from Flipkart avoid any electronic purchases I just bought a Laptop from Flipkart during the sale. Now I feel like I should probably cancel it. That's me, let's do it together, flipkart must pay Maybe trying to dissuade us from buying on flipkart Big Billions Day? Sb apni bhadas nikal rhe hai aaj You should always buy from Amazon. Same thing happened with me on 4th of July I am still complaining them but they are just taking time and delaying the time to resolve my issue. My product cost was 2300 rupees. Honestly it hurts when your hard earned money is lost like that. Tjese Flipkart mofos sent me a washing machine which already had water inside. Assholes Similar thing happened with me a few months back. Got a wrong product delivered in grocery order. Lost around 500 rs. Uninstalled the app. True and they don't care because they know the state of our judiciary system. No, u need to be aware about Digital security. Not sure how much water was present in your machine, but some moisture in a newly delivered machine is fine. It shows that there was a final inspection done before it was delivered to you. So, not always a red flag. Beware of Flipkart. They don't have return for most of their items. Even if they have it's through the manufacturer side. So look for other options."
}