{
    "id": "14yda83",
    "title": "Like many in India, I'm tired bribes and of trying to find a 'trustworthy' agents",
    "url": "https://www.reddit.com/r/india/comments/14yda83/like_many_in_india_im_tired_bribes_and_of_trying/",
    "selftext": "Most of us are tired of bribes and of trying to find a 'trustworthy' agents. We want to follow the legal process, even if it means waiting endlessly or sometimes taking matters to court.\n\nI have tried both. Waiting endlessly for local bureaucrats to act and taking matters to High Court [My story in The Hindu](\nhttps://www.thehindu.com/news/cities/bangalore/bengaluru-urban-dc-accused-of-violating-hc-order-over-issuance-of-khata/article66985535.ece)\n\nUnless you have a very high connection or recommendation, it is hard to say NO to bribes. In some departments in local governments (e.g revenue department, housing, property registration, RTO etc) NOTHING will move unless you come with a high-level recommendation or grease the palms. It is just a fact of life. \n\nFor example, many RTO offices around large cities have an 'organized' system with a network of agents and touts sitting outside who will get work done for a fee. \n\nHowever, larger departments like urban property, land-records and revenue departments are more opaque and it is harder to find agents who can be trusted. This is a bigger challenge when the bribe/'fee' amount can run into lakhs.\n\nHow do you navigate the process and find 'agents'?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689231042.0,
    "convurl": "https://external-preview.redd.it/fZ-LkH51-tLfTZG9a_r18hQblPi0KLatlaUOsCZ0og8.jpg?auto=webp&v=enabled&s=2fbc4d0afcb9d511a541aa9f590945b057799108",
    "comments": [
        "Won't tell\n\nReal ID se aao, CBI!",
        "CBI cares for the little fish?",
        "No need to talk to agents, just talk to the concerned officials",
        "I just renewed my Driver's License online in Kerala  on Parivahan website and got my new DL by speed post in 10 days after uploading all my documents. I paid about ₹500 as fees. I didn't had to visit any RTO office. Parivahan website could be better but it was functional when I tried. I could track the step by step like document scrutiny, approval, printing, mailing etc",
        "Real ID se aao, whatever anti-corruption official you may be!",
        "This is the way OP. Indian bureaucracy is tedious and laborious, but you should try to directly approach the office. It can take time & a lot of patience. It may take a few months. If you are employed, you may be fired. But dont worry about that too much. Once you know how to handle the system you can help others navigate the process for a fee.",
        "Do you have any experience with such matters?",
        "SBI?",
        "I had a similar experience in 2018. A *Change of Address* was achieved. There was a small technical issue at the RTO though but zero involvement of any unauthorized touts/agents.",
        "Kerala is an outlier in most of these cases.",
        "CBI is a codeword for saffron recruitment process.",
        "Yes, I have"
    ],
    "cleaned_text": "like many india im tired bribes trying find trustworthy agents us tired bribes trying find trustworthy agents want follow legal process even means waiting endlessly sometimes taking matters court tried waiting endlessly local bureaucrats act taking matters high court story hindu unless high connection recommendation hard say bribes departments local governments eg revenue department housing property registration rto etc nothing move unless come highlevel recommendation grease palms fact life example many rto offices around large cities organized system network agents touts sitting outside get work done fee however larger departments like urban property landrecords revenue departments opaque harder find agents trusted bigger challenge bribefee amount run lakhs navigate process find agents ",
    "cleaned_title": "like many india im tired bribes trying find trustworthy agents",
    "cleaned_selftext": "us tired bribes trying find trustworthy agents want follow legal process even means waiting endlessly sometimes taking matters court tried waiting endlessly local bureaucrats act taking matters high court story hindu unless high connection recommendation hard say bribes departments local governments eg revenue department housing property registration rto etc nothing move unless come highlevel recommendation grease palms fact life example many rto offices around large cities organized system network agents touts sitting outside get work done fee however larger departments like urban property landrecords revenue departments opaque harder find agents trusted bigger challenge bribefee amount run lakhs navigate process find agents",
    "cleaned_comments": "wont tell real id se aao cbi cbi cares little fish need talk agents talk concerned officials renewed drivers license online kerala parivahan website got new dl speed post days uploading documents paid fees didnt visit rto office parivahan website could better functional tried could track step step like document scrutiny approval printing mailing etc real id se aao whatever anticorruption official may way op indian bureaucracy tedious laborious try directly approach office take time lot patience may take months employed may fired dont worry much know handle system help others navigate process fee experience matters sbi similar experience change address achieved small technical issue rto though zero involvement unauthorized toutsagents kerala outlier cases cbi codeword saffron recruitment process yes",
    "light_cleaned_title": "Like many in India, I'm tired bribes and of trying to find a 'trustworthy' agents",
    "light_cleaned_selftext": "Most of us are tired of bribes and of trying to find a 'trustworthy' agents. We want to follow the legal process, even if it means waiting endlessly or sometimes taking matters to court. I have tried both. Waiting endlessly for local bureaucrats to act and taking matters to High Court [My story in The Hindu]( Unless you have a very high connection or recommendation, it is hard to say NO to bribes. In some departments in local governments (e.g revenue department, housing, property registration, RTO etc) NOTHING will move unless you come with a high-level recommendation or grease the palms. It is just a fact of life. For example, many RTO offices around large cities have an 'organized' system with a network of agents and touts sitting outside who will get work done for a fee. However, larger departments like urban property, land-records and revenue departments are more opaque and it is harder to find agents who can be trusted. This is a bigger challenge when the bribe/'fee' amount can run into lakhs. How do you navigate the process and find 'agents'?",
    "light_cleaned_comments": "Won't tell Real ID se aao, CBI! CBI cares for the little fish? No need to talk to agents, just talk to the concerned officials I just renewed my Driver's License online in Kerala on Parivahan website and got my new DL by speed post in 10 days after uploading all my documents. I paid about ₹500 as fees. I didn't had to visit any RTO office. Parivahan website could be better but it was functional when I tried. I could track the step by step like document scrutiny, approval, printing, mailing etc Real ID se aao, whatever anti-corruption official you may be! This is the way OP. Indian bureaucracy is tedious and laborious, but you should try to directly approach the office. It can take time & a lot of patience. It may take a few months. If you are employed, you may be fired. But dont worry about that too much. Once you know how to handle the system you can help others navigate the process for a fee. Do you have any experience with such matters? SBI? I had a similar experience in 2018. A *Change of Address* was achieved. There was a small technical issue at the RTO though but zero involvement of any unauthorized touts/agents. Kerala is an outlier in most of these cases. CBI is a codeword for saffron recruitment process. Yes, I have"
}