{
    "id": "14g1343",
    "title": "50 Days of internet shutdown in Manipur | Internet Freedom Foundation's Statement.",
    "url": "https://www.reddit.com/r/india/comments/14g1343/50_days_of_internet_shutdown_in_manipur_internet/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/gguffx9h2k7b1.png?width=1600&format=png&auto=webp&v=enabled&s=6fb9dba14266ef95525443b6384fee8b68b86ef3\n\n \n\n**June 22, 2023** \n\nToday marks the 50th day of Manipur's ongoing state-wide internet shutdown, which began on May 3, 2023. Internet Freedom Foundation (IFF) is deeply troubled by the indefinite character that the Manipur shutdown has acquired. Initially, only mobile data services were suspended, however, since the second day of the shutdown, it has been extended to a blanket suspension of all internet services. The ongoing internet suspension is being enforced through templatised orders issued every five days. This is contrary to the Supreme Court of India's (SC) ruling in *Anuradha Bhasin v. Union of India*, which prohibits indefinite suspension of internet services.\n\nFurther, [news reports](https://thewire.in/law/sedition-case-against-manipur-politician-who-blamed-assam-rifles) indicate that an FIR has been registered for the offence of sedition under Section 124-A of the Indian Penal Code, 1860 (IPC). Reportedly, the Chief Secretary of Manipur previously [warned](https://www.ndtv.com/india-news/sedition-not-ruled-out-for-spreading-fake-news-misinformation-on-manipur-4077017) that individuals spreading \"fake news, lies, rumours, or misinformation\" will be charged with sedition. This is despite the SC’s interim order dated  May 11, 2022, in *S.G. Vombatkere v. Union of India*, which put the operation of S.124-A of the IPC in abeyance. In its order, the SC specifically directed the State and Union Governments to refrain from registering FIRs, conducting investigations, or taking any other coercive measures under S. 124-A.\n\n[News reports](https://www.hindustantimes.com/india-news/itlf-twitter-block-manipur-violence-tribal-group-101687055287117.html) also suggest that Twitter accounts are being censored and withheld in India, ‘under a legal demand’. However, public authorities have not released any such legal orders or demands, depriving individuals of knowledge regarding the reasons for censorship and the opportunity to legally challenge it. Secrecy in online censorship and bans, which is a continuing administrative practice, undermines the individual’s fundamental right to expression and the collective fundamental right to receive information.\n\nIFF is deeply perturbed by these egregious violations of fundamental rights - the ongoing censorship of online content as well as the alarming non-compliance with the Supreme Court’s rulings in *Anuradha Bhasin v. Union of India* and the interim order in *S.G. Vombatkere v. Union of India*. We will be sending representations to the appropriate public authorities, in continuation with our consistent efforts to raise awareness about the grave threats posed to the digital rights of over 2.7 million residents of Manipur.\n\n*For press queries, please contact Prateek Waghre at* [*media@internetfreedom.in*](mailto:media@internetfreedom.in)*.*",
    "flair": "Policy/Economy",
    "score": 217,
    "num_comments": 10,
    "created_utc": 1687433701.0,
    "convurl": "https://external-preview.redd.it/nwsuRos-jOxI074ObsO3RYZyOZIzR_WMvkf2rWYsv_w.jpg?auto=webp&v=enabled&s=ca8d9d74a48e59416a2f1d35feedf48b241fbb55",
    "comments": [
        "Government doesn't give shit about internet freedom, there was halt on the internet in J&K for more than 250 days during covid times it was also under BJP rule.",
        "Of all the major issues in Manipur rn this really flew under the radar for me. I can’t fathom how much information is being censored through this blanket ban. It would have become increasingly difficult for the people stuck there to air their grievances when not having access to the internet.\n\n\n\nBut this has now become the norm. It’s unacceptable through and through",
        "Kisine pehle ek post pe comment Kiya tha ki bas 3 din ke internet band Kiya hai waha pe , sab log uspe toot pade ki bas 3 din kyu kiya aur karna tha , ab jab 50 din ke liye kar diya to sab bolrahe ki itne din ke liye kyu kiya.... Waah",
        "This Whole \"Fighting Against Injustice\" is very cherypicked Lmao.\nUs humans are very weird creatures",
        "How would you control the spread of misinformation without the internet shutdown? Imagine how many lives will be lost if the internet is kept running in such a situation. All the rioters will use internet to organise the riots and attacks much more efficiently. Internet shutdown, while sad, is unfortunately a necessary evil. Many groups can also post fake videos and make them viral to create fear and anger. We also have to be practical in these situations.",
        "Internet censorship is basically allowing both methis and Kukis conduct a \"purge\" style FFA, with no one outside of Manipur knowing what's really going on, then all combatants can do just about anything under the sun. \n\n\nThis is basically a tactic from the Gujarat riot playbook.",
        "Meanwhile, in the US .....",
        "Reminds me of how they shut down the internet in Kashmir. Similar tactics."
    ],
    "cleaned_text": "days internet shutdown manipur internet freedom foundations statement xb june today marks th day manipurs ongoing statewide internet shutdown began may internet freedom foundation iff deeply troubled indefinite character manipur shutdown acquired initially mobile data services suspended however since second day shutdown extended blanket suspension internet services ongoing internet suspension enforced templatised orders issued every five days contrary supreme court indias sc ruling anuradha bhasin v union india prohibits indefinite suspension internet services news reportshttpsthewireinlawseditioncaseagainstmanipurpoliticianwhoblamedassamrifles indicate fir registered offence sedition section indian penal code ipc reportedly chief secretary manipur previously warnedhttpswwwndtvcomindianewsseditionnotruledoutforspreadingfakenewsmisinformationonmanipur individuals spreading fake news lies rumours misinformation charged sedition despite scs interim order dated may sg vombatkere v union india put operation sa ipc abeyance order sc specifically directed state union governments refrain registering firs conducting investigations taking coercive measures news reportshttpswwwhindustantimescomindianewsitlftwitterblockmanipurviolencetribalgrouphtml also suggest twitter accounts censored withheld india legal demand however public authorities released legal orders demands depriving individuals knowledge regarding reasons censorship opportunity legally challenge secrecy online censorship bans continuing administrative practice undermines individuals fundamental right expression collective fundamental right receive information iff deeply perturbed egregious violations fundamental rights ongoing censorship online content well alarming noncompliance supreme courts rulings anuradha bhasin v union india interim order sg vombatkere v union india sending representations appropriate public authorities continuation consistent efforts raise awareness grave threats posed digital rights million residents manipur press queries please contact prateek waghre mediainternetfreedominmailtomediainternetfreedomin ",
    "cleaned_title": "days internet shutdown manipur internet freedom foundations statement",
    "cleaned_selftext": "xb june today marks th day manipurs ongoing statewide internet shutdown began may internet freedom foundation iff deeply troubled indefinite character manipur shutdown acquired initially mobile data services suspended however since second day shutdown extended blanket suspension internet services ongoing internet suspension enforced templatised orders issued every five days contrary supreme court indias sc ruling anuradha bhasin v union india prohibits indefinite suspension internet services news reportshttpsthewireinlawseditioncaseagainstmanipurpoliticianwhoblamedassamrifles indicate fir registered offence sedition section indian penal code ipc reportedly chief secretary manipur previously warnedhttpswwwndtvcomindianewsseditionnotruledoutforspreadingfakenewsmisinformationonmanipur individuals spreading fake news lies rumours misinformation charged sedition despite scs interim order dated may sg vombatkere v union india put operation sa ipc abeyance order sc specifically directed state union governments refrain registering firs conducting investigations taking coercive measures news reportshttpswwwhindustantimescomindianewsitlftwitterblockmanipurviolencetribalgrouphtml also suggest twitter accounts censored withheld india legal demand however public authorities released legal orders demands depriving individuals knowledge regarding reasons censorship opportunity legally challenge secrecy online censorship bans continuing administrative practice undermines individuals fundamental right expression collective fundamental right receive information iff deeply perturbed egregious violations fundamental rights ongoing censorship online content well alarming noncompliance supreme courts rulings anuradha bhasin v union india interim order sg vombatkere v union india sending representations appropriate public authorities continuation consistent efforts raise awareness grave threats posed digital rights million residents manipur press queries please contact prateek waghre mediainternetfreedominmailtomediainternetfreedomin",
    "cleaned_comments": "government doesnt give shit internet freedom halt internet jk days covid times also bjp rule major issues manipur rn really flew radar cant fathom much information censored blanket ban would become increasingly difficult people stuck air grievances access internet become norm unacceptable kisine pehle ek post pe comment kiya tha ki bas din ke internet band kiya hai waha pe sab log uspe toot pade ki bas din kyu kiya aur karna tha ab jab din ke liye kar diya sab bolrahe ki itne din ke liye kyu kiya waah whole fighting injustice cherypicked lmao us humans weird creatures would control spread misinformation without internet shutdown imagine many lives lost internet kept running situation rioters use internet organise riots attacks much efficiently internet shutdown sad unfortunately necessary evil many groups also post fake videos make viral create fear anger also practical situations internet censorship basically allowing methis kukis conduct purge style ffa one outside manipur knowing whats really going combatants anything sun basically tactic gujarat riot playbook meanwhile us reminds shut internet kashmir similar tactics",
    "light_cleaned_title": "50 Days of internet shutdown in Manipur | Internet Freedom Foundation's Statement.",
    "light_cleaned_selftext": "&#x200B; **June 22, 2023** Today marks the 50th day of Manipur's ongoing state-wide internet shutdown, which began on May 3, 2023. Internet Freedom Foundation (IFF) is deeply troubled by the indefinite character that the Manipur shutdown has acquired. Initially, only mobile data services were suspended, however, since the second day of the shutdown, it has been extended to a blanket suspension of all internet services. The ongoing internet suspension is being enforced through templatised orders issued every five days. This is contrary to the Supreme Court of India's (SC) ruling in *Anuradha Bhasin v. Union of India*, which prohibits indefinite suspension of internet services. Further, [news reports](https://thewire.in/law/sedition-case-against-manipur-politician-who-blamed-assam-rifles) indicate that an FIR has been registered for the offence of sedition under Section 124-A of the Indian Penal Code, 1860 (IPC). Reportedly, the Chief Secretary of Manipur previously [warned](https://www.ndtv.com/india-news/sedition-not-ruled-out-for-spreading-fake-news-misinformation-on-manipur-4077017) that individuals spreading \"fake news, lies, rumours, or misinformation\" will be charged with sedition. This is despite the SC’s interim order dated May 11, 2022, in *S.G. Vombatkere v. Union of India*, which put the operation of S.124-A of the IPC in abeyance. In its order, the SC specifically directed the State and Union Governments to refrain from registering FIRs, conducting investigations, or taking any other coercive measures under S. 124-A. [News reports](https://www.hindustantimes.com/india-news/itlf-twitter-block-manipur-violence-tribal-group-101687055287117.html) also suggest that Twitter accounts are being censored and withheld in India, ‘under a legal demand’. However, public authorities have not released any such legal orders or demands, depriving individuals of knowledge regarding the reasons for censorship and the opportunity to legally challenge it. Secrecy in online censorship and bans, which is a continuing administrative practice, undermines the individual’s fundamental right to expression and the collective fundamental right to receive information. IFF is deeply perturbed by these egregious violations of fundamental rights - the ongoing censorship of online content as well as the alarming non-compliance with the Supreme Court’s rulings in *Anuradha Bhasin v. Union of India* and the interim order in *S.G. Vombatkere v. Union of India*. We will be sending representations to the appropriate public authorities, in continuation with our consistent efforts to raise awareness about the grave threats posed to the digital rights of over 2.7 million residents of Manipur. *For press queries, please contact Prateek Waghre at* [*media@internetfreedom.in*](mailto:media@internetfreedom.in)*.*",
    "light_cleaned_comments": "Government doesn't give shit about internet freedom, there was halt on the internet in J&K for more than 250 days during covid times it was also under BJP rule. Of all the major issues in Manipur rn this really flew under the radar for me. I can’t fathom how much information is being censored through this blanket ban. It would have become increasingly difficult for the people stuck there to air their grievances when not having access to the internet. But this has now become the norm. It’s unacceptable through and through Kisine pehle ek post pe comment Kiya tha ki bas 3 din ke internet band Kiya hai waha pe , sab log uspe toot pade ki bas 3 din kyu kiya aur karna tha , ab jab 50 din ke liye kar diya to sab bolrahe ki itne din ke liye kyu kiya.... Waah This Whole \"Fighting Against Injustice\" is very cherypicked Lmao. Us humans are very weird creatures How would you control the spread of misinformation without the internet shutdown? Imagine how many lives will be lost if the internet is kept running in such a situation. All the rioters will use internet to organise the riots and attacks much more efficiently. Internet shutdown, while sad, is unfortunately a necessary evil. Many groups can also post fake videos and make them viral to create fear and anger. We also have to be practical in these situations. Internet censorship is basically allowing both methis and Kukis conduct a \"purge\" style FFA, with no one outside of Manipur knowing what's really going on, then all combatants can do just about anything under the sun. This is basically a tactic from the Gujarat riot playbook. Meanwhile, in the US ..... Reminds me of how they shut down the internet in Kashmir. Similar tactics."
}