{
    "id": "1bf35l8",
    "title": "Electoral Bonds Data: Out of Top 30 Donors, 14 Were Raided by Probe Agencies",
    "url": "https://www.thequint.com/news/politics/electoral-bonds-donors-raided-by-investigative-agencies-cbi-ed-income-tax-bjp-tmc",
    "selftext": "Data released by the ECI reveals action by ED, CBI, and IT officials on at least 14 out of top 30 donor companies.",
    "flair": "Law & Courts",
    "score": 106,
    "num_comments": 5,
    "created_utc": 1710469266.0,
    "convurl": "https://external-preview.redd.it/G7Q5GRKJZXtucfiEJZ3R26ALnvQGGMHWvx3qj_6Rk60.jpg?auto=webp&s=d6f154c0354b8099fa6430b15b1a3310da2342c1",
    "comments": [
        "At least 14 out of the top 30 companies which purchased electoral bonds from 12 April 2019 to 24 January 2024 faced action by central or state probe agencies, revealed data from the State Bank of India released by the Election Commission (EC).\n\nDetails of these companies are mentioned below:\n\nFuture Gaming and Hotel Services: The firm donated Rs 1368 crore between 27 October 2020 and 5 October 2023.  In 2022, Enforcement Directorate (ED) attached assets of the company and its various sub-distributors worth over Rs 409 crore in a money laundering case.\n\nMegha Engineering and Infrastructure Limited: In October 2019, the Income Tax department carried out raids at multiple offices of Telugu tycoon Krishna Reddy’s Megha Engineering Infrastructure Limited (MEIL) in Hyderabad and other cities. Since then, the company has donated Rs 966 crore in electoral bonds.\n\nHaldia Energy Limited: The firm donated Rs 377 crore in electoral bonds. It faced action by the Central Bureau of Investigation in March 2020.\n\nVedanta Limited: A Vedanta Group company Talwandi Sabo Power Ltd (TSPL) was raided by the ED in connection with a money laundering probe in August 2022. The group has collectively donated Rs 400 crore in electoral bonds.\n\nYashoda Super Speciality Hospital: The Hyderabad-based corporate hospital chain was raided by Income Tax (IT) officials in December 2020. It donated Rs 162 crore in electoral bonds in October 2021.\n\nDLF Commercial Developers Limited: The realty developer company donated Rs 130 crore in electoral bonds. It was raided by CBI officials in January 2019 over alleged irregularities in allocation of land. Again, in November 2023, the ED searched its Gurugram offices in connection with an investigation against real estate firm Supertech.\n\nJindal Steel and Power Limited: In April 2022, ED searched premises of JSPL in connection with a probe linked to alleged violation of foreign exchange regulations. The company donated a total of Rs 123 crore in electoral bonds.\n\nChennai Greenwoods Private Limited: Construction firm Chennai Greenwoods Private Limited was raided by Income Tax officials in July 2021. In January 2022, it donated Rs 105 crore in electoral bonds.\n\nDr Reddy's Laboratories Limited: In November 2023, IT officials conducted raids on Dr K Nagender Reddy of Dr Reddy's Laboratories over allegations of tax evasion. This was part of a larger operation involving searches at premises of Telangana Education Minister Sabitha Indra Reddy. Dr Reddy's Laboratories had till then made donations worth Rs 80 crore in electoral bonds.\n\nIFB Agro Limited: In June 2020, IFB Agro, one of India’s biggest distiller and spirit-makers, alleged that the Kolkata Zonal Unit of the Directorate General of Goods and Services Tax Intelligences (DGGST) raided the company's Noorpur plant. In 2023, a senior company executive claimed that it donated Rs 40 crore in electoral bonds 'as per our instructions from the government.' As per data released by the EC, IBF Agro has donated a total of Rs 92 crore in electoral bonds. The company was in the eye of a storm when its Noorpur plant was attacked in 2020. The then West Bengal governor Jagdeep Dhankhar had stepped in and told the TMC government to create a conducive climate for investment in the state.\n\nNCC Limited: The Hyderabad-based firm has donated Rs 60 crore in electoral bonds. The Income Tax department had conducted raids on the company in November 2022 over allegations of tax evasion.\n\nDivi S Laboratory Limited: Hyderabad-based Divi's Laboratory faced IT Action in February 2019. The company has since donated Rs 55 crore in electoral bonds.\n\nUnited Phosphorus India Limited: The IT department conducted raids at offices and premises of UPL in January 2020. The company has donated Rs 50 crore in electoral bonds.\n\nAurobindo Pharma: The Enforcement Directorate, in November 2022, arrested Sarath Reddy, Director of Aurobindo Pharma in connection with a money laundering probe related to the alleged Delhi liquor policy scam. The firm had previously donated Rs 1.6 crore in electoral bonds.",
        "Truly a Hafta wasooli system in 90's one had the Underwold Don's doing the same shady shit   nd now we've  got Modiji nd Motabhai  .Bc koi farak  nahin hein",
        "Donate hundreds and thousands of crores to stop all legal actions against you. Ye hai Modiji ki guarantee.",
        "https://preview.redd.it/01xvnnoxbgoc1.jpeg?width=680&format=pjpg&auto=webp&s=c5bd31547378c3572a9a80c2719c3bdb8cedb720",
        "There was the licence raj before that.\n\nPoint is , the format changes, the crime stays the same"
    ],
    "cleaned_text": "electoral bonds data top donors raided probe agencies data released eci reveals action ed cbi officials least top donor companies ",
    "cleaned_title": "electoral bonds data top donors raided probe agencies",
    "cleaned_selftext": "data released eci reveals action ed cbi officials least top donor companies",
    "cleaned_comments": "least top companies purchased electoral bonds april january faced action central state probe agencies revealed data state bank india released election commission ec details companies mentioned future gaming hotel services firm donated rs crore october october enforcement directorate ed attached assets company various subdistributors worth rs crore money laundering case megha engineering infrastructure limited october income tax department carried raids multiple offices telugu tycoon krishna reddys megha engineering infrastructure limited meil hyderabad cities since company donated rs crore electoral bonds haldia energy limited firm donated rs crore electoral bonds faced action central bureau investigation march vedanta limited vedanta group company talwandi sabo power ltd tspl raided ed connection money laundering probe august group collectively donated rs crore electoral bonds yashoda super speciality hospital hyderabadbased corporate hospital chain raided income tax officials december donated rs crore electoral bonds october dlf commercial developers limited realty developer company donated rs crore electoral bonds raided cbi officials january alleged irregularities allocation land november ed searched gurugram offices connection investigation real estate firm supertech jindal steel power limited april ed searched premises jspl connection probe linked alleged violation foreign exchange regulations company donated total rs crore electoral bonds chennai greenwoods private limited construction firm chennai greenwoods private limited raided income tax officials july january donated rs crore electoral bonds dr reddys laboratories limited november officials conducted raids dr k nagender reddy dr reddys laboratories allegations tax evasion part larger operation involving searches premises telangana education minister sabitha indra reddy dr reddys laboratories till made donations worth rs crore electoral bonds ifb agro limited june ifb agro one indias biggest distiller spiritmakers alleged kolkata zonal unit directorate general goods services tax intelligences dggst raided companys noorpur plant senior company executive claimed donated rs crore electoral bonds per instructions government per data released ec ibf agro donated total rs crore electoral bonds company eye storm noorpur plant attacked west bengal governor jagdeep dhankhar stepped told tmc government create conducive climate investment state ncc limited hyderabadbased firm donated rs crore electoral bonds income tax department conducted raids company november allegations tax evasion divi laboratory limited hyderabadbased divis laboratory faced action february company since donated rs crore electoral bonds united phosphorus india limited department conducted raids offices premises upl january company donated rs crore electoral bonds aurobindo pharma enforcement directorate november arrested sarath reddy director aurobindo pharma connection money laundering probe related alleged delhi liquor policy scam firm previously donated rs crore electoral bonds truly hafta wasooli system one underwold dons shady shit nd weve got modiji nd motabhai bc koi farak nahin hein donate hundreds thousands crores stop legal actions ye hai modiji ki guarantee licence raj point format changes crime stays",
    "light_cleaned_title": "Electoral Bonds Data: Out of Top 30 Donors, 14 Were Raided by Probe Agencies",
    "light_cleaned_selftext": "Data released by the ECI reveals action by ED, CBI, and IT officials on at least 14 out of top 30 donor companies.",
    "light_cleaned_comments": "At least 14 out of the top 30 companies which purchased electoral bonds from 12 April 2019 to 24 January 2024 faced action by central or state probe agencies, revealed data from the State Bank of India released by the Election Commission (EC). Details of these companies are mentioned below: Future Gaming and Hotel Services: The firm donated Rs 1368 crore between 27 October 2020 and 5 October 2023. In 2022, Enforcement Directorate (ED) attached assets of the company and its various sub-distributors worth over Rs 409 crore in a money laundering case. Megha Engineering and Infrastructure Limited: In October 2019, the Income Tax department carried out raids at multiple offices of Telugu tycoon Krishna Reddy’s Megha Engineering Infrastructure Limited (MEIL) in Hyderabad and other cities. Since then, the company has donated Rs 966 crore in electoral bonds. Haldia Energy Limited: The firm donated Rs 377 crore in electoral bonds. It faced action by the Central Bureau of Investigation in March 2020. Vedanta Limited: A Vedanta Group company Talwandi Sabo Power Ltd (TSPL) was raided by the ED in connection with a money laundering probe in August 2022. The group has collectively donated Rs 400 crore in electoral bonds. Yashoda Super Speciality Hospital: The Hyderabad-based corporate hospital chain was raided by Income Tax (IT) officials in December 2020. It donated Rs 162 crore in electoral bonds in October 2021. DLF Commercial Developers Limited: The realty developer company donated Rs 130 crore in electoral bonds. It was raided by CBI officials in January 2019 over alleged irregularities in allocation of land. Again, in November 2023, the ED searched its Gurugram offices in connection with an investigation against real estate firm Supertech. Jindal Steel and Power Limited: In April 2022, ED searched premises of JSPL in connection with a probe linked to alleged violation of foreign exchange regulations. The company donated a total of Rs 123 crore in electoral bonds. Chennai Greenwoods Private Limited: Construction firm Chennai Greenwoods Private Limited was raided by Income Tax officials in July 2021. In January 2022, it donated Rs 105 crore in electoral bonds. Dr Reddy's Laboratories Limited: In November 2023, IT officials conducted raids on Dr K Nagender Reddy of Dr Reddy's Laboratories over allegations of tax evasion. This was part of a larger operation involving searches at premises of Telangana Education Minister Sabitha Indra Reddy. Dr Reddy's Laboratories had till then made donations worth Rs 80 crore in electoral bonds. IFB Agro Limited: In June 2020, IFB Agro, one of India’s biggest distiller and spirit-makers, alleged that the Kolkata Zonal Unit of the Directorate General of Goods and Services Tax Intelligences (DGGST) raided the company's Noorpur plant. In 2023, a senior company executive claimed that it donated Rs 40 crore in electoral bonds 'as per our instructions from the government.' As per data released by the EC, IBF Agro has donated a total of Rs 92 crore in electoral bonds. The company was in the eye of a storm when its Noorpur plant was attacked in 2020. The then West Bengal governor Jagdeep Dhankhar had stepped in and told the TMC government to create a conducive climate for investment in the state. NCC Limited: The Hyderabad-based firm has donated Rs 60 crore in electoral bonds. The Income Tax department had conducted raids on the company in November 2022 over allegations of tax evasion. Divi S Laboratory Limited: Hyderabad-based Divi's Laboratory faced IT Action in February 2019. The company has since donated Rs 55 crore in electoral bonds. United Phosphorus India Limited: The IT department conducted raids at offices and premises of UPL in January 2020. The company has donated Rs 50 crore in electoral bonds. Aurobindo Pharma: The Enforcement Directorate, in November 2022, arrested Sarath Reddy, Director of Aurobindo Pharma in connection with a money laundering probe related to the alleged Delhi liquor policy scam. The firm had previously donated Rs 1.6 crore in electoral bonds. Truly a Hafta wasooli system in 90's one had the Underwold Don's doing the same shady shit nd now we've got Modiji nd Motabhai .Bc koi farak nahin hein Donate hundreds and thousands of crores to stop all legal actions against you. Ye hai Modiji ki guarantee. There was the licence raj before that. Point is , the format changes, the crime stays the same"
}