{
    "id": "udmhvm",
    "title": "DO NOT ORDER from chennai based company TAKK",
    "url": "https://www.reddit.com/r/india/comments/udmhvm/do_not_order_from_chennai_based_company_takk/",
    "selftext": "Do not buy any smart furnitures from TAKK. They have been acting shady and not giving any proper updates. They have gone so deep in the abyss of fraudulence that they have accused Blue Dart of damaging the material even before the material was received for dispatch.\n\n22nd March - Delay of 10 days due to painting and drying.\n\n29th March - Commitment given as 3rd April for dispatch \n\n4th April - 2nd delay due to same issue. Date given as 12th April for dispatch \n\n11th April - 3rd delay due to same issue. Reason given as Steel quality \n\n12th April - Mr. Harish confirmed that the material will be dispatched by weekend i.e. 18th (4th Delay)\n\n18th April - Holiday and false commitment given.  \n\n23rd April - Shipment booked but not dispatched (Blue Dart ground team has confirmed)\n\n25th April - Same issue as before. Commitment given as 26th (5th delay)26th April - Same issue as before. Commitment given as 27th (6th delay)\n\n&amp;#x200B;\n\nI have been chasing them since 3rd April to get a proper dispatch date. Every time it is a new story of how war has caused the steel quality to drop, paints not being available. They have been lying through their teeth. They even REFUSE to return the money stating that it was a pre-order and it cannot be cancelled.\n\n&amp;#x200B;\n\nPlease help a stranger out and report these MFs so that others dont go through the same pain that I did.\n\n&amp;#x200B;\n\nI am from Hyderabad so it is difficult to even go and check if they are actually doing something about it or if they are a real company\n\nKind strangers of r/india please post these images if possible and block them so that they dont take down the post.\n\n&amp;#x200B;\n\n[https://www.instagram.com/takk.in/](https://www.instagram.com/takk.in/)\n\nhttps://preview.redd.it/aiwk8ugi37w81.jpg?width=576&amp;format=pjpg&amp;auto=webp&amp;s=d00546832c2c3511577506bdecb78d61cc265e34\n\nhttps://preview.redd.it/091pe6hi37w81.jpg?width=918&amp;format=pjpg&amp;auto=webp&amp;s=3786e69beb217a2713bd7cdbe30491a5dcbd90fe\n\nhttps://preview.redd.it/r6svanxy27w81.jpg?width=576&amp;format=pjpg&amp;auto=webp&amp;s=6aded25cbd3f78e130a4492d2def9504910c79bb",
    "flair": "Rant / Vent",
    "score": 53,
    "num_comments": 23,
    "created_utc": 1651119285,
    "convurl": "https://b.thumbs.redditmedia.com/yNxYL6sIgegrHoXJIksWbpXehxdUvNLQSHKV2KaRHxQ.jpg",
    "comments": [
        "I have also ordered from Takk, I received my table after a protracted delay.  I was quite happy with the table and recommended it to my friends. Based on my recommendation /u/bobrath also purchased one and his table is pending for FOUR months. He's contemplating legal action. \n\nTakk is a fuck all comany.",
        "You from Hyd, Why not Ikea, they have a big ass store in Hyd.",
        "**TAKK is best avoided. My order was delayed for over 4 months and is still not fully dispatched. They also refuse to cancel orders and refund your money.**\n\nThey are nothing short of crooks in my opinion. They know full well that they cannot fulfill in any reasonable timelines, yet they promise dispatch of orders (not just within India, but internationally) within 20 to 25 days of placing the order.\n\nThey take your money in the beginning and then refuse to refund it and keep on delaying the order until they can dispatch it at their convenience.\n\nI too have waited for over 4 months for a table, a monitor mount bar and drawers. In this time, I could have learned how to make a table and made it for myself.\n\nI have a similar horrible experience with them.\n\nI ordered a table, monitor mount bar and drawer from them in January 2022. Do note that this company promises dispatch of your orders within 20 to 25 days of placing your order according to their shipping policy.\n\nThere was no sign of my order for over a month. So, I started following up with their whatsapp customer service number on my order. They said the order is delayed we will dispatch by 8th March.\n\nI said cool, I understand, orders get delayed sometimes. But there was no sign of my order well into March. So I followed up again. I was told my order will be dispatched on 20 March.\n\n20 March - I was told we will dispatch your order on 30 March.\n\n30 March - We will dispatch your order next week.\n\n5 April - By this time, its almost been 4 months since my order has been pending - I followed up with them - they said next week.\n\n6 April - I informed them that I don't want the order anymore because of the excessive delay and they can cancel my order and give me my money back.\n\n7 April - these guys had the audacity to tell me over email that they cannot give me a refund and they will dispatch my order the following week.\n\n15 April - Predictably, my order was not dispatched. I followed up and wrote emails asking for a cancellation and refund. The emails I got in response from their customer support team were astoundingly tone deaf and stupid. Typical cut copy paste responses of sir we apologize and we will dispatch by next week.\n\n16 April - 18 April - I started calling the number and demanding a refund and cancellation. Customer support team told me they are not authorized to cancel orders and issue refunds. I demanded that I speak with someone who has the authorization - they said no-one is available. They had the sheer gall to tell me a bald faced lie that no-one was available at 3 pm on a Monday!!\n\nA call back was arranged on 20 April from one of their managers - who told me that my order will be sent on Monday (25 April). If it was not dispatched they will issue a refund.\n\nPredictably, my order was not dispatched on 25 April. I called and emailed - demanding for cancellation and refund and indicated that if this was not done within the week, I will initiate legal action.\n\nThe customer support team yet again simply ignored my request for refund and stated that they will escalate my issue.\n\nYesterday (27 April) I was informed that they have shipped only one part of my order - the table. The remainder is to be allegedly shipped next week.\n\nI asked them to cancel the rest of my order and issue a refund - yet again they refused to issue a refund and stated that it will be shipped next week.\n\nIf they do not ship the rest of my order by next week, I will initiate all possible legal action - including a police complaint.\n\nIt is clear that either these guys are totally incompetent or are incredibly malicious - they know they can't meet the promised timelines, but they take your money anyway and hold on to your order until they can, lazily, send it at their own pace. Clearly this is an issue faced my many of their customers - which is why they have no social media presence except for an Instagram account on which comments are disabled.\n\n**tldr - TAKK are liars and cheats. Do not shop from TAKK. Shop TAKK only if you don't value your time.**",
        "Rule of thumb - always use credit cards for payments with unknown vendors and raise a dispute in case of issues",
        "Lulz",
        "File a consumer complaint. \n\nWrite  to the company first to refund it or else you will seek appropriate legal action. (This is important) \n\nThen file a complaint for refund + mental agony.",
        "Upvoting and commenting for visibility.",
        "I had ordered the Berlin 59 table and 3 smart add ons from them sometime in 2019, took a total of about 10 months for them to deliver the order. Mind you, this was after me constantly chasing them around and taking updates. I had to go to the extent of threatening of a police complaint and had a verbal altercation with their manager. I am sure I had not done this I would have not even received the table ever. After 9 months when I received the table, the UV light in the drawer was not functioning.The quality and finish of the table where no way near what they advertised and the price they charge too with scratches and indents in the table's surface.After 1 month of using the table, the power supply unit in the back side of the table stopped functioning too and the whole of the backside of the table which was for making wiring easier was useless. On top of all this the 3 add ons I had ordered along with the table were missing in the package. After another 3 months or so of chasing I received the add ons (monitor mount bar, printer bracket and CPU bracket). Again, the finish of these were not up to the mark in any way. Although the brackets were still manageable, the monitor bar was a completely different colour than advertised and did not even match the color of the table and it looked extremely ugly. When I tried to install the monitor bar, the monitor bar did not even line up with the installation holes on the table and the screws they sent to secure the monitor bar were the wrong size too. I had to call a carpenter specially and he had to drill the monitor bar to the table. After spending roughly 45k total just for a table, I was completely unsatisfied and extremely fed up. I tried contacting for these issues throughout but was met with misleading answers and endless false promises. In the end, I was extremely fed up and irritated so I donated the table to a nearby blind school who needed it and got a custom desk built by a carpenter for just 8k and it is serving me extremely well. \n\n&amp;#x200B;\n\nTL;DR : Do not buy from TAKK, extremely shady and trash company. Received extremely low quality table after 9 months of order and the table was faulty. Some parts were still missing upon receiving when received after 3 months of further chasing, they were incorrect too upon receiving.",
        "To raise dispute do you contact the bank or the card company?",
        "Super useful and helpful info. I am in the market for a table and was considering TAKK, but definitely not anymore.",
        "The credit card company.",
        "Try to make a YouTube video if possible along side this with just these infos, people would get it from Google at times.",
        "I hope you’re aware, there is a global supply chain problem that is only made worse by sanctions which causes further inflation. So shipping can be easily delayed and shipping containers currently cost 4-5x normal rates",
        "Dude, Their reasons have been inane and banal at this point. If you are unable to get the product done on time, at least give the money back. They have even refused to give the money back citing \"pre-order\"",
        "They mostly avail their service from Instagram"
    ],
    "cleaned_text": "order chennai based company takk buy smart furnitures takk acting shady giving proper updates gone deep abyss fraudulence accused blue dart damaging material even material received dispatch nd march delay days due painting drying th march commitment given rd april dispatch th april nd delay due issue date given th april dispatch th april rd delay due issue reason given steel quality th april mr harish confirmed material dispatched weekend ie th th delay th april holiday false commitment given rd april shipment booked dispatched blue dart ground team confirmed th april issue commitment given th th delayth april issue commitment given th th delay ampxb chasing since rd april get proper dispatch date every time new story war caused steel quality drop paints available lying teeth even refuse return money stating preorder cancelled ampxb please help stranger report mfs others dont go pain ampxb hyderabad difficult even go check actually something real company kind strangers rindia please post images possible block dont take post ampxb httpswwwinstagramcomtakkinhttpswwwinstagramcomtakkin ",
    "cleaned_title": "order chennai based company takk",
    "cleaned_selftext": "buy smart furnitures takk acting shady giving proper updates gone deep abyss fraudulence accused blue dart damaging material even material received dispatch nd march delay days due painting drying th march commitment given rd april dispatch th april nd delay due issue date given th april dispatch th april rd delay due issue reason given steel quality th april mr harish confirmed material dispatched weekend ie th th delay th april holiday false commitment given rd april shipment booked dispatched blue dart ground team confirmed th april issue commitment given th th delayth april issue commitment given th th delay ampxb chasing since rd april get proper dispatch date every time new story war caused steel quality drop paints available lying teeth even refuse return money stating preorder cancelled ampxb please help stranger report mfs others dont go pain ampxb hyderabad difficult even go check actually something real company kind strangers rindia please post images possible block dont take post ampxb httpswwwinstagramcomtakkinhttpswwwinstagramcomtakkin",
    "cleaned_comments": "also ordered takk received table protracted delay quite happy table recommended friends based recommendation ubobrath also purchased one table pending four months hes contemplating legal action takk fuck comany hyd ikea big ass store hyd takk best avoided order delayed months still fully dispatched also refuse cancel orders refund money nothing short crooks opinion know full well fulfill reasonable timelines yet promise dispatch orders within india internationally within days placing order take money beginning refuse refund keep delaying order dispatch convenience waited months table monitor mount bar drawers time could learned make table made similar horrible experience ordered table monitor mount bar drawer january note company promises dispatch orders within days placing order according shipping policy sign order month started following whatsapp customer service number order said order delayed dispatch th march said cool understand orders get delayed sometimes sign order well march followed told order dispatched march march told dispatch order march march dispatch order next week april time almost months since order pending followed said next week april informed dont want order anymore excessive delay cancel order give money back april guys audacity tell email give refund dispatch order following week april predictably order dispatched followed wrote emails asking cancellation refund emails got response customer support team astoundingly tone deaf stupid typical cut copy paste responses sir apologize dispatch next week april april started calling number demanding refund cancellation customer support team told authorized cancel orders issue refunds demanded speak someone authorization said noone available sheer gall tell bald faced lie noone available pm monday call back arranged april one managers told order sent monday april dispatched issue refund predictably order dispatched april called emailed demanding cancellation refund indicated done within week initiate legal action customer support team yet simply ignored request refund stated escalate issue yesterday april informed shipped one part order table remainder allegedly shipped next week asked cancel rest order issue refund yet refused issue refund stated shipped next week ship rest order next week initiate possible legal action including police complaint clear either guys totally incompetent incredibly malicious know cant meet promised timelines take money anyway hold order lazily send pace clearly issue faced many customers social media presence except instagram account comments disabled tldr takk liars cheats shop takk shop takk dont value time rule thumb always use credit cards payments unknown vendors raise dispute case issues lulz file consumer complaint write company first refund else seek appropriate legal action important file complaint refund mental agony upvoting commenting visibility ordered berlin table smart add ons sometime took total months deliver order mind constantly chasing around taking updates go extent threatening police complaint verbal altercation manager sure done would even received table ever months received table uv light drawer functioningthe quality finish table way near advertised price charge scratches indents tables surfaceafter month using table power supply unit back side table stopped functioning whole backside table making wiring easier useless top add ons ordered along table missing package another months chasing received add ons monitor mount bar printer bracket cpu bracket finish mark way although brackets still manageable monitor bar completely different colour advertised even match color table looked extremely ugly tried install monitor bar monitor bar even line installation holes table screws sent secure monitor bar wrong size call carpenter specially drill monitor bar table spending roughly k total table completely unsatisfied extremely fed tried contacting issues throughout met misleading answers endless false promises end extremely fed irritated donated table nearby blind school needed got custom desk built carpenter k serving extremely well ampxb tldr buy takk extremely shady trash company received extremely low quality table months order table faulty parts still missing upon receiving received months chasing incorrect upon receiving raise dispute contact bank card company super useful helpful info market table considering takk definitely anymore credit card company try make youtube video possible along side infos people would get google times hope youre aware global supply chain problem made worse sanctions causes inflation shipping easily delayed shipping containers currently cost x normal rates dude reasons inane banal point unable get product done time least give money back even refused give money back citing preorder mostly avail service instagram",
    "light_cleaned_title": "DO NOT ORDER from chennai based company TAKK",
    "light_cleaned_selftext": "Do not buy any smart furnitures from TAKK. They have been acting shady and not giving any proper updates. They have gone so deep in the abyss of fraudulence that they have accused Blue Dart of damaging the material even before the material was received for dispatch. 22nd March - Delay of 10 days due to painting and drying. 29th March - Commitment given as 3rd April for dispatch 4th April - 2nd delay due to same issue. Date given as 12th April for dispatch 11th April - 3rd delay due to same issue. Reason given as Steel quality 12th April - Mr. Harish confirmed that the material will be dispatched by weekend i.e. 18th (4th Delay) 18th April - Holiday and false commitment given. 23rd April - Shipment booked but not dispatched (Blue Dart ground team has confirmed) 25th April - Same issue as before. Commitment given as 26th (5th delay)26th April - Same issue as before. Commitment given as 27th (6th delay)  I have been chasing them since 3rd April to get a proper dispatch date. Every time it is a new story of how war has caused the steel quality to drop, paints not being available. They have been lying through their teeth. They even REFUSE to return the money stating that it was a pre-order and it cannot be cancelled.  Please help a stranger out and report these MFs so that others dont go through the same pain that I did.  I am from Hyderabad so it is difficult to even go and check if they are actually doing something about it or if they are a real company Kind strangers of r/india please post these images if possible and block them so that they dont take down the post.  [https://www.instagram.com/takk.in/](https://www.instagram.com/takk.in/)",
    "light_cleaned_comments": "I have also ordered from Takk, I received my table after a protracted delay. I was quite happy with the table and recommended it to my friends. Based on my recommendation /u/bobrath also purchased one and his table is pending for FOUR months. He's contemplating legal action. Takk is a fuck all comany. You from Hyd, Why not Ikea, they have a big ass store in Hyd. **TAKK is best avoided. My order was delayed for over 4 months and is still not fully dispatched. They also refuse to cancel orders and refund your money.** They are nothing short of crooks in my opinion. They know full well that they cannot fulfill in any reasonable timelines, yet they promise dispatch of orders (not just within India, but internationally) within 20 to 25 days of placing the order. They take your money in the beginning and then refuse to refund it and keep on delaying the order until they can dispatch it at their convenience. I too have waited for over 4 months for a table, a monitor mount bar and drawers. In this time, I could have learned how to make a table and made it for myself. I have a similar horrible experience with them. I ordered a table, monitor mount bar and drawer from them in January 2022. Do note that this company promises dispatch of your orders within 20 to 25 days of placing your order according to their shipping policy. There was no sign of my order for over a month. So, I started following up with their whatsapp customer service number on my order. They said the order is delayed we will dispatch by 8th March. I said cool, I understand, orders get delayed sometimes. But there was no sign of my order well into March. So I followed up again. I was told my order will be dispatched on 20 March. 20 March - I was told we will dispatch your order on 30 March. 30 March - We will dispatch your order next week. 5 April - By this time, its almost been 4 months since my order has been pending - I followed up with them - they said next week. 6 April - I informed them that I don't want the order anymore because of the excessive delay and they can cancel my order and give me my money back. 7 April - these guys had the audacity to tell me over email that they cannot give me a refund and they will dispatch my order the following week. 15 April - Predictably, my order was not dispatched. I followed up and wrote emails asking for a cancellation and refund. The emails I got in response from their customer support team were astoundingly tone deaf and stupid. Typical cut copy paste responses of sir we apologize and we will dispatch by next week. 16 April - 18 April - I started calling the number and demanding a refund and cancellation. Customer support team told me they are not authorized to cancel orders and issue refunds. I demanded that I speak with someone who has the authorization - they said no-one is available. They had the sheer gall to tell me a bald faced lie that no-one was available at 3 pm on a Monday!! A call back was arranged on 20 April from one of their managers - who told me that my order will be sent on Monday (25 April). If it was not dispatched they will issue a refund. Predictably, my order was not dispatched on 25 April. I called and emailed - demanding for cancellation and refund and indicated that if this was not done within the week, I will initiate legal action. The customer support team yet again simply ignored my request for refund and stated that they will escalate my issue. Yesterday (27 April) I was informed that they have shipped only one part of my order - the table. The remainder is to be allegedly shipped next week. I asked them to cancel the rest of my order and issue a refund - yet again they refused to issue a refund and stated that it will be shipped next week. If they do not ship the rest of my order by next week, I will initiate all possible legal action - including a police complaint. It is clear that either these guys are totally incompetent or are incredibly malicious - they know they can't meet the promised timelines, but they take your money anyway and hold on to your order until they can, lazily, send it at their own pace. Clearly this is an issue faced my many of their customers - which is why they have no social media presence except for an Instagram account on which comments are disabled. **tldr - TAKK are liars and cheats. Do not shop from TAKK. Shop TAKK only if you don't value your time.** Rule of thumb - always use credit cards for payments with unknown vendors and raise a dispute in case of issues Lulz File a consumer complaint. Write to the company first to refund it or else you will seek appropriate legal action. (This is important) Then file a complaint for refund + mental agony. Upvoting and commenting for visibility. I had ordered the Berlin 59 table and 3 smart add ons from them sometime in 2019, took a total of about 10 months for them to deliver the order. Mind you, this was after me constantly chasing them around and taking updates. I had to go to the extent of threatening of a police complaint and had a verbal altercation with their manager. I am sure I had not done this I would have not even received the table ever. After 9 months when I received the table, the UV light in the drawer was not functioning.The quality and finish of the table where no way near what they advertised and the price they charge too with scratches and indents in the table's surface.After 1 month of using the table, the power supply unit in the back side of the table stopped functioning too and the whole of the backside of the table which was for making wiring easier was useless. On top of all this the 3 add ons I had ordered along with the table were missing in the package. After another 3 months or so of chasing I received the add ons (monitor mount bar, printer bracket and CPU bracket). Again, the finish of these were not up to the mark in any way. Although the brackets were still manageable, the monitor bar was a completely different colour than advertised and did not even match the color of the table and it looked extremely ugly. When I tried to install the monitor bar, the monitor bar did not even line up with the installation holes on the table and the screws they sent to secure the monitor bar were the wrong size too. I had to call a carpenter specially and he had to drill the monitor bar to the table. After spending roughly 45k total just for a table, I was completely unsatisfied and extremely fed up. I tried contacting for these issues throughout but was met with misleading answers and endless false promises. In the end, I was extremely fed up and irritated so I donated the table to a nearby blind school who needed it and got a custom desk built by a carpenter for just 8k and it is serving me extremely well.  TL;DR : Do not buy from TAKK, extremely shady and trash company. Received extremely low quality table after 9 months of order and the table was faulty. Some parts were still missing upon receiving when received after 3 months of further chasing, they were incorrect too upon receiving. To raise dispute do you contact the bank or the card company? Super useful and helpful info. I am in the market for a table and was considering TAKK, but definitely not anymore. The credit card company. Try to make a YouTube video if possible along side this with just these infos, people would get it from Google at times. I hope you’re aware, there is a global supply chain problem that is only made worse by sanctions which causes further inflation. So shipping can be easily delayed and shipping containers currently cost 4-5x normal rates Dude, Their reasons have been inane and banal at this point. If you are unable to get the product done on time, at least give the money back. They have even refused to give the money back citing \"pre-order\" They mostly avail their service from Instagram"
}