{
    "id": "16p3wjw",
    "title": "Found a frog who was beaten by a heartless bastard. I have brought him home and my parents are taking care of him. Planning to take him to vet in the evening once i am back from office. I am feeding him water . Please suggest some food and medicine /ointment that can be applied to treat his injury.",
    "url": "https://www.reddit.com/r/india/comments/16p3wjw/found_a_frog_who_was_beaten_by_a_heartless/",
    "selftext": "This little frog was beaten up by a heartless bastard.\n\nI bought him home and have caged him to monitor and feed him.\n\nI am planning to take him to vet/hospital after my office hours. Meanwhile my parents are taking care of him. I asked them to give  him water to avoid dehydration\n\nhttps://preview.redd.it/0qm8cehxerpb1.jpg?width=1600&format=pjpg&auto=webp&s=e32e2dbbb910976198ec4be5965e3e9d80c8cc55\n\nhttps://preview.redd.it/b68l0hhxerpb1.jpg?width=901&format=pjpg&auto=webp&s=3addd79fcd2f077a4a08eda42d91bd11dc19f5f5\n\nPlease suggest any ointment/medicine i can feed him to relieve and heal his wounds.\n\nIn terms of food probably they rely on insects etc, i will try to find if i can get such packaged foods.\n\n&#x200B;",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695367837.0,
    "convurl": "https://b.thumbs.redditmedia.com/NadsCzbTqtQl8c627PPcTtmpsqJw7PtfwjcLM4bO3sI.jpg",
    "comments": [
        "Good job OP",
        "Don't know much about reptiles... But that gentleman is a cutie, \n\nP. S- op you are a legend, love you and we need more people to be like you instead of spreading hate 24/7.",
        "\"Found a heartless bastard killing insects to feed a frog. Planning to confront the guy & save insects by taking it to vet. Please suggest some food to feed the insects\"",
        "It's an amphibian*. Also looks like a toad and not a frog.",
        "Omg.... Tank you",
        "Contact blue cross, you can find their number online",
        " \n\n* 0) 98201 22602\n* \\+91 9920777536 (24 hours)\n* \\+91 9962998886 (WhatsApp emergency helpline)\n* 9820122602 (PETA India's emergency number)\n* 9167907382 (PETA India's alternative contact number)\n\n \n\n* Blue Cross of India: 044 46274999 and 044 71819575 \n* Animal Helpline: 09898019059 and 09898499954 \n* Ahimsa Research Foundation: + 91 (44) 327 7133\n* Animal Citizen: + 91 (44) 432 0528 \n* PETA India: (0) 98201 22602 \n* Wildlife Helpline: 8280 (Duty room), 8262 or 9262 (CSO), 4172/6172, 6419, 4169/6169 (Prakriti members) \n* Greater Chennai Corporation: 1913 \n* 1962 – Animal Mobile Medical Ambulance - EMRI: 1962 \n\n [https://www.frogeducation.com/contact](https://www.frogeducation.com/contact)\n\n&#x200B;\n\npick anyone of these last link is really helpful since its specific",
        "Name him Mr. Denmark",
        "Jeez, do people not have humour in them?",
        "M1 Abrahms on it's way",
        "Will go home and eat chicken tikka later.",
        "Leave that thing outside.",
        "Frr yk someone is really good when they care for stray animals (idk if frog is an animal) salute to op",
        "Let there be some good in the world",
        "It will recover itself easily bro.",
        "You are an incredible human being. Thank you for existing.",
        "I dont think so that “it will recover easily” a single mild hit from any human can do some real damage so such a small creature and why do you care op is being so nice cuz ive never seen a single person helping so small creatures. My guy appreciate good people so they are encouraged to do more you dont know what a bad world (worse than current) would be like",
        "Can't belive that I find this froggo cute now 🐸",
        "Look up some Jain community around you with a dispensary. I had a pet chick which one day suddenly got very sick and thin (it was my fault, I didn't arrange for proper cooling and water and left it alone in room for 7-8 hours in summer). I took it to a couple vets and both said that it's a lost cause and to let it die. Then I took it to a Jain dispensary and after just one dose of some medicine from that guy, the chick recovered significantly. They really care about animals and it's all free (donation based).",
        "It looks like a toad, so be careful handling it. Wash your hands properly, if you are handling it.",
        "Okay, so here's what your going to do,\nYou have to keep some kind of water supply in the cage so that the guy can hydrate himself.\n\n2) don't apply anything unless the vet says so.\n\n3) lots of turtle foods are available at let stores for emergencies at least.  Buy a good quality one. \n\n4) If you have a to keep him longer then buy Gurbs for the little guy online.  something like this\n\n Canoodle Natural Dried Food for Medium and Large Size Aquarium Fish Like Arowana, Oscar, Red Parrot, Flower Horn,Turtle, Tortoize, Reptiles and Birds- High Protein Treat for Pets (Meal Worms 50 GMS) https://amzn.eu/d/7jFywcz\n\nGood luck!! remember the update us",
        "Wow. You are a kind heart ❤️\nI have cats and had dogs as my lifelines . Know nothing about frogs but I wish you only love .",
        "OP you’re too kind!! ❤️❤️🥺",
        "Part of the natural food chain",
        "trrrr trrrrrrr trrrrr",
        "Oh! What a cutie. Thank you a billion times for saving him. I hope many great and beautiful things happen for you everyday.",
        "Ur a legend bro Hope He gets well soon",
        "Call him Gamakichi.",
        "Frog is undoubtedly an animal just like you are.",
        "Wow, what a gem of a person you are. Ngl, I'd have probably ignored it, and let it die. \n\nAs a guy who watches a lot of weird shit about wildlife, frogs love mealworms (live, not dead). Also frogs usually only eat insects which are moving, so don't buy or feed dead insects.",
        "Nah, Gamabunta slaps.",
        "Dogs & cats tak thik tha, we saving frogs too now? Whats next? Saving ants?",
        "🫶",
        "Wait seriously? Thanks this is so helpful. City vets are absolutely useless when it comes to farm animals like chicks.",
        "The fuq is wrong with this generation??? A frog isn't a pet you imbecile, leave it alone on the road. And hey that guy isn't a \"heartless bastard\" more like you are a senseless moron. Reading posts like these makes me wish bullying should be normalized in schools.",
        "Now tf did i type that makes me an animal dumbass",
        "Lmao this person thinks calling him an animal is an insult \nDumbass never took 9th grade bio",
        "It was in  Rohini, Delhi. Idk how common they are elsewhere",
        "Thanks for all  kind and thoughtful comments y'all. I feel stronger when I carry our little friends to safety knowing that I have all  of you having my back.\n\nTo update while I was still in office my family decaged our little friend and left him in nature. My father thought he would be better off that way feeding on insects and nurture near plants/soil.  My dad's thought process was that he would have easy access to food if he is decaged and that might help him to heal sooner in the natural habitat.\n\nI tried looking for him where my dad left him but could not find him. Praying that he is doing good now and hoping he recovered from the truama."
    ],
    "cleaned_text": "found frog beaten heartless bastard brought home parents taking care planning take vet evening back office feeding water please suggest food medicine ointment applied treat injury little frog beaten heartless bastard bought home caged monitor feed planning take vethospital office hours meanwhile parents taking care asked give water avoid dehydration please suggest ointmentmedicine feed relieve heal wounds terms food probably rely insects etc try find get packaged foods xb ",
    "cleaned_title": "found frog beaten heartless bastard brought home parents taking care planning take vet evening back office feeding water please suggest food medicine ointment applied treat injury",
    "cleaned_selftext": "little frog beaten heartless bastard bought home caged monitor feed planning take vethospital office hours meanwhile parents taking care asked give water avoid dehydration please suggest ointmentmedicine feed relieve heal wounds terms food probably rely insects etc try find get packaged foods xb",
    "cleaned_comments": "good job op dont know much reptiles gentleman cutie p op legend love need people like instead spreading hate found heartless bastard killing insects feed frog planning confront guy save insects taking vet please suggest food feed insects amphibian also looks like toad frog omg tank contact blue cross find number online hours whatsapp emergency helpline peta indias emergency number peta indias alternative contact number blue cross india animal helpline ahimsa research foundation animal citizen peta india wildlife helpline duty room cso prakriti members greater chennai corporation animal mobile medical ambulance emri httpswwwfrogeducationcomcontacthttpswwwfrogeducationcomcontact xb pick anyone last link really helpful since specific name mr denmark jeez people humour abrahms way go home eat chicken tikka later leave thing outside frr yk someone really good care stray animals idk frog animal salute op let good world recover easily bro incredible human thank existing dont think recover easily single mild hit human real damage small creature care op nice cuz ive never seen single person helping small creatures guy appreciate good people encouraged dont know bad world worse current would like cant belive find froggo cute look jain community around dispensary pet chick one day suddenly got sick thin fault didnt arrange proper cooling water left alone room hours summer took couple vets said lost cause let die took jain dispensary one dose medicine guy chick recovered significantly really care animals free donation based looks like toad careful handling wash hands properly handling okay heres going keep kind water supply cage guy hydrate dont apply anything unless vet says lots turtle foods available let stores emergencies least buy good quality one keep longer buy gurbs little guy online something like canoodle natural dried food medium large size aquarium fish like arowana oscar red parrot flower hornturtle tortoize reptiles birds high protein treat pets meal worms gms good luck remember update us wow kind heart cats dogs lifelines know nothing frogs wish love op youre kind part natural food chain trrrr trrrrrrr trrrrr oh cutie thank billion times saving hope many great beautiful things happen everyday ur legend bro hope gets well soon call gamakichi frog undoubtedly animal like wow gem person ngl id probably ignored let die guy watches lot weird shit wildlife frogs love mealworms live dead also frogs usually eat insects moving dont buy feed dead insects nah gamabunta slaps dogs cats tak thik tha saving frogs whats next saving ants wait seriously thanks helpful city vets absolutely useless comes farm animals like chicks fuq wrong generation frog isnt pet imbecile leave alone road hey guy isnt heartless bastard like senseless moron reading posts like makes wish bullying normalized schools tf type makes animal dumbass lmao person thinks calling animal insult dumbass never took th grade bio rohini delhi idk common elsewhere thanks kind thoughtful comments yall feel stronger carry little friends safety knowing back update still office family decaged little friend left nature father thought would better way feeding insects nurture near plantssoil dads thought process would easy access food decaged might help heal sooner natural habitat tried looking dad left could find praying good hoping recovered truama",
    "light_cleaned_title": "Found a frog who was beaten by a heartless bastard. I have brought him home and my parents are taking care of him. Planning to take him to vet in the evening once i am back from office. I am feeding him water . Please suggest some food and medicine /ointment that can be applied to treat his injury.",
    "light_cleaned_selftext": "This little frog was beaten up by a heartless bastard. I bought him home and have caged him to monitor and feed him. I am planning to take him to vet/hospital after my office hours. Meanwhile my parents are taking care of him. I asked them to give him water to avoid dehydration Please suggest any ointment/medicine i can feed him to relieve and heal his wounds. In terms of food probably they rely on insects etc, i will try to find if i can get such packaged foods. &#x200B;",
    "light_cleaned_comments": "Good job OP Don't know much about reptiles... But that gentleman is a cutie, P. S- op you are a legend, love you and we need more people to be like you instead of spreading hate 24/7. \"Found a heartless bastard killing insects to feed a frog. Planning to confront the guy & save insects by taking it to vet. Please suggest some food to feed the insects\" It's an amphibian*. Also looks like a toad and not a frog. Omg.... Tank you Contact blue cross, you can find their number online * 0) 98201 22602 * \\+91 9920777536 (24 hours) * \\+91 9962998886 (WhatsApp emergency helpline) * 9820122602 (PETA India's emergency number) * 9167907382 (PETA India's alternative contact number) * Blue Cross of India: 044 46274999 and 044 71819575 * Animal Helpline: 09898019059 and 09898499954 * Ahimsa Research Foundation: + 91 (44) 327 7133 * Animal Citizen: + 91 (44) 432 0528 * PETA India: (0) 98201 22602 * Wildlife Helpline: 8280 (Duty room), 8262 or 9262 (CSO), 4172/6172, 6419, 4169/6169 (Prakriti members) * Greater Chennai Corporation: 1913 * 1962 – Animal Mobile Medical Ambulance - EMRI: 1962 [https://www.frogeducation.com/contact](https://www.frogeducation.com/contact) &#x200B; pick anyone of these last link is really helpful since its specific Name him Mr. Denmark Jeez, do people not have humour in them? M1 Abrahms on it's way Will go home and eat chicken tikka later. Leave that thing outside. Frr yk someone is really good when they care for stray animals (idk if frog is an animal) salute to op Let there be some good in the world It will recover itself easily bro. You are an incredible human being. Thank you for existing. I dont think so that “it will recover easily” a single mild hit from any human can do some real damage so such a small creature and why do you care op is being so nice cuz ive never seen a single person helping so small creatures. My guy appreciate good people so they are encouraged to do more you dont know what a bad world (worse than current) would be like Can't belive that I find this froggo cute now 🐸 Look up some Jain community around you with a dispensary. I had a pet chick which one day suddenly got very sick and thin (it was my fault, I didn't arrange for proper cooling and water and left it alone in room for 7-8 hours in summer). I took it to a couple vets and both said that it's a lost cause and to let it die. Then I took it to a Jain dispensary and after just one dose of some medicine from that guy, the chick recovered significantly. They really care about animals and it's all free (donation based). It looks like a toad, so be careful handling it. Wash your hands properly, if you are handling it. Okay, so here's what your going to do, You have to keep some kind of water supply in the cage so that the guy can hydrate himself. 2) don't apply anything unless the vet says so. 3) lots of turtle foods are available at let stores for emergencies at least. Buy a good quality one. 4) If you have a to keep him longer then buy Gurbs for the little guy online. something like this Canoodle Natural Dried Food for Medium and Large Size Aquarium Fish Like Arowana, Oscar, Red Parrot, Flower Horn,Turtle, Tortoize, Reptiles and Birds- High Protein Treat for Pets (Meal Worms 50 GMS) Good luck!! remember the update us Wow. You are a kind heart ❤️ I have cats and had dogs as my lifelines . Know nothing about frogs but I wish you only love . OP you’re too kind!! ❤️❤️🥺 Part of the natural food chain trrrr trrrrrrr trrrrr Oh! What a cutie. Thank you a billion times for saving him. I hope many great and beautiful things happen for you everyday. Ur a legend bro Hope He gets well soon Call him Gamakichi. Frog is undoubtedly an animal just like you are. Wow, what a gem of a person you are. Ngl, I'd have probably ignored it, and let it die. As a guy who watches a lot of weird shit about wildlife, frogs love mealworms (live, not dead). Also frogs usually only eat insects which are moving, so don't buy or feed dead insects. Nah, Gamabunta slaps. Dogs & cats tak thik tha, we saving frogs too now? Whats next? Saving ants? 🫶 Wait seriously? Thanks this is so helpful. City vets are absolutely useless when it comes to farm animals like chicks. The fuq is wrong with this generation??? A frog isn't a pet you imbecile, leave it alone on the road. And hey that guy isn't a \"heartless bastard\" more like you are a senseless moron. Reading posts like these makes me wish bullying should be normalized in schools. Now tf did i type that makes me an animal dumbass Lmao this person thinks calling him an animal is an insult Dumbass never took 9th grade bio It was in Rohini, Delhi. Idk how common they are elsewhere Thanks for all kind and thoughtful comments y'all. I feel stronger when I carry our little friends to safety knowing that I have all of you having my back. To update while I was still in office my family decaged our little friend and left him in nature. My father thought he would be better off that way feeding on insects and nurture near plants/soil. My dad's thought process was that he would have easy access to food if he is decaged and that might help him to heal sooner in the natural habitat. I tried looking for him where my dad left him but could not find him. Praying that he is doing good now and hoping he recovered from the truama."
}