{
    "id": "1cz0lp7",
    "title": "Why isn’t the public keen on getting the Corrupt cops, MLA and the legal people arrested and investigated? The father has started using the oldest trick in the book by saying Driver was behind the wheel and not his son. The 17.8 old guy will walk free sadly right in front of our eyes",
    "url": "https://www.reddit.com/r/india/comments/1cz0lp7/why_isnt_the_public_keen_on_getting_the_corrupt/",
    "selftext": "This circus will not stop till the corrupt system is questioned. \n\nEverybody knew that the blame will be shifted to the driver as a scapegoat. \n\nIt has been unfortunately used so many times that people can easily predict this. \n\nThe cops harass and abuse the common man when we have all the papers and follow the traffic rules for bribes but when rich brats end the life of two hardworking graduates there is no action, MLA runs to the police station at 6 am , police commissioner is trying to cover up the case in TV interviews, the father is trying to bribe the driver into admitting that he did it.\n\nFor how long will this country’s common man tolerate this abuse?\n\nWe pay TDS, GST, STCG/LTCG, STT, CESS, Road tax for non existent/ if existent poorly constructed roads and the cops and other government get paid with that but they serve the people who pay the highest bribe. \n\nEven the blood sample was taken at a 4 hours gap and then sent to the lab and the results are still not out after 60 hours. It doesn’t take that long.\n\nManipulation, Manipulation, Manipulation.\n\nWho is this builder and how powerful is he? He literally has the entire system in his finger tips. They dance according to his tunes and despite the massive media pressure and Top moister pressure they don’t want to Send the murderer to jail. \n\nHow corrupt is this system? \n\nI love India but as a common man I’m scared of the system while the rich are free to do whatever they want. \n\nhttps://www.indiatoday.in/amp/india/story/pune-crash-accused-claim-family-driver-was-behind-the-wheel-at-time-of-accident-2543004-2024-05-23",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1716490636.0,
    "convurl": "https://external-preview.redd.it/RFpm_b3DF9ZEPXSr5oALxP6udotYUIudJ3bxRzbC_Hw.jpg?auto=webp&s=71dac92eb6965cfaf48f45e2c312a1cabc5b9ffe",
    "comments": [],
    "cleaned_text": "isnt public keen getting corrupt cops mla legal people arrested investigated father started using oldest trick book saying driver behind wheel son old guy walk free sadly right front eyes circus stop till corrupt system questioned everybody knew blame shifted driver scapegoat unfortunately used many times people easily predict cops harass abuse common man papers follow traffic rules bribes rich brats end life two hardworking graduates action mla runs police station police commissioner trying cover case tv interviews father trying bribe driver admitting long countrys common man tolerate abuse pay tds gst stcgltcg stt cess road tax non existent existent poorly constructed roads cops government get paid serve people pay highest bribe even blood sample taken hours gap sent lab results still hours doesnt take long manipulation manipulation manipulation builder powerful literally entire system finger tips dance according tunes despite massive media pressure top moister pressure dont want send murderer jail corrupt system love india common man im scared system rich free whatever want ",
    "cleaned_title": "isnt public keen getting corrupt cops mla legal people arrested investigated father started using oldest trick book saying driver behind wheel son old guy walk free sadly right front eyes",
    "cleaned_selftext": "circus stop till corrupt system questioned everybody knew blame shifted driver scapegoat unfortunately used many times people easily predict cops harass abuse common man papers follow traffic rules bribes rich brats end life two hardworking graduates action mla runs police station police commissioner trying cover case tv interviews father trying bribe driver admitting long countrys common man tolerate abuse pay tds gst stcgltcg stt cess road tax non existent existent poorly constructed roads cops government get paid serve people pay highest bribe even blood sample taken hours gap sent lab results still hours doesnt take long manipulation manipulation manipulation builder powerful literally entire system finger tips dance according tunes despite massive media pressure top moister pressure dont want send murderer jail corrupt system love india common man im scared system rich free whatever want",
    "cleaned_comments": "",
    "light_cleaned_title": "Why isn’t the public keen on getting the Corrupt cops, MLA and the legal people arrested and investigated? The father has started using the oldest trick in the book by saying Driver was behind the wheel and not his son. The 17.8 old guy will walk free sadly right in front of our eyes",
    "light_cleaned_selftext": "This circus will not stop till the corrupt system is questioned. Everybody knew that the blame will be shifted to the driver as a scapegoat. It has been unfortunately used so many times that people can easily predict this. The cops harass and abuse the common man when we have all the papers and follow the traffic rules for bribes but when rich brats end the life of two hardworking graduates there is no action, MLA runs to the police station at 6 am , police commissioner is trying to cover up the case in TV interviews, the father is trying to bribe the driver into admitting that he did it. For how long will this country’s common man tolerate this abuse? We pay TDS, GST, STCG/LTCG, STT, CESS, Road tax for non existent/ if existent poorly constructed roads and the cops and other government get paid with that but they serve the people who pay the highest bribe. Even the blood sample was taken at a 4 hours gap and then sent to the lab and the results are still not out after 60 hours. It doesn’t take that long. Manipulation, Manipulation, Manipulation. Who is this builder and how powerful is he? He literally has the entire system in his finger tips. They dance according to his tunes and despite the massive media pressure and Top moister pressure they don’t want to Send the murderer to jail. How corrupt is this system? I love India but as a common man I’m scared of the system while the rich are free to do whatever they want.",
    "light_cleaned_comments": ""
}