{
    "id": "16p1zp4",
    "title": "Unemployment is here!",
    "url": "https://www.reddit.com/r/india/comments/16p1zp4/unemployment_is_here/",
    "selftext": " [‘State of Working India’ in 7 charts: On women in workforce, educated youth unemployment and more | Explained News - The Indian Express](https://indianexpress.com/article/explained/explained-economics/state-of-working-india-report-jobs-unemployment-women-explained-8949585/) \n\n [Jean Drèze writes: Wages are the worry, not just unemployment (indianexpress.com)](https://indianexpress.com/article/opinion/columns/jean-dreze-writes-wages-are-the-worry-not-just-unemployment-8553226/) \n\nThe highest number of graduates is in Arts and Humanities. They have no option but either to work as teachers in private schools which pay less then 5000 INR a month on an average, or to prepare endlessly for the competitive government exams.\n\nOn the other  hand are students with the mentality who merely do engineering for the sake of getting a degree, and create a dearth of engineers by not opting to work as JEs.\n\nNow this is an intersectional  problem , involving the policy makers, the growing capitalism, degrading mental health{ [Is Capitalism Making Us Sick? | Psychology Today](https://www.psychologytoday.com/intl/blog/the-biology-of-human-nature/202309/how-capitalism-is-making-us-sick) }, degrading moral and social values, changing priorities,et al.\n\nSay for example, a person doing sociology or social work could have been involved in data collection for the various surveys, or be a part of research team, but majority colleges have no practical or field work for the social sciences, despite their growing importance in the changing scenario.\n\nOne very important aspect as pointed by the eminent economist Jean Dreze , is the growth in real wages. Why are teachers so underpaid ?For that matter, the entry level wages of many , such as sales profession , marketing, are extremely low.\n\nAnd then there are others, such as highly paid software developers.\n\nThis huge gap also forces many to take up courses against their circumstances.\n\nInstead you can be an excellent teacher, or an excellent salesman as well.\n\n All types of professions have a role to play in society.\n\nMaybe , standardization of all shall improve the wages for work proportionally.\n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695360559.0,
    "convurl": "https://external-preview.redd.it/EvqLAj0fQK2Dq5ZkZULVVwTwiPg1wxD7pArxvuc0_R4.jpg?auto=webp&s=214f842df555fa9cae3d7de83776434cf070fbe0",
    "comments": [
        "This is why I will always resist bans on coaching. At least the teachers are being paid well. If there is a reason that teachers of +1 and +2 students are being paid comparable, sometimes more, than IIM faculty, its only because of coaching industry."
    ],
    "cleaned_text": "unemployment state working india charts women workforce educated youth unemployment explained news indian expresshttpsindianexpresscomarticleexplainedexplainedeconomicsstateofworkingindiareportjobsunemploymentwomenexplained jean drze writes wages worry unemployment indianexpresscomhttpsindianexpresscomarticleopinioncolumnsjeandrezewriteswagesaretheworrynotjustunemployment highest number graduates arts humanities option either work teachers private schools pay less inr month average prepare endlessly competitive government exams hand students mentality merely engineering sake getting degree create dearth engineers opting work jes intersectional problem involving policy makers growing capitalism degrading mental health capitalism making us sick psychology todayhttpswwwpsychologytodaycomintlblogthebiologyofhumannaturehowcapitalismismakingussick degrading moral social values changing prioritieset al say example person sociology social work could involved data collection various surveys part research team majority colleges practical field work social sciences despite growing importance changing scenario one important aspect pointed eminent economist jean dreze growth real wages teachers underpaid matter entry level wages many sales profession marketing extremely low others highly paid software developers huge gap also forces many take courses circumstances instead excellent teacher excellent salesman well types professions role play society maybe standardization shall improve wages work proportionally xb ",
    "cleaned_title": "unemployment",
    "cleaned_selftext": "state working india charts women workforce educated youth unemployment explained news indian expresshttpsindianexpresscomarticleexplainedexplainedeconomicsstateofworkingindiareportjobsunemploymentwomenexplained jean drze writes wages worry unemployment indianexpresscomhttpsindianexpresscomarticleopinioncolumnsjeandrezewriteswagesaretheworrynotjustunemployment highest number graduates arts humanities option either work teachers private schools pay less inr month average prepare endlessly competitive government exams hand students mentality merely engineering sake getting degree create dearth engineers opting work jes intersectional problem involving policy makers growing capitalism degrading mental health capitalism making us sick psychology todayhttpswwwpsychologytodaycomintlblogthebiologyofhumannaturehowcapitalismismakingussick degrading moral social values changing prioritieset al say example person sociology social work could involved data collection various surveys part research team majority colleges practical field work social sciences despite growing importance changing scenario one important aspect pointed eminent economist jean dreze growth real wages teachers underpaid matter entry level wages many sales profession marketing extremely low others highly paid software developers huge gap also forces many take courses circumstances instead excellent teacher excellent salesman well types professions role play society maybe standardization shall improve wages work proportionally xb",
    "cleaned_comments": "always resist bans coaching least teachers paid well reason teachers students paid comparable sometimes iim faculty coaching industry",
    "light_cleaned_title": "Unemployment is here!",
    "light_cleaned_selftext": "[‘State of Working India’ in 7 charts: On women in workforce, educated youth unemployment and more | Explained News - The Indian Express](https://indianexpress.com/article/explained/explained-economics/state-of-working-india-report-jobs-unemployment-women-explained-8949585/) [Jean Drèze writes: Wages are the worry, not just unemployment (indianexpress.com)](https://indianexpress.com/article/opinion/columns/jean-dreze-writes-wages-are-the-worry-not-just-unemployment-8553226/) The highest number of graduates is in Arts and Humanities. They have no option but either to work as teachers in private schools which pay less then 5000 INR a month on an average, or to prepare endlessly for the competitive government exams. On the other hand are students with the mentality who merely do engineering for the sake of getting a degree, and create a dearth of engineers by not opting to work as JEs. Now this is an intersectional problem , involving the policy makers, the growing capitalism, degrading mental health{ [Is Capitalism Making Us Sick? | Psychology Today](https://www.psychologytoday.com/intl/blog/the-biology-of-human-nature/202309/how-capitalism-is-making-us-sick) }, degrading moral and social values, changing priorities,et al. Say for example, a person doing sociology or social work could have been involved in data collection for the various surveys, or be a part of research team, but majority colleges have no practical or field work for the social sciences, despite their growing importance in the changing scenario. One very important aspect as pointed by the eminent economist Jean Dreze , is the growth in real wages. Why are teachers so underpaid ?For that matter, the entry level wages of many , such as sales profession , marketing, are extremely low. And then there are others, such as highly paid software developers. This huge gap also forces many to take up courses against their circumstances. Instead you can be an excellent teacher, or an excellent salesman as well. All types of professions have a role to play in society. Maybe , standardization of all shall improve the wages for work proportionally. &#x200B;",
    "light_cleaned_comments": "This is why I will always resist bans on coaching. At least the teachers are being paid well. If there is a reason that teachers of +1 and +2 students are being paid comparable, sometimes more, than IIM faculty, its only because of coaching industry."
}