{
    "id": "1hawfq4",
    "title": "Men posting rape comments on girls, Women instigating married men to suicide. We as society are literally fucked up!",
    "url": "https://www.reddit.com/gallery/1hawfq4",
    "selftext": "\nCame across these 2 posts on reddit today and both made my blood boil. What the fuck is wrong with people! We have simply failed as a society where lust and money takes precedence over someone's life and peace of mind.",
    "flair": "Law & Courts",
    "score": 230,
    "num_comments": 45,
    "created_utc": 1733815487.0,
    "convurl": "https://i.redd.it/1zpc3pul3z5e1.png",
    "comments": [
        "not so nice guy Prashant.",
        "people's inference skills are off the charts, ngl",
        "Instead of coming together to solve the problem, which is what people actually want but all that happens is people use incidents like these to hate each other and use it to justify their hate. I.e. exactly what politicians want.",
        "Seriously… they just want someone to blame.. always the weak one is suffering…. There is no gender specifications…\n\nNo one seeing the things as society… there are few ones who wants to see the change… others are just adding noise pollution..",
        "It's all happening because the laws in India are fucked. Laws used to protect women are being misused by vile women. These laws were placed to save women from abusive husbands. But Indians have been using it to weaponize men. Obviously if people see such news, they'll get angry. The men will feel they are not being protected, their blood boils and start hating all women. The hate chain keeps on continuing.",
        "This is a fucked up cycle with no ending.\n\nCorporatism and politics is pushing a vicious cycle of profit at all cost. Consequences be damned.\n\nNow that is filtering down to a personal level of money at all cost. Consequences be damned. \n\nBreaking this cycle will be a painful process for the world and will be akin to an addict’s withdrawal period.",
        "JUST ACCEPT THAT EVERYONE IS A SCUM.\n\nEVEN I AM A WORTHLESS SCUM.",
        "So what are we doing to undo that?",
        "I am not defending any one of those stories, but comparing the two posts, also think about the IQ, education and social and emotional setup of the two stories. More importantly, think about the judicial support one gets from both the stories  - meaning, if this guy (who committed suicide sadly) had gone to court in first story vs the girl complaining in court about  the Prashant guy harassing her, who will get the support first from courts, police and people?",
        "Turns out Prashant wasn't nice this whole time ",
        "Pyar dekh ke karo , kutiya aurat se bacho",
        "The perpetrators are different,\n\n Incident 1 - perpetrator is a judge and software developer working for Accenture.\n\n Incident 2 - a low IQ chapri",
        "Not saying this in a discriminatory way but looking at the profile picture it's really men from a particular geographic location within India.",
        "Wtf is unnatural sex?",
        "nice guy is not very nice i guess 😬",
        "These laws help in abusive relationships which is good but due to the Onesided Laws it is misused.So laws need to be modified as per requirements.",
        "Amal, replace m with n",
        "Something is now fundamentally damaged in the social contract between the men and women of this country. It will have terrible repercussions for society. \n\nWe are social animals. If we don’t have each other, we have nothing. Loneliness will poison our lives. Everyone must share the blame for this.",
        "Government is tryna suppress the news",
        "These laws were meant to protect women but some women are misusing it to exploit others. Sad 😔",
        "Unfortunately, most news I've read is about these laws being misused rather than women getting protection due to it. It's similar to the reservation. While my rich friends from low caste used to pay less for education due to reservation, we hear news about how low caste people are being harassed and killed in rural regions. The questions then arise, what's happening with laws in our country? They're mostly being just misused and the High and Mighty overlords including Judiciary, Government are doing nothing to improve the situation.",
        "United we stand divided we fall I guess. But who cares ATP.",
        "Was looking for this comment",
        "Problem is these laws are never made with the thought that it could get misused.It will take a long time to correct it",
        "smh trash grammar skills and they still have the audacity to write this bullshit. \n\n\"If a woman triggers our lust, she must pay for it\" oh okay then I'm sure he won't mind someone setting a wild beast on him. After all it's natural instinct to bite, if he triggers the dog's predatory reaction, he must pay for it. \n\nDisgusting stain on the world",
        "Exactly. Our population is misogynyst, while judiciary is misandrist. There's no common ground. Our moral values are now just to get kinks by knowing someone's name, religion, cast, creed, gender, orientation and whatnot.",
        "If you ask me, considering that thing a human is doing him a favour",
        "both are  \none is cruel woman other is potential rapi\\*t",
        "Hate is not the answer. One wrong cannot undo another. Also, the comment isn't relevant",
        "https://preview.redd.it/n2ukwgy9dz5e1.png?width=567&format=pjpg&auto=webp&s=a79b66faf98c134425d4d6cfd71031f142e27fe4\n\nViral kardo isko",
        "I tried reading his suicide note, could not finish reading. Pathetic state of our courts and justice.",
        "And the Judge laughed at it?! 🫡",
        "What happened is tragic and sad. But some incels use such things to just fuel their own insecurities and hatred against so many women.\n\nCrimes against women happen on a much larger scale on a daily basis. There are literally around 30000 rapes (according to 2022 crime statistics) in India annually. Let that sink in! And this in only the data of rapes. There are all other sorts of crimes. \n\nBut women (most) don't get insecure and convert all these crimes happening everywhere to gender wars, unlike these lowlife incel parasites. One crime against a man (equally sad and tragic, please don't think I am justifying), and these guys get insecure and fearful and convert that thing to gender wars.",
        "it's like the good men and good women can't find each other and always end up with the toxic/bad one.",
        "It can also be viral. Replace vi with o. Anything unhealthy in one of the partners and the first word might actually stand true",
        "Ye nice guy prashant ko to arrest karwao, I dont know what can be done about these shitty divorce laws in India.",
        "There was a post a while ago about acid attack on a man by his jilted girlfriend. And a lot of women were happy saying \"now men will get it when they face it\", \"this is equality\", \"he deserves this\" etc... There were a lot of laugh reactions on the fb post\n\nIt seems most people are fighting ego battles rather than battles for justice (for the innocent).",
        "The other is also a misandrist who is portraying a wrong view of all men merely because he can't control his own lust and wants to be a sex-slave of women!",
        "The difference is that the crimes against women taken seriously and we have laws that criminalise those crimes. It’s the exact opposite for men when the law is used as a tool for extortion, you know, the definition of parasitic behaviour.",
        "I still don’t understand why men are even signing up for marriage. Every aspect of it is disadvantageous to men. The cultural, legal, financial - they’re all shit. Many incels seem to think that marriage will get them laid, but that’s not a guarantee either. The only thing that our culture and law guarantees for men is suffering.",
        "one has done actual irreparable damage- led a guy to suicide and still acts in a position of power to related cases. the other is uttering vile feelings which he wont likely ever act. \n\nthe chances of the chapri actually assaulting women is less than the judge having abused his position more than 1 time",
        "how about judge ko viral karo"
    ],
    "cleaned_text": "men posting rape comments girls women instigating married men suicide society literally fucked came across posts reddit today made blood boil fuck wrong people simply failed society lust money takes precedence someones life peace mind ",
    "cleaned_title": "men posting rape comments girls women instigating married men suicide society literally fucked",
    "cleaned_selftext": "came across posts reddit today made blood boil fuck wrong people simply failed society lust money takes precedence someones life peace mind",
    "cleaned_comments": "nice guy prashant peoples inference skills charts ngl instead coming together solve problem people actually want happens people use incidents like hate use justify hate ie exactly politicians want seriously want someone blame always weak one suffering gender specifications one seeing things society ones wants see change others adding noise pollution happening laws india fucked laws used protect women misused vile women laws placed save women abusive husbands indians using weaponize men obviously people see news theyll get angry men feel protected blood boils start hating women hate chain keeps continuing fucked cycle ending corporatism politics pushing vicious cycle profit cost consequences damned filtering personal level money cost consequences damned breaking cycle painful process world akin addicts withdrawal period accept everyone scum even worthless scum undo defending one stories comparing two posts also think iq education social emotional setup two stories importantly think judicial support one gets stories meaning guy committed suicide sadly gone court first story vs girl complaining court prashant guy harassing get support first courts police people turns prashant wasnt nice whole time pyar dekh ke karo kutiya aurat se bacho perpetrators different incident perpetrator judge software developer working accenture incident low iq chapri saying discriminatory way looking profile picture really men particular geographic location within india wtf unnatural sex nice guy nice guess laws help abusive relationships good due onesided laws misusedso laws need modified per requirements amal replace n something fundamentally damaged social contract men women country terrible repercussions society social animals dont nothing loneliness poison lives everyone must share blame government tryna suppress news laws meant protect women women misusing exploit others sad unfortunately news ive read laws misused rather women getting protection due similar reservation rich friends low caste used pay less education due reservation hear news low caste people harassed killed rural regions questions arise whats happening laws country theyre mostly misused high mighty overlords including judiciary government nothing improve situation united stand divided fall guess cares atp looking comment problem laws never made thought could get misusedit take long time correct smh trash grammar skills still audacity write bullshit woman triggers lust must pay oh okay im sure wont mind someone setting wild beast natural instinct bite triggers dogs predatory reaction must pay disgusting stain world exactly population misogynyst judiciary misandrist theres common ground moral values get kinks knowing someones name religion cast creed gender orientation whatnot ask considering thing human favour one cruel woman potential rapit hate answer one wrong undo another also comment isnt relevant viral kardo isko tried reading suicide note could finish reading pathetic state courts justice judge laughed happened tragic sad incels use things fuel insecurities hatred many women crimes women happen much larger scale daily basis literally around rapes according crime statistics india annually let sink data rapes sorts crimes women dont get insecure convert crimes happening everywhere gender wars unlike lowlife incel parasites one crime man equally sad tragic please dont think justifying guys get insecure fearful convert thing gender wars like good men good women cant find always end toxicbad one also viral replace vi anything unhealthy one partners first word might actually stand true ye nice guy prashant ko arrest karwao dont know done shitty divorce laws india post ago acid attack man jilted girlfriend lot women happy saying men get face equality deserves etc lot laugh reactions fb post seems people fighting ego battles rather battles justice innocent also misandrist portraying wrong view men merely cant control lust wants sexslave women difference crimes women taken seriously laws criminalise crimes exact opposite men law used tool extortion know definition parasitic behaviour still dont understand men even signing marriage every aspect disadvantageous men cultural legal financial theyre shit many incels seem think marriage get laid thats guarantee either thing culture law guarantees men suffering one done actual irreparable damage led guy suicide still acts position power related cases uttering vile feelings wont likely ever act chances chapri actually assaulting women less judge abused position time judge ko viral karo",
    "light_cleaned_title": "Men posting rape comments on girls, Women instigating married men to suicide. We as society are literally fucked up!",
    "light_cleaned_selftext": "Came across these 2 posts on reddit today and both made my blood boil. What the fuck is wrong with people! We have simply failed as a society where lust and money takes precedence over someone's life and peace of mind.",
    "light_cleaned_comments": "not so nice guy Prashant. people's inference skills are off the charts, ngl Instead of coming together to solve the problem, which is what people actually want but all that happens is people use incidents like these to hate each other and use it to justify their hate. I.e. exactly what politicians want. Seriously… they just want someone to blame.. always the weak one is suffering…. There is no gender specifications… No one seeing the things as society… there are few ones who wants to see the change… others are just adding noise pollution.. It's all happening because the laws in India are fucked. Laws used to protect women are being misused by vile women. These laws were placed to save women from abusive husbands. But Indians have been using it to weaponize men. Obviously if people see such news, they'll get angry. The men will feel they are not being protected, their blood boils and start hating all women. The hate chain keeps on continuing. This is a fucked up cycle with no ending. Corporatism and politics is pushing a vicious cycle of profit at all cost. Consequences be damned. Now that is filtering down to a personal level of money at all cost. Consequences be damned. Breaking this cycle will be a painful process for the world and will be akin to an addict’s withdrawal period. JUST ACCEPT THAT EVERYONE IS A SCUM. EVEN I AM A WORTHLESS SCUM. So what are we doing to undo that? I am not defending any one of those stories, but comparing the two posts, also think about the IQ, education and social and emotional setup of the two stories. More importantly, think about the judicial support one gets from both the stories - meaning, if this guy (who committed suicide sadly) had gone to court in first story vs the girl complaining in court about the Prashant guy harassing her, who will get the support first from courts, police and people? Turns out Prashant wasn't nice this whole time Pyar dekh ke karo , kutiya aurat se bacho The perpetrators are different, Incident 1 - perpetrator is a judge and software developer working for Accenture. Incident 2 - a low IQ chapri Not saying this in a discriminatory way but looking at the profile picture it's really men from a particular geographic location within India. Wtf is unnatural sex? nice guy is not very nice i guess 😬 These laws help in abusive relationships which is good but due to the Onesided Laws it is misused.So laws need to be modified as per requirements. Amal, replace m with n Something is now fundamentally damaged in the social contract between the men and women of this country. It will have terrible repercussions for society. We are social animals. If we don’t have each other, we have nothing. Loneliness will poison our lives. Everyone must share the blame for this. Government is tryna suppress the news These laws were meant to protect women but some women are misusing it to exploit others. Sad 😔 Unfortunately, most news I've read is about these laws being misused rather than women getting protection due to it. It's similar to the reservation. While my rich friends from low caste used to pay less for education due to reservation, we hear news about how low caste people are being harassed and killed in rural regions. The questions then arise, what's happening with laws in our country? They're mostly being just misused and the High and Mighty overlords including Judiciary, Government are doing nothing to improve the situation. United we stand divided we fall I guess. But who cares ATP. Was looking for this comment Problem is these laws are never made with the thought that it could get misused.It will take a long time to correct it smh trash grammar skills and they still have the audacity to write this bullshit. \"If a woman triggers our lust, she must pay for it\" oh okay then I'm sure he won't mind someone setting a wild beast on him. After all it's natural instinct to bite, if he triggers the dog's predatory reaction, he must pay for it. Disgusting stain on the world Exactly. Our population is misogynyst, while judiciary is misandrist. There's no common ground. Our moral values are now just to get kinks by knowing someone's name, religion, cast, creed, gender, orientation and whatnot. If you ask me, considering that thing a human is doing him a favour both are one is cruel woman other is potential rapi\\*t Hate is not the answer. One wrong cannot undo another. Also, the comment isn't relevant Viral kardo isko I tried reading his suicide note, could not finish reading. Pathetic state of our courts and justice. And the Judge laughed at it?! 🫡 What happened is tragic and sad. But some incels use such things to just fuel their own insecurities and hatred against so many women. Crimes against women happen on a much larger scale on a daily basis. There are literally around 30000 rapes (according to 2022 crime statistics) in India annually. Let that sink in! And this in only the data of rapes. There are all other sorts of crimes. But women (most) don't get insecure and convert all these crimes happening everywhere to gender wars, unlike these lowlife incel parasites. One crime against a man (equally sad and tragic, please don't think I am justifying), and these guys get insecure and fearful and convert that thing to gender wars. it's like the good men and good women can't find each other and always end up with the toxic/bad one. It can also be viral. Replace vi with o. Anything unhealthy in one of the partners and the first word might actually stand true Ye nice guy prashant ko to arrest karwao, I dont know what can be done about these shitty divorce laws in India. There was a post a while ago about acid attack on a man by his jilted girlfriend. And a lot of women were happy saying \"now men will get it when they face it\", \"this is equality\", \"he deserves this\" etc... There were a lot of laugh reactions on the fb post It seems most people are fighting ego battles rather than battles for justice (for the innocent). The other is also a misandrist who is portraying a wrong view of all men merely because he can't control his own lust and wants to be a sex-slave of women! The difference is that the crimes against women taken seriously and we have laws that criminalise those crimes. It’s the exact opposite for men when the law is used as a tool for extortion, you know, the definition of parasitic behaviour. I still don’t understand why men are even signing up for marriage. Every aspect of it is disadvantageous to men. The cultural, legal, financial - they’re all shit. Many incels seem to think that marriage will get them laid, but that’s not a guarantee either. The only thing that our culture and law guarantees for men is suffering. one has done actual irreparable damage- led a guy to suicide and still acts in a position of power to related cases. the other is uttering vile feelings which he wont likely ever act. the chances of the chapri actually assaulting women is less than the judge having abused his position more than 1 time how about judge ko viral karo"
}