{
    "id": "155hs9s",
    "title": "How political pettiness looks like- Karnataka Center conflict over food grains",
    "url": "https://www.reddit.com/r/india/comments/155hs9s/how_political_pettiness_looks_like_karnataka/",
    "selftext": "Union Govt denied additional grains to Karnataka Govt to run their scheme Annabhagya (which promised 5kg extra rice to beneficiaries)\n\nThe excerpts of this writeup are taken from The Hindu's article- [https://www.thehindu.com/opinion/lead/the-anna-bhagya-fiasco-and-thinking-beyond-rice/article67061211.ece](https://www.thehindu.com/opinion/lead/the-anna-bhagya-fiasco-and-thinking-beyond-rice/article67061211.ece)\n\nIm simplifying it for the readers. This will uncover one of the most distressing politics played by govt at center (and also shortsightedness by state govt)\n\n**Basics first- How does FCI work? (skip if you know about this)**\n\nFCI or Food Corp of India is a PSU which procures grains like rice and wheat for Govt of India. Rice and Wheat are under open procurement scheme, so all the rice/wheat that has been presented to the FCI (at mandis and designated places) has to be purchased by the FCI at MSP, provided they pass quality check. There are 3 objectives of FCI procurement-\n\n1. Farmers get due income for their produce, thereby reducing farmer distress\n2. To feed the population under PDS and various schemes like National Food Security Act, Annapurna scheme etc.\n3. Create a buffer stock of grains to be used in contingency. In case of grain shortage, this buffer stock released (read sold) in the open market to meet the rising demand, and therefore moderating prices. This is OMSS or Open Market Sale Scheme\n\n**OMSS- The bone of contention**\n\nOMSS grains, in case the existing stock of FCI is more than required buffer, can be sold to states (apart from open market). States have been purchasing this stock to feed their schemes like community kitchens of Tamil Nadu or used by states to top up their PDS grains (for eg if 5kg is promised by NFSA, states can add 2-3 more kgs to this quota)(states like Orissa etc). The states usually buy this grain at no profit, no loss but it ensures that no one goes hungry. Karnataka's Anna Bhagya Scheme (additional 5kg rice to beneficiaries) banked on this very OMSS scheme.\n\nUntil very recently, Union Govt has decided that it will no longer sell OMSS grains to states (yes, these OMSS grains can still be sold/auctioned to private players for any purposes incl ethanol manufacture).\n\nGoI listed the following reasons for the above action and their rebuttal is also mentioned-\n\n1. OMSS can perform its price stabilisation  role better if the grain is released through the market rather than through States/the PDS- But then there's no guarantee that private sector (to whom the govt is selling OMSS grains) will pass this cost down to consumers\n2. The buffer stock needs to be maintained- but post covid, available grains with FCI is twice the stipulated buffer\n3. Duplication of beneficiaries- this is where union govt is somewhat right. There were 1 million uncovered beneficiaries in karnataka itself and it would have been beneficial if instead the coverage was focussed on them\n4. We have to also take care of 600mn people not covered under PDS- fair point, but this can very well be done by expanding or updating list of PDS beneficiaries instead of price stabilisation\n\n**Union Govt's pettiness-**\n\n1. Its not as if Karnataka was going to lift grains for free from FCI under OMSS. In fact, Karnataka was going to pay Rs.3400 per quintal to FCI, while Ethanol cos are going to pay Rs 2000 per quintal. When feeding people takes a backseat in lieu of producing industrial chemicals (read ethanol)- [https://thewire.in/government/fci-rules-grain-food-fuel-karnataka](https://thewire.in/government/fci-rules-grain-food-fuel-karnataka)\n2. After denying grains to states, the govt went for an auction, which received lukewarm response. Now with egg on their face, govt is open to tweaking the policy- [https://indianexpress.com/article/political-pulse/no-takers-for-fci-rice-in-e-auction-to-check-inflation-8822060/](https://indianexpress.com/article/political-pulse/no-takers-for-fci-rice-in-e-auction-to-check-inflation-8822060/)\n\n**Implications-**\n\n1. Karnataka refused to buy grains from open market because, well, they are costlier. We can blame state govt for not thinking this through. The fact that union govt resorts to shady practices should have been factored while announcing the scheme. Now Karnataka govt is resorting to Direct Benefit Transfer instead of providing grains. This has issues of its own i.e using money (by the beneficiaries) for other purposes than food\n\n**State govts folly-**\n\nOnly focussing on rice based fulfilment of food security is a bad idea leading to hidden hunger (lack of proper nutrition). These funds could have better been used for supplying other essential items like cooking oil, sugar etc. It could also have been used to expand PDS coverage to 1million people out of PDS system in the state",
    "flair": "Politics",
    "score": 27,
    "num_comments": 5,
    "created_utc": 1689927897,
    "convurl": "https://external-preview.redd.it/sFcI38-5CAi6n6qBlLvC-gbWZl1k4qB1MFgQLkFqfF0.jpg?auto=webp&s=52c7d2d01b48f23ded3a7c883b590a58d910f4d0",
    "comments": [
        "Thanks for the write up.",
        "‘Double engine’ is a threat. If you don’t have both engines from the same brand, the other ‘engine’ will shift to reverse gear.",
        "The Central Govt sees anybody other than \"us\" as their enemy. They will try to convert others to \"us\" by every means possible. Where the conversion is possible they will starve them of resources. This very harmful to the diversity and federalism in India.",
        "If anyone still needs proof that Modi is one of the most petty and very vindictive person . Please read about Sanjiv Bhatt and testa, Bilkis. Even after years he took his revenge"
    ],
    "cleaned_text": "political pettiness looks like karnataka center conflict food grains union govt denied additional grains karnataka govt run scheme annabhagya promised kg extra rice beneficiaries excerpts writeup taken hindus article httpswwwthehinducomopinionleadtheannabhagyafiascoandthinkingbeyondricearticleecehttpswwwthehinducomopinionleadtheannabhagyafiascoandthinkingbeyondricearticleece im simplifying readers uncover one distressing politics played govt center also shortsightedness state govt basics first fci work skip know fci food corp india psu procures grains like rice wheat govt india rice wheat open procurement scheme ricewheat presented fci mandis designated places purchased fci msp provided pass quality check objectives fci procurement farmers get due income produce thereby reducing farmer distress feed population pds various schemes like national food security act annapurna scheme etc create buffer stock grains used contingency case grain shortage buffer stock released read sold open market meet rising demand therefore moderating prices omss open market sale scheme omss bone contention omss grains case existing stock fci required buffer sold states apart open market states purchasing stock feed schemes like community kitchens tamil nadu used states top pds grains eg kg promised nfsa states add kgs quotastates like orissa etc states usually buy grain profit loss ensures one goes hungry karnatakas anna bhagya scheme additional kg rice beneficiaries banked omss scheme recently union govt decided longer sell omss grains states yes omss grains still soldauctioned private players purposes incl ethanol manufacture goi listed following reasons action rebuttal also mentioned omss perform price stabilisation role better grain released market rather statesthe pds theres guarantee private sector govt selling omss grains pass cost consumers buffer stock needs maintained post covid available grains fci twice stipulated buffer duplication beneficiaries union govt somewhat right million uncovered beneficiaries karnataka would beneficial instead coverage focussed also take care mn people covered pds fair point well done expanding updating list pds beneficiaries instead price stabilisation union govts pettiness karnataka going lift grains free fci omss fact karnataka going pay rs per quintal fci ethanol cos going pay rs per quintal feeding people takes backseat lieu producing industrial chemicals read ethanol httpsthewireingovernmentfcirulesgrainfoodfuelkarnatakahttpsthewireingovernmentfcirulesgrainfoodfuelkarnataka denying grains states govt went auction received lukewarm response egg face govt open tweaking policy httpsindianexpresscomarticlepoliticalpulsenotakersforfciriceineauctiontocheckinflationhttpsindianexpresscomarticlepoliticalpulsenotakersforfciriceineauctiontocheckinflation implications karnataka refused buy grains open market well costlier blame state govt thinking fact union govt resorts shady practices factored announcing scheme karnataka govt resorting direct benefit transfer instead providing grains issues ie using money beneficiaries purposes food state govts folly focussing rice based fulfilment food security bad idea leading hidden hunger lack proper nutrition funds could better used supplying essential items like cooking oil sugar etc could also used expand pds coverage million people pds system state ",
    "cleaned_title": "political pettiness looks like karnataka center conflict food grains",
    "cleaned_selftext": "union govt denied additional grains karnataka govt run scheme annabhagya promised kg extra rice beneficiaries excerpts writeup taken hindus article httpswwwthehinducomopinionleadtheannabhagyafiascoandthinkingbeyondricearticleecehttpswwwthehinducomopinionleadtheannabhagyafiascoandthinkingbeyondricearticleece im simplifying readers uncover one distressing politics played govt center also shortsightedness state govt basics first fci work skip know fci food corp india psu procures grains like rice wheat govt india rice wheat open procurement scheme ricewheat presented fci mandis designated places purchased fci msp provided pass quality check objectives fci procurement farmers get due income produce thereby reducing farmer distress feed population pds various schemes like national food security act annapurna scheme etc create buffer stock grains used contingency case grain shortage buffer stock released read sold open market meet rising demand therefore moderating prices omss open market sale scheme omss bone contention omss grains case existing stock fci required buffer sold states apart open market states purchasing stock feed schemes like community kitchens tamil nadu used states top pds grains eg kg promised nfsa states add kgs quotastates like orissa etc states usually buy grain profit loss ensures one goes hungry karnatakas anna bhagya scheme additional kg rice beneficiaries banked omss scheme recently union govt decided longer sell omss grains states yes omss grains still soldauctioned private players purposes incl ethanol manufacture goi listed following reasons action rebuttal also mentioned omss perform price stabilisation role better grain released market rather statesthe pds theres guarantee private sector govt selling omss grains pass cost consumers buffer stock needs maintained post covid available grains fci twice stipulated buffer duplication beneficiaries union govt somewhat right million uncovered beneficiaries karnataka would beneficial instead coverage focussed also take care mn people covered pds fair point well done expanding updating list pds beneficiaries instead price stabilisation union govts pettiness karnataka going lift grains free fci omss fact karnataka going pay rs per quintal fci ethanol cos going pay rs per quintal feeding people takes backseat lieu producing industrial chemicals read ethanol httpsthewireingovernmentfcirulesgrainfoodfuelkarnatakahttpsthewireingovernmentfcirulesgrainfoodfuelkarnataka denying grains states govt went auction received lukewarm response egg face govt open tweaking policy httpsindianexpresscomarticlepoliticalpulsenotakersforfciriceineauctiontocheckinflationhttpsindianexpresscomarticlepoliticalpulsenotakersforfciriceineauctiontocheckinflation implications karnataka refused buy grains open market well costlier blame state govt thinking fact union govt resorts shady practices factored announcing scheme karnataka govt resorting direct benefit transfer instead providing grains issues ie using money beneficiaries purposes food state govts folly focussing rice based fulfilment food security bad idea leading hidden hunger lack proper nutrition funds could better used supplying essential items like cooking oil sugar etc could also used expand pds coverage million people pds system state",
    "cleaned_comments": "thanks write double engine threat dont engines brand engine shift reverse gear central govt sees anybody us enemy try convert others us every means possible conversion possible starve resources harmful diversity federalism india anyone still needs proof modi one petty vindictive person please read sanjiv bhatt testa bilkis even years took revenge",
    "light_cleaned_title": "How political pettiness looks like- Karnataka Center conflict over food grains",
    "light_cleaned_selftext": "Union Govt denied additional grains to Karnataka Govt to run their scheme Annabhagya (which promised 5kg extra rice to beneficiaries) The excerpts of this writeup are taken from The Hindu's article- [https://www.thehindu.com/opinion/lead/the-anna-bhagya-fiasco-and-thinking-beyond-rice/article67061211.ece](https://www.thehindu.com/opinion/lead/the-anna-bhagya-fiasco-and-thinking-beyond-rice/article67061211.ece) Im simplifying it for the readers. This will uncover one of the most distressing politics played by govt at center (and also shortsightedness by state govt) **Basics first- How does FCI work? (skip if you know about this)** FCI or Food Corp of India is a PSU which procures grains like rice and wheat for Govt of India. Rice and Wheat are under open procurement scheme, so all the rice/wheat that has been presented to the FCI (at mandis and designated places) has to be purchased by the FCI at MSP, provided they pass quality check. There are 3 objectives of FCI procurement- 1. Farmers get due income for their produce, thereby reducing farmer distress 2. To feed the population under PDS and various schemes like National Food Security Act, Annapurna scheme etc. 3. Create a buffer stock of grains to be used in contingency. In case of grain shortage, this buffer stock released (read sold) in the open market to meet the rising demand, and therefore moderating prices. This is OMSS or Open Market Sale Scheme **OMSS- The bone of contention** OMSS grains, in case the existing stock of FCI is more than required buffer, can be sold to states (apart from open market). States have been purchasing this stock to feed their schemes like community kitchens of Tamil Nadu or used by states to top up their PDS grains (for eg if 5kg is promised by NFSA, states can add 2-3 more kgs to this quota)(states like Orissa etc). The states usually buy this grain at no profit, no loss but it ensures that no one goes hungry. Karnataka's Anna Bhagya Scheme (additional 5kg rice to beneficiaries) banked on this very OMSS scheme. Until very recently, Union Govt has decided that it will no longer sell OMSS grains to states (yes, these OMSS grains can still be sold/auctioned to private players for any purposes incl ethanol manufacture). GoI listed the following reasons for the above action and their rebuttal is also mentioned- 1. OMSS can perform its price stabilisation role better if the grain is released through the market rather than through States/the PDS- But then there's no guarantee that private sector (to whom the govt is selling OMSS grains) will pass this cost down to consumers 2. The buffer stock needs to be maintained- but post covid, available grains with FCI is twice the stipulated buffer 3. Duplication of beneficiaries- this is where union govt is somewhat right. There were 1 million uncovered beneficiaries in karnataka itself and it would have been beneficial if instead the coverage was focussed on them 4. We have to also take care of 600mn people not covered under PDS- fair point, but this can very well be done by expanding or updating list of PDS beneficiaries instead of price stabilisation **Union Govt's pettiness-** 1. Its not as if Karnataka was going to lift grains for free from FCI under OMSS. In fact, Karnataka was going to pay Rs.3400 per quintal to FCI, while Ethanol cos are going to pay Rs 2000 per quintal. When feeding people takes a backseat in lieu of producing industrial chemicals (read ethanol)- [https://thewire.in/government/fci-rules-grain-food-fuel-karnataka](https://thewire.in/government/fci-rules-grain-food-fuel-karnataka) 2. After denying grains to states, the govt went for an auction, which received lukewarm response. Now with egg on their face, govt is open to tweaking the policy- [https://indianexpress.com/article/political-pulse/no-takers-for-fci-rice-in-e-auction-to-check-inflation-8822060/](https://indianexpress.com/article/political-pulse/no-takers-for-fci-rice-in-e-auction-to-check-inflation-8822060/) **Implications-** 1. Karnataka refused to buy grains from open market because, well, they are costlier. We can blame state govt for not thinking this through. The fact that union govt resorts to shady practices should have been factored while announcing the scheme. Now Karnataka govt is resorting to Direct Benefit Transfer instead of providing grains. This has issues of its own i.e using money (by the beneficiaries) for other purposes than food **State govts folly-** Only focussing on rice based fulfilment of food security is a bad idea leading to hidden hunger (lack of proper nutrition). These funds could have better been used for supplying other essential items like cooking oil, sugar etc. It could also have been used to expand PDS coverage to 1million people out of PDS system in the state",
    "light_cleaned_comments": "Thanks for the write up. ‘Double engine’ is a threat. If you don’t have both engines from the same brand, the other ‘engine’ will shift to reverse gear. The Central Govt sees anybody other than \"us\" as their enemy. They will try to convert others to \"us\" by every means possible. Where the conversion is possible they will starve them of resources. This very harmful to the diversity and federalism in India. If anyone still needs proof that Modi is one of the most petty and very vindictive person . Please read about Sanjiv Bhatt and testa, Bilkis. Even after years he took his revenge"
}