{
    "id": "183lxyl",
    "title": "Gangraped in teens, visiting courts as grandmothers: 1992 Ajmer horror is an open wound – ThePrint – Select",
    "url": "https://theprint.in/ground-reports/gangraped-in-teens-visiting-courts-as-grandmothers-1992-ajmer-horror-is-an-open-wound/814073/",
    "selftext": "Accused",
    "flair": "Law & Courts",
    "score": 110,
    "num_comments": 5,
    "created_utc": 1700925614.0,
    "convurl": "https://external-preview.redd.it/OPmWNVaOuKB9KW2ZyJrJAc4EZ6w0camPfSZVSLKKB0w.jpg?auto=webp&s=52caaa1ace14e3749946df8a275d6063ffef7970",
    "comments": [
        "Finally a piece of true journalism after a long time.",
        "What are the other articles? I’m gonna push it to my reading list",
        "The Print actually presents more centrist views and talks about topics that matter",
        "If the police do not do their work, you can approach the senior police officers, the judge, or the MLA of that constituency. If politicians do not do their work, you can vote them out.\n\nIf judges fail to deliver, you can't go anywhere. There is no accountability in the Judiciary branch of our government. And it is better not to talk about the corruption in district and high courts. If you don't bribe the clerk, by the time your hearing comes, the court is closed. You repeat this in the next day."
    ],
    "cleaned_text": "gangraped teens visiting courts grandmothers ajmer horror open wound theprint select accused ",
    "cleaned_title": "gangraped teens visiting courts grandmothers ajmer horror open wound theprint select",
    "cleaned_selftext": "accused",
    "cleaned_comments": "finally piece true journalism long time articles im gon na push reading list print actually presents centrist views talks topics matter police work approach senior police officers judge mla constituency politicians work vote judges fail deliver cant go anywhere accountability judiciary branch government better talk corruption district high courts dont bribe clerk time hearing comes court closed repeat next day",
    "light_cleaned_title": "Gangraped in teens, visiting courts as grandmothers: 1992 Ajmer horror is an open wound – ThePrint – Select",
    "light_cleaned_selftext": "Accused",
    "light_cleaned_comments": "Finally a piece of true journalism after a long time. What are the other articles? I’m gonna push it to my reading list The Print actually presents more centrist views and talks about topics that matter If the police do not do their work, you can approach the senior police officers, the judge, or the MLA of that constituency. If politicians do not do their work, you can vote them out. If judges fail to deliver, you can't go anywhere. There is no accountability in the Judiciary branch of our government. And it is better not to talk about the corruption in district and high courts. If you don't bribe the clerk, by the time your hearing comes, the court is closed. You repeat this in the next day."
}