{
    "id": "1dw5id0",
    "title": "Why are chocolate suddenly so expensive",
    "url": "https://www.reddit.com/gallery/1dw5id0",
    "selftext": " I usually buy chocolates each month, and I've always paid around 120-150 INR for my favorite dark bitter chocolate. But over the past few weeks, I've noticed that the prices have shot up significantly, not just for dark chocolate but even for milk chocolates.does anyone any reason behind this. ",
    "flair": "Policy/Economy",
    "score": 1080,
    "num_comments": 166,
    "created_utc": 1720205812.0,
    "convurl": "https://i.redd.it/smxwckw1zqad1.jpg",
    "comments": [
        "There was a massive heat surge induced drought in west Africa, cocoa crops took a hit, since companies have to pay for the hike in prices they inevitably will pass it on to the end consumers.\n\nhttps://www.theguardian.com/environment/2024/mar/21/west-africa-heatwave-climate-crisis-study",
        "This ⬆️\n\nTo add to what is already mentioned in the post above, Amul and Dairy Milk are two chocolates among the popular ones where if you check the list of ingredients you will find cocoa butter listed (instead of Vegetable oil aka Palm Oil/Palmolein). So when cocoa supply can't meet the global demand due to the reason cited in the post above, prices go up.",
        "Ayo padosi\n\nDilli 34 🤝🏻",
        "10 wali dairy milk kha le bhai ya phir 5star",
        "Airtel, Jio increased their tariffs... Amul & cadbury be like.. Why not!? 😂 /S",
        "Eclairs kha le bhai",
        "Kyonki har chiz adani aur ambani hi toh bech rahe hai",
        "Cocoa shortage. Funnily though, I would have expected it to impact future pricing, not current pricing. It’s possible they are trying to get ahead of the demand. Remember, price will always be the maximum that customers are willing to bear.",
        "Bhai im sitting in interlaken, Lindt ki chocolates are the same prices as 8 months back- why?",
        "Those are still rs.10 but boy has the volume shrunk down to nothing.",
        "We're in that dreaded future.",
        "Climate change",
        "Climate change",
        "True. But now that the prices have increased, they'll stay up even if input costs go down in the future. ",
        "Even the cost of instant coffee has doubled. Bru 50gm pack come for Rs.160",
        "And when Indian consumers complain about this price rise and stop paying, companies would start to increase the palm oil content which we all know is harmful.",
        "Amul chocolate is crap",
        "Yes, cocoa prices went almost 3X in a matter of months.  Only reason the companies could prices stable till now was past contracts and buffer stocks. Now there is a supply crunch which doesn't seem to go away anytime soon.",
        "Did anyone notice the fuckall discount math ? 👀",
        "Which then should categorise them as compound chocolate. Most consumers might not care but it will affect the brand.",
        "Also these are non palm oil or hydrogenated fat ones so……",
        "such is life",
        "Me still using 2 rupees sachets.....",
        "Simple demand and supply",
        "Those are almost all sugar",
        "Fruits khao, khud jaan jao...",
        "Amul dark chocolate went from 120 to 200 at once",
        "It could be coco shortage, more demand, or maybe the that food guy did dark chocolate review and told Amul 75% was best that's why.?",
        "Chocolate nt bol bhai, sugar candy with  flavour hoti h wo.",
        "Heatwave and a fungus infection. That's what a Morde chocolate spokesperson told me.",
        "After elections, everything becomes expensive. Use common sense.",
        "True. Taste has gone to shit as well.",
        "Rich people. I never bought chocolate worth more than 20 Rs in 30 years",
        "But then it adds to plastic wastage. So I avoid little pouches of coffee/shampoo etc. and only use them while travelling.",
        "Adding to this, because of that drought, there was a speculative frenzy on cocoa futures that drove up the prices even more. Some of this price increase was caused by the supply shortfall, yes, but a lot of it was caused by greedy commodity traders.",
        "I like this guy, knows his GK. \n\nI wish there'd be more people like him in reddit, spewing facts instead of useless crass and half arsed opinion pieces.",
        "The shortage has been happening since the last two years and that's why you're seeing an increase in current prices.",
        "But once the prices of the chocolates rise, will they reduce it when the cocoa prices become stable?",
        "Cocoa farmers in West Africa have been facing issues for the last decade. Many have switched to cash crops like rubber over time. So there's a deficit while demand grows with hyper consumerism and social media. \n\nThe chocolate companies want to keep consumer prices somewhat stable, so end result: small rate hikes, less cocoa per bar, bigger gaps between segments so overall quantity can be lowered. This is all without helping the farmers deal with the effects of climate change. Some of the biggest orgs have managed to still take in billion dollar profits, but would rather farmers keep up supply by using cheap child labour. It's depressing.",
        "Eat Chikki Bro",
        "Suddenly?  All good news sources are talking about it for the last decade \n\nWorse is yet to come",
        "House always wins, consumer pays, these days you can’t even speak with your wallet.",
        "Yeah the prices just shot up!! And that too drastically ;_;",
        "I wonder how much truly trickled down to the farmers and plantation owners.",
        "But cocoa butter is not edible..if it is in ingredients list then better to avoid it. Cocoa butter is used in cosmetics industry",
        "Oh no sympathy for plantation owners, cocoa harvesting is an incredibly exploitative industry. Workers make squat while most plantations are owned by big corpos. A lot of them also allegedly employ indentured workers and even children.",
        "Why is anything suddenly expensive? Inflation. Inflation is a never ending thing- unless world ends or a higher form of economic model is introduced.",
        "https://preview.redd.it/jib5ipioiuad1.jpeg?width=1080&format=pjpg&auto=webp&s=8cc3a4dda334cbdce2b28ef36490d16b9e0f5dce",
        "My whole existence, after reading this, seems a lot superfluous and false to me :-)",
        "Le Cafe for the win",
        "This is not true. Cocoa futures shot up at the beginning of the year. You can see the chart shoot up in Jan 2024 (All time high was in April 2024) - https://tradingeconomics.com/commodity/cocoa. Companies also trade in futures contracts so that they can lock in prices for a while into the future.",
        "I bought all of these recently from More Store. I got 1+1 Free on all Amul Chocolates. Cost me 90 a piece.",
        "One just knows they own indentured labourers, there’s no way corporations would let anyone less than a suit in agriculture make above minimum or have dignity.   \nI was primarily wondering about the flow of money, remember the last time onion went up to 150/kg in winter of 2019 early 2020? I witnessed an actual mandi auction and the sheer disparity in prices. The edible poppy seed one is even worse.",
        "What I don't understand is why Amul jacked up prices so much that Bournville is now available at the same price. For Amul, now both 55% and 75% chocolates are now priced at 200 - up from 125 and 140 respectively.  Amul is definitely trying to ramp up its profit margins evn though the cocoa price rise may have affected its production cost.",
        "Either that or Amul, as an Indian company has a much harder time sourcing Cocoa compared to Cadbury which is a British Company owned by a larger corporation such as Mondelez and operates in around 60 countries. The latter likely has access to multiple suppliers and sources.",
        "Correct op , today i was trying to buy Amul chocolate and it was expensive.",
        "Name 1 thing that has become affordable since 2014. I understand inflation but the prices of things(all items in general)are more inflated than govt suggested inflation.",
        "All the snacks already palm oil, vegetable oil. Not sure about overall use in all products , but its very hard to find products without it.",
        "There is a worldwide shortage of chocolate currently",
        "Bruh water is also used in cosmetics industry, now will you say water isn't edible/drinkable 💀",
        "Bro this is the most false equivalent statement in the history of false equivalences....\nAs someone who is working in the cosmetics industry, we are using many cosmetic butters like mango butter, cocoa butter, shea butter, olive butter, avocado butter et. al and the management told that these are not edible..thats why my comment...so associating water in this thread is your intellectual dishonesty, reconsider it",
        "Your management lied out of both side of their faces lmao. Mango butter, shea butter, olive butter and avocado butter are all in fact edible. Most likely y'all are not using food grade versions of these products, which is a completely normal thing in manufacturing.",
        "I think his equivalence  is absolutely correct , as every single  butter you told is edible. Cosmetic brand don't use food grade items ( except may be ultra luxurious ones) may be the water they use in cosmetic is not fit for drinking so they will tell its not drinkable ...does not mean water in general is not drinkable...so the person that commented is intellectually honest.",
        "All of these ingredients are edible..",
        "That also has a price hike.. I remember buying one for 200 rs, now same thing cost around 360",
        "Atleast the single original amul chocolate has cocoa sourced from South India (forgot the name of place) so assuming this has impacted indian production as well or just overall global price increase which could be good for indian plantations.",
        "Small Dairy milk tastes more like flour and oil than chocolate. Also big miss on the main concept of chocolate that it should melt at body temp when you put it in mouth. Even the toblerone for India is a much higher melting point than imported ones.",
        "Palm oil and vegetable oil are not harmful for human health.\n\nPalm oil is mostly disliked because it has a highly negative impact on the environment due to deforestation in areas where it is grown.",
        "Whats off? Looks correct to me",
        "What's not expensive?",
        "Oh damnnn r/confusingperspective",
        "Summers mein Kon khata bro?",
        "https://preview.redd.it/8h9hxyg25wad1.png?width=2110&format=png&auto=webp&s=8e2a8d3a34e49464cb3fb39acf7306dde4c9aac2\n\nThere is your answer. Expect higher prices to continue....",
        "Once the prices go up they never come down the",
        "Global warming",
        "I thought we were atmanirbhar",
        "Same. Always use bigger everything to save on packaging surface area which, let's face it, will end up in landfills or in the sea.",
        "[Garma Garam](https://unctad.org/news/chocolate-price-hikes-bittersweet-reason-care-about-climate-change)",
        "Btw what do you all think of smart bazaar vs dmart",
        "Could be. But I am still confused why the 75% and 55% are now priced the same. If not the extra margins, the only explanation is 55% subsidising the 75% one.",
        "So there's a shortage of Haldiram Soan Papdi too!",
        "We are, op is eating phoren anti national chocolate.",
        "Which is why I have switched to coffee beans and grind my own coffee now🥲",
        "I eat Nestle Bar One. Rs. 5. \n\nDinner ke baad kuch meetha for us working class.",
        "Real choc is expensive bcs cocoa is more expensive than it used to be. Mostly these days though it's not real choc",
        "Cocoa production issues from Africa.",
        "Amul small dark chocolate went from 25 to 45",
        "https://preview.redd.it/9uy0gnvxmbbd1.png?width=1080&format=pjpg&auto=webp&s=b198eb7fbd7ffb44122294ce21bb86581011b1ec\n\nThere's been a cocoa shortage for 3 straight years in a row now.",
        "Okay unkill"
    ],
    "cleaned_text": "chocolate suddenly expensive usually buy chocolates month ive always paid around inr favorite dark bitter chocolate past weeks ive noticed prices shot significantly dark chocolate even milk chocolatesdoes anyone reason behind ",
    "cleaned_title": "chocolate suddenly expensive",
    "cleaned_selftext": "usually buy chocolates month ive always paid around inr favorite dark bitter chocolate past weeks ive noticed prices shot significantly dark chocolate even milk chocolatesdoes anyone reason behind",
    "cleaned_comments": "massive heat surge induced drought west africa cocoa crops took hit since companies pay hike prices inevitably pass end consumers add already mentioned post amul dairy milk two chocolates among popular ones check list ingredients find cocoa butter listed instead vegetable oil aka palm oilpalmolein cocoa supply cant meet global demand due reason cited post prices go ayo padosi dilli wali dairy milk kha le bhai ya phir star airtel jio increased tariffs amul cadbury like eclairs kha le bhai kyonki har chiz adani aur ambani hi toh bech rahe hai cocoa shortage funnily though would expected impact future pricing current pricing possible trying get ahead demand remember price always maximum customers willing bear bhai im sitting interlaken lindt ki chocolates prices months back still rs boy volume shrunk nothing dreaded future climate change climate change true prices increased theyll stay even input costs go future even cost instant coffee doubled bru gm pack come rs indian consumers complain price rise stop paying companies would start increase palm oil content know harmful amul chocolate crap yes cocoa prices went almost x matter months reason companies could prices stable till past contracts buffer stocks supply crunch doesnt seem go away anytime soon anyone notice fuckall discount math categorise compound chocolate consumers might care affect brand also non palm oil hydrogenated fat ones life still using rupees sachets simple demand supply almost sugar fruits khao khud jaan jao amul dark chocolate went could coco shortage demand maybe food guy dark chocolate review told amul best thats chocolate nt bol bhai sugar candy flavour hoti h wo heatwave fungus infection thats morde chocolate spokesperson told elections everything becomes expensive use common sense true taste gone shit well rich people never bought chocolate worth rs years adds plastic wastage avoid little pouches coffeeshampoo etc use travelling adding drought speculative frenzy cocoa futures drove prices even price increase caused supply shortfall yes lot caused greedy commodity traders like guy knows gk wish thered people like reddit spewing facts instead useless crass half arsed opinion pieces shortage happening since last two years thats youre seeing increase current prices prices chocolates rise reduce cocoa prices become stable cocoa farmers west africa facing issues last decade many switched cash crops like rubber time theres deficit demand grows hyper consumerism social media chocolate companies want keep consumer prices somewhat stable end result small rate hikes less cocoa per bar bigger gaps segments overall quantity lowered without helping farmers deal effects climate change biggest orgs managed still take billion dollar profits would rather farmers keep supply using cheap child labour depressing eat chikki bro suddenly good news sources talking last decade worse yet come house always wins consumer pays days cant even speak wallet yeah prices shot drastically wonder much truly trickled farmers plantation owners cocoa butter edibleif ingredients list better avoid cocoa butter used cosmetics industry oh sympathy plantation owners cocoa harvesting incredibly exploitative industry workers make squat plantations owned big corpos lot also allegedly employ indentured workers even children anything suddenly expensive inflation inflation never ending thing unless world ends higher form economic model introduced whole existence reading seems lot superfluous false le cafe win true cocoa futures shot beginning year see chart shoot jan time high april companies also trade futures contracts lock prices future bought recently store got free amul chocolates cost piece one knows indentured labourers theres way corporations would let anyone less suit agriculture make minimum dignity primarily wondering flow money remember last time onion went kg winter early witnessed actual mandi auction sheer disparity prices edible poppy seed one even worse dont understand amul jacked prices much bournville available price amul chocolates priced respectively amul definitely trying ramp profit margins evn though cocoa price rise may affected production cost either amul indian company much harder time sourcing cocoa compared cadbury british company owned larger corporation mondelez operates around countries latter likely access multiple suppliers sources correct op today trying buy amul chocolate expensive name thing become affordable since understand inflation prices thingsall items generalare inflated govt suggested inflation snacks already palm oil vegetable oil sure overall use products hard find products without worldwide shortage chocolate currently bruh water also used cosmetics industry say water isnt edibledrinkable bro false equivalent statement history false equivalences someone working cosmetics industry using many cosmetic butters like mango butter cocoa butter shea butter olive butter avocado butter et al management told ediblethats commentso associating water thread intellectual dishonesty reconsider management lied side faces lmao mango butter shea butter olive butter avocado butter fact edible likely yall using food grade versions products completely normal thing manufacturing think equivalence absolutely correct every single butter told edible cosmetic brand dont use food grade items except may ultra luxurious ones may water use cosmetic fit drinking tell drinkable mean water general drinkableso person commented intellectually honest ingredients edible also price hike remember buying one rs thing cost around atleast single original amul chocolate cocoa sourced south india forgot name place assuming impacted indian production well overall global price increase could good indian plantations small dairy milk tastes like flour oil chocolate also big miss main concept chocolate melt body temp put mouth even toblerone india much higher melting point imported ones palm oil vegetable oil harmful human health palm oil mostly disliked highly negative impact environment due deforestation areas grown whats looks correct whats expensive oh damnnn rconfusingperspective summers mein kon khata bro answer expect higher prices continue prices go never come global warming thought atmanirbhar always use bigger everything save packaging surface area lets face end landfills sea garma garamhttpsunctadorgnewschocolatepricehikesbittersweetreasoncareaboutclimatechange btw think smart bazaar vs dmart could still confused priced extra margins explanation subsidising one theres shortage haldiram soan papdi op eating phoren anti national chocolate switched coffee beans grind coffee eat nestle bar one rs dinner ke baad kuch meetha us working class real choc expensive bcs cocoa expensive used mostly days though real choc cocoa production issues africa amul small dark chocolate went theres cocoa shortage straight years row okay unkill",
    "light_cleaned_title": "Why are chocolate suddenly so expensive",
    "light_cleaned_selftext": "I usually buy chocolates each month, and I've always paid around 120-150 INR for my favorite dark bitter chocolate. But over the past few weeks, I've noticed that the prices have shot up significantly, not just for dark chocolate but even for milk chocolates.does anyone any reason behind this.",
    "light_cleaned_comments": "There was a massive heat surge induced drought in west Africa, cocoa crops took a hit, since companies have to pay for the hike in prices they inevitably will pass it on to the end consumers. This ⬆️ To add to what is already mentioned in the post above, Amul and Dairy Milk are two chocolates among the popular ones where if you check the list of ingredients you will find cocoa butter listed (instead of Vegetable oil aka Palm Oil/Palmolein). So when cocoa supply can't meet the global demand due to the reason cited in the post above, prices go up. Ayo padosi Dilli 34 🤝🏻 10 wali dairy milk kha le bhai ya phir 5star Airtel, Jio increased their tariffs... Amul & cadbury be like.. Why not!? 😂 /S Eclairs kha le bhai Kyonki har chiz adani aur ambani hi toh bech rahe hai Cocoa shortage. Funnily though, I would have expected it to impact future pricing, not current pricing. It’s possible they are trying to get ahead of the demand. Remember, price will always be the maximum that customers are willing to bear. Bhai im sitting in interlaken, Lindt ki chocolates are the same prices as 8 months back- why? Those are still rs.10 but boy has the volume shrunk down to nothing. We're in that dreaded future. Climate change Climate change True. But now that the prices have increased, they'll stay up even if input costs go down in the future. Even the cost of instant coffee has doubled. Bru 50gm pack come for Rs.160 And when Indian consumers complain about this price rise and stop paying, companies would start to increase the palm oil content which we all know is harmful. Amul chocolate is crap Yes, cocoa prices went almost 3X in a matter of months. Only reason the companies could prices stable till now was past contracts and buffer stocks. Now there is a supply crunch which doesn't seem to go away anytime soon. Did anyone notice the fuckall discount math ? 👀 Which then should categorise them as compound chocolate. Most consumers might not care but it will affect the brand. Also these are non palm oil or hydrogenated fat ones so…… such is life Me still using 2 rupees sachets..... Simple demand and supply Those are almost all sugar Fruits khao, khud jaan jao... Amul dark chocolate went from 120 to 200 at once It could be coco shortage, more demand, or maybe the that food guy did dark chocolate review and told Amul 75% was best that's why.? Chocolate nt bol bhai, sugar candy with flavour hoti h wo. Heatwave and a fungus infection. That's what a Morde chocolate spokesperson told me. After elections, everything becomes expensive. Use common sense. True. Taste has gone to shit as well. Rich people. I never bought chocolate worth more than 20 Rs in 30 years But then it adds to plastic wastage. So I avoid little pouches of coffee/shampoo etc. and only use them while travelling. Adding to this, because of that drought, there was a speculative frenzy on cocoa futures that drove up the prices even more. Some of this price increase was caused by the supply shortfall, yes, but a lot of it was caused by greedy commodity traders. I like this guy, knows his GK. I wish there'd be more people like him in reddit, spewing facts instead of useless crass and half arsed opinion pieces. The shortage has been happening since the last two years and that's why you're seeing an increase in current prices. But once the prices of the chocolates rise, will they reduce it when the cocoa prices become stable? Cocoa farmers in West Africa have been facing issues for the last decade. Many have switched to cash crops like rubber over time. So there's a deficit while demand grows with hyper consumerism and social media. The chocolate companies want to keep consumer prices somewhat stable, so end result: small rate hikes, less cocoa per bar, bigger gaps between segments so overall quantity can be lowered. This is all without helping the farmers deal with the effects of climate change. Some of the biggest orgs have managed to still take in billion dollar profits, but would rather farmers keep up supply by using cheap child labour. It's depressing. Eat Chikki Bro Suddenly? All good news sources are talking about it for the last decade Worse is yet to come House always wins, consumer pays, these days you can’t even speak with your wallet. Yeah the prices just shot up!! And that too drastically ;_; I wonder how much truly trickled down to the farmers and plantation owners. But cocoa butter is not edible..if it is in ingredients list then better to avoid it. Cocoa butter is used in cosmetics industry Oh no sympathy for plantation owners, cocoa harvesting is an incredibly exploitative industry. Workers make squat while most plantations are owned by big corpos. A lot of them also allegedly employ indentured workers and even children. Why is anything suddenly expensive? Inflation. Inflation is a never ending thing- unless world ends or a higher form of economic model is introduced. My whole existence, after reading this, seems a lot superfluous and false to me :-) Le Cafe for the win This is not true. Cocoa futures shot up at the beginning of the year. You can see the chart shoot up in Jan 2024 (All time high was in April 2024) - Companies also trade in futures contracts so that they can lock in prices for a while into the future. I bought all of these recently from More Store. I got 1+1 Free on all Amul Chocolates. Cost me 90 a piece. One just knows they own indentured labourers, there’s no way corporations would let anyone less than a suit in agriculture make above minimum or have dignity. I was primarily wondering about the flow of money, remember the last time onion went up to 150/kg in winter of 2019 early 2020? I witnessed an actual mandi auction and the sheer disparity in prices. The edible poppy seed one is even worse. What I don't understand is why Amul jacked up prices so much that Bournville is now available at the same price. For Amul, now both 55% and 75% chocolates are now priced at 200 - up from 125 and 140 respectively. Amul is definitely trying to ramp up its profit margins evn though the cocoa price rise may have affected its production cost. Either that or Amul, as an Indian company has a much harder time sourcing Cocoa compared to Cadbury which is a British Company owned by a larger corporation such as Mondelez and operates in around 60 countries. The latter likely has access to multiple suppliers and sources. Correct op , today i was trying to buy Amul chocolate and it was expensive. Name 1 thing that has become affordable since 2014. I understand inflation but the prices of things(all items in general)are more inflated than govt suggested inflation. All the snacks already palm oil, vegetable oil. Not sure about overall use in all products , but its very hard to find products without it. There is a worldwide shortage of chocolate currently Bruh water is also used in cosmetics industry, now will you say water isn't edible/drinkable 💀 Bro this is the most false equivalent statement in the history of false equivalences.... As someone who is working in the cosmetics industry, we are using many cosmetic butters like mango butter, cocoa butter, shea butter, olive butter, avocado butter et. al and the management told that these are not edible..thats why my comment...so associating water in this thread is your intellectual dishonesty, reconsider it Your management lied out of both side of their faces lmao. Mango butter, shea butter, olive butter and avocado butter are all in fact edible. Most likely y'all are not using food grade versions of these products, which is a completely normal thing in manufacturing. I think his equivalence is absolutely correct , as every single butter you told is edible. Cosmetic brand don't use food grade items ( except may be ultra luxurious ones) may be the water they use in cosmetic is not fit for drinking so they will tell its not drinkable ...does not mean water in general is not drinkable...so the person that commented is intellectually honest. All of these ingredients are edible.. That also has a price hike.. I remember buying one for 200 rs, now same thing cost around 360 Atleast the single original amul chocolate has cocoa sourced from South India (forgot the name of place) so assuming this has impacted indian production as well or just overall global price increase which could be good for indian plantations. Small Dairy milk tastes more like flour and oil than chocolate. Also big miss on the main concept of chocolate that it should melt at body temp when you put it in mouth. Even the toblerone for India is a much higher melting point than imported ones. Palm oil and vegetable oil are not harmful for human health. Palm oil is mostly disliked because it has a highly negative impact on the environment due to deforestation in areas where it is grown. Whats off? Looks correct to me What's not expensive? Oh damnnn r/confusingperspective Summers mein Kon khata bro? There is your answer. Expect higher prices to continue.... Once the prices go up they never come down the Global warming I thought we were atmanirbhar Same. Always use bigger everything to save on packaging surface area which, let's face it, will end up in landfills or in the sea. [Garma Garam](https://unctad.org/news/chocolate-price-hikes-bittersweet-reason-care-about-climate-change) Btw what do you all think of smart bazaar vs dmart Could be. But I am still confused why the 75% and 55% are now priced the same. If not the extra margins, the only explanation is 55% subsidising the 75% one. So there's a shortage of Haldiram Soan Papdi too! We are, op is eating phoren anti national chocolate. Which is why I have switched to coffee beans and grind my own coffee now🥲 I eat Nestle Bar One. Rs. 5. Dinner ke baad kuch meetha for us working class. Real choc is expensive bcs cocoa is more expensive than it used to be. Mostly these days though it's not real choc Cocoa production issues from Africa. Amul small dark chocolate went from 25 to 45 There's been a cocoa shortage for 3 straight years in a row now. Okay unkill"
}