{
    "id": "18l92b5",
    "title": "In Unprecedented Move, Close To 100 MPs Suspended From Parliament",
    "url": "https://www.ndtv.com/india-news/over-30-opposition-mps-suspended-from-lok-sabha-for-causing-disruption-4696264/amp/1",
    "selftext": "Is this some kind of a joke going on? 100 MPs suspended for the remaining session of the Parliament. To anyone who used to follow the political affairs of the country before 2014 would know that when NDA was in opposition there used to be far more chaos than what it is now. This isn’t a great sign for a healthy democracy. This is bizarre and I believe it’s just a sign of what’s in store for next 5 years at the very least.",
    "flair": "Politics",
    "score": 913,
    "num_comments": 81,
    "created_utc": 1702907164.0,
    "convurl": "https://external-preview.redd.it/teZMu2ppW1mneCTMtR4EpjGMYOd_nsUFijzJNPza1O4.jpg?auto=webp&s=3fd73fb65c6493421699a39c2432ca15ad602135",
    "comments": [
        "We will soon have 👑 King , that day is not far.",
        "Mother of democracy",
        "Democracy ki ass me sengol",
        "After 2024, elections will be cancelled.",
        "Why cancel elections when you can win overwhelming majority and then rule. Legitimizes majoritarian politics.",
        "and his name is ModiXi, now say our king’s name.",
        "Atp parliament is a joke",
        "You’re talking about hindutva? Makes sense .but only after they win …. They need an excuse no? At some point I expect some pandits and  gurus to come and sit in the parliament too",
        "The madarchods of democracy",
        "At this point, this was expected of them.\nNow they will introduce new bill and clear it without any logical debate.",
        "Maaa... Kaaa.. Democracy",
        "This is emergency level bullshit",
        "sab suspend ho jayega sirf rajesh bidhuri bachega",
        "If they are suspending MPs then they plan to push through some very big bills or something even bigger than demonitisation.",
        "Ya something similar happened with another bill in the past. I guess it was a finance bill",
        "Adhani-Ambhani",
        "India it would  seem is in a state of undeclared emergency",
        "One day only Narendra will sit in the parliament with his crocodiles.",
        "Next time india wants to win the cricket trophy completely ban the other team ... Easy win",
        "Nooooo, **RAAW Agent Salman Shahkrukh Pathaan Tiger Kabir Singh  Kumar aka Shaktiman 2.0** is on top secret mission to stop this, u will soon hear about it in a screen close stay tuned",
        "Nah game of thrones type dragons",
        "Does anyone know how they can just suspend MPs? What a glaring loophole",
        "The Congress was trying to do that in the first 10-15 years of power",
        "So that's the reason they had  Sengol installed there.",
        "This reminds me of an Old Bollywood saying \"If at first you dod not succeed, destroy some1 else's career - bhai",
        "Why are they suspended?",
        "Now govt can pass bills without objection.",
        "Anything we can do about it?",
        "It’s scary to see how we’re moving in a direction similar to Chinese dictatorship except at a slower growth rate and extremely high debt",
        "Isn't it this? [https://economictimes.indiatimes.com/industry/telecom/telecom-policy/ashwini-vaishnaw-tables-telecommunications-bill-2023-in-lok-sabha/articleshow/106081142.cms](https://economictimes.indiatimes.com/industry/telecom/telecom-policy/ashwini-vaishnaw-tables-telecommunications-bill-2023-in-lok-sabha/articleshow/106081142.cms)",
        "Yogi was MP before becoming UP CM. Religious leaders and priests have been sitting in Parliament since independence.",
        "Aren't they pushing bills that change the power over the Election comissioner?",
        "The chappalchors of democracy",
        "Not as a representative. I mean as separate category…. Yogi is still an elected representative",
        "India is becoming a Hindu theocracy. The CCP for all it's many faults did end the caste system and blow up temples.",
        "Nope.. Some major bills that require 2/3 votes of present members of parliament. Like constitution changes, rules regarding supreme etc.",
        "Why even have a parliament? /s",
        "Oh good to know, thanks.",
        "These are merely the servants blame it on the adanis and the ambanis who are making them do this and controlling the country",
        "cheechleather of democracy",
        "Source: WhatsApp Shakha University",
        "Also almost eradicated poverty and increased middle class rate from less than 2% to over 50% now. \n\nWith India it's all the dictatorship devloping without the actual state much.",
        "\"MODIIII MODIIII\n\n15000 KA AATTTA KHAREEDUNGA\n\nG20 ORGANIZE KARAAA\n\nMODIIIIII MODIIII \"",
        "Elections to be declared soon ?",
        "Does these MPs behave or just shout?",
        "Sham democracy. The opposition and media should be holding a million man march ASAP.",
        "That happened in May 2014. You haven't been told about it yet.",
        "Hijdon ka desh hai. Kisi ko kuch fark nahi padta. Roj g@#$ marwaa rahe hai khushi khushi.",
        "The opposition was demanding answers on how the parliament got attacked by a bunch of nobodies and how they got a pass to enter from a BJP MP. Long story short, they created a ruckus over it (which is totally justified) as BJP was not giving any response and the speakers (Om Birla and Jagdeep Dhankhar, both affiliated to BJP of course) decided to suspend them.",
        "I am wondering if some major law is going to be passed soon.",
        "Junta gets boners when opposition MPs are suspended. They are going to celebrate when it's just one party ordering them to bend over",
        "Lol exactly",
        "hail narendra...",
        "50 Shades of Democracy!",
        "So is it just the Hindus making laws? When do they plan on suspending the constitution? I need to figure out a way out of this shithole.",
        ">  \"The government cannot intervene in (responsibilities of) Lok Sabha secretariat. We will not allow that either,\" he said last week.   \n\nWe only interfere in democratically elected non-BJP governments functionaing. Everything is for our convenience and gains.",
        "The 100 MPs have been fortunate enough to only face suspension under the Supreme leader regime",
        "One day?i think isi season me dekhne ko miljayega",
        "Come together, protest, get thrown into jail.",
        "Many of our freedom fighters were thrown into jail for doing what's right for them. And nowadays, many people who do wrong unto others, never go to jail. So maybe going to jail isn't that bad. \n\nSo, if getting together and protesting can actually help, I'm all for it!",
        "Bro we had a protest scheduled in college regarding molestation of a fellow student. The Vice president of student council was all in to stay for as long as the culprits(turns out they had political backup) aren't caught. \n\nWell, 1000 people showed up initially, but by the end of the day a laughable few remained(Yeah the policemen were laughing at the strength) coz everybody had 'exams'\n\nI was the crazy one who wanted to stay. My friends and others were very clearly not. Nobody cared for justice or the girl. Exams after all, are priority.\n\nLikewise will happen here.",
        "And why would they do that? People will simply vote them in. You guys are making this more complicated than it ever will be. Its much simpler than we think",
        "lol. I meant when will we become a theocracy….",
        "It is much easier to fight when the enemies don't look like you.\n\nBhagat Singh had direct and indirect support of most of India. Today's Bhagat Singh would be shot after he objects to the anything bad the local politician does.\n\nIf he somehow didn't die and started raising issues at national level then UAPA will be slapped on him and he will remain in jail because the Supreme court will keep adjourning and giving new dates.",
        "Main Hi Raja        Main Hi Mantri         Mai Hi Praja       season 2",
        "Bruh your comment makes British occupiers more compassionate than the thing ruling us right now.",
        "I get that part. The whole point of a democracy is that the majority cannot disenfranchise the minority, which is what just happened. What is the law that allows this to happen, who thought it was a good idea to put it there, and how can the law be changed?",
        "Actually, the Speaker of the house has the power to suspend someone given a \"valid reason\". Not just opposition, but the government's MPs can also be suspended.\n\nI think the problem here is how the speaker is chosen. Jagdeep Dhankhar and Om Birla have and will be biased towards BJP and so would never take action against them. Ramesh Bidhuri who abused a fellow MP in the parliament got away without any action taken on him. Opposition's mics have been turned off on many occasions. We need a better way to elect an unbiased speaker in the houses.",
        "The best part is almost all the voters of BJP has no problem with this."
    ],
    "cleaned_text": "unprecedented move close mps suspended parliament kind joke going mps suspended remaining session parliament anyone used follow political affairs country would know nda opposition used far chaos isnt great sign healthy democracy bizarre believe sign whats store next years least ",
    "cleaned_title": "unprecedented move close mps suspended parliament",
    "cleaned_selftext": "kind joke going mps suspended remaining session parliament anyone used follow political affairs country would know nda opposition used far chaos isnt great sign healthy democracy bizarre believe sign whats store next years least",
    "cleaned_comments": "soon king day far mother democracy democracy ki ass sengol elections cancelled cancel elections win overwhelming majority rule legitimizes majoritarian politics name modixi say kings name atp parliament joke youre talking hindutva makes sense win need excuse point expect pandits gurus come sit parliament madarchods democracy point expected introduce new bill clear without logical debate maaa kaaa democracy emergency level bullshit sab suspend ho jayega sirf rajesh bidhuri bachega suspending mps plan push big bills something even bigger demonitisation ya something similar happened another bill past guess finance bill adhaniambhani india would seem state undeclared emergency one day narendra sit parliament crocodiles next time india wants win cricket trophy completely ban team easy win nooooo raaw agent salman shahkrukh pathaan tiger kabir singh kumar aka shaktiman top secret mission stop u soon hear screen close stay tuned nah game thrones type dragons anyone know suspend mps glaring loophole congress trying first years power thats reason sengol installed reminds old bollywood saying first dod succeed destroy elses career bhai suspended govt pass bills without objection anything scary see moving direction similar chinese dictatorship except slower growth rate extremely high debt isnt httpseconomictimesindiatimescomindustrytelecomtelecompolicyashwinivaishnawtablestelecommunicationsbillinloksabhaarticleshowcmshttpseconomictimesindiatimescomindustrytelecomtelecompolicyashwinivaishnawtablestelecommunicationsbillinloksabhaarticleshowcms yogi mp becoming cm religious leaders priests sitting parliament since independence arent pushing bills change power election comissioner chappalchors democracy representative mean separate category yogi still elected representative india becoming hindu theocracy ccp many faults end caste system blow temples nope major bills require votes present members parliament like constitution changes rules regarding supreme etc even parliament oh good know thanks merely servants blame adanis ambanis making controlling country cheechleather democracy source whatsapp shakha university also almost eradicated poverty increased middle class rate less india dictatorship devloping without actual state much modiiii modiiii ka aattta khareedunga g organize karaaa modiiiiii modiiii elections declared soon mps behave shout sham democracy opposition media holding million man march asap happened may havent told yet hijdon ka desh hai kisi ko kuch fark nahi padta roj g marwaa rahe hai khushi khushi opposition demanding answers parliament got attacked bunch nobodies got pass enter bjp mp long story short created ruckus totally justified bjp giving response speakers om birla jagdeep dhankhar affiliated bjp course decided suspend wondering major law going passed soon junta gets boners opposition mps suspended going celebrate one party ordering bend lol exactly hail narendra shades democracy hindus making laws plan suspending constitution need figure way shithole government intervene responsibilities lok sabha secretariat allow either said last week interfere democratically elected nonbjp governments functionaing everything convenience gains mps fortunate enough face suspension supreme leader regime one dayi think isi season dekhne ko miljayega come together protest get thrown jail many freedom fighters thrown jail whats right nowadays many people wrong unto others never go jail maybe going jail isnt bad getting together protesting actually help im bro protest scheduled college regarding molestation fellow student vice president student council stay long culpritsturns political backup arent caught well people showed initially end day laughable remainedyeah policemen laughing strength coz everybody exams crazy one wanted stay friends others clearly nobody cared justice girl exams priority likewise happen would people simply vote guys making complicated ever much simpler think lol meant become theocracy much easier fight enemies dont look like bhagat singh direct indirect support india todays bhagat singh would shot objects anything bad local politician somehow didnt die started raising issues national level uapa slapped remain jail supreme court keep adjourning giving new dates main hi raja main hi mantri mai hi praja season bruh comment makes british occupiers compassionate thing ruling us right get part whole point democracy majority disenfranchise minority happened law allows happen thought good idea put law changed actually speaker house power suspend someone given valid reason opposition governments mps also suspended think problem speaker chosen jagdeep dhankhar om birla biased towards bjp would never take action ramesh bidhuri abused fellow mp parliament got away without action taken oppositions mics turned many occasions need better way elect unbiased speaker houses best part almost voters bjp problem",
    "light_cleaned_title": "In Unprecedented Move, Close To 100 MPs Suspended From Parliament",
    "light_cleaned_selftext": "Is this some kind of a joke going on? 100 MPs suspended for the remaining session of the Parliament. To anyone who used to follow the political affairs of the country before 2014 would know that when NDA was in opposition there used to be far more chaos than what it is now. This isn’t a great sign for a healthy democracy. This is bizarre and I believe it’s just a sign of what’s in store for next 5 years at the very least.",
    "light_cleaned_comments": "We will soon have 👑 King , that day is not far. Mother of democracy Democracy ki ass me sengol After 2024, elections will be cancelled. Why cancel elections when you can win overwhelming majority and then rule. Legitimizes majoritarian politics. and his name is ModiXi, now say our king’s name. Atp parliament is a joke You’re talking about hindutva? Makes sense .but only after they win …. They need an excuse no? At some point I expect some pandits and gurus to come and sit in the parliament too The madarchods of democracy At this point, this was expected of them. Now they will introduce new bill and clear it without any logical debate. Maaa... Kaaa.. Democracy This is emergency level bullshit sab suspend ho jayega sirf rajesh bidhuri bachega If they are suspending MPs then they plan to push through some very big bills or something even bigger than demonitisation. Ya something similar happened with another bill in the past. I guess it was a finance bill Adhani-Ambhani India it would seem is in a state of undeclared emergency One day only Narendra will sit in the parliament with his crocodiles. Next time india wants to win the cricket trophy completely ban the other team ... Easy win Nooooo, **RAAW Agent Salman Shahkrukh Pathaan Tiger Kabir Singh Kumar aka Shaktiman 2.0** is on top secret mission to stop this, u will soon hear about it in a screen close stay tuned Nah game of thrones type dragons Does anyone know how they can just suspend MPs? What a glaring loophole The Congress was trying to do that in the first 10-15 years of power So that's the reason they had Sengol installed there. This reminds me of an Old Bollywood saying \"If at first you dod not succeed, destroy some1 else's career - bhai Why are they suspended? Now govt can pass bills without objection. Anything we can do about it? It’s scary to see how we’re moving in a direction similar to Chinese dictatorship except at a slower growth rate and extremely high debt Isn't it this? [https://economictimes.indiatimes.com/industry/telecom/telecom-policy/ashwini-vaishnaw-tables-telecommunications-bill-2023-in-lok-sabha/articleshow/106081142.cms](https://economictimes.indiatimes.com/industry/telecom/telecom-policy/ashwini-vaishnaw-tables-telecommunications-bill-2023-in-lok-sabha/articleshow/106081142.cms) Yogi was MP before becoming UP CM. Religious leaders and priests have been sitting in Parliament since independence. Aren't they pushing bills that change the power over the Election comissioner? The chappalchors of democracy Not as a representative. I mean as separate category…. Yogi is still an elected representative India is becoming a Hindu theocracy. The CCP for all it's many faults did end the caste system and blow up temples. Nope.. Some major bills that require 2/3 votes of present members of parliament. Like constitution changes, rules regarding supreme etc. Why even have a parliament? /s Oh good to know, thanks. These are merely the servants blame it on the adanis and the ambanis who are making them do this and controlling the country cheechleather of democracy Source: WhatsApp Shakha University Also almost eradicated poverty and increased middle class rate from less than 2% to over 50% now. With India it's all the dictatorship devloping without the actual state much. \"MODIIII MODIIII 15000 KA AATTTA KHAREEDUNGA G20 ORGANIZE KARAAA MODIIIIII MODIIII \" Elections to be declared soon ? Does these MPs behave or just shout? Sham democracy. The opposition and media should be holding a million man march ASAP. That happened in May 2014. You haven't been told about it yet. Hijdon ka desh hai. Kisi ko kuch fark nahi padta. Roj g@#$ marwaa rahe hai khushi khushi. The opposition was demanding answers on how the parliament got attacked by a bunch of nobodies and how they got a pass to enter from a BJP MP. Long story short, they created a ruckus over it (which is totally justified) as BJP was not giving any response and the speakers (Om Birla and Jagdeep Dhankhar, both affiliated to BJP of course) decided to suspend them. I am wondering if some major law is going to be passed soon. Junta gets boners when opposition MPs are suspended. They are going to celebrate when it's just one party ordering them to bend over Lol exactly hail narendra... 50 Shades of Democracy! So is it just the Hindus making laws? When do they plan on suspending the constitution? I need to figure out a way out of this shithole. > \"The government cannot intervene in (responsibilities of) Lok Sabha secretariat. We will not allow that either,\" he said last week. We only interfere in democratically elected non-BJP governments functionaing. Everything is for our convenience and gains. The 100 MPs have been fortunate enough to only face suspension under the Supreme leader regime One day?i think isi season me dekhne ko miljayega Come together, protest, get thrown into jail. Many of our freedom fighters were thrown into jail for doing what's right for them. And nowadays, many people who do wrong unto others, never go to jail. So maybe going to jail isn't that bad. So, if getting together and protesting can actually help, I'm all for it! Bro we had a protest scheduled in college regarding molestation of a fellow student. The Vice president of student council was all in to stay for as long as the culprits(turns out they had political backup) aren't caught. Well, 1000 people showed up initially, but by the end of the day a laughable few remained(Yeah the policemen were laughing at the strength) coz everybody had 'exams' I was the crazy one who wanted to stay. My friends and others were very clearly not. Nobody cared for justice or the girl. Exams after all, are priority. Likewise will happen here. And why would they do that? People will simply vote them in. You guys are making this more complicated than it ever will be. Its much simpler than we think lol. I meant when will we become a theocracy…. It is much easier to fight when the enemies don't look like you. Bhagat Singh had direct and indirect support of most of India. Today's Bhagat Singh would be shot after he objects to the anything bad the local politician does. If he somehow didn't die and started raising issues at national level then UAPA will be slapped on him and he will remain in jail because the Supreme court will keep adjourning and giving new dates. Main Hi Raja Main Hi Mantri Mai Hi Praja season 2 Bruh your comment makes British occupiers more compassionate than the thing ruling us right now. I get that part. The whole point of a democracy is that the majority cannot disenfranchise the minority, which is what just happened. What is the law that allows this to happen, who thought it was a good idea to put it there, and how can the law be changed? Actually, the Speaker of the house has the power to suspend someone given a \"valid reason\". Not just opposition, but the government's MPs can also be suspended. I think the problem here is how the speaker is chosen. Jagdeep Dhankhar and Om Birla have and will be biased towards BJP and so would never take action against them. Ramesh Bidhuri who abused a fellow MP in the parliament got away without any action taken on him. Opposition's mics have been turned off on many occasions. We need a better way to elect an unbiased speaker in the houses. The best part is almost all the voters of BJP has no problem with this."
}