{
    "id": "1drd2tt",
    "title": "Mandatory GPS enabled monitoring of all motor vehicles proposed.",
    "url": "https://www.business-standard.com/industry/news/insurers-eye-windfall-from-proposed-satellite-based-toll-collection-system-124062701032_1.html",
    "selftext": "Mandatory 24*7 monitoring of all motor vehicles proposed by affecting amendment to the CMVR act and installation of GPS module.\n\nPrevious post deleted on account of breaking subreddit postimg rules hence reposting.",
    "flair": "Law & Courts",
    "score": 350,
    "num_comments": 67,
    "created_utc": 1719673158.0,
    "convurl": "https://external-preview.redd.it/3dQ1qMIJuKfEc0MqpqkmeqxcmNh-9RRxpZVbbyuBOgs.jpg?auto=webp&s=b7677e9a03bde606143e9e3a4070b1ee3c978ec8",
    "comments": [
        "You posting the same stuff again and again?",
        "Kindly read the last line of my post.",
        "Why GPS? Why not our own navic system ?",
        "Paywall ",
        "GPS is nowadays a colloquial word.",
        "And there's not a thing we can do to avoid it. Enshitification of everything",
        "Indian tech be like.. mai iska spoof karne ka app banayega.. find all vehicles in Pacific Ocean..",
        "They will probably install it inside the ecu so that any alteration will lead to voiding of insurance and make it illegal to ply (like for trucks and buses).",
        "more taxes and automatic fines for speeding.",
        "Good move for privacy /s",
        "more than half of the navic satellites are non functional due to clock failure",
        "RIP. Really? :(",
        "Use smart license as card to start vehicle. Gps will pr9v8de behavipjr patterns. Crime rate will fall as CID can track phone location and vehicle both.",
        "Ache din",
        "They can't even enforce backlights on all vehicles",
        "This is a huge privacy issue.",
        "Wait till someone comes up with shitty advantages off this feature",
        "Speeding fine to be automatic now\n\nWow",
        "what privacy? /s",
        "only 4 or 5 out of 9 satellites are functional right now",
        "Wait till you know about third party hsrp apps available on playstore.",
        "They can't make basic improvements to road and transport infra, quality of roads keeps falling instead of improving, most Indian cities have no public transport infra worth talking about, trains run late, traffic lights don't work, streets are dark, but wait, we have a more important problem to solve, we need to track the movements of all private individuals in the country.",
        "We crossed the privacy barrier a long time ago.",
        "Oh they have. They're saying elsewhere how it's gonna decrease insurance rates by a massive 5% across the board.",
        "Or to catch those ‘influential’ hit-and-run drivers",
        "FUCK THAT!",
        "Survey that will put China to shame.",
        "Oh totally not.\n\nIn china the govt mandates installation of govt issued apps, they are to be mandatorily present in your phone in many states. Some children have been found to have reported to the cops that their parents have secret phone or had the app removed etc and their parents got arrested.\n\nChina is like the ultimate .",
        "Pretty sure wouldn't stand in court..",
        "Aadhar also wasn't supposed to stand in court but now it's standing on our chest.",
        "A website called remove paywall doot com doesn't work. Don't try it. I mean it, dear reddit overlords.",
        "We got the same during covid did we not?",
        "but this is the first policy insurance that'll get affected, right and not the third party?",
        "Who did what? \n\nIdk who all are installing govt apps, but I make sure to never install stuff like digilocker and crap.\n\nFortunately not needed to install crap.\n\nDuring COVID if anyone asked std excuse was we don't have phone.",
        "Why don’t they start with railways first.",
        "Won't be surprised if they eventually start charging usage of regular non-toll roads in the name of maintenance charges.",
        "Right to privacy is a fundamental right. I don't understand how this shit will get approval",
        "Well that's what they all said during aadhar, and look at us anywhere you go they'll reject you saying need aadhar .\nSchool college bank income tax driving license etc etc",
        "Ugh aadhar was not against right to privacy. One can argue but it's a weak case. But this is like a clear violation of right to privacy. I'm sure it won't uphold in court.",
        "They will say we will keep data encrypted by Vedic maths behind 52 feet wall and chanachur of supreme kotha fame pighal jayega",
        "Time to research on GPS jammers..",
        "Can be bought for 1000 usd but please don't use ever.\n\nLast time I researched I got to know a lot of things rely on gps signals.\n\nLook up on google what happens when you do gps jamming.\n\nSome truck driver managed to regularly crash the whole airport system in usa unknowingly.",
        "Stop giving them ideas /s",
        "I flew in during COVID, the guys at the airport forbade me from going any futther than the gate till I installed the app.",
        "And you decided to do so.\n\nYou're already in india what would they do expel you to Pakistan.\n\nThey tried such tactics with me while travelling interstate I said fine I'll wait on this side of the state, in the end let me go for 200 rupaiya.",
        "So let me get this straight: I was supposed to make a scene at the airport with the airport officials? I’d much rather retain my right to leave/enter the country than being marked as a national security threat.",
        "After second wave I was not allowed entry into malls without Arogyasetu app. What is ironic after everyone was infected and the wave was over did they start imposing these rules.",
        "Impossible. I could go I just said I don't have a phone.",
        "For those curious (it's really an academic term)\n\n\nEnshittification is a pattern where online services and products experience a decline in quality over time. It is observed as platforms transition through several stages: initially offering high-quality services to attract users, then shifting to favor business customers to increase profitability, and finally focusing on maximizing profits for shareholders at the expense of both users and business customers.",
        "Thank you for not helping, appreciate it.",
        "try 12ft.io",
        "Wait until they mandate GPS ankle bracelets for everyone so that they can \"collect road tax per person.\"",
        "Privacy? In my India?? The audacity!!! /s",
        "Lol",
        "Black windows",
        "Not much research is needed. [Aluminium foil works, or indeed any metal](https://www.seeworldgps.com/knowledge/can-a-gps-tracker-be-blocked-how-to-guide/).\n\nObviously the govt can make those illegal, but then they also made driving without helmets/seatbelts illegal and we know how that turned out.",
        "They are obsessed to track and control everything. They have no idea about individual freedom.",
        "Privacy? Woh kya hota hai?",
        "Fuck this shit, our fellow hackers will research and it will be disabled in most cars through ECU flashing , if that is not available then a basic GPS jammer is really easy to make with arduino !",
        "That benefits the public, but this is for the benefit of the surveillance state. So will be enforced religiously.",
        "too much crime patrol?",
        "This has been in the works for sometime I guess. Remember mr gadkari promoting gps based tolls?",
        "The solution is pretty simple. Don't vote based on mandir-masjid. Vote for development. But why would anyone do that?",
        "This is a privacy issue , this has to be stopped",
        "Let's see.\n\nI hope they remove those 50 year old busses when doing so.",
        "Instead of doing shit like, go install all these GPS chips in our trains so that they can run on time ffs.",
        "Doesn’t mean we have to bend over and keep taking it. We are going to do exactly that… but we shouldn’t!",
        "What’s a business customer?",
        "Too complicated.",
        "The point I was trying to make was that the critical mass required to get privacy related legislation has not been achieved. So we, the minority that cares for privacy, can't expect the government to consider privacy. It's reduced to a personal issue instead of a social one.",
        "Every time we bring up privacy, we are told “Why fear if you have nothing to hide” 😕 I get your point now, you’re right. \n\nAlso, what’s up with that username😂",
        "Lol, this is never going to happen. But I love the efforts made by Modiji towards making a totalitarian and fascist nightmare state.\n\nFunnily enough, me and a classmate proposed something like this for the sake of traffic light control",
        "All vehicles will remove their license plates now. Checkmate, atheists.",
        "Or, everyone will start cycling, walking and using public transport. Brilliant masturbatory stroking by ModiXi to keep people fit and reduce traffic levels and pollution.",
        "You think crazy Hindu terrorists care about approval?",
        "Or just become a mechanic and remove the tracker......",
        "Funny how they can't get even proper power supply, roads but they will do GPS monitoring on everyone...............this will be about as functional as typical government services."
    ],
    "cleaned_text": "mandatory gps enabled monitoring motor vehicles proposed mandatory monitoring motor vehicles proposed affecting amendment cmvr act installation gps module previous post deleted account breaking subreddit postimg rules hence reposting ",
    "cleaned_title": "mandatory gps enabled monitoring motor vehicles proposed",
    "cleaned_selftext": "mandatory monitoring motor vehicles proposed affecting amendment cmvr act installation gps module previous post deleted account breaking subreddit postimg rules hence reposting",
    "cleaned_comments": "posting stuff kindly read last line post gps navic system paywall gps nowadays colloquial word theres thing avoid enshitification everything indian tech like mai iska spoof karne ka app banayega find vehicles pacific ocean probably install inside ecu alteration lead voiding insurance make illegal ply like trucks buses taxes automatic fines speeding good move privacy half navic satellites non functional due clock failure rip really use smart license card start vehicle gps prvde behavipjr patterns crime rate fall cid track phone location vehicle ache din cant even enforce backlights vehicles huge privacy issue wait till someone comes shitty advantages feature speeding fine automatic wow privacy satellites functional right wait till know third party hsrp apps available playstore cant make basic improvements road transport infra quality roads keeps falling instead improving indian cities public transport infra worth talking trains run late traffic lights dont work streets dark wait important problem solve need track movements private individuals country crossed privacy barrier long time ago oh theyre saying elsewhere gon na decrease insurance rates massive across board catch influential hitandrun drivers fuck survey put china shame oh totally china govt mandates installation govt issued apps mandatorily present phone many states children found reported cops parents secret phone app removed etc parents got arrested china like ultimate pretty sure wouldnt stand court aadhar also wasnt supposed stand court standing chest website called remove paywall doot com doesnt work dont try mean dear reddit overlords got covid first policy insurance thatll get affected right third party idk installing govt apps make sure never install stuff like digilocker crap fortunately needed install crap covid anyone asked std excuse dont phone dont start railways first wont surprised eventually start charging usage regular nontoll roads name maintenance charges right privacy fundamental right dont understand shit get approval well thats said aadhar look us anywhere go theyll reject saying need aadhar school college bank income tax driving license etc etc ugh aadhar right privacy one argue weak case like clear violation right privacy im sure wont uphold court say keep data encrypted vedic maths behind feet wall chanachur supreme kotha fame pighal jayega time research gps jammers bought usd please dont use ever last time researched got know lot things rely gps signals look google happens gps jamming truck driver managed regularly crash whole airport system usa unknowingly stop giving ideas flew covid guys airport forbade going futther gate till installed app decided youre already india would expel pakistan tried tactics travelling interstate said fine ill wait side state end let go rupaiya let get straight supposed make scene airport airport officials id much rather retain right leaveenter country marked national security threat second wave allowed entry malls without arogyasetu app ironic everyone infected wave start imposing rules impossible could go said dont phone curious really academic term enshittification pattern online services products experience decline quality time observed platforms transition several stages initially offering highquality services attract users shifting favor business customers increase profitability finally focusing maximizing profits shareholders expense users business customers thank helping appreciate try ftio wait mandate gps ankle bracelets everyone collect road tax per person privacy india audacity lol black windows much research needed aluminium foil works indeed metalhttpswwwseeworldgpscomknowledgecanagpstrackerbeblockedhowtoguide obviously govt make illegal also made driving without helmetsseatbelts illegal know turned obsessed track control everything idea individual freedom privacy woh kya hota hai fuck shit fellow hackers research disabled cars ecu flashing available basic gps jammer really easy make arduino benefits public benefit surveillance state enforced religiously much crime patrol works sometime guess remember mr gadkari promoting gps based tolls solution pretty simple dont vote based mandirmasjid vote development would anyone privacy issue stopped lets see hope remove year old busses instead shit like go install gps chips trains run time ffs doesnt mean bend keep taking going exactly shouldnt whats business customer complicated point trying make critical mass required get privacy related legislation achieved minority cares privacy cant expect government consider privacy reduced personal issue instead social one every time bring privacy told fear nothing hide get point youre right also whats username lol never going happen love efforts made modiji towards making totalitarian fascist nightmare state funnily enough classmate proposed something like sake traffic light control vehicles remove license plates checkmate atheists everyone start cycling walking using public transport brilliant masturbatory stroking modixi keep people fit reduce traffic levels pollution think crazy hindu terrorists care approval become mechanic remove tracker funny cant get even proper power supply roads gps monitoring everyonethis functional typical government services",
    "light_cleaned_title": "Mandatory GPS enabled monitoring of all motor vehicles proposed.",
    "light_cleaned_selftext": "Mandatory 24*7 monitoring of all motor vehicles proposed by affecting amendment to the CMVR act and installation of GPS module. Previous post deleted on account of breaking subreddit postimg rules hence reposting.",
    "light_cleaned_comments": "You posting the same stuff again and again? Kindly read the last line of my post. Why GPS? Why not our own navic system ? Paywall GPS is nowadays a colloquial word. And there's not a thing we can do to avoid it. Enshitification of everything Indian tech be like.. mai iska spoof karne ka app banayega.. find all vehicles in Pacific Ocean.. They will probably install it inside the ecu so that any alteration will lead to voiding of insurance and make it illegal to ply (like for trucks and buses). more taxes and automatic fines for speeding. Good move for privacy /s more than half of the navic satellites are non functional due to clock failure RIP. Really? :( Use smart license as card to start vehicle. Gps will pr9v8de behavipjr patterns. Crime rate will fall as CID can track phone location and vehicle both. Ache din They can't even enforce backlights on all vehicles This is a huge privacy issue. Wait till someone comes up with shitty advantages off this feature Speeding fine to be automatic now Wow what privacy? /s only 4 or 5 out of 9 satellites are functional right now Wait till you know about third party hsrp apps available on playstore. They can't make basic improvements to road and transport infra, quality of roads keeps falling instead of improving, most Indian cities have no public transport infra worth talking about, trains run late, traffic lights don't work, streets are dark, but wait, we have a more important problem to solve, we need to track the movements of all private individuals in the country. We crossed the privacy barrier a long time ago. Oh they have. They're saying elsewhere how it's gonna decrease insurance rates by a massive 5% across the board. Or to catch those ‘influential’ hit-and-run drivers FUCK THAT! Survey that will put China to shame. Oh totally not. In china the govt mandates installation of govt issued apps, they are to be mandatorily present in your phone in many states. Some children have been found to have reported to the cops that their parents have secret phone or had the app removed etc and their parents got arrested. China is like the ultimate . Pretty sure wouldn't stand in court.. Aadhar also wasn't supposed to stand in court but now it's standing on our chest. A website called remove paywall doot com doesn't work. Don't try it. I mean it, dear reddit overlords. We got the same during covid did we not? but this is the first policy insurance that'll get affected, right and not the third party? Who did what? Idk who all are installing govt apps, but I make sure to never install stuff like digilocker and crap. Fortunately not needed to install crap. During COVID if anyone asked std excuse was we don't have phone. Why don’t they start with railways first. Won't be surprised if they eventually start charging usage of regular non-toll roads in the name of maintenance charges. Right to privacy is a fundamental right. I don't understand how this shit will get approval Well that's what they all said during aadhar, and look at us anywhere you go they'll reject you saying need aadhar . School college bank income tax driving license etc etc Ugh aadhar was not against right to privacy. One can argue but it's a weak case. But this is like a clear violation of right to privacy. I'm sure it won't uphold in court. They will say we will keep data encrypted by Vedic maths behind 52 feet wall and chanachur of supreme kotha fame pighal jayega Time to research on GPS jammers.. Can be bought for 1000 usd but please don't use ever. Last time I researched I got to know a lot of things rely on gps signals. Look up on google what happens when you do gps jamming. Some truck driver managed to regularly crash the whole airport system in usa unknowingly. Stop giving them ideas /s I flew in during COVID, the guys at the airport forbade me from going any futther than the gate till I installed the app. And you decided to do so. You're already in india what would they do expel you to Pakistan. They tried such tactics with me while travelling interstate I said fine I'll wait on this side of the state, in the end let me go for 200 rupaiya. So let me get this straight: I was supposed to make a scene at the airport with the airport officials? I’d much rather retain my right to leave/enter the country than being marked as a national security threat. After second wave I was not allowed entry into malls without Arogyasetu app. What is ironic after everyone was infected and the wave was over did they start imposing these rules. Impossible. I could go I just said I don't have a phone. For those curious (it's really an academic term) Enshittification is a pattern where online services and products experience a decline in quality over time. It is observed as platforms transition through several stages: initially offering high-quality services to attract users, then shifting to favor business customers to increase profitability, and finally focusing on maximizing profits for shareholders at the expense of both users and business customers. Thank you for not helping, appreciate it. try 12ft.io Wait until they mandate GPS ankle bracelets for everyone so that they can \"collect road tax per person.\" Privacy? In my India?? The audacity!!! /s Lol Black windows Not much research is needed. [Aluminium foil works, or indeed any metal](https://www.seeworldgps.com/knowledge/can-a-gps-tracker-be-blocked-how-to-guide/). Obviously the govt can make those illegal, but then they also made driving without helmets/seatbelts illegal and we know how that turned out. They are obsessed to track and control everything. They have no idea about individual freedom. Privacy? Woh kya hota hai? Fuck this shit, our fellow hackers will research and it will be disabled in most cars through ECU flashing , if that is not available then a basic GPS jammer is really easy to make with arduino ! That benefits the public, but this is for the benefit of the surveillance state. So will be enforced religiously. too much crime patrol? This has been in the works for sometime I guess. Remember mr gadkari promoting gps based tolls? The solution is pretty simple. Don't vote based on mandir-masjid. Vote for development. But why would anyone do that? This is a privacy issue , this has to be stopped Let's see. I hope they remove those 50 year old busses when doing so. Instead of doing shit like, go install all these GPS chips in our trains so that they can run on time ffs. Doesn’t mean we have to bend over and keep taking it. We are going to do exactly that… but we shouldn’t! What’s a business customer? Too complicated. The point I was trying to make was that the critical mass required to get privacy related legislation has not been achieved. So we, the minority that cares for privacy, can't expect the government to consider privacy. It's reduced to a personal issue instead of a social one. Every time we bring up privacy, we are told “Why fear if you have nothing to hide” 😕 I get your point now, you’re right. Also, what’s up with that username😂 Lol, this is never going to happen. But I love the efforts made by Modiji towards making a totalitarian and fascist nightmare state. Funnily enough, me and a classmate proposed something like this for the sake of traffic light control All vehicles will remove their license plates now. Checkmate, atheists. Or, everyone will start cycling, walking and using public transport. Brilliant masturbatory stroking by ModiXi to keep people fit and reduce traffic levels and pollution. You think crazy Hindu terrorists care about approval? Or just become a mechanic and remove the tracker...... Funny how they can't get even proper power supply, roads but they will do GPS monitoring on everyone...............this will be about as functional as typical government services."
}