{
    "id": "138fxu0",
    "title": "‘Reclaiming the Freedom of Speech and Expression in an Orwellian Dystopia’: full text of ACJ’s Lawrence Dana Pinkham Memorial Lecture 2022-23 - The Hindu",
    "url": "https://www.thehindu.com/news/national/tamil-nadu/acj-lawrence-dana-pinkham-memorial-lecture-2023-chander-uday-singh/article66813706.ece",
    "selftext": "A very well written article on the status of press freedom in India today.\n\nWe are not the worst in the world (not even among \"denocracies\"). But that is not the point. We are pretty much the bottom of the barrel and we should have been doing better. I hope people pay cognizance to the facts and strive to counter efforts to curtail press freedom even more.\n\nBTW, the article is a bit biased (for good reasons, as barring the Emergency, free India has never seen this level of censorship). One must also note that it is not just the BJP that harms press freedom. TMC in Bengal, Congress in Rajasthan, and CPIM in Kerala too have skeletons in their closets and we should never forget them. They aren't as thorough as BJP, but who can guarantee that they wouldn't be as blatant if they form a government now (emphasis on now because the game has changed from past decades, press censorship is now well recieved by a large portion of the citizenry who have come to regard the press as worse than politicians).\n\nAs responsible citizens, we should be against any form of censorship other than to curtail direct calls to violence or publication of untruths as proven by independent auditors (in both cases, it should be the court which decides conviction before any kind of govt harrasment is permissible). Just remember, Siddique Kappan was arrested the day he got his bail from a case about incitement (because he wanted to visit Hathras and cover their story) on the charge of money laundering by ED for a sum of Rs 5000. Apparently he was handling this princely sum to help terrorists and was put in jail for weeks again. Just think of it before you decide that government (any of them) should be trusted on these matters.",
    "flair": "Politics",
    "score": 30,
    "num_comments": 1,
    "created_utc": 1683277613.0,
    "convurl": "https://external-preview.redd.it/RAXb61cSRXFoWvKHe93EdySeXMgiDn0VN83Dm7xQQ9M.jpg?auto=webp&v=enabled&s=ef0c76cf177e48ca2bf8dc9676bcb13e3ef8a7f8",
    "comments": [
        "Here is the story behind Siddique Kappan's arrest and investigation by ED. Some one claimed to have gotten about 1.5cr through unlawful means was claimed to have transferred Rs 5000 in his co-accused's account (not even his account). There was no other proof of transaction that ED could present in court (there were several accused, and barring that one guy, ED couldn't prove shit against anyone else).\n\nThat was reason enough for ED to arrest him and keep him in jail for a few more weeks. And most interestingly, this came into being just after he got a bail in his previous case which made him spend about 2 years in jail.\n\nhttps://m.timesofindia.com/city/lucknow/siddique-kappan-gets-bail-in-prevention-of-money-laundering-act-case-to-walk-out-of-jail-after-26-months/amp_articleshow/96468001.cms\n\nThis is how the government works."
    ],
    "cleaned_text": "reclaiming freedom speech expression orwellian dystopia full text acjs lawrence dana pinkham memorial lecture hindu well written article status press freedom india today worst world even among denocracies point pretty much bottom barrel better hope people pay cognizance facts strive counter efforts curtail press freedom even btw article bit biased good reasons barring emergency free india never seen level censorship one must also note bjp harms press freedom tmc bengal congress rajasthan cpim kerala skeletons closets never forget arent thorough bjp guarantee wouldnt blatant form government emphasis game changed past decades press censorship well recieved large portion citizenry come regard press worse politicians responsible citizens form censorship curtail direct calls violence publication untruths proven independent auditors cases court decides conviction kind govt harrasment permissible remember siddique kappan arrested day got bail case incitement wanted visit hathras cover story charge money laundering ed sum rs apparently handling princely sum help terrorists put jail weeks think decide government trusted matters ",
    "cleaned_title": "reclaiming freedom speech expression orwellian dystopia full text acjs lawrence dana pinkham memorial lecture hindu",
    "cleaned_selftext": "well written article status press freedom india today worst world even among denocracies point pretty much bottom barrel better hope people pay cognizance facts strive counter efforts curtail press freedom even btw article bit biased good reasons barring emergency free india never seen level censorship one must also note bjp harms press freedom tmc bengal congress rajasthan cpim kerala skeletons closets never forget arent thorough bjp guarantee wouldnt blatant form government emphasis game changed past decades press censorship well recieved large portion citizenry come regard press worse politicians responsible citizens form censorship curtail direct calls violence publication untruths proven independent auditors cases court decides conviction kind govt harrasment permissible remember siddique kappan arrested day got bail case incitement wanted visit hathras cover story charge money laundering ed sum rs apparently handling princely sum help terrorists put jail weeks think decide government trusted matters",
    "cleaned_comments": "story behind siddique kappans arrest investigation ed one claimed gotten cr unlawful means claimed transferred rs coaccuseds account even account proof transaction ed could present court several accused barring one guy ed couldnt prove shit anyone else reason enough ed arrest keep jail weeks interestingly came got bail previous case made spend years jail government works",
    "light_cleaned_title": "‘Reclaiming the Freedom of Speech and Expression in an Orwellian Dystopia’: full text of ACJ’s Lawrence Dana Pinkham Memorial Lecture 2022-23 - The Hindu",
    "light_cleaned_selftext": "A very well written article on the status of press freedom in India today. We are not the worst in the world (not even among \"denocracies\"). But that is not the point. We are pretty much the bottom of the barrel and we should have been doing better. I hope people pay cognizance to the facts and strive to counter efforts to curtail press freedom even more. BTW, the article is a bit biased (for good reasons, as barring the Emergency, free India has never seen this level of censorship). One must also note that it is not just the BJP that harms press freedom. TMC in Bengal, Congress in Rajasthan, and CPIM in Kerala too have skeletons in their closets and we should never forget them. They aren't as thorough as BJP, but who can guarantee that they wouldn't be as blatant if they form a government now (emphasis on now because the game has changed from past decades, press censorship is now well recieved by a large portion of the citizenry who have come to regard the press as worse than politicians). As responsible citizens, we should be against any form of censorship other than to curtail direct calls to violence or publication of untruths as proven by independent auditors (in both cases, it should be the court which decides conviction before any kind of govt harrasment is permissible). Just remember, Siddique Kappan was arrested the day he got his bail from a case about incitement (because he wanted to visit Hathras and cover their story) on the charge of money laundering by ED for a sum of Rs 5000. Apparently he was handling this princely sum to help terrorists and was put in jail for weeks again. Just think of it before you decide that government (any of them) should be trusted on these matters.",
    "light_cleaned_comments": "Here is the story behind Siddique Kappan's arrest and investigation by ED. Some one claimed to have gotten about 1.5cr through unlawful means was claimed to have transferred Rs 5000 in his co-accused's account (not even his account). There was no other proof of transaction that ED could present in court (there were several accused, and barring that one guy, ED couldn't prove shit against anyone else). That was reason enough for ED to arrest him and keep him in jail for a few more weeks. And most interestingly, this came into being just after he got a bail in his previous case which made him spend about 2 years in jail. This is how the government works."
}