{
    "id": "1bmllrt",
    "title": "The Brutality of Sugar: Debt, Child Marriage and Hysterectomies ",
    "url": "https://www.nytimes.com/2024/03/24/world/europe/india-sugar-cane-fields-child-labor-hysterectomies.html?unlocked_article_code=1.fE0.w8dp.COF09GTrImbA&ugrp=c",
    "selftext": "A gut-wrenching article from the new York times. If this is the situation in the most developed state, one can only imagine what's behind the veneer of development in other places. ",
    "flair": "Policy/Economy",
    "score": 162,
    "num_comments": 17,
    "created_utc": 1711289291.0,
    "convurl": "https://external-preview.redd.it/C5RxscOrMImLv_xqO8fJBTksClfYIHtIzWtAoHNhu2c.jpg?auto=webp&s=8ecbd978f708f84ac50def9bdaa38e3bd4d735e5",
    "comments": [
        "What are Indian bureaucrats or Badu doing for them ?",
        "🔔",
        "https://youtu.be/IeR-h9C2fgc?si=0IhevhvY_JUd1e9p",
        "https://youtu.be/vb3jlJOF7BA?si=Vui2TWtQij51evyz",
        "Bro this is much more marathwada ...Recently thousands of child marraige incident happens in marathwada",
        "It’s the same story for tea production, the same story recently by AP news for shrimp production. The scale of every day human rights abuses doled out casually in India is enough to make even worst dictators look like peaceniks.",
        "Is this the kind of Economic growth and rozgaar this country needs? No thanks.",
        "Look at the TV ads in 30 mins, 80% are sponsoring sugar with different labels",
        "Being a resident of Marathwada, sadly this is the truth!",
        "Being a resident of one of the Districts mentioned, the condition of farmers here is really dire and farmers suicides as an issue has just jumped in numbers yoy",
        "As someone who has personally visited these plantations and interacted with the laborers, I can say that their reality is even more gut-wrenching. So many lives pushed into debt traps and the most inhumane conditions.",
        "It happens in Karnataka too. Concerns of these evil companies is horseshit. There were many reports before this, many firsthand videos showing the slavery. The slavemasters running the farm or owning the land boast about how they can force women to work to death. The way those fukers talk about the people will make your skin crawl. They literally scream at 5-6 year olds to work.\n\nMost of the sugar factories and farms are extremely reluctant to show the workings or the insides, they even threaten to beat you up or actually do it if you ask too much. The ones ready to show it boast about their slavery. They have full support of local police and politicians. The cops will act as paid thugs for the factories.\n\nEven today, they make 1000 to 3000 a month. The payments are then cut for all the reasons, leaving them with barely anything to eat for weeks. \n\nEradicated extreme poverty my ass",
        "Absolutely gut wrenching yes, but TN and/or Kerala are india's most developed state, not Maharashtra",
        "Growth for the sake of growth is the ideology of cancer",
        "Right. I got your analogy."
    ],
    "cleaned_text": "brutality sugar debt child marriage hysterectomies gutwrenching article new york times situation developed state one imagine whats behind veneer development places ",
    "cleaned_title": "brutality sugar debt child marriage hysterectomies",
    "cleaned_selftext": "gutwrenching article new york times situation developed state one imagine whats behind veneer development places",
    "cleaned_comments": "indian bureaucrats badu bro much marathwada recently thousands child marraige incident happens marathwada story tea production story recently ap news shrimp production scale every day human rights abuses doled casually india enough make even worst dictators look like peaceniks kind economic growth rozgaar country needs thanks look tv ads mins sponsoring sugar different labels resident marathwada sadly truth resident one districts mentioned condition farmers really dire farmers suicides issue jumped numbers yoy someone personally visited plantations interacted laborers say reality even gutwrenching many lives pushed debt traps inhumane conditions happens karnataka concerns evil companies horseshit many reports many firsthand videos showing slavery slavemasters running farm owning land boast force women work death way fukers talk people make skin crawl literally scream year olds work sugar factories farms extremely reluctant show workings insides even threaten beat actually ask much ones ready show boast slavery full support local police politicians cops act paid thugs factories even today make month payments cut reasons leaving barely anything eat weeks eradicated extreme poverty ass absolutely gut wrenching yes tn andor kerala indias developed state maharashtra growth sake growth ideology cancer right got analogy",
    "light_cleaned_title": "The Brutality of Sugar: Debt, Child Marriage and Hysterectomies",
    "light_cleaned_selftext": "A gut-wrenching article from the new York times. If this is the situation in the most developed state, one can only imagine what's behind the veneer of development in other places.",
    "light_cleaned_comments": "What are Indian bureaucrats or Badu doing for them ? 🔔 Bro this is much more marathwada ...Recently thousands of child marraige incident happens in marathwada It’s the same story for tea production, the same story recently by AP news for shrimp production. The scale of every day human rights abuses doled out casually in India is enough to make even worst dictators look like peaceniks. Is this the kind of Economic growth and rozgaar this country needs? No thanks. Look at the TV ads in 30 mins, 80% are sponsoring sugar with different labels Being a resident of Marathwada, sadly this is the truth! Being a resident of one of the Districts mentioned, the condition of farmers here is really dire and farmers suicides as an issue has just jumped in numbers yoy As someone who has personally visited these plantations and interacted with the laborers, I can say that their reality is even more gut-wrenching. So many lives pushed into debt traps and the most inhumane conditions. It happens in Karnataka too. Concerns of these evil companies is horseshit. There were many reports before this, many firsthand videos showing the slavery. The slavemasters running the farm or owning the land boast about how they can force women to work to death. The way those fukers talk about the people will make your skin crawl. They literally scream at 5-6 year olds to work. Most of the sugar factories and farms are extremely reluctant to show the workings or the insides, they even threaten to beat you up or actually do it if you ask too much. The ones ready to show it boast about their slavery. They have full support of local police and politicians. The cops will act as paid thugs for the factories. Even today, they make 1000 to 3000 a month. The payments are then cut for all the reasons, leaving them with barely anything to eat for weeks. Eradicated extreme poverty my ass Absolutely gut wrenching yes, but TN and/or Kerala are india's most developed state, not Maharashtra Growth for the sake of growth is the ideology of cancer Right. I got your analogy."
}