{
    "id": "1cvw22u",
    "title": "The accident in Pune",
    "url": "https://www.reddit.com/r/india/comments/1cvw22u/the_accident_in_pune/",
    "selftext": "So today there was an accident in Pune where a rich builder's son who was 17 years old hit a two wheeler with his Porsche. Unfortunately both, the man and the woman on the bike were dead. They were IT engineers. According to what I've read on the news, since he's a \"MiNoR\" he will not be tried as an adult and all he has to do it write an essay on \"accident\", work with the yerawada traffic police for the next 15 days and get psychiatric help. But that's not the only illegal  thing, he was drunk and he had no number plate on his car. The court is investigating which pub/bar gave him alcoholic drinks and is going to take action on it and his father too. My point is when are we going to stop considering murderers minors?? If someone kills someone else, whether it be a 50 yr old man or a 15 yr old, both deserve jail. He'll get out of this case in no time, he is the son of Vishal agrawal so obviously. Lool at the brutality of how they've died:(https://youtu.be/lP5bvIUGNRg?feature=shared). Let us, as Indians start a movement against this on every social media platform to get Justice for the young man and woman who have died and every other person who was killed by minors speeding their dad's cars. I'll be the first person but please be the thousands to join the movement. #arrestvedantagrawal #trialofmurderersasadults",
    "flair": "Crime",
    "score": 1231,
    "num_comments": 204,
    "created_utc": 1716146561.0,
    "convurl": "https://external-preview.redd.it/eznUoJTIecNr4TiVIiX3c0GYp34W7pgAj2pssTjecP0.jpg?auto=webp&s=e14df873a9e3df16246fb20fc0c99a2b3f2ec724",
    "comments": [
        "We have ensured that the income inequality is so much that certain people can literally live like kings and queens. Hence no act of theirs will ever be punished. Laws are not for them...",
        "Yes, I completely agree, that's why I am trying to start a movement. Please join us and help us make a better India.",
        "Last I saw, after the bail and all the police have moved the HC to try him as an adult. So might happen yet.",
        "Not sure if that's happening but even if it is, the probability of the hc trying him as an adult is low. It goes against the Constitution. That is why I am trying to start a movement to make a change, not only for this case but for every such case in the future. Please join me on this movement.",
        "He doesn't deserve jail, his parents and the bar that served alcohol, on the other hand, do. The country runs on rules and laws. Laws set precedents. An arbitrary line had to be drawn and it's at 18 years. Could you really argue if you can jail a 5-year-old if he commits a crime? I know you are angry but no it's not the child's fault, his father should be tried.",
        "As a civilized society, we should move beyond vigilantism and mob justice. But in my dark moments I think it's not as if bad folks will do Seppuku because as evidenced by their actions their honor is low so sometimes we should help our fellow men.  (And yes I have been watching that english series called Shogun)",
        "Nothing's going to happen to him. Money talks, right? He'll get a fancy lawyer, pull some strings, and get a slap on the wrist at best. The justice system is a joke when it comes to rich kids.The rest of us? We'd be thrown in jail, no questions asked. But not him. He'll probably go to some cushy rehab center or get community service at a charity his parents fund.",
        "Eh, he deserves a little bit of jail. At 17, you're still aware of your choices. Guy wasn't a toddler and he killed two innocent people. ",
        "You could say the same thing about a 16 year old and a 15 year old as well, but like I said you have to draw a line somewhere and it's at 18 right now. Some 12 year olds are more aware and smart than some 30 year olds but that won't change the fact how the laws are applied.",
        "Its not the constitution. If the crime committed is of a heinous nature not conceivable of being done by a minor then he's tried as an adult. You can read the guidelines of this situation in the Nirbhaya Judgement.",
        "Unfortunately minor are treated with kid gloves in most countries except in America where they will be tried as adults unless they under 16 years of age ig . However laws can be introduced here to punish them with upto several  years imprisonment along with their parents if they are aware of their children's wrongdoing. \nIn hyderabad drink minor kids killed.three.women going for morning walk on a footpath they got out without any sentence.",
        "It is because the hindu always colluded with Muslims and Christian and try to subjugate Dalits and tribals and they never invested in health, nutrition and primary education for all, as it was not none of their business",
        "Finally, someone who gets how laws work.",
        "Even I agree here to some extent. This was a manslaughter. It wasn't like the boy was out for blood. While this choices were obviously wrong and he is getting away easily. Completely runing his life isn't the way here. Instead a more moderate punishment should be given to the boy and harsher punishment to the driver parents and bar.",
        "For the sake of an argument, why do you feel the parents should be held responsible in such cases? Obviously the parents would not want their child to be driving drunk, or even driving at all and there are countless minors driving or riding illegally in our country. What can the parents even do in such cases if the kid just takes the car and sneaks out?",
        "Put the parents in prison.",
        "Don't know what you are talking about, though I agree India needs to be a open society with social mobility if that is what you mean.",
        "Visuals are terrible.",
        "They didn't prioritise curbing malnutrition and primary education for all as it was none of their business.",
        "So so so disgusting. That could've been mine or your parents. So fucking disgusting",
        "In many western countries, it is 12 - 14 years.",
        "The visuals of the couple killed were so sad.The guy is 17 and is already the cause of 2 deaths .I don't find it surprising that the guy got bail and is free. Common middle class PPL will be fined for just about everything and the rich get away with murder.",
        "Anyone who is not rich is now just a cattle with the choice to spend life paying taxes which will ultimately benefit the rich or be a victim and die after getting hit by their vehicles.",
        "Exactly the guy made a choice to drive under influence. They had all the options in the world to get home safely without killing anyone but the guy chose to drive...",
        "I am against jails for juveniles. But nah this rich brat deserves worse punishment. He will do the same after the bail. Not that this will happen but make an example out of him",
        "We should take inspiration from the French on what to do with the rich and elites to keep them in check and stop them from getting away with crimes like this.",
        "This is fiction but ever read/watch “The White Tiger?” It has a very similar plot of injustice.",
        "> The country runs on rules and laws.\n\nWhere do you live?",
        "Haha, well in principle it does.",
        "Some policeman is going to get rich at the cost of 2 lives .",
        "No Justice, no peace",
        "Where?",
        "Nothing gonna happen lol\n\nIt's India \n\nAfter sometime they would even take down the news and people will forget about it lol",
        "Yes that is the test for determining whether he is tried as an adult or a 'juvenile in conflict with law'. There is a 'preliminary assessment ' conducted, if the crime is found to be heinous, then he'll be tried as an adult if found to be aware of the act he committed & its consequences otherwise his case will be put up before a 'Juvenile Justice Board'. Since the adult line is an arbitrary one ,this is why the test exists. This goes in conformity with the Nirbhaya judgement & the consequential National Commission for Protection of Child Rights guidelines dated April 2023.",
        "You want to make a change? Make it then by writing to the Law Commission by researching & making your 'opinion' credible by following the academic route. They want you to give feedback. Heck, they even invite you to give feedback! 🤯",
        "He’s rich. He’s got good lawyers. They will fight as long as his father wants them to. But I’m glad you brought forth this question.",
        "He got bail on Sunday. So highly doubtful that anything will happen",
        "Australia is 10 or 12 depending on state, UK is 12, Germany 14.\n\nSee\n\nhttps://en.m.wikipedia.org/wiki/Age_of_criminal_responsibility",
        "Australia is 10 or 12 depending on state, UK is 12, Germany 14.\n\nSee\n\nhttps://en.m.wikipedia.org/wiki/Age_of_criminal_responsibility",
        "💯",
        "We really need to learn from the French.",
        "Beat their ass up like other criminals.",
        "Indians never had honor if that’s what you’re assuming.\n\nWe need more of a French approach to solve our common problems.",
        "There was an accused in the Jaipur bomb blast case who was a minor and got caught with a live bomb. He too got bail just because he was a minor.\n\n[SC Orders Conditional Release Of Minor In Jaipur Blasts Case](https://www.google.com/amp/s/timesofindia.indiatimes.com/city/jaipur/supreme-court-orders-conditional-release-of-minor-in-jaipur-blasts-case/amp_articleshow/110130386.cms)",
        "He’s a child guys. Cut some slack . We did things in our childhood and though it may not be this messed up but we still regret doing it too.",
        "Minimum age should be 16",
        "For jail",
        "He got caught with the bomb, there was no prima facie case to be made against him that he caused the explosion directly. Plus he already spent 3 years in judicial custody before being given mandatory bail in such cases where minors have already spent 3 years in jail without trial being completed.",
        "Right. But he did confess that he was with the group of terrorists.",
        "French approach?",
        "French approach as in?",
        "People above 14 are fully aware of what they do and what their repercussions are. They should be jailed. Enough of this 17 year old \"child\" bullshit.",
        "Before starting an movement go and read juvenile justice act. Recent amendments made to it allows the court to try an child above 16 as adult depending upon the intensity and intention of crime and understanding of the accused. \nTherefore getting bail is no benchmark of deciding all this. \nStop spearing misinformation. In law bail is thr rule and jail is the exception. \nHaving phone and writing without any knowledge or reading is not so hard, learning is!\nPlease do some",
        "Income equality is only a part of it. Rampant corruption and no moral values in those governing or enforcing laws are also a big part.",
        "Yes..we need to spread this and make sure that culprit can't get away with just writing a bullshit letter",
        "If he was adult enough to drive a Porsche and adult enough to be drunk af then he is adult enough to be hanged till death !",
        "We didn’t KILL people you imbecile.",
        "Wtf did I just read lol",
        "Those asking for what’s French approach.\n\nGoogle karo French Revolution. And French Riots from a year ago.",
        "I mean, giving your child a vehicle implies that they wanted their child to drive a vehicle while underage.",
        "Oh Reddit admins let me use the R word just this once.",
        "Agreed, that’s why I wrote that in situations where parents don’t want their child driving a vehicle but the kid takes the car without the parents knowing/against their wishes.",
        "I'm pretty sure juveniles go to jail for murder and manslaughter.\nSource: I worked in a juvenile facility.",
        "I wish you or your family members were on the bike. That's a fair deal.",
        "Maybe become better parents and teach them about the consequences of their actions?",
        "this and that aashrey sidana case just boils my blood...We need to set examples to keep the rich in check or we might lose one of our loved ones to these rich bratty assholes.Indian justice system is so fucked",
        "Dude, read the context. I was clearly asking about parents being held legally responsible which was mentioned on the original comment. You don’t need to state the obvious and act all smart",
        "Your comment includes:\n\n> why do you feel the parents should be held responsible in such cases? \n\n> Obviously the parents would not want their child to be driving drunk, or even driving at all\n\n> What can the parents even do in such cases if the kid just takes the car and sneaks out?",
        "The last line of the comment I replied to states\n> it’s not the child’s fault, the father should be tried.\n\nAnd the first line of my comment says\n> For the sake of an argument, why should the parents be held responsible?\n\nLike I said, read the context or at least learn to.",
        "I understand the context. But what was your logic to ask that question lmao. It doesn't make any sense.",
        "Reminder to leave this shithole while you can :)",
        "But he was bailed out. Although it was accidental, we can't ignore the deaths of two people, underage drinking, underage driving, drinking and driving and having no number plate on his car. All of these should be enough to jail him for at least two years and if it's not then fuck Indian law and order.",
        "There's a difference between a 5 year old and a 17 year old. He knew he was drunk(underage) and yet still chose to drive and at such speed that he couldn't control his car when he saw a bike in front of him.",
        "When a minor can drive a car and consume alcohol the court should try him as an adult.",
        "No shit, I can count as well. Read everything else I've written.",
        "Yeah he'll get out and leave the country soon. Rules and laws are only for poor suckers like us.",
        "https://en.m.wikipedia.org/wiki/Nahel_Merzouk_riots",
        "Gu khale 🤦",
        "These spoiled rich brats will get away with anything but we'll lose some from our life or even ours forever. Honestly it is shameful that the Indian Justice system cannot do anything.",
        "Will there be no criminal trial? He's out on police jail I'm assuming. Which is quite normal. The charge sheet needs to be filed and criminal proceedings will begin",
        "In the French revolution, when Kings didn't do what the common people wanted or did something against them, the common ppl would cut the king's head off. It's called guillotine and that's how most French king's were killed.",
        "In the French revolution, when Kings didn't do what the common people wanted or did something against them, the common ppl would cut the king's head off. It's called guillotine and that's how most French king's were killed.",
        "Where can you see it Uncensored ?",
        "I think the trial was already done. It was the juvenile Justice board who bailed him out on conditions where he works with a yerawada traffic police constable for 15 days, write a 300 word essay on \"accident\" and get psychiatric help.",
        "For real, wish we could have something like French Revolution where our working and middle class rose up against all these elites.",
        "Every case like this further strengthens my conviction that police, judges and politicians are just Dallas and pimps of rich people.",
        "What if he gave a fake id to the bar? What if the bartender refused and this guy pulled out a gun? Remember Jessica Lal? She died of a gunshot to the head for no reason other than a rich politician wanted alcohol after the bar had closed. \n\nRemember the grandson of the Nanda family (Admiral and arms dealers) who ran over some sleeping people and then fled the scene? Hell, remember the Ambani son who smashed into a car at high speed and then mysteriously the case vanished from sight? \n\nI don't have high hopes for this guy getting a jail sentence.",
        "Kya aadmi hai bhai tu",
        "I'd have to read the entire order to give a real answer here. But I can tell you that the decision to try a minor as a major is not statutory, i.e. you won't find it in any written code or law. Its the court's interpretation of the law and is subject to change.",
        "He got bail \n\n\nYou know his conditions were???\n\n\nSOCIAL SERVICE AND A ESSAY SAYING HOW REGRETFUL HE WAS",
        "He is not legally allowed to drive or even drink. His father should be sentenced to jail for 3 years - [https://www.drishtiias.com/state-pcs-current-affairs/penalties-for-parents-allowing-minors-to-drive](https://www.drishtiias.com/state-pcs-current-affairs/penalties-for-parents-allowing-minors-to-drive)",
        "Germany laws aren't any good.\n\n[https://www.news.com.au/lifestyle/real-life/news-life/outrage-as-eight-of-nine-men-convicted-of-park-gangrape-15yearold-in-germany-receive-no-prison-time/news-story/353bcbf9437ea62eea0ee3c6cc0c2cc7](https://www.news.com.au/lifestyle/real-life/news-life/outrage-as-eight-of-nine-men-convicted-of-park-gangrape-15yearold-in-germany-receive-no-prison-time/news-story/353bcbf9437ea62eea0ee3c6cc0c2cc7)",
        "It’s a slippery slope. Where do we stop and what crimes do we carve out? Minor laws are put in place for a reason and overall they do more good than bad. Say we shift the line to 16years. What happens when a 15+ commits a crime?",
        "Yes, it's complete idiotic thinking that a 17 year old would learn his lesson by writing an essay which he probably won't, he'll just tell one of his servants to do it for him. I've mentioned this in the post tho.",
        "Well there are lesser chances of a 15 year old doing criminal activities compared to a 17 year old so I think it would be better if we shift the line to 16. Many minors have gotten out of cases like rape and assault for being \"minors\".",
        "Nothing will change in this country. The kid is going to walk free after a few weeks and his dad is probably gonna feed all the authorities heavy cash, a new Porsche or better car will be ordered as a replacement to this one, and the kid will continue to act recklessly knowing he has the full backing of his father. \n\nAt this point, trying to get any concrete judicial trust/support out of our systems and legal authorities against powerful people has become exhaustive. No matter how hard you try, you can protest, and create petitions but they're all just noise in thin air. The only thing that works in this deprived land of ours is how loaded your bank account is and how strong your connections are. Unfortunate, but true.",
        "With a mindset like that you will only get as far as you can in life",
        "Exactly 💯",
        "First reports and statements by the kin of the deceased man say that influential people were involved in the case right from the word go. \n\nThe kin of deceased were harassed by the police officers once they reached the station where the incident was lodged. They saw the 17 year old Agarwal being given VIP treatment by the cops. He was being served fast food, while the kin of the deceased were asking the police to collect his blood samples for further testing. The kin was threatened by the police and instead the police were keen on testing the blood of the first witness that brought the boy in.\n\nThere is no justice, there is no law. Not for the privileged. It is in our hands guys. We need to do something. We cannot, absolutely cannot stand by and watch. There has to be tangible repercussions to the way we common folk are being treated.",
        "Please join us and help us with the movement. Post this news on your social media stories with the hashtag #arrestvedantagarwal and #trialofmurderersasadults. It would at least help in some way to try to make India better.",
        ">Uncensored \n\ndid you find it ?",
        "In a few days, there will be reports stating that the child wasn't driving the car. The forensic report shows that the Porsche was being driven by the servant at that time, and the child wasn't even in India. Later, there will be an alibi claiming that the boy was on a trip to Europe with him. \n\nThe police will fabricate the case, suggesting that the two deceased individuals were the ones under the influence of alcohol.\n\nSame old story. I don't understand why people are surprised. It's a colonial-derived system, and no matter what you do, you can't convict the ruling class. In fact, this kind of case is an opportunity for some policemen, lawyers, or judges to make a lifetime profit. You all worry unnecessarily.",
        "We need to do more",
        "> Hence no act of theirs will ever be punished. Laws are not for them...\n\nthis is a big and obvious sign of corruption in the justice system \r  \nkid kills 2 young people who had whole life ahead of them \r  \nkids punishment: write an essay \r  \nare you joking... \r  \nthe judge should be kicked to the moon.. What a corrupt judge! Such rotten behavior from someone who should show a proper moral compass",
        "I have seen clueless 17 year olds and mature 15 year olds. So what’s your point again? \n\nLook I’m not saying that laws don’t need to be re-looked at. Laws are meant to be reviewed and amended from time to time. But you basing this whole thing on purely reducing the age cap without any academic research and data, looks very juvenile.",
        "Well there are lesser chances of a 14 year old doing criminal activities compared to a 16 year old, so I think it would be better if we shift the line to 15. See how that argument makes no sense.",
        "India is not for poor n middle class \n\nEveryone knows hence everyone wants to be rich  or just leave this country",
        "In america it depends on the state. Some states you can be trialed as an adult at an age of 10.",
        "\\>  since he's a \"MiNoR\"\n\nDude is 17, I saw we try him as an adult.",
        "I feel like a pedestrian in a pay-to-win game :')",
        "In school when I was in 9th standard I had a senior who was studying in 11th std he had a sports bike bande ne kisi majdur ko uda diya tha and you know as a punishment bande ne sirf 20k pay kiya uski family ( most probably police achha khasa khaya hoga)and case raffa dafa  thats the power of money 🤦",
        "why???? I mean, meantal peace is a thing guys, jao so jao. Why do you want to see graphic shit?",
        "You can just hire 17 year old assassins and murder anybody in this great country of ours.",
        "We had a similar case in Ahmedabad and the rich builder's son is still in jail after 6-8 years, it all depends on how the local newspaper and media keeps the case alive vs letting it go because they have been bribed.",
        "It's the mentality of every average person, the darker corners of their minds love this gore and violence",
        "You're right. The justice system is not stupid. They consider all this. OP is just angry & rightly so but the law is the law.",
        "If you can't do the time, don't do the crime. There should be no discrimination based on age for criminal justice.",
        "I don't like mob lynching but boy I wanted that little shit to beaten to death by the mob. Some really do deserve it",
        "Either treat him as adult and jail him, or treat him as minor under the responsibility of parents jail the parents. Both parents and guilty child cannot go scot free. Responsibility and punishment has to be fixed.",
        "Why can't his father be tried in court to allow a minor to drive the car? He should be behind bars if not the son.",
        "Learn to respect them, they are our wealth creators. Our govt also works for them.",
        "He got bail, that doesn't mean the trial is done. (\"inquiry\" would be the term, since he is below 18)",
        "It's not love for gore and violence. Many times it's just a curiosity.",
        "An example of justice : https://youtube.com/shorts/qTSQWkhyDag?si=rSZPI7cLa8bYf0ac",
        "Where is a lynch mob when you actually need one? /S but really",
        "Curiosity for gore and violence",
        "Some policemen, whole lot of people are going to get rich from this case starting from witness they'll threaten and buy, to the judges to hush this matter. \n\nAlready they denying he was drunk.",
        "The minor rapist in the Nirbhaya case was not tried as an adult despite the despicable things he did. What makes you think that the minor son of an influential businessman will be?",
        "You need to see a therapist",
        "Share in all sub first let people know they would share",
        "Beaten to death is not good. Personally I don't agree with it. \n\nHowever, all limbs cut off and condemned to a limbless life... I can get behind that 100%",
        "Hey if you don't want to see it it's fine. Please don't lecture others. It's not like I am going to do something by watching that and it doesn't bother me at all. It gives a different perspective to me so I would like to watch it.",
        "Nope. But few \"mentally sane\" people advised me to go to therapist because I asked for uncensored version lmao.",
        "wrong sub mate. bestgore.com is that way ->",
        "This could have been me or anyone else.. I am not going to pay income tax this year, I will make sure this issue is highlighted when I get notice!",
        "It's not true that he would be let off after writing an essay. Where did you hear this ? Minors are tried in this country for murder. Whether influential people or wealthy people manage to get away with it is a different matter.  Being a minor is not going to help him here. He will be tried.",
        "Please search it up on Google. All the news articles say that he will have to write an essay on the topic \"accident\", work with the yerawada traffic police for 15 days and get psychiatric help. It was decided by the juvenile Justice board of India.",
        "Yesss I wish I could do that to him right now.",
        "It's BS. The media is distorting it. He's out on  bail thats it. He will be tried. The Juvenile Justice Board cannot arbitrarily make decisions like this.  He has been charged with  different sections of the IPC including the Motor Vehicle Act.  Now the essay thing and community service were the conditions for the bail.  As ridiculous as they are, they don't mean he's let off.  He will be tried.  Being the son of a wealthy builder might help.  The judge shows indications of being bribed,otherwise he wouldn't have brought up the psychiatric angle.  They'd maybe get the driver to be the fall guy. Pay his family or something.  The couple had visited the pub as well I think. In which case they could bribe the forensic guys and establish the guy on the motorcycle was drunk.  Either way the boy will be tried.  It could end up being a much talked about case.  Not necessarily  because our society has a moral compass but because he's the son of a wealthy man and was driving a Porsche so people would take it up out of resentment as well.  The father is in legal trouble as well.",
        "What do you mean by wrong sub? I am not asking to see the video here. I am only asking where can I find it. \n\n\n> bestgore.com is that way\n\nThis has been down since 2020.",
        "India has one of the worst situations of wealth inequalities. \n\nThe result of that is accidents such as these and the perpetrators getting away with it. \n\nOur reaction is to play Rihanna's songs over and over again.",
        "Yes, but it's a bit insensitive to ask that in a sub where people are expressing remorse over a tragedy. If you really have that kind of a morbid curiosity, you can find it yourself.\n\n> This has been down since 2020.\n\nNo surprise that you are aware of that.",
        "My heart goes out to the victims' families. I'm in my 20s and the amount of close shaves I've had because of reckless idiots, like that 17 year old, is way too much for my comfort.\n\nBikers be careful out there. Ride as if every goddamn creature on that road wishes you ill.",
        "No PUC pay fine of ₹10k; kill 2 people, you get Pizza and Burger in the POLICE STATION and get freed within 15 hrs.",
        "Last sunday, Anish Awadiya and Ashwini Koshta were struck and killed by Vedant Agarwal, 17, who was driving a Porshe Taycan (with no license plate) under the influence of alcohol. Vedant Agarwal is the son of well known builder Vishal Agarwal, the owner of Brahma Realty and Infrastructure. Due to his connections with the police and politicians, Vedant got out on bail in under a day. The lawyer representing him, Adv Prashant Patil, has been associated with the likes of people like Jacqueline Fernandez, Suraj Pancholi and many others.\n\nVedant, along with 2 of his friends were seen partying in nearby clubs in Kalyani Nagar. They returned to their car drunk at 3:15AM, and Vedant forced his driver to let him drive the car, even though the driver kept asking him to not do it. The Agarwal family is now trying to shift the blame on the innocent driver, making it look like he was the one who was driving when the accident took place. According to law, Vedants father too should be facing prosecution and jailtime.\n\nThe deceased, Anish and Ashwini, came from Madhya Pradesh in search of job opportunities and were working in IT companies. There is very little coverage about the victims and their backgrounds. Imagine what their families must be going through. Pune police has failed miserably in providing them justice.\n\nWe demand justice for the victims' families, and we refuse to let the influence of wealth and connections overshadow the gravity of this tragedy. This isn't just about Anish and Ashwini, these filthy people of Pune have been getting away by committing crimes since a long time and it's time every single citizen, including YOU, stand up for YOUR rights, or it could be you or your family members getting killed tomorrow.\n\nShare news regarding this story or this post on your social media handles. Twitter, Facebook, Linkedin, Whatsapp groups, anything works. Even though we have all lost faith in the local government, we can write letters to activists, police departments, and public representatives, and demand strict action. Protests have taken place in Kalyani Nagar and surrounding areas. People in the locality held a condolence meet for the victims' families too, but again there is very little coverage so they're struggling to make their voices heard. We can help by joining them or reposting tweets about them.\n\nEdit: Just as everybody expected, the police has put out a statement saying no alcohol was found in the blood sample of the boy: [https://www.punekarnews.in/pune-porsche-accident-minor-boys-blood-test-does-not-show-alcohol-consumption-police/](https://www.punekarnews.in/pune-porsche-accident-minor-boys-blood-test-does-not-show-alcohol-consumption-police/)",
        "He’s out on bail his father is a rich builder",
        "Ah I get it now. Cool. Curiousity got the better of me.\n\n> No surprise that you are aware of that.\n\nChecked it after you posted. I look only in reddit. Anything beyond that is beyond me as well unless someone like you point it out.",
        "He should get the full punishment and tried as an adult. He's just a kid. But this will teach him a valuable lesson and make an example out of him for all other rich kids out there.",
        "Update-\n\nThat dude is out on bail and is told to write an essay on this accident. SMH",
        "Pulling a chain in train is a criminal offence. As per your logic, what should we do to a 5 year old who pulls the chain?",
        "he'll die in the same circumstances",
        "It's quite simple. In cases where a minor has committed a serious offence that would merit jail time, and the minor is not estranged from their parents, the parents should be awarded whatever sentence an adult would have received for the same crime. Obviously the parents should not be held responsible if their child is mentally disturbed and ran away from home, and the parents have taken every effort to bring the child back. But cases like these are a slam dunk.\n\nRich f*ck dad lets entitled ass princeling drive an imported sportscar while underage, lets princeling drink underage, princeling causes ruckus while drunk in said sportscar? Rick f*ck dad can go serve a culpable homicide sentence. NOVWL.",
        "His dad paid \"tax\" to the judge and cops through his lawyer.",
        "A 5-year-old isn't tall enough to reach the chain by himself. Punish the adult who held up the child.",
        "Man you are projecting. It’s not the mentality of every average person.",
        "Or fine his parents for the crime commited by kids, because it was because of their negligence or acceptance that he was able to do so in the first place.",
        "sad to see so less post on twitter with this hashtag. Hope more people lend you power brother. Being a keyboard warrior on Reddit and crying about government is never going to change anything.",
        "https://www.freepressjournal.in/mumbai/navi-mumbai-13-yr-old-boy-rapes-impregnates-his-15-yr-old-sister-in-panvel\n\nI have said many times that these days the children are very aware from a much younger age. We were comparatively dumb at their age, in our times. These days kids are not as innocent as one may think, thanks to easy internet access.",
        "if it's no alcohol, isn't the case becomes of clear murder in full consciousness? Willingly hitting and killing two innocent person, without any influence is more heinous crime. I hope this too can be brought upon this poop shit personality",
        "Karma will punish him, dw",
        "And I pity on the mindset of you guys who justify crimes. Probably because you commit such crimes yourselves. What else describes such behaviour?",
        "Being an 18 year old who drives quite often, this is rattling to see. Genuinely fucked up stuff man scares the crap out of me",
        "Ik Reddit is not the best platform but at least ppl will get to know about this follow this on X and Instagram.",
        "Because the law was literally changed because of it?",
        "If they want to drink in pubs and bars like adults then they should be taking accountability for themselves and be treated for crimes they commit also \nThis is the lacunae in the Indian law where they get away with murder \nIts sad to see in India so many such your boys and girls in the high school with bad parenting high on drugs alchol and roaming around in SUV and luxury cars without any licence \nWhat type of parents are these who allow their children to have such an upbringing of no values and morality and being so self indulgent \nThe two young men killed in the prime\nOf their age \nI am\nSure the father has some big political connection",
        "I'm not aware of the change in law. Can you please elaborate?",
        "I agree, wherever is possible, it should spread, and the case shouldn't be dead, until the happiness of that ass monster is",
        "[https://blog.iledu.in/juvenile-justice-in-india-after-nirbhaya-rape-case/](https://blog.iledu.in/juvenile-justice-in-india-after-nirbhaya-rape-case/)",
        "Very valid in my opinion. Let them taste iron.",
        "Horrible news , makes me so mad to think that just because he comes from a rich family he can now get away with it , so so messed up.",
        "The sad truth is the letter of law seems to be followed here. I am not a law expert but that's what I am interpreting. The law should be changed so that a minor who got drunk intentionally and caused an accident should be given the same punishment as adults. \n\n\nEven then, such law changes will not affect retroactively. So, the minor in question will get away. It's neither justice nor fair. That's the harsh truth.",
        "How would you like to go about it, because the only way I see is mass protest all over india",
        "Pune? IT engineers? Did they work for Infosys? Worrying about my team's right now 😟",
        "I'm not sure where they worked but they were both from mp who came here for job opportunities and had gone out together.",
        "Give it few more years and you will understand",
        "I knew the girl personally. She was my junior in college.",
        "India laws,  let the Indian government figure it out themselves,  I don't expect a Indian to give a damn if hunter smoked a bunch of meth & Crack abs he's gotten away with it for his entire life,  because his pops has a position of power...  I don't feel like getting a random knock at the door at three AM, even with my second amendment rights...  I do less well unless I'm with \"militia \", hopefully it never goes that far in my lifetime. \n\n  If you're in Taiwan or India, arm yourself and don't expect the USA to be there.",
        "Just search in r/Pune. The uncensored one isn't much different as the guy shooting the video has a low quality camera",
        "So you mean Punish the Dad, who gave car 🚗?",
        "He may be guilty and should absolutely be punished but I myself I am 17 years I would be horrified in guilt for my whole life about it I may not be able to do anything in my life there are no punishment which can justify a death of someone but we should also consider what things can this boy at the age he has I am totally against the bail but it's not about rich vs poor now it's about 2 life's lost the person guilty if we look at just rich vs poor aspect we may not truly justify the accident",
        "Arrest this arsehole and beat the living crap out of him until he is dead. That's the only option because the Indian justice system is fucking shit.",
        ">since he's a \"MiNoR\" he will not be tried as an adult\n\nIf he can drink like an adult, drive like an adult, he can be tried like an adult.",
        "No, punish both of them. The driver and his father.",
        "What you tryna say mate?",
        "Pune has to rise for herself. Out of the ashes.",
        "i am 17 if i had committed this kinda of crime i would have been traumatize for my whole life but news accept or media attention is only on  rich got it easy and poor hard not about the victims and accuce if you where 17 and had commit this kinda of crime whould you be ok to live rest of your life in a jail i am againts what the police did its completely  wrong but what the person can achive is future is not know there needs to something to consider both of the things is my saying if dont agree its completely ok",
        "Not understanding a word you are trying to say. \n But ya I understand had you been there you would die out of guilt and that is okay but don't you think this comparison is unfair. This guy got no remorse, even after killing two people he was served pizzas and burgers in the jail.. he knows his father is filthy he can get away with whatever he does which is so scary.",
        "I'm condoning the instant bail, that is a grave miscarriage of justice. However what isn't is the instant mob justice he received at the hands of the group of bystanders around the accident site. \nSmall consolation but consolation nevertheless.",
        "Buying a judiciary is cheaper than a Porche.  The Porsche Management should be involved.  Ferrari and Lamborghini take it very seriously and blacklist the person from buying the car in the future.",
        "Future cabinet minister",
        "Rather than investigating which pub/bar gave him alcohol drink, they should take strict action on parents. How the f*ck a 17 year old can drive a car? And where’s the justice here? I shouldn’t say this but because of this type of things I feel like sometimes people go out of their limits and try to take justice with their own hands.",
        "The way they start doing in US, kids taking guns and shooting people, just prosecute parents. Put them jail, other parents will be more careful in giving keys to car to so called minors.",
        "If you're 20 and then committed this crime, is it okay to spend the rest of your life in jail? It is not about the age, it's about the crime you've committed. It's about the families you've destroyed. Of course you should be guilty. But guilt wears off my friend. He needs to be taught a lesson. The lesson he has learnt today is even if you kill someone, money can help you out. He needs to be put in jail so he doesn't break the law again",
        "What is the purpose of punishment? Is it reform or revenge?",
        "no i do not support that to there needs to be a some kind of equilibrium for I have seen or understand majority of people in jail will not commit a crime again as they have gone through there consequence i not in suport of him but they way to do it there needs to be something we all now how humans can change its just my opinion as of age at age of 17 me myself do not about future of me the collage if get any this year so a crime guilt can be hell of something for my whole life",
        "Parents must be held accountable too",
        "Justice should work in favour of everyone. He's just 4 months away from being 18.\n\n18 is the adulthood age according to the law, doesn't mean a switch in your mind activates as soon as you turn 18. You being 17 and being guilty does not justify you driving at a horrible 200kmph speed. Nor does it justify you drinking underage and and then driving.\n\nYou have broken several laws, just because you're guilty doesn't make you any less criminal. \n\nIf guilt was something that could rule out your punishment, there are several rapists and murderers who will roam around freely.",
        "\"Cattle class\" that's the phrase to use... From travelling in train like a cattle to being killed on road...",
        "there is no point of adding a law if you not even excercise it",
        "exactly my thought, its about time for us",
        "if you are driving at 200kmph at s public road, I don’t think you can call it an accident. Its like shooting bullets in public place and then claim it was an accident that the bullet killed someone",
        "that’s actually worse than killing someone",
        "I totally agree with what you said but there is a difference between commuting and an accident happening in this case I totally agree he was underage drunk and may have been driving reckless i do not now complete details but the way we are treating is he murdered some one and then on a free time everything has a consequence so there needs to be some time of jail or any other things to justify the the his reckless i am not a judge not of age to understand what complete right or wrong what should be the punishment but think media is not portraying the story as it should be but as a way that rich can do crime and nothing happens to them in all the story should.be around what was the boy doing what was happening in place of incident porche one of most powerful cars did the boy lost control or was there a malfunction with it how drunk the boy was why did the bar provide the alcohol to a minor and etc \n\nAccident is an accident not a murder then we have to treat every accident as a murder or every murder as an accident",
        "Are Bhai gaadi me kuch bhi hua hi, koi bhi situation rahi ho. 17 saal ka ladka gaadi chala sakta h kya? Zabardasti to nahi pakdai hogi na kisi ne? Ki tu chala isko. Daaru zabardasti to nahi pilai hogi kisi ne?\n\nOr nahi dekha to dekho, gaadi itni tez thi ki video me dikhi tak nahi. At least 200 ki speed thi. \n\nAnd yes. Rich can get away with anything in this country. Ambani k bete ne Aston Martin se logo ko uda Diya tha same way me. Raaton raat news gayab ho gayi thi har media house se.\n\nRich manipulate the law, think of others as cockroaches and do not respect or value others. Jo usne Kiya galat tha, saza milni chahiye",
        "Powers and Functions of the Juvenile Justice Board \n\n https://blog.ipleaders.in/powers-functions-juvenile-justice-board/\n\nAs a minor the driver was produced before this Board not regular Magistrate Court",
        "Bhai me ye sab soch liya tha subha comment ke bad i understand me kaha galat tha me ye apne perspective se dekh Raha tha par in reality it's him who has done it so ya galti tho hai ab me ye topic leave kar raha the law will take care of rest",
        "17 yr old still could get into a bar and drink as drinks were served to him ( law is 21 age limit ) . Driving license is for 18 plus yet he was using a car , so i suppose without license. Yet the judge felt its ok to let him go with minor punishment like writing an essay kudos to the entire judicial system which has been actually mocking the democratic country for the past few yrs . And their will be no action against the judge or anyone from the police or govt they will surely keep arresting people who are non govt but non from the govt .",
        "He has to be tried as an adult, because he considers himself adult enough to drink.",
        "Apparently the cops were busy serving him burgers and pizzas right after taking him to the station, instead of taking him for medical tests to ascertain alcohol content in his blood at the time. 🤦‍♂️",
        "Yes ik it was the juvenile Justice board but I just used the term court so that ppl could understand better",
        "Hi guys! There is a peaceful protest being organized. Here is the whatsapp link to the group where admins will share more details.  They are Currently waiting for permissions.\n\n https://broseph.in/pune",
        "Eh he kinda deserves it",
        "If he's old enough to drink and old enough to be drunk- driving, then he should be old enough to be tried as an adult responsible for taking two lives.",
        "You cannot start trying minors as adults if you want to progress as a nation. In the developed world, only the US does this (only in some cases), and there have been notorious mishaps like George Stinney, who was wrongly executed at the age of 14 in the 40s on a false testimony.  Also, even if someone who is underage commits a murder, it cannot be treated with the same strictness as when an adult with a fully developed brain commits a murder.  Just like we make special considerations for people who suffer from schizophrenia or psychosis, we make special considerations for people who have undeveloped brains.  That is like human rights 101.\n\nI am always baffled that so many Indian people willingly promote things like charging minors as adults.  This kind of thinking is going to keep India from progressing.  There is a middle ground between giving someone a slap on the wrist and trying minors as adults.  I agree the person who did this should be punished more harshly, but I don't agree that he should be tried as an adult.  That sets a really horrible precedent that would disproportionately affect the poor.",
        "Bro he was 17 years 8 months old when he hit the vehicle. You really think 4 months would change anything in that rich brat's life??? I think you don't know much about law because this is counted as a heinous crime and if a minor commits a heinous crime he can be tried as an adult. He was drunk(underage) and was driving (also underage) and had no number plate on his car. You think writing an essay is called \"a slap on the hand\"? If he is old enough to get drunk, drive his daddy's cars, smoke pot, and kill two people then he certainly old enough to be considered as an adult. Also, I haven't said that we should try every minor as an adult, I just said we should try murderers as adults. Driving at such a speed on a crowded highway knowing you can hit someone and kill someone can be considered murder. I think it's time to be like the usa considering the amount of crimes being done by minors and getting away with it. Our country will only progress if we jail the murderer minors. If we let these monsters roam out on the streets what are the chances they won't hit you, me, our close ones or the public?? They might even do more heinous things in the future if we don't stop them at this age. Please think before you say something like this especially on social media.",
        "Watch this !\n\nhttps://youtu.be/ZjfJxsg_GZw",
        "Hi. I'm serious. What should we do about this? I'm based out of Delhi.",
        "What do you think that could happen will he be charged I personally think no he’ll be freed very soon",
        "Unfortunately they probably have lot of money and clout to dodge such a situation.",
        "Would this case give birth to another Marianne Bachmeier?",
        "my condolences.  \n  \nmay God lay his hand on the families of the deceased and give them strength and patience. a great loss! RIP🙏  \n  \nand a great shame for the justice system! unfortunatelly it's not only india.       \nwhere there is money, corruption is not far away.",
        "I really hope it does. These kind of people need to learn it the hard way.",
        "The only help we need is for you to spread this news and posters everywhere on social media with #arrestvedantagarwal. Put it on stories, posts, tweets as much as possible. Also send this to someone you know who lives in Pune and ask them to join the protest. It would really help us get as many people as we can and also it'll become really hard to suppress this news if it's all over India. Thanks for the concern and help♥️🙏🏼",
        "It's not accidental if you drink and drive at high speed without having driving license. Nothing about it was accidental. Each step was done thoughtfully. It is a murder and should be considered as such.",
        "I agree but it will still be considered an \"accident\" legally as long as he didn't have any ill intentions towards the victims.",
        "not true if a cow is killed in an accident its a national issue. right wing will be on the street",
        "Can you elaborate more in what you just said?",
        "excatly , because he thinks he is adult so he should be treated as adult",
        "there is no justice in india , justice comes with price or long decades",
        "already got",
        "https://www.youtube.com/live/mXQxh6lFmCU?si=T8cC_LChOedgTSnp this height of coverup",
        "System ki mkc",
        "What is the update in this accident?? Is driver still behind bars or released??",
        "Well as far as I know, the boy was kept in juvenile jail for like two weeks ig and his mother, father and grandfather were in judicial custody."
    ],
    "cleaned_text": "accident pune today accident pune rich builders son years old hit two wheeler porsche unfortunately man woman bike dead engineers according ive read news since hes minor tried adult write essay accident work yerawada traffic police next days get psychiatric help thats illegal thing drunk number plate car court investigating pubbar gave alcoholic drinks going take action father point going stop considering murderers minors someone kills someone else whether yr old man yr old deserve jail hell get case time son vishal agrawal obviously lool brutality theyve diedhttpsyoutubelpbviugnrgfeatureshared let us indians start movement every social media platform get justice young man woman died every person killed minors speeding dads cars ill first person please thousands join movement arrestvedantagrawal trialofmurderersasadults ",
    "cleaned_title": "accident pune",
    "cleaned_selftext": "today accident pune rich builders son years old hit two wheeler porsche unfortunately man woman bike dead engineers according ive read news since hes minor tried adult write essay accident work yerawada traffic police next days get psychiatric help thats illegal thing drunk number plate car court investigating pubbar gave alcoholic drinks going take action father point going stop considering murderers minors someone kills someone else whether yr old man yr old deserve jail hell get case time son vishal agrawal obviously lool brutality theyve diedhttpsyoutubelpbviugnrgfeatureshared let us indians start movement every social media platform get justice young man woman died every person killed minors speeding dads cars ill first person please thousands join movement arrestvedantagrawal trialofmurderersasadults",
    "cleaned_comments": "ensured income inequality much certain people literally live like kings queens hence act ever punished laws yes completely agree thats trying start movement please join us help us make better india last saw bail police moved hc try adult might happen yet sure thats happening even probability hc trying adult low goes constitution trying start movement make change case every case future please join movement doesnt deserve jail parents bar served alcohol hand country runs rules laws laws set precedents arbitrary line drawn years could really argue jail yearold commits crime know angry childs fault father tried civilized society move beyond vigilantism mob justice dark moments think bad folks seppuku evidenced actions honor low sometimes help fellow men yes watching english series called shogun nothings going happen money talks right hell get fancy lawyer pull strings get slap wrist best justice system joke comes rich kidsthe rest us wed thrown jail questions asked hell probably go cushy rehab center get community service charity parents fund eh deserves little bit jail youre still aware choices guy wasnt toddler killed two innocent people could say thing year old year old well like said draw line somewhere right year olds aware smart year olds wont change fact laws applied constitution crime committed heinous nature conceivable done minor hes tried adult read guidelines situation nirbhaya judgement unfortunately minor treated kid gloves countries except america tried adults unless years age ig however laws introduced punish upto several years imprisonment along parents aware childrens wrongdoing hyderabad drink minor kids killedthreewomen going morning walk footpath got without sentence hindu always colluded muslims christian try subjugate dalits tribals never invested health nutrition primary education none business finally someone gets laws work even agree extent manslaughter wasnt like boy blood choices obviously wrong getting away easily completely runing life isnt way instead moderate punishment given boy harsher punishment driver parents bar sake argument feel parents held responsible cases obviously parents would want child driving drunk even driving countless minors driving riding illegally country parents even cases kid takes car sneaks put parents prison dont know talking though agree india needs open society social mobility mean visuals terrible didnt prioritise curbing malnutrition primary education none business disgusting couldve mine parents fucking disgusting many western countries years visuals couple killed sadthe guy already cause deaths dont find surprising guy got bail free common middle class ppl fined everything rich get away murder anyone rich cattle choice spend life paying taxes ultimately benefit rich victim die getting hit vehicles exactly guy made choice drive influence options world get home safely without killing anyone guy chose drive jails juveniles nah rich brat deserves worse punishment bail happen make example take inspiration french rich elites keep check stop getting away crimes like fiction ever readwatch white tiger similar plot injustice country runs rules laws live haha well principle policeman going get rich cost lives justice peace nothing gon na happen lol india sometime would even take news people forget lol yes test determining whether tried adult juvenile conflict law preliminary assessment conducted crime found heinous hell tried adult found aware act committed consequences otherwise case put juvenile justice board since adult line arbitrary one test exists goes conformity nirbhaya judgement consequential national commission protection child rights guidelines dated april want make change make writing law commission researching making opinion credible following academic route want give feedback heck even invite give feedback hes rich hes got good lawyers fight long father wants im glad brought forth question got bail sunday highly doubtful anything happen australia depending state uk germany see australia depending state uk germany see really need learn french beat ass like criminals indians never honor thats youre assuming need french approach solve common problems accused jaipur bomb blast case minor got caught live bomb got bail minor sc orders conditional release minor jaipur blasts casehttpswwwgooglecomampstimesofindiaindiatimescomcityjaipursupremecourtordersconditionalreleaseofminorinjaipurblastscaseamparticleshowcms hes child guys cut slack things childhood though may messed still regret minimum age jail got caught bomb prima facie case made caused explosion directly plus already spent years judicial custody given mandatory bail cases minors already spent years jail without trial completed right confess group terrorists french approach french approach people fully aware repercussions jailed enough year old child bullshit starting movement go read juvenile justice act recent amendments made allows court try child adult depending upon intensity intention crime understanding accused therefore getting bail benchmark deciding stop spearing misinformation law bail thr rule jail exception phone writing without knowledge reading hard learning please income equality part rampant corruption moral values governing enforcing laws also big part yeswe need spread make sure culprit cant get away writing bullshit letter adult enough drive porsche adult enough drunk af adult enough hanged till death didnt kill people imbecile wtf read lol asking whats french approach google karo french revolution french riots year ago mean giving child vehicle implies wanted child drive vehicle underage oh reddit admins let use r word agreed thats wrote situations parents dont want child driving vehicle kid takes car without parents knowingagainst wishes im pretty sure juveniles go jail murder manslaughter source worked juvenile facility wish family members bike thats fair deal maybe become better parents teach consequences actions aashrey sidana case boils bloodwe need set examples keep rich check might lose one loved ones rich bratty assholesindian justice system fucked dude read context clearly asking parents held legally responsible mentioned original comment dont need state obvious act smart comment includes feel parents held responsible cases obviously parents would want child driving drunk even driving parents even cases kid takes car sneaks last line comment replied states childs fault father tried first line comment says sake argument parents held responsible like said read context least learn understand context logic ask question lmao doesnt make sense reminder leave shithole bailed although accidental cant ignore deaths two people underage drinking underage driving drinking driving number plate car enough jail least two years fuck indian law order theres difference year old year old knew drunkunderage yet still chose drive speed couldnt control car saw bike front minor drive car consume alcohol court try adult shit count well read everything else ive written yeah hell get leave country soon rules laws poor suckers like us gu khale spoiled rich brats get away anything well lose life even forever honestly shameful indian justice system anything criminal trial hes police jail im assuming quite normal charge sheet needs filed criminal proceedings begin french revolution kings didnt common people wanted something common ppl would cut kings head called guillotine thats french kings killed french revolution kings didnt common people wanted something common ppl would cut kings head called guillotine thats french kings killed see uncensored think trial already done juvenile justice board bailed conditions works yerawada traffic police constable days write word essay accident get psychiatric help real wish could something like french revolution working middle class rose elites every case like strengthens conviction police judges politicians dallas pimps rich people gave fake id bar bartender refused guy pulled gun remember jessica lal died gunshot head reason rich politician wanted alcohol bar closed remember grandson nanda family admiral arms dealers ran sleeping people fled scene hell remember ambani son smashed car high speed mysteriously case vanished sight dont high hopes guy getting jail sentence kya aadmi hai bhai tu id read entire order give real answer tell decision try minor major statutory ie wont find written code law courts interpretation law subject change got bail know conditions social service essay saying regretful legally allowed drive even drink father sentenced jail years httpswwwdrishtiiascomstatepcscurrentaffairspenaltiesforparentsallowingminorstodrivehttpswwwdrishtiiascomstatepcscurrentaffairspenaltiesforparentsallowingminorstodrive germany laws arent good httpswwwnewscomaulifestylereallifenewslifeoutrageaseightofninemenconvictedofparkgangrapeyearoldingermanyreceivenoprisontimenewsstorybcbfeaeeaeecccccchttpswwwnewscomaulifestylereallifenewslifeoutrageaseightofninemenconvictedofparkgangrapeyearoldingermanyreceivenoprisontimenewsstorybcbfeaeeaeecccccc slippery slope stop crimes carve minor laws put place reason overall good bad say shift line years happens commits crime yes complete idiotic thinking year old would learn lesson writing essay probably wont hell tell one servants ive mentioned post tho well lesser chances year old criminal activities compared year old think would better shift line many minors gotten cases like rape assault minors nothing change country kid going walk free weeks dad probably gon na feed authorities heavy cash new porsche better car ordered replacement one kid continue act recklessly knowing full backing father point trying get concrete judicial trustsupport systems legal authorities powerful people become exhaustive matter hard try protest create petitions theyre noise thin air thing works deprived land loaded bank account strong connections unfortunate true mindset like get far life exactly first reports statements kin deceased man say influential people involved case right word go kin deceased harassed police officers reached station incident lodged saw year old agarwal given vip treatment cops served fast food kin deceased asking police collect blood samples testing kin threatened police instead police keen testing blood first witness brought boy justice law privileged hands guys need something absolutely stand watch tangible repercussions way common folk treated please join us help us movement post news social media stories hashtag arrestvedantagarwal trialofmurderersasadults would least help way try make india better uncensored find days reports stating child wasnt driving car forensic report shows porsche driven servant time child wasnt even india later alibi claiming boy trip europe police fabricate case suggesting two deceased individuals ones influence alcohol old story dont understand people surprised colonialderived system matter cant convict ruling class fact kind case opportunity policemen lawyers judges make lifetime profit worry unnecessarily need hence act ever punished laws big obvious sign corruption justice system kid kills young people whole life ahead kids punishment write essay joking judge kicked moon corrupt judge rotten behavior someone show proper moral compass seen clueless year olds mature year olds whats point look im saying laws dont need relooked laws meant reviewed amended time time basing whole thing purely reducing age cap without academic research data looks juvenile well lesser chances year old criminal activities compared year old think would better shift line see argument makes sense india poor n middle class everyone knows hence everyone wants rich leave country america depends state states trialed adult age since hes minor dude saw try adult feel like pedestrian paytowin game school th standard senior studying th std sports bike bande ne kisi majdur ko uda diya tha know punishment bande ne sirf k pay kiya uski family probably police achha khasa khaya hogaand case raffa dafa thats power money mean meantal peace thing guys jao jao want see graphic shit hire year old assassins murder anybody great country similar case ahmedabad rich builders son still jail years depends local newspaper media keeps case alive vs letting go bribed mentality every average person darker corners minds love gore violence youre right justice system stupid consider op angry rightly law law cant time dont crime discrimination based age criminal justice dont like mob lynching boy wanted little shit beaten death mob really deserve either treat adult jail treat minor responsibility parents jail parents parents guilty child go scot free responsibility punishment fixed cant father tried court allow minor drive car behind bars son learn respect wealth creators govt also works got bail doesnt mean trial done inquiry would term since love gore violence many times curiosity example justice lynch mob actually need one really curiosity gore violence policemen whole lot people going get rich case starting witness theyll threaten buy judges hush matter already denying drunk minor rapist nirbhaya case tried adult despite despicable things makes think minor son influential businessman need see therapist share sub first let people know would share beaten death good personally dont agree however limbs cut condemned limbless life get behind hey dont want see fine please dont lecture others like going something watching doesnt bother gives different perspective would like watch nope mentally sane people advised go therapist asked uncensored version lmao wrong sub mate bestgorecom way could anyone else going pay income tax year make sure issue highlighted get notice true would let writing essay hear minors tried country murder whether influential people wealthy people manage get away different matter minor going help tried please search google news articles say write essay topic accident work yerawada traffic police days get psychiatric help decided juvenile justice board india yesss wish could right bs media distorting hes bail thats tried juvenile justice board arbitrarily make decisions like charged different sections ipc including motor vehicle act essay thing community service conditions bail ridiculous dont mean hes let tried son wealthy builder might help judge shows indications bribedotherwise wouldnt brought psychiatric angle theyd maybe get driver fall guy pay family something couple visited pub well think case could bribe forensic guys establish guy motorcycle drunk either way boy tried could end much talked case necessarily society moral compass hes son wealthy man driving porsche people would take resentment well father legal trouble well mean wrong sub asking see video asking find bestgorecom way since india one worst situations wealth inequalities result accidents perpetrators getting away reaction play rihannas songs yes bit insensitive ask sub people expressing remorse tragedy really kind morbid curiosity find since surprise aware heart goes victims families im amount close shaves ive reckless idiots like year old way much comfort bikers careful ride every goddamn creature road wishes ill puc pay fine k kill people get pizza burger police station get freed within hrs last sunday anish awadiya ashwini koshta struck killed vedant agarwal driving porshe taycan license plate influence alcohol vedant agarwal son well known builder vishal agarwal owner brahma realty infrastructure due connections police politicians vedant got bail day lawyer representing adv prashant patil associated likes people like jacqueline fernandez suraj pancholi many others vedant along friends seen partying nearby clubs kalyani nagar returned car drunk vedant forced driver let drive car even though driver kept asking agarwal family trying shift blame innocent driver making look like one driving accident took place according law vedants father facing prosecution jailtime deceased anish ashwini came madhya pradesh search job opportunities working companies little coverage victims backgrounds imagine families must going pune police failed miserably providing justice demand justice victims families refuse let influence wealth connections overshadow gravity tragedy isnt anish ashwini filthy people pune getting away committing crimes since long time time every single citizen including stand rights could family members getting killed tomorrow share news regarding story post social media handles twitter facebook linkedin whatsapp groups anything works even though lost faith local government write letters activists police departments public representatives demand strict action protests taken place kalyani nagar surrounding areas people locality held condolence meet victims families little coverage theyre struggling make voices heard help joining reposting tweets edit everybody expected police put statement saying alcohol found blood sample boy httpswwwpunekarnewsinpuneporscheaccidentminorboysbloodtestdoesnotshowalcoholconsumptionpolicehttpswwwpunekarnewsinpuneporscheaccidentminorboysbloodtestdoesnotshowalcoholconsumptionpolice hes bail father rich builder ah get cool curiousity got better surprise aware checked posted look reddit anything beyond beyond well unless someone like point get full punishment tried adult hes kid teach valuable lesson make example rich kids update dude bail told write essay accident smh pulling chain train criminal offence per logic year old pulls chain hell die circumstances quite simple cases minor committed serious offence would merit jail time minor estranged parents parents awarded whatever sentence adult would received crime obviously parents held responsible child mentally disturbed ran away home parents taken every effort bring child back cases like slam dunk rich fck dad lets entitled ass princeling drive imported sportscar underage lets princeling drink underage princeling causes ruckus drunk said sportscar rick fck dad go serve culpable homicide sentence novwl dad paid tax judge cops lawyer yearold isnt tall enough reach chain punish adult held child man projecting mentality every average person fine parents crime commited kids negligence acceptance able first place sad see less post twitter hashtag hope people lend power brother keyboard warrior reddit crying government never going change anything said many times days children aware much younger age comparatively dumb age times days kids innocent one may think thanks easy internet access alcohol isnt case becomes clear murder full consciousness willingly hitting killing two innocent person without influence heinous crime hope brought upon poop shit personality karma punish dw pity mindset guys justify crimes probably commit crimes else describes behaviour year old drives quite often rattling see genuinely fucked stuff man scares crap ik reddit best platform least ppl get know follow x instagram law literally changed want drink pubs bars like adults taking accountability treated crimes commit also lacunae indian law get away murder sad see india many boys girls high school bad parenting high drugs alchol roaming around suv luxury cars without licence type parents allow children upbringing values morality self indulgent two young men killed prime age sure father big political connection im aware change law please elaborate agree wherever possible spread case shouldnt dead happiness ass monster httpsblogileduinjuvenilejusticeinindiaafternirbhayarapecasehttpsblogileduinjuvenilejusticeinindiaafternirbhayarapecase valid opinion let taste iron horrible news makes mad think comes rich family get away messed sad truth letter law seems followed law expert thats interpreting law changed minor got drunk intentionally caused accident given punishment adults even law changes affect retroactively minor question get away neither justice fair thats harsh truth would like go way see mass protest india pune engineers work infosys worrying teams right im sure worked mp came job opportunities gone together give years understand knew girl personally junior college india laws let indian government figure dont expect indian give damn hunter smoked bunch meth crack abs hes gotten away entire life pops position power dont feel like getting random knock door three even second amendment rights less well unless im militia hopefully never goes far lifetime youre taiwan india arm dont expect usa search rpune uncensored one isnt much different guy shooting video low quality camera mean punish dad gave car may guilty absolutely punished years would horrified guilt whole life may able anything life punishment justify death someone also consider things boy age totally bail rich vs poor lifes lost person guilty look rich vs poor aspect may truly justify accident arrest arsehole beat living crap dead thats option indian justice system fucking shit since hes minor tried adult drink like adult drive like adult tried like adult punish driver father tryna say mate pune rise ashes committed kinda crime would traumatize whole life news accept media attention rich got easy poor hard victims accuce commit kinda crime whould ok live rest life jail againts police completely wrong person achive future know needs something consider things saying dont agree completely ok understanding word trying say ya understand would die guilt okay dont think comparison unfair guy got remorse even killing two people served pizzas burgers jail knows father filthy get away whatever scary im condoning instant bail grave miscarriage justice however isnt instant mob justice received hands group bystanders around accident site small consolation consolation nevertheless buying judiciary cheaper porche porsche management involved ferrari lamborghini take seriously blacklist person buying car future future cabinet minister rather investigating pubbar gave alcohol drink take strict action parents fck year old drive car wheres justice shouldnt say type things feel like sometimes people go limits try take justice hands way start us kids taking guns shooting people prosecute parents put jail parents careful giving keys car called minors youre committed crime okay spend rest life jail age crime youve committed families youve destroyed course guilty guilt wears friend needs taught lesson lesson learnt today even kill someone money help needs put jail doesnt break law purpose punishment reform revenge support needs kind equilibrium seen understand majority people jail commit crime gone consequence suport way needs something humans change opinion age age future collage get year crime guilt hell something whole life parents must held accountable justice work favour everyone hes months away adulthood age according law doesnt mean switch mind activates soon turn guilty justify driving horrible kmph speed justify drinking underage driving broken several laws youre guilty doesnt make less criminal guilt something could rule punishment several rapists murderers roam around freely cattle class thats phrase use travelling train like cattle killed road point adding law even excercise exactly thought time us driving kmph public road dont think call accident like shooting bullets public place claim accident bullet killed someone thats actually worse killing someone totally agree said difference commuting accident happening case totally agree underage drunk may driving reckless complete details way treating murdered one free time everything consequence needs time jail things justify reckless judge age understand complete right wrong punishment think media portraying story way rich crime nothing happens story shouldbe around boy happening place incident porche one powerful cars boy lost control malfunction drunk boy bar provide alcohol minor etc accident accident murder treat every accident murder every murder accident bhai gaadi kuch bhi hua hi koi bhi situation rahi ho saal ka ladka gaadi chala sakta h kya zabardasti nahi pakdai hogi na kisi ne ki tu chala isko daaru zabardasti nahi pilai hogi kisi ne nahi dekha dekho gaadi itni tez thi ki video dikhi tak nahi least ki speed thi yes rich get away anything country ambani k bete ne aston martin se logo ko uda diya tha way raaton raat news gayab ho gayi thi har media house se rich manipulate law think others cockroaches respect value others jo usne kiya galat tha saza milni chahiye powers functions juvenile justice board minor driver produced board regular magistrate court bhai ye sab soch liya tha subha comment ke bad understand kaha galat tha ye apne perspective se dekh raha tha par reality done ya galti tho hai ab ye topic leave kar raha law take care rest yr old still could get bar drink drinks served law age limit driving license plus yet using car suppose without license yet judge felt ok let go minor punishment like writing essay kudos entire judicial system actually mocking democratic country past yrs action judge anyone police govt surely keep arresting people non govt non govt tried adult considers adult enough drink apparently cops busy serving burgers pizzas right taking station instead taking medical tests ascertain alcohol content blood time yes ik juvenile justice board used term court ppl could understand better hi guys peaceful protest organized whatsapp link group admins share details currently waiting permissions eh kinda deserves hes old enough drink old enough drunk driving old enough tried adult responsible taking two lives start trying minors adults want progress nation developed world us cases notorious mishaps like george stinney wrongly executed age false testimony also even someone underage commits murder treated strictness adult fully developed brain commits murder like make special considerations people suffer schizophrenia psychosis make special considerations people undeveloped brains like human rights always baffled many indian people willingly promote things like charging minors adults kind thinking going keep india progressing middle ground giving someone slap wrist trying minors adults agree person punished harshly dont agree tried adult sets really horrible precedent would disproportionately affect poor bro years months old hit vehicle really think months would change anything rich brats life think dont know much law counted heinous crime minor commits heinous crime tried adult drunkunderage driving also underage number plate car think writing essay called slap hand old enough get drunk drive daddys cars smoke pot kill two people certainly old enough considered adult also havent said try every minor adult said try murderers adults driving speed crowded highway knowing hit someone kill someone considered murder think time like usa considering amount crimes done minors getting away country progress jail murderer minors let monsters roam streets chances wont hit close ones public might even heinous things future dont stop age please think say something like especially social media watch hi im serious im based delhi think could happen charged personally think hell freed soon unfortunately probably lot money clout dodge situation would case give birth another marianne bachmeier condolences may god lay hand families deceased give strength patience great loss rip great shame justice system unfortunatelly india money corruption far away really hope kind people need learn hard way help need spread news posters everywhere social media arrestvedantagarwal put stories posts tweets much possible also send someone know lives pune ask join protest would really help us get many people also itll become really hard suppress news india thanks concern help accidental drink drive high speed without driving license nothing accidental step done thoughtfully murder considered agree still considered accident legally long didnt ill intentions towards victims true cow killed accident national issue right wing street elaborate said excatly thinks adult treated adult justice india justice comes price long decades already got height coverup system ki mkc update accident driver still behind bars released well far know boy kept juvenile jail like two weeks ig mother father grandfather judicial custody",
    "light_cleaned_title": "The accident in Pune",
    "light_cleaned_selftext": "So today there was an accident in Pune where a rich builder's son who was 17 years old hit a two wheeler with his Porsche. Unfortunately both, the man and the woman on the bike were dead. They were IT engineers. According to what I've read on the news, since he's a \"MiNoR\" he will not be tried as an adult and all he has to do it write an essay on \"accident\", work with the yerawada traffic police for the next 15 days and get psychiatric help. But that's not the only illegal thing, he was drunk and he had no number plate on his car. The court is investigating which pub/bar gave him alcoholic drinks and is going to take action on it and his father too. My point is when are we going to stop considering murderers minors?? If someone kills someone else, whether it be a 50 yr old man or a 15 yr old, both deserve jail. He'll get out of this case in no time, he is the son of Vishal agrawal so obviously. Lool at the brutality of how they've died:(https://youtu.be/lP5bvIUGNRg?feature=shared). Let us, as Indians start a movement against this on every social media platform to get Justice for the young man and woman who have died and every other person who was killed by minors speeding their dad's cars. I'll be the first person but please be the thousands to join the movement. #arrestvedantagrawal #trialofmurderersasadults",
    "light_cleaned_comments": "We have ensured that the income inequality is so much that certain people can literally live like kings and queens. Hence no act of theirs will ever be punished. Laws are not for them... Yes, I completely agree, that's why I am trying to start a movement. Please join us and help us make a better India. Last I saw, after the bail and all the police have moved the HC to try him as an adult. So might happen yet. Not sure if that's happening but even if it is, the probability of the hc trying him as an adult is low. It goes against the Constitution. That is why I am trying to start a movement to make a change, not only for this case but for every such case in the future. Please join me on this movement. He doesn't deserve jail, his parents and the bar that served alcohol, on the other hand, do. The country runs on rules and laws. Laws set precedents. An arbitrary line had to be drawn and it's at 18 years. Could you really argue if you can jail a 5-year-old if he commits a crime? I know you are angry but no it's not the child's fault, his father should be tried. As a civilized society, we should move beyond vigilantism and mob justice. But in my dark moments I think it's not as if bad folks will do Seppuku because as evidenced by their actions their honor is low so sometimes we should help our fellow men. (And yes I have been watching that english series called Shogun) Nothing's going to happen to him. Money talks, right? He'll get a fancy lawyer, pull some strings, and get a slap on the wrist at best. The justice system is a joke when it comes to rich kids.The rest of us? We'd be thrown in jail, no questions asked. But not him. He'll probably go to some cushy rehab center or get community service at a charity his parents fund. Eh, he deserves a little bit of jail. At 17, you're still aware of your choices. Guy wasn't a toddler and he killed two innocent people. You could say the same thing about a 16 year old and a 15 year old as well, but like I said you have to draw a line somewhere and it's at 18 right now. Some 12 year olds are more aware and smart than some 30 year olds but that won't change the fact how the laws are applied. Its not the constitution. If the crime committed is of a heinous nature not conceivable of being done by a minor then he's tried as an adult. You can read the guidelines of this situation in the Nirbhaya Judgement. Unfortunately minor are treated with kid gloves in most countries except in America where they will be tried as adults unless they under 16 years of age ig . However laws can be introduced here to punish them with upto several years imprisonment along with their parents if they are aware of their children's wrongdoing. In hyderabad drink minor kids killed.three.women going for morning walk on a footpath they got out without any sentence. It is because the hindu always colluded with Muslims and Christian and try to subjugate Dalits and tribals and they never invested in health, nutrition and primary education for all, as it was not none of their business Finally, someone who gets how laws work. Even I agree here to some extent. This was a manslaughter. It wasn't like the boy was out for blood. While this choices were obviously wrong and he is getting away easily. Completely runing his life isn't the way here. Instead a more moderate punishment should be given to the boy and harsher punishment to the driver parents and bar. For the sake of an argument, why do you feel the parents should be held responsible in such cases? Obviously the parents would not want their child to be driving drunk, or even driving at all and there are countless minors driving or riding illegally in our country. What can the parents even do in such cases if the kid just takes the car and sneaks out? Put the parents in prison. Don't know what you are talking about, though I agree India needs to be a open society with social mobility if that is what you mean. Visuals are terrible. They didn't prioritise curbing malnutrition and primary education for all as it was none of their business. So so so disgusting. That could've been mine or your parents. So fucking disgusting In many western countries, it is 12 - 14 years. The visuals of the couple killed were so sad.The guy is 17 and is already the cause of 2 deaths .I don't find it surprising that the guy got bail and is free. Common middle class PPL will be fined for just about everything and the rich get away with murder. Anyone who is not rich is now just a cattle with the choice to spend life paying taxes which will ultimately benefit the rich or be a victim and die after getting hit by their vehicles. Exactly the guy made a choice to drive under influence. They had all the options in the world to get home safely without killing anyone but the guy chose to drive... I am against jails for juveniles. But nah this rich brat deserves worse punishment. He will do the same after the bail. Not that this will happen but make an example out of him We should take inspiration from the French on what to do with the rich and elites to keep them in check and stop them from getting away with crimes like this. This is fiction but ever read/watch “The White Tiger?” It has a very similar plot of injustice. > The country runs on rules and laws. Where do you live? Haha, well in principle it does. Some policeman is going to get rich at the cost of 2 lives . No Justice, no peace Where? Nothing gonna happen lol It's India After sometime they would even take down the news and people will forget about it lol Yes that is the test for determining whether he is tried as an adult or a 'juvenile in conflict with law'. There is a 'preliminary assessment ' conducted, if the crime is found to be heinous, then he'll be tried as an adult if found to be aware of the act he committed & its consequences otherwise his case will be put up before a 'Juvenile Justice Board'. Since the adult line is an arbitrary one ,this is why the test exists. This goes in conformity with the Nirbhaya judgement & the consequential National Commission for Protection of Child Rights guidelines dated April 2023. You want to make a change? Make it then by writing to the Law Commission by researching & making your 'opinion' credible by following the academic route. They want you to give feedback. Heck, they even invite you to give feedback! 🤯 He’s rich. He’s got good lawyers. They will fight as long as his father wants them to. But I’m glad you brought forth this question. He got bail on Sunday. So highly doubtful that anything will happen Australia is 10 or 12 depending on state, UK is 12, Germany 14. See Australia is 10 or 12 depending on state, UK is 12, Germany 14. See 💯 We really need to learn from the French. Beat their ass up like other criminals. Indians never had honor if that’s what you’re assuming. We need more of a French approach to solve our common problems. There was an accused in the Jaipur bomb blast case who was a minor and got caught with a live bomb. He too got bail just because he was a minor. [SC Orders Conditional Release Of Minor In Jaipur Blasts Case](https://www.google.com/amp/s/timesofindia.indiatimes.com/city/jaipur/supreme-court-orders-conditional-release-of-minor-in-jaipur-blasts-case/amp_articleshow/110130386.cms) He’s a child guys. Cut some slack . We did things in our childhood and though it may not be this messed up but we still regret doing it too. Minimum age should be 16 For jail He got caught with the bomb, there was no prima facie case to be made against him that he caused the explosion directly. Plus he already spent 3 years in judicial custody before being given mandatory bail in such cases where minors have already spent 3 years in jail without trial being completed. Right. But he did confess that he was with the group of terrorists. French approach? French approach as in? People above 14 are fully aware of what they do and what their repercussions are. They should be jailed. Enough of this 17 year old \"child\" bullshit. Before starting an movement go and read juvenile justice act. Recent amendments made to it allows the court to try an child above 16 as adult depending upon the intensity and intention of crime and understanding of the accused. Therefore getting bail is no benchmark of deciding all this. Stop spearing misinformation. In law bail is thr rule and jail is the exception. Having phone and writing without any knowledge or reading is not so hard, learning is! Please do some Income equality is only a part of it. Rampant corruption and no moral values in those governing or enforcing laws are also a big part. Yes..we need to spread this and make sure that culprit can't get away with just writing a bullshit letter If he was adult enough to drive a Porsche and adult enough to be drunk af then he is adult enough to be hanged till death ! We didn’t KILL people you imbecile. Wtf did I just read lol Those asking for what’s French approach. Google karo French Revolution. And French Riots from a year ago. I mean, giving your child a vehicle implies that they wanted their child to drive a vehicle while underage. Oh Reddit admins let me use the R word just this once. Agreed, that’s why I wrote that in situations where parents don’t want their child driving a vehicle but the kid takes the car without the parents knowing/against their wishes. I'm pretty sure juveniles go to jail for murder and manslaughter. Source: I worked in a juvenile facility. I wish you or your family members were on the bike. That's a fair deal. Maybe become better parents and teach them about the consequences of their actions? this and that aashrey sidana case just boils my blood...We need to set examples to keep the rich in check or we might lose one of our loved ones to these rich bratty assholes.Indian justice system is so fucked Dude, read the context. I was clearly asking about parents being held legally responsible which was mentioned on the original comment. You don’t need to state the obvious and act all smart Your comment includes: > why do you feel the parents should be held responsible in such cases? > Obviously the parents would not want their child to be driving drunk, or even driving at all > What can the parents even do in such cases if the kid just takes the car and sneaks out? The last line of the comment I replied to states > it’s not the child’s fault, the father should be tried. And the first line of my comment says > For the sake of an argument, why should the parents be held responsible? Like I said, read the context or at least learn to. I understand the context. But what was your logic to ask that question lmao. It doesn't make any sense. Reminder to leave this shithole while you can :) But he was bailed out. Although it was accidental, we can't ignore the deaths of two people, underage drinking, underage driving, drinking and driving and having no number plate on his car. All of these should be enough to jail him for at least two years and if it's not then fuck Indian law and order. There's a difference between a 5 year old and a 17 year old. He knew he was drunk(underage) and yet still chose to drive and at such speed that he couldn't control his car when he saw a bike in front of him. When a minor can drive a car and consume alcohol the court should try him as an adult. No shit, I can count as well. Read everything else I've written. Yeah he'll get out and leave the country soon. Rules and laws are only for poor suckers like us. Gu khale 🤦 These spoiled rich brats will get away with anything but we'll lose some from our life or even ours forever. Honestly it is shameful that the Indian Justice system cannot do anything. Will there be no criminal trial? He's out on police jail I'm assuming. Which is quite normal. The charge sheet needs to be filed and criminal proceedings will begin In the French revolution, when Kings didn't do what the common people wanted or did something against them, the common ppl would cut the king's head off. It's called guillotine and that's how most French king's were killed. In the French revolution, when Kings didn't do what the common people wanted or did something against them, the common ppl would cut the king's head off. It's called guillotine and that's how most French king's were killed. Where can you see it Uncensored ? I think the trial was already done. It was the juvenile Justice board who bailed him out on conditions where he works with a yerawada traffic police constable for 15 days, write a 300 word essay on \"accident\" and get psychiatric help. For real, wish we could have something like French Revolution where our working and middle class rose up against all these elites. Every case like this further strengthens my conviction that police, judges and politicians are just Dallas and pimps of rich people. What if he gave a fake id to the bar? What if the bartender refused and this guy pulled out a gun? Remember Jessica Lal? She died of a gunshot to the head for no reason other than a rich politician wanted alcohol after the bar had closed. Remember the grandson of the Nanda family (Admiral and arms dealers) who ran over some sleeping people and then fled the scene? Hell, remember the Ambani son who smashed into a car at high speed and then mysteriously the case vanished from sight? I don't have high hopes for this guy getting a jail sentence. Kya aadmi hai bhai tu I'd have to read the entire order to give a real answer here. But I can tell you that the decision to try a minor as a major is not statutory, i.e. you won't find it in any written code or law. Its the court's interpretation of the law and is subject to change. He got bail You know his conditions were??? SOCIAL SERVICE AND A ESSAY SAYING HOW REGRETFUL HE WAS He is not legally allowed to drive or even drink. His father should be sentenced to jail for 3 years - [https://www.drishtiias.com/state-pcs-current-affairs/penalties-for-parents-allowing-minors-to-drive](https://www.drishtiias.com/state-pcs-current-affairs/penalties-for-parents-allowing-minors-to-drive) Germany laws aren't any good. [https://www.news.com.au/lifestyle/real-life/news-life/outrage-as-eight-of-nine-men-convicted-of-park-gangrape-15yearold-in-germany-receive-no-prison-time/news-story/353bcbf9437ea62eea0ee3c6cc0c2cc7](https://www.news.com.au/lifestyle/real-life/news-life/outrage-as-eight-of-nine-men-convicted-of-park-gangrape-15yearold-in-germany-receive-no-prison-time/news-story/353bcbf9437ea62eea0ee3c6cc0c2cc7) It’s a slippery slope. Where do we stop and what crimes do we carve out? Minor laws are put in place for a reason and overall they do more good than bad. Say we shift the line to 16years. What happens when a 15+ commits a crime? Yes, it's complete idiotic thinking that a 17 year old would learn his lesson by writing an essay which he probably won't, he'll just tell one of his servants to do it for him. I've mentioned this in the post tho. Well there are lesser chances of a 15 year old doing criminal activities compared to a 17 year old so I think it would be better if we shift the line to 16. Many minors have gotten out of cases like rape and assault for being \"minors\". Nothing will change in this country. The kid is going to walk free after a few weeks and his dad is probably gonna feed all the authorities heavy cash, a new Porsche or better car will be ordered as a replacement to this one, and the kid will continue to act recklessly knowing he has the full backing of his father. At this point, trying to get any concrete judicial trust/support out of our systems and legal authorities against powerful people has become exhaustive. No matter how hard you try, you can protest, and create petitions but they're all just noise in thin air. The only thing that works in this deprived land of ours is how loaded your bank account is and how strong your connections are. Unfortunate, but true. With a mindset like that you will only get as far as you can in life Exactly 💯 First reports and statements by the kin of the deceased man say that influential people were involved in the case right from the word go. The kin of deceased were harassed by the police officers once they reached the station where the incident was lodged. They saw the 17 year old Agarwal being given VIP treatment by the cops. He was being served fast food, while the kin of the deceased were asking the police to collect his blood samples for further testing. The kin was threatened by the police and instead the police were keen on testing the blood of the first witness that brought the boy in. There is no justice, there is no law. Not for the privileged. It is in our hands guys. We need to do something. We cannot, absolutely cannot stand by and watch. There has to be tangible repercussions to the way we common folk are being treated. Please join us and help us with the movement. Post this news on your social media stories with the hashtag #arrestvedantagarwal and #trialofmurderersasadults. It would at least help in some way to try to make India better. >Uncensored did you find it ? In a few days, there will be reports stating that the child wasn't driving the car. The forensic report shows that the Porsche was being driven by the servant at that time, and the child wasn't even in India. Later, there will be an alibi claiming that the boy was on a trip to Europe with him. The police will fabricate the case, suggesting that the two deceased individuals were the ones under the influence of alcohol. Same old story. I don't understand why people are surprised. It's a colonial-derived system, and no matter what you do, you can't convict the ruling class. In fact, this kind of case is an opportunity for some policemen, lawyers, or judges to make a lifetime profit. You all worry unnecessarily. We need to do more > Hence no act of theirs will ever be punished. Laws are not for them... this is a big and obvious sign of corruption in the justice system kid kills 2 young people who had whole life ahead of them kids punishment: write an essay are you joking... the judge should be kicked to the moon.. What a corrupt judge! Such rotten behavior from someone who should show a proper moral compass I have seen clueless 17 year olds and mature 15 year olds. So what’s your point again? Look I’m not saying that laws don’t need to be re-looked at. Laws are meant to be reviewed and amended from time to time. But you basing this whole thing on purely reducing the age cap without any academic research and data, looks very juvenile. Well there are lesser chances of a 14 year old doing criminal activities compared to a 16 year old, so I think it would be better if we shift the line to 15. See how that argument makes no sense. India is not for poor n middle class Everyone knows hence everyone wants to be rich or just leave this country In america it depends on the state. Some states you can be trialed as an adult at an age of 10. \\> since he's a \"MiNoR\" Dude is 17, I saw we try him as an adult. I feel like a pedestrian in a pay-to-win game :') In school when I was in 9th standard I had a senior who was studying in 11th std he had a sports bike bande ne kisi majdur ko uda diya tha and you know as a punishment bande ne sirf 20k pay kiya uski family ( most probably police achha khasa khaya hoga)and case raffa dafa thats the power of money 🤦 why???? I mean, meantal peace is a thing guys, jao so jao. Why do you want to see graphic shit? You can just hire 17 year old assassins and murder anybody in this great country of ours. We had a similar case in Ahmedabad and the rich builder's son is still in jail after 6-8 years, it all depends on how the local newspaper and media keeps the case alive vs letting it go because they have been bribed. It's the mentality of every average person, the darker corners of their minds love this gore and violence You're right. The justice system is not stupid. They consider all this. OP is just angry & rightly so but the law is the law. If you can't do the time, don't do the crime. There should be no discrimination based on age for criminal justice. I don't like mob lynching but boy I wanted that little shit to beaten to death by the mob. Some really do deserve it Either treat him as adult and jail him, or treat him as minor under the responsibility of parents jail the parents. Both parents and guilty child cannot go scot free. Responsibility and punishment has to be fixed. Why can't his father be tried in court to allow a minor to drive the car? He should be behind bars if not the son. Learn to respect them, they are our wealth creators. Our govt also works for them. He got bail, that doesn't mean the trial is done. (\"inquiry\" would be the term, since he is below 18) It's not love for gore and violence. Many times it's just a curiosity. An example of justice : Where is a lynch mob when you actually need one? /S but really Curiosity for gore and violence Some policemen, whole lot of people are going to get rich from this case starting from witness they'll threaten and buy, to the judges to hush this matter. Already they denying he was drunk. The minor rapist in the Nirbhaya case was not tried as an adult despite the despicable things he did. What makes you think that the minor son of an influential businessman will be? You need to see a therapist Share in all sub first let people know they would share Beaten to death is not good. Personally I don't agree with it. However, all limbs cut off and condemned to a limbless life... I can get behind that 100% Hey if you don't want to see it it's fine. Please don't lecture others. It's not like I am going to do something by watching that and it doesn't bother me at all. It gives a different perspective to me so I would like to watch it. Nope. But few \"mentally sane\" people advised me to go to therapist because I asked for uncensored version lmao. wrong sub mate. bestgore.com is that way -> This could have been me or anyone else.. I am not going to pay income tax this year, I will make sure this issue is highlighted when I get notice! It's not true that he would be let off after writing an essay. Where did you hear this ? Minors are tried in this country for murder. Whether influential people or wealthy people manage to get away with it is a different matter. Being a minor is not going to help him here. He will be tried. Please search it up on Google. All the news articles say that he will have to write an essay on the topic \"accident\", work with the yerawada traffic police for 15 days and get psychiatric help. It was decided by the juvenile Justice board of India. Yesss I wish I could do that to him right now. It's BS. The media is distorting it. He's out on bail thats it. He will be tried. The Juvenile Justice Board cannot arbitrarily make decisions like this. He has been charged with different sections of the IPC including the Motor Vehicle Act. Now the essay thing and community service were the conditions for the bail. As ridiculous as they are, they don't mean he's let off. He will be tried. Being the son of a wealthy builder might help. The judge shows indications of being bribed,otherwise he wouldn't have brought up the psychiatric angle. They'd maybe get the driver to be the fall guy. Pay his family or something. The couple had visited the pub as well I think. In which case they could bribe the forensic guys and establish the guy on the motorcycle was drunk. Either way the boy will be tried. It could end up being a much talked about case. Not necessarily because our society has a moral compass but because he's the son of a wealthy man and was driving a Porsche so people would take it up out of resentment as well. The father is in legal trouble as well. What do you mean by wrong sub? I am not asking to see the video here. I am only asking where can I find it. > bestgore.com is that way This has been down since 2020. India has one of the worst situations of wealth inequalities. The result of that is accidents such as these and the perpetrators getting away with it. Our reaction is to play Rihanna's songs over and over again. Yes, but it's a bit insensitive to ask that in a sub where people are expressing remorse over a tragedy. If you really have that kind of a morbid curiosity, you can find it yourself. > This has been down since 2020. No surprise that you are aware of that. My heart goes out to the victims' families. I'm in my 20s and the amount of close shaves I've had because of reckless idiots, like that 17 year old, is way too much for my comfort. Bikers be careful out there. Ride as if every goddamn creature on that road wishes you ill. No PUC pay fine of ₹10k; kill 2 people, you get Pizza and Burger in the POLICE STATION and get freed within 15 hrs. Last sunday, Anish Awadiya and Ashwini Koshta were struck and killed by Vedant Agarwal, 17, who was driving a Porshe Taycan (with no license plate) under the influence of alcohol. Vedant Agarwal is the son of well known builder Vishal Agarwal, the owner of Brahma Realty and Infrastructure. Due to his connections with the police and politicians, Vedant got out on bail in under a day. The lawyer representing him, Adv Prashant Patil, has been associated with the likes of people like Jacqueline Fernandez, Suraj Pancholi and many others. Vedant, along with 2 of his friends were seen partying in nearby clubs in Kalyani Nagar. They returned to their car drunk at 3:15AM, and Vedant forced his driver to let him drive the car, even though the driver kept asking him to not do it. The Agarwal family is now trying to shift the blame on the innocent driver, making it look like he was the one who was driving when the accident took place. According to law, Vedants father too should be facing prosecution and jailtime. The deceased, Anish and Ashwini, came from Madhya Pradesh in search of job opportunities and were working in IT companies. There is very little coverage about the victims and their backgrounds. Imagine what their families must be going through. Pune police has failed miserably in providing them justice. We demand justice for the victims' families, and we refuse to let the influence of wealth and connections overshadow the gravity of this tragedy. This isn't just about Anish and Ashwini, these filthy people of Pune have been getting away by committing crimes since a long time and it's time every single citizen, including YOU, stand up for YOUR rights, or it could be you or your family members getting killed tomorrow. Share news regarding this story or this post on your social media handles. Twitter, Facebook, Linkedin, Whatsapp groups, anything works. Even though we have all lost faith in the local government, we can write letters to activists, police departments, and public representatives, and demand strict action. Protests have taken place in Kalyani Nagar and surrounding areas. People in the locality held a condolence meet for the victims' families too, but again there is very little coverage so they're struggling to make their voices heard. We can help by joining them or reposting tweets about them. Edit: Just as everybody expected, the police has put out a statement saying no alcohol was found in the blood sample of the boy: [https://www.punekarnews.in/pune-porsche-accident-minor-boys-blood-test-does-not-show-alcohol-consumption-police/](https://www.punekarnews.in/pune-porsche-accident-minor-boys-blood-test-does-not-show-alcohol-consumption-police/) He’s out on bail his father is a rich builder Ah I get it now. Cool. Curiousity got the better of me. > No surprise that you are aware of that. Checked it after you posted. I look only in reddit. Anything beyond that is beyond me as well unless someone like you point it out. He should get the full punishment and tried as an adult. He's just a kid. But this will teach him a valuable lesson and make an example out of him for all other rich kids out there. Update- That dude is out on bail and is told to write an essay on this accident. SMH Pulling a chain in train is a criminal offence. As per your logic, what should we do to a 5 year old who pulls the chain? he'll die in the same circumstances It's quite simple. In cases where a minor has committed a serious offence that would merit jail time, and the minor is not estranged from their parents, the parents should be awarded whatever sentence an adult would have received for the same crime. Obviously the parents should not be held responsible if their child is mentally disturbed and ran away from home, and the parents have taken every effort to bring the child back. But cases like these are a slam dunk. Rich f*ck dad lets entitled ass princeling drive an imported sportscar while underage, lets princeling drink underage, princeling causes ruckus while drunk in said sportscar? Rick f*ck dad can go serve a culpable homicide sentence. NOVWL. His dad paid \"tax\" to the judge and cops through his lawyer. A 5-year-old isn't tall enough to reach the chain by himself. Punish the adult who held up the child. Man you are projecting. It’s not the mentality of every average person. Or fine his parents for the crime commited by kids, because it was because of their negligence or acceptance that he was able to do so in the first place. sad to see so less post on twitter with this hashtag. Hope more people lend you power brother. Being a keyboard warrior on Reddit and crying about government is never going to change anything. I have said many times that these days the children are very aware from a much younger age. We were comparatively dumb at their age, in our times. These days kids are not as innocent as one may think, thanks to easy internet access. if it's no alcohol, isn't the case becomes of clear murder in full consciousness? Willingly hitting and killing two innocent person, without any influence is more heinous crime. I hope this too can be brought upon this poop shit personality Karma will punish him, dw And I pity on the mindset of you guys who justify crimes. Probably because you commit such crimes yourselves. What else describes such behaviour? Being an 18 year old who drives quite often, this is rattling to see. Genuinely fucked up stuff man scares the crap out of me Ik Reddit is not the best platform but at least ppl will get to know about this follow this on X and Instagram. Because the law was literally changed because of it? If they want to drink in pubs and bars like adults then they should be taking accountability for themselves and be treated for crimes they commit also This is the lacunae in the Indian law where they get away with murder Its sad to see in India so many such your boys and girls in the high school with bad parenting high on drugs alchol and roaming around in SUV and luxury cars without any licence What type of parents are these who allow their children to have such an upbringing of no values and morality and being so self indulgent The two young men killed in the prime Of their age I am Sure the father has some big political connection I'm not aware of the change in law. Can you please elaborate? I agree, wherever is possible, it should spread, and the case shouldn't be dead, until the happiness of that ass monster is [https://blog.iledu.in/juvenile-justice-in-india-after-nirbhaya-rape-case/](https://blog.iledu.in/juvenile-justice-in-india-after-nirbhaya-rape-case/) Very valid in my opinion. Let them taste iron. Horrible news , makes me so mad to think that just because he comes from a rich family he can now get away with it , so so messed up. The sad truth is the letter of law seems to be followed here. I am not a law expert but that's what I am interpreting. The law should be changed so that a minor who got drunk intentionally and caused an accident should be given the same punishment as adults. Even then, such law changes will not affect retroactively. So, the minor in question will get away. It's neither justice nor fair. That's the harsh truth. How would you like to go about it, because the only way I see is mass protest all over india Pune? IT engineers? Did they work for Infosys? Worrying about my team's right now 😟 I'm not sure where they worked but they were both from mp who came here for job opportunities and had gone out together. Give it few more years and you will understand I knew the girl personally. She was my junior in college. India laws, let the Indian government figure it out themselves, I don't expect a Indian to give a damn if hunter smoked a bunch of meth & Crack abs he's gotten away with it for his entire life, because his pops has a position of power... I don't feel like getting a random knock at the door at three AM, even with my second amendment rights... I do less well unless I'm with \"militia \", hopefully it never goes that far in my lifetime. If you're in Taiwan or India, arm yourself and don't expect the USA to be there. Just search in r/Pune. The uncensored one isn't much different as the guy shooting the video has a low quality camera So you mean Punish the Dad, who gave car 🚗? He may be guilty and should absolutely be punished but I myself I am 17 years I would be horrified in guilt for my whole life about it I may not be able to do anything in my life there are no punishment which can justify a death of someone but we should also consider what things can this boy at the age he has I am totally against the bail but it's not about rich vs poor now it's about 2 life's lost the person guilty if we look at just rich vs poor aspect we may not truly justify the accident Arrest this arsehole and beat the living crap out of him until he is dead. That's the only option because the Indian justice system is fucking shit. >since he's a \"MiNoR\" he will not be tried as an adult If he can drink like an adult, drive like an adult, he can be tried like an adult. No, punish both of them. The driver and his father. What you tryna say mate? Pune has to rise for herself. Out of the ashes. i am 17 if i had committed this kinda of crime i would have been traumatize for my whole life but news accept or media attention is only on rich got it easy and poor hard not about the victims and accuce if you where 17 and had commit this kinda of crime whould you be ok to live rest of your life in a jail i am againts what the police did its completely wrong but what the person can achive is future is not know there needs to something to consider both of the things is my saying if dont agree its completely ok Not understanding a word you are trying to say. But ya I understand had you been there you would die out of guilt and that is okay but don't you think this comparison is unfair. This guy got no remorse, even after killing two people he was served pizzas and burgers in the jail.. he knows his father is filthy he can get away with whatever he does which is so scary. I'm condoning the instant bail, that is a grave miscarriage of justice. However what isn't is the instant mob justice he received at the hands of the group of bystanders around the accident site. Small consolation but consolation nevertheless. Buying a judiciary is cheaper than a Porche. The Porsche Management should be involved. Ferrari and Lamborghini take it very seriously and blacklist the person from buying the car in the future. Future cabinet minister Rather than investigating which pub/bar gave him alcohol drink, they should take strict action on parents. How the f*ck a 17 year old can drive a car? And where’s the justice here? I shouldn’t say this but because of this type of things I feel like sometimes people go out of their limits and try to take justice with their own hands. The way they start doing in US, kids taking guns and shooting people, just prosecute parents. Put them jail, other parents will be more careful in giving keys to car to so called minors. If you're 20 and then committed this crime, is it okay to spend the rest of your life in jail? It is not about the age, it's about the crime you've committed. It's about the families you've destroyed. Of course you should be guilty. But guilt wears off my friend. He needs to be taught a lesson. The lesson he has learnt today is even if you kill someone, money can help you out. He needs to be put in jail so he doesn't break the law again What is the purpose of punishment? Is it reform or revenge? no i do not support that to there needs to be a some kind of equilibrium for I have seen or understand majority of people in jail will not commit a crime again as they have gone through there consequence i not in suport of him but they way to do it there needs to be something we all now how humans can change its just my opinion as of age at age of 17 me myself do not about future of me the collage if get any this year so a crime guilt can be hell of something for my whole life Parents must be held accountable too Justice should work in favour of everyone. He's just 4 months away from being 18. 18 is the adulthood age according to the law, doesn't mean a switch in your mind activates as soon as you turn 18. You being 17 and being guilty does not justify you driving at a horrible 200kmph speed. Nor does it justify you drinking underage and and then driving. You have broken several laws, just because you're guilty doesn't make you any less criminal. If guilt was something that could rule out your punishment, there are several rapists and murderers who will roam around freely. \"Cattle class\" that's the phrase to use... From travelling in train like a cattle to being killed on road... there is no point of adding a law if you not even excercise it exactly my thought, its about time for us if you are driving at 200kmph at s public road, I don’t think you can call it an accident. Its like shooting bullets in public place and then claim it was an accident that the bullet killed someone that’s actually worse than killing someone I totally agree with what you said but there is a difference between commuting and an accident happening in this case I totally agree he was underage drunk and may have been driving reckless i do not now complete details but the way we are treating is he murdered some one and then on a free time everything has a consequence so there needs to be some time of jail or any other things to justify the the his reckless i am not a judge not of age to understand what complete right or wrong what should be the punishment but think media is not portraying the story as it should be but as a way that rich can do crime and nothing happens to them in all the story should.be around what was the boy doing what was happening in place of incident porche one of most powerful cars did the boy lost control or was there a malfunction with it how drunk the boy was why did the bar provide the alcohol to a minor and etc Accident is an accident not a murder then we have to treat every accident as a murder or every murder as an accident Are Bhai gaadi me kuch bhi hua hi, koi bhi situation rahi ho. 17 saal ka ladka gaadi chala sakta h kya? Zabardasti to nahi pakdai hogi na kisi ne? Ki tu chala isko. Daaru zabardasti to nahi pilai hogi kisi ne? Or nahi dekha to dekho, gaadi itni tez thi ki video me dikhi tak nahi. At least 200 ki speed thi. And yes. Rich can get away with anything in this country. Ambani k bete ne Aston Martin se logo ko uda Diya tha same way me. Raaton raat news gayab ho gayi thi har media house se. Rich manipulate the law, think of others as cockroaches and do not respect or value others. Jo usne Kiya galat tha, saza milni chahiye Powers and Functions of the Juvenile Justice Board As a minor the driver was produced before this Board not regular Magistrate Court Bhai me ye sab soch liya tha subha comment ke bad i understand me kaha galat tha me ye apne perspective se dekh Raha tha par in reality it's him who has done it so ya galti tho hai ab me ye topic leave kar raha the law will take care of rest 17 yr old still could get into a bar and drink as drinks were served to him ( law is 21 age limit ) . Driving license is for 18 plus yet he was using a car , so i suppose without license. Yet the judge felt its ok to let him go with minor punishment like writing an essay kudos to the entire judicial system which has been actually mocking the democratic country for the past few yrs . And their will be no action against the judge or anyone from the police or govt they will surely keep arresting people who are non govt but non from the govt . He has to be tried as an adult, because he considers himself adult enough to drink. Apparently the cops were busy serving him burgers and pizzas right after taking him to the station, instead of taking him for medical tests to ascertain alcohol content in his blood at the time. 🤦‍♂️ Yes ik it was the juvenile Justice board but I just used the term court so that ppl could understand better Hi guys! There is a peaceful protest being organized. Here is the whatsapp link to the group where admins will share more details. They are Currently waiting for permissions. Eh he kinda deserves it If he's old enough to drink and old enough to be drunk- driving, then he should be old enough to be tried as an adult responsible for taking two lives. You cannot start trying minors as adults if you want to progress as a nation. In the developed world, only the US does this (only in some cases), and there have been notorious mishaps like George Stinney, who was wrongly executed at the age of 14 in the 40s on a false testimony. Also, even if someone who is underage commits a murder, it cannot be treated with the same strictness as when an adult with a fully developed brain commits a murder. Just like we make special considerations for people who suffer from schizophrenia or psychosis, we make special considerations for people who have undeveloped brains. That is like human rights 101. I am always baffled that so many Indian people willingly promote things like charging minors as adults. This kind of thinking is going to keep India from progressing. There is a middle ground between giving someone a slap on the wrist and trying minors as adults. I agree the person who did this should be punished more harshly, but I don't agree that he should be tried as an adult. That sets a really horrible precedent that would disproportionately affect the poor. Bro he was 17 years 8 months old when he hit the vehicle. You really think 4 months would change anything in that rich brat's life??? I think you don't know much about law because this is counted as a heinous crime and if a minor commits a heinous crime he can be tried as an adult. He was drunk(underage) and was driving (also underage) and had no number plate on his car. You think writing an essay is called \"a slap on the hand\"? If he is old enough to get drunk, drive his daddy's cars, smoke pot, and kill two people then he certainly old enough to be considered as an adult. Also, I haven't said that we should try every minor as an adult, I just said we should try murderers as adults. Driving at such a speed on a crowded highway knowing you can hit someone and kill someone can be considered murder. I think it's time to be like the usa considering the amount of crimes being done by minors and getting away with it. Our country will only progress if we jail the murderer minors. If we let these monsters roam out on the streets what are the chances they won't hit you, me, our close ones or the public?? They might even do more heinous things in the future if we don't stop them at this age. Please think before you say something like this especially on social media. Watch this ! Hi. I'm serious. What should we do about this? I'm based out of Delhi. What do you think that could happen will he be charged I personally think no he’ll be freed very soon Unfortunately they probably have lot of money and clout to dodge such a situation. Would this case give birth to another Marianne Bachmeier? my condolences. may God lay his hand on the families of the deceased and give them strength and patience. a great loss! RIP🙏 and a great shame for the justice system! unfortunatelly it's not only india. where there is money, corruption is not far away. I really hope it does. These kind of people need to learn it the hard way. The only help we need is for you to spread this news and posters everywhere on social media with #arrestvedantagarwal. Put it on stories, posts, tweets as much as possible. Also send this to someone you know who lives in Pune and ask them to join the protest. It would really help us get as many people as we can and also it'll become really hard to suppress this news if it's all over India. Thanks for the concern and help♥️🙏🏼 It's not accidental if you drink and drive at high speed without having driving license. Nothing about it was accidental. Each step was done thoughtfully. It is a murder and should be considered as such. I agree but it will still be considered an \"accident\" legally as long as he didn't have any ill intentions towards the victims. not true if a cow is killed in an accident its a national issue. right wing will be on the street Can you elaborate more in what you just said? excatly , because he thinks he is adult so he should be treated as adult there is no justice in india , justice comes with price or long decades already got this height of coverup System ki mkc What is the update in this accident?? Is driver still behind bars or released?? Well as far as I know, the boy was kept in juvenile jail for like two weeks ig and his mother, father and grandfather were in judicial custody."
}