{
    "id": "1h4n0d5",
    "title": "Narayana Murthy is wrong: Indians are working too long and hard already | LME EP 50",
    "url": "https://youtu.be/5L6AuiPguq4",
    "selftext": "Does nation-building mean overworking India’s workforce? Does longer working hours mean more productivity or is the problem rooted in systemic inefficiencies like poor infrastructure, lack of investment in skills, and outdated policies? In the 50th episode of Let Me Explain, Pooja Prasanna unpacks Narayana Murthy’s controversial call for a 70-hour work week, with data, history, and real-world examples.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1733114524.0,
    "convurl": "https://external-preview.redd.it/glI-Dv6JbHYRoDBESGN64JXgAnDS0lEfU3_3_-B09SY.jpg?auto=webp&s=54ddd9c886441dd80d3e3680231243e4b03296bb",
    "comments": [
        "Does nation-building mean overworking India’s workforce? Does longer working hours mean more productivity or is the problem rooted in systemic inefficiencies like poor infrastructure, lack of investment in skills, and outdated policies? In the 50th episode of Let Me Explain, Pooja Prasanna unpacks Narayana Murthy’s controversial call for a 70-hour work week, with data, history, and real-world examples.",
        "Dei thatha, poi marindu saptu thoongda",
        "Narayanmurthy knows that the official 5x8 workweek for Indian white collar IT workers has already been unofficially converted to 6x10.\n\nHe's pushing to make it official because US/European firms don't pay billing for more than 40hr work weeks for a single person in India. If GOI officially allows increased work hours, he can now get more billing."
    ],
    "cleaned_text": "narayana murthy wrong indians working long hard already lme ep nationbuilding mean overworking indias workforce longer working hours mean productivity problem rooted systemic inefficiencies like poor infrastructure lack investment skills outdated policies th episode let explain pooja prasanna unpacks narayana murthys controversial call hour work week data history realworld examples ",
    "cleaned_title": "narayana murthy wrong indians working long hard already lme ep",
    "cleaned_selftext": "nationbuilding mean overworking indias workforce longer working hours mean productivity problem rooted systemic inefficiencies like poor infrastructure lack investment skills outdated policies th episode let explain pooja prasanna unpacks narayana murthys controversial call hour work week data history realworld examples",
    "cleaned_comments": "nationbuilding mean overworking indias workforce longer working hours mean productivity problem rooted systemic inefficiencies like poor infrastructure lack investment skills outdated policies th episode let explain pooja prasanna unpacks narayana murthys controversial call hour work week data history realworld examples dei thatha poi marindu saptu thoongda narayanmurthy knows official x workweek indian white collar workers already unofficially converted x hes pushing make official useuropean firms dont pay billing hr work weeks single person india goi officially allows increased work hours get billing",
    "light_cleaned_title": "Narayana Murthy is wrong: Indians are working too long and hard already | LME EP 50",
    "light_cleaned_selftext": "Does nation-building mean overworking India’s workforce? Does longer working hours mean more productivity or is the problem rooted in systemic inefficiencies like poor infrastructure, lack of investment in skills, and outdated policies? In the 50th episode of Let Me Explain, Pooja Prasanna unpacks Narayana Murthy’s controversial call for a 70-hour work week, with data, history, and real-world examples.",
    "light_cleaned_comments": "Does nation-building mean overworking India’s workforce? Does longer working hours mean more productivity or is the problem rooted in systemic inefficiencies like poor infrastructure, lack of investment in skills, and outdated policies? In the 50th episode of Let Me Explain, Pooja Prasanna unpacks Narayana Murthy’s controversial call for a 70-hour work week, with data, history, and real-world examples. Dei thatha, poi marindu saptu thoongda Narayanmurthy knows that the official 5x8 workweek for Indian white collar IT workers has already been unofficially converted to 6x10. He's pushing to make it official because US/European firms don't pay billing for more than 40hr work weeks for a single person in India. If GOI officially allows increased work hours, he can now get more billing."
}