{
    "id": "15ek65z",
    "title": "Give us complete break-up of 6,000 FIRs, SC tells Manipur government",
    "url": "https://www.thehindu.com/news/national/give-us-complete-break-up-of-6000-firs-sc-tells-manipur-government/article67142598.ece",
    "selftext": ">> “What were the police doing from May 4 to May 18? The incident came to light involving three women paraded naked in the presence of a mob. At least, two of them were raped. What were the police doing for 14 days?” Chief Justice Chandrachud asked Attorney General R. Venkataramani and Solicitor General Tushar Mehta, appearing for the Centre and the Manipur government.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1690819348.0,
    "convurl": "https://external-preview.redd.it/5q1vYoAVa5LFFbTOJ1LyBZlWknRj9_tXMmtRVhpqjgU.jpg?auto=webp&amp;v=enabled&amp;s=6572f3813e9fb7db76fbfdfaeb43acb5e43ce510",
    "comments": [
        "This is just the tip of the iceberg",
        "Expect the central government to intervene that this is out of bounds and that SC is getting into the affairs of the executive.\n\nWhile I am all for SC pulling up Manipur government because no one else is able to hold them accountable. However, longer term, the judiciary almost acting like an executive is not good for the country."
    ],
    "cleaned_text": "give us complete breakup firs sc tells manipur government police may may incident came light involving three women paraded naked presence mob least two raped police days chief justice chandrachud asked attorney general r venkataramani solicitor general tushar mehta appearing centre manipur government ",
    "cleaned_title": "give us complete breakup firs sc tells manipur government",
    "cleaned_selftext": "police may may incident came light involving three women paraded naked presence mob least two raped police days chief justice chandrachud asked attorney general r venkataramani solicitor general tushar mehta appearing centre manipur government",
    "cleaned_comments": "tip iceberg expect central government intervene bounds sc getting affairs executive sc pulling manipur government one else able hold accountable however longer term judiciary almost acting like executive good country",
    "light_cleaned_title": "Give us complete break-up of 6,000 FIRs, SC tells Manipur government",
    "light_cleaned_selftext": ">> “What were the police doing from May 4 to May 18? The incident came to light involving three women paraded naked in the presence of a mob. At least, two of them were raped. What were the police doing for 14 days?” Chief Justice Chandrachud asked Attorney General R. Venkataramani and Solicitor General Tushar Mehta, appearing for the Centre and the Manipur government.",
    "light_cleaned_comments": "This is just the tip of the iceberg Expect the central government to intervene that this is out of bounds and that SC is getting into the affairs of the executive. While I am all for SC pulling up Manipur government because no one else is able to hold them accountable. However, longer term, the judiciary almost acting like an executive is not good for the country."
}