{
    "id": "12oaged",
    "title": "T-Series Whatsapp Scam. Has anyone else received any similar message.",
    "url": "https://www.reddit.com/r/india/comments/12oaged/tseries_whatsapp_scam_has_anyone_else_received/",
    "selftext": "So i just received a text today saying that i have to subscribe n like a T-Series video for which i will receive some money. I know it's a scam but went along with it as initially some scammers pay u  money.\n\nhttps://preview.redd.it/rjtz9evn99ua1.png?width=1315&format=png&auto=webp&v=enabled&s=9137dcee3ac22d62073b71d48cb3c5099da49f3d\n\nAfter i sent a screenshot to them they gave me a code, they told me visit their Telegram n submit the code there.\n\nAfter doing that at telegram they r asking me name, age, gender n occupation.\n\n&#x200B;\n\nhttps://preview.redd.it/kshb5ihoa9ua1.png?width=1215&format=png&auto=webp&v=enabled&s=3fda156d84b841c2d57b465792f55e3eff6f59fe\n\nI would have gone further but i don't want to give my personal info to them.\n\nIk they already know my number n truecaller exists but still i don't want to do it myself.",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 6,
    "created_utc": 1681655392.0,
    "convurl": "https://b.thumbs.redditmedia.com/xxOxGStJ8hA5lV6ojMdnK2l4pg7JDTy0bkXqQZ2Dq7g.jpg",
    "comments": [
        "Give fake info for anything, either they check or they dont.",
        "I got the same",
        "Did u get the money?",
        "No. But one of my friend did this a legal way and he earned a bit good amount  atleast so much that he can afford tea and cigarettes for a week daily",
        "NGL that was what i was hoping for, but they asked for my details n i noped the fuck out."
    ],
    "cleaned_text": "tseries whatsapp scam anyone else received similar message received text today saying subscribe n like tseries video receive money know scam went along initially scammers pay u money sent screenshot gave code told visit telegram n submit code telegram r asking name age gender n occupation xb would gone dont want give personal info ik already know number n truecaller exists still dont want ",
    "cleaned_title": "tseries whatsapp scam anyone else received similar message",
    "cleaned_selftext": "received text today saying subscribe n like tseries video receive money know scam went along initially scammers pay u money sent screenshot gave code told visit telegram n submit code telegram r asking name age gender n occupation xb would gone dont want give personal info ik already know number n truecaller exists still dont want",
    "cleaned_comments": "give fake info anything either check dont got u get money one friend legal way earned bit good amount atleast much afford tea cigarettes week daily ngl hoping asked details n noped fuck",
    "light_cleaned_title": "T-Series Whatsapp Scam. Has anyone else received any similar message.",
    "light_cleaned_selftext": "So i just received a text today saying that i have to subscribe n like a T-Series video for which i will receive some money. I know it's a scam but went along with it as initially some scammers pay u money. After i sent a screenshot to them they gave me a code, they told me visit their Telegram n submit the code there. After doing that at telegram they r asking me name, age, gender n occupation. &#x200B; I would have gone further but i don't want to give my personal info to them. Ik they already know my number n truecaller exists but still i don't want to do it myself.",
    "light_cleaned_comments": "Give fake info for anything, either they check or they dont. I got the same Did u get the money? No. But one of my friend did this a legal way and he earned a bit good amount atleast so much that he can afford tea and cigarettes for a week daily NGL that was what i was hoping for, but they asked for my details n i noped the fuck out."
}