{
    "id": "14ygu0j",
    "title": "Urgent help needed: Fake loan",
    "url": "https://www.reddit.com/r/india/comments/14ygu0j/urgent_help_needed_fake_loan/",
    "selftext": "An idiot friend of mine downloaded an money lending app Verifile Ind https://apps.apple.com/in/app/verifile-ind-credit-loan-app/id6450492142\n\nIn the app description it said something like this\nhttps://imgur.com/a/1VJUCzC\nIt said no hidden charges and specific rate of interest. \n\nBut when the loan was dispersed it said almost 50% is processing fees. \n\nCancellation option is not working and no other option of cancelling the loan. Support is nonexistent. \n\nThe loan amount is dispersed into multiple amounts of Rs 5000 from different lenders and each processing fees is 50%.\nhttps://imgur.com/a/MsGJkau\n\nFrom doing a bit of research on the internet I can see it's a usual fake loan Chinese app. The app has access to contacts and for repayment they call their contacts and harass them. They have even threatened someone that they will morph their photos and send to his contacts.\n\nPlease help in advising in what way he can resolve this.",
    "flair": "AskIndia",
    "score": 8,
    "num_comments": 5,
    "created_utc": 1689243211.0,
    "convurl": "https://external-preview.redd.it/FLQS3hfnYMfMEMFT1McBTXbgV0doog9J4H7qCMyszic.jpg?auto=webp&s=fcbf911302381ac25d37ee649956537a1717ee8a",
    "comments": [
        "On iOS 3rd party apps don’t have access to contacts so don’t worry about harassment",
        "I wonder if it is possible to use a phone with no address book to apply for these loan sharks loans and then default?",
        "Yep it's possible. A lot of people ik used to Target these Chinese loan apps and never paid them back.",
        "Mere dosto me kar rakha hae ye sab😅",
        "Or put people you don't like in your contacts and then they get harassed, :)",
        "Block all their phone numbers. And ask ur friend to tell everyone on their contact list that their phone info has been hacked and that to ignore any calls from unknown nos.\nKuch nai ukhaad sakte hai saale wo log"
    ],
    "cleaned_text": "urgent help needed fake loan idiot friend mine downloaded money lending app verifile ind app description said something like said hidden charges specific rate interest loan dispersed said almost processing fees cancellation option working option cancelling loan support nonexistent loan amount dispersed multiple amounts rs different lenders processing fees bit research internet see usual fake loan chinese app app access contacts repayment call contacts harass even threatened someone morph photos send contacts please help advising way resolve ",
    "cleaned_title": "urgent help needed fake loan",
    "cleaned_selftext": "idiot friend mine downloaded money lending app verifile ind app description said something like said hidden charges specific rate interest loan dispersed said almost processing fees cancellation option working option cancelling loan support nonexistent loan amount dispersed multiple amounts rs different lenders processing fees bit research internet see usual fake loan chinese app app access contacts repayment call contacts harass even threatened someone morph photos send contacts please help advising way resolve",
    "cleaned_comments": "ios rd party apps dont access contacts dont worry harassment wonder possible use phone address book apply loan sharks loans default yep possible lot people ik used target chinese loan apps never paid back mere dosto kar rakha hae ye sab put people dont like contacts get harassed block phone numbers ask ur friend tell everyone contact list phone info hacked ignore calls unknown nos kuch nai ukhaad sakte hai saale wo log",
    "light_cleaned_title": "Urgent help needed: Fake loan",
    "light_cleaned_selftext": "An idiot friend of mine downloaded an money lending app Verifile Ind In the app description it said something like this It said no hidden charges and specific rate of interest. But when the loan was dispersed it said almost 50% is processing fees. Cancellation option is not working and no other option of cancelling the loan. Support is nonexistent. The loan amount is dispersed into multiple amounts of Rs 5000 from different lenders and each processing fees is 50%. From doing a bit of research on the internet I can see it's a usual fake loan Chinese app. The app has access to contacts and for repayment they call their contacts and harass them. They have even threatened someone that they will morph their photos and send to his contacts. Please help in advising in what way he can resolve this.",
    "light_cleaned_comments": "On iOS 3rd party apps don’t have access to contacts so don’t worry about harassment I wonder if it is possible to use a phone with no address book to apply for these loan sharks loans and then default? Yep it's possible. A lot of people ik used to Target these Chinese loan apps and never paid them back. Mere dosto me kar rakha hae ye sab😅 Or put people you don't like in your contacts and then they get harassed, :) Block all their phone numbers. And ask ur friend to tell everyone on their contact list that their phone info has been hacked and that to ignore any calls from unknown nos. Kuch nai ukhaad sakte hai saale wo log"
}