{
    "id": "16shec4",
    "title": "Soldier attacked by PFI terrorists in Kerala",
    "url": "https://www.reddit.com/r/india/comments/16shec4/soldier_attacked_by_pfi_terrorists_in_kerala/",
    "selftext": "Soldier was attacked by extremists in Kerala. Full picture yet to be disclosed. \n\nhttps://www.livemint.com/news/india/army-jawan-attacked-in-kerala-miscreants-tied-his-hands-wrote-pfi-on-back-11695634401230.html",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695714716.0,
    "convurl": "https://external-preview.redd.it/wsrTotIsfxLWEEdM0frPZRj7Jb0CuwAa7c9My9amWNw.jpg?auto=webp&s=9bcd9dc7b2ca558642fff882ea7888f0f2c47e00",
    "comments": [
        "Turned out to be staged by the soldier and his friend.",
        "Source. Kindly paste the link here",
        "https://keralakaumudi.com/en/news/mobile/news.php?id=1157189&u=",
        "Videos are running in local channels but interestingly the national portals are not picking it up despite the news going viral within Kerala",
        "https://www.news9live.com/state/kerala/pfi-attack-in-kollam-army-man-plotted-crime-to-become-famous-friend-confesses-2299943",
        "Knobs like that should be sent to prison for along time. The fake story got allot of attention on the Kerala sub and I thought that was a liberal sub. People were jumping to conclusions."
    ],
    "cleaned_text": "soldier attacked pfi terrorists kerala soldier attacked extremists kerala full picture yet disclosed ",
    "cleaned_title": "soldier attacked pfi terrorists kerala",
    "cleaned_selftext": "soldier attacked extremists kerala full picture yet disclosed",
    "cleaned_comments": "turned staged soldier friend source kindly paste link videos running local channels interestingly national portals picking despite news going viral within kerala knobs like sent prison along time fake story got allot attention kerala sub thought liberal sub people jumping conclusions",
    "light_cleaned_title": "Soldier attacked by PFI terrorists in Kerala",
    "light_cleaned_selftext": "Soldier was attacked by extremists in Kerala. Full picture yet to be disclosed.",
    "light_cleaned_comments": "Turned out to be staged by the soldier and his friend. Source. Kindly paste the link here Videos are running in local channels but interestingly the national portals are not picking it up despite the news going viral within Kerala Knobs like that should be sent to prison for along time. The fake story got allot of attention on the Kerala sub and I thought that was a liberal sub. People were jumping to conclusions."
}