{
    "id": "1530zdm",
    "title": "Congress and Co are missing a big point in 2024 strategy",
    "url": "https://www.reddit.com/r/india/comments/1530zdm/congress_and_co_are_missing_a_big_point_in_2024/",
    "selftext": "[https://www.ndtv.com/opinion/congress-and-co-are-missing-a-big-point-in-2024-strategy-4218990](https://www.ndtv.com/opinion/congress-and-co-are-missing-a-big-point-in-2024-strategy-4218990)\n\nSummary:\n\nNarendar Pani, Dean of the School of Social Sciences at Bengaluru's National Institute of Advanced Studies (NIAS) recently released a paper studying the voting patterns in the last 10 Loksabha elections.\n\nAccording to him this opposition unity and seat-sharing will only benefit BJP. He says in constituencies where a regional party is pitted against BJP, voters who would have voted for Congress will prefer to vote for BJP instead of the regional party, ideological differences notwithstanding.\n\nData from the last 10 Loksabha elections shows there is a strong preference to vote for national parties in Loksabha elections. Both Congress and BJP have benefited from this bias. So Congress forfeiting its seats to regional parties will be a significant disadvantage for Congress and the opposition.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689692783.0,
    "convurl": "https://external-preview.redd.it/zDZkKpLpzHQHQ3bIwW-I4hPwaeQIsGBvSkqYlFXzBz8.jpg?auto=webp&s=e47d1af925b828668f2ee2ed9e6e98e3265095e7",
    "comments": [
        "The argument makes sense in an academic context. The other thing to consider is how the Congress machinery works at ground level. If they can effectively get the message out that voting for xyz party is same as voting for Congress, then the above said disadvantage can be mitigated"
    ],
    "cleaned_text": "congress co missing big point strategy httpswwwndtvcomopinioncongressandcoaremissingabigpointinstrategyhttpswwwndtvcomopinioncongressandcoaremissingabigpointinstrategy summary narendar pani dean school social sciences bengalurus national institute advanced studies nias recently released paper studying voting patterns last loksabha elections according opposition unity seatsharing benefit bjp says constituencies regional party pitted bjp voters would voted congress prefer vote bjp instead regional party ideological differences notwithstanding data last loksabha elections shows strong preference vote national parties loksabha elections congress bjp benefited bias congress forfeiting seats regional parties significant disadvantage congress opposition ",
    "cleaned_title": "congress co missing big point strategy",
    "cleaned_selftext": "httpswwwndtvcomopinioncongressandcoaremissingabigpointinstrategyhttpswwwndtvcomopinioncongressandcoaremissingabigpointinstrategy summary narendar pani dean school social sciences bengalurus national institute advanced studies nias recently released paper studying voting patterns last loksabha elections according opposition unity seatsharing benefit bjp says constituencies regional party pitted bjp voters would voted congress prefer vote bjp instead regional party ideological differences notwithstanding data last loksabha elections shows strong preference vote national parties loksabha elections congress bjp benefited bias congress forfeiting seats regional parties significant disadvantage congress opposition",
    "cleaned_comments": "argument makes sense academic context thing consider congress machinery works ground level effectively get message voting xyz party voting congress said disadvantage mitigated",
    "light_cleaned_title": "Congress and Co are missing a big point in 2024 strategy",
    "light_cleaned_selftext": "[https://www.ndtv.com/opinion/congress-and-co-are-missing-a-big-point-in-2024-strategy-4218990](https://www.ndtv.com/opinion/congress-and-co-are-missing-a-big-point-in-2024-strategy-4218990) Summary: Narendar Pani, Dean of the School of Social Sciences at Bengaluru's National Institute of Advanced Studies (NIAS) recently released a paper studying the voting patterns in the last 10 Loksabha elections. According to him this opposition unity and seat-sharing will only benefit BJP. He says in constituencies where a regional party is pitted against BJP, voters who would have voted for Congress will prefer to vote for BJP instead of the regional party, ideological differences notwithstanding. Data from the last 10 Loksabha elections shows there is a strong preference to vote for national parties in Loksabha elections. Both Congress and BJP have benefited from this bias. So Congress forfeiting its seats to regional parties will be a significant disadvantage for Congress and the opposition.",
    "light_cleaned_comments": "The argument makes sense in an academic context. The other thing to consider is how the Congress machinery works at ground level. If they can effectively get the message out that voting for xyz party is same as voting for Congress, then the above said disadvantage can be mitigated"
}