{
    "id": "13pl1zk",
    "title": "Vent: The Cringe that is Indian Diaspora",
    "url": "https://www.reddit.com/r/india/comments/13pl1zk/vent_the_cringe_that_is_indian_diaspora/",
    "selftext": "If a picture is worth a thousand words, what do you say about this video? This blatant shamelessness, hypocrisy and rabid subjugation. And for who is this for… it is for a bigoted communal narcissistic hate monger which has caused real consequences for people and perhaps is somewhat responsible for covid second wave and the related death. We really are a low iq subjugated population. \n\nIf i sound like i am angry, i really am and this behaviour really get my goat. \n\nhttps://youtu.be/ran11aWoYpI",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 30,
    "created_utc": 1684839258.0,
    "convurl": "https://external-preview.redd.it/le6P5u-KsF-025-szyUR1mQLpMCov_-Tg183TVAywHs.jpg?auto=webp&v=enabled&s=2d73667603f193510b180383ca941328770dc5da",
    "comments": [
        "Then cast your vote to a better candidate.",
        "You think i voted for this lunatic?",
        "Not one false word in your diatribe here. I am hoping for his rout next year. That will be some good riddance to bad rubbish.\n\nEdited to add: And yes, the diaspora are idiots. I should know; I am surrounded by them. If a demagogue like Modi were to spring up in the countries they live in, they would have raised hell within a week. But for the home-grown fascist, they will bend over backwards to kiss his feet.",
        "Some claims of development can't be the reason 1000s of these Aussie Hindu families went to cheer him on a week day. \n\nOther development-centric PMs and ministers didn't get such reactions. Not even Vajpayee or Advani or any of the past or current cabinet ministers.\n\nI think the only reason they're cheering so passionately is because of his Hindu avenger king image from the 2002 Gujarat genocide and the systematic oppression of Muslims since 2014 by his vigilantes.",
        "I am so done with these people. If you love Modi and India so much you would surely have no problem living there? What are they still doing here? The mental gymnastics of the NRI bhakts are next level",
        "This , they see him as a religious super hero who will give Hindus the place they rightfully deserve in this world. Which also pampers to their closeted anti Muslim beliefs.. These are mostly uppercaste folks who felt disenfranchised in india due to caste politics and reservations. They see him as their savior who is giving voice to their beliefs....\nThey are least interested in other things..",
        "Why celebrate a pm visiting another country? What's he's gonna do for you ?",
        "But this ilk would never return to their Bharatmata.",
        "Ghanta!",
        "It is a simple two-part answer.\n\n1. BJP is extremely good at exploiting the latent biases and bigotry of upper caste Hindus.\n\n2. When these Hindus immigrate elsewhere, they continue to live in their immigrant bubbles and refuse to learn from the new environment they are in.",
        "Their anti-Muslim feelings haven't  been closeted for quite some time now.",
        "Damn they living rent free in your head.",
        "I cringe even more at your own ideological hypocrisy which has to cast aversions at a largely successful community which has done well for itself. Politics isn't the be all end all of life don't be so clouded in that world as to forget everything else that this same community contributed towards. If you can't tolerate small annoyances like these then how the hell do you tolerate your own family.",
        "Large successful community which has no problems with welcoming and being represented by a bigoted, narcissistic, dumb as a rock without teleprompter,  demagogue who was ultimately responsible for COVID second wave and is responsible for much of the wrongs currently in India including  diluting our federal structure, our democracy, our economy and the social cohesion.\n\nAustralia was and will still be a developed country with or without Indians. The community needs Australia more than it needs them - it's why they would not return back to India even though they would proclaim how good things are back home, the same community which would marry their sister to get the elusive visa to stay there and will beg and pray the government  if their visa gets canceled even for legitimate reasons and ask for mercy for themselves and their families as their lives would be forever be ruined if they are deported to India.\n\nIf you can't see the hypocrisy please close your eyes. Everything is hunky dory.\n\nFYI, this is not a small annoyance given the country they have adopted - they have adopted the wealth, the lifestyle, the social welfare, a future for their children without having adopted the VALUES that built the country that they were allowed to immigrate in first place. Now shut the F up. I dont care.",
        "And we dont, in your head, duck face?",
        "Oh so you just want them to be white and worship someone like Donald Trump instead. What is the point of this tirade?\nThe way I see it is I see white people spend money for much dumber and useless things and we don't critique them for it. But suddenly someone decides that using Modi's visit as a family outing is a bad idea. I don't like Modi but goddamn let other people live their lives in peace without judgement. If they choose to waste their money on a man who they couldn't even vote for and doesn't effect their lives at all then let them live in delusion they are smart enough to get out India they don't need your advice either.\n\nIf you didn't want to hear other opinions maybe don't post online because you clearly are assmad and care about this.",
        "Adopting the values of your adopted country isnt \"worshipping\" obtuse duck. Your insecurities do shine through though.\n\nSo can white supremacists organise a welcome for a hardcore right wing fascist which has either directly killed or is indirectly  responsible for killing people (a hitler for example) because it is their own money and they can chose to spend it however they want? It is afterall their own country - they aren't even immigrants like these numb nuts are. Dumb is not the same as Evil duck face.\n\nNow duck off. I am done engaging with an apologist.",
        "If you are done engaging why are you stalking me on reddit bro. Thanks for being my first hater.",
        "I do not form an opinion easily. I need to know how big of an a$$hole I am dealing with or that I am completely  and utterly wrong, say sorry and give him/her the benefit of doubt.",
        "Cool bro if you come around berkeley I'll buy you a drink. Its been fun.",
        "And if you are around Melbourne, shout out. \\*\\*Not Sarcasm\\*\\*"
    ],
    "cleaned_text": "vent cringe indian diaspora picture worth thousand words say video blatant shamelessness hypocrisy rabid subjugation bigoted communal narcissistic hate monger caused real consequences people perhaps somewhat responsible covid second wave related death really low iq subjugated population sound like angry really behaviour really get goat ",
    "cleaned_title": "vent cringe indian diaspora",
    "cleaned_selftext": "picture worth thousand words say video blatant shamelessness hypocrisy rabid subjugation bigoted communal narcissistic hate monger caused real consequences people perhaps somewhat responsible covid second wave related death really low iq subjugated population sound like angry really behaviour really get goat",
    "cleaned_comments": "cast vote better candidate think voted lunatic one false word diatribe hoping rout next year good riddance bad rubbish edited add yes diaspora idiots know surrounded demagogue like modi spring countries live would raised hell within week homegrown fascist bend backwards kiss feet claims development cant reason aussie hindu families went cheer week day developmentcentric pms ministers didnt get reactions even vajpayee advani past current cabinet ministers think reason theyre cheering passionately hindu avenger king image gujarat genocide systematic oppression muslims since vigilantes done people love modi india much would surely problem living still mental gymnastics nri bhakts next level see religious super hero give hindus place rightfully deserve world also pampers closeted anti muslim beliefs mostly uppercaste folks felt disenfranchised india due caste politics reservations see savior giving voice beliefs least interested things celebrate pm visiting another country whats hes gon na ilk would never return bharatmata ghanta simple twopart answer bjp extremely good exploiting latent biases bigotry upper caste hindus hindus immigrate elsewhere continue live immigrant bubbles refuse learn new environment antimuslim feelings havent closeted quite time damn living rent free head cringe even ideological hypocrisy cast aversions largely successful community done well politics isnt end life dont clouded world forget everything else community contributed towards cant tolerate small annoyances like hell tolerate family large successful community problems welcoming represented bigoted narcissistic dumb rock without teleprompter demagogue ultimately responsible covid second wave responsible much wrongs currently india including diluting federal structure democracy economy social cohesion australia still developed country without indians community needs australia needs would return back india even though would proclaim good things back home community would marry sister get elusive visa stay beg pray government visa gets canceled even legitimate reasons ask mercy families lives would forever ruined deported india cant see hypocrisy please close eyes everything hunky dory fyi small annoyance given country adopted adopted wealth lifestyle social welfare future children without adopted values built country allowed immigrate first place shut f dont care dont head duck face oh want white worship someone like donald trump instead point tirade way see see white people spend money much dumber useless things dont critique suddenly someone decides using modis visit family outing bad idea dont like modi goddamn let people live lives peace without judgement choose waste money man couldnt even vote doesnt effect lives let live delusion smart enough get india dont need advice either didnt want hear opinions maybe dont post online clearly assmad care adopting values adopted country isnt worshipping obtuse duck insecurities shine though white supremacists organise welcome hardcore right wing fascist either directly killed indirectly responsible killing people hitler example money chose spend however want afterall country arent even immigrants like numb nuts dumb evil duck face duck done engaging apologist done engaging stalking reddit bro thanks first hater form opinion easily need know big ahole dealing completely utterly wrong say sorry give himher benefit doubt cool bro come around berkeley ill buy drink fun around melbourne shout sarcasm",
    "light_cleaned_title": "Vent: The Cringe that is Indian Diaspora",
    "light_cleaned_selftext": "If a picture is worth a thousand words, what do you say about this video? This blatant shamelessness, hypocrisy and rabid subjugation. And for who is this for… it is for a bigoted communal narcissistic hate monger which has caused real consequences for people and perhaps is somewhat responsible for covid second wave and the related death. We really are a low iq subjugated population. If i sound like i am angry, i really am and this behaviour really get my goat.",
    "light_cleaned_comments": "Then cast your vote to a better candidate. You think i voted for this lunatic? Not one false word in your diatribe here. I am hoping for his rout next year. That will be some good riddance to bad rubbish. Edited to add: And yes, the diaspora are idiots. I should know; I am surrounded by them. If a demagogue like Modi were to spring up in the countries they live in, they would have raised hell within a week. But for the home-grown fascist, they will bend over backwards to kiss his feet. Some claims of development can't be the reason 1000s of these Aussie Hindu families went to cheer him on a week day. Other development-centric PMs and ministers didn't get such reactions. Not even Vajpayee or Advani or any of the past or current cabinet ministers. I think the only reason they're cheering so passionately is because of his Hindu avenger king image from the 2002 Gujarat genocide and the systematic oppression of Muslims since 2014 by his vigilantes. I am so done with these people. If you love Modi and India so much you would surely have no problem living there? What are they still doing here? The mental gymnastics of the NRI bhakts are next level This , they see him as a religious super hero who will give Hindus the place they rightfully deserve in this world. Which also pampers to their closeted anti Muslim beliefs.. These are mostly uppercaste folks who felt disenfranchised in india due to caste politics and reservations. They see him as their savior who is giving voice to their beliefs.... They are least interested in other things.. Why celebrate a pm visiting another country? What's he's gonna do for you ? But this ilk would never return to their Bharatmata. Ghanta! It is a simple two-part answer. 1. BJP is extremely good at exploiting the latent biases and bigotry of upper caste Hindus. 2. When these Hindus immigrate elsewhere, they continue to live in their immigrant bubbles and refuse to learn from the new environment they are in. Their anti-Muslim feelings haven't been closeted for quite some time now. Damn they living rent free in your head. I cringe even more at your own ideological hypocrisy which has to cast aversions at a largely successful community which has done well for itself. Politics isn't the be all end all of life don't be so clouded in that world as to forget everything else that this same community contributed towards. If you can't tolerate small annoyances like these then how the hell do you tolerate your own family. Large successful community which has no problems with welcoming and being represented by a bigoted, narcissistic, dumb as a rock without teleprompter, demagogue who was ultimately responsible for COVID second wave and is responsible for much of the wrongs currently in India including diluting our federal structure, our democracy, our economy and the social cohesion. Australia was and will still be a developed country with or without Indians. The community needs Australia more than it needs them - it's why they would not return back to India even though they would proclaim how good things are back home, the same community which would marry their sister to get the elusive visa to stay there and will beg and pray the government if their visa gets canceled even for legitimate reasons and ask for mercy for themselves and their families as their lives would be forever be ruined if they are deported to India. If you can't see the hypocrisy please close your eyes. Everything is hunky dory. FYI, this is not a small annoyance given the country they have adopted - they have adopted the wealth, the lifestyle, the social welfare, a future for their children without having adopted the VALUES that built the country that they were allowed to immigrate in first place. Now shut the F up. I dont care. And we dont, in your head, duck face? Oh so you just want them to be white and worship someone like Donald Trump instead. What is the point of this tirade? The way I see it is I see white people spend money for much dumber and useless things and we don't critique them for it. But suddenly someone decides that using Modi's visit as a family outing is a bad idea. I don't like Modi but goddamn let other people live their lives in peace without judgement. If they choose to waste their money on a man who they couldn't even vote for and doesn't effect their lives at all then let them live in delusion they are smart enough to get out India they don't need your advice either. If you didn't want to hear other opinions maybe don't post online because you clearly are assmad and care about this. Adopting the values of your adopted country isnt \"worshipping\" obtuse duck. Your insecurities do shine through though. So can white supremacists organise a welcome for a hardcore right wing fascist which has either directly killed or is indirectly responsible for killing people (a hitler for example) because it is their own money and they can chose to spend it however they want? It is afterall their own country - they aren't even immigrants like these numb nuts are. Dumb is not the same as Evil duck face. Now duck off. I am done engaging with an apologist. If you are done engaging why are you stalking me on reddit bro. Thanks for being my first hater. I do not form an opinion easily. I need to know how big of an a$$hole I am dealing with or that I am completely and utterly wrong, say sorry and give him/her the benefit of doubt. Cool bro if you come around berkeley I'll buy you a drink. Its been fun. And if you are around Melbourne, shout out. \\*\\*Not Sarcasm\\*\\*"
}