{
    "id": "12kphnx",
    "title": "Tibetans Say the Dalai Lama’s ‘Suck My Tongue’ Viral Video Is Being Misinterpreted | Vice",
    "url": "https://www.vice.com/en/article/n7evaw/dalai-lama-suck-my-tongue-video-tibet-china",
    "selftext": "Sub-title - Tibet’s exiled spiritual leader has often courted controversy for his off-the-cuff jokes that his supporters say are “lost in translation.”\n___\nA part of the article: \n>Jamyang Phuntsok, a Tibetan filmmaker and podcaster in India, told VICE World News that it’s possible to acknowledge both the innocence of the Dalai Lama and the outrage of people across the world. The video made him feel awkward, he admitted, but the context is missing.\n\n>“I’m sure that the Dalai Lama had no bad or evil intentions, and that it came, to some extent, from the naivete of how such gestures might be interpreted in our modern, hyper-sexualised society,” he said. \n\n>“But for many non-Tibetans, it’s easier to feel outrage and condemn than to delve deeper into what kind of a man he is, what he represents and means for so many oppressed people around the world.” \n\n>“Such is the fickle nature of fame and infamy.”",
    "flair": "Politics",
    "score": 31,
    "num_comments": 21,
    "created_utc": 1681393024.0,
    "convurl": "https://external-preview.redd.it/7qcaWFKglegI4Y2mg1px2sWGWy-OVTwxX3FvYkjzVxI.jpg?auto=webp&v=enabled&s=1c7f665807fb612db6ec52e8e9e46ba81bc93f7a",
    "comments": [
        "What that tongue do. Any Tibetan ladies know?",
        "his english isnt good. he meant to say 'see my tongue'. You can compare it to showing your tongue to tease a child",
        "Bloody pervert",
        "are you his lawyer?",
        "any Indo-Tibetan who can provide context.",
        "> he meant to say 'see my tongue'. You can compare it to showing your tongue to tease a child",
        "nope. just read up about the context of what he was doing.",
        "See my tongue and shoving it down a kid’s mouth are two different things. Stop justifying religious paedophiles.",
        "I watched the video again because of how serious your accusation is.\n\nThe boy asks \"can I hug you\"\n\nDalai Lama doesnt understand and needs it translated. Someone translates it for him. He accepts the hug. The asks the boy to kiss him on his cheeks and lips. The lips kiss bothers me but it was just a brush of the lips. \n\nDalai Lama says \"suck.. my tongue\" and leans in to the boy\n\nWhen boy leans in as well and then is playfully chastised by the Dalai Lama. No tongue sucking attempted.\n\nThink what you must"
    ],
    "cleaned_text": "tibetans say dalai lamas suck tongue viral video misinterpreted vice subtitle tibets exiled spiritual leader often courted controversy offthecuff jokes supporters say lost translation part article jamyang phuntsok tibetan filmmaker podcaster india told vice world news possible acknowledge innocence dalai lama outrage people across world video made feel awkward admitted context missing im sure dalai lama bad evil intentions came extent naivete gestures might interpreted modern hypersexualised society said many nontibetans easier feel outrage condemn delve deeper kind man represents means many oppressed people around world fickle nature fame infamy ",
    "cleaned_title": "tibetans say dalai lamas suck tongue viral video misinterpreted vice",
    "cleaned_selftext": "subtitle tibets exiled spiritual leader often courted controversy offthecuff jokes supporters say lost translation part article jamyang phuntsok tibetan filmmaker podcaster india told vice world news possible acknowledge innocence dalai lama outrage people across world video made feel awkward admitted context missing im sure dalai lama bad evil intentions came extent naivete gestures might interpreted modern hypersexualised society said many nontibetans easier feel outrage condemn delve deeper kind man represents means many oppressed people around world fickle nature fame infamy",
    "cleaned_comments": "tongue tibetan ladies know english isnt good meant say see tongue compare showing tongue tease child bloody pervert lawyer indotibetan provide context meant say see tongue compare showing tongue tease child nope read context see tongue shoving kids mouth two different things stop justifying religious paedophiles watched video serious accusation boy asks hug dalai lama doesnt understand needs translated someone translates accepts hug asks boy kiss cheeks lips lips kiss bothers brush lips dalai lama says suck tongue leans boy boy leans well playfully chastised dalai lama tongue sucking attempted think must",
    "light_cleaned_title": "Tibetans Say the Dalai Lama’s ‘Suck My Tongue’ Viral Video Is Being Misinterpreted | Vice",
    "light_cleaned_selftext": "Sub-title - Tibet’s exiled spiritual leader has often courted controversy for his off-the-cuff jokes that his supporters say are “lost in translation.” ___ A part of the article: >Jamyang Phuntsok, a Tibetan filmmaker and podcaster in India, told VICE World News that it’s possible to acknowledge both the innocence of the Dalai Lama and the outrage of people across the world. The video made him feel awkward, he admitted, but the context is missing. >“I’m sure that the Dalai Lama had no bad or evil intentions, and that it came, to some extent, from the naivete of how such gestures might be interpreted in our modern, hyper-sexualised society,” he said. >“But for many non-Tibetans, it’s easier to feel outrage and condemn than to delve deeper into what kind of a man he is, what he represents and means for so many oppressed people around the world.” >“Such is the fickle nature of fame and infamy.”",
    "light_cleaned_comments": "What that tongue do. Any Tibetan ladies know? his english isnt good. he meant to say 'see my tongue'. You can compare it to showing your tongue to tease a child Bloody pervert are you his lawyer? any Indo-Tibetan who can provide context. > he meant to say 'see my tongue'. You can compare it to showing your tongue to tease a child nope. just read up about the context of what he was doing. See my tongue and shoving it down a kid’s mouth are two different things. Stop justifying religious paedophiles. I watched the video again because of how serious your accusation is. The boy asks \"can I hug you\" Dalai Lama doesnt understand and needs it translated. Someone translates it for him. He accepts the hug. The asks the boy to kiss him on his cheeks and lips. The lips kiss bothers me but it was just a brush of the lips. Dalai Lama says \"suck.. my tongue\" and leans in to the boy When boy leans in as well and then is playfully chastised by the Dalai Lama. No tongue sucking attempted. Think what you must"
}