{
    "id": "1eob94f",
    "title": "Flipkart Scam Alert !! Worth 35k",
    "url": "https://www.reddit.com/gallery/1eob94f",
    "selftext": "**Here's the rundown:**\n1. Placed an order for Apple Watch Series 9 ( Silver-45mm) \n2. Didn't had open box delivery option\n3. Received the package. Only to find a used black watch inside (inside a silver apple watch box) 😡\n\n**Problem I faced**\nI ordered an Apple Watch Series 9 (45mm - Silver) from Flipkart on August 6, 2024. The package was delivered on the same day.\n\nI was aware that it wasn't an open box delivery, so I recorded an uncut unboxing video as a precaution. The external packaging looked fine and matched the invoice for a silver Apple Watch. However, once I opened it, I found a fake black watch that won't even turn on.\n\n\n**What I Need:**\n- Advice from those who have faced similar issues with Flipkart.\n- Any guidance on how to escalate this further.\n- Your thoughts on my situation.\n\n\n",
    "flair": "Law & Courts",
    "score": 34,
    "num_comments": 26,
    "created_utc": 1723238147.0,
    "convurl": "https://i.redd.it/56uhkimqfphd1.jpg",
    "comments": [
        "Just keep in touch with customer care and keep following over the mails. Wrong/fake delivery is not the new concept and in majority of cases companies do give refund/replacement.",
        "Not sure how this scam website is still functioning and why people still order from Flopkart, especially expensive shit",
        "Don't buy anything from flipkart",
        "Flipkart is chor!",
        "If all else fails try consumer court. After all you have the video proof of unboxing.",
        "Why not buy it directly from Apple's website?",
        "r/fuckFlipkart\n\nCheck",
        "Why do people still use Flipkart!!",
        "It's not just used but looks fake too. The rotary noob is slightly tilted and even the button is not looking good. \n\nWait for 1 week or 10 days max and move to Consumer Court. Flipkart is liable to provide genuine products. \n\nThough I guess you should share the seller name too with the people, mostly looks like seller is the main culprit rather than the Flipkart. Next time please go through the seller when purchasing expensive stuff from E-commerce.",
        "Always, ALWAYS  buy from assured sellers only. Don't go grabbing a deal if the seller isn't trustworthy, whether it be this site or some other. And no open box delivery for something this expensive is suspicious in itself. \n \nDo your due diligence, it's your hard earned money",
        "saar i get 2rs discount on flipkart. I can't maintain that lifestyle but I still want to flex on people around me.",
        "Return it ... Is that not an option?",
        "Assured sellers on flipkart are fake too. I have seen assured sellers whose time on the platform shows they have been set up only a month before. Scammers pay flipkart to get that tag.",
        "By double dipping. Gets a cut from customers on spiked up products. And also gets a cut from sellers who buy the FK Assured tag.",
        "Flipkart doing what it’s best at. I know it’s not directly them but they are ones who we’re dealing with.",
        "PSA for anyone buying from Flipkart - they do open box delivery now so the onus is shifted on to the consumer to check the product before giving delivery OTP. Once you give OTP it is game over\n\nMake delivery executive open the box, check whatever checks you have to make (serial no, warranty on apple website, charging status etc) without giving the OTP. If the executive throws a tantrum, refuse to accept the product, but never give OTP without checking",
        "Flipkart is actually Scamkart!!",
        "Not a scam. That's just the stup***ty tax you pay for shopping on Flipkart in this day and age.",
        "How old are you?",
        "Old enough to not be stupid to believe in flipkart \"discounts\"",
        "I’ve been in the same situation but luckily it was an open box delivery for me so I rejected it and you can check the watch serial number on Apples website and see when it was activated if it’s before your purchase date you can submit that as proof to Flipkart saying you got used product and you can tell them you’ll take a legal action, in my case I checked the serial number in Apples website and watch was activated 8 months ago so I rejected the delivery and got refund"
    ],
    "cleaned_text": "flipkart scam alert worth k heres rundown placed order apple watch series silvermm didnt open box delivery option received package find used black watch inside inside silver apple watch box problem faced ordered apple watch series mm silver flipkart august package delivered day aware wasnt open box delivery recorded uncut unboxing video precaution external packaging looked fine matched invoice silver apple watch however opened found fake black watch wont even turn need advice faced similar issues flipkart guidance escalate thoughts situation ",
    "cleaned_title": "flipkart scam alert worth k",
    "cleaned_selftext": "heres rundown placed order apple watch series silvermm didnt open box delivery option received package find used black watch inside inside silver apple watch box problem faced ordered apple watch series mm silver flipkart august package delivered day aware wasnt open box delivery recorded uncut unboxing video precaution external packaging looked fine matched invoice silver apple watch however opened found fake black watch wont even turn need advice faced similar issues flipkart guidance escalate thoughts situation",
    "cleaned_comments": "keep touch customer care keep following mails wrongfake delivery new concept majority cases companies give refundreplacement sure scam website still functioning people still order flopkart especially expensive shit dont buy anything flipkart flipkart chor else fails try consumer court video proof unboxing buy directly apples website rfuckflipkart check people still use flipkart used looks fake rotary noob slightly tilted even button looking good wait week days max move consumer court flipkart liable provide genuine products though guess share seller name people mostly looks like seller main culprit rather flipkart next time please go seller purchasing expensive stuff ecommerce always always buy assured sellers dont go grabbing deal seller isnt trustworthy whether site open box delivery something expensive suspicious due diligence hard earned money saar get rs discount flipkart cant maintain lifestyle still want flex people around return option assured sellers flipkart fake seen assured sellers whose time platform shows set month scammers pay flipkart get tag double dipping gets cut customers spiked products also gets cut sellers buy fk assured tag flipkart best know directly ones dealing psa anyone buying flipkart open box delivery onus shifted consumer check product giving delivery otp give otp game make delivery executive open box check whatever checks make serial warranty apple website charging status etc without giving otp executive throws tantrum refuse accept product never give otp without checking flipkart actually scamkart scam thats stupty tax pay shopping flipkart day age old old enough stupid believe flipkart discounts ive situation luckily open box delivery rejected check watch serial number apples website see activated purchase date submit proof flipkart saying got used product tell youll take legal action case checked serial number apples website watch activated months ago rejected delivery got refund",
    "light_cleaned_title": "Flipkart Scam Alert !! Worth 35k",
    "light_cleaned_selftext": "**Here's the rundown:** 1. Placed an order for Apple Watch Series 9 ( Silver-45mm) 2. Didn't had open box delivery option 3. Received the package. Only to find a used black watch inside (inside a silver apple watch box) 😡 **Problem I faced** I ordered an Apple Watch Series 9 (45mm - Silver) from Flipkart on August 6, 2024. The package was delivered on the same day. I was aware that it wasn't an open box delivery, so I recorded an uncut unboxing video as a precaution. The external packaging looked fine and matched the invoice for a silver Apple Watch. However, once I opened it, I found a fake black watch that won't even turn on. **What I Need:** - Advice from those who have faced similar issues with Flipkart. - Any guidance on how to escalate this further. - Your thoughts on my situation.",
    "light_cleaned_comments": "Just keep in touch with customer care and keep following over the mails. Wrong/fake delivery is not the new concept and in majority of cases companies do give refund/replacement. Not sure how this scam website is still functioning and why people still order from Flopkart, especially expensive shit Don't buy anything from flipkart Flipkart is chor! If all else fails try consumer court. After all you have the video proof of unboxing. Why not buy it directly from Apple's website? r/fuckFlipkart Check Why do people still use Flipkart!! It's not just used but looks fake too. The rotary noob is slightly tilted and even the button is not looking good. Wait for 1 week or 10 days max and move to Consumer Court. Flipkart is liable to provide genuine products. Though I guess you should share the seller name too with the people, mostly looks like seller is the main culprit rather than the Flipkart. Next time please go through the seller when purchasing expensive stuff from E-commerce. Always, ALWAYS buy from assured sellers only. Don't go grabbing a deal if the seller isn't trustworthy, whether it be this site or some other. And no open box delivery for something this expensive is suspicious in itself. Do your due diligence, it's your hard earned money saar i get 2rs discount on flipkart. I can't maintain that lifestyle but I still want to flex on people around me. Return it ... Is that not an option? Assured sellers on flipkart are fake too. I have seen assured sellers whose time on the platform shows they have been set up only a month before. Scammers pay flipkart to get that tag. By double dipping. Gets a cut from customers on spiked up products. And also gets a cut from sellers who buy the FK Assured tag. Flipkart doing what it’s best at. I know it’s not directly them but they are ones who we’re dealing with. PSA for anyone buying from Flipkart - they do open box delivery now so the onus is shifted on to the consumer to check the product before giving delivery OTP. Once you give OTP it is game over Make delivery executive open the box, check whatever checks you have to make (serial no, warranty on apple website, charging status etc) without giving the OTP. If the executive throws a tantrum, refuse to accept the product, but never give OTP without checking Flipkart is actually Scamkart!! Not a scam. That's just the stup***ty tax you pay for shopping on Flipkart in this day and age. How old are you? Old enough to not be stupid to believe in flipkart \"discounts\" I’ve been in the same situation but luckily it was an open box delivery for me so I rejected it and you can check the watch serial number on Apples website and see when it was activated if it’s before your purchase date you can submit that as proof to Flipkart saying you got used product and you can tell them you’ll take a legal action, in my case I checked the serial number in Apples website and watch was activated 8 months ago so I rejected the delivery and got refund"
}