{
    "id": "1esosb4",
    "title": "Backside of the bill was someone's Aadhar copy",
    "url": "https://i.redd.it/qi7s3d4n1sid1.jpeg",
    "selftext": "Took photocopy of some documents for work & asked the shopkeeper to give me a bill so that I can get it reimbursed, the back side of the bill was a copy of someone's Aadhar\n\nNot sure if this can be misused, but makes one wonder how many have copies of one's Aadhar.\n\nShould asking photocopies of Govt. Documents be prohibited & shift everything to Digital?",
    "flair": "Policy/Economy",
    "score": 33,
    "num_comments": 11,
    "created_utc": 1723705573.0,
    "convurl": "https://i.redd.it/qi7s3d4n1sid1.jpeg",
    "comments": [
        "Ahh yess adhaar is totally secure",
        "Typical",
        "These photocopy/printout shops are a privacy nightmare, and a dream come true for scammers/spammers.",
        "Are you new to India we are used to see people passport, aadhar and pan card on the page in which chutney and samosa are served.",
        "Well this was my first time seeing it.",
        "... behind 13 feet thick/ tall walls 🤣",
        "Looks like some office or individual gave out raddhi (scrap sale) of old documents. Real stupid of them.",
        "I've never seen personal doucments but i have seen marksheet copies, exam hall ticket copies, and declaration copies. People should burn or tear these documents rather than giving them in raddhi.",
        "This is Aadhar only.\n\nFew years back a street vendor was selling street food in wrappers made of  photocopies of Students Marksheet",
        "Guarded by chowkidars with 56 inch chest"
    ],
    "cleaned_text": "backside bill someones aadhar copy took photocopy documents work asked shopkeeper give bill get reimbursed back side bill copy someones aadhar sure misused makes one wonder many copies ones aadhar asking photocopies govt documents prohibited shift everything digital ",
    "cleaned_title": "backside bill someones aadhar copy",
    "cleaned_selftext": "took photocopy documents work asked shopkeeper give bill get reimbursed back side bill copy someones aadhar sure misused makes one wonder many copies ones aadhar asking photocopies govt documents prohibited shift everything digital",
    "cleaned_comments": "ahh yess adhaar totally secure typical photocopyprintout shops privacy nightmare dream come true scammersspammers new india used see people passport aadhar pan card page chutney samosa served well first time seeing behind feet thick tall walls looks like office individual gave raddhi scrap sale old documents real stupid ive never seen personal doucments seen marksheet copies exam hall ticket copies declaration copies people burn tear documents rather giving raddhi aadhar years back street vendor selling street food wrappers made photocopies students marksheet guarded chowkidars inch chest",
    "light_cleaned_title": "Backside of the bill was someone's Aadhar copy",
    "light_cleaned_selftext": "Took photocopy of some documents for work & asked the shopkeeper to give me a bill so that I can get it reimbursed, the back side of the bill was a copy of someone's Aadhar Not sure if this can be misused, but makes one wonder how many have copies of one's Aadhar. Should asking photocopies of Govt. Documents be prohibited & shift everything to Digital?",
    "light_cleaned_comments": "Ahh yess adhaar is totally secure Typical These photocopy/printout shops are a privacy nightmare, and a dream come true for scammers/spammers. Are you new to India we are used to see people passport, aadhar and pan card on the page in which chutney and samosa are served. Well this was my first time seeing it. ... behind 13 feet thick/ tall walls 🤣 Looks like some office or individual gave out raddhi (scrap sale) of old documents. Real stupid of them. I've never seen personal doucments but i have seen marksheet copies, exam hall ticket copies, and declaration copies. People should burn or tear these documents rather than giving them in raddhi. This is Aadhar only. Few years back a street vendor was selling street food in wrappers made of photocopies of Students Marksheet Guarded by chowkidars with 56 inch chest"
}