{
    "id": "16688sz",
    "title": "XpressBees is a scam business",
    "url": "https://www.reddit.com/r/india/comments/16688sz/xpressbees_is_a_scam_business/",
    "selftext": "It's the 3rd instances when XpressBees is playing games with my package. Previously I ordered a Vaccum cleaner (it was a corporate gift) and that gifting portal had Xpressbee as the delivery partner.\n\n XpressBees never attempted a delivery but kept sending me sms that we couldn't find you at home so couldn't deliver your package and this went on for 8-12 days. I tried calling on their customer support but for no avail. \n\nThis time I ordered something from Frido (another scam business) and they have XpressBees as their partner. Since 5 days, my package is 40km away from me (I live in Chandigarh and the package is in Ambala).\n\nEveryday, they update the status twice:\n1. In transit arrived at facility\n2. In transit departed from facility\n\nAnd this has been going since 5 days.\n\nPreviously, the vaccum cleaner was a gift. And I left the company so I couldn't contact HR. This time I've paid for the order so I'm not gonna let it slip away.\n\nThe worst thing is that Frido-- www.myfrido.com (they sell cushions, etc) isn't doing anything other than sending templated emails that too in a gap of 16-24 hours.\n\nThe bottom line is never order anything from any d2c business in india that partners with XpressBees. The later is a scam business and the former could be as well.\n\nI'm not sure if these guys gonna refund me or not or if they ever gonna deliver my package.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693480402.0,
    "convurl": "https://external-preview.redd.it/9oaSP6Eo8Ci-S3VGox8MmvT1R4_HmDpbMG6XsLHBjJs.jpg?auto=webp&s=96c79c0d2f67568a53f548e4241e9a4c98f130ed",
    "comments": [
        "I have received 10s of orders from Expressbees, no issues.\n\nMaybe call expressbees and ask. Their support do pick up call without wait.\n\nI faced issues with ecom multiple times, delhivery is slow in my area, but not with xb. Ig different services are good in different regions.",
        "Bro, they are really really really pathetic here in Chandigarh."
    ],
    "cleaned_text": "xpressbees scam business rd instances xpressbees playing games package previously ordered vaccum cleaner corporate gift gifting portal xpressbee delivery partner xpressbees never attempted delivery kept sending sms couldnt find home couldnt deliver package went days tried calling customer support avail time ordered something frido another scam business xpressbees partner since days package km away live chandigarh package ambala everyday update status twice transit arrived facility transit departed facility going since days previously vaccum cleaner gift left company couldnt contact hr time ive paid order im gon na let slip away worst thing frido sell cushions etc isnt anything sending templated emails gap hours bottom line never order anything dc business india partners xpressbees later scam business former could well im sure guys gon na refund ever gon na deliver package ",
    "cleaned_title": "xpressbees scam business",
    "cleaned_selftext": "rd instances xpressbees playing games package previously ordered vaccum cleaner corporate gift gifting portal xpressbee delivery partner xpressbees never attempted delivery kept sending sms couldnt find home couldnt deliver package went days tried calling customer support avail time ordered something frido another scam business xpressbees partner since days package km away live chandigarh package ambala everyday update status twice transit arrived facility transit departed facility going since days previously vaccum cleaner gift left company couldnt contact hr time ive paid order im gon na let slip away worst thing frido sell cushions etc isnt anything sending templated emails gap hours bottom line never order anything dc business india partners xpressbees later scam business former could well im sure guys gon na refund ever gon na deliver package",
    "cleaned_comments": "received orders expressbees issues maybe call expressbees ask support pick call without wait faced issues ecom multiple times delhivery slow area xb ig different services good different regions bro really really really pathetic chandigarh",
    "light_cleaned_title": "XpressBees is a scam business",
    "light_cleaned_selftext": "It's the 3rd instances when XpressBees is playing games with my package. Previously I ordered a Vaccum cleaner (it was a corporate gift) and that gifting portal had Xpressbee as the delivery partner. XpressBees never attempted a delivery but kept sending me sms that we couldn't find you at home so couldn't deliver your package and this went on for 8-12 days. I tried calling on their customer support but for no avail. This time I ordered something from Frido (another scam business) and they have XpressBees as their partner. Since 5 days, my package is 40km away from me (I live in Chandigarh and the package is in Ambala). Everyday, they update the status twice: 1. In transit arrived at facility 2. In transit departed from facility And this has been going since 5 days. Previously, the vaccum cleaner was a gift. And I left the company so I couldn't contact HR. This time I've paid for the order so I'm not gonna let it slip away. The worst thing is that Frido-- (they sell cushions, etc) isn't doing anything other than sending templated emails that too in a gap of 16-24 hours. The bottom line is never order anything from any d2c business in india that partners with XpressBees. The later is a scam business and the former could be as well. I'm not sure if these guys gonna refund me or not or if they ever gonna deliver my package.",
    "light_cleaned_comments": "I have received 10s of orders from Expressbees, no issues. Maybe call expressbees and ask. Their support do pick up call without wait. I faced issues with ecom multiple times, delhivery is slow in my area, but not with xb. Ig different services are good in different regions. Bro, they are really really really pathetic here in Chandigarh."
}