{
    "id": "197qb11",
    "title": "Quiz-related Entertainment/Sweepstake message is being classfied as 'Not a UCC' by TSPs",
    "url": "https://www.reddit.com/r/india/comments/197qb11/quizrelated_entertainmentsweepstake_message_is/",
    "selftext": "1. Are TSPs under duress or coercion to allow this message to be allowed to all citizens without prosecuting it under DND framework? \n2. In what ways it classifies as Transactional and/or Administration and/or Critical Alert message? TSPs dismiss DND complaint as Not a UCC\n3. At least half a dozen alerts are being pushed within the first half of the week itself from almost same Sender ID.\n\n&#x200B;\n\nhttps://preview.redd.it/363lrwzpgpcc1.png?width=717&format=png&auto=webp&s=a22b1215fd1a96ece9bd57b5efd9b6e3fd7d6474",
    "flair": "Law & Courts",
    "score": 3,
    "num_comments": 1,
    "created_utc": 1705368729.0,
    "convurl": "https://a.thumbs.redditmedia.com/AqMSKbyordnyirKj227ZJuRMG4tpr4wcP30qVOVV3O0.jpg",
    "comments": [],
    "cleaned_text": "quizrelated entertainmentsweepstake message classfied ucc tsps tsps duress coercion allow message allowed citizens without prosecuting dnd framework ways classifies transactional andor administration andor critical alert message tsps dismiss dnd complaint ucc least half dozen alerts pushed within first half week almost sender id xb ",
    "cleaned_title": "quizrelated entertainmentsweepstake message classfied ucc tsps",
    "cleaned_selftext": "tsps duress coercion allow message allowed citizens without prosecuting dnd framework ways classifies transactional andor administration andor critical alert message tsps dismiss dnd complaint ucc least half dozen alerts pushed within first half week almost sender id xb",
    "cleaned_comments": "",
    "light_cleaned_title": "Quiz-related Entertainment/Sweepstake message is being classfied as 'Not a UCC' by TSPs",
    "light_cleaned_selftext": "1. Are TSPs under duress or coercion to allow this message to be allowed to all citizens without prosecuting it under DND framework? 2. In what ways it classifies as Transactional and/or Administration and/or Critical Alert message? TSPs dismiss DND complaint as Not a UCC 3. At least half a dozen alerts are being pushed within the first half of the week itself from almost same Sender ID. &#x200B;",
    "light_cleaned_comments": ""
}