{
    "id": "166ohiz",
    "title": "At INDIA meet, AAP demands seat-sharing talks for all states",
    "url": "https://m.rediff.com/news/report/at-india-meet-aap-demands-seat-sharing-talks-for-all-states/20230901.htm",
    "selftext": "These meeting  are just formalities...Pretty soon the alliance is going to break because personal  ambitions  of  everystake holder will be agnostic to  their cartel benefits",
    "flair": "Politics",
    "score": 1,
    "num_comments": 25,
    "created_utc": 1693519220.0,
    "convurl": "https://external-preview.redd.it/t0v9q3UtSu8g5oyY-areiDKvZdMAktEb3bBdb3tHzQw.jpg?auto=webp&s=b9942d5a96c5533e291c6ea908b0d762fb2670a0",
    "comments": [
        "Bro, let them take care of this. \n\nAnd then if they do any dumb stuff, we should do the smart thing and vote for the local Anti-BJP candidate form any party (Congress, AAP, Shivsena, Trinmul, SP, RJD, etc.) who is most likely to win.\n\nAlso, DO NOT VOTE NOTA. It only helps Bharat Jalao Party.",
        "All this because Rahul Gandhi can't hold big rallies and expose Modi -Adani. Because he is incapable of public speaking and lacks charisma.\nYaar 10 saal me practice krke bhi Sikh sakte hai , itna bda scam hai YouTube videos se kuch nhi hoga.",
        "AAP is probabaly not serious about the alliance. Acting like the BJP B team right now.",
        "Kick AAP out of the alliance!",
        "Every party of the alliance will have ambitions. Some will express before winning, some will express after. Power is what they're after. This is just the beginning.",
        "People here just want the alliance to fail somehow. \n\nThe article barely has a paragraph and the headline is so terrible.\n\nLiterally every other article out there says they've demanded that seat sharing arrangement happens ASAP because a lot of parties are speculating early elections",
        "What I have said is logical. These people are not coming together for betterment of common man and they have stated very clearly that defeating the BJP is their only agenda & there is no vision for the common man.\n\nThis is their fight for survival from BJP and upmanship over their current allies who was their rivals and in future would remain the same",
        "What betterment would you expect, regardless of the front",
        "Found the caveman. Lol this what happens when one follows only the mainstream media. Ignores all the questions asked by RG on manipur issue and modis scams. Ignores the rallies and bharat jodo yatra and claims opposition isn't doing anything.",
        "To be honest, defeating the bjp should be everyone's priority. So am quite aligned with INDIA. There is no harm in having peronsal ambitions... Even that Aditya Nath has his ambitions of becoming a PM, so does Gadkari.",
        "I mean they are only replacing Congress in few places.",
        "I think what they are doing is correct to some extent. Congress and Sorens have historically backstabbed alliances, they still have people in various national institutions and press that will suck up to them when INDIA comes to power, just like the ones that suck up to bhajpa. Regional parties just don't have that and should be wary.",
        "Ohk I will vote for bjp as my local bjp minister is better than others.",
        "AAP won’t be able to win a single seat other than Delhi or Punjab (that also not confirmed) and then also if they are hoping to get seats nationwide than i think they are living in delusion.",
        "Go ahead bro if he is doing good work in ur area and resolves local public issues",
        "true.",
        "This is the best response honestly"
    ],
    "cleaned_text": "india meet aap demands seatsharing talks states meeting formalitiespretty soon alliance going break personal ambitions everystake holder agnostic cartel benefits ",
    "cleaned_title": "india meet aap demands seatsharing talks states",
    "cleaned_selftext": "meeting formalitiespretty soon alliance going break personal ambitions everystake holder agnostic cartel benefits",
    "cleaned_comments": "bro let take care dumb stuff smart thing vote local antibjp candidate form party congress aap shivsena trinmul sp rjd etc likely win also vote nota helps bharat jalao party rahul gandhi cant hold big rallies expose modi adani incapable public speaking lacks charisma yaar saal practice krke bhi sikh sakte hai itna bda scam hai youtube videos se kuch nhi hoga aap probabaly serious alliance acting like bjp b team right kick aap alliance every party alliance ambitions express winning express power theyre beginning people want alliance fail somehow article barely paragraph headline terrible literally every article says theyve demanded seat sharing arrangement happens asap lot parties speculating early elections said logical people coming together betterment common man stated clearly defeating bjp agenda vision common man fight survival bjp upmanship current allies rivals future would remain betterment would expect regardless front found caveman lol happens one follows mainstream media ignores questions asked rg manipur issue modis scams ignores rallies bharat jodo yatra claims opposition isnt anything honest defeating bjp everyones priority quite aligned india harm peronsal ambitions even aditya nath ambitions becoming pm gadkari mean replacing congress places think correct extent congress sorens historically backstabbed alliances still people various national institutions press suck india comes power like ones suck bhajpa regional parties dont wary ohk vote bjp local bjp minister better others aap wont able win single seat delhi punjab also confirmed also hoping get seats nationwide think living delusion go ahead bro good work ur area resolves local public issues true best response honestly",
    "light_cleaned_title": "At INDIA meet, AAP demands seat-sharing talks for all states",
    "light_cleaned_selftext": "These meeting are just formalities...Pretty soon the alliance is going to break because personal ambitions of everystake holder will be agnostic to their cartel benefits",
    "light_cleaned_comments": "Bro, let them take care of this. And then if they do any dumb stuff, we should do the smart thing and vote for the local Anti-BJP candidate form any party (Congress, AAP, Shivsena, Trinmul, SP, RJD, etc.) who is most likely to win. Also, DO NOT VOTE NOTA. It only helps Bharat Jalao Party. All this because Rahul Gandhi can't hold big rallies and expose Modi -Adani. Because he is incapable of public speaking and lacks charisma. Yaar 10 saal me practice krke bhi Sikh sakte hai , itna bda scam hai YouTube videos se kuch nhi hoga. AAP is probabaly not serious about the alliance. Acting like the BJP B team right now. Kick AAP out of the alliance! Every party of the alliance will have ambitions. Some will express before winning, some will express after. Power is what they're after. This is just the beginning. People here just want the alliance to fail somehow. The article barely has a paragraph and the headline is so terrible. Literally every other article out there says they've demanded that seat sharing arrangement happens ASAP because a lot of parties are speculating early elections What I have said is logical. These people are not coming together for betterment of common man and they have stated very clearly that defeating the BJP is their only agenda & there is no vision for the common man. This is their fight for survival from BJP and upmanship over their current allies who was their rivals and in future would remain the same What betterment would you expect, regardless of the front Found the caveman. Lol this what happens when one follows only the mainstream media. Ignores all the questions asked by RG on manipur issue and modis scams. Ignores the rallies and bharat jodo yatra and claims opposition isn't doing anything. To be honest, defeating the bjp should be everyone's priority. So am quite aligned with INDIA. There is no harm in having peronsal ambitions... Even that Aditya Nath has his ambitions of becoming a PM, so does Gadkari. I mean they are only replacing Congress in few places. I think what they are doing is correct to some extent. Congress and Sorens have historically backstabbed alliances, they still have people in various national institutions and press that will suck up to them when INDIA comes to power, just like the ones that suck up to bhajpa. Regional parties just don't have that and should be wary. Ohk I will vote for bjp as my local bjp minister is better than others. AAP won’t be able to win a single seat other than Delhi or Punjab (that also not confirmed) and then also if they are hoping to get seats nationwide than i think they are living in delusion. Go ahead bro if he is doing good work in ur area and resolves local public issues true. This is the best response honestly"
}