{
    "id": "14ri61y",
    "title": "A small rant on how other countries view India.",
    "url": "https://www.reddit.com/r/india/comments/14ri61y/a_small_rant_on_how_other_countries_view_india/",
    "selftext": "Look at this video: [https://youtube.com/shorts/WKeyPmxoois?feature=share](https://youtube.com/shorts/WKeyPmxoois?feature=share)\n\nShocking, right? I'm Indian-American. I've always been treated badly. I've had trash thrown at me. I've been called poor even though my family is high income. I've been told I smell. And then when I try to complain about these things, I'm told I'm sensitive. Wow, the world is fucked up.\n\nIt's hilarious because we\n\n* have the oldest culture in the world\n* have the biggest population in the world\n* are the seventh biggest country\n* have incredibly smart people\n* have a poverty rate that is IMPROVING\n* have some of the nicest people in the world\n* have the largest film industry in the world and one of the oldest\n* have a language for every state that dates back to ancient times\n* have never ever once overtaken another country, even in ancient times\n* have a huge religion (Hinduism) that doesn't try to force people to convert\n\nBut noooo. Forget all of this. Instead, let's focus on the bad things. No, we don't do this for any other culture. But that doesn't make us racist! What? That's crazy! 😂\n\nFeeling down lately. I hate the world and I hate Americans. I also hate myself for even trying to get India to be respected at all. I hate that I love my culture.\n\nHelp.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 43,
    "created_utc": 1688579799.0,
    "convurl": "https://external-preview.redd.it/lJEQQw0L3YpTfVDWEdePxnoIOzDL0AfS4evPCV6Iwk8.jpg?auto=webp&v=enabled&s=4e7dc0e595b2b77f7b92b174d205440129cf3af3",
    "comments": [
        "Indian Americans are BY far the highest paid demographic in America. Who told you you're poor lmaoo",
        "Lol! Indian Americans are seen pretty accurately by everyone: the people who remember they are POC and have no issues working on the anti-racist work done by Black Americans but complain about western thought back home when rights are talked about.",
        "Why is it shocking? To each his own.\n\nAlso, why will anyone like a country/its people for having the largest film industry? Thats bizarre. \n\nLiterally half your points make no sense. The largest population, 7th largest by size. Whats that got to do with how people behave?",
        "I've been treated the same in india when I was in uttar pradesh. It's not about India. It's about people who feel they are superior than others. They treat you like shit.",
        "If you hate america so much, get an OCI and come and settle in India then.",
        "all that money and look how India looks",
        "They'd be shit scared to make any jokes on black people, but for westerners indians are fair game apparently",
        "once i move out of india (which is very soon btw), ill myself stay the fuck away from indians ☺️",
        "That's what I thought. And here I'm amidst Indians even in the remotest places of the world. We're fucking everywhere.",
        "this is my worst nightmare 😭",
        "i think indians do smell. it the spicy curry based food i think diet affects the scent pheromones a bit. Also indians dont deoderize as much.",
        "None of these people said they hate Indians or think poorly of our culture. Maybe a couple, but the question was which race/ethnicity you wont date/fuck. Maybe we arent physically the most attractive(LOL even indian american women shit on the indian american boys and wont date them). There are also lot of negative stereotypes true about Indians, (just like everyone else)\n\nNone of the points you made speak to why people should desire Indians physically or romantically.",
        "yeah. None of the people said they hate indians or the culture. they just said they wont fuck indians, or take them romantically. That has nothing to do with actual racism or looking down on people, and yeah none of the points show why indians should be fuckable",
        "Guess op is not getting laid.",
        "My friend from Poland used to think America is greatest country in world. Her eyes have opened now . But she still watches cringe videos of white youtubers showing Indian perv men and slums and all that and she thinks we r cheap country cheap people, she has no idea about our culture or anything. I showed her some pictures of India, our infrastructure she was very surprised. I told her she's brainwashed just like she was brainwashed about American. Hopefully her views change with time.",
        "This! Haha I want to move out of India to experience other cultures and people so definitely not going to some Indian infested place, for example Canada. Also, i noticed Indian who makes it to abroad think themselves as superior to those living in India. I would rather connect with local natives than my fellow Indians in abroad. My dad thinks a Indian is Indians best friend when in other country no matter the difference in state or language north or south but in reality i guess it's other way around.",
        "Quite literally as well",
        "you summarised everything i think so well! im leaving india for a reason, and that’s most certainly NOT to settle in another mini india abroad.",
        "Civic sense! It's about civic sense and decency online or offline",
        "A lot of my friends who went abroad theought this, but found it very difficult to make friends with the whites, so now that have a mostly Indian circle. Whites don't want to mix with browns, so browns stick together. Indians and Pakistanis tend to become friends too.",
        "OP, don't worry about the people who can't even point out India on the map(which i presume is majority of those r@cist idiots) telling you that Indians are inferior. Keep rocking. They don't even realize what a shithole of a country America is now and how the rest of world laughs beyond their back.",
        "that won’t be an issue for me cause i don’t have friends anyway 😊",
        "1) So you picked a channel thats literally 3 days old with a racist name, description and two short videos stolen from other channels to form your opinion?\n2) People have different preferences, doesn’t make them racist..I personally am not physically attracted to people of certainly nationalities and it has nothing to do with racism..I would be perfectly fine being friends or coworker with them.\n3)I have seen indians say far worse things to black people privately so lets not pretend we don’t have racist people in our country.\n4) I have lived in us for over 10 years and only faced racism a handful of times…Americans are far more tolerant and friendly to immigrants than most other countries. You want to see what real racism is like against indians, go live in a middle east country like saudi arabia or uae or some european country.\n5) I am not trying to downplay what you have faced btw..it seems like you are very young and you have probably faced some bullying in school..talk to your parents about it. Trust me america is not as racist as you think :)",
        "I live in a building in the UK with 11 people. 9 are Indians. The remaining 2 are Chinese.",
        "Most people Interviewed in the video seem trashy, which also describes the majority of Americans. Indians have a DEEP culture, which is not only different from the mainstream American culture but some of the core values of Indians in America (intellectual/ family oriented/ NOT superficial) are diametrically opposed to the superficial, flashy, anti intellectual culture of mainstream America. Indian food, music, religion,festivals etc are also very different. I am curious what the results would be if they asked this question at an Ivy league University campus or in a big tech campus in Silicon Valley. \n\nYou shouldn’t feel sad that these trashy people aren’t interested in you.",
        "I'm 15 years old...",
        "sorry, I should've been clearer. India has a lot of good properties as a nation. My point is that even though these things exist people choose to focus on the bad things. That shapes their view of Indians, and influences how people treat them.",
        "Americans are really racist. What can we even do about that"
    ],
    "cleaned_text": "small rant countries view india look video httpsyoutubecomshortswkeypmxooisfeaturesharehttpsyoutubecomshortswkeypmxooisfeatureshare shocking right im indianamerican ive always treated badly ive trash thrown ive called poor even though family high income ive told smell try complain things im told im sensitive wow world fucked hilarious oldest culture world biggest population world seventh biggest country incredibly smart people poverty rate improving nicest people world largest film industry world one oldest language every state dates back ancient times never ever overtaken another country even ancient times huge religion hinduism doesnt try force people convert noooo forget instead lets focus bad things dont culture doesnt make us racist thats crazy feeling lately hate world hate americans also hate even trying get india respected hate love culture help ",
    "cleaned_title": "small rant countries view india",
    "cleaned_selftext": "look video httpsyoutubecomshortswkeypmxooisfeaturesharehttpsyoutubecomshortswkeypmxooisfeatureshare shocking right im indianamerican ive always treated badly ive trash thrown ive called poor even though family high income ive told smell try complain things im told im sensitive wow world fucked hilarious oldest culture world biggest population world seventh biggest country incredibly smart people poverty rate improving nicest people world largest film industry world one oldest language every state dates back ancient times never ever overtaken another country even ancient times huge religion hinduism doesnt try force people convert noooo forget instead lets focus bad things dont culture doesnt make us racist thats crazy feeling lately hate world hate americans also hate even trying get india respected hate love culture help",
    "cleaned_comments": "indian americans far highest paid demographic america told youre poor lmaoo lol indian americans seen pretty accurately everyone people remember poc issues working antiracist work done black americans complain western thought back home rights talked shocking also anyone like countryits people largest film industry thats bizarre literally half points make sense largest population th largest size whats got people behave ive treated india uttar pradesh india people feel superior others treat like shit hate america much get oci come settle india money look india looks theyd shit scared make jokes black people westerners indians fair game apparently move india soon btw ill stay fuck away indians thats thought im amidst indians even remotest places world fucking everywhere worst nightmare think indians smell spicy curry based food think diet affects scent pheromones bit also indians dont deoderize much none people said hate indians think poorly culture maybe couple question raceethnicity wont datefuck maybe arent physically attractivelol even indian american women shit indian american boys wont date also lot negative stereotypes true indians like everyone else none points made speak people desire indians physically romantically yeah none people said hate indians culture said wont fuck indians take romantically nothing actual racism looking people yeah none points show indians fuckable guess op getting laid friend poland used think america greatest country world eyes opened still watches cringe videos white youtubers showing indian perv men slums thinks r cheap country cheap people idea culture anything showed pictures india infrastructure surprised told shes brainwashed like brainwashed american hopefully views change time haha want move india experience cultures people definitely going indian infested place example canada also noticed indian makes abroad think superior living india would rather connect local natives fellow indians abroad dad thinks indian indians best friend country matter difference state language north south reality guess way around quite literally well summarised everything think well im leaving india reason thats certainly settle another mini india abroad civic sense civic sense decency online offline lot friends went abroad theought found difficult make friends whites mostly indian circle whites dont want mix browns browns stick together indians pakistanis tend become friends op dont worry people cant even point india mapwhich presume majority rcist idiots telling indians inferior keep rocking dont even realize shithole country america rest world laughs beyond back wont issue cause dont friends anyway picked channel thats literally days old racist name description two short videos stolen channels form opinion people different preferences doesnt make racisti personally physically attracted people certainly nationalities nothing racismi would perfectly fine friends coworker seen indians say far worse things black people privately lets pretend dont racist people country lived us years faced racism handful timesamericans far tolerant friendly immigrants countries want see real racism like indians go live middle east country like saudi arabia uae european country trying downplay faced btwit seems like young probably faced bullying schooltalk parents trust america racist think live building uk people indians remaining chinese people interviewed video seem trashy also describes majority americans indians deep culture different mainstream american culture core values indians america intellectual family oriented superficial diametrically opposed superficial flashy anti intellectual culture mainstream america indian food music religionfestivals etc also different curious results would asked question ivy league university campus big tech campus silicon valley shouldnt feel sad trashy people arent interested im years old sorry shouldve clearer india lot good properties nation point even though things exist people choose focus bad things shapes view indians influences people treat americans really racist even",
    "light_cleaned_title": "A small rant on how other countries view India.",
    "light_cleaned_selftext": "Look at this video: [https://youtube.com/shorts/WKeyPmxoois?feature=share](https://youtube.com/shorts/WKeyPmxoois?feature=share) Shocking, right? I'm Indian-American. I've always been treated badly. I've had trash thrown at me. I've been called poor even though my family is high income. I've been told I smell. And then when I try to complain about these things, I'm told I'm sensitive. Wow, the world is fucked up. It's hilarious because we * have the oldest culture in the world * have the biggest population in the world * are the seventh biggest country * have incredibly smart people * have a poverty rate that is IMPROVING * have some of the nicest people in the world * have the largest film industry in the world and one of the oldest * have a language for every state that dates back to ancient times * have never ever once overtaken another country, even in ancient times * have a huge religion (Hinduism) that doesn't try to force people to convert But noooo. Forget all of this. Instead, let's focus on the bad things. No, we don't do this for any other culture. But that doesn't make us racist! What? That's crazy! 😂 Feeling down lately. I hate the world and I hate Americans. I also hate myself for even trying to get India to be respected at all. I hate that I love my culture. Help.",
    "light_cleaned_comments": "Indian Americans are BY far the highest paid demographic in America. Who told you you're poor lmaoo Lol! Indian Americans are seen pretty accurately by everyone: the people who remember they are POC and have no issues working on the anti-racist work done by Black Americans but complain about western thought back home when rights are talked about. Why is it shocking? To each his own. Also, why will anyone like a country/its people for having the largest film industry? Thats bizarre. Literally half your points make no sense. The largest population, 7th largest by size. Whats that got to do with how people behave? I've been treated the same in india when I was in uttar pradesh. It's not about India. It's about people who feel they are superior than others. They treat you like shit. If you hate america so much, get an OCI and come and settle in India then. all that money and look how India looks They'd be shit scared to make any jokes on black people, but for westerners indians are fair game apparently once i move out of india (which is very soon btw), ill myself stay the fuck away from indians ☺️ That's what I thought. And here I'm amidst Indians even in the remotest places of the world. We're fucking everywhere. this is my worst nightmare 😭 i think indians do smell. it the spicy curry based food i think diet affects the scent pheromones a bit. Also indians dont deoderize as much. None of these people said they hate Indians or think poorly of our culture. Maybe a couple, but the question was which race/ethnicity you wont date/fuck. Maybe we arent physically the most attractive(LOL even indian american women shit on the indian american boys and wont date them). There are also lot of negative stereotypes true about Indians, (just like everyone else) None of the points you made speak to why people should desire Indians physically or romantically. yeah. None of the people said they hate indians or the culture. they just said they wont fuck indians, or take them romantically. That has nothing to do with actual racism or looking down on people, and yeah none of the points show why indians should be fuckable Guess op is not getting laid. My friend from Poland used to think America is greatest country in world. Her eyes have opened now . But she still watches cringe videos of white youtubers showing Indian perv men and slums and all that and she thinks we r cheap country cheap people, she has no idea about our culture or anything. I showed her some pictures of India, our infrastructure she was very surprised. I told her she's brainwashed just like she was brainwashed about American. Hopefully her views change with time. This! Haha I want to move out of India to experience other cultures and people so definitely not going to some Indian infested place, for example Canada. Also, i noticed Indian who makes it to abroad think themselves as superior to those living in India. I would rather connect with local natives than my fellow Indians in abroad. My dad thinks a Indian is Indians best friend when in other country no matter the difference in state or language north or south but in reality i guess it's other way around. Quite literally as well you summarised everything i think so well! im leaving india for a reason, and that’s most certainly NOT to settle in another mini india abroad. Civic sense! It's about civic sense and decency online or offline A lot of my friends who went abroad theought this, but found it very difficult to make friends with the whites, so now that have a mostly Indian circle. Whites don't want to mix with browns, so browns stick together. Indians and Pakistanis tend to become friends too. OP, don't worry about the people who can't even point out India on the map(which i presume is majority of those r@cist idiots) telling you that Indians are inferior. Keep rocking. They don't even realize what a shithole of a country America is now and how the rest of world laughs beyond their back. that won’t be an issue for me cause i don’t have friends anyway 😊 1) So you picked a channel thats literally 3 days old with a racist name, description and two short videos stolen from other channels to form your opinion? 2) People have different preferences, doesn’t make them racist..I personally am not physically attracted to people of certainly nationalities and it has nothing to do with racism..I would be perfectly fine being friends or coworker with them. 3)I have seen indians say far worse things to black people privately so lets not pretend we don’t have racist people in our country. 4) I have lived in us for over 10 years and only faced racism a handful of times…Americans are far more tolerant and friendly to immigrants than most other countries. You want to see what real racism is like against indians, go live in a middle east country like saudi arabia or uae or some european country. 5) I am not trying to downplay what you have faced btw..it seems like you are very young and you have probably faced some bullying in school..talk to your parents about it. Trust me america is not as racist as you think :) I live in a building in the UK with 11 people. 9 are Indians. The remaining 2 are Chinese. Most people Interviewed in the video seem trashy, which also describes the majority of Americans. Indians have a DEEP culture, which is not only different from the mainstream American culture but some of the core values of Indians in America (intellectual/ family oriented/ NOT superficial) are diametrically opposed to the superficial, flashy, anti intellectual culture of mainstream America. Indian food, music, religion,festivals etc are also very different. I am curious what the results would be if they asked this question at an Ivy league University campus or in a big tech campus in Silicon Valley. You shouldn’t feel sad that these trashy people aren’t interested in you. I'm 15 years old... sorry, I should've been clearer. India has a lot of good properties as a nation. My point is that even though these things exist people choose to focus on the bad things. That shapes their view of Indians, and influences how people treat them. Americans are really racist. What can we even do about that"
}