{
    "id": "1785aij",
    "title": "Why isn't this big news",
    "url": "https://www.reddit.com/r/india/comments/1785aij/why_isnt_this_big_news/",
    "selftext": "www.aljazeera.com/amp/economy/2023/10/12/indias-bank-of-baroda-expose-worsens-agents-steal-money-from-accounts",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697336382.0,
    "convurl": "https://external-preview.redd.it/cHig21pH1QgMSrakpIC0YR5WGL6lapF_Th1sGl10rpc.jpg?auto=webp&s=0e6f8db4184715b69a2a56363d811427959e2678",
    "comments": [
        "To prevent a \"run\" on Bank of Baroda.",
        "There are two different issues\n\n1. Invalid phone number on accounts signed up for mobile banking\n\n2. Fraud of withdrawal.\n\nThe first is part scam, part target pressure. Typical head office pressure to show that shiny new toys work in this case the mobile app. Head office will give a target like we want 20% of all accounts to be app enabled. The app will be shitty and painful and people won't use it. Given enough pressure the staff will typically do \"jugaad\" to show success. Also banking correspondents are people who are going to remote areas and functioning like a bank. Many times they will bend rules to enable smooth functioning because in the remote areas, everyone knows everyone else. So in my view it's an audit mess but nothing to require high level investigation.\n\nThe second has a value around 10 odd lakhs as per the article. That's the total and not one transaction. Not big enough to fuss about. There are many such frauds of similar amounts.\n\nThe bank has acted, RBI has acted. What exactly is the ask ? This BS about external audit by \"professionals\" ? Banks do have external and internal audits and they will point out issues.",
        "क्यूंकि सब चंगा सी।"
    ],
    "cleaned_text": "isnt big news  ",
    "cleaned_title": "isnt big news",
    "cleaned_selftext": "",
    "cleaned_comments": "prevent run bank baroda two different issues invalid phone number accounts signed mobile banking fraud withdrawal first part scam part target pressure typical head office pressure show shiny new toys work case mobile app head office give target like want accounts app enabled app shitty painful people wont use given enough pressure staff typically jugaad show success also banking correspondents people going remote areas functioning like bank many times bend rules enable smooth functioning remote areas everyone knows everyone else view audit mess nothing require high level investigation second value around odd lakhs per article thats total one transaction big enough fuss many frauds similar amounts bank acted rbi acted exactly ask bs external audit professionals banks external internal audits point issues",
    "light_cleaned_title": "Why isn't this big news",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "To prevent a \"run\" on Bank of Baroda. There are two different issues 1. Invalid phone number on accounts signed up for mobile banking 2. Fraud of withdrawal. The first is part scam, part target pressure. Typical head office pressure to show that shiny new toys work in this case the mobile app. Head office will give a target like we want 20% of all accounts to be app enabled. The app will be shitty and painful and people won't use it. Given enough pressure the staff will typically do \"jugaad\" to show success. Also banking correspondents are people who are going to remote areas and functioning like a bank. Many times they will bend rules to enable smooth functioning because in the remote areas, everyone knows everyone else. So in my view it's an audit mess but nothing to require high level investigation. The second has a value around 10 odd lakhs as per the article. That's the total and not one transaction. Not big enough to fuss about. There are many such frauds of similar amounts. The bank has acted, RBI has acted. What exactly is the ask ? This BS about external audit by \"professionals\" ? Banks do have external and internal audits and they will point out issues. क्यूंकि सब चंगा सी।"
}