{
    "id": "mj5ccc",
    "title": "The provisions of India's incoming data law and how they will affect you",
    "url": "https://www.reddit.com/r/india/comments/mj5ccc/the_provisions_of_indias_incoming_data_law_and/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/9lffyfzshxq61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=175539148a952c495d2a2529731e6524195353c6\n\n## Tl;dr\n\nIt’s here! As promised, part 2 of our series on the data bill will explain the basics of the Personal Data Protection Bill, 2019. In it, we provide an introduction to the main definitions, explain what the Data Processing Authority is, detail what rights users will have and how these rights will be ensured in practice, and lastly, explain the exemptions provided to the government. In the next edition, we'll talk about the many challenges and loopholes in the bill.\n\n## A Recap and an update\n\nLast time, we [**discussed the need for a data protection bill**](https://internetfreedom.in/startfromscratch-the-data-bill-series-part-1/) and indicated new threats such as [**data breaches**](https://internetfreedom.in/security-incidents-and-the-personal-data-protection-bill/), [**malicious hacks**](https://internetfreedom.in/nso-pegasus-hack-one-year-anniversary/), and[ **governmental and corporate surveillance**](https://internetfreedom.in/workplace-surveillance-your-employer-could-be-watching-you/) that have emerged as our world becomes more and more digital. We also provided some historical context to the [**Personal Data Protection Bill, 2019**](https://prsindia.org/files/bills_acts/bills_parliament/Personal%20Data%20Protection%20Bill,%202019.pdf) and hinted at some of the concerns that have been raised about the Bill.\n\nRegarding the report of the Joint Parliamentary Committee on the Bill, we have an update that [**reports**](https://www.medianama.com/2021/03/223-jpc-data-protection-extension-parliament/) had emerged that the Committee would postpone the submission of the report. Indeed, this came true, as on the 25th of March [**a motion was moved**](http://loksabhaph.nic.in/Business/ListofBusiness.aspx) to extend the time for the presentation of the report and [**was adopted the very same day**](http://loksabhaph.nic.in/Business/UserBulletin1.aspx). Thus, as it stands, the report of the Committee shall be presented in the first week of the Monsoon Session of 2021.\n\nWe have time. So this means that it is even more important for the public to engage with the bill, understand what it proposes, and critique its weaker aspects so that public pressure can be applied and India implements a stronger data protection bill.\n\n## A Glossary\n\nThe most important definitions vis-à-vis the data bill are:\n\n1. **Data principal** i.e. you, the user. A data principal is essentially the person to whom the data ‘belongs’\n2. **Data fiduciary** i.e. the entity that controls the storage of the data and defines the permitted ways it can be processed\n3. **Data processor** i.e. the entity that processes that data collected by a data fiduciary\n\nSuppose you use a certain social medium (eg. Facebook or Twitter). In this case, you are the data principal, the social medium is the data fiduciary (since it collects data about you and your activity on its medium), and the entity that processes your data for, say, advertising purposes is the data processor (this may be an authorised third party entity or even the social medium itself).\n\nNext, we need understand the categories of data:\n\n1. **Personal Data:** This refers to data that may contain information about any characteristics or traits of a person and can be used to identify said person.\n2. **Sensitive Personal Data:** This refers to certain categories of data such as: financial data,  health data, official identifiers; data on sexual orientation and activity, biometric data, genetic data, transgender status, intersex status, caste or tribe status, and religious or political belief or affiliation.\n3. **Critical Personal Data:** Any data notified by the Central Government to be critical data. The important thing here is that critical data can only be processed within the country.\n\n## But who will enforce the law? A Data Protection Authority\n\nThe Bill (Chapter IX) proposes the creation of a Data Protection Authority (DPA). Essentially, the DPA will be the main regulator with respect to the processing of data. The Bill’s Statement of Objects and Reasons states that role of the DPA would be to:\n\n&gt;“protect the interests of data principals, prevent any misuse of personal data, ensure compliance with the provisions of the proposed legislation and promote awareness about the data protection”\n\nThe Authority shall consist of one Chairperson and a maximum of 6 other full-time members, of which at least one shall have experience in law. The chairperson shall be appointed by the Central government and shall be responsible for directing the workings of the DPA.\n\nNow, given the central role of the Authority, several important functions have been delegated to it, including:\n\n* Monitoring and enforcing application of the provisions of this Act\n* Taking prompt and appropriate action in response to personal data breach in accordance with the provisions of this Act\n* Examination of any data audit reports and taking any action pursuant thereto\n* Specifying codes of practice to promote good practices of data protection and facilitate compliance\n* Promoting awareness and understanding of the risks, rules, safeguards and rights in respect of protection of personal data amongst data fiduciaries and data principals\n* Promoting measures and undertaking research for innovation in the field of protection of personal data\n* Advising Central Government, State Government and any other authority on measures required to be taken to promote protection of personal data and ensuring consistency of application and enforcement of this Act\n\nApart from these, the Authority also has the power to:\n\n* Issue directions to any data fiduciary or data processor (who are bound to comply with the orders)\n* Ask data fiduciaries or data processors to provide any relevant information\n* Conduct an enquiry about any data fiduciary or data processor if it believes that it has conducted its activities in a manner that infringes upon the digital rights of users or if it believes the entity has contravened any of the provisions of the Act\n\nThus, as one can see, the Data Protection Authority will play a vital role. But what will be the regulatory environment that DPA will protect and regulate? Read on.\n\n## Digital Rights and Consent\n\nUser consent is recognised as a key component of data protection frameworks, and this is recognised in clause 11 of the Bill, which lays down that personal data cannot be processed without obtaining the consent of the user. Furthermore, such consent is valid only if it is: a) freely given, b) on the basis of an informed decision, c) specific in nature, d) clearly expressed, and e) capable of being withdrawn. Users must also be informed about any harms that might result as a consequence of providing consent, while the provision of services cannot be made contingent upon the provision of services or the fulfillment of a contract.\n\nThere are, of course, certain exemptions. For example, if the processing of certain personal data is without consent may be allowed for the prevention and detection of any unlawful activity including fraud, whistle blowing, network and information security, and the operation of search engines. Additionally, there are certain exemptions that are provided to governmental agencies. More on this below.\n\nAlong with a consent framework, the Bill, in Chapter V, lays down certain rights that each data principal has:\n\n1. **Right to confirmation and access:** Users have the right to obtain their personal data as well as a summary of activities performed upon their data in a clear and concise manner.\n2. **Right to correction and erasure:** Users have the right to correct, complete, and update their personal data. Users also have the right to erase their personal data after it is no longer necessary for the purpose for which it was processed\n3. **Right to Data Portability:** Users have the right to receive and have transferred to any other fiduciary their personal data as well as any data generated during the provision of services.\n4. **Right to be Forgotten:** Users have the right to restrict or prevent the disclosure of their personal data if it is no longer necessary for the purpose for which it was collected or if they withdraw their consent.\n\nHere too however, these rights are not absolute, in the sense that certain limits, technical and otherwise, are imposed upon them. For example, in the case of the right to correction and erasure, a data fiduciary may, after providing the user with an explanation, choose to reject their application, though the user can make the fiduciary tage the data as disputed. Alternatively, in the case of the right to be forgotten, all requests need to go through an Adjudicating Officer appointed by the Data Protection Authority, who will judge whether any such request is valid.\n\n## Interregnum - What about non-personal data?\n\nYou may have noticed that most of these provisions seem to deal with personal data, and so you may ask: what about non-personal data? Well, clause 2 of the Bill says that the provisions of the Bill shall not apply to anonymised data, while clause 91 empowers the Central government to: a) ask data fiduciaries and data processors to provide anonymised personal data or non-personal data to improve service delivery and b) frame policies with respect to non-personal data (as an aside, we will mention here that government released the second version of the draft non-personal data governance framework on 16th December last year, which we have written about [**here**](https://internetfreedom.in/unconstitutional-draft-report-on-non-personal-data-ignores-concerns-about-privacy-and-data-monopolies/)).\n\n## Obligations &amp; Transparency Measures\n\nAnother important part of a robust data protection framework is the regulation of the data collection and processing. For this purpose, chapter II of the Bill  lays down certain obligations on data fiduciaries. Firstly, personal data shall only be processed for clear and lawful purposes that a user has consented to, and the privacy of the user shall be ensured while processing. Data can be processed only to the extent that is necessary for the intended purpose, and a notice containing all the relevant information must be sent to the user before collecting their data. The fiduciary must also take the necessary steps to ensure that the personal data processed is complete, accurate, and up to date. Additionally, data fiduciaries must respect the digital rights of users and retain their personal data beyond the time necessary for fulfilling the original purpose of processing, after which such data must be deleted.\n\nTo complement these obligations, the Bill (Chapter VI) mandates certain procedural measures that data fiduciaries must implement. Each data fiduciary must implement a comprehensive privacy-by-design policy that explains how the privacy of users and the security of their data is going to be ensured throughout processing, they can get to be certified by the Data Protection Authority if it is found to be sufficiently robust. Fiduciaries must also certain information available in a transparent manner, such as:\n\n* the categories of personal data generally collected and the manner of such collection\n* the purposes for which personal data is generally processed\n* any categories of personal data processed in exceptional situations or any exceptional purposes of processing that create a risk of significant harm\n* the existence of and the procedure for exercise of rights of data principal under Chapter V and any related contact details for the same\n\nSome data fiduciaries will also end up being classified as significant data fiduciaries based on factors such as the volume of data processed and the turnover of the fiduciary. Such classification will bring with it additional obligations, such as the need to conduct data protection audits and impact assessments as well as the need to have a designated data protection officer.\n\nBoth data fiduciaries and processors shall implement necessary security safeguards, such as:\n\n* The use of methods such as de-identification and encryption\n* Take steps necessary to protect the integrity of personal data\n* Take steps necessary to prevent misuse, unauthorised access to, modification, disclosure or destruction of personal data\n* Undertake periodic reviews of their security safeguards\n\nThey must also have in place an effective grievance redressal mechanism, in which complaints must be disposed of within 30 days of their receipt.\n\nThe data protection Bill also specifies behaviour in case a breach occurs: data fiduciaries must inform the DPA about any breaches of personal data, detailing the type and nature of the data involved and the number of persons affected. The DPA shall then decide whether the breach should be reported to the users. The DPA may also direct the fiduciary in question to take certain actions.\n\n## Exemptions, governmental and otherwise\n\nThe Bill provides for a variety of exemptions and these are some of its most criticised sections. For example, chapter III of the Bill states that personal data may be processed without consent in certain situations, including:\n\n1. The performance of any State function, such as the provision of a service or statutory benefit\n2. In compliance with any order or judgement of a Court or a Tribunal\n3. In case of a medical emergency for the data principal\n4. For the provision of public health services to combat a pandemic or any other threat to the public health\n5. By an employer with respect to a data principal who is an employee\n\nChapter VII of the Bill provides even broader exemptions to the government: the Central Government can, in the interest of national security and the prevention of incitement to any cognizable offence, **exempt any government agency** from any of the provisions of the Bill. The Centre can also exempt data processors that process the data of users outside India from the provisions of the Bill.\n\n*This is the second blogpost in our series on the Data Protection Bill; read part 1* [***here***](https://internetfreedom.in/startfromscratch-the-data-bill-series-part-1/)*. Join us next week in part 3, where we explain the litany of concerns that have been raised about the Data Protection Bill.*\n\n## Important Documents\n\n1. *The Personal Data Protection Bill, 2019* as introduced by the Minister for Electronics and Information Technology, Mr. Ravi Shankar Prasad ([**link**](https://www.prsindia.org/sites/default/files/bill_files/Personal%20Data%20Protection%20Bill%2C%202019.pdf))\n2. Essential Features of a Rights Respecting Data Protection Law dated February 28, 2020 ([**link**](https://internetfreedom.in/essential-features-of-a-rights-respecting-data-protection-law/))\n3. IFF's Public Brief and Analysis of the Personal Data Protection Bill, 2019 ([**link**](https://saveourprivacy.in/media/all/Brief-PDP-Bill-25.12.2020.pdf))\n4. The SaveOurPrivacy Campaign ([**link**](https://saveourprivacy.in/))",
    "flair": "Policy/Economy",
    "score": 87,
    "num_comments": 8,
    "created_utc": 1617442675,
    "convurl": "https://a.thumbs.redditmedia.com/IMCii14hesR2yQJ2W-CMrgnnSfgfTB9-a576rNgxwb4.jpg",
    "comments": [
        "bro tumlog itna text jhad the ho people don't react/read at all. you guys are fighting the lone fight so please so I appreciate it. I say this as politely as possible too but please do something about it, I feel sad and helpless about what's about to happen",
        "\\&gt;  **exempt any government agency** from any of the provisions of the Bill. The Centre can also **exempt data processors that process the data of users outside India** from the provisions of the Bill\n\nEverybody is exempt, wtf bring the data protection bill?",
        "yup, people just get lazy as soon as they see long articles (including me sometimes :P ). But since it was an important topic to me, i had to go through it. \n\nThanks OP for the detailed post!",
        "tldr?",
        "I wanted Right to be forgotten even before EU passed it into existence, because now I won't have to go and manually delete my data and then live in the fear that google still might have my data. Good to see some progress in India !",
        "This is a joke! This is nothing but a 25 year old Maruti 800 engine in the body of a Honda City!! \n\nData will be reviewed by an officer before deletion? And foreign companies are exempt? For example Flipkart is Singapore registered so they don't have to follow these guidelines? \n\nFuck off!",
        "Upvoted for visibility",
        "The important part here is that they \"can\" exempt anyone, not \"will\". The point of these laws in to have a legal route in place if they want to go after someone in future. Currently, due to lack of laws, there's nothing they can do in the courts. I don't think they have the infrastructure to enforce these laws for everyone. They just plan to make some high profile examples to pressure companies to obey."
    ],
    "cleaned_text": "provisions indias incoming data law affect ampxb tldr promised part series data bill explain basics personal data protection bill provide introduction main definitions explain data processing authority detail rights users rights ensured practice lastly explain exemptions provided government next edition well talk many challenges loopholes bill recap update last time discussed need data protection billhttpsinternetfreedominstartfromscratchthedatabillseriespart indicated new threats data breacheshttpsinternetfreedominsecurityincidentsandthepersonaldataprotectionbill malicious hackshttpsinternetfreedominnsopegasushackoneyearanniversary governmental corporate surveillancehttpsinternetfreedominworkplacesurveillanceyouremployercouldbewatchingyou emerged world becomes digital also provided historical context personal data protection bill httpsprsindiaorgfilesbillsactsbillsparliamentpersonaldataprotectionbillpdf hinted concerns raised bill regarding report joint parliamentary committee bill update reportshttpswwwmedianamacomjpcdataprotectionextensionparliament emerged committee would postpone submission report indeed came true th march motion movedhttploksabhaphnicinbusinesslistofbusinessaspx extend time presentation report adopted dayhttploksabhaphnicinbusinessuserbulletinaspx thus stands report committee shall presented first week monsoon session time means even important public engage bill understand proposes critique weaker aspects public pressure applied india implements stronger data protection bill glossary important definitions visvis data bill data principal ie user data principal essentially person data belongs data fiduciary ie entity controls storage data defines permitted ways processed data processor ie entity processes data collected data fiduciary suppose use certain social medium eg facebook twitter case data principal social medium data fiduciary since collects data activity medium entity processes data say advertising purposes data processor may authorised third party entity even social medium next need understand categories data personal data refers data may contain information characteristics traits person used identify said person sensitive personal data refers certain categories data financial data health data official identifiers data sexual orientation activity biometric data genetic data transgender status intersex status caste tribe status religious political belief affiliation critical personal data data notified central government critical data important thing critical data processed within country enforce law data protection authority bill chapter ix proposes creation data protection authority dpa essentially dpa main regulator respect processing data bills statement objects reasons states role dpa would gtprotect interests data principals prevent misuse personal data ensure compliance provisions proposed legislation promote awareness data protection authority shall consist one chairperson maximum fulltime members least one shall experience law chairperson shall appointed central government shall responsible directing workings dpa given central role authority several important functions delegated including monitoring enforcing application provisions act taking prompt appropriate action response personal data breach accordance provisions act examination data audit reports taking action pursuant thereto specifying codes practice promote good practices data protection facilitate compliance promoting awareness understanding risks rules safeguards rights respect protection personal data amongst data fiduciaries data principals promoting measures undertaking research innovation field protection personal data advising central government state government authority measures required taken promote protection personal data ensuring consistency application enforcement act apart authority also power issue directions data fiduciary data processor bound comply orders ask data fiduciaries data processors provide relevant information conduct enquiry data fiduciary data processor believes conducted activities manner infringes upon digital rights users believes entity contravened provisions act thus one see data protection authority play vital role regulatory environment dpa protect regulate read digital rights consent user consent recognised key component data protection frameworks recognised clause bill lays personal data processed without obtaining consent user furthermore consent valid freely given b basis informed decision c specific nature clearly expressed e capable withdrawn users must also informed harms might result consequence providing consent provision services made contingent upon provision services fulfillment contract course certain exemptions example processing certain personal data without consent may allowed prevention detection unlawful activity including fraud whistle blowing network information security operation search engines additionally certain exemptions provided governmental agencies along consent framework bill chapter v lays certain rights data principal right confirmation access users right obtain personal data well summary activities performed upon data clear concise manner right correction erasure users right correct complete update personal data users also right erase personal data longer necessary purpose processed right data portability users right receive transferred fiduciary personal data well data generated provision services right forgotten users right restrict prevent disclosure personal data longer necessary purpose collected withdraw consent however rights absolute sense certain limits technical otherwise imposed upon example case right correction erasure data fiduciary may providing user explanation choose reject application though user make fiduciary tage data disputed alternatively case right forgotten requests need go adjudicating officer appointed data protection authority judge whether request valid interregnum nonpersonal data may noticed provisions seem deal personal data may ask nonpersonal data well clause bill says provisions bill shall apply anonymised data clause empowers central government ask data fiduciaries data processors provide anonymised personal data nonpersonal data improve service delivery b frame policies respect nonpersonal data aside mention government released second version draft nonpersonal data governance framework th december last year written herehttpsinternetfreedominunconstitutionaldraftreportonnonpersonaldataignoresconcernsaboutprivacyanddatamonopolies obligations amp transparency measures another important part robust data protection framework regulation data collection processing purpose chapter ii bill lays certain obligations data fiduciaries firstly personal data shall processed clear lawful purposes user consented privacy user shall ensured processing data processed extent necessary intended purpose notice containing relevant information must sent user collecting data fiduciary must also take necessary steps ensure personal data processed complete accurate date additionally data fiduciaries must respect digital rights users retain personal data beyond time necessary fulfilling original purpose processing data must deleted complement obligations bill chapter vi mandates certain procedural measures data fiduciaries must implement data fiduciary must implement comprehensive privacybydesign policy explains privacy users security data going ensured throughout processing get certified data protection authority found sufficiently robust fiduciaries must also certain information available transparent manner categories personal data generally collected manner collection purposes personal data generally processed categories personal data processed exceptional situations exceptional purposes processing create risk significant harm existence procedure exercise rights data principal chapter v related contact details data fiduciaries also end classified significant data fiduciaries based factors volume data processed turnover fiduciary classification bring additional obligations need conduct data protection audits impact assessments well need designated data protection officer data fiduciaries processors shall implement necessary security safeguards use methods deidentification encryption take steps necessary protect integrity personal data take steps necessary prevent misuse unauthorised access modification disclosure destruction personal data undertake periodic reviews security safeguards must also place effective grievance redressal mechanism complaints must disposed within days receipt data protection bill also specifies behaviour case breach occurs data fiduciaries must inform dpa breaches personal data detailing type nature data involved number persons affected dpa shall decide whether breach reported users dpa may also direct fiduciary question take certain actions exemptions governmental otherwise bill provides variety exemptions criticised sections example chapter iii bill states personal data may processed without consent certain situations including performance state function provision service statutory benefit compliance order judgement court tribunal case medical emergency data principal provision public health services combat pandemic threat public health employer respect data principal employee chapter vii bill provides even broader exemptions government central government interest national security prevention incitement cognizable offence exempt government agency provisions bill centre also exempt data processors process data users outside india provisions bill second blogpost series data protection bill read part herehttpsinternetfreedominstartfromscratchthedatabillseriespart join us next week part explain litany concerns raised data protection bill important documents personal data protection bill introduced minister electronics information technology mr ravi shankar prasad linkhttpswwwprsindiaorgsitesdefaultfilesbillfilespersonaldataprotectionbillcpdf essential features rights respecting data protection law dated february linkhttpsinternetfreedominessentialfeaturesofarightsrespectingdataprotectionlaw iffs public brief analysis personal data protection bill linkhttpssaveourprivacyinmediaallbriefpdpbillpdf saveourprivacy campaign linkhttpssaveourprivacyin ",
    "cleaned_title": "provisions indias incoming data law affect",
    "cleaned_selftext": "ampxb tldr promised part series data bill explain basics personal data protection bill provide introduction main definitions explain data processing authority detail rights users rights ensured practice lastly explain exemptions provided government next edition well talk many challenges loopholes bill recap update last time discussed need data protection billhttpsinternetfreedominstartfromscratchthedatabillseriespart indicated new threats data breacheshttpsinternetfreedominsecurityincidentsandthepersonaldataprotectionbill malicious hackshttpsinternetfreedominnsopegasushackoneyearanniversary governmental corporate surveillancehttpsinternetfreedominworkplacesurveillanceyouremployercouldbewatchingyou emerged world becomes digital also provided historical context personal data protection bill httpsprsindiaorgfilesbillsactsbillsparliamentpersonaldataprotectionbillpdf hinted concerns raised bill regarding report joint parliamentary committee bill update reportshttpswwwmedianamacomjpcdataprotectionextensionparliament emerged committee would postpone submission report indeed came true th march motion movedhttploksabhaphnicinbusinesslistofbusinessaspx extend time presentation report adopted dayhttploksabhaphnicinbusinessuserbulletinaspx thus stands report committee shall presented first week monsoon session time means even important public engage bill understand proposes critique weaker aspects public pressure applied india implements stronger data protection bill glossary important definitions visvis data bill data principal ie user data principal essentially person data belongs data fiduciary ie entity controls storage data defines permitted ways processed data processor ie entity processes data collected data fiduciary suppose use certain social medium eg facebook twitter case data principal social medium data fiduciary since collects data activity medium entity processes data say advertising purposes data processor may authorised third party entity even social medium next need understand categories data personal data refers data may contain information characteristics traits person used identify said person sensitive personal data refers certain categories data financial data health data official identifiers data sexual orientation activity biometric data genetic data transgender status intersex status caste tribe status religious political belief affiliation critical personal data data notified central government critical data important thing critical data processed within country enforce law data protection authority bill chapter ix proposes creation data protection authority dpa essentially dpa main regulator respect processing data bills statement objects reasons states role dpa would gtprotect interests data principals prevent misuse personal data ensure compliance provisions proposed legislation promote awareness data protection authority shall consist one chairperson maximum fulltime members least one shall experience law chairperson shall appointed central government shall responsible directing workings dpa given central role authority several important functions delegated including monitoring enforcing application provisions act taking prompt appropriate action response personal data breach accordance provisions act examination data audit reports taking action pursuant thereto specifying codes practice promote good practices data protection facilitate compliance promoting awareness understanding risks rules safeguards rights respect protection personal data amongst data fiduciaries data principals promoting measures undertaking research innovation field protection personal data advising central government state government authority measures required taken promote protection personal data ensuring consistency application enforcement act apart authority also power issue directions data fiduciary data processor bound comply orders ask data fiduciaries data processors provide relevant information conduct enquiry data fiduciary data processor believes conducted activities manner infringes upon digital rights users believes entity contravened provisions act thus one see data protection authority play vital role regulatory environment dpa protect regulate read digital rights consent user consent recognised key component data protection frameworks recognised clause bill lays personal data processed without obtaining consent user furthermore consent valid freely given b basis informed decision c specific nature clearly expressed e capable withdrawn users must also informed harms might result consequence providing consent provision services made contingent upon provision services fulfillment contract course certain exemptions example processing certain personal data without consent may allowed prevention detection unlawful activity including fraud whistle blowing network information security operation search engines additionally certain exemptions provided governmental agencies along consent framework bill chapter v lays certain rights data principal right confirmation access users right obtain personal data well summary activities performed upon data clear concise manner right correction erasure users right correct complete update personal data users also right erase personal data longer necessary purpose processed right data portability users right receive transferred fiduciary personal data well data generated provision services right forgotten users right restrict prevent disclosure personal data longer necessary purpose collected withdraw consent however rights absolute sense certain limits technical otherwise imposed upon example case right correction erasure data fiduciary may providing user explanation choose reject application though user make fiduciary tage data disputed alternatively case right forgotten requests need go adjudicating officer appointed data protection authority judge whether request valid interregnum nonpersonal data may noticed provisions seem deal personal data may ask nonpersonal data well clause bill says provisions bill shall apply anonymised data clause empowers central government ask data fiduciaries data processors provide anonymised personal data nonpersonal data improve service delivery b frame policies respect nonpersonal data aside mention government released second version draft nonpersonal data governance framework th december last year written herehttpsinternetfreedominunconstitutionaldraftreportonnonpersonaldataignoresconcernsaboutprivacyanddatamonopolies obligations amp transparency measures another important part robust data protection framework regulation data collection processing purpose chapter ii bill lays certain obligations data fiduciaries firstly personal data shall processed clear lawful purposes user consented privacy user shall ensured processing data processed extent necessary intended purpose notice containing relevant information must sent user collecting data fiduciary must also take necessary steps ensure personal data processed complete accurate date additionally data fiduciaries must respect digital rights users retain personal data beyond time necessary fulfilling original purpose processing data must deleted complement obligations bill chapter vi mandates certain procedural measures data fiduciaries must implement data fiduciary must implement comprehensive privacybydesign policy explains privacy users security data going ensured throughout processing get certified data protection authority found sufficiently robust fiduciaries must also certain information available transparent manner categories personal data generally collected manner collection purposes personal data generally processed categories personal data processed exceptional situations exceptional purposes processing create risk significant harm existence procedure exercise rights data principal chapter v related contact details data fiduciaries also end classified significant data fiduciaries based factors volume data processed turnover fiduciary classification bring additional obligations need conduct data protection audits impact assessments well need designated data protection officer data fiduciaries processors shall implement necessary security safeguards use methods deidentification encryption take steps necessary protect integrity personal data take steps necessary prevent misuse unauthorised access modification disclosure destruction personal data undertake periodic reviews security safeguards must also place effective grievance redressal mechanism complaints must disposed within days receipt data protection bill also specifies behaviour case breach occurs data fiduciaries must inform dpa breaches personal data detailing type nature data involved number persons affected dpa shall decide whether breach reported users dpa may also direct fiduciary question take certain actions exemptions governmental otherwise bill provides variety exemptions criticised sections example chapter iii bill states personal data may processed without consent certain situations including performance state function provision service statutory benefit compliance order judgement court tribunal case medical emergency data principal provision public health services combat pandemic threat public health employer respect data principal employee chapter vii bill provides even broader exemptions government central government interest national security prevention incitement cognizable offence exempt government agency provisions bill centre also exempt data processors process data users outside india provisions bill second blogpost series data protection bill read part herehttpsinternetfreedominstartfromscratchthedatabillseriespart join us next week part explain litany concerns raised data protection bill important documents personal data protection bill introduced minister electronics information technology mr ravi shankar prasad linkhttpswwwprsindiaorgsitesdefaultfilesbillfilespersonaldataprotectionbillcpdf essential features rights respecting data protection law dated february linkhttpsinternetfreedominessentialfeaturesofarightsrespectingdataprotectionlaw iffs public brief analysis personal data protection bill linkhttpssaveourprivacyinmediaallbriefpdpbillpdf saveourprivacy campaign linkhttpssaveourprivacyin",
    "cleaned_comments": "bro tumlog itna text jhad ho people dont reactread guys fighting lone fight please appreciate say politely possible please something feel sad helpless whats happen gt exempt government agency provisions bill centre also exempt data processors process data users outside india provisions bill everybody exempt wtf bring data protection bill yup people get lazy soon see long articles including sometimes p since important topic go thanks op detailed post tldr wanted right forgotten even eu passed existence wont go manually delete data live fear google still might data good see progress india joke nothing year old maruti engine body honda city data reviewed officer deletion foreign companies exempt example flipkart singapore registered dont follow guidelines fuck upvoted visibility important part exempt anyone point laws legal route place want go someone future currently due lack laws theres nothing courts dont think infrastructure enforce laws everyone plan make high profile examples pressure companies obey",
    "light_cleaned_title": "The provisions of India's incoming data law and how they will affect you",
    "light_cleaned_selftext": "## Tl;dr It’s here! As promised, part 2 of our series on the data bill will explain the basics of the Personal Data Protection Bill, 2019. In it, we provide an introduction to the main definitions, explain what the Data Processing Authority is, detail what rights users will have and how these rights will be ensured in practice, and lastly, explain the exemptions provided to the government. In the next edition, we'll talk about the many challenges and loopholes in the bill. ## A Recap and an update Last time, we [**discussed the need for a data protection bill**](https://internetfreedom.in/startfromscratch-the-data-bill-series-part-1/) and indicated new threats such as [**data breaches**](https://internetfreedom.in/security-incidents-and-the-personal-data-protection-bill/), [**malicious hacks**](https://internetfreedom.in/nso-pegasus-hack-one-year-anniversary/), and[ **governmental and corporate surveillance**](https://internetfreedom.in/workplace-surveillance-your-employer-could-be-watching-you/) that have emerged as our world becomes more and more digital. We also provided some historical context to the [**Personal Data Protection Bill, 2019**](https://prsindia.org/files/bills_acts/bills_parliament/Personal%20Data%20Protection%20Bill,%202019.pdf) and hinted at some of the concerns that have been raised about the Bill. Regarding the report of the Joint Parliamentary Committee on the Bill, we have an update that [**reports**](https://www.medianama.com/2021/03/223-jpc-data-protection-extension-parliament/) had emerged that the Committee would postpone the submission of the report. Indeed, this came true, as on the 25th of March [**a motion was moved**](http://loksabhaph.nic.in/Business/ListofBusiness.aspx) to extend the time for the presentation of the report and [**was adopted the very same day**](http://loksabhaph.nic.in/Business/UserBulletin1.aspx). Thus, as it stands, the report of the Committee shall be presented in the first week of the Monsoon Session of 2021. We have time. So this means that it is even more important for the public to engage with the bill, understand what it proposes, and critique its weaker aspects so that public pressure can be applied and India implements a stronger data protection bill. ## A Glossary The most important definitions vis-à-vis the data bill are: 1. **Data principal** i.e. you, the user. A data principal is essentially the person to whom the data ‘belongs’ 2. **Data fiduciary** i.e. the entity that controls the storage of the data and defines the permitted ways it can be processed 3. **Data processor** i.e. the entity that processes that data collected by a data fiduciary Suppose you use a certain social medium (eg. Facebook or Twitter). In this case, you are the data principal, the social medium is the data fiduciary (since it collects data about you and your activity on its medium), and the entity that processes your data for, say, advertising purposes is the data processor (this may be an authorised third party entity or even the social medium itself). Next, we need understand the categories of data: 1. **Personal Data:** This refers to data that may contain information about any characteristics or traits of a person and can be used to identify said person. 2. **Sensitive Personal Data:** This refers to certain categories of data such as: financial data, health data, official identifiers; data on sexual orientation and activity, biometric data, genetic data, transgender status, intersex status, caste or tribe status, and religious or political belief or affiliation. 3. **Critical Personal Data:** Any data notified by the Central Government to be critical data. The important thing here is that critical data can only be processed within the country. ## But who will enforce the law? A Data Protection Authority The Bill (Chapter IX) proposes the creation of a Data Protection Authority (DPA). Essentially, the DPA will be the main regulator with respect to the processing of data. The Bill’s Statement of Objects and Reasons states that role of the DPA would be to: &gt;“protect the interests of data principals, prevent any misuse of personal data, ensure compliance with the provisions of the proposed legislation and promote awareness about the data protection” The Authority shall consist of one Chairperson and a maximum of 6 other full-time members, of which at least one shall have experience in law. The chairperson shall be appointed by the Central government and shall be responsible for directing the workings of the DPA. Now, given the central role of the Authority, several important functions have been delegated to it, including: * Monitoring and enforcing application of the provisions of this Act * Taking prompt and appropriate action in response to personal data breach in accordance with the provisions of this Act * Examination of any data audit reports and taking any action pursuant thereto * Specifying codes of practice to promote good practices of data protection and facilitate compliance * Promoting awareness and understanding of the risks, rules, safeguards and rights in respect of protection of personal data amongst data fiduciaries and data principals * Promoting measures and undertaking research for innovation in the field of protection of personal data * Advising Central Government, State Government and any other authority on measures required to be taken to promote protection of personal data and ensuring consistency of application and enforcement of this Act Apart from these, the Authority also has the power to: * Issue directions to any data fiduciary or data processor (who are bound to comply with the orders) * Ask data fiduciaries or data processors to provide any relevant information * Conduct an enquiry about any data fiduciary or data processor if it believes that it has conducted its activities in a manner that infringes upon the digital rights of users or if it believes the entity has contravened any of the provisions of the Act Thus, as one can see, the Data Protection Authority will play a vital role. But what will be the regulatory environment that DPA will protect and regulate? Read on. ## Digital Rights and Consent User consent is recognised as a key component of data protection frameworks, and this is recognised in clause 11 of the Bill, which lays down that personal data cannot be processed without obtaining the consent of the user. Furthermore, such consent is valid only if it is: a) freely given, b) on the basis of an informed decision, c) specific in nature, d) clearly expressed, and e) capable of being withdrawn. Users must also be informed about any harms that might result as a consequence of providing consent, while the provision of services cannot be made contingent upon the provision of services or the fulfillment of a contract. There are, of course, certain exemptions. For example, if the processing of certain personal data is without consent may be allowed for the prevention and detection of any unlawful activity including fraud, whistle blowing, network and information security, and the operation of search engines. Additionally, there are certain exemptions that are provided to governmental agencies. More on this below. Along with a consent framework, the Bill, in Chapter V, lays down certain rights that each data principal has: 1. **Right to confirmation and access:** Users have the right to obtain their personal data as well as a summary of activities performed upon their data in a clear and concise manner. 2. **Right to correction and erasure:** Users have the right to correct, complete, and update their personal data. Users also have the right to erase their personal data after it is no longer necessary for the purpose for which it was processed 3. **Right to Data Portability:** Users have the right to receive and have transferred to any other fiduciary their personal data as well as any data generated during the provision of services. 4. **Right to be Forgotten:** Users have the right to restrict or prevent the disclosure of their personal data if it is no longer necessary for the purpose for which it was collected or if they withdraw their consent. Here too however, these rights are not absolute, in the sense that certain limits, technical and otherwise, are imposed upon them. For example, in the case of the right to correction and erasure, a data fiduciary may, after providing the user with an explanation, choose to reject their application, though the user can make the fiduciary tage the data as disputed. Alternatively, in the case of the right to be forgotten, all requests need to go through an Adjudicating Officer appointed by the Data Protection Authority, who will judge whether any such request is valid. ## Interregnum - What about non-personal data? You may have noticed that most of these provisions seem to deal with personal data, and so you may ask: what about non-personal data? Well, clause 2 of the Bill says that the provisions of the Bill shall not apply to anonymised data, while clause 91 empowers the Central government to: a) ask data fiduciaries and data processors to provide anonymised personal data or non-personal data to improve service delivery and b) frame policies with respect to non-personal data (as an aside, we will mention here that government released the second version of the draft non-personal data governance framework on 16th December last year, which we have written about [**here**](https://internetfreedom.in/unconstitutional-draft-report-on-non-personal-data-ignores-concerns-about-privacy-and-data-monopolies/)). ## Obligations &amp; Transparency Measures Another important part of a robust data protection framework is the regulation of the data collection and processing. For this purpose, chapter II of the Bill lays down certain obligations on data fiduciaries. Firstly, personal data shall only be processed for clear and lawful purposes that a user has consented to, and the privacy of the user shall be ensured while processing. Data can be processed only to the extent that is necessary for the intended purpose, and a notice containing all the relevant information must be sent to the user before collecting their data. The fiduciary must also take the necessary steps to ensure that the personal data processed is complete, accurate, and up to date. Additionally, data fiduciaries must respect the digital rights of users and retain their personal data beyond the time necessary for fulfilling the original purpose of processing, after which such data must be deleted. To complement these obligations, the Bill (Chapter VI) mandates certain procedural measures that data fiduciaries must implement. Each data fiduciary must implement a comprehensive privacy-by-design policy that explains how the privacy of users and the security of their data is going to be ensured throughout processing, they can get to be certified by the Data Protection Authority if it is found to be sufficiently robust. Fiduciaries must also certain information available in a transparent manner, such as: * the categories of personal data generally collected and the manner of such collection * the purposes for which personal data is generally processed * any categories of personal data processed in exceptional situations or any exceptional purposes of processing that create a risk of significant harm * the existence of and the procedure for exercise of rights of data principal under Chapter V and any related contact details for the same Some data fiduciaries will also end up being classified as significant data fiduciaries based on factors such as the volume of data processed and the turnover of the fiduciary. Such classification will bring with it additional obligations, such as the need to conduct data protection audits and impact assessments as well as the need to have a designated data protection officer. Both data fiduciaries and processors shall implement necessary security safeguards, such as: * The use of methods such as de-identification and encryption * Take steps necessary to protect the integrity of personal data * Take steps necessary to prevent misuse, unauthorised access to, modification, disclosure or destruction of personal data * Undertake periodic reviews of their security safeguards They must also have in place an effective grievance redressal mechanism, in which complaints must be disposed of within 30 days of their receipt. The data protection Bill also specifies behaviour in case a breach occurs: data fiduciaries must inform the DPA about any breaches of personal data, detailing the type and nature of the data involved and the number of persons affected. The DPA shall then decide whether the breach should be reported to the users. The DPA may also direct the fiduciary in question to take certain actions. ## Exemptions, governmental and otherwise The Bill provides for a variety of exemptions and these are some of its most criticised sections. For example, chapter III of the Bill states that personal data may be processed without consent in certain situations, including: 1. The performance of any State function, such as the provision of a service or statutory benefit 2. In compliance with any order or judgement of a Court or a Tribunal 3. In case of a medical emergency for the data principal 4. For the provision of public health services to combat a pandemic or any other threat to the public health 5. By an employer with respect to a data principal who is an employee Chapter VII of the Bill provides even broader exemptions to the government: the Central Government can, in the interest of national security and the prevention of incitement to any cognizable offence, **exempt any government agency** from any of the provisions of the Bill. The Centre can also exempt data processors that process the data of users outside India from the provisions of the Bill. *This is the second blogpost in our series on the Data Protection Bill; read part 1* [***here***](https://internetfreedom.in/startfromscratch-the-data-bill-series-part-1/)*. Join us next week in part 3, where we explain the litany of concerns that have been raised about the Data Protection Bill.* ## Important Documents 1. *The Personal Data Protection Bill, 2019* as introduced by the Minister for Electronics and Information Technology, Mr. Ravi Shankar Prasad ([**link**](https://www.prsindia.org/sites/default/files/bill_files/Personal%20Data%20Protection%20Bill%2C%202019.pdf)) 2. Essential Features of a Rights Respecting Data Protection Law dated February 28, 2020 ([**link**](https://internetfreedom.in/essential-features-of-a-rights-respecting-data-protection-law/)) 3. IFF's Public Brief and Analysis of the Personal Data Protection Bill, 2019 ([**link**](https://saveourprivacy.in/media/all/Brief-PDP-Bill-25.12.2020.pdf)) 4. The SaveOurPrivacy Campaign ([**link**](https://saveourprivacy.in/))",
    "light_cleaned_comments": "bro tumlog itna text jhad the ho people don't react/read at all. you guys are fighting the lone fight so please so I appreciate it. I say this as politely as possible too but please do something about it, I feel sad and helpless about what's about to happen \\&gt; **exempt any government agency** from any of the provisions of the Bill. The Centre can also **exempt data processors that process the data of users outside India** from the provisions of the Bill Everybody is exempt, wtf bring the data protection bill? yup, people just get lazy as soon as they see long articles (including me sometimes :P ). But since it was an important topic to me, i had to go through it. Thanks OP for the detailed post! tldr? I wanted Right to be forgotten even before EU passed it into existence, because now I won't have to go and manually delete my data and then live in the fear that google still might have my data. Good to see some progress in India ! This is a joke! This is nothing but a 25 year old Maruti 800 engine in the body of a Honda City!! Data will be reviewed by an officer before deletion? And foreign companies are exempt? For example Flipkart is Singapore registered so they don't have to follow these guidelines? Fuck off! Upvoted for visibility The important part here is that they \"can\" exempt anyone, not \"will\". The point of these laws in to have a legal route in place if they want to go after someone in future. Currently, due to lack of laws, there's nothing they can do in the courts. I don't think they have the infrastructure to enforce these laws for everyone. They just plan to make some high profile examples to pressure companies to obey."
}