{
    "id": "1cwjjfh",
    "title": "Good public officers like Divya Mittal who brought piped drinking water to a village after 7 generations of struggle was immediately transferred afterwards while power hungry Shailesh kumar Yadav get suspended briefly for physically assaulting, berating and exposing the identities of public for YT",
    "url": "https://www.reddit.com/r/india/comments/1cwjjfh/good_public_officers_like_divya_mittal_who/",
    "selftext": "Honorable District Magistrate Divya Mittal wrote in her tweet these words \n\n“Today my heart is full and I am overwhelmed with emotions. Water is flowing in Lahuriya deh and through my eyes and the eyes of people there. \n\nEven after 75 years of Independence, people of Lahuria Deh village, Mirzapur did not have access to water! Situated on a hilltop on the border of UP-MP, the topography made any attempts to get water there 'impossible'. When I went there for the first time, I did not have the heart to drink water from my water bottle in front of the villagers. Aadhar cards were used to issue water through tankers. People did not marry their daughters to this village. “ \n\nSource: https://x.com/divyamittal_ias/status/1696714607673348589?s=46\n\nShe was immediately transferred after she brought water to the village after 7 generations of waiting as she dented the profits of corrupt politicians in that region\n\n“DM Divya Mittal, a 2013 Batch IAS (UP Cadre) was transferred for bringing water to a village after 76 years of Independence. She was also harassed in a way that her posting got cancelled & she was later put on waiting. (Waiting for posting status)\n\nPeople of the village say that the leaders or officers before her could never do anything to solve their problem which she did in a matter of 9 months. They demand the govt to send her back to Mirzapur.”\n\nThe existence of these honest, humble, amazing and compassionate people in public service is making me believe that there are still good people in power but it’s sad that they get crushed by goons in politics. \n\nAll this while power tripping officers who run around with cameras and keep posting power trip videos on YouTube and insta get fame and money. \n\nThere have been many and one example is Shailesh Kumar Yadav who harassed, berated and physically abused members of a gathering even though they had written permission for the same. \n\nSource: https://theprint.in/india/mentally-devastated-he-harassed-us-says-brides-mother-of-wedding-raided-by-tripura-dm/647813/comment-page-1/?amp\n\nThis person was briefly suspended with salary and was allowed to join back and holds very powerful posts now. \n\nIs there any checks in place to limit the powers of these public servants and keep tabs on their performance ? \n\nThis country has been made livable by a few handful of good administrators, politicians and thousands of tax payers who are working towards improving the quality of life for the rest of Indians\n\nI have given sources for my statements.",
    "flair": "Rant / Vent",
    "score": 146,
    "num_comments": 5,
    "created_utc": 1716222019.0,
    "convurl": "https://external-preview.redd.it/7U2Ef_vKifaa_2yRTOUU57iW6yx0uQTvTmvzpuRrIjc.jpg?auto=webp&s=53b277d6147a2fa6fac57581281a2f6ca44badc0",
    "comments": [
        "Water pipes will not run the country.\n\nPower hungry people will.\n\n\nSimilarly  rapists , murderers  and gangsters, corrupt conmen are found in real life non political arena who lead the nation without consequences .\n\n\n/s???",
        "They can lead the nation if majority wants. Its the people who won’t like it or relate to them.\nThe leader represents the country and also their people. Its the people themselves who elected that person as their MLA.\n\nMoney cannot teach you ethics. High GDP doesn’t make you moral and happy. Its only the education and deep thinking that breaks the bounds of the society and gives you the confidence to make choices in your life.. and also to choose a good leader outside your caste and community.",
        "Last time this was posted I remember that the water pipe somehow got \"damaged\" and the old status quo returned.",
        "India is not a country for honest people in any field , least of all the bureaucracy , which is heavily involved in politics and currying favours for themselves.."
    ],
    "cleaned_text": "good public officers like divya mittal brought piped drinking water village generations struggle immediately transferred afterwards power hungry shailesh kumar yadav get suspended briefly physically assaulting berating exposing identities public yt honorable district magistrate divya mittal wrote tweet words today heart full overwhelmed emotions water flowing lahuriya deh eyes eyes people even years independence people lahuria deh village mirzapur access water situated hilltop border upmp topography made attempts get water impossible went first time heart drink water water bottle front villagers aadhar cards used issue water tankers people marry daughters village source immediately transferred brought water village generations waiting dented profits corrupt politicians region dm divya mittal batch ias cadre transferred bringing water village years independence also harassed way posting got cancelled later put waiting waiting posting status people village say leaders officers could never anything solve problem matter months demand govt send back mirzapur existence honest humble amazing compassionate people public service making believe still good people power sad get crushed goons politics power tripping officers run around cameras keep posting power trip videos youtube insta get fame money many one example shailesh kumar yadav harassed berated physically abused members gathering even though written permission source person briefly suspended salary allowed join back holds powerful posts checks place limit powers public servants keep tabs performance country made livable handful good administrators politicians thousands tax payers working towards improving quality life rest indians given sources statements ",
    "cleaned_title": "good public officers like divya mittal brought piped drinking water village generations struggle immediately transferred afterwards power hungry shailesh kumar yadav get suspended briefly physically assaulting berating exposing identities public yt",
    "cleaned_selftext": "honorable district magistrate divya mittal wrote tweet words today heart full overwhelmed emotions water flowing lahuriya deh eyes eyes people even years independence people lahuria deh village mirzapur access water situated hilltop border upmp topography made attempts get water impossible went first time heart drink water water bottle front villagers aadhar cards used issue water tankers people marry daughters village source immediately transferred brought water village generations waiting dented profits corrupt politicians region dm divya mittal batch ias cadre transferred bringing water village years independence also harassed way posting got cancelled later put waiting waiting posting status people village say leaders officers could never anything solve problem matter months demand govt send back mirzapur existence honest humble amazing compassionate people public service making believe still good people power sad get crushed goons politics power tripping officers run around cameras keep posting power trip videos youtube insta get fame money many one example shailesh kumar yadav harassed berated physically abused members gathering even though written permission source person briefly suspended salary allowed join back holds powerful posts checks place limit powers public servants keep tabs performance country made livable handful good administrators politicians thousands tax payers working towards improving quality life rest indians given sources statements",
    "cleaned_comments": "water pipes run country power hungry people similarly rapists murderers gangsters corrupt conmen found real life non political arena lead nation without consequences lead nation majority wants people wont like relate leader represents country also people people elected person mla money teach ethics high gdp doesnt make moral happy education deep thinking breaks bounds society gives confidence make choices life also choose good leader outside caste community last time posted remember water pipe somehow got damaged old status quo returned india country honest people field least bureaucracy heavily involved politics currying favours",
    "light_cleaned_title": "Good public officers like Divya Mittal who brought piped drinking water to a village after 7 generations of struggle was immediately transferred afterwards while power hungry Shailesh kumar Yadav get suspended briefly for physically assaulting, berating and exposing the identities of public for YT",
    "light_cleaned_selftext": "Honorable District Magistrate Divya Mittal wrote in her tweet these words “Today my heart is full and I am overwhelmed with emotions. Water is flowing in Lahuriya deh and through my eyes and the eyes of people there. Even after 75 years of Independence, people of Lahuria Deh village, Mirzapur did not have access to water! Situated on a hilltop on the border of UP-MP, the topography made any attempts to get water there 'impossible'. When I went there for the first time, I did not have the heart to drink water from my water bottle in front of the villagers. Aadhar cards were used to issue water through tankers. People did not marry their daughters to this village. “ Source: She was immediately transferred after she brought water to the village after 7 generations of waiting as she dented the profits of corrupt politicians in that region “DM Divya Mittal, a 2013 Batch IAS (UP Cadre) was transferred for bringing water to a village after 76 years of Independence. She was also harassed in a way that her posting got cancelled & she was later put on waiting. (Waiting for posting status) People of the village say that the leaders or officers before her could never do anything to solve their problem which she did in a matter of 9 months. They demand the govt to send her back to Mirzapur.” The existence of these honest, humble, amazing and compassionate people in public service is making me believe that there are still good people in power but it’s sad that they get crushed by goons in politics. All this while power tripping officers who run around with cameras and keep posting power trip videos on YouTube and insta get fame and money. There have been many and one example is Shailesh Kumar Yadav who harassed, berated and physically abused members of a gathering even though they had written permission for the same. Source: This person was briefly suspended with salary and was allowed to join back and holds very powerful posts now. Is there any checks in place to limit the powers of these public servants and keep tabs on their performance ? This country has been made livable by a few handful of good administrators, politicians and thousands of tax payers who are working towards improving the quality of life for the rest of Indians I have given sources for my statements.",
    "light_cleaned_comments": "Water pipes will not run the country. Power hungry people will. Similarly rapists , murderers and gangsters, corrupt conmen are found in real life non political arena who lead the nation without consequences . /s??? They can lead the nation if majority wants. Its the people who won’t like it or relate to them. The leader represents the country and also their people. Its the people themselves who elected that person as their MLA. Money cannot teach you ethics. High GDP doesn’t make you moral and happy. Its only the education and deep thinking that breaks the bounds of the society and gives you the confidence to make choices in your life.. and also to choose a good leader outside your caste and community. Last time this was posted I remember that the water pipe somehow got \"damaged\" and the old status quo returned. India is not a country for honest people in any field , least of all the bureaucracy , which is heavily involved in politics and currying favours for themselves.."
}