{
    "id": "164u5vp",
    "title": "India 2020 Visions",
    "url": "https://www.reddit.com/r/india/comments/164u5vp/india_2020_visions/",
    "selftext": "What happened to our dear 11th president  Dr. APJ. Abdul Kalam's vision for this great nation, I am not entirely updated on current politics or current affairs, so putting this question out there... remember reading the book \"INDIA 2020\" a few years back.  \n\n\nhttps://preview.redd.it/15mpg1vw44lb1.png?width=547&format=png&auto=webp&s=41d4e9347515d3a443365a0c0cb0ed665b0eb199",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693342604.0,
    "convurl": "https://b.thumbs.redditmedia.com/6Kxp8_jFHAOq747Dy3_NfbtD8Q-XtyB1BaJQMuQlnRE.jpg",
    "comments": [
        "Dr Kalam got much bigger offer than most IITians in the US but he rejected and worked for ISRO & DRDO and as a president because he wasn’t a materialistic but a spiritual person.\n\nBut today most IITians are leaving for better jobs and consider having private high paying jobs than government jobs for upbringing India.\n\nIt's not the only reason but one of many.\n\nNot hate for IITians, you guys work hard !",
        "Why you're mentioning IITians in this post? \n\nNobody is stopping anyone from joining DRDO/ISRO. These are research oriented institutions. An Undergraduation (B.tech) from IIT is not enough for doing research. It's for creating great engineers. \n\nAnd you have no idea how many people who did M.Tech (masters) and P.hDs from IITs are working in PSU's, DRDO, ISRO, NTPC etc.",
        "India is on right track. Things are only getting better.",
        "People who go to abroad for jobs are never from MTech they are mostly from BTech\n\nAlso I removed the name of college and changed it with \"prestigious institutions\" please do the same",
        "A Scientist Job at ISRO is equalient to a group-B officer. Salary is low compared to even PSUs. \nYou will forever be middle class. It makes much sense to IIT graduates to \ngo and work for big Tech, get experience and in next 15-20 years you can become an consultant and earn in crores."
    ],
    "cleaned_text": "india visions happened dear th president dr apj abdul kalams vision great nation entirely updated current politics current affairs putting question remember reading book india years back ",
    "cleaned_title": "india visions",
    "cleaned_selftext": "happened dear th president dr apj abdul kalams vision great nation entirely updated current politics current affairs putting question remember reading book india years back",
    "cleaned_comments": "dr kalam got much bigger offer iitians us rejected worked isro drdo president wasnt materialistic spiritual person today iitians leaving better jobs consider private high paying jobs government jobs upbringing india reason one many hate iitians guys work hard youre mentioning iitians post nobody stopping anyone joining drdoisro research oriented institutions undergraduation btech iit enough research creating great engineers idea many people mtech masters phds iits working psus drdo isro ntpc etc india right track things getting better people go abroad jobs never mtech mostly btech also removed name college changed prestigious institutions please scientist job isro equalient groupb officer salary low compared even psus forever middle class makes much sense iit graduates go work big tech get experience next years become consultant earn crores",
    "light_cleaned_title": "India 2020 Visions",
    "light_cleaned_selftext": "What happened to our dear 11th president Dr. APJ. Abdul Kalam's vision for this great nation, I am not entirely updated on current politics or current affairs, so putting this question out there... remember reading the book \"INDIA 2020\" a few years back.",
    "light_cleaned_comments": "Dr Kalam got much bigger offer than most IITians in the US but he rejected and worked for ISRO & DRDO and as a president because he wasn’t a materialistic but a spiritual person. But today most IITians are leaving for better jobs and consider having private high paying jobs than government jobs for upbringing India. It's not the only reason but one of many. Not hate for IITians, you guys work hard ! Why you're mentioning IITians in this post? Nobody is stopping anyone from joining DRDO/ISRO. These are research oriented institutions. An Undergraduation (B.tech) from IIT is not enough for doing research. It's for creating great engineers. And you have no idea how many people who did M.Tech (masters) and P.hDs from IITs are working in PSU's, DRDO, ISRO, NTPC etc. India is on right track. Things are only getting better. People who go to abroad for jobs are never from MTech they are mostly from BTech Also I removed the name of college and changed it with \"prestigious institutions\" please do the same A Scientist Job at ISRO is equalient to a group-B officer. Salary is low compared to even PSUs. You will forever be middle class. It makes much sense to IIT graduates to go and work for big Tech, get experience and in next 15-20 years you can become an consultant and earn in crores."
}