{
    "id": "1bwjyvv",
    "title": "RBI buys 8.7 tonne of gold in January alone , which is the highest in the last two years ",
    "url": "https://www.ndtv.com/india-news/as-rbi-buys-several-tons-of-gold-governor-says-india-building-gold-reserves-5380607",
    "selftext": "“We are building up gold reserves that is a part of our reserve deployment,\" Governor Das told reporters at the customary post-policy review press conference.\n\nHe did not give any specifics on the quantum of gold buys, but pointed to the official data which shows an increase in the value of gold reserves.",
    "flair": "Policy/Economy",
    "score": 3,
    "num_comments": 2,
    "created_utc": 1712328617.0,
    "convurl": "https://external-preview.redd.it/7Z6y-7qo0RJzR1liMJZJNSJuNQNa6zEqMupW9Qu4pPk.jpg?auto=webp&s=cef8faaa094a256d98c6422d0719ebd4391fecff",
    "comments": [
        "it's a bad sign.\nRussia accumulated gold too  before launching invasion.",
        "Reddit is so pessimistic all the time and everything is bad news. You may be be right but let’s also look at the fact that the central banks have been buying gold for a while now. In an uncertain economic scenario as many countries in west are entering now or are already officially in recession it’s a solid strategy for emerging maarket central banks."
    ],
    "cleaned_text": "rbi buys tonne gold january alone highest last two years building gold reserves part reserve deployment governor das told reporters customary postpolicy review press conference give specifics quantum gold buys pointed official data shows increase value gold reserves ",
    "cleaned_title": "rbi buys tonne gold january alone highest last two years",
    "cleaned_selftext": "building gold reserves part reserve deployment governor das told reporters customary postpolicy review press conference give specifics quantum gold buys pointed official data shows increase value gold reserves",
    "cleaned_comments": "bad sign russia accumulated gold launching invasion reddit pessimistic time everything bad news may right lets also look fact central banks buying gold uncertain economic scenario many countries west entering already officially recession solid strategy emerging maarket central banks",
    "light_cleaned_title": "RBI buys 8.7 tonne of gold in January alone , which is the highest in the last two years",
    "light_cleaned_selftext": "“We are building up gold reserves that is a part of our reserve deployment,\" Governor Das told reporters at the customary post-policy review press conference. He did not give any specifics on the quantum of gold buys, but pointed to the official data which shows an increase in the value of gold reserves.",
    "light_cleaned_comments": "it's a bad sign. Russia accumulated gold too before launching invasion. Reddit is so pessimistic all the time and everything is bad news. You may be be right but let’s also look at the fact that the central banks have been buying gold for a while now. In an uncertain economic scenario as many countries in west are entering now or are already officially in recession it’s a solid strategy for emerging maarket central banks."
}