{
    "id": "16bgvou",
    "title": "What is Bharat?",
    "url": "https://www.reddit.com/r/india/comments/16bgvou/what_is_bharat/",
    "selftext": "Modi Government and its propaganda media has created another misdirection with “Bharat vs India”. But what is Bharat? Is it [helping crony capitalists make billions with corruption](https://www.reuters.com/world/india/business-partners-indias-adani-family-used-opaque-funds-invest-its-stocks-media-2023-08-30/), while [three-fourth of the population is unable to fill their stomach](https://www.thehindu.com/data/as-food-prices-rise-74-in-india-cant-afford-a-healthy-diet-un-agency-report-data/article67256967.ece)? Is it about [hiding the poor behind sheets](https://www.reuters.com/graphics/G20-SUMMIT/SLUM/zdpxrxoaypx/), so you can show off your fake prosperity to world leaders? What does Modi and his coterie know of Bharat?\n\nThose who claim to be proprietors of Bharat must read this poem by Pash.\n\n**भारत: पाश**\n\nमेरे सम्मान का सबसे महान शब्द,  \nजहाँ कहीं भी प्रयोग किया जाए,  \nबाक़ी सभी शब्द अर्थहीन हो जाते है।\n\nइस शब्द के अर्थ,  \nखेतों के उन बेटों में है,  \nजो आज भी वृक्षों की परछाइओं से,  \nवक़्त मापते है,  \nउनके पास, सिवाय पेट के, कोई समस्या नहीं,  \nऔर वह भूख लगने पर,  \nअपने अंग भी चबा सकते है,  \nउनके लिए ज़िन्दगी एक परम्परा है,  \nऔर मौत के अर्थ है मुक्ति।  \nजब भी कोई समूचे भारत की,  \n'राष्ट्रीय एकता' की बात करता है,  \nतो मेरा दिल चाहता है,  \nउसकी टोपी हवा में उछाल दूँ,  \nउसे बताऊँ,  \nके भारत के अर्थ,  \nकिसी दुष्यन्त से सम्बन्धित नहीं,  \nवरन खेत में दायर है,  \nजहाँ अन्न उगता है,  \nजहाँ सेंध लगती है।",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693996989.0,
    "convurl": "https://external-preview.redd.it/3K18pkUXcj84UxIrMNPyAcYPAkgC08FcSevmOr9Dzhw.jpg?auto=webp&s=700c2d01853be5b5889754d99c64e546d46f3cde",
    "comments": [
        "Kya timepass kr rahe yrr tum bhi, hua kuch nahi hona kuch nahi kavita pel rahe baith ke 😕",
        "Yea, the government trolls and people get trolled. The real issues get buried in all this.",
        "What are the real issues?"
    ],
    "cleaned_text": "bharat modi government propaganda media created another misdirection bharat vs india bharat helping crony capitalists make billions corruptionhttpswwwreuterscomworldindiabusinesspartnersindiasadanifamilyusedopaquefundsinvestitsstocksmedia threefourth population unable fill stomachhttpswwwthehinducomdataasfoodpricesriseinindiacantaffordahealthydietunagencyreportdataarticleece hiding poor behind sheetshttpswwwreuterscomgraphicsgsummitslumzdpxrxoaypx show fake prosperity world leaders modi coterie know bharat claim proprietors bharat must read poem pash ",
    "cleaned_title": "bharat",
    "cleaned_selftext": "modi government propaganda media created another misdirection bharat vs india bharat helping crony capitalists make billions corruptionhttpswwwreuterscomworldindiabusinesspartnersindiasadanifamilyusedopaquefundsinvestitsstocksmedia threefourth population unable fill stomachhttpswwwthehinducomdataasfoodpricesriseinindiacantaffordahealthydietunagencyreportdataarticleece hiding poor behind sheetshttpswwwreuterscomgraphicsgsummitslumzdpxrxoaypx show fake prosperity world leaders modi coterie know bharat claim proprietors bharat must read poem pash",
    "cleaned_comments": "kya timepass kr rahe yrr tum bhi hua kuch nahi hona kuch nahi kavita pel rahe baith ke yea government trolls people get trolled real issues get buried real issues",
    "light_cleaned_title": "What is Bharat?",
    "light_cleaned_selftext": "Modi Government and its propaganda media has created another misdirection with “Bharat vs India”. But what is Bharat? Is it [helping crony capitalists make billions with corruption](https://www.reuters.com/world/india/business-partners-indias-adani-family-used-opaque-funds-invest-its-stocks-media-2023-08-30/), while [three-fourth of the population is unable to fill their stomach](https://www.thehindu.com/data/as-food-prices-rise-74-in-india-cant-afford-a-healthy-diet-un-agency-report-data/article67256967.ece)? Is it about [hiding the poor behind sheets](https://www.reuters.com/graphics/G20-SUMMIT/SLUM/zdpxrxoaypx/), so you can show off your fake prosperity to world leaders? What does Modi and his coterie know of Bharat? Those who claim to be proprietors of Bharat must read this poem by Pash. **भारत: पाश** मेरे सम्मान का सबसे महान शब्द, जहाँ कहीं भी प्रयोग किया जाए, बाक़ी सभी शब्द अर्थहीन हो जाते है। इस शब्द के अर्थ, खेतों के उन बेटों में है, जो आज भी वृक्षों की परछाइओं से, वक़्त मापते है, उनके पास, सिवाय पेट के, कोई समस्या नहीं, और वह भूख लगने पर, अपने अंग भी चबा सकते है, उनके लिए ज़िन्दगी एक परम्परा है, और मौत के अर्थ है मुक्ति। जब भी कोई समूचे भारत की, 'राष्ट्रीय एकता' की बात करता है, तो मेरा दिल चाहता है, उसकी टोपी हवा में उछाल दूँ, उसे बताऊँ, के भारत के अर्थ, किसी दुष्यन्त से सम्बन्धित नहीं, वरन खेत में दायर है, जहाँ अन्न उगता है, जहाँ सेंध लगती है।",
    "light_cleaned_comments": "Kya timepass kr rahe yrr tum bhi, hua kuch nahi hona kuch nahi kavita pel rahe baith ke 😕 Yea, the government trolls and people get trolled. The real issues get buried in all this. What are the real issues?"
}