{
    "id": "1dotb69",
    "title": "Ghatkopar hoarding collapse: Maha govt suspends IPS officer Quaiser Khalid. Till people forget. Why no firing from service? ",
    "url": "https://www.business-standard.com/india-news/ghatkopar-hoarding-collapse-maha-govt-suspends-ips-officer-quaiser-khalid-124062501385_1.html",
    "selftext": "Why not remove from service? There is no risk in the Job. The officer will ve reinstated afer sometime when people forget. ",
    "flair": "Crime",
    "score": 23,
    "num_comments": 5,
    "created_utc": 1719389334.0,
    "convurl": "https://external-preview.redd.it/_ATN-Ap9TsgaNiV3D9FF9LIYEbsKpQmtZgge9wi32y0.jpg?auto=webp&s=c64792c125b5401bc482f8c5a1037838e0f29b1a",
    "comments": [
        "Job termination will happen if convicted in court. Problem is slow judiciary. Giving governments draconian powers is not the answer.",
        "Right.",
        "Wait. Why are cops the ultimate authority for approving installation of hoardings? Even if the installer was on some police property, municipal corporation should be the one that had the final say. ",
        "Shouldn’t this responsibility rest with the municipality? What kinda fucked yup system do we have where cops approve hoardings"
    ],
    "cleaned_text": "ghatkopar hoarding collapse maha govt suspends ips officer quaiser khalid till people forget firing service remove service risk job officer reinstated afer sometime people forget ",
    "cleaned_title": "ghatkopar hoarding collapse maha govt suspends ips officer quaiser khalid till people forget firing service",
    "cleaned_selftext": "remove service risk job officer reinstated afer sometime people forget",
    "cleaned_comments": "job termination happen convicted court problem slow judiciary giving governments draconian powers answer right wait cops ultimate authority approving installation hoardings even installer police property municipal corporation one final say shouldnt responsibility rest municipality kinda fucked yup system cops approve hoardings",
    "light_cleaned_title": "Ghatkopar hoarding collapse: Maha govt suspends IPS officer Quaiser Khalid. Till people forget. Why no firing from service?",
    "light_cleaned_selftext": "Why not remove from service? There is no risk in the Job. The officer will ve reinstated afer sometime when people forget.",
    "light_cleaned_comments": "Job termination will happen if convicted in court. Problem is slow judiciary. Giving governments draconian powers is not the answer. Right. Wait. Why are cops the ultimate authority for approving installation of hoardings? Even if the installer was on some police property, municipal corporation should be the one that had the final say. Shouldn’t this responsibility rest with the municipality? What kinda fucked yup system do we have where cops approve hoardings"
}