{
    "id": "12ac5p6",
    "title": "“No evidence!”: UP court acquits 40 men 36 years after killing 72 Muslims in Maliana",
    "url": "https://maktoobmedia.com/india/no-evidence-up-court-acquits-40-men-36-years-after-killing-72-muslims-in-maliana/",
    "selftext": "A Meerut court has acquitted 40 people accused of arson, murder and rioting in the 36-year-old Maliana anti-Muslim pogrom case for lack of evidence. It has been 36 years since 72 Muslims were brutally killed by Hindu mob in the small town of Maliana, in Uttar Pradesh, during anti-Muslim violence in Meerut district. A day earlier, at least 42 Muslim men had been killed in Hashimpura, a neighbourhood in Meerut.",
    "flair": "Law & Courts",
    "score": 607,
    "num_comments": 74,
    "created_utc": 1680504738.0,
    "convurl": "https://external-preview.redd.it/dNpuCYbvpuwB64jqlL5zq6kCCaHxM4JfZjtuXrBEk7I.jpg?auto=webp&v=enabled&s=bf1733f18ccc2323a983ee9eff69e43a873546f7",
    "comments": [
        "Wait if they have been acquited .doesn't  that mean that they were wrongfully accused despite the lack of evidence.",
        "Yes. Technically. In US they can sue government for millions",
        "How did this case go on in courts for 36 years without evidence?",
        "Those 72 Muslims + 42 Muslims must have all burnt their own homes and then committed suicide.",
        ">the fake accused \n\nThe victims must've killed themselves to frame them.",
        "Only if judiciary and administration do their job well.... People don't have take matters in their own hand...  Other people will only blame them later on...",
        "Bring some garlands for them",
        "And someone is convicted for 2 years because “he hurt people’s sentiments”, law in this country has become joke.",
        "I don’t understand your position here. I am simply surprised that they were tried for so long without evidence",
        "Always has been",
        "Garland them, distribute laddus and send them to Parliament.\n\nThese are Brave Sanskari Naagrik.",
        "They were waiting for witnesses to die so they could claim there was no evidence. \n\nJokes aside, such cases dragging half a lifetime only indicates how apathetic the judicial system is, both for the victims as well as the accused.",
        "Just like our Sallu bhai! No evidence found.",
        ">but it could have all been prevented if the loudspeakers were not calling \"people of faith\" to fight.\n\nWhat are you talking about?",
        "Next bjp mps",
        "Imagine all those people whose life was wasted because biased action by police. We need to have system to compensate such victims",
        "You made the claim provide the source",
        "Sometimes i feel like some vigilante to take on streets then i see BD goons killing people in name of cow protection and i immediately return to rule of law should be there and let courts do the job side.",
        "And I heard someone saying\n\n#\"HINDU KHATRE MEIN HAI\"\n#\"HINDU KHATRE MEIN HAI\"\n#\"HINDU KHATRE MEIN HAI\"\n#\"HINDU KHATRE MEIN HAI\"\n#\"HINDU KHATRE MEIN HAI\"\n#\"HINDU KHATRE MEIN HAI\"\n#\"HINDU KHATRE MEIN HAI\"",
        "Whole govt and the state police is complicit in coverup",
        "UP model",
        "That's the thing with what they want to brainwash common people..",
        "but there is evidence of that /s",
        "Courts*\n\nOur judicial systems need immediate overhaul.",
        "Was your response to the four men acquitted of Jaipur blasts few days ago, \"the bomb must have gone off itself to frame them\"?",
        "But the fascist govt has only been in power since 9 years??",
        "indian judicial system is broken beyond repair. The chief justice of india does gyan chodan everyday other day. I see his face almost everyday give gyan to every person on earth. He must take a few of those gyan and give to his own people.",
        "Who were? Are you saying the judiciary has been anti muslim since 36 years?",
        "But the case started 36 years ago when Congress was in power lol",
        "What a weird caption. The 40 men were acqitted and it took the slow judicial system 36 fucking years to do it and this mahapurush ignores that completely to write \"after killing 72 Muslims\". You don't trust the judical system even though the case started during the time of congress? Out of the 36 years, 25 years were under Congress rule right? Did the Congress influence the judiciary to further their anti muslim ideology?",
        "It was congress in UP, 36 years back, when this happened. \nDuring 1975-1977, 140000 people were jailed without trial for speaking against govt, by this someone’s grand mother. Law became joke then itself.",
        "Why would anyone trust this joke of a judicial system? No one killed those 72 Muslims? Aliens killed them?\n\nEveryone knows how the Indian state protects right wing mass murderers.",
        "Give credit to BJP where its due.\n\nThey started giving tickets to rioters while in Congress, they got elected first and then became rioters.",
        ">He must take a few of those gyan and give to his own people.\n\nHalf his people since half the seats are empty in the judiciary.",
        "I think ~~full~~ all of their brains are empty.",
        "Competing with Gujarat model. Releasing convicted gangrapists, baby killers, murderers.\n\nComing to your city, now.",
        "Apathetic =/= anti Muslim. However, it's quite possible that UP judiciary at the peak of the agitation to destroy the mosq was anti Muslim.",
        "Can't ignore that. I wonder when will Indians start getting a good class of politicians to choose from",
        "The headlines could be interpreted  either way. But your comment does point out and accuse a single party.\nMake no mistake, there are lots of us like me, who know very well that not a single major party in this country including congress and bjp alike are capable of running the country. And they do everything in their power to weaken the judiciary.\nSo yeah, Congress was in power, and they have time and again tried to ride the hindutva (under different names) train themselves.",
        "So it's violent mobs on both sides? Better vote for the mob that isn't targetting me then.",
        "Someone did. But after a long ass trial, there wasn't enough evidence to convict anyone. That's how courts work around the world. Maybe you are a proponent of encounter culture? You should know the risks behind that as an educated person. \n\n>Everyone knows how the Indian state protects right wing mass murderers.\n\nFor real? Even the Gandhis and Nehrus? I had no idea, do tell me more.",
        "Well if the judges themselves had biased in their mind then there's nothing we can do or say about it as normal citizens. The collegiate system is a double edged sword.",
        "Good to see you can accept that the Congress is no better on these issues.",
        "In Uttar Pradesh, the atrocities from both sides have no bounds. My family is from Aligarh and Meerut, I have heard stories when they had to barricade themselves during curfew and my grandparents armed themselves to protect their families. This went on till the 90s. It is engrained in the history and culture.",
        "I don't think so. &nbsp; If it was, the case would've been dismissed much earlier. &nbsp; Think of what went on with the people who had to spend 36 years of their lives under this shadow. &nbsp; &nbsp; An anti-Muslim judiciary wouldn't have allowed such a fate to befall killers of Muslims. &nbsp; More likely the system was just apathetic.",
        ">72 Muslims + 42 Muslims must have all burnt their own homes and then committed suicide.\n\nOf course they didn't, but that doesn't mean the 40 people accused in this case are the ones that did it.",
        "Exactly! As someone whose extended family lived in Aligarh for decades.\n\nI can also assure Hindus and Muslims both lived in their Ghettos. My grandmother used to tell stories about how until 3 decades ago, riots were normal and so were the blood baths of people in the riots. She has seen people stabbed to death in front of her eyes during Riots.",
        "Don’t underestimate politicians’ disinterest in the lives of the pawns they use for political gain.",
        "So no one killed them, they were killed by no one.\nNo accountability. \nJust wow.",
        "My dad was here at the time, he was lucky he got away",
        "Judiciary is slow.\n\nSome cases are going on 59 years.",
        "That's why they say trains ran on time during Indira Gandhi because no one was allowed to complain.",
        "It is horrific either way you look at it. Either we have innocents in jail for 36 years. Or we have terrorists out. We will never know for sure.",
        "I believe everyone is innocent until proven otherwise",
        "Agreed. The higher you go in the hierarchy, the more disconnected they are from reality and surprisingly corruptible. But judges in general are extremely smart and well-aware, especially the district and session Judicial Magistrates\n\nMost however have their hands tied behind their back by inane and prehistoric laws and glaring loopholes that they cannot do anything about, plus an extremely incompetent and corrupt police force and understaffed teams.",
        "You have a point there.\n\nThere is a reason why caste-based voting is so common in the cowbelt since what is on offer is not employment, healthcare, or infrastructure but general safety from mobs.",
        "Makes sense. And the mobs can be religion based as well. Atleast that's the case in my Bengal where caste isn't really a big issue. Violence here used to be only party based but religion based violence is slowly growing as well.",
        "Collegiate system has nothing to do with the appointment of the lowest judiciary. Those get selected through government exams, just like the other government servants. Only High court and supreme court appointments are recommended by the collegium.\n\nEven with that, you routinely see high court judges punishing victims by forcing them to marry their rapists in the name of rehabilitation, using Manusmriti to justify their judgements etc."
    ],
    "cleaned_text": "evidence court acquits men years killing muslims maliana meerut court acquitted people accused arson murder rioting yearold maliana antimuslim pogrom case lack evidence years since muslims brutally killed hindu mob small town maliana uttar pradesh antimuslim violence meerut district day earlier least muslim men killed hashimpura neighbourhood meerut ",
    "cleaned_title": "evidence court acquits men years killing muslims maliana",
    "cleaned_selftext": "meerut court acquitted people accused arson murder rioting yearold maliana antimuslim pogrom case lack evidence years since muslims brutally killed hindu mob small town maliana uttar pradesh antimuslim violence meerut district day earlier least muslim men killed hashimpura neighbourhood meerut",
    "cleaned_comments": "wait acquited doesnt mean wrongfully accused despite lack evidence yes technically us sue government millions case go courts years without evidence muslims muslims must burnt homes committed suicide fake accused victims mustve killed frame judiciary administration job well people dont take matters hand people blame later bring garlands someone convicted years hurt peoples sentiments law country become joke dont understand position simply surprised tried long without evidence always garland distribute laddus send parliament brave sanskari naagrik waiting witnesses die could claim evidence jokes aside cases dragging half lifetime indicates apathetic judicial system victims well accused like sallu bhai evidence found could prevented loudspeakers calling people faith fight talking next bjp mps imagine people whose life wasted biased action police need system compensate victims made claim provide source sometimes feel like vigilante take streets see bd goons killing people name cow protection immediately return rule law let courts job side heard someone saying hindu khatre mein hai hindu khatre mein hai hindu khatre mein hai hindu khatre mein hai hindu khatre mein hai hindu khatre mein hai hindu khatre mein hai whole govt state police complicit coverup model thats thing want brainwash common people evidence courts judicial systems need immediate overhaul response four men acquitted jaipur blasts days ago bomb must gone frame fascist govt power since years indian judicial system broken beyond repair chief justice india gyan chodan everyday day see face almost everyday give gyan every person earth must take gyan give people saying judiciary anti muslim since years case started years ago congress power lol weird caption men acqitted took slow judicial system fucking years mahapurush ignores completely write killing muslims dont trust judical system even though case started time congress years years congress rule right congress influence judiciary anti muslim ideology congress years back happened people jailed without trial speaking govt someones grand mother law became joke would anyone trust joke judicial system one killed muslims aliens killed everyone knows indian state protects right wing mass murderers give credit bjp due started giving tickets rioters congress got elected first became rioters must take gyan give people half people since half seats empty judiciary think full brains empty competing gujarat model releasing convicted gangrapists baby killers murderers coming city apathetic anti muslim however quite possible judiciary peak agitation destroy mosq anti muslim cant ignore wonder indians start getting good class politicians choose headlines could interpreted either way comment point accuse single party make mistake lots us like know well single major party country including congress bjp alike capable running country everything power weaken judiciary yeah congress power time tried ride hindutva different names train violent mobs sides better vote mob isnt targetting someone long ass trial wasnt enough evidence convict anyone thats courts work around world maybe proponent encounter culture know risks behind educated person everyone knows indian state protects right wing mass murderers real even gandhis nehrus idea tell well judges biased mind theres nothing say normal citizens collegiate system double edged sword good see accept congress better issues uttar pradesh atrocities sides bounds family aligarh meerut heard stories barricade curfew grandparents armed protect families went till engrained history culture dont think nbsp case wouldve dismissed much earlier nbsp think went people spend years lives shadow nbsp nbsp antimuslim judiciary wouldnt allowed fate befall killers muslims nbsp likely system apathetic muslims muslims must burnt homes committed suicide course didnt doesnt mean people accused case ones exactly someone whose extended family lived aligarh decades also assure hindus muslims lived ghettos grandmother used tell stories decades ago riots normal blood baths people riots seen people stabbed death front eyes riots dont underestimate politicians disinterest lives pawns use political gain one killed killed one accountability wow dad time lucky got away judiciary slow cases going years thats say trains ran time indira gandhi one allowed complain horrific either way look either innocents jail years terrorists never know sure believe everyone innocent proven otherwise agreed higher go hierarchy disconnected reality surprisingly corruptible judges general extremely smart wellaware especially district session judicial magistrates however hands tied behind back inane prehistoric laws glaring loopholes anything plus extremely incompetent corrupt police force understaffed teams point reason castebased voting common cowbelt since offer employment healthcare infrastructure general safety mobs makes sense mobs religion based well atleast thats case bengal caste isnt really big issue violence used party based religion based violence slowly growing well collegiate system nothing appointment lowest judiciary get selected government exams like government servants high court supreme court appointments recommended collegium even routinely see high court judges punishing victims forcing marry rapists name rehabilitation using manusmriti justify judgements etc",
    "light_cleaned_title": "“No evidence!”: UP court acquits 40 men 36 years after killing 72 Muslims in Maliana",
    "light_cleaned_selftext": "A Meerut court has acquitted 40 people accused of arson, murder and rioting in the 36-year-old Maliana anti-Muslim pogrom case for lack of evidence. It has been 36 years since 72 Muslims were brutally killed by Hindu mob in the small town of Maliana, in Uttar Pradesh, during anti-Muslim violence in Meerut district. A day earlier, at least 42 Muslim men had been killed in Hashimpura, a neighbourhood in Meerut.",
    "light_cleaned_comments": "Wait if they have been acquited .doesn't that mean that they were wrongfully accused despite the lack of evidence. Yes. Technically. In US they can sue government for millions How did this case go on in courts for 36 years without evidence? Those 72 Muslims + 42 Muslims must have all burnt their own homes and then committed suicide. >the fake accused The victims must've killed themselves to frame them. Only if judiciary and administration do their job well.... People don't have take matters in their own hand... Other people will only blame them later on... Bring some garlands for them And someone is convicted for 2 years because “he hurt people’s sentiments”, law in this country has become joke. I don’t understand your position here. I am simply surprised that they were tried for so long without evidence Always has been Garland them, distribute laddus and send them to Parliament. These are Brave Sanskari Naagrik. They were waiting for witnesses to die so they could claim there was no evidence. Jokes aside, such cases dragging half a lifetime only indicates how apathetic the judicial system is, both for the victims as well as the accused. Just like our Sallu bhai! No evidence found. >but it could have all been prevented if the loudspeakers were not calling \"people of faith\" to fight. What are you talking about? Next bjp mps Imagine all those people whose life was wasted because biased action by police. We need to have system to compensate such victims You made the claim provide the source Sometimes i feel like some vigilante to take on streets then i see BD goons killing people in name of cow protection and i immediately return to rule of law should be there and let courts do the job side. And I heard someone saying #\"HINDU KHATRE MEIN HAI\" #\"HINDU KHATRE MEIN HAI\" #\"HINDU KHATRE MEIN HAI\" #\"HINDU KHATRE MEIN HAI\" #\"HINDU KHATRE MEIN HAI\" #\"HINDU KHATRE MEIN HAI\" #\"HINDU KHATRE MEIN HAI\" Whole govt and the state police is complicit in coverup UP model That's the thing with what they want to brainwash common people.. but there is evidence of that /s Courts* Our judicial systems need immediate overhaul. Was your response to the four men acquitted of Jaipur blasts few days ago, \"the bomb must have gone off itself to frame them\"? But the fascist govt has only been in power since 9 years?? indian judicial system is broken beyond repair. The chief justice of india does gyan chodan everyday other day. I see his face almost everyday give gyan to every person on earth. He must take a few of those gyan and give to his own people. Who were? Are you saying the judiciary has been anti muslim since 36 years? But the case started 36 years ago when Congress was in power lol What a weird caption. The 40 men were acqitted and it took the slow judicial system 36 fucking years to do it and this mahapurush ignores that completely to write \"after killing 72 Muslims\". You don't trust the judical system even though the case started during the time of congress? Out of the 36 years, 25 years were under Congress rule right? Did the Congress influence the judiciary to further their anti muslim ideology? It was congress in UP, 36 years back, when this happened. During 1975-1977, 140000 people were jailed without trial for speaking against govt, by this someone’s grand mother. Law became joke then itself. Why would anyone trust this joke of a judicial system? No one killed those 72 Muslims? Aliens killed them? Everyone knows how the Indian state protects right wing mass murderers. Give credit to BJP where its due. They started giving tickets to rioters while in Congress, they got elected first and then became rioters. >He must take a few of those gyan and give to his own people. Half his people since half the seats are empty in the judiciary. I think ~~full~~ all of their brains are empty. Competing with Gujarat model. Releasing convicted gangrapists, baby killers, murderers. Coming to your city, now. Apathetic =/= anti Muslim. However, it's quite possible that UP judiciary at the peak of the agitation to destroy the mosq was anti Muslim. Can't ignore that. I wonder when will Indians start getting a good class of politicians to choose from The headlines could be interpreted either way. But your comment does point out and accuse a single party. Make no mistake, there are lots of us like me, who know very well that not a single major party in this country including congress and bjp alike are capable of running the country. And they do everything in their power to weaken the judiciary. So yeah, Congress was in power, and they have time and again tried to ride the hindutva (under different names) train themselves. So it's violent mobs on both sides? Better vote for the mob that isn't targetting me then. Someone did. But after a long ass trial, there wasn't enough evidence to convict anyone. That's how courts work around the world. Maybe you are a proponent of encounter culture? You should know the risks behind that as an educated person. >Everyone knows how the Indian state protects right wing mass murderers. For real? Even the Gandhis and Nehrus? I had no idea, do tell me more. Well if the judges themselves had biased in their mind then there's nothing we can do or say about it as normal citizens. The collegiate system is a double edged sword. Good to see you can accept that the Congress is no better on these issues. In Uttar Pradesh, the atrocities from both sides have no bounds. My family is from Aligarh and Meerut, I have heard stories when they had to barricade themselves during curfew and my grandparents armed themselves to protect their families. This went on till the 90s. It is engrained in the history and culture. I don't think so. &nbsp; If it was, the case would've been dismissed much earlier. &nbsp; Think of what went on with the people who had to spend 36 years of their lives under this shadow. &nbsp; &nbsp; An anti-Muslim judiciary wouldn't have allowed such a fate to befall killers of Muslims. &nbsp; More likely the system was just apathetic. >72 Muslims + 42 Muslims must have all burnt their own homes and then committed suicide. Of course they didn't, but that doesn't mean the 40 people accused in this case are the ones that did it. Exactly! As someone whose extended family lived in Aligarh for decades. I can also assure Hindus and Muslims both lived in their Ghettos. My grandmother used to tell stories about how until 3 decades ago, riots were normal and so were the blood baths of people in the riots. She has seen people stabbed to death in front of her eyes during Riots. Don’t underestimate politicians’ disinterest in the lives of the pawns they use for political gain. So no one killed them, they were killed by no one. No accountability. Just wow. My dad was here at the time, he was lucky he got away Judiciary is slow. Some cases are going on 59 years. That's why they say trains ran on time during Indira Gandhi because no one was allowed to complain. It is horrific either way you look at it. Either we have innocents in jail for 36 years. Or we have terrorists out. We will never know for sure. I believe everyone is innocent until proven otherwise Agreed. The higher you go in the hierarchy, the more disconnected they are from reality and surprisingly corruptible. But judges in general are extremely smart and well-aware, especially the district and session Judicial Magistrates Most however have their hands tied behind their back by inane and prehistoric laws and glaring loopholes that they cannot do anything about, plus an extremely incompetent and corrupt police force and understaffed teams. You have a point there. There is a reason why caste-based voting is so common in the cowbelt since what is on offer is not employment, healthcare, or infrastructure but general safety from mobs. Makes sense. And the mobs can be religion based as well. Atleast that's the case in my Bengal where caste isn't really a big issue. Violence here used to be only party based but religion based violence is slowly growing as well. Collegiate system has nothing to do with the appointment of the lowest judiciary. Those get selected through government exams, just like the other government servants. Only High court and supreme court appointments are recommended by the collegium. Even with that, you routinely see high court judges punishing victims by forcing them to marry their rapists in the name of rehabilitation, using Manusmriti to justify their judgements etc."
}