{
    "id": "1gjtuye",
    "title": "Deals are not cut like this (in meetings with Govt)… please trust Judges: CJI Chandrachud",
    "url": "https://indianexpress.com/article/india/deals-are-not-cut-like-this-in-meetings-with-govt-please-trust-judges-cji-chandrachud-9653594/?ref=hometop_hp",
    "selftext": "As a general rule when someone demands 'trust' alarm bells go off in my head. \n\nTrustworthy people earn trust through their actions and don't ask for it. ",
    "flair": "Law & Courts",
    "score": 52,
    "num_comments": 16,
    "created_utc": 1730766353.0,
    "convurl": "https://external-preview.redd.it/w1Kr6bYBXCdeT1lh_3J4HW3cpjrvHFmlSDNc3qlBCV0.jpg?auto=webp&s=09bae17cc5f24f29c7f9000d8fca5a234780f8ed",
    "comments": [
        "What a disappointment this guy turned out to be. He’s quite naive and seems oblivious to how his institution has been severely compromised over the years. He also wears his Hindu religion on his sleeve, in a country where millions are harassed on that basis. I think he means well but is simply too idealistic for the role history gave him.",
        "There is nothing Being religious or talk about your religion. This is talked about in American politics all the time. But while working they should know how to separate between state and religion. If he has failed in that then it’s a different story.",
        "The outcomes show that they are being cut somewhere.\n\n>“Speaking for myself, I’ve always said that I’ve granted bail from A to Z — from Arnab to Zubair. That is my philosophy,” he said.\n\nWell, there's also an U in jail for four years and counting waiting for bail, along with an S, G, M and many others. Could have put your philosophy in practice there too.",
        "Chacha wants to ride both boat at same time, either you die a hero or rich.",
        "The fact of the matter is, as I said, deals are never cut like this (during such interactions). So please, trust us, we are not there to cut deals\n\nSir your house  and Modiji's offering Pooja  whilst you nd ur wife are mute spectators  ..that itself raises eyebrows.\n\nhttps://preview.redd.it/dkj0o511h0zd1.png?width=1024&format=pjpg&auto=webp&s=3c761616832675571e18a464333297e3da58ac11",
        "He is not idealistic. Idealistic implies having some principles and stubbornly following them to the end of the world. He is the farthest thing from it. He just cares about perception and keeping up an image for that sake.\n\nHe has always been one of the biggest hypocrites I have ever seen and it was amusing that people saw him as some kind of savior of democracy.",
        "Perception is important. He may feel confident he can be unbiased, but the reason we have institutional protections is so that a nation doesn’t have to rely on perfectly moral people. The American system was designed to need just ordinary people; that’s why their institutions survive their often clueless  leaders. He’s made it easier for a corrupt judge to weaken the separation between the branches of the government. And between state and religion. And has he forgotten how his predecessor got a Rajya Sabha seat?",
        "The more this one learns to shut up the better it is for his own sake. We have had enough of you. You had your chance and you screwed it. *Ab kripya aage barhiye*.",
        "You're being too kind when you call him naive. He comes from privilege and the privilege has been put to good use. An exception was made for him when he was appointed Judge at the Bombay HC at 41 - for the rest the minimum age is 45. There have been instances when some of the most deserving people were turned down by the collegium because the candidates were short of 45 by a few months.\n\nThe reality is like he was passed on the baton and it is his time now to ensure he successfully manages to pass the baton to his ilk. And he's deftly doing that.",
        "He is justifying his actions so that he is not judged like his father in history books. He is trying to act too smart",
        "What does it have to do anything with being religious???? Can’t you mfs just go one day without mentioning religion any fucking topic. It’s his religion he’ll follow it he’ll wear it on his sleeves or he’ll talk about it.",
        "No we don’t want you religious mofus taking over the judicial branch as well. We’d prefer that the CJI not listen to imaginary critters before making a legal decision. It sounds disturbing frankly.",
        "Ruled Delhi services belong to elected government, didn't hear petition against the ordinance to change that.\n\nRuled Governor can't sit on Bills, did nothing when the Governor made a legal excuse..effectively letting her repeat it. \n\nRuled in favor of Shiv Sena, but kept the government that only was possible because the case was not heard. \n\nTalks of 377 in every three speeches, didn't learn from CJI Misra that doctrines like 'progressive realisation of rights' need to be considered while dealing with issues that can be overturned. \n\nTalks about adoptive daughters in every speech, left the question of adoption for LGBTQ+ parents to the government. \n\nRuled about 'indirect discrimination' in the case of Permanent Comission for women in armed forces. Then forgot about it when the Centre refused to accept the Collegium recommendation because the advocate had a partner of the same gender. \n\nBails given to political prisoners: 0\n\nLegacy: -200. \n\nThe legacy was supposed to be the judge who removed the distinction between married and unmarried women in MTP Act. Then famously denied abortion to a woman with post-partum depression because 1 doctor mailed. \n\nNot one ruling changed anything for anyone as CJI.",
        "Well there’s no rule that you can’t be judge if you’re religious. So cry about it, we live in democratic country so people can follow and be religious",
        "Agreed, fair point. Still weird and disturbing though. The CJI looks to imaginary critters for guidance on points of law. Imagine."
    ],
    "cleaned_text": "deals cut like meetings govt please trust judges cji chandrachud general rule someone demands trust alarm bells go head trustworthy people earn trust actions dont ask ",
    "cleaned_title": "deals cut like meetings govt please trust judges cji chandrachud",
    "cleaned_selftext": "general rule someone demands trust alarm bells go head trustworthy people earn trust actions dont ask",
    "cleaned_comments": "disappointment guy turned hes quite naive seems oblivious institution severely compromised years also wears hindu religion sleeve country millions harassed basis think means well simply idealistic role history gave nothing religious talk religion talked american politics time working know separate state religion failed different story outcomes show cut somewhere speaking ive always said ive granted bail z arnab zubair philosophy said well theres also u jail four years counting waiting bail along g many others could put philosophy practice chacha wants ride boat time either die hero rich fact matter said deals never cut like interactions please trust us cut deals sir house modijis offering pooja whilst nd ur wife mute spectators raises eyebrows idealistic idealistic implies principles stubbornly following end world farthest thing cares perception keeping image sake always one biggest hypocrites ever seen amusing people saw kind savior democracy perception important may feel confident unbiased reason institutional protections nation doesnt rely perfectly moral people american system designed need ordinary people thats institutions survive often clueless leaders hes made easier corrupt judge weaken separation branches government state religion forgotten predecessor got rajya sabha seat one learns shut better sake enough chance screwed ab kripya aage barhiye youre kind call naive comes privilege privilege put good use exception made appointed judge bombay hc rest minimum age instances deserving people turned collegium candidates short months reality like passed baton time ensure successfully manages pass baton ilk hes deftly justifying actions judged like father history books trying act smart anything religious cant mfs go one day without mentioning religion fucking topic religion hell follow hell wear sleeves hell talk dont want religious mofus taking judicial branch well wed prefer cji listen imaginary critters making legal decision sounds disturbing frankly ruled delhi services belong elected government didnt hear petition ordinance change ruled governor cant sit bills nothing governor made legal excuseeffectively letting repeat ruled favor shiv sena kept government possible case heard talks every three speeches didnt learn cji misra doctrines like progressive realisation rights need considered dealing issues overturned talks adoptive daughters every speech left question adoption lgbtq parents government ruled indirect discrimination case permanent comission women armed forces forgot centre refused accept collegium recommendation advocate partner gender bails given political prisoners legacy legacy supposed judge removed distinction married unmarried women mtp act famously denied abortion woman postpartum depression doctor mailed one ruling changed anything anyone cji well theres rule cant judge youre religious cry live democratic country people follow religious agreed fair point still weird disturbing though cji looks imaginary critters guidance points law imagine",
    "light_cleaned_title": "Deals are not cut like this (in meetings with Govt)… please trust Judges: CJI Chandrachud",
    "light_cleaned_selftext": "As a general rule when someone demands 'trust' alarm bells go off in my head. Trustworthy people earn trust through their actions and don't ask for it.",
    "light_cleaned_comments": "What a disappointment this guy turned out to be. He’s quite naive and seems oblivious to how his institution has been severely compromised over the years. He also wears his Hindu religion on his sleeve, in a country where millions are harassed on that basis. I think he means well but is simply too idealistic for the role history gave him. There is nothing Being religious or talk about your religion. This is talked about in American politics all the time. But while working they should know how to separate between state and religion. If he has failed in that then it’s a different story. The outcomes show that they are being cut somewhere. >“Speaking for myself, I’ve always said that I’ve granted bail from A to Z — from Arnab to Zubair. That is my philosophy,” he said. Well, there's also an U in jail for four years and counting waiting for bail, along with an S, G, M and many others. Could have put your philosophy in practice there too. Chacha wants to ride both boat at same time, either you die a hero or rich. The fact of the matter is, as I said, deals are never cut like this (during such interactions). So please, trust us, we are not there to cut deals Sir your house and Modiji's offering Pooja whilst you nd ur wife are mute spectators ..that itself raises eyebrows. He is not idealistic. Idealistic implies having some principles and stubbornly following them to the end of the world. He is the farthest thing from it. He just cares about perception and keeping up an image for that sake. He has always been one of the biggest hypocrites I have ever seen and it was amusing that people saw him as some kind of savior of democracy. Perception is important. He may feel confident he can be unbiased, but the reason we have institutional protections is so that a nation doesn’t have to rely on perfectly moral people. The American system was designed to need just ordinary people; that’s why their institutions survive their often clueless leaders. He’s made it easier for a corrupt judge to weaken the separation between the branches of the government. And between state and religion. And has he forgotten how his predecessor got a Rajya Sabha seat? The more this one learns to shut up the better it is for his own sake. We have had enough of you. You had your chance and you screwed it. *Ab kripya aage barhiye*. You're being too kind when you call him naive. He comes from privilege and the privilege has been put to good use. An exception was made for him when he was appointed Judge at the Bombay HC at 41 - for the rest the minimum age is 45. There have been instances when some of the most deserving people were turned down by the collegium because the candidates were short of 45 by a few months. The reality is like he was passed on the baton and it is his time now to ensure he successfully manages to pass the baton to his ilk. And he's deftly doing that. He is justifying his actions so that he is not judged like his father in history books. He is trying to act too smart What does it have to do anything with being religious???? Can’t you mfs just go one day without mentioning religion any fucking topic. It’s his religion he’ll follow it he’ll wear it on his sleeves or he’ll talk about it. No we don’t want you religious mofus taking over the judicial branch as well. We’d prefer that the CJI not listen to imaginary critters before making a legal decision. It sounds disturbing frankly. Ruled Delhi services belong to elected government, didn't hear petition against the ordinance to change that. Ruled Governor can't sit on Bills, did nothing when the Governor made a legal excuse..effectively letting her repeat it. Ruled in favor of Shiv Sena, but kept the government that only was possible because the case was not heard. Talks of 377 in every three speeches, didn't learn from CJI Misra that doctrines like 'progressive realisation of rights' need to be considered while dealing with issues that can be overturned. Talks about adoptive daughters in every speech, left the question of adoption for LGBTQ+ parents to the government. Ruled about 'indirect discrimination' in the case of Permanent Comission for women in armed forces. Then forgot about it when the Centre refused to accept the Collegium recommendation because the advocate had a partner of the same gender. Bails given to political prisoners: 0 Legacy: -200. The legacy was supposed to be the judge who removed the distinction between married and unmarried women in MTP Act. Then famously denied abortion to a woman with post-partum depression because 1 doctor mailed. Not one ruling changed anything for anyone as CJI. Well there’s no rule that you can’t be judge if you’re religious. So cry about it, we live in democratic country so people can follow and be religious Agreed, fair point. Still weird and disturbing though. The CJI looks to imaginary critters for guidance on points of law. Imagine."
}