{
    "id": "15tb259",
    "title": "TIL, Indian systems of Formal Logic",
    "url": "https://www.reddit.com/r/india/comments/15tb259/til_indian_systems_of_formal_logic/",
    "selftext": "I learnt recently that only three civilizations have developed their own systems of formal logic, Greeks, Chinese and Indians, where all three independently formulated their own ideas, but even here Chinese logic faded away due to laws during Qin dynasty so they imported Buddhist logic from India so it was truly Indians and greeks who innovated in this field, according to Max Mueller \"  The sciences of Logic and Grammar were, as far as history allows us to judge, invented or originally conceived by two nations only, by Hindus and Greeks\". Paninian Grammar is oldest formal grammar which also anticipated backus naur form and some aspects of Boolean logic, Tholkappiyam also anticipated many developements in linguistics, but this is not the where it ends, both Buddhists and Jains contributed immensely,  [Catuṣkoṭi - Wikipedia](https://en.wikipedia.org/wiki/Catu%E1%B9%A3ko%E1%B9%ADi) logic for example by Nagarjuna anticipated many developments in paraconsistent logic and this was furthered by  [Jaina seven-valued logic - Wikipedia](https://en.wikipedia.org/wiki/Jaina_seven-valued_logic) , both Buddhists and Jains contributed immensely to Logic systems , While Nagarjuna did it in the south, in the north, Vasabhandhu, Dignaga and dharmakriti furthered it,  [Trairūpya - Wikipedia](https://en.wikipedia.org/wiki/Trair%C5%ABpya) of Vasabhandhu was furthered by Dignaga who gave  [Hetucakra - Wikipedia](https://en.wikipedia.org/wiki/Hetucakra) to further Vasabhandu's work and anticipates   John Stuart Mill's Joint Method of Agreement and Difference, which is inductive. Both these buddhist logic systems spread to China where they could not understand it and did not develop logic at all. This isn't even the best of Indian Logic, the best comes from  [Navya-Nyāya - Wikipedia](https://en.wikipedia.org/wiki/Navya-Ny%C4%81ya)  developed a sophisticated language and conceptual scheme that allowed it to raise, analyse, and solve problems in logic and epistemology. It systematised all the Nyāya concepts into four main categories: sense or perception (pratyakşa), inference (anumāna), comparison or similarity upamana, and testimony (sound or word; śabda).  This later school began around eastern[ ](https://en.wikipedia.org/wiki/East_India)India and Bengal, and developed theories resembling modern logic, such as Gottlog Frege's \"distinction between sense and reference of proper names\" and his \"definition of number,\" as well as the Navya-Nyaya theory of \"restrictive conditions for universals\" anticipating some of the developments in modern set theory. Udayana in particular developed theories on \"restrictive conditions for universals\" and \"infinite regress\" that anticipated aspects of modern set theory. In a letter to Mary Boole, she says that her husband George Boole, Augustus De Morgan and Charles Babbage got inspired from this school of Logic and this was something they heard about from George Everest. Hence you shouldn't be surprised when De Morgan said   \"The two races which have founded the mathematics, those of the [Sanskrit](https://en.wikipedia.org/wiki/Sanskrit) and Greek languages, have been the two which have independently formed systems of logic.\" , What are your thoughts, anything you like to add and anything you wish to contribute as there are about 44 million untranslated manuscripts.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692241799.0,
    "convurl": "https://external-preview.redd.it/pN_zyvrTVWPE3bBgfBN2wWjyDM5mojQMM__mCoyp7hE.jpg?auto=webp&s=71f7bf8bf01a7fd21a7ee1f93b4e8dc56a1d2777",
    "comments": [
        "RemindMe! 2 days",
        "I will be messaging you in 2 days on [**2023-08-19 03:13:28 UTC**](http://www.wolframalpha.com/input/?i=2023-08-19%2003:13:28%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/15tb259/til_indian_systems_of_formal_logic/jwj0cbt/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F15tb259%2Ftil_indian_systems_of_formal_logic%2Fjwj0cbt%2F%5D%0A%0ARemindMe%21%202023-08-19%2003%3A13%3A28%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2015tb259)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        "amazing information. next time please use paragraphs 🙏🏻"
    ],
    "cleaned_text": "til indian systems formal logic learnt recently three civilizations developed systems formal logic greeks chinese indians three independently formulated ideas even chinese logic faded away due laws qin dynasty imported buddhist logic india truly indians greeks innovated field according max mueller sciences logic grammar far history allows us judge invented originally conceived two nations hindus greeks paninian grammar oldest formal grammar also anticipated backus naur form aspects boolean logic tholkappiyam also anticipated many developements linguistics ends buddhists jains contributed immensely catukoi wikipediahttpsenwikipediaorgwikicatuebakoebadi logic example nagarjuna anticipated many developments paraconsistent logic furthered jaina sevenvalued logic wikipediahttpsenwikipediaorgwikijainasevenvaluedlogic buddhists jains contributed immensely logic systems nagarjuna south north vasabhandhu dignaga dharmakriti furthered trairpya wikipediahttpsenwikipediaorgwikitraircabpya vasabhandhu furthered dignaga gave hetucakra wikipediahttpsenwikipediaorgwikihetucakra vasabhandus work anticipates john stuart mills joint method agreement difference inductive buddhist logic systems spread china could understand develop logic isnt even best indian logic best comes navyanyya wikipediahttpsenwikipediaorgwikinavyanycya developed sophisticated language conceptual scheme allowed raise analyse solve problems logic epistemology systematised nyya concepts four main categories sense perception pratyaka inference anumna comparison similarity upamana testimony sound word abda later school began around eastern httpsenwikipediaorgwikieastindiaindia bengal developed theories resembling modern logic gottlog freges distinction sense reference proper names definition number well navyanyaya theory restrictive conditions universals anticipating developments modern set theory udayana particular developed theories restrictive conditions universals infinite regress anticipated aspects modern set theory letter mary boole says husband george boole augustus de morgan charles babbage got inspired school logic something heard george everest hence shouldnt surprised de morgan said two races founded mathematics sanskrithttpsenwikipediaorgwikisanskrit greek languages two independently formed systems logic thoughts anything like add anything wish contribute million untranslated manuscripts ",
    "cleaned_title": "til indian systems formal logic",
    "cleaned_selftext": "learnt recently three civilizations developed systems formal logic greeks chinese indians three independently formulated ideas even chinese logic faded away due laws qin dynasty imported buddhist logic india truly indians greeks innovated field according max mueller sciences logic grammar far history allows us judge invented originally conceived two nations hindus greeks paninian grammar oldest formal grammar also anticipated backus naur form aspects boolean logic tholkappiyam also anticipated many developements linguistics ends buddhists jains contributed immensely catukoi wikipediahttpsenwikipediaorgwikicatuebakoebadi logic example nagarjuna anticipated many developments paraconsistent logic furthered jaina sevenvalued logic wikipediahttpsenwikipediaorgwikijainasevenvaluedlogic buddhists jains contributed immensely logic systems nagarjuna south north vasabhandhu dignaga dharmakriti furthered trairpya wikipediahttpsenwikipediaorgwikitraircabpya vasabhandhu furthered dignaga gave hetucakra wikipediahttpsenwikipediaorgwikihetucakra vasabhandus work anticipates john stuart mills joint method agreement difference inductive buddhist logic systems spread china could understand develop logic isnt even best indian logic best comes navyanyya wikipediahttpsenwikipediaorgwikinavyanycya developed sophisticated language conceptual scheme allowed raise analyse solve problems logic epistemology systematised nyya concepts four main categories sense perception pratyaka inference anumna comparison similarity upamana testimony sound word abda later school began around eastern httpsenwikipediaorgwikieastindiaindia bengal developed theories resembling modern logic gottlog freges distinction sense reference proper names definition number well navyanyaya theory restrictive conditions universals anticipating developments modern set theory udayana particular developed theories restrictive conditions universals infinite regress anticipated aspects modern set theory letter mary boole says husband george boole augustus de morgan charles babbage got inspired school logic something heard george everest hence shouldnt surprised de morgan said two races founded mathematics sanskrithttpsenwikipediaorgwikisanskrit greek languages two independently formed systems logic thoughts anything like add anything wish contribute million untranslated manuscripts",
    "cleaned_comments": "remindme days messaging days utchttpwwwwolframalphacominputiutctolocaltime remind linkhttpswwwredditcomrindiacommentstbtilindiansystemsofformallogicjwjcbtcontext click linkhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessagebhttpsaffwwwredditcomfrfindiafcommentsftbftilindiansystemsofformallogicfjwjcbtfdaaremindmeaautc send pm also reminded reduce spam parent commenter delete message hide othershttpswwwredditcommessagecomposetoremindmebotsubjectdeletecommentmessagedeletetb infohttpswwwredditcomrremindmebotcommentsebkoremindmebotinfovcustomhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessageblinkormessageinsidesquarebracketsdaaremindmetimeperiodhereyour remindershttpswwwredditcommessagecomposetoremindmebotsubjectlistofremindersmessagemyremindersfeedbackhttpswwwredditcommessagecomposetowatchfulsubjectremindmebotfeedback amazing information next time please use paragraphs",
    "light_cleaned_title": "TIL, Indian systems of Formal Logic",
    "light_cleaned_selftext": "I learnt recently that only three civilizations have developed their own systems of formal logic, Greeks, Chinese and Indians, where all three independently formulated their own ideas, but even here Chinese logic faded away due to laws during Qin dynasty so they imported Buddhist logic from India so it was truly Indians and greeks who innovated in this field, according to Max Mueller \" The sciences of Logic and Grammar were, as far as history allows us to judge, invented or originally conceived by two nations only, by Hindus and Greeks\". Paninian Grammar is oldest formal grammar which also anticipated backus naur form and some aspects of Boolean logic, Tholkappiyam also anticipated many developements in linguistics, but this is not the where it ends, both Buddhists and Jains contributed immensely, [Catuṣkoṭi - Wikipedia](https://en.wikipedia.org/wiki/Catu%E1%B9%A3ko%E1%B9%ADi) logic for example by Nagarjuna anticipated many developments in paraconsistent logic and this was furthered by [Jaina seven-valued logic - Wikipedia](https://en.wikipedia.org/wiki/Jaina_seven-valued_logic) , both Buddhists and Jains contributed immensely to Logic systems , While Nagarjuna did it in the south, in the north, Vasabhandhu, Dignaga and dharmakriti furthered it, [Trairūpya - Wikipedia](https://en.wikipedia.org/wiki/Trair%C5%ABpya) of Vasabhandhu was furthered by Dignaga who gave [Hetucakra - Wikipedia](https://en.wikipedia.org/wiki/Hetucakra) to further Vasabhandu's work and anticipates John Stuart Mill's Joint Method of Agreement and Difference, which is inductive. Both these buddhist logic systems spread to China where they could not understand it and did not develop logic at all. This isn't even the best of Indian Logic, the best comes from [Navya-Nyāya - Wikipedia](https://en.wikipedia.org/wiki/Navya-Ny%C4%81ya) developed a sophisticated language and conceptual scheme that allowed it to raise, analyse, and solve problems in logic and epistemology. It systematised all the Nyāya concepts into four main categories: sense or perception (pratyakşa), inference (anumāna), comparison or similarity upamana, and testimony (sound or word; śabda). This later school began around eastern[ ](https://en.wikipedia.org/wiki/East_India)India and Bengal, and developed theories resembling modern logic, such as Gottlog Frege's \"distinction between sense and reference of proper names\" and his \"definition of number,\" as well as the Navya-Nyaya theory of \"restrictive conditions for universals\" anticipating some of the developments in modern set theory. Udayana in particular developed theories on \"restrictive conditions for universals\" and \"infinite regress\" that anticipated aspects of modern set theory. In a letter to Mary Boole, she says that her husband George Boole, Augustus De Morgan and Charles Babbage got inspired from this school of Logic and this was something they heard about from George Everest. Hence you shouldn't be surprised when De Morgan said \"The two races which have founded the mathematics, those of the [Sanskrit](https://en.wikipedia.org/wiki/Sanskrit) and Greek languages, have been the two which have independently formed systems of logic.\" , What are your thoughts, anything you like to add and anything you wish to contribute as there are about 44 million untranslated manuscripts.",
    "light_cleaned_comments": "RemindMe! 2 days I will be messaging you in 2 days on [**2023-08-19 03:13:28 UTC**](http://www.wolframalpha.com/input/?i=2023-08-19%2003:13:28%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/15tb259/til_indian_systems_of_formal_logic/jwj0cbt/?context=3) [**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F15tb259%2Ftil_indian_systems_of_formal_logic%2Fjwj0cbt%2F%5D%0A%0ARemindMe%21%202023-08-19%2003%3A13%3A28%20UTC) to send a PM to also be reminded and to reduce spam. ^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2015tb259) ***** |[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)| |-|-|-|-| amazing information. next time please use paragraphs 🙏🏻"
}