{
    "id": "157c1t9",
    "title": "Anyone used Rare rabbit shirts before ?",
    "url": "https://www.reddit.com/r/india/comments/157c1t9/anyone_used_rare_rabbit_shirts_before/",
    "selftext": "Never used them. How is the quality of their shirts. Getting two shirts at 50 % offer and ends today. Thinking to buy them. Apart from looks, how is their quality and are they durable.  \nThese are shirts and getting both at 3283 \n\nBlack shirt : RARE RABBIT MEN'S NEUTRONS BLACK SHIRT COTTON LYCRA FABRIC SLIM FIT FULL SLEEVE [https://thehouseofrare.com/products/neutrons-black](https://thehouseofrare.com/products/neutrons-black)\n\nGreen shirt : RARE RABBIT MEN'S AUXFO DARK GREEN SHIRT FULL SLEEVES SOLID PRINT [https://thehouseofrare.com/products/auxfo-mens-shirt-dark-green](https://thehouseofrare.com/products/auxfo-mens-shirt-dark-green)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690110468.0,
    "convurl": "https://external-preview.redd.it/UlSiGE_U9kK8ymBcOlzlAgZa06LeHLlWsESTHdibNN4.jpg?auto=webp&s=2645d6a90b26d32909f98ec1fdf20b44a8dc5431",
    "comments": [],
    "cleaned_text": "anyone used rare rabbit shirts never used quality shirts getting two shirts offer ends today thinking buy apart looks quality durable shirts getting black shirt rare rabbit mens neutrons black shirt cotton lycra fabric slim fit full sleeve httpsthehouseofrarecomproductsneutronsblackhttpsthehouseofrarecomproductsneutronsblack green shirt rare rabbit mens auxfo dark green shirt full sleeves solid print httpsthehouseofrarecomproductsauxfomensshirtdarkgreenhttpsthehouseofrarecomproductsauxfomensshirtdarkgreen ",
    "cleaned_title": "anyone used rare rabbit shirts",
    "cleaned_selftext": "never used quality shirts getting two shirts offer ends today thinking buy apart looks quality durable shirts getting black shirt rare rabbit mens neutrons black shirt cotton lycra fabric slim fit full sleeve httpsthehouseofrarecomproductsneutronsblackhttpsthehouseofrarecomproductsneutronsblack green shirt rare rabbit mens auxfo dark green shirt full sleeves solid print httpsthehouseofrarecomproductsauxfomensshirtdarkgreenhttpsthehouseofrarecomproductsauxfomensshirtdarkgreen",
    "cleaned_comments": "",
    "light_cleaned_title": "Anyone used Rare rabbit shirts before ?",
    "light_cleaned_selftext": "Never used them. How is the quality of their shirts. Getting two shirts at 50 % offer and ends today. Thinking to buy them. Apart from looks, how is their quality and are they durable. These are shirts and getting both at 3283 Black shirt : RARE RABBIT MEN'S NEUTRONS BLACK SHIRT COTTON LYCRA FABRIC SLIM FIT FULL SLEEVE [https://thehouseofrare.com/products/neutrons-black](https://thehouseofrare.com/products/neutrons-black) Green shirt : RARE RABBIT MEN'S AUXFO DARK GREEN SHIRT FULL SLEEVES SOLID PRINT [https://thehouseofrare.com/products/auxfo-mens-shirt-dark-green](https://thehouseofrare.com/products/auxfo-mens-shirt-dark-green)",
    "light_cleaned_comments": ""
}