{
    "id": "1fc7aln",
    "title": "Fraud Alert: Mango People Shop",
    "url": "https://www.reddit.com/gallery/1fc7aln",
    "selftext": "Hey everyone,\n\nI wanted to share my recent experience with Mango People Shop. I made a purchase using my credit card, but it’s been over a week, and I haven’t received any confirmation through email or WhatsApp. Initially, I waited for 2-3 days, but after no updates, I tried reaching out to their customer service.\n\nI’ve called, emailed, sent DMs on Instagram, WhatsApp, and everywhere possible, but I’ve had no response. Yet, they remain active on Instagram, posting stories regularly, which raises some red flags.\n\nAt this point, I’m starting to think this could be a fraudulent page. Has anyone had a similar experience, or any advice on how I can get my money back? Any help would be greatly appreciated!\n\nThanks in advance!",
    "flair": "Rant / Vent",
    "score": 4,
    "num_comments": 4,
    "created_utc": 1725826936.0,
    "convurl": "https://i.redd.it/yxw06agj9nnd1.jpg",
    "comments": [
        "If you put your credit card on a website looking like that, you’re on your own buddy. Dispute the charge on your card, and learn your lesson.",
        "As someone who sells stuff online, I would advise you to always speak to customer care before placing the order or read Google reviews of that brand, make sure that there is a phone number which works. If you can't do all this, then stick to Amazon.",
        "Its not fraud i have brought two plushie toys from them in the past. Some error or miscommunication perhaps",
        "Any update?"
    ],
    "cleaned_text": "fraud alert mango people shop hey everyone wanted share recent experience mango people shop made purchase using credit card week havent received confirmation email whatsapp initially waited days updates tried reaching customer service ive called emailed sent dms instagram whatsapp everywhere possible ive response yet remain active instagram posting stories regularly raises red flags point im starting think could fraudulent page anyone similar experience advice get money back help would greatly appreciated thanks advance ",
    "cleaned_title": "fraud alert mango people shop",
    "cleaned_selftext": "hey everyone wanted share recent experience mango people shop made purchase using credit card week havent received confirmation email whatsapp initially waited days updates tried reaching customer service ive called emailed sent dms instagram whatsapp everywhere possible ive response yet remain active instagram posting stories regularly raises red flags point im starting think could fraudulent page anyone similar experience advice get money back help would greatly appreciated thanks advance",
    "cleaned_comments": "put credit card website looking like youre buddy dispute charge card learn lesson someone sells stuff online would advise always speak customer care placing order read google reviews brand make sure phone number works cant stick amazon fraud brought two plushie toys past error miscommunication perhaps update",
    "light_cleaned_title": "Fraud Alert: Mango People Shop",
    "light_cleaned_selftext": "Hey everyone, I wanted to share my recent experience with Mango People Shop. I made a purchase using my credit card, but it’s been over a week, and I haven’t received any confirmation through email or WhatsApp. Initially, I waited for 2-3 days, but after no updates, I tried reaching out to their customer service. I’ve called, emailed, sent DMs on Instagram, WhatsApp, and everywhere possible, but I’ve had no response. Yet, they remain active on Instagram, posting stories regularly, which raises some red flags. At this point, I’m starting to think this could be a fraudulent page. Has anyone had a similar experience, or any advice on how I can get my money back? Any help would be greatly appreciated! Thanks in advance!",
    "light_cleaned_comments": "If you put your credit card on a website looking like that, you’re on your own buddy. Dispute the charge on your card, and learn your lesson. As someone who sells stuff online, I would advise you to always speak to customer care before placing the order or read Google reviews of that brand, make sure that there is a phone number which works. If you can't do all this, then stick to Amazon. Its not fraud i have brought two plushie toys from them in the past. Some error or miscommunication perhaps Any update?"
}