{
    "id": "11j0w0e",
    "title": "Recommend some filters for the water(Not for drinking).",
    "url": "https://www.reddit.com/r/india/comments/11j0w0e/recommend_some_filters_for_the_waternot_for/",
    "selftext": "My brother has shifted to a new flat and the tap water is really muddy there. He can't even use it for daily purposes. Can someone recommend me a good filter?  He won't be drinking it though only for shower and other purpose.\n\nThis is how the water looks\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cm97qec14yla1.png?width=550&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8b3388bec39ea7f8a4eee8da1239e1dc95c642e7",
    "flair": "AskIndia",
    "score": 4,
    "num_comments": 5,
    "created_utc": 1678032943,
    "convurl": "https://b.thumbs.redditmedia.com/hpX-qN7wuxg7bvG5Nr-7Yj12VwOWMFGpqg_Ii8kQENo.jpg",
    "comments": [
        "Can he ask someone to clean the overhead tank or something?",
        "Tank is clean. The muddy water is coming from the municipality.",
        "complaint karke dekho.. Twitter is the best way to get their attention",
        "Keep the water running and see if it gets clearer. This can happen when they clean the system."
    ],
    "cleaned_text": "recommend filters waternot drinking brother shifted new flat tap water really muddy cant even use daily purposes someone recommend good filter wont drinking though shower purpose water looks ampxb ",
    "cleaned_title": "recommend filters waternot drinking",
    "cleaned_selftext": "brother shifted new flat tap water really muddy cant even use daily purposes someone recommend good filter wont drinking though shower purpose water looks ampxb",
    "cleaned_comments": "ask someone clean overhead tank something tank clean muddy water coming municipality complaint karke dekho twitter best way get attention keep water running see gets clearer happen clean system",
    "light_cleaned_title": "Recommend some filters for the water(Not for drinking).",
    "light_cleaned_selftext": "My brother has shifted to a new flat and the tap water is really muddy there. He can't even use it for daily purposes. Can someone recommend me a good filter? He won't be drinking it though only for shower and other purpose. This is how the water looks",
    "light_cleaned_comments": "Can he ask someone to clean the overhead tank or something? Tank is clean. The muddy water is coming from the municipality. complaint karke dekho.. Twitter is the best way to get their attention Keep the water running and see if it gets clearer. This can happen when they clean the system."
}