{
    "id": "1cwdz6m",
    "title": "Teen Who Killed 2 With Porsche Got Bail In 15 Hours. Ordered To Write Essay",
    "url": "https://i.redd.it/gr4yrls6ok1d1.jpeg",
    "selftext": "This is treatment of the deceased engineers versus the son of a crorepati. One is going to be 6 feet underground while the other lives freely wherever he wills.",
    "flair": "Rant / Vent",
    "score": 3111,
    "num_comments": 252,
    "created_utc": 1716206883.0,
    "convurl": "https://i.redd.it/gr4yrls6ok1d1.jpeg",
    "comments": [
        "Is this the punishment for killing 2 people? How does writing an essay going to give justice to victim’s family? This is power of money. Police and politicians can even lick your shoes for money.",
        "Man this is  fucked up shit , pakka  Chat gpt se essay likwayega nd send his Ramu Kaka to stand with the cops .",
        "Source: https://www.ndtv.com/india-news/pune-teen-who-killed-2-people-with-porsche-got-bail-in-15-hours-5703712/amp/1?utm_campaign=fullarticle&utm_medium=referral&utm_source=inshorts",
        "Don't forget Raju kaka who will attend the counselling sessions in his place",
        "When you have money - nothing is crime",
        "dude who killed 1 and injured is a public figure with crores of fans. what'd u expect. And I'll get downvoted for saying this.",
        "This is what good lawyers can get away with",
        "When you have money, nothing is a crime and every fine is just a payment cost",
        "our lives are meant to be run over/ crushed by rich kids with their sports cars. we get hunted one by one each day. rest live to get hunted the next day.",
        "The police arranged pizza for him in jail!",
        "Who’s this? Kindly let me know atleast in DM, Curios to know",
        "Selmon bhoi ",
        "In this country, if you are rich, you are above the law",
        "The victim's family should hire someone under 18 to kill that moron's family and write an essay about it",
        "Who asked those people to stand in the way of the Porsche?\n\nIt is the same as Salman Khan, Ambani son etc... people who stand in the way of luxury cars must be put in jail. How can they do it?\n\n>! rage /s!<",
        "Juvenile justice is such a grey area. In Nirbhaya case too , one juvenile got jail for three years while adults were hanged with difference being he was 6 months too young. This is such a shady law",
        "Don't ever ever ever ever badmouth the National Bhai.",
        "Oh I know him for 🦌. But not this",
        "You must be joking..",
        "Un-Fucking believable",
        "It doesn't matter the age of criminal. \nEven if a 5 year old kills someone.. Hang them",
        "Bail conditions not punishment",
        "We are a corrupt and indisciplined people. We caused this.",
        "Wait. There’s more. There is cctv footage of him drinking with his friends some hours before. Now the blood report has no trace of alcohol.\nAh to be rich in this country!!",
        "I wanna kill some people. And write about what happens to their families later  /s",
        "Yes but there are places /auctions that call for trial as adults (specially when it can be proven to be conscious of action/implication) . Similar to a case where a teen age girl was trialed as an adult because she premeditated the incident and knew she would survive the car crash. \n\nWe need that here in this case .",
        "Accidents happen, don't be stupid. \n\nSelf defence is a thing. \n\nCases and situations vary greatly\n\nThe judgement is wrong here, he shouldn't have been off the hook so easily.",
        "salamander bhoi",
        "Honestly, I've lost all hope for justice system in this country. The rich & powerful will always win at the end of the day. Shame on the judges who gave him bail on these stupid conditions.",
        "It's not the punishment. It's clearly the condition for the bail.",
        "While I think it's very wrong, but don't act like he has been acquitted. He was granted bail under the bailable section. What's wrong was the whole thing took place on Sunday, the official government holiday.",
        "💯",
        "Are you plain stupid or pretending to be?\n\nThere is a reason why there are difference sentences for accidents and premeditated murder.",
        "Kal Tak sirf r/Pune me thee ye news, aaj r/India r/Unitedstatesofindia mein bhee aagayi, won't be surprised to see it in r/facepalm tomorrow",
        "Nirbhaya case got the law changed, can’t really use it an example of current law.",
        "Upvoted.",
        "Footpath par Milo kabhi",
        "Drinking habits? If this was driving under the influence, then this is very very concerning",
        "Bail is the norm not am exception",
        "Driving under influence while he forced his driver, who was also traveling with him, to give him the car to drive.",
        "Karma farming",
        "Indian Courts Are Joke, so a minor can do any shit or the highest crime and end up getting to write an essay about his deeds?",
        "More like he arranged Pizza for them in jail, so he get's good treatment, rich perks",
        "Bruh come on",
        "Well there wasn't a hearing that has happened yet. I'm hoping they don't damage or manipulate the evidence though. If shit goes South then I hope everyone in the state comes out and protests.",
        "Best reply so far",
        "Rules are peasants !! Why pikachu face peasants?",
        "Even if this dude was an adult, would it have made a difference? It's not like adult rich criminals face any repercussions, either.\n\nAlso, can he even legally drive as a minor? I started driving only after turning 18.",
        "R/fuckcars ",
        "Is he charged with 304A? He converted a car into a weapon with all likelihood that the act which is inherently so dangerous that in all likelihood, it'll cause death. Should've been charged with 300 IPC and tried as an adult for committing heinous offence under JJ act. This act is akin to firing a loaded canon into a crowd because is a car driven at 150+ in a single lane road not akin to a canonball which will likely take a life?",
        "Nope, it got the amendment it needed. Here too he would've been tried as an adult if he committed a heinous offence as per JJ which classifies crimes punishable with 7 years or more as heinous. I think he probably will be charged with 304A instead of 299 or 300...Therefore no trial as an adult and just a max 2 year punishment which he will probably not get considering the Probation of offenders act and JJ. \n\nP.S. All speculation, not legally sound or whatever.",
        "Long ago, the Justice system was created and controlled by the privileged to protect themselves (royalty, nobility and the wealthy) from the retribution of the non-privileged commoners and it continues to serve its intended purpose to this day. This case is a prime example of that.",
        "**\"Police and politicians can even lick your shoes for money\"**\n\n  \nHow dare you say this? The correct sentence should be \"Police and politicians can even lick your **asshole** for money\"",
        "What? why would you kill the moron's family instead of the moron himself?",
        "What you think is the solution to this problem? what incentive does the state have to go against rich people?",
        "Just read an article, the Pune Police Commissioner said that he'll be tried as an adult in the high court, here's the article : https://indianexpress.com/article/cities/pune/minor-driving-porsche-mows-down-two-9339297/#amp_tf=From%20%251%24s&aoh=17161956226405&csi=0&referrer=https%3A%2F%2Fwww.google.com&ampshare=https%3A%2F%2Findianexpress.com%2Farticle%2Fcities%2Fpune%2Fminor-driving-porsche-mows-down-two-9339297%2F",
        "He's gonna use chatgpt for sure",
        "The judge should be named and shamed and if possible suspended \n\nHe definitely is trying to save the accused, most probably after getting money from the accused",
        "He should go to jails for the minors.\n\nJust because they have money he is getting away with it.",
        "Dial 100 for express bootlicks",
        "They should be treated like adults depending on the severity of the crime. If tomorrow a juvenile goes and shoots our PM and bombs Lok sabha, would he still be considered as someone who can be reformed?",
        "😂",
        "why don't u help them hire **someone** or just posting statements here doing nothing",
        "It's part of the bigger story, after family's gone the riches will be taken by their money hungry workers, close friends and extended family. Then the accused will have no money and have to fend for himself. \nIn absence of money he won't be able to afford fuel hence no more accidental killings.",
        "India 😍",
        "You're right. I was angry when i wrote that",
        "Can we place a bet here about how many days it takes for the guy to leave the country and the law just watches?",
        "I am gonna say, about 3 weeks from now on.",
        "Precedent set hogya hai guys.\n\nAb aap bhi kisi ko car se thok kar is case ko as a precedent use kar sakte ho😌\n\nExperience lawyers correct me if i am wrong?",
        "given on Sunday ;)",
        "Track the same news in a week or even a month. \n\nSab khatam",
        "Tell me that's not true 🙂",
        "Did you think he killed a buck on the footpath?",
        "Accident Porsche se nahi truck se hua tha.... Next Salman Khan in making",
        "I’m sure some policeman would’ve written the essay for him as well for extra 500 bucks! Pathetic!",
        "Next thing we are going to learn in the proceedings is that he is mentally unstable.",
        "डॉक्टरांनी त्याने दारू पिली नाही असे certificate दिले\nन्यायाधीशाने त्याला निबंध लिहिणे पोलिसांबरोबर 15 दिवस ट्रॅफिक कंट्रोल करणे आणि डॉक्टरकडून सल्ला घेणे या शिक्षा दिल्यात\nरविवारी कोणालाच bail मिळत नाही पण याच्यासाठी रविवरी कोर्ट ने bail ऑर्डर दिली\nपोलिसांनी त्यांच्यावर कमी कलमे लावली\nपोलसानी त्यांना आणि त्यांच्या मित्रांना पिझ्झा आणि burger आणून दिले\nकुठल्याही पत्रकाराने त्यांची नावे पहिल्यांदा प्रसिद्ध केली नव्हती..\nएकही.. एकही राजकीय पक्षाच्या नेत्यांना या विषयी एकही शब्द बोलला नाहीये अजून पर्यंत..\n\nआपली व्यवस्था पूर्णपणे सडलेली आहे.. न्यायव्यवस्था, पत्रकर, पोलीस, राजकारणी...सर्व सर्व.. पैसे टाका सगळे नागडं व्यायला आणि झोपायला तयार आहे..एका बिल्डरने सर्वांना नागडं केलंय.. हे कुठल्याही पक्षासाठी नाही सर्व पक्ष सारखेच..",
        "Here the crying part is he was declared juvenile based upon the school TC and all now how the BOb is managed in the education system in Uttar Pradesh. Irony is as per media reports that ba***rd did the maximum cruelty and he is still roaming free !!!",
        "The father should go to jail if the son is too young.  Especially if the father gave him the car. ",
        "I guess he won't be doing that either... Chat jee peetee will be!",
        "Why are you surprised ?",
        "Something something constitution. Something something equality 😂\n\nA barbaric society with few barbarians who are literate. That’s India.",
        "Reports suggest the father was made aware that the son was under influence and wanted to drive the car (there was a driver with them) and he gave the go ahead.",
        "Only if his father is multi millionaire.",
        "He still will be tried tho.",
        "If u have money and connections u can get away with anything anywhere in world..! They will probably settle with the victims family outside court now and their son soon will go to some European nation for future studies..!",
        "Milord after getting that maal in his account",
        "Is this in India fr? I knew justice system was messed up but this? What will writing essay even do?",
        "If this goes in favour of the accused in today's age of Social media, then we are watching too much of \"Gulabi Sadi\" and \" mummy kaisi hai roasts\". Lets stir a storm over this.",
        "Crushed under illegal hoardings, drowned beneath illegal bridges, choked by illegal pollutants and poisoned by illegal pesticides and chemicals.",
        "Help him practice essay writing for college admission in Europe colleges /s",
        "Isn’t that the case in every country?",
        "I hope he never has a normal life again",
        "Minor? Who tf let them drive ? that too a Porsche??     Didn’t they say if a minor drives the vehicle’s owner will be punished harshly? What happened to that ? Y aren’t their parents punished either?",
        "Yeah saw this on news today. Very bad.",
        "Yeah saw this on news today. Very bad.",
        "Yeah, saw this on news today. Very bad.",
        "BC this is so enraging. All these mfs are sold out. You can't expect to get justice even in such a grave situation. 2 PEOPLE DIED FFS. AND THERE'S A LITERALLY CCTV FOOTAGE OF HIM DRINKING.\n\nRemember how everyone sort of cringe when they hear _systumm_ ... Well that wasn't far from being factual. You do get hold \"system\" when you're rich enough.",
        "Ye galat hai. Ok, he is a minor, who has gone astray, but that doesn't mean that you will let him go. \nCompensation to aggrieved and at least 6 months of juvenile detention alongside/seperate mandatory, court approved or issued rehabilitation. So, they can either get him rehabilitated when he is serving his time in detention, or he does it after he serves his time. This way the parents won't be able to elude rehabilitation for their son\n\nFollowed by 180 hrs of annual social service for 2 years. \n\nChange of school or college\n\nMeeting  and apology to the family of the aggrieved at the end 2 year service.\n\nHe will be forced to carry the guilt of killing someone for almost 3 years. This way he would even be able to lead a better life in the future and ever redeem from his vain life and crime.",
        "Happy cake day!",
        "India is the country with the widest income disparity anywhere in the world. So even if it is the case in every country, it is the worst in India.",
        "We should really learn from Vietnam.",
        "LOL!\nHe is probably on a flight out of the country by now.\nJustice system in this country is a joke.",
        "So much clownery in 4 lines huh.",
        "Salman bhai ka bachpan",
        "🥳🥳",
        "The people were a teen couple from the looks of it",
        "Don't make facts on the go to support your narrative, as much as I agree that there's inequality in India, India is not even in the [top 100!](https://en.m.wikipedia.org/wiki/List_of_countries_by_income_equality)",
        "The system is built on money… what’s to be expected? \n\nIn the ME for such a crime your person has to pay money to tie families of the deceased and/or spend time in prison…",
        "What’s your point?",
        "It wouldn't be surprising if he used chatgpt to write his essay",
        "I don't where wikipedia got it's data from but India is definitely one of the most unequal country barring some African countries.\nPikkety and his team has done a great job in researching it.\n\nhttps://wid.world/country/india/",
        ">In almost every ~~this~~ country, if you are rich, you are above the law.",
        "Only work if your daddy have money",
        "Selmon's chatu fans be like -- selmon bhoi ko kuchh nai bolne ka..pawpaw he hamare..",
        "Is even the opposition parties raising this topic?",
        "It says there in the table, the GINI data is from the World Bank. GINI is a more comprehensive metric btw used to measure income inequality. The link you shared measures the inequality in terms of the relative percentage of wealth of top x%, which is less comprehensive but cool metric nonetheless. And a high value of India is indicative of top x% having a disproportionately high share of wealth, but on an overall level, India is not that high on the list of inequality!",
        "But bhoi to itna sara philanthropy and charity krte h.",
        "Ameero ke liye alag kanoon aur middle class aur gareebo ke liye alag kanoon 😶",
        "No, some places actually have rule of law",
        "Make it 500 words and don’t even think of chat GPT.",
        "Shameful. It's a disgrace.",
        "[https://youtube.com/shorts/uhPzfae2N4A?feature=shared](https://youtube.com/shorts/uhPzfae2N4A?feature=shared)",
        "umm precedents are the statements and judgements from a court of record, i.e. the supreme court and high courts. This is a subordinate court bail order, definitely not a precedent.",
        "Just imagine what that teen will learn out of this whole experience. Nothing which will make him a good man in the future ",
        "Nobody is downvoting you for this man.",
        "If I would be at his place, they would have arrested me for not being able to write the essay",
        "Blind PPL huh",
        "It’s not a punishment enough but it’s a precedent headed to the right direction. The judiciary should be a criminal reform system rather than a criminal punishment system. However, I’m afraid that this will only act as precedence for the wealthy and powerful but not the financially disadvantaged.",
        "That's min life sentence to parents ,if upper 16 kid too",
        "Now no mf will take action against this .....",
        "I understand that the kid is juvenile,so why aren't the parents punished in this case ?",
        "At this point i doubt if he is even 17. Probably avoiding being 18 and getting prosecuted like an adult",
        "What!!",
        "What! No, it isn’t.",
        "I want this mf in jail, the treatment he is getting MLA, Judge even police everyone is doing work in his favour",
        "This happened in Brazil as well. Though I don’t even think he had to write an essay or go to treatment.",
        "Atleast 100 pieces of the killer and then dipped in acid and salt and left on roads as a symbol of justice.",
        "> is just a payment cost\n\nExcuse me sir, this one is an essay which will probably be written by a robot butler.",
        "Behnchod ye kya justice hai, the girl who died was my senior in school and I have seen how great she was in all the fields and yet fate has something else for her but this treatment given to that kid is something which sets wrong precedent and he should be charged as an adult, that fucker broke so many rules (was drunk and driving while just 17.5 years in age) and still got out with a punishment less that we get in schools.\n\nAfter killing 2 people the punishment he gets is to work with traffic police for 15 days and write an essay on road accidents like wtf.\n\nMiddle class aadmi keeda hai kya bc, jisko lage kuchal k bina consequences k nikal jaye.\n\nFuck this judicial system.",
        "essay   \nno words   \nwhat we can do is stand together and pressure authorities to take action against him to make sure he will be jailed",
        "Lauda guilty he will feel. People should have killed him after the accident, don't know how many more people he will kill.",
        "May he live a horrible shitty life.",
        "Wow, and I had to write essays to get 5 marks...",
        "This is the time I support mob justice",
        "I understand that it's only a bail he still has to appear in court but, writing an essay seems really out of touch. The judge should be fired.",
        "I don't think this would have gone that well for this piece of shit in any other country except India where money / status is treated above human life.",
        "Oh yeah mentally unstable guy driving a freaking porsche! as ridiculous as that sounds I feel like that would be the angle they would go for and it would work",
        "Take my vote",
        "We habe poverty so people like police and other officials got ome benifit",
        "sometimes it's like, does the judicial system have flaws and loopholes to exit from such crimes?",
        "The degree to which you are is likely different. I think you can get away with much more serious and egregious shenanigans, read crimes, here with not much of a repercussion.",
        "Essay? What?",
        "Who’s the 17 yr old guy?",
        "Ahh, would like to slqy some people in a typical manner! WOULD LIKE TO KNOW THE FORMULA,,,",
        "wtf",
        "Even Pune police trying to take custody of the child\nBut there is court judge don't give them permission",
        "Party donations for the folks running the state machinery. \n\nAnd here we have folks defending crony capitalism, as if being filthy rich isn't a bad thing :)",
        "Is it the wrong time to ask for some vigilantism justice?!",
        "Saw his crashed car on instagram. Car stopped by the pavement. Left front bumper and headlight were caved in. 2  men got furious and started smashing his windows with rocks, pretty big ones.",
        "That damn modi.",
        "the guy on his essay: i was testing the drs system on my new gt3rs or i was trying to listen to the sounds of the beautiful v10 that i wasn't paying focus on the road. porsche should be accountable.",
        "Didn’t this happen in Karnataka?  Not surprised..\nRich politically connect folks live like we’re in a feudal area. Guys just rape and tape hundreds of women and then run to foreign countries. The average motorist on the street doesn’t follow any rules, you’ll bet one of those feudal lordlings won’t bother either. The people of Karnataka get what we deserve. We love to live in the Stone Age, we get Stone age government.",
        "Are you from Maharashtra??",
        "Essay bhi internet se chaapega yeh",
        "What happened to mob mentality?",
        "Taxes and laws screws the middle class while the rich folks can do whatever they want and be worry free.",
        "Savlon bhoi: kills 99.99% pedestrians",
        "Believe me or not, his taxes are gonna fund way more people than he killed. Running his future won't be a good decision",
        "We are officially a Banana republic. From rich kids broadcasting their marriages and elephant safaris and private airforce airfields to killing people openly.\n\nWhen are people going to wake up",
        "Bail is a matter of right. Yes, even for non bailable crimes. Non bailable just means you don't get by default, a judge has to give you bail. But in normal circumstances, if there's no risk of fleeing, intimidating witnesses etc, bail is given as a general rule. The reason why Kejriwal for example was not getting bail is because he was charged under a special act 'PMLA' which makes bail law much more stricter and you essentially have to prove your innocence to a degree to get bail. These special acts such as UAPA result in a lot of people spending time in jail for years and years without any trial. \n\nAs shitty as you find it, that kid got bail rightfully. As a general rule, people should not be in jails without a trial when we cannot say they are guilty or not guilty. The state doesn't get to just file a case and send someone to jail without any adjudication. Remember, the basic principle of criminal law is (and for a very good reason) innocent until proven guilty. It doesn't matter whether it looks like someone is obviously guilty to you.",
        "India h , chalta h.",
        "Nothing wrong with getting bail for manslaughter,  but everything else surrounding this case is trash.",
        "Affluenza",
        "What if some other minor hits him and he dies? Will the other kid should also write an essay, especially if he's from middle class background?",
        "The courts are the most corrupt institutions of India, no wonder Kejriwal was set free like this",
        "If you have money, no law can stop you. Gets prison with amenities.",
        "ofc my friends modi hai to mumkin hai.",
        "nop. i upvote u sir and i salute you.",
        "I hope we don't just move on from this incident and forget all this after a week. WE NEED JUSTICE PEOPLE! WE NEED A CHANGE IN THE SYSTEM. THIS SHOULD NOT BE TOLERATED. WE NEED TO ACTUALLY DO SOMETHING ABOUT IT.",
        "Rich builder's darling son literally gets away with murder.Drunk driving in an unregistered luxury car but saved by the fact that technically he is a minor as he is 17.",
        "We are owned by rich",
        "Indian judiciary is of the Richest, For the Richest & By the Richest! 💸",
        "I sometimes want to hire some you know who to take care of these folks.",
        "They can't juvenile law ui aisa hai 😢. Parliament must act on this. Judges can give punishment and judgements on the basis of existing laws.",
        "At this point, I am not even surprised by anything stupid which happens in our country. The judicial system has gone for a toss, seriously. People committing smaller crimes face paying heavy penalties or even jailtime whereas this clown has got a bail, like wtf man.",
        "GINI like many other metrics tries to put multi dimensional data into one number. This most of the time results in misleading story and idea. Maybe it captures some truth when viewed at one angle but it almost certainly never gives the full picture.\n\nTo get the whole picture there is no substitute other than reading the finer details.  \nAnd Piketty does a great job in explaining how they get the data, process it and get the result.\n\n[WorldInequalityLab\\_WP2024\\_09\\_Income-and-Wealth-Inequality-in-India-1922-2023\\_Final.pdf (wid.world)](https://wid.world/wp-content/uploads/2024/03/WorldInequalityLab_WP2024_09_Income-and-Wealth-Inequality-in-India-1922-2023_Final.pdf)",
        "Nope, hyd. Why tho?",
        "Unless it is SA. If you are a threat to the king, bonesaw will find you.",
        "in India there are \\~150k people die in road accidents each year. understand that nobody wants to kill someone intentionally hence the crime is bailable. also you can not keep all these people in jail since we do not have capacity. understand the law is good, but not the system who's implementing it. also getting bail doesn't mean he's free. criminal proceedings will follow. do not get angry over such posts. post like these make one ignore rationality. \n\nHave faith, KARMA IS BIYAACH !!",
        "Sharukh's son's incident and law changed.",
        "due to the heinous nature of the crime, there is a basis for him to be tried as an adult",
        "Hahaha is this some kind of joke? Is this how justice is made? Sounds like they're giving punishment to a school kid. How can an essay help with justice? Is he gonna get extra marks for this and later get included in his finals? And what the shit about this guy working with a traffic police for 15 days? Community services since when? He should never be given the licence to drive anything at all.",
        "So just become like him to punish him! Kaha ka justice hai ye bhai?",
        "wtf, what is this happening? agar Porsche 911 hai toh koi baat nahi",
        "There's no justice for the poor and middle class in this country. If you have the resources, please leave this godforsaken country at once. Even if we try to change things here, we'll end up getting killed like hundreds of honest people who chose to question the system.",
        "I think reduce age to 14 would be an good option",
        "Paise ka power dikhate hai madar jhaat 🤬",
        "15 year olds should NOT vote.",
        "This is involuntary manslaughter.",
        "KRK Bola ki usko cheeni ki bimari hai isilye kii gf nahi hai",
        "I'm talking about juvenile age law",
        "Paisa hai toh...Sab Farzi",
        "He's probably going to ask ChatGPT to write an eassy.",
        "what do think is the limit? what counts as being filthy rich?",
        "in my days i had to write an apology letter 5 times for going out of the class when a teacher called me in between the class and the reason was that i didnt take the outpass",
        "na bro u r getting upvoted",
        "i believe some offences require the juveniles to be punished as adults and the age for the juvenile jurisdiction should be decreased as well",
        "well, in that case his parents should be hanged if he is given a porsche to drive despite being mentally unstable",
        "Has the footage been shown somewhere?",
        "Bridge collapse hundreds of people gets died.\nPr Galti bridge pr ghumne walo ki thi kyuki paw paw ki government thi na paw paw.",
        "C'mon Pune. Today it is some random person who lost their life. Tomorrow it could be you, your loved ones. I know it is easy said that done. But we need someone to set an example.",
        "Pawpaw, but no MawMaw. poor single PawPaw...",
        "Correction, police and politicians can set up a tent in your bumhole for money.",
        "we need a Dexter figure for real.",
        "\"Money doesn't buy happiness \" money bought this fucker an essay and a bail tho.",
        "Oh yeah, I will talk to my brother.",
        "Now this is some real life motivation to work hard and become crorepati 🔥",
        "My immediate thought was that he is going to be lynched by a mob the moment he is seen outside. Sad to see our justice system fail this way.",
        "Nothing new that happens in India. Money is power and if you have money, you control the power.",
        "this tbh.....",
        "How can 2 lives be equivalent to a 300 worded essay?\nI mean wtf.",
        "❤️‍🩹🥹🤦‍♀️ I am leaving India now. \nI will return only when I have enough money to change the “system”.",
        "Time to kill him and leave an essay with his body, no need for the cops to go through the trouble at all.",
        "We need a few names:\n\nMLA of the location \nMP of the location \nName of the judge \nName of the accused\nName of the investigation police officer \nName of the SHO\n\nIt's very simple, he was driving the car, his dad owned the car, he was drunk, he killed two people.\n\nTrial must be broadcast online live...",
        "ChatGpt ftw",
        "its an inevitable rule of society even if the officers aren't corrupt. The rich will always get relief, even in the worlds harshest of constitutions there similar cases there is only one cure to this, get yourselves involved in the system and <BE RICH>",
        "Reptile 🦎",
        "Well let's not forget that Salman Khan is still happily and freely living his life",
        "Yeah if this guy killed any one of my family members and gets bail then i would have slit his throat open suck the air out of his lungs and blow it on his dads face",
        "RemindMe ! 3 weeks",
        "Wahh Indian judiciary!! 👏 👏 👏",
        "heh? wdym 💀",
        "What a stupid joke!!! Writing essay for killing? They are just trying to fool the public into thinking they are rehabilitating him.",
        "Don't be surprised if anything happens",
        "What about the great constitution written by the great Ambedkar!",
        "Incredible india 💯",
        "Police men believe appeasing sons of mega rich fathers will get them favors in return. It’s how society works, once they form a relationship with this man they can also share in the wealth and methods by which he gained his wealth. Sad 😢 but true.",
        "150 words per death...",
        "To have enough money to afford enough donation to buy folks with power. It's difficult to put an exact number to this \"limit\". Depends on the place.\n\nFor example: someone in a village can give a bribe of 5lac to the panchayat pradhan to get favors. Similarly, in a biggger city like Pune, this sum may easily go upto crores at the bare minimum.",
        "What type of nonsense is going on",
        "Someone  write an essay, get in your car. And go for the judge.",
        "What",
        "Baap ko pelo",
        "Undergo treatment for his drinking habit? He shouldn't even be drinking alcohol or be able to drive a car in the first place. Heard that he and his friends spent around ₹48k at the first bar before killing the youngsters.",
        "I saw this today\n\nhttps://x.com/That_Pune_Guy/status/1793306658397094392",
        "bru then how is he not in jail tf",
        ">Is this the punishment for killing 2 people? \n\nI don't think so. He is on bail so it's not the last we are hearing of him.",
        "Actually this is actually a good thing. If its found that he was not under the influence of alcohol that means he was in his complete senses when commiting the crime.\nThats actually going to against the minor and he will be tried as an adult.",
        "I want to read that essay.. Make it public.",
        "Requesting everyone to reshare this. They should not get away with it.",
        "Naah it's in India and some Asian country only.",
        "its not late , that he  will rape a girl and escape  court by paying bribe \n\n  \nbecause he knows law cant do shit about him and rich people \n\n  \nwe should fill him with fear that , law is same for everyone , this is new india , not times like salman khan",
        "Please tell me this guy is in jail. Atleast as if 18 June 2024",
        "Sadly you're right",
        "Given the character, he would not care to write his own essay.",
        "There is no justice there is only power - Michael foccault"
    ],
    "cleaned_text": "teen killed porsche got bail hours ordered write essay treatment deceased engineers versus son crorepati one going feet underground lives freely wherever wills ",
    "cleaned_title": "teen killed porsche got bail hours ordered write essay",
    "cleaned_selftext": "treatment deceased engineers versus son crorepati one going feet underground lives freely wherever wills",
    "cleaned_comments": "punishment killing people writing essay going give justice victims family power money police politicians even lick shoes money man fucked shit pakka chat gpt se essay likwayega nd send ramu kaka stand cops source dont forget raju kaka attend counselling sessions place money nothing crime dude killed injured public figure crores fans whatd u expect ill get downvoted saying good lawyers get away money nothing crime every fine payment cost lives meant run crushed rich kids sports cars get hunted one one day rest live get hunted next day police arranged pizza jail whos kindly let know atleast dm curios know selmon bhoi country rich law victims family hire someone kill morons family write essay asked people stand way porsche salman khan ambani son etc people stand way luxury cars must put jail rage juvenile justice grey area nirbhaya case one juvenile got jail three years adults hanged difference months young shady law dont ever ever ever ever badmouth national bhai oh know must joking unfucking believable doesnt matter age criminal even year old kills someone hang bail conditions punishment corrupt indisciplined people caused wait theres cctv footage drinking friends hours blood report trace alcohol ah rich country wan na kill people write happens families later yes places auctions call trial adults specially proven conscious actionimplication similar case teen age girl trialed adult premeditated incident knew would survive car crash need case accidents happen dont stupid self defence thing cases situations vary greatly judgement wrong shouldnt hook easily salamander bhoi honestly ive lost hope justice system country rich powerful always win end day shame judges gave bail stupid conditions punishment clearly condition bail think wrong dont act like acquitted granted bail bailable section whats wrong whole thing took place sunday official government holiday plain stupid pretending reason difference sentences accidents premeditated murder kal tak sirf rpune thee ye news aaj rindia runitedstatesofindia mein bhee aagayi wont surprised see rfacepalm tomorrow nirbhaya case got law changed cant really use example current law upvoted footpath par milo kabhi drinking habits driving influence concerning bail norm exception driving influence forced driver also traveling give car drive karma farming indian courts joke minor shit highest crime end getting write essay deeds like arranged pizza jail gets good treatment rich perks bruh come well wasnt hearing happened yet im hoping dont damage manipulate evidence though shit goes south hope everyone state comes protests best reply far rules peasants pikachu face peasants even dude adult would made difference like adult rich criminals face repercussions either also even legally drive minor started driving turning rfuckcars charged converted car weapon likelihood act inherently dangerous likelihood itll cause death shouldve charged ipc tried adult committing heinous offence jj act act akin firing loaded canon crowd car driven single lane road akin canonball likely take life nope got amendment needed wouldve tried adult committed heinous offence per jj classifies crimes punishable years heinous think probably charged instead therefore trial adult max year punishment probably get considering probation offenders act jj ps speculation legally sound whatever long ago justice system created controlled privileged protect royalty nobility wealthy retribution nonprivileged commoners continues serve intended purpose day case prime example police politicians even lick shoes money dare say correct sentence police politicians even lick asshole money would kill morons family instead moron think solution problem incentive state go rich people read article pune police commissioner said hell tried adult high court heres article hes gon na use chatgpt sure judge named shamed possible suspended definitely trying save accused probably getting money accused go jails minors money getting away dial express bootlicks treated like adults depending severity crime tomorrow juvenile goes shoots pm bombs lok sabha would still considered someone reformed dont u help hire someone posting statements nothing part bigger story familys gone riches taken money hungry workers close friends extended family accused money fend absence money wont able afford fuel hence accidental killings india youre right angry wrote place bet many days takes guy leave country law watches gon na say weeks precedent set hogya hai guys ab aap bhi kisi ko car se thok kar case ko precedent use kar sakte ho experience lawyers correct wrong given sunday track news week even month sab khatam tell thats true think killed buck footpath accident porsche se nahi truck se hua tha next salman khan making im sure policeman wouldve written essay well extra bucks pathetic next thing going learn proceedings mentally unstable certificate bail bail burger crying part declared juvenile based upon school tc bob managed education system uttar pradesh irony per media reports bard maximum cruelty still roaming free father go jail son young especially father gave car guess wont either chat jee peetee surprised something something constitution something something equality barbaric society barbarians literate thats india reports suggest father made aware son influence wanted drive car driver gave go ahead father multi millionaire still tried tho u money connections u get away anything anywhere world probably settle victims family outside court son soon go european nation future studies milord getting maal account india fr knew justice system messed writing essay even goes favour accused todays age social media watching much gulabi sadi mummy kaisi hai roasts lets stir storm crushed illegal hoardings drowned beneath illegal bridges choked illegal pollutants poisoned illegal pesticides chemicals help practice essay writing college admission europe colleges isnt case every country hope never normal life minor tf let drive porsche didnt say minor drives vehicles owner punished harshly happened arent parents punished either yeah saw news today bad yeah saw news today bad yeah saw news today bad bc enraging mfs sold cant expect get justice even grave situation people died ffs theres literally cctv footage drinking remember everyone sort cringe hear systumm well wasnt far factual get hold system youre rich enough ye galat hai ok minor gone astray doesnt mean let go compensation aggrieved least months juvenile detention alongsideseperate mandatory court approved issued rehabilitation either get rehabilitated serving time detention serves time way parents wont able elude rehabilitation son followed hrs annual social service years change school college meeting apology family aggrieved end year service forced carry guilt killing someone almost years way would even able lead better life future ever redeem vain life crime happy cake day india country widest income disparity anywhere world even case every country worst india really learn vietnam lol probably flight country justice system country joke much clownery lines huh salman bhai ka bachpan people teen couple looks dont make facts go support narrative much agree theres inequality india india even top httpsenmwikipediaorgwikilistofcountriesbyincomeequality system built money whats expected crime person pay money tie families deceased andor spend time prison whats point wouldnt surprising used chatgpt write essay dont wikipedia got data india definitely one unequal country barring african countries pikkety team done great job researching almost every country rich law work daddy money selmons chatu fans like selmon bhoi ko kuchh nai bolne kapawpaw hamare even opposition parties raising topic says table gini data world bank gini comprehensive metric btw used measure income inequality link shared measures inequality terms relative percentage wealth top x less comprehensive cool metric nonetheless high value india indicative top x disproportionately high share wealth overall level india high list inequality bhoi itna sara philanthropy charity krte h ameero ke liye alag kanoon aur middle class aur gareebo ke liye alag kanoon places actually rule law make words dont even think chat gpt shameful disgrace httpsyoutubecomshortsuhpzfaenafeaturesharedhttpsyoutubecomshortsuhpzfaenafeatureshared umm precedents statements judgements court record ie supreme court high courts subordinate court bail order definitely precedent imagine teen learn whole experience nothing make good man future nobody downvoting man would place would arrested able write essay blind ppl huh punishment enough precedent headed right direction judiciary criminal reform system rather criminal punishment system however im afraid act precedence wealthy powerful financially disadvantaged thats min life sentence parents upper kid mf take action understand kid juvenileso arent parents punished case point doubt even probably avoiding getting prosecuted like adult isnt want mf jail treatment getting mla judge even police everyone work favour happened brazil well though dont even think write essay go treatment atleast pieces killer dipped acid salt left roads symbol justice payment cost excuse sir one essay probably written robot butler behnchod ye kya justice hai girl died senior school seen great fields yet fate something else treatment given kid something sets wrong precedent charged adult fucker broke many rules drunk driving years age still got punishment less get schools killing people punishment gets work traffic police days write essay road accidents like wtf middle class aadmi keeda hai kya bc jisko lage kuchal k bina consequences k nikal jaye fuck judicial system essay words stand together pressure authorities take action make sure jailed lauda guilty feel people killed accident dont know many people kill may live horrible shitty life wow write essays get marks time support mob justice understand bail still appear court writing essay seems really touch judge fired dont think would gone well piece shit country except india money status treated human life oh yeah mentally unstable guy driving freaking porsche ridiculous sounds feel like would angle would go would work take vote habe poverty people like police officials got ome benifit sometimes like judicial system flaws loopholes exit crimes degree likely different think get away much serious egregious shenanigans read crimes much repercussion essay whos yr old guy ahh would like slqy people typical manner would like know formula wtf even pune police trying take custody child court judge dont give permission party donations folks running state machinery folks defending crony capitalism filthy rich isnt bad thing wrong time ask vigilantism justice saw crashed car instagram car stopped pavement left front bumper headlight caved men got furious started smashing windows rocks pretty big ones damn modi guy essay testing drs system new gtrs trying listen sounds beautiful v wasnt paying focus road porsche accountable didnt happen karnataka surprised rich politically connect folks live like feudal area guys rape tape hundreds women run foreign countries average motorist street doesnt follow rules youll bet one feudal lordlings wont bother either people karnataka get deserve love live stone age get stone age government maharashtra essay bhi internet se chaapega yeh happened mob mentality taxes laws screws middle class rich folks whatever want worry free savlon bhoi kills pedestrians believe taxes gon na fund way people killed running future wont good decision officially banana republic rich kids broadcasting marriages elephant safaris private airforce airfields killing people openly people going wake bail matter right yes even non bailable crimes non bailable means dont get default judge give bail normal circumstances theres risk fleeing intimidating witnesses etc bail given general rule reason kejriwal example getting bail charged special act pmla makes bail law much stricter essentially prove innocence degree get bail special acts uapa result lot people spending time jail years years without trial shitty find kid got bail rightfully general rule people jails without trial say guilty guilty state doesnt get file case send someone jail without adjudication remember basic principle criminal law good reason innocent proven guilty doesnt matter whether looks like someone obviously guilty india h chalta h nothing wrong getting bail manslaughter everything else surrounding case trash affluenza minor hits dies kid also write essay especially hes middle class background courts corrupt institutions india wonder kejriwal set free like money law stop gets prison amenities ofc friends modi hai mumkin hai nop upvote u sir salute hope dont move incident forget week need justice people need change system tolerated need actually something rich builders darling son literally gets away murderdrunk driving unregistered luxury car saved fact technically minor owned rich indian judiciary richest richest richest sometimes want hire know take care folks cant juvenile law ui aisa hai parliament must act judges give punishment judgements basis existing laws point even surprised anything stupid happens country judicial system gone toss seriously people committing smaller crimes face paying heavy penalties even jailtime whereas clown got bail like wtf man gini like many metrics tries put multi dimensional data one number time results misleading story idea maybe captures truth viewed one angle almost certainly never gives full picture get whole picture substitute reading finer details piketty great job explaining get data process get result worldinequalitylabwpincomeandwealthinequalityinindiafinalpdf widworldhttpswidworldwpcontentuploadsworldinequalitylabwpincomeandwealthinequalityinindiafinalpdf nope hyd tho unless sa threat king bonesaw find india k people die road accidents year understand nobody wants kill someone intentionally hence crime bailable also keep people jail since capacity understand law good system whos implementing also getting bail doesnt mean hes free criminal proceedings follow get angry posts post like make one ignore rationality faith karma biyaach sharukhs sons incident law changed due heinous nature crime basis tried adult hahaha kind joke justice made sounds like theyre giving punishment school kid essay help justice gon na get extra marks later get included finals shit guy working traffic police days community services since never given licence drive anything become like punish kaha ka justice hai ye bhai wtf happening agar porsche hai toh koi baat nahi theres justice poor middle class country resources please leave godforsaken country even try change things well end getting killed like hundreds honest people chose question system think reduce age would good option paise ka power dikhate hai madar jhaat year olds vote involuntary manslaughter krk bola ki usko cheeni ki bimari hai isilye kii gf nahi hai im talking juvenile age law paisa hai tohsab farzi hes probably going ask chatgpt write eassy think limit counts filthy rich days write apology letter times going class teacher called class reason didnt take outpass na bro u r getting upvoted believe offences require juveniles punished adults age juvenile jurisdiction decreased well well case parents hanged given porsche drive despite mentally unstable footage shown somewhere bridge collapse hundreds people gets died pr galti bridge pr ghumne walo ki thi kyuki paw paw ki government thi na paw paw cmon pune today random person lost life tomorrow could loved ones know easy said done need someone set example pawpaw mawmaw poor single pawpaw correction police politicians set tent bumhole money need dexter figure real money doesnt buy happiness money bought fucker essay bail tho oh yeah talk brother real life motivation work hard become crorepati immediate thought going lynched mob moment seen outside sad see justice system fail way nothing new happens india money power money control power tbh lives equivalent worded essay mean wtf leaving india return enough money change system time kill leave essay body need cops go trouble need names mla location mp location name judge name accused name investigation police officer name sho simple driving car dad owned car drunk killed two people trial must broadcast online live chatgpt ftw inevitable rule society even officers arent corrupt rich always get relief even worlds harshest constitutions similar cases one cure get involved system rich reptile well lets forget salman khan still happily freely living life yeah guy killed one family members gets bail would slit throat open suck air lungs blow dads face remindme weeks wahh indian judiciary heh wdym stupid joke writing essay killing trying fool public thinking rehabilitating dont surprised anything happens great constitution written great ambedkar incredible india police men believe appeasing sons mega rich fathers get favors return society works form relationship man also share wealth methods gained wealth sad true words per death enough money afford enough donation buy folks power difficult put exact number limit depends place example someone village give bribe lac panchayat pradhan get favors similarly biggger city like pune sum may easily go upto crores bare minimum type nonsense going someone write essay get car go judge baap ko pelo undergo treatment drinking habit shouldnt even drinking alcohol able drive car first place heard friends spent around k first bar killing youngsters saw today bru jail tf punishment killing people dont think bail last hearing actually actually good thing found influence alcohol means complete senses commiting crime thats actually going minor tried adult want read essay make public requesting everyone reshare get away naah india asian country late rape girl escape court paying bribe knows law cant shit rich people fill fear law everyone new india times like salman khan please tell guy jail atleast june sadly youre right given character would care write essay justice power michael foccault",
    "light_cleaned_title": "Teen Who Killed 2 With Porsche Got Bail In 15 Hours. Ordered To Write Essay",
    "light_cleaned_selftext": "This is treatment of the deceased engineers versus the son of a crorepati. One is going to be 6 feet underground while the other lives freely wherever he wills.",
    "light_cleaned_comments": "Is this the punishment for killing 2 people? How does writing an essay going to give justice to victim’s family? This is power of money. Police and politicians can even lick your shoes for money. Man this is fucked up shit , pakka Chat gpt se essay likwayega nd send his Ramu Kaka to stand with the cops . Source: Don't forget Raju kaka who will attend the counselling sessions in his place When you have money - nothing is crime dude who killed 1 and injured is a public figure with crores of fans. what'd u expect. And I'll get downvoted for saying this. This is what good lawyers can get away with When you have money, nothing is a crime and every fine is just a payment cost our lives are meant to be run over/ crushed by rich kids with their sports cars. we get hunted one by one each day. rest live to get hunted the next day. The police arranged pizza for him in jail! Who’s this? Kindly let me know atleast in DM, Curios to know Selmon bhoi In this country, if you are rich, you are above the law The victim's family should hire someone under 18 to kill that moron's family and write an essay about it Who asked those people to stand in the way of the Porsche? It is the same as Salman Khan, Ambani son etc... people who stand in the way of luxury cars must be put in jail. How can they do it? >! rage /s!< Juvenile justice is such a grey area. In Nirbhaya case too , one juvenile got jail for three years while adults were hanged with difference being he was 6 months too young. This is such a shady law Don't ever ever ever ever badmouth the National Bhai. Oh I know him for 🦌. But not this You must be joking.. Un-Fucking believable It doesn't matter the age of criminal. Even if a 5 year old kills someone.. Hang them Bail conditions not punishment We are a corrupt and indisciplined people. We caused this. Wait. There’s more. There is cctv footage of him drinking with his friends some hours before. Now the blood report has no trace of alcohol. Ah to be rich in this country!! I wanna kill some people. And write about what happens to their families later /s Yes but there are places /auctions that call for trial as adults (specially when it can be proven to be conscious of action/implication) . Similar to a case where a teen age girl was trialed as an adult because she premeditated the incident and knew she would survive the car crash. We need that here in this case . Accidents happen, don't be stupid. Self defence is a thing. Cases and situations vary greatly The judgement is wrong here, he shouldn't have been off the hook so easily. salamander bhoi Honestly, I've lost all hope for justice system in this country. The rich & powerful will always win at the end of the day. Shame on the judges who gave him bail on these stupid conditions. It's not the punishment. It's clearly the condition for the bail. While I think it's very wrong, but don't act like he has been acquitted. He was granted bail under the bailable section. What's wrong was the whole thing took place on Sunday, the official government holiday. 💯 Are you plain stupid or pretending to be? There is a reason why there are difference sentences for accidents and premeditated murder. Kal Tak sirf r/Pune me thee ye news, aaj r/India r/Unitedstatesofindia mein bhee aagayi, won't be surprised to see it in r/facepalm tomorrow Nirbhaya case got the law changed, can’t really use it an example of current law. Upvoted. Footpath par Milo kabhi Drinking habits? If this was driving under the influence, then this is very very concerning Bail is the norm not am exception Driving under influence while he forced his driver, who was also traveling with him, to give him the car to drive. Karma farming Indian Courts Are Joke, so a minor can do any shit or the highest crime and end up getting to write an essay about his deeds? More like he arranged Pizza for them in jail, so he get's good treatment, rich perks Bruh come on Well there wasn't a hearing that has happened yet. I'm hoping they don't damage or manipulate the evidence though. If shit goes South then I hope everyone in the state comes out and protests. Best reply so far Rules are peasants !! Why pikachu face peasants? Even if this dude was an adult, would it have made a difference? It's not like adult rich criminals face any repercussions, either. Also, can he even legally drive as a minor? I started driving only after turning 18. R/fuckcars Is he charged with 304A? He converted a car into a weapon with all likelihood that the act which is inherently so dangerous that in all likelihood, it'll cause death. Should've been charged with 300 IPC and tried as an adult for committing heinous offence under JJ act. This act is akin to firing a loaded canon into a crowd because is a car driven at 150+ in a single lane road not akin to a canonball which will likely take a life? Nope, it got the amendment it needed. Here too he would've been tried as an adult if he committed a heinous offence as per JJ which classifies crimes punishable with 7 years or more as heinous. I think he probably will be charged with 304A instead of 299 or 300...Therefore no trial as an adult and just a max 2 year punishment which he will probably not get considering the Probation of offenders act and JJ. P.S. All speculation, not legally sound or whatever. Long ago, the Justice system was created and controlled by the privileged to protect themselves (royalty, nobility and the wealthy) from the retribution of the non-privileged commoners and it continues to serve its intended purpose to this day. This case is a prime example of that. **\"Police and politicians can even lick your shoes for money\"** How dare you say this? The correct sentence should be \"Police and politicians can even lick your **asshole** for money\" What? why would you kill the moron's family instead of the moron himself? What you think is the solution to this problem? what incentive does the state have to go against rich people? Just read an article, the Pune Police Commissioner said that he'll be tried as an adult in the high court, here's the article : He's gonna use chatgpt for sure The judge should be named and shamed and if possible suspended He definitely is trying to save the accused, most probably after getting money from the accused He should go to jails for the minors. Just because they have money he is getting away with it. Dial 100 for express bootlicks They should be treated like adults depending on the severity of the crime. If tomorrow a juvenile goes and shoots our PM and bombs Lok sabha, would he still be considered as someone who can be reformed? 😂 why don't u help them hire **someone** or just posting statements here doing nothing It's part of the bigger story, after family's gone the riches will be taken by their money hungry workers, close friends and extended family. Then the accused will have no money and have to fend for himself. In absence of money he won't be able to afford fuel hence no more accidental killings. India 😍 You're right. I was angry when i wrote that Can we place a bet here about how many days it takes for the guy to leave the country and the law just watches? I am gonna say, about 3 weeks from now on. Precedent set hogya hai guys. Ab aap bhi kisi ko car se thok kar is case ko as a precedent use kar sakte ho😌 Experience lawyers correct me if i am wrong? given on Sunday ;) Track the same news in a week or even a month. Sab khatam Tell me that's not true 🙂 Did you think he killed a buck on the footpath? Accident Porsche se nahi truck se hua tha.... Next Salman Khan in making I’m sure some policeman would’ve written the essay for him as well for extra 500 bucks! Pathetic! Next thing we are going to learn in the proceedings is that he is mentally unstable. डॉक्टरांनी त्याने दारू पिली नाही असे certificate दिले न्यायाधीशाने त्याला निबंध लिहिणे पोलिसांबरोबर 15 दिवस ट्रॅफिक कंट्रोल करणे आणि डॉक्टरकडून सल्ला घेणे या शिक्षा दिल्यात रविवारी कोणालाच bail मिळत नाही पण याच्यासाठी रविवरी कोर्ट ने bail ऑर्डर दिली पोलिसांनी त्यांच्यावर कमी कलमे लावली पोलसानी त्यांना आणि त्यांच्या मित्रांना पिझ्झा आणि burger आणून दिले कुठल्याही पत्रकाराने त्यांची नावे पहिल्यांदा प्रसिद्ध केली नव्हती.. एकही.. एकही राजकीय पक्षाच्या नेत्यांना या विषयी एकही शब्द बोलला नाहीये अजून पर्यंत.. आपली व्यवस्था पूर्णपणे सडलेली आहे.. न्यायव्यवस्था, पत्रकर, पोलीस, राजकारणी...सर्व सर्व.. पैसे टाका सगळे नागडं व्यायला आणि झोपायला तयार आहे..एका बिल्डरने सर्वांना नागडं केलंय.. हे कुठल्याही पक्षासाठी नाही सर्व पक्ष सारखेच.. Here the crying part is he was declared juvenile based upon the school TC and all now how the BOb is managed in the education system in Uttar Pradesh. Irony is as per media reports that ba***rd did the maximum cruelty and he is still roaming free !!! The father should go to jail if the son is too young. Especially if the father gave him the car. I guess he won't be doing that either... Chat jee peetee will be! Why are you surprised ? Something something constitution. Something something equality 😂 A barbaric society with few barbarians who are literate. That’s India. Reports suggest the father was made aware that the son was under influence and wanted to drive the car (there was a driver with them) and he gave the go ahead. Only if his father is multi millionaire. He still will be tried tho. If u have money and connections u can get away with anything anywhere in world..! They will probably settle with the victims family outside court now and their son soon will go to some European nation for future studies..! Milord after getting that maal in his account Is this in India fr? I knew justice system was messed up but this? What will writing essay even do? If this goes in favour of the accused in today's age of Social media, then we are watching too much of \"Gulabi Sadi\" and \" mummy kaisi hai roasts\". Lets stir a storm over this. Crushed under illegal hoardings, drowned beneath illegal bridges, choked by illegal pollutants and poisoned by illegal pesticides and chemicals. Help him practice essay writing for college admission in Europe colleges /s Isn’t that the case in every country? I hope he never has a normal life again Minor? Who tf let them drive ? that too a Porsche?? Didn’t they say if a minor drives the vehicle’s owner will be punished harshly? What happened to that ? Y aren’t their parents punished either? Yeah saw this on news today. Very bad. Yeah saw this on news today. Very bad. Yeah, saw this on news today. Very bad. BC this is so enraging. All these mfs are sold out. You can't expect to get justice even in such a grave situation. 2 PEOPLE DIED FFS. AND THERE'S A LITERALLY CCTV FOOTAGE OF HIM DRINKING. Remember how everyone sort of cringe when they hear _systumm_ ... Well that wasn't far from being factual. You do get hold \"system\" when you're rich enough. Ye galat hai. Ok, he is a minor, who has gone astray, but that doesn't mean that you will let him go. Compensation to aggrieved and at least 6 months of juvenile detention alongside/seperate mandatory, court approved or issued rehabilitation. So, they can either get him rehabilitated when he is serving his time in detention, or he does it after he serves his time. This way the parents won't be able to elude rehabilitation for their son Followed by 180 hrs of annual social service for 2 years. Change of school or college Meeting and apology to the family of the aggrieved at the end 2 year service. He will be forced to carry the guilt of killing someone for almost 3 years. This way he would even be able to lead a better life in the future and ever redeem from his vain life and crime. Happy cake day! India is the country with the widest income disparity anywhere in the world. So even if it is the case in every country, it is the worst in India. We should really learn from Vietnam. LOL! He is probably on a flight out of the country by now. Justice system in this country is a joke. So much clownery in 4 lines huh. Salman bhai ka bachpan 🥳🥳 The people were a teen couple from the looks of it Don't make facts on the go to support your narrative, as much as I agree that there's inequality in India, India is not even in the [top 100!](https://en.m.wikipedia.org/wiki/List_of_countries_by_income_equality) The system is built on money… what’s to be expected? In the ME for such a crime your person has to pay money to tie families of the deceased and/or spend time in prison… What’s your point? It wouldn't be surprising if he used chatgpt to write his essay I don't where wikipedia got it's data from but India is definitely one of the most unequal country barring some African countries. Pikkety and his team has done a great job in researching it. >In almost every ~~this~~ country, if you are rich, you are above the law. Only work if your daddy have money Selmon's chatu fans be like -- selmon bhoi ko kuchh nai bolne ka..pawpaw he hamare.. Is even the opposition parties raising this topic? It says there in the table, the GINI data is from the World Bank. GINI is a more comprehensive metric btw used to measure income inequality. The link you shared measures the inequality in terms of the relative percentage of wealth of top x%, which is less comprehensive but cool metric nonetheless. And a high value of India is indicative of top x% having a disproportionately high share of wealth, but on an overall level, India is not that high on the list of inequality! But bhoi to itna sara philanthropy and charity krte h. Ameero ke liye alag kanoon aur middle class aur gareebo ke liye alag kanoon 😶 No, some places actually have rule of law Make it 500 words and don’t even think of chat GPT. Shameful. It's a disgrace. [https://youtube.com/shorts/uhPzfae2N4A?feature=shared](https://youtube.com/shorts/uhPzfae2N4A?feature=shared) umm precedents are the statements and judgements from a court of record, i.e. the supreme court and high courts. This is a subordinate court bail order, definitely not a precedent. Just imagine what that teen will learn out of this whole experience. Nothing which will make him a good man in the future Nobody is downvoting you for this man. If I would be at his place, they would have arrested me for not being able to write the essay Blind PPL huh It’s not a punishment enough but it’s a precedent headed to the right direction. The judiciary should be a criminal reform system rather than a criminal punishment system. However, I’m afraid that this will only act as precedence for the wealthy and powerful but not the financially disadvantaged. That's min life sentence to parents ,if upper 16 kid too Now no mf will take action against this ..... I understand that the kid is juvenile,so why aren't the parents punished in this case ? At this point i doubt if he is even 17. Probably avoiding being 18 and getting prosecuted like an adult What!! What! No, it isn’t. I want this mf in jail, the treatment he is getting MLA, Judge even police everyone is doing work in his favour This happened in Brazil as well. Though I don’t even think he had to write an essay or go to treatment. Atleast 100 pieces of the killer and then dipped in acid and salt and left on roads as a symbol of justice. > is just a payment cost Excuse me sir, this one is an essay which will probably be written by a robot butler. Behnchod ye kya justice hai, the girl who died was my senior in school and I have seen how great she was in all the fields and yet fate has something else for her but this treatment given to that kid is something which sets wrong precedent and he should be charged as an adult, that fucker broke so many rules (was drunk and driving while just 17.5 years in age) and still got out with a punishment less that we get in schools. After killing 2 people the punishment he gets is to work with traffic police for 15 days and write an essay on road accidents like wtf. Middle class aadmi keeda hai kya bc, jisko lage kuchal k bina consequences k nikal jaye. Fuck this judicial system. essay no words what we can do is stand together and pressure authorities to take action against him to make sure he will be jailed Lauda guilty he will feel. People should have killed him after the accident, don't know how many more people he will kill. May he live a horrible shitty life. Wow, and I had to write essays to get 5 marks... This is the time I support mob justice I understand that it's only a bail he still has to appear in court but, writing an essay seems really out of touch. The judge should be fired. I don't think this would have gone that well for this piece of shit in any other country except India where money / status is treated above human life. Oh yeah mentally unstable guy driving a freaking porsche! as ridiculous as that sounds I feel like that would be the angle they would go for and it would work Take my vote We habe poverty so people like police and other officials got ome benifit sometimes it's like, does the judicial system have flaws and loopholes to exit from such crimes? The degree to which you are is likely different. I think you can get away with much more serious and egregious shenanigans, read crimes, here with not much of a repercussion. Essay? What? Who’s the 17 yr old guy? Ahh, would like to slqy some people in a typical manner! WOULD LIKE TO KNOW THE FORMULA,,, wtf Even Pune police trying to take custody of the child But there is court judge don't give them permission Party donations for the folks running the state machinery. And here we have folks defending crony capitalism, as if being filthy rich isn't a bad thing :) Is it the wrong time to ask for some vigilantism justice?! Saw his crashed car on instagram. Car stopped by the pavement. Left front bumper and headlight were caved in. 2 men got furious and started smashing his windows with rocks, pretty big ones. That damn modi. the guy on his essay: i was testing the drs system on my new gt3rs or i was trying to listen to the sounds of the beautiful v10 that i wasn't paying focus on the road. porsche should be accountable. Didn’t this happen in Karnataka? Not surprised.. Rich politically connect folks live like we’re in a feudal area. Guys just rape and tape hundreds of women and then run to foreign countries. The average motorist on the street doesn’t follow any rules, you’ll bet one of those feudal lordlings won’t bother either. The people of Karnataka get what we deserve. We love to live in the Stone Age, we get Stone age government. Are you from Maharashtra?? Essay bhi internet se chaapega yeh What happened to mob mentality? Taxes and laws screws the middle class while the rich folks can do whatever they want and be worry free. Savlon bhoi: kills 99.99% pedestrians Believe me or not, his taxes are gonna fund way more people than he killed. Running his future won't be a good decision We are officially a Banana republic. From rich kids broadcasting their marriages and elephant safaris and private airforce airfields to killing people openly. When are people going to wake up Bail is a matter of right. Yes, even for non bailable crimes. Non bailable just means you don't get by default, a judge has to give you bail. But in normal circumstances, if there's no risk of fleeing, intimidating witnesses etc, bail is given as a general rule. The reason why Kejriwal for example was not getting bail is because he was charged under a special act 'PMLA' which makes bail law much more stricter and you essentially have to prove your innocence to a degree to get bail. These special acts such as UAPA result in a lot of people spending time in jail for years and years without any trial. As shitty as you find it, that kid got bail rightfully. As a general rule, people should not be in jails without a trial when we cannot say they are guilty or not guilty. The state doesn't get to just file a case and send someone to jail without any adjudication. Remember, the basic principle of criminal law is (and for a very good reason) innocent until proven guilty. It doesn't matter whether it looks like someone is obviously guilty to you. India h , chalta h. Nothing wrong with getting bail for manslaughter, but everything else surrounding this case is trash. Affluenza What if some other minor hits him and he dies? Will the other kid should also write an essay, especially if he's from middle class background? The courts are the most corrupt institutions of India, no wonder Kejriwal was set free like this If you have money, no law can stop you. Gets prison with amenities. ofc my friends modi hai to mumkin hai. nop. i upvote u sir and i salute you. I hope we don't just move on from this incident and forget all this after a week. WE NEED JUSTICE PEOPLE! WE NEED A CHANGE IN THE SYSTEM. THIS SHOULD NOT BE TOLERATED. WE NEED TO ACTUALLY DO SOMETHING ABOUT IT. Rich builder's darling son literally gets away with murder.Drunk driving in an unregistered luxury car but saved by the fact that technically he is a minor as he is 17. We are owned by rich Indian judiciary is of the Richest, For the Richest & By the Richest! 💸 I sometimes want to hire some you know who to take care of these folks. They can't juvenile law ui aisa hai 😢. Parliament must act on this. Judges can give punishment and judgements on the basis of existing laws. At this point, I am not even surprised by anything stupid which happens in our country. The judicial system has gone for a toss, seriously. People committing smaller crimes face paying heavy penalties or even jailtime whereas this clown has got a bail, like wtf man. GINI like many other metrics tries to put multi dimensional data into one number. This most of the time results in misleading story and idea. Maybe it captures some truth when viewed at one angle but it almost certainly never gives the full picture. To get the whole picture there is no substitute other than reading the finer details. And Piketty does a great job in explaining how they get the data, process it and get the result. [WorldInequalityLab\\_WP2024\\_09\\_Income-and-Wealth-Inequality-in-India-1922-2023\\_Final.pdf (wid.world)](https://wid.world/wp-content/uploads/2024/03/WorldInequalityLab_WP2024_09_Income-and-Wealth-Inequality-in-India-1922-2023_Final.pdf) Nope, hyd. Why tho? Unless it is SA. If you are a threat to the king, bonesaw will find you. in India there are \\~150k people die in road accidents each year. understand that nobody wants to kill someone intentionally hence the crime is bailable. also you can not keep all these people in jail since we do not have capacity. understand the law is good, but not the system who's implementing it. also getting bail doesn't mean he's free. criminal proceedings will follow. do not get angry over such posts. post like these make one ignore rationality. Have faith, KARMA IS BIYAACH !! Sharukh's son's incident and law changed. due to the heinous nature of the crime, there is a basis for him to be tried as an adult Hahaha is this some kind of joke? Is this how justice is made? Sounds like they're giving punishment to a school kid. How can an essay help with justice? Is he gonna get extra marks for this and later get included in his finals? And what the shit about this guy working with a traffic police for 15 days? Community services since when? He should never be given the licence to drive anything at all. So just become like him to punish him! Kaha ka justice hai ye bhai? wtf, what is this happening? agar Porsche 911 hai toh koi baat nahi There's no justice for the poor and middle class in this country. If you have the resources, please leave this godforsaken country at once. Even if we try to change things here, we'll end up getting killed like hundreds of honest people who chose to question the system. I think reduce age to 14 would be an good option Paise ka power dikhate hai madar jhaat 🤬 15 year olds should NOT vote. This is involuntary manslaughter. KRK Bola ki usko cheeni ki bimari hai isilye kii gf nahi hai I'm talking about juvenile age law Paisa hai toh...Sab Farzi He's probably going to ask ChatGPT to write an eassy. what do think is the limit? what counts as being filthy rich? in my days i had to write an apology letter 5 times for going out of the class when a teacher called me in between the class and the reason was that i didnt take the outpass na bro u r getting upvoted i believe some offences require the juveniles to be punished as adults and the age for the juvenile jurisdiction should be decreased as well well, in that case his parents should be hanged if he is given a porsche to drive despite being mentally unstable Has the footage been shown somewhere? Bridge collapse hundreds of people gets died. Pr Galti bridge pr ghumne walo ki thi kyuki paw paw ki government thi na paw paw. C'mon Pune. Today it is some random person who lost their life. Tomorrow it could be you, your loved ones. I know it is easy said that done. But we need someone to set an example. Pawpaw, but no MawMaw. poor single PawPaw... Correction, police and politicians can set up a tent in your bumhole for money. we need a Dexter figure for real. \"Money doesn't buy happiness \" money bought this fucker an essay and a bail tho. Oh yeah, I will talk to my brother. Now this is some real life motivation to work hard and become crorepati 🔥 My immediate thought was that he is going to be lynched by a mob the moment he is seen outside. Sad to see our justice system fail this way. Nothing new that happens in India. Money is power and if you have money, you control the power. this tbh..... How can 2 lives be equivalent to a 300 worded essay? I mean wtf. ❤️‍🩹🥹🤦‍♀️ I am leaving India now. I will return only when I have enough money to change the “system”. Time to kill him and leave an essay with his body, no need for the cops to go through the trouble at all. We need a few names: MLA of the location MP of the location Name of the judge Name of the accused Name of the investigation police officer Name of the SHO It's very simple, he was driving the car, his dad owned the car, he was drunk, he killed two people. Trial must be broadcast online live... ChatGpt ftw its an inevitable rule of society even if the officers aren't corrupt. The rich will always get relief, even in the worlds harshest of constitutions there similar cases there is only one cure to this, get yourselves involved in the system and <BE RICH> Reptile 🦎 Well let's not forget that Salman Khan is still happily and freely living his life Yeah if this guy killed any one of my family members and gets bail then i would have slit his throat open suck the air out of his lungs and blow it on his dads face RemindMe ! 3 weeks Wahh Indian judiciary!! 👏 👏 👏 heh? wdym 💀 What a stupid joke!!! Writing essay for killing? They are just trying to fool the public into thinking they are rehabilitating him. Don't be surprised if anything happens What about the great constitution written by the great Ambedkar! Incredible india 💯 Police men believe appeasing sons of mega rich fathers will get them favors in return. It’s how society works, once they form a relationship with this man they can also share in the wealth and methods by which he gained his wealth. Sad 😢 but true. 150 words per death... To have enough money to afford enough donation to buy folks with power. It's difficult to put an exact number to this \"limit\". Depends on the place. For example: someone in a village can give a bribe of 5lac to the panchayat pradhan to get favors. Similarly, in a biggger city like Pune, this sum may easily go upto crores at the bare minimum. What type of nonsense is going on Someone write an essay, get in your car. And go for the judge. What Baap ko pelo Undergo treatment for his drinking habit? He shouldn't even be drinking alcohol or be able to drive a car in the first place. Heard that he and his friends spent around ₹48k at the first bar before killing the youngsters. I saw this today bru then how is he not in jail tf >Is this the punishment for killing 2 people? I don't think so. He is on bail so it's not the last we are hearing of him. Actually this is actually a good thing. If its found that he was not under the influence of alcohol that means he was in his complete senses when commiting the crime. Thats actually going to against the minor and he will be tried as an adult. I want to read that essay.. Make it public. Requesting everyone to reshare this. They should not get away with it. Naah it's in India and some Asian country only. its not late , that he will rape a girl and escape court by paying bribe because he knows law cant do shit about him and rich people we should fill him with fear that , law is same for everyone , this is new india , not times like salman khan Please tell me this guy is in jail. Atleast as if 18 June 2024 Sadly you're right Given the character, he would not care to write his own essay. There is no justice there is only power - Michael foccault"
}