{
    "id": "1d5m2yv",
    "title": "Lovely Professional University's (LPU) Exaggerated Salary Offers to Attract Students",
    "url": "https://www.reddit.com/r/india/comments/1d5m2yv/lovely_professional_universitys_lpu_exaggerated/",
    "selftext": "This is a [follow-up](https://np.reddit.com/r/Kerala/comments/1d4w2ny/3_crore_at_mercedesbenz_isnt_it_too_good_to_be/) post to a recent discussion in regional subreddit about a [YouTube video (Malayalam)](https://www.youtube.com/watch?v=rwD5AkqRazQ) where a guy claims to have received a 3 crore package from Mercedes Benz's Germany office as a software engineer. He mentioned having good JEE scores and admission offers from NITs but choose LPU due to a scholarship.\n\nWhat’s alarming is that LPU is leveraging this questionable claim to attract more students. They have even published an ad on a [national news channel](https://timesofindia.indiatimes.com/spotlight/with-rs-3-crore-package-lpu-sets-another-placement-record/articleshow/99374583.cms) (TOI) and it's featured on their official [website](https://www.lpu.in/).\n\nThe problem? There are no credible sources indicating that Mercedes offers such high packages for software engineer roles. Even by German standards, this is a FAANG-level salary, typically for senior or staff roles in tech giants like Google or Facebook, not automotive companies like Mercedes. You can find the [salary ranges here](https://www.levels.fyi/t/software-engineer/locations/germany).\n\nThis needs to be stopped as it's misleading students and parents to a private university. Additionally, he got the offer after graduating from the university, so even if the salary package is correct, the college should not make any claims over it.",
    "flair": "Rant / Vent",
    "score": 48,
    "num_comments": 9,
    "created_utc": 1717245560.0,
    "convurl": "https://external-preview.redd.it/gqDKNpn_gsABStnWNhCp1AEk6MBEv1TFLUrjz_b1bMg.jpg?auto=webp&s=a15e4bc91a7dc740794809ba67a119be222a7cb3",
    "comments": [
        ">(any college name here) Exaggerated Salary Offers to Attract Students\n\nshould we even care about it",
        "I understood that the person got the job a few years after graduating. But I never realised that 3crore is a huge salary even by European standards. Rs 3 crore is equal to 300k euros and the average salary in Europe is around 50k.\n\n  \nThis is a serious crime and they should face action.",
        "Water is wet",
        "Every private colleges does that, but this one went too far. 3 crore package is something not achievable in top-tier colleges for freshers. Unfortunately, many people fall for such scams. Just look at the comments on the YouTube video—they're worshipping him like some kind of god. This kind of misinformation needs to be addressed to prevent more students and parents from being misled.",
        "Wolf Gupta wants to chat!",
        "Funny thing is no one bats an eye when Masters Union makes similar claims for their MBA, run by Pratham Mittal who is from the same family which runs LPU. Branding and PR works wonders I guess",
        "300k in Germany is something even FAANG doesn't pay to people with 10+ years of exp",
        "I work in germany. Absolutely not possible. As a fresh graduate.",
        "Main post has been deleted. Can you please share what is this all about?",
        ">went too far\n\nif someone starts next college, they'll need to advertise salary more than that.\n\nat least i have given up on the system."
    ],
    "cleaned_text": "lovely professional universitys lpu exaggerated salary offers attract students followuphttpsnpredditcomrkeralacommentsdwnycroreatmercedesbenzisntittoogoodtobe post recent discussion regional subreddit youtube video malayalamhttpswwwyoutubecomwatchvrwdakqrazq guy claims received crore package mercedes benzs germany office software engineer mentioned good jee scores admission offers nits choose lpu due scholarship whats alarming lpu leveraging questionable claim attract students even published ad national news channelhttpstimesofindiaindiatimescomspotlightwithrscrorepackagelpusetsanotherplacementrecordarticleshowcms toi featured official websitehttpswwwlpuin problem credible sources indicating mercedes offers high packages software engineer roles even german standards faanglevel salary typically senior staff roles tech giants like google facebook automotive companies like mercedes find salary ranges herehttpswwwlevelsfyitsoftwareengineerlocationsgermany needs stopped misleading students parents private university additionally got offer graduating university even salary package correct college make claims ",
    "cleaned_title": "lovely professional universitys lpu exaggerated salary offers attract students",
    "cleaned_selftext": "followuphttpsnpredditcomrkeralacommentsdwnycroreatmercedesbenzisntittoogoodtobe post recent discussion regional subreddit youtube video malayalamhttpswwwyoutubecomwatchvrwdakqrazq guy claims received crore package mercedes benzs germany office software engineer mentioned good jee scores admission offers nits choose lpu due scholarship whats alarming lpu leveraging questionable claim attract students even published ad national news channelhttpstimesofindiaindiatimescomspotlightwithrscrorepackagelpusetsanotherplacementrecordarticleshowcms toi featured official websitehttpswwwlpuin problem credible sources indicating mercedes offers high packages software engineer roles even german standards faanglevel salary typically senior staff roles tech giants like google facebook automotive companies like mercedes find salary ranges herehttpswwwlevelsfyitsoftwareengineerlocationsgermany needs stopped misleading students parents private university additionally got offer graduating university even salary package correct college make claims",
    "cleaned_comments": "college name exaggerated salary offers attract students even care understood person got job years graduating never realised crore huge salary even european standards rs crore equal k euros average salary europe around k serious crime face action water wet every private colleges one went far crore package something achievable toptier colleges freshers unfortunately many people fall scams look comments youtube videotheyre worshipping like kind god kind misinformation needs addressed prevent students parents misled wolf gupta wants chat funny thing one bats eye masters union makes similar claims mba run pratham mittal family runs lpu branding pr works wonders guess k germany something even faang doesnt pay people years exp work germany absolutely possible fresh graduate main post deleted please share went far someone starts next college theyll need advertise salary least given system",
    "light_cleaned_title": "Lovely Professional University's (LPU) Exaggerated Salary Offers to Attract Students",
    "light_cleaned_selftext": "This is a [follow-up](https://np.reddit.com/r/Kerala/comments/1d4w2ny/3_crore_at_mercedesbenz_isnt_it_too_good_to_be/) post to a recent discussion in regional subreddit about a [YouTube video (Malayalam)](https://www.youtube.com/watch?v=rwD5AkqRazQ) where a guy claims to have received a 3 crore package from Mercedes Benz's Germany office as a software engineer. He mentioned having good JEE scores and admission offers from NITs but choose LPU due to a scholarship. What’s alarming is that LPU is leveraging this questionable claim to attract more students. They have even published an ad on a [national news channel](https://timesofindia.indiatimes.com/spotlight/with-rs-3-crore-package-lpu-sets-another-placement-record/articleshow/99374583.cms) (TOI) and it's featured on their official [website](https://www.lpu.in/). The problem? There are no credible sources indicating that Mercedes offers such high packages for software engineer roles. Even by German standards, this is a FAANG-level salary, typically for senior or staff roles in tech giants like Google or Facebook, not automotive companies like Mercedes. You can find the [salary ranges here](https://www.levels.fyi/t/software-engineer/locations/germany). This needs to be stopped as it's misleading students and parents to a private university. Additionally, he got the offer after graduating from the university, so even if the salary package is correct, the college should not make any claims over it.",
    "light_cleaned_comments": ">(any college name here) Exaggerated Salary Offers to Attract Students should we even care about it I understood that the person got the job a few years after graduating. But I never realised that 3crore is a huge salary even by European standards. Rs 3 crore is equal to 300k euros and the average salary in Europe is around 50k. This is a serious crime and they should face action. Water is wet Every private colleges does that, but this one went too far. 3 crore package is something not achievable in top-tier colleges for freshers. Unfortunately, many people fall for such scams. Just look at the comments on the YouTube video—they're worshipping him like some kind of god. This kind of misinformation needs to be addressed to prevent more students and parents from being misled. Wolf Gupta wants to chat! Funny thing is no one bats an eye when Masters Union makes similar claims for their MBA, run by Pratham Mittal who is from the same family which runs LPU. Branding and PR works wonders I guess 300k in Germany is something even FAANG doesn't pay to people with 10+ years of exp I work in germany. Absolutely not possible. As a fresh graduate. Main post has been deleted. Can you please share what is this all about? >went too far if someone starts next college, they'll need to advertise salary more than that. at least i have given up on the system."
}