{
    "id": "1gk7p49",
    "title": "New way to scam with discounts",
    "url": "https://i.redd.it/fpm3q0a8d3zd1.png",
    "selftext": "Charging surcharge for grocery shopping is only a scam nothing else.",
    "flair": "Policy/Economy",
    "score": 18,
    "num_comments": 18,
    "created_utc": 1730816214.0,
    "convurl": "https://i.redd.it/fpm3q0a8d3zd1.png",
    "comments": [
        "Brother, let's be fair. Those guys should be paid enough.\nThe surge charge is totally justified & also it is only active during the peak order hours.",
        "I try to use it as less as possible I think big basket has better service than all. Just it has to be ordered a day before.",
        "Either people dont really understand what scams are or they think everything they don’t understand is a scam?",
        "True but then charge the delivery fees only no.\n\n First they say buy 200 rs worth and get free delivery. Then they add surge fees for the same amount. That's just plain cheating.",
        "Fck Zomato. Swiggy with Swiggy one is the way to go.\n\n  \nZomato is shit on wheels.",
        "Not even a day before. Most of the time they deliver within 2-6 hours now here in Mumbai.",
        "That's better, I hope they don't charge delivery like blinkit ?",
        "Getting charged for a service is a scam to most Indian people. \n\nSame reason every company is doing indirect charges, as people are not ready to pay for a service. \n\nSwiggy One/Zomato gold is basically given away for free, they instead make delivery fee by charging 30% to restaurants, which is absurdly high and usually restaurants pass it to customers. \n\nLipstick sell for ₹1 plus delivery because people don’t want to pay ₹99 for a lipstick. \n\nMany Indian streaming services are ad-supported and free instead of pay once for a fully ad free version. Even worse apps like Jio show ad’s even after you pay. \n\nNobody targets paid high quality games and apps to Indians as anyone who wants pirates it.",
        "These surge charges are not given to the delivery guys. Its is solely consumed by the company. \n\nAlthough on a little bit of good side, they are used to reduce orders during peak hours so that blinkit and other companies do not have to employ more number of delivery boys who won’t be able to earn anything at non peak hours",
        "I always do Amazon Fresh & chill now",
        "The more you depend on things like these the more you'll have to shell out when demand is high. So always prefer normal general stores because they'll also provide woth discounts of upto 10% on MRP anyway.",
        "I just got an email from them today. They are going to be by default doing the same instant delivery like Blinkit, Instamart, Zepto. But if you want, you can schedule your order as well during payment.",
        "Can you explain it like I'm 7yo. Sorry",
        "They do. But nominal, like ₹15 below 300 and ₹5 above that. So far there's no surge fee, the time taken just increases during rush hours.",
        "Haha no worries. Basically they had 2 options before - the next day delivery and the instant bbnow delivery that delivered in like 10-15 mins.\nNow they have changed it to be by default bbnow where they deliver in 10-15 mins and if you need to, you can schedule delivery for the next day or something while checking out. No more manual choosing.",
        "I like it",
        "Ahh I see now lol. Thanks for the elaboration<3"
    ],
    "cleaned_text": "new way scam discounts charging surcharge grocery shopping scam nothing else ",
    "cleaned_title": "new way scam discounts",
    "cleaned_selftext": "charging surcharge grocery shopping scam nothing else",
    "cleaned_comments": "brother lets fair guys paid enough surge charge totally justified also active peak order hours try use less possible think big basket better service ordered day either people dont really understand scams think everything dont understand scam true charge delivery fees first say buy rs worth get free delivery add surge fees amount thats plain cheating fck zomato swiggy swiggy one way go zomato shit wheels even day time deliver within hours mumbai thats better hope dont charge delivery like blinkit getting charged service scam indian people reason every company indirect charges people ready pay service swiggy onezomato gold basically given away free instead make delivery fee charging restaurants absurdly high usually restaurants pass customers lipstick sell plus delivery people dont want pay lipstick many indian streaming services adsupported free instead pay fully ad free version even worse apps like jio show ads even pay nobody targets paid high quality games apps indians anyone wants pirates surge charges given delivery guys solely consumed company although little bit good side used reduce orders peak hours blinkit companies employ number delivery boys wont able earn anything non peak hours always amazon fresh chill depend things like youll shell demand high always prefer normal general stores theyll also provide woth discounts upto mrp anyway got email today going default instant delivery like blinkit instamart zepto want schedule order well payment explain like im yo sorry nominal like far theres surge fee time taken increases rush hours haha worries basically options next day delivery instant bbnow delivery delivered like mins changed default bbnow deliver mins need schedule delivery next day something checking manual choosing like ahh see lol thanks elaboration",
    "light_cleaned_title": "New way to scam with discounts",
    "light_cleaned_selftext": "Charging surcharge for grocery shopping is only a scam nothing else.",
    "light_cleaned_comments": "Brother, let's be fair. Those guys should be paid enough. The surge charge is totally justified & also it is only active during the peak order hours. I try to use it as less as possible I think big basket has better service than all. Just it has to be ordered a day before. Either people dont really understand what scams are or they think everything they don’t understand is a scam? True but then charge the delivery fees only no. First they say buy 200 rs worth and get free delivery. Then they add surge fees for the same amount. That's just plain cheating. Fck Zomato. Swiggy with Swiggy one is the way to go. Zomato is shit on wheels. Not even a day before. Most of the time they deliver within 2-6 hours now here in Mumbai. That's better, I hope they don't charge delivery like blinkit ? Getting charged for a service is a scam to most Indian people. Same reason every company is doing indirect charges, as people are not ready to pay for a service. Swiggy One/Zomato gold is basically given away for free, they instead make delivery fee by charging 30% to restaurants, which is absurdly high and usually restaurants pass it to customers. Lipstick sell for ₹1 plus delivery because people don’t want to pay ₹99 for a lipstick. Many Indian streaming services are ad-supported and free instead of pay once for a fully ad free version. Even worse apps like Jio show ad’s even after you pay. Nobody targets paid high quality games and apps to Indians as anyone who wants pirates it. These surge charges are not given to the delivery guys. Its is solely consumed by the company. Although on a little bit of good side, they are used to reduce orders during peak hours so that blinkit and other companies do not have to employ more number of delivery boys who won’t be able to earn anything at non peak hours I always do Amazon Fresh & chill now The more you depend on things like these the more you'll have to shell out when demand is high. So always prefer normal general stores because they'll also provide woth discounts of upto 10% on MRP anyway. I just got an email from them today. They are going to be by default doing the same instant delivery like Blinkit, Instamart, Zepto. But if you want, you can schedule your order as well during payment. Can you explain it like I'm 7yo. Sorry They do. But nominal, like ₹15 below 300 and ₹5 above that. So far there's no surge fee, the time taken just increases during rush hours. Haha no worries. Basically they had 2 options before - the next day delivery and the instant bbnow delivery that delivered in like 10-15 mins. Now they have changed it to be by default bbnow where they deliver in 10-15 mins and if you need to, you can schedule delivery for the next day or something while checking out. No more manual choosing. I like it Ahh I see now lol. Thanks for the elaboration<3"
}