{
    "id": "158htvb",
    "title": "Can I lodge a complaint against Airtel for not providing me speeds that I pay for?",
    "url": "https://i.redd.it/9jlvt4xmbydb1.jpg",
    "selftext": "I have a 300 Mbps plan with Airtel Xstream fiber. But I have very rarely seen speeds upto 300 Mbps on my wifi. Generally stays in the range as in the screenshot. I have raised complaints on their app many times but there solution is to just restart the router, which does indeed gives me full bandwidth for some time. Is there something I can do to lodge a complaint against them, or some governing body where I can report this? This is in Bangalore if it matters.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690221274.0,
    "convurl": "https://i.redd.it/9jlvt4xmbydb1.jpg",
    "comments": [
        "Are you connected to the 2ghz band or the 5ghz band? Do you get full bandwidth on lan?",
        "Same speed on both bands. Haven't tried direct LAN connection as the router is not near the PC.",
        "Airtel, Jio and most ISP say they provides speed “up to X Mbps”. \n\nACT is among those very few deliver the speed that their plans promise.",
        "https://preview.redd.it/4scja7kilydb1.jpeg?width=1080&format=pjpg&auto=webp&s=dfe15bd48a5f0a0324b948dabc12f2d8eb76e847\n\nat 300 Mbps, not upto.",
        "Are you sure that your other devices are not eating up bandwidth?",
        "I believe you need to check speeds directly from the modem/router via direct cable first. Wifi speeds will be lower than direct speeds because of latency, number of active connections, wifi frequency and if you are in a building there is interference from Neighbour's wifi frequency too",
        "sometimes its a router issue. ISP provided router are generally build cheap and overheat quickly. Which in turn leads to throttling. I had similar issue with the router+modem device provided by ISP - Weak and occasional loss of connection, slow speeds, etc. So I bought a really good router (Asus) and connected it via ethernet cable to the ISP provided device. I use my new router for wifi. The speed and stability improved drastically.",
        "I used to have this plan and had the same issues. Fought pillar to post. Tried every avenue. Finally gave up and downgraded the plan. My theory is this: if your neighbourhood at large has more people opting for 300/200 Mbps plans, then maybe you might get these speeds. If there are more takers for 40/50 Mbps plan, then you’ll never get these speeds. They can serve 6 clients and earn Rs 3000 (tax excluding) from the same 300 Mbps bandwidth and only earn Rs 1500 for a singular 300Mbps plan.",
        "I have the exact same setup. The Airtel provided Nokia router plus modem used to hang very frequently.",
        "Pehle apna wifi and modem ki capacity dekho\nFir wiring check krvao\nFir bandwidth dekho",
        "I'd recommend reading the fine print in the purchase agreement and terms of service, because they've almost certainly covered their asses by adding in a qualifier that they know you're never going to read until you need to file a complaint.",
        "if you're not getting advertised speeds at router level then complain to Airtel. But I don't think you'll get any resolution as they say it \"up to 300 Mbps\". I had Airtel couple of years back and had similar issue. Had to change ISP and go for a local ISP.",
        "Try direct Lan as I have issues when I use wifi, but with lan i get the speed."
    ],
    "cleaned_text": "lodge complaint airtel providing speeds pay mbps plan airtel xstream fiber rarely seen speeds upto mbps wifi generally stays range screenshot raised complaints app many times solution restart router indeed gives full bandwidth time something lodge complaint governing body report bangalore matters ",
    "cleaned_title": "lodge complaint airtel providing speeds pay",
    "cleaned_selftext": "mbps plan airtel xstream fiber rarely seen speeds upto mbps wifi generally stays range screenshot raised complaints app many times solution restart router indeed gives full bandwidth time something lodge complaint governing body report bangalore matters",
    "cleaned_comments": "connected ghz band ghz band get full bandwidth lan speed bands havent tried direct lan connection router near pc airtel jio isp say provides speed x mbps act among deliver speed plans promise mbps upto sure devices eating bandwidth believe need check speeds directly modemrouter via direct cable first wifi speeds lower direct speeds latency number active connections wifi frequency building interference neighbours wifi frequency sometimes router issue isp provided router generally build cheap overheat quickly turn leads throttling similar issue routermodem device provided isp weak occasional loss connection slow speeds etc bought really good router asus connected via ethernet cable isp provided device use new router wifi speed stability improved drastically used plan issues fought pillar post tried every avenue finally gave downgraded plan theory neighbourhood large people opting mbps plans maybe might get speeds takers mbps plan youll never get speeds serve clients earn rs tax excluding mbps bandwidth earn rs singular mbps plan exact setup airtel provided nokia router plus modem used hang frequently pehle apna wifi modem ki capacity dekho fir wiring check krvao fir bandwidth dekho id recommend reading fine print purchase agreement terms service theyve almost certainly covered asses adding qualifier know youre never going read need file complaint youre getting advertised speeds router level complain airtel dont think youll get resolution say mbps airtel couple years back similar issue change isp go local isp try direct lan issues use wifi lan get speed",
    "light_cleaned_title": "Can I lodge a complaint against Airtel for not providing me speeds that I pay for?",
    "light_cleaned_selftext": "I have a 300 Mbps plan with Airtel Xstream fiber. But I have very rarely seen speeds upto 300 Mbps on my wifi. Generally stays in the range as in the screenshot. I have raised complaints on their app many times but there solution is to just restart the router, which does indeed gives me full bandwidth for some time. Is there something I can do to lodge a complaint against them, or some governing body where I can report this? This is in Bangalore if it matters.",
    "light_cleaned_comments": "Are you connected to the 2ghz band or the 5ghz band? Do you get full bandwidth on lan? Same speed on both bands. Haven't tried direct LAN connection as the router is not near the PC. Airtel, Jio and most ISP say they provides speed “up to X Mbps”. ACT is among those very few deliver the speed that their plans promise. at 300 Mbps, not upto. Are you sure that your other devices are not eating up bandwidth? I believe you need to check speeds directly from the modem/router via direct cable first. Wifi speeds will be lower than direct speeds because of latency, number of active connections, wifi frequency and if you are in a building there is interference from Neighbour's wifi frequency too sometimes its a router issue. ISP provided router are generally build cheap and overheat quickly. Which in turn leads to throttling. I had similar issue with the router+modem device provided by ISP - Weak and occasional loss of connection, slow speeds, etc. So I bought a really good router (Asus) and connected it via ethernet cable to the ISP provided device. I use my new router for wifi. The speed and stability improved drastically. I used to have this plan and had the same issues. Fought pillar to post. Tried every avenue. Finally gave up and downgraded the plan. My theory is this: if your neighbourhood at large has more people opting for 300/200 Mbps plans, then maybe you might get these speeds. If there are more takers for 40/50 Mbps plan, then you’ll never get these speeds. They can serve 6 clients and earn Rs 3000 (tax excluding) from the same 300 Mbps bandwidth and only earn Rs 1500 for a singular 300Mbps plan. I have the exact same setup. The Airtel provided Nokia router plus modem used to hang very frequently. Pehle apna wifi and modem ki capacity dekho Fir wiring check krvao Fir bandwidth dekho I'd recommend reading the fine print in the purchase agreement and terms of service, because they've almost certainly covered their asses by adding in a qualifier that they know you're never going to read until you need to file a complaint. if you're not getting advertised speeds at router level then complain to Airtel. But I don't think you'll get any resolution as they say it \"up to 300 Mbps\". I had Airtel couple of years back and had similar issue. Had to change ISP and go for a local ISP. Try direct Lan as I have issues when I use wifi, but with lan i get the speed."
}