{
    "id": "12tw1ap",
    "title": "Alt News: Stunned into silence? No prime-time debate on Satyapal Malik's explosive Pulwama claims",
    "url": "https://www.altnews.in/stunned-into-silence-no-prime-time-debate-on-satyapal-maliks-explosive-pulwama-claims/",
    "selftext": "The silence of both - Godi Media and Bhakts though deafening, is not surprising. Just wait till other truths about such \"claims\" are uncovered. \n\n\" In the interview aired on April 14, Malik said that Prime Minister Narendra Modi and national security advisor (NSA) Ajit Doval had asked him to remain silent when, after the Pulwama attack in February 2019, he had pointed out significant failures on the part of the government agencies which resulted in the death of 40 Central Reserve Police Force (CRPF) men.\"",
    "flair": "Rant / Vent",
    "score": 488,
    "num_comments": 72,
    "created_utc": 1682069184.0,
    "convurl": "https://external-preview.redd.it/-gYFwn29uDPMrWV92hIMHVq9duRCa0PDKULDBtMFZ70.jpg?auto=webp&v=enabled&s=5e8520164fd1b92fe15885bdb879ea3b05a806e8",
    "comments": [
        "I was expecting the usual response, CBI and ED raids on The Wire and Satyapal Malik but even that didn’t happen.",
        "Why is that expectation?",
        "The interview is quite good and sometimes it does resort to sensationalism. However really appreciate the courage of the man for spitting out facts while living with close to zero security. The interviewer himself wished for Satyapal's safety  at the end. I hope it gets more attention.",
        "That's because all the anchors don't have the mental capacity to try and deflect this",
        "What were people expecting, India is dead inside",
        "Nationalism only when it suits their agenda!!",
        "There's still time.",
        "But isn't it all just hearsay?\n\nI mean, how will he prove anything? \n\nHe is saying some big stuff, but these allegations have any actual \"ground\"?",
        "That would've made people think of this as a big issue",
        "Did you watch the interview?",
        "Generally in mature democracies if there are such issues, the usual approach will be either a parliamentary commission with both the government and opposition well represented in the investigation, or the appointment of a reputed judge or investigator to investigate with the report being presented in parliament.",
        "On corruption, maybe hard to prove. Because no record.\n\nPulwama, definitely there would be a trail of request being made.\nEven on corruption, I don't think it would be hard to find a trail if someone really wants to.",
        "Has it happened in India before? \n\nI don't seem to remember something like that has happened even during Congress time.",
        "Bro, in all sincerety, how will you prove anything leading to the big man?? \n\nIt might come out as \"lack of decision making\" on part of departments/ministry, but finding a trail that proves that big man allowed it to happen on purpose? \n\nThat's very far-fetched. The only thing parties will do is talk about it and gain political mileage and try to influence us.",
        "Just the bits and pieces, not the full interview.",
        "It has happened multiple times in the past - both during Congress and non-Congress led governments.",
        "When?? Which particular case?",
        "I think you should watch atleast Ravish Kumar's interview with Malik, it's shorter. On investigation in the matter it will be found that the CRPF jawans were refused airplanes by J&K government, that's where the lapse of responsibility will come into light.",
        "Multiple parliamentary investigation committees have been set up in the past. Google and you fill find a list, there was one I remember about separate statehood for Telangana as an example.",
        "Statehood for Telangana is a separate topic. It's related to creating a new state. That comes under jurisdiction of parliament, and all the members must debate and vote for it.\n\nDo you have a reference for a similar case where parliamentary investigation committees were formed and were against a CM or PM for an attack in any state?",
        "It won't happen now, they want to bury the issue. However wait a few years and Satyapal Malik would be facing a lot of questioning post 2024 elections.",
        "I know there was a inquiry commission headed by retired judges for the 1984 riots, Rajiv Gandhi Assassination's conspiracy angle, previous riots in the 60s. Even the 2008 Mumbai attacks had an independent inquiry commission.\nParliamentary inquiries and independent inquiries headed by judges is pretty common in the Westminster system that we have. The idea is to run an inquiry free from direct political influence.",
        "If it were false, some action would have already occurred against Malik. Govt knows he is right and he can even prove it if it goes in court. Only way to dodge the shame is silence.",
        "There you go:\n\nBREAKING | Satya Pal Malik, recently in the news for revealing previously unknown information on the Pulwama attack  has been called in by the CBI “for questioning” on April 28. \n\nThe ‘questioning’ will allegedly be on the Reliance Insurance issue.\nhttps://twitter.com/thewire_in/status/1649389026636451840?s=20",
        "Like I said, if you would Google it you will find a list of all joint committees ever set up. \n\nAs statehood is within the parliamentary remit, so is defence. The ask here is to investigate what were the causes that led to Pulwama. Any roles played by the bureaucracy or the government will come out as part of that investigation. Not setting up an investigation in the first place after the sitting governor of the state comes up with the allegations is the issue. \n\nFor the 2G scam issue as an example, a joint parliamentary committee was set up to investigate the scam and assess the roles of the cabinet ministers and bureaucracy at the time of UPA.",
        "Nobody is saying the big man made it happen on purpose. The accusation is that the internal failings were swept under the rug and no accountability was taken by anyone.",
        "This sounds like propaganda. We needed this in 2019. Releasing such things right before election is propaganda, it doesn't matter whose side is it.",
        "Hahahaha - it is almost like you can see the future man.",
        "Now cbi summoned hi",
        "I think the \"Governor\" of  a state gets type of \"immunity\" from several kinds of case proceedings. Even the ex-governer. It's a perk that comes with being a governor. That's why he is not getting any heat for saying all this.",
        "Point is it does not even lead to the small man.\nA BJP min in Bangalore is caught with 4-5crs in cash and his response is 'this is an amount from any middle class household'. No consequence. This apathy is the problem and confirms compliance.\n\nContrast it with 2G, CWG scam those were investigated and culprits convicted (though out on bail soon after) within Manmohan's term itself. \nHell all NDA does is drag National Herald case for what 10 years now.\n\nI can wager a bet, there will be another ED notice just before the election for the same case and will stop just after",
        "I am shocked foreign media isn't covering this as well. I am not getting any updates anywhere on reddit or any other social media. The other far right groups on reddit silent 😂😂\n\n Personally for me the timing felt so shady during that time that I thought it was blasphemy talking about pulwama in a negative sense. It was an emotional time and patriotism was at its peak. Then the Arnab whatsapps were leaked and my friends and I went crazy ! Oh god it is true and now we are losing our minds. This is like the movie of olden times. How could this be true in today's world. And then no media coverage as well.\n\nIt finally dawns on me how empty of a shell out media is ! One of the pillars of democracy is down !",
        "I am shocked foreign media isn't covering this as well. I am not getting any updates anywhere on reddit or any other social media. The other far right groups on reddit silent 😂😂\n\n Personally for me the timing felt so shady during that time that I thought it was blasphemy talking about pulwama in a negative sense. It was an emotional time and patriotism was at its peak. Then the Arnab whatsapps were leaked and my friends and I went crazy ! Oh god it is true and now we are losing our minds. This is like the movie of olden times. How could this be true in today's world. And then no media coverage as well.\n\nIt finally dawns on me how empty of a shell out media is ! One of the pillars of democracy is down !",
        "Yes, I agree with you.\n\nIn Congress rule, we did see the \"action\" that is missing in BJP era.\nRecently, I saw a clipping of an article in the news that Haryana government couldn't find anything illegal in the  land deals of Vadra (Husband of Priyanka Gandhi). \n\n\nIt's like we were led to believe that BJP will take some action because there is some fishy, but in the end, there was nothing illegal.",
        "I agree with you on the part that no one was found \"accountable\". We lost our people, and still we don't have the clear facts.\n\nAnd I don't know why people are downvoting my comment?\nI haven't said anything wrong yet, contrary to their belief may be.",
        "People are downvoting because you are constantly  stating that there is no way to prove anything after saying you haven’t watched the interview in full. The allegations didn’t come from some random person, it came from an ex-governor. Watch the interview and a lot of these questions will be answered.",
        "Exactly someone should make a Netflix series on this.",
        "Bro, again, all the people who have something \"substantial\" they take proper action and not go around giving interviews before the action.\nI didn't see his complete interview because he is still \"talking\". \nI don't see any \"result\" of his talking. \n\nI posted those questions because his allegations don't lead to anything but \"suspicion\" or \"hearsay\".\n\nIf he goes ahead and uses his \"substantial\" proof to find the \"wrong\" then I'll support him. \nOtherwise, he is just a political narrator trying to gain political gains in Haryana.",
        "What even are you on about? \n\nWhat do you expect him to do? What substantial action should he take? Ever heard of whistleblowing? \n\nPolitical gains in Haryana? What? \n\nListen to the interview or don’t. Stop posting stuff which makes no sense.\n\nI won’t be engaging anymore.",
        "Speechless. This is one hundred percent emergency in India.",
        "That's the thing no, his allegations are for sensationalism only. No proof for this, and further what even is the extent of the allegations , Govt didn't act on intelligence tips and sent soldiers by road instead of by Air. Not that hard to understand how expensive it would be to have every military transport done by air instead of by road. That is hardly grounds for investigation, what even will be found in the investigation i mean you can't suspend politicians for incompetence can you?",
        "Bro, just food for thought, \"whsitleblower\" whistles with proof. \nHe is not a whistle-blower.\n\nAnd now I'll watch his interview with Ravish Kumar.",
        "just wondering why would the most important person in INDIA call through a public phone?  \nThe interview coming just days before G20 meet in Kashmir.",
        "Come on. Are we really that daft to take these heresay statements on face value without any proof? If that was the case, then why not bring it up then itself? It's not like he couldn't have made a press statement about this. And before you guys jump on me that the government would have done something to him, they can still do it now. \n\nThe issue here is, that this subreddit is against BJP, and that is perfectly alright. It is ones political choice. But that doesn't mean that you start lapping at any statement made against them without proof. If there was proof, by now Congress would have taken this person in and filed a case against the ones incharge. The fact that even that hasn't happened, shows that there is no proof for all this, and this is just for creating sensation. \n\nWhile that said, if anyone of this is true, this is a heinous crime, and regardless of the position and party, the people responsible should pay for their crime rather, the worst punishment should be dealt to them. But if this is not true, and if taking this in consideration, and the hatred of this subreddit towards a certain party, the innocent are penalized, who will take the responsibility?",
        "There is something deeply wrong abt the man who is the PM of the country today, and believe me, at some point, maybe 50 years down the line, a lot of secrets abt this man are gonna come out and people of that generation will look at us and really ask just one question: How could you vote for this man twice(probably thrice)?",
        "/r/AgedLikeMilk",
        "He isn't facing any charges, he is being questioned as a witness for now anyways.",
        "Well I do agree that this sub is anti India and anti BJP . But as a centrist moderate I ask you two things \n\n> if anyone of this is true, this is a heinous crime, and regardless of the position and party, the people responsible should pay for their crime rather, the worst punishment should be dealt to them.\n\nDo you think there is one agency today in the country that can really investigate if this is true and deal them the worst punishment, even the judici@ry is not so independent and powerful these days . These powerless institutions has happened in past too when we had all powerful leaders like Indira Gandhi. Remember 2g scam , coal scam came out because of strong institutions and civil society \n\n> if this is not true, and if taking this in consideration, and the hatred of this subreddit towards a certain party, the innocent are penalized, who will take the responsibility\n\nDo you think if this was not true and if Satyapal Malik could not prove himself the government today would be sitting idle and not putting a case for misinformation. In fact already CBI has summoned for a completely unrelated case . The timing of the CBI summon proves that “Dal Mein Kuch Kaala Hai”",
        "Modi having to call from a dabha because his phone wasn't working is bs. He would obviously have satellite phones. Also, large deployments happen by road. Only in wartime planes are used. I am sorry but half the things he said doesn't make any sense.",
        "Probably four times (sigh!!!).",
        "At least it came out. We all have our own reasons.",
        "Yupp this is to create propaganda for 2024, I mean there are many statements he said which were highly illogical and there are few intellectual people in sub who can easily understand his false claims but still they will ignore everything like CBI is questioning him from October 2022 but just because they're against the BJP. For him BJP was a good party till he was  governor after retirement modiji is fascist.\nEven major Gourav Arya has exposed him on YT",
        "\"Fakir aadmi hoon, kiraaye ke makaan mein rehta hoon, property maine banayi nahi. Jitna karna tha zindagi mein kar chuka. Fact is fact!\" His words, not mine.",
        "Yeah, whatever!",
        "Even if it came out in 2019, nothing would have happened. People like you would just sit on their asses coz everyone's dead inside!",
        "How is it hearsay when he was asked to keep silent? Isn't it hearsay only when you don't have first hand knowledge and are reporting someone else's observation?",
        "AGREE WITH YOUR OPINION",
        "The future generations will held the so called media accountable when it’ll ruin us for good",
        "Sure. Tell me, what's the point of it releasing it now? Also, it's not like people like you are doing anything expect ranting on social media anonymously.",
        "Bro he is the witness they are calling him to get information on the corruption done by others. They are not investigating him, moreover this is an old case and he himself was the whistle blower.",
        "YouTube pe interview doge to YouTube par hi debate milega... primetime pe debate ke liye primetime pe interview dena padega...",
        "I respect his guts to speak up on all the corruption cases and being a whistle blower. \n\nHe also says the attack happened because of lapses in \"our\" part in a way taking equal responsibility for the attack. \n\nNow let's take a look at all the things wrong with his interview - \n\n1. When asked whether he knew beforehand about the state becoming a union territory, 370 or bifurcation he said no. The follow up question was would he have informed the public if he knew to which he replied \"yes\" as he doesn't like to misguide the public or keep them in the dark. \n\nBut he knew that there were lapses in the Pulwama attack why did he keep quiet and let the public be misguided? \n\n2. Regarding the aircraft, even if they would have been provided an aircraft the CRPF personnel would  have travelled in a bus from Srinagar airport to their respective postings. \n\n3. When asked if he would have resigned if he was in place of Rajnath Singh he said yes. \n\nBut then he was the governor of J&K and the police came under him. A vehicle carrying explosives kept moving around freely shouldn't he resign if he strongly felt that this happened because of \"our\" lapses. \n\n4. He goes on to say our PM is ill-informed about J&K. Now I don't know how much Malik sir knows about J&K himself but as far as Google is concerned he served as Governor there for a year or so. \n\nSo making a claim that the PM who is advised by National Security Advisor, rest of PMO and other intelligence agencies to know less than him is reaching very far. \n\n5. PM having to go to a dhabha to take a call. \n\nSeriously he wants us to believe that? \n\n6. He himself stated that the people involved in the planning of this attack wanted to harm Modi's image and damage NDA's election campaign. \n\nLater after airstrikes they realised that they failed to create the narrative they wanted and called of other attacks which they had planned. \n\n\n\nMy honest opinion on this after the interview (writing this as otherwise people will think I am here to defend current government blindly) \n\nThese were very bold claims maid by Satyapal but the only one's I agree with is the failure of our intelligence agency and J&K police to allow so much explosives to move around in a vehicle for so many days. I believe Rajnath Singh should have resigned taking the responsibility and so should have Satya Pal Malik. \n\nThe claim Satya Pal Malik makes it feels like he is saying \"Chor to chori krenge hi aapko sambhal ke rhna hai\" \nYes I agree J&K has sensitive areas where our security personnel need to be careful but they should be able to travel inside our country safely and not just them every citizen. I believe this to be a major lapse of intelligence. \n\nYes the attacks were then turned into an election campaign but don't forget that the opposition tried to make it an issue against the government too. The narrative with less missing plots won the election. \n\n\n\nBefore replying to this please go and watch his interview again as a neutral.",
        "No one makes claims on 40 people’s sacrifice out of frustration.",
        "Amrit kaal nahin apaat kaal mein mein jee rahe hain ham sab aur hame pata bhi nahin hai.\n\nIs se phele ki sarkaron mein bhi koi amrit kaal jaise baat nahin thi.",
        "If you think this way then I'm sure you have had a great time over the last 9 years, and frankly, good for you.",
        "Why this man was quite in 2019 ? Just bcoz of his seat now he is side cornered by bjp so he is coming up with stories but without evidences and our stupid people are trusting him. Never trust a politician",
        "He was not quiet in 2019 either. Read before commenting.",
        "Let it develop. You'll see it eventually how they'll turn the tables and end up blaming him somehow."
    ],
    "cleaned_text": "alt news stunned silence primetime debate satyapal maliks explosive pulwama claims silence godi media bhakts though deafening surprising wait till truths claims uncovered interview aired april malik said prime minister narendra modi national security advisor nsa ajit doval asked remain silent pulwama attack february pointed significant failures part government agencies resulted death central reserve police force crpf men ",
    "cleaned_title": "alt news stunned silence primetime debate satyapal maliks explosive pulwama claims",
    "cleaned_selftext": "silence godi media bhakts though deafening surprising wait till truths claims uncovered interview aired april malik said prime minister narendra modi national security advisor nsa ajit doval asked remain silent pulwama attack february pointed significant failures part government agencies resulted death central reserve police force crpf men",
    "cleaned_comments": "expecting usual response cbi ed raids wire satyapal malik even didnt happen expectation interview quite good sometimes resort sensationalism however really appreciate courage man spitting facts living close zero security interviewer wished satyapals safety end hope gets attention thats anchors dont mental capacity try deflect people expecting india dead inside nationalism suits agenda theres still time isnt hearsay mean prove anything saying big stuff allegations actual ground wouldve made people think big issue watch interview generally mature democracies issues usual approach either parliamentary commission government opposition well represented investigation appointment reputed judge investigator investigate report presented parliament corruption maybe hard prove record pulwama definitely would trail request made even corruption dont think would hard find trail someone really wants happened india dont seem remember something like happened even congress time bro sincerety prove anything leading big man might come lack decision making part departmentsministry finding trail proves big man allowed happen purpose thats farfetched thing parties talk gain political mileage try influence us bits pieces full interview happened multiple times past congress noncongress led governments particular case think watch atleast ravish kumars interview malik shorter investigation matter found crpf jawans refused airplanes jk government thats lapse responsibility come light multiple parliamentary investigation committees set past google fill find list one remember separate statehood telangana example statehood telangana separate topic related creating new state comes jurisdiction parliament members must debate vote reference similar case parliamentary investigation committees formed cm pm attack state wont happen want bury issue however wait years satyapal malik would facing lot questioning post elections know inquiry commission headed retired judges riots rajiv gandhi assassinations conspiracy angle previous riots even mumbai attacks independent inquiry commission parliamentary inquiries independent inquiries headed judges pretty common westminster system idea run inquiry free direct political influence false action would already occurred malik govt knows right even prove goes court way dodge shame silence go breaking satya pal malik recently news revealing previously unknown information pulwama attack called cbi questioning april questioning allegedly reliance insurance issue like said would google find list joint committees ever set statehood within parliamentary remit defence ask investigate causes led pulwama roles played bureaucracy government come part investigation setting investigation first place sitting governor state comes allegations issue g scam issue example joint parliamentary committee set investigate scam assess roles cabinet ministers bureaucracy time upa nobody saying big man made happen purpose accusation internal failings swept rug accountability taken anyone sounds like propaganda needed releasing things right election propaganda doesnt matter whose side hahahaha almost like see future man cbi summoned hi think governor state gets type immunity several kinds case proceedings even exgoverner perk comes governor thats getting heat saying point even lead small man bjp min bangalore caught crs cash response amount middle class household consequence apathy problem confirms compliance contrast g cwg scam investigated culprits convicted though bail soon within manmohans term hell nda drag national herald case years wager bet another ed notice election case stop shocked foreign media isnt covering well getting updates anywhere reddit social media far right groups reddit silent personally timing felt shady time thought blasphemy talking pulwama negative sense emotional time patriotism peak arnab whatsapps leaked friends went crazy oh god true losing minds like movie olden times could true todays world media coverage well finally dawns empty shell media one pillars democracy shocked foreign media isnt covering well getting updates anywhere reddit social media far right groups reddit silent personally timing felt shady time thought blasphemy talking pulwama negative sense emotional time patriotism peak arnab whatsapps leaked friends went crazy oh god true losing minds like movie olden times could true todays world media coverage well finally dawns empty shell media one pillars democracy yes agree congress rule see action missing bjp era recently saw clipping article news haryana government couldnt find anything illegal land deals vadra husband priyanka gandhi like led believe bjp take action fishy end nothing illegal agree part one found accountable lost people still dont clear facts dont know people downvoting comment havent said anything wrong yet contrary belief may people downvoting constantly stating way prove anything saying havent watched interview full allegations didnt come random person came exgovernor watch interview lot questions answered exactly someone make netflix series bro people something substantial take proper action go around giving interviews action didnt see complete interview still talking dont see result talking posted questions allegations dont lead anything suspicion hearsay goes ahead uses substantial proof find wrong ill support otherwise political narrator trying gain political gains haryana even expect substantial action take ever heard whistleblowing political gains haryana listen interview dont stop posting stuff makes sense wont engaging anymore speechless one hundred percent emergency india thats thing allegations sensationalism proof even extent allegations govt didnt act intelligence tips sent soldiers road instead air hard understand expensive would every military transport done air instead road hardly grounds investigation even found investigation mean cant suspend politicians incompetence bro food thought whsitleblower whistles proof whistleblower ill watch interview ravish kumar wondering would important person india call public phone interview coming days g meet kashmir come really daft take heresay statements face value without proof case bring like couldnt made press statement guys jump government would done something still issue subreddit bjp perfectly alright ones political choice doesnt mean start lapping statement made without proof proof congress would taken person filed case ones incharge fact even hasnt happened shows proof creating sensation said anyone true heinous crime regardless position party people responsible pay crime rather worst punishment dealt true taking consideration hatred subreddit towards certain party innocent penalized take responsibility something deeply wrong abt man pm country today believe point maybe years line lot secrets abt man gon na come people generation look us really ask one question could vote man twiceprobably thrice ragedlikemilk isnt facing charges questioned witness anyways well agree sub anti india anti bjp centrist moderate ask two things anyone true heinous crime regardless position party people responsible pay crime rather worst punishment dealt think one agency today country really investigate true deal worst punishment even judiciry independent powerful days powerless institutions happened past powerful leaders like indira gandhi remember g scam coal scam came strong institutions civil society true taking consideration hatred subreddit towards certain party innocent penalized take responsibility think true satyapal malik could prove government today would sitting idle putting case misinformation fact already cbi summoned completely unrelated case timing cbi summon proves dal mein kuch kaala hai modi call dabha phone wasnt working bs would obviously satellite phones also large deployments happen road wartime planes used sorry half things said doesnt make sense probably four times sigh least came reasons yupp create propaganda mean many statements said highly illogical intellectual people sub easily understand false claims still ignore everything like cbi questioning october theyre bjp bjp good party till governor retirement modiji fascist even major gourav arya exposed yt fakir aadmi hoon kiraaye ke makaan mein rehta hoon property maine banayi nahi jitna karna tha zindagi mein kar chuka fact fact words mine yeah whatever even came nothing would happened people like would sit asses coz everyones dead inside hearsay asked keep silent isnt hearsay dont first hand knowledge reporting someone elses observation agree opinion future generations held called media accountable itll ruin us good sure tell whats point releasing also like people like anything expect ranting social media anonymously bro witness calling get information corruption done others investigating moreover old case whistle blower youtube pe interview doge youtube par hi debate milega primetime pe debate ke liye primetime pe interview dena padega respect guts speak corruption cases whistle blower also says attack happened lapses part way taking equal responsibility attack lets take look things wrong interview asked whether knew beforehand state becoming union territory bifurcation said follow question would informed public knew replied yes doesnt like misguide public keep dark knew lapses pulwama attack keep quiet let public misguided regarding aircraft even would provided aircraft crpf personnel would travelled bus srinagar airport respective postings asked would resigned place rajnath singh said yes governor jk police came vehicle carrying explosives kept moving around freely shouldnt resign strongly felt happened lapses goes say pm illinformed jk dont know much malik sir knows jk far google concerned served governor year making claim pm advised national security advisor rest pmo intelligence agencies know less reaching far pm go dhabha take call seriously wants us believe stated people involved planning attack wanted harm modis image damage ndas election campaign later airstrikes realised failed create narrative wanted called attacks planned honest opinion interview writing otherwise people think defend current government blindly bold claims maid satyapal ones agree failure intelligence agency jk police allow much explosives move around vehicle many days believe rajnath singh resigned taking responsibility satya pal malik claim satya pal malik makes feels like saying chor chori krenge hi aapko sambhal ke rhna hai yes agree jk sensitive areas security personnel need careful able travel inside country safely every citizen believe major lapse intelligence yes attacks turned election campaign dont forget opposition tried make issue government narrative less missing plots election replying please go watch interview neutral one makes claims peoples sacrifice frustration amrit kaal nahin apaat kaal mein mein jee rahe hain ham sab aur hame pata bhi nahin hai se phele ki sarkaron mein bhi koi amrit kaal jaise baat nahin thi think way im sure great time last years frankly good man quite bcoz seat side cornered bjp coming stories without evidences stupid people trusting never trust politician quiet either read commenting let develop youll see eventually theyll turn tables end blaming somehow",
    "light_cleaned_title": "Alt News: Stunned into silence? No prime-time debate on Satyapal Malik's explosive Pulwama claims",
    "light_cleaned_selftext": "The silence of both - Godi Media and Bhakts though deafening, is not surprising. Just wait till other truths about such \"claims\" are uncovered. \" In the interview aired on April 14, Malik said that Prime Minister Narendra Modi and national security advisor (NSA) Ajit Doval had asked him to remain silent when, after the Pulwama attack in February 2019, he had pointed out significant failures on the part of the government agencies which resulted in the death of 40 Central Reserve Police Force (CRPF) men.\"",
    "light_cleaned_comments": "I was expecting the usual response, CBI and ED raids on The Wire and Satyapal Malik but even that didn’t happen. Why is that expectation? The interview is quite good and sometimes it does resort to sensationalism. However really appreciate the courage of the man for spitting out facts while living with close to zero security. The interviewer himself wished for Satyapal's safety at the end. I hope it gets more attention. That's because all the anchors don't have the mental capacity to try and deflect this What were people expecting, India is dead inside Nationalism only when it suits their agenda!! There's still time. But isn't it all just hearsay? I mean, how will he prove anything? He is saying some big stuff, but these allegations have any actual \"ground\"? That would've made people think of this as a big issue Did you watch the interview? Generally in mature democracies if there are such issues, the usual approach will be either a parliamentary commission with both the government and opposition well represented in the investigation, or the appointment of a reputed judge or investigator to investigate with the report being presented in parliament. On corruption, maybe hard to prove. Because no record. Pulwama, definitely there would be a trail of request being made. Even on corruption, I don't think it would be hard to find a trail if someone really wants to. Has it happened in India before? I don't seem to remember something like that has happened even during Congress time. Bro, in all sincerety, how will you prove anything leading to the big man?? It might come out as \"lack of decision making\" on part of departments/ministry, but finding a trail that proves that big man allowed it to happen on purpose? That's very far-fetched. The only thing parties will do is talk about it and gain political mileage and try to influence us. Just the bits and pieces, not the full interview. It has happened multiple times in the past - both during Congress and non-Congress led governments. When?? Which particular case? I think you should watch atleast Ravish Kumar's interview with Malik, it's shorter. On investigation in the matter it will be found that the CRPF jawans were refused airplanes by J&K government, that's where the lapse of responsibility will come into light. Multiple parliamentary investigation committees have been set up in the past. Google and you fill find a list, there was one I remember about separate statehood for Telangana as an example. Statehood for Telangana is a separate topic. It's related to creating a new state. That comes under jurisdiction of parliament, and all the members must debate and vote for it. Do you have a reference for a similar case where parliamentary investigation committees were formed and were against a CM or PM for an attack in any state? It won't happen now, they want to bury the issue. However wait a few years and Satyapal Malik would be facing a lot of questioning post 2024 elections. I know there was a inquiry commission headed by retired judges for the 1984 riots, Rajiv Gandhi Assassination's conspiracy angle, previous riots in the 60s. Even the 2008 Mumbai attacks had an independent inquiry commission. Parliamentary inquiries and independent inquiries headed by judges is pretty common in the Westminster system that we have. The idea is to run an inquiry free from direct political influence. If it were false, some action would have already occurred against Malik. Govt knows he is right and he can even prove it if it goes in court. Only way to dodge the shame is silence. There you go: BREAKING | Satya Pal Malik, recently in the news for revealing previously unknown information on the Pulwama attack has been called in by the CBI “for questioning” on April 28. The ‘questioning’ will allegedly be on the Reliance Insurance issue. Like I said, if you would Google it you will find a list of all joint committees ever set up. As statehood is within the parliamentary remit, so is defence. The ask here is to investigate what were the causes that led to Pulwama. Any roles played by the bureaucracy or the government will come out as part of that investigation. Not setting up an investigation in the first place after the sitting governor of the state comes up with the allegations is the issue. For the 2G scam issue as an example, a joint parliamentary committee was set up to investigate the scam and assess the roles of the cabinet ministers and bureaucracy at the time of UPA. Nobody is saying the big man made it happen on purpose. The accusation is that the internal failings were swept under the rug and no accountability was taken by anyone. This sounds like propaganda. We needed this in 2019. Releasing such things right before election is propaganda, it doesn't matter whose side is it. Hahahaha - it is almost like you can see the future man. Now cbi summoned hi I think the \"Governor\" of a state gets type of \"immunity\" from several kinds of case proceedings. Even the ex-governer. It's a perk that comes with being a governor. That's why he is not getting any heat for saying all this. Point is it does not even lead to the small man. A BJP min in Bangalore is caught with 4-5crs in cash and his response is 'this is an amount from any middle class household'. No consequence. This apathy is the problem and confirms compliance. Contrast it with 2G, CWG scam those were investigated and culprits convicted (though out on bail soon after) within Manmohan's term itself. Hell all NDA does is drag National Herald case for what 10 years now. I can wager a bet, there will be another ED notice just before the election for the same case and will stop just after I am shocked foreign media isn't covering this as well. I am not getting any updates anywhere on reddit or any other social media. The other far right groups on reddit silent 😂😂 Personally for me the timing felt so shady during that time that I thought it was blasphemy talking about pulwama in a negative sense. It was an emotional time and patriotism was at its peak. Then the Arnab whatsapps were leaked and my friends and I went crazy ! Oh god it is true and now we are losing our minds. This is like the movie of olden times. How could this be true in today's world. And then no media coverage as well. It finally dawns on me how empty of a shell out media is ! One of the pillars of democracy is down ! I am shocked foreign media isn't covering this as well. I am not getting any updates anywhere on reddit or any other social media. The other far right groups on reddit silent 😂😂 Personally for me the timing felt so shady during that time that I thought it was blasphemy talking about pulwama in a negative sense. It was an emotional time and patriotism was at its peak. Then the Arnab whatsapps were leaked and my friends and I went crazy ! Oh god it is true and now we are losing our minds. This is like the movie of olden times. How could this be true in today's world. And then no media coverage as well. It finally dawns on me how empty of a shell out media is ! One of the pillars of democracy is down ! Yes, I agree with you. In Congress rule, we did see the \"action\" that is missing in BJP era. Recently, I saw a clipping of an article in the news that Haryana government couldn't find anything illegal in the land deals of Vadra (Husband of Priyanka Gandhi). It's like we were led to believe that BJP will take some action because there is some fishy, but in the end, there was nothing illegal. I agree with you on the part that no one was found \"accountable\". We lost our people, and still we don't have the clear facts. And I don't know why people are downvoting my comment? I haven't said anything wrong yet, contrary to their belief may be. People are downvoting because you are constantly stating that there is no way to prove anything after saying you haven’t watched the interview in full. The allegations didn’t come from some random person, it came from an ex-governor. Watch the interview and a lot of these questions will be answered. Exactly someone should make a Netflix series on this. Bro, again, all the people who have something \"substantial\" they take proper action and not go around giving interviews before the action. I didn't see his complete interview because he is still \"talking\". I don't see any \"result\" of his talking. I posted those questions because his allegations don't lead to anything but \"suspicion\" or \"hearsay\". If he goes ahead and uses his \"substantial\" proof to find the \"wrong\" then I'll support him. Otherwise, he is just a political narrator trying to gain political gains in Haryana. What even are you on about? What do you expect him to do? What substantial action should he take? Ever heard of whistleblowing? Political gains in Haryana? What? Listen to the interview or don’t. Stop posting stuff which makes no sense. I won’t be engaging anymore. Speechless. This is one hundred percent emergency in India. That's the thing no, his allegations are for sensationalism only. No proof for this, and further what even is the extent of the allegations , Govt didn't act on intelligence tips and sent soldiers by road instead of by Air. Not that hard to understand how expensive it would be to have every military transport done by air instead of by road. That is hardly grounds for investigation, what even will be found in the investigation i mean you can't suspend politicians for incompetence can you? Bro, just food for thought, \"whsitleblower\" whistles with proof. He is not a whistle-blower. And now I'll watch his interview with Ravish Kumar. just wondering why would the most important person in INDIA call through a public phone? The interview coming just days before G20 meet in Kashmir. Come on. Are we really that daft to take these heresay statements on face value without any proof? If that was the case, then why not bring it up then itself? It's not like he couldn't have made a press statement about this. And before you guys jump on me that the government would have done something to him, they can still do it now. The issue here is, that this subreddit is against BJP, and that is perfectly alright. It is ones political choice. But that doesn't mean that you start lapping at any statement made against them without proof. If there was proof, by now Congress would have taken this person in and filed a case against the ones incharge. The fact that even that hasn't happened, shows that there is no proof for all this, and this is just for creating sensation. While that said, if anyone of this is true, this is a heinous crime, and regardless of the position and party, the people responsible should pay for their crime rather, the worst punishment should be dealt to them. But if this is not true, and if taking this in consideration, and the hatred of this subreddit towards a certain party, the innocent are penalized, who will take the responsibility? There is something deeply wrong abt the man who is the PM of the country today, and believe me, at some point, maybe 50 years down the line, a lot of secrets abt this man are gonna come out and people of that generation will look at us and really ask just one question: How could you vote for this man twice(probably thrice)? /r/AgedLikeMilk He isn't facing any charges, he is being questioned as a witness for now anyways. Well I do agree that this sub is anti India and anti BJP . But as a centrist moderate I ask you two things > if anyone of this is true, this is a heinous crime, and regardless of the position and party, the people responsible should pay for their crime rather, the worst punishment should be dealt to them. Do you think there is one agency today in the country that can really investigate if this is true and deal them the worst punishment, even the judici@ry is not so independent and powerful these days . These powerless institutions has happened in past too when we had all powerful leaders like Indira Gandhi. Remember 2g scam , coal scam came out because of strong institutions and civil society > if this is not true, and if taking this in consideration, and the hatred of this subreddit towards a certain party, the innocent are penalized, who will take the responsibility Do you think if this was not true and if Satyapal Malik could not prove himself the government today would be sitting idle and not putting a case for misinformation. In fact already CBI has summoned for a completely unrelated case . The timing of the CBI summon proves that “Dal Mein Kuch Kaala Hai” Modi having to call from a dabha because his phone wasn't working is bs. He would obviously have satellite phones. Also, large deployments happen by road. Only in wartime planes are used. I am sorry but half the things he said doesn't make any sense. Probably four times (sigh!!!). At least it came out. We all have our own reasons. Yupp this is to create propaganda for 2024, I mean there are many statements he said which were highly illogical and there are few intellectual people in sub who can easily understand his false claims but still they will ignore everything like CBI is questioning him from October 2022 but just because they're against the BJP. For him BJP was a good party till he was governor after retirement modiji is fascist. Even major Gourav Arya has exposed him on YT \"Fakir aadmi hoon, kiraaye ke makaan mein rehta hoon, property maine banayi nahi. Jitna karna tha zindagi mein kar chuka. Fact is fact!\" His words, not mine. Yeah, whatever! Even if it came out in 2019, nothing would have happened. People like you would just sit on their asses coz everyone's dead inside! How is it hearsay when he was asked to keep silent? Isn't it hearsay only when you don't have first hand knowledge and are reporting someone else's observation? AGREE WITH YOUR OPINION The future generations will held the so called media accountable when it’ll ruin us for good Sure. Tell me, what's the point of it releasing it now? Also, it's not like people like you are doing anything expect ranting on social media anonymously. Bro he is the witness they are calling him to get information on the corruption done by others. They are not investigating him, moreover this is an old case and he himself was the whistle blower. YouTube pe interview doge to YouTube par hi debate milega... primetime pe debate ke liye primetime pe interview dena padega... I respect his guts to speak up on all the corruption cases and being a whistle blower. He also says the attack happened because of lapses in \"our\" part in a way taking equal responsibility for the attack. Now let's take a look at all the things wrong with his interview - 1. When asked whether he knew beforehand about the state becoming a union territory, 370 or bifurcation he said no. The follow up question was would he have informed the public if he knew to which he replied \"yes\" as he doesn't like to misguide the public or keep them in the dark. But he knew that there were lapses in the Pulwama attack why did he keep quiet and let the public be misguided? 2. Regarding the aircraft, even if they would have been provided an aircraft the CRPF personnel would have travelled in a bus from Srinagar airport to their respective postings. 3. When asked if he would have resigned if he was in place of Rajnath Singh he said yes. But then he was the governor of J&K and the police came under him. A vehicle carrying explosives kept moving around freely shouldn't he resign if he strongly felt that this happened because of \"our\" lapses. 4. He goes on to say our PM is ill-informed about J&K. Now I don't know how much Malik sir knows about J&K himself but as far as Google is concerned he served as Governor there for a year or so. So making a claim that the PM who is advised by National Security Advisor, rest of PMO and other intelligence agencies to know less than him is reaching very far. 5. PM having to go to a dhabha to take a call. Seriously he wants us to believe that? 6. He himself stated that the people involved in the planning of this attack wanted to harm Modi's image and damage NDA's election campaign. Later after airstrikes they realised that they failed to create the narrative they wanted and called of other attacks which they had planned. My honest opinion on this after the interview (writing this as otherwise people will think I am here to defend current government blindly) These were very bold claims maid by Satyapal but the only one's I agree with is the failure of our intelligence agency and J&K police to allow so much explosives to move around in a vehicle for so many days. I believe Rajnath Singh should have resigned taking the responsibility and so should have Satya Pal Malik. The claim Satya Pal Malik makes it feels like he is saying \"Chor to chori krenge hi aapko sambhal ke rhna hai\" Yes I agree J&K has sensitive areas where our security personnel need to be careful but they should be able to travel inside our country safely and not just them every citizen. I believe this to be a major lapse of intelligence. Yes the attacks were then turned into an election campaign but don't forget that the opposition tried to make it an issue against the government too. The narrative with less missing plots won the election. Before replying to this please go and watch his interview again as a neutral. No one makes claims on 40 people’s sacrifice out of frustration. Amrit kaal nahin apaat kaal mein mein jee rahe hain ham sab aur hame pata bhi nahin hai. Is se phele ki sarkaron mein bhi koi amrit kaal jaise baat nahin thi. If you think this way then I'm sure you have had a great time over the last 9 years, and frankly, good for you. Why this man was quite in 2019 ? Just bcoz of his seat now he is side cornered by bjp so he is coming up with stories but without evidences and our stupid people are trusting him. Never trust a politician He was not quiet in 2019 either. Read before commenting. Let it develop. You'll see it eventually how they'll turn the tables and end up blaming him somehow."
}