{
    "id": "13xiym7",
    "title": "Where do you guys buy Academic books?",
    "url": "https://www.reddit.com/r/india/comments/13xiym7/where_do_you_guys_buy_academic_books/",
    "selftext": "Recently, I brought some physics books from Amazon as well as flipkart. I have done lot of research on these books before buying them and bought what I thought were the best books, but it turns out while browsing for books, Google Shopping doesn't work that well and leaves products from many smaller websites out of the search results. \nSo, long story short, I buy 4k worth of books from Amazon and Flipkart only to realize that they were available for cheaper at buybooksindia.com (cheaper by 400 rs), had I know about this previously, I would have brought it in there itself. So what else am I missing? \n\nAlso, many books I wanted were unavailable on Amazon and flipkart but available elsewhere\n\nPS: https://www.indiabookstore.net [This can help you browse through many websites]\n\nMy list,\n1. https://www.buybooksindia.com/\n2. https://www.bookswagon.com/\n3. \n\nWhat websites do you browse through to buy books(Academic)?",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 3,
    "created_utc": 1685629516.0,
    "convurl": "https://external-preview.redd.it/qGt2bnrcJ1Abph5O0VfI5px8BP2RpNwp5wp6as5dTXE.jpg?auto=webp&v=enabled&s=704e76413c49aad9e8457eb7e070b951746d9a06",
    "comments": [
        "There is one madras publication",
        "hmm interesting! thank you!"
    ],
    "cleaned_text": "guys buy academic books recently brought physics books amazon well flipkart done lot research books buying bought thought best books turns browsing books google shopping doesnt work well leaves products many smaller websites search results long story short buy k worth books amazon flipkart realize available cheaper buybooksindiacom cheaper rs know previously would brought else missing also many books wanted unavailable amazon flipkart available elsewhere ps help browse many websites list websites browse buy booksacademic ",
    "cleaned_title": "guys buy academic books",
    "cleaned_selftext": "recently brought physics books amazon well flipkart done lot research books buying bought thought best books turns browsing books google shopping doesnt work well leaves products many smaller websites search results long story short buy k worth books amazon flipkart realize available cheaper buybooksindiacom cheaper rs know previously would brought else missing also many books wanted unavailable amazon flipkart available elsewhere ps help browse many websites list websites browse buy booksacademic",
    "cleaned_comments": "one madras publication hmm interesting thank",
    "light_cleaned_title": "Where do you guys buy Academic books?",
    "light_cleaned_selftext": "Recently, I brought some physics books from Amazon as well as flipkart. I have done lot of research on these books before buying them and bought what I thought were the best books, but it turns out while browsing for books, Google Shopping doesn't work that well and leaves products from many smaller websites out of the search results. So, long story short, I buy 4k worth of books from Amazon and Flipkart only to realize that they were available for cheaper at buybooksindia.com (cheaper by 400 rs), had I know about this previously, I would have brought it in there itself. So what else am I missing? Also, many books I wanted were unavailable on Amazon and flipkart but available elsewhere PS: [This can help you browse through many websites] My list, 1. 2. 3. What websites do you browse through to buy books(Academic)?",
    "light_cleaned_comments": "There is one madras publication hmm interesting! thank you!"
}