{
    "id": "16j68cl",
    "title": "Emergency Alert testing ?!",
    "url": "https://i.redd.it/mzoh0sgpbdob1.jpg",
    "selftext": "Saw this today, first one came in English and the second one came in Hindi, should I be worried?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694761383.0,
    "convurl": "https://i.redd.it/mzoh0sgpbdob1.jpg",
    "comments": [
        "it says testing, why should you be worried?",
        "Coming on my phone and my colleague's too.",
        "It came on my phone too, it's just testing the system to alert all of the citizens in case of an actual emergency. It was just for testing purposes, so don't mind about it. It's actually quite nice that we have such a system.",
        "I got one too. It spooked me lol",
        "Be worried.",
        "it says production, you should be worried.",
        "Am I the only one who didn't get this?",
        "care to explain?",
        "No.",
        "Why am I not getting this shit, MP walo ke sath yahan bhi bhedbhav",
        "Syyysteem hack"
    ],
    "cleaned_text": "emergency alert testing saw today first one came english second one came hindi worried ",
    "cleaned_title": "emergency alert testing",
    "cleaned_selftext": "saw today first one came english second one came hindi worried",
    "cleaned_comments": "says testing worried coming phone colleagues came phone testing system alert citizens case actual emergency testing purposes dont mind actually quite nice system got one spooked lol worried says production worried one didnt get care explain getting shit mp walo ke sath yahan bhi bhedbhav syyysteem hack",
    "light_cleaned_title": "Emergency Alert testing ?!",
    "light_cleaned_selftext": "Saw this today, first one came in English and the second one came in Hindi, should I be worried?",
    "light_cleaned_comments": "it says testing, why should you be worried? Coming on my phone and my colleague's too. It came on my phone too, it's just testing the system to alert all of the citizens in case of an actual emergency. It was just for testing purposes, so don't mind about it. It's actually quite nice that we have such a system. I got one too. It spooked me lol Be worried. it says production, you should be worried. Am I the only one who didn't get this? care to explain? No. Why am I not getting this shit, MP walo ke sath yahan bhi bhedbhav Syyysteem hack"
}