{
    "id": "1dqp4hv",
    "title": "“5th In 9 Days\": Bihar Bridge, Under Construction For 4 Years, Collapses [ and a rant from me below ]",
    "url": "https://www.ndtv.com/india-news/under-construction-bridge-collapses-in-bihar-5th-incident-in-9-days-5991861",
    "selftext": "Another day another bridge collapses.\n\nTax payers (all people pay either directly/indirectly or both) including in this country get nothing.\n\nYou are lucky at the end of the day if you survive.\n\nA bridge might fall, a roof might fall, a billboard might fall, someone might run you over and get released after writing an essay, a train may collide and crush you or you might get lynched too..\n\nIf youre that lucky then Pollution, Heat, Taxes, Traffic, Adulterated Spices , Carcinogens, Dead insects in your chocolate syrup, Sub-standard drugs, paper leaks among many other things will make sure you are f*%*#$….\n\nIf youre so lucky then your life is one layoff away, no social security will put you on the street especially if you are living in Metro cities…\n\nLastly if youre extremely lucky then the govt will make sure you will not have the freedom and liberties guaranteed to you in the constitution. \n\nYou cant wear eat pray what you want…and love marry whom you want..you cant watch what you want and the creator you like…its censored, your life is censored.\n\nAnd lastly if youre extremely unlucky, then you jusy have to be a muslim in this country , no need of all the above.\n\nEnjoy while it lasts, be thankful and grateful to the govt you got another day to live.\n\n",
    "flair": "Rant / Vent",
    "score": 286,
    "num_comments": 40,
    "created_utc": 1719595439,
    "convurl": "https://external-preview.redd.it/rBC_gX8MhJH2mCXjLVViZEkGHK3SyUBcUDExxD2MhAc.jpg?auto=webp&s=f358588bc47d20f2cd6e75d34f880246bd624a4f",
    "comments": [
        "We are in the promised land.",
        "Bihar breaking all the records. Someone call the guinness world record team xD",
        "For those wondering why South Indian states rant about tax devolution, here’s the answer :\n\nFor every 100 rupees paid in direct taxes : Bihar ( similarly its neighbouring states)  gets 922 rupees and Maharashtra , Karnataka get something like 7 rupees and 13 rupees respectively \n\nIt’s not like we dont want the development of other states especially the poorer ones and we are more than happy to help, but where is the money flowing? Where is the accountability? Have their Human development indices improved? Has their per capita improved? Has poverty decreased? Have more schools been built? Etc etc\n\nIts not like we South Indians are living in a lala land and our situation is somehow utopian in absolute terms but in relative terms South states are farrrrrrrrrrrrrrr better than their northern counterparts.",
        "Bihar is conspiring something we don't know with these -ground- bridge breaking world records.",
        "Why in your opinion southern states tend to do better than northern states? Maybe because they had ports and trade flourished there much earlier and they thus became an evolved society, lol idk just taking a wild guess.",
        "The students here are civil engineers in Bihar today\n\nhttps://preview.redd.it/fhs0udhaoc9d1.jpeg?width=647&format=pjpg&auto=webp&s=317a6191c5ec44fcaf53ce8cd4bb75b70f334416",
        "Another day, another wastage of taxpayers money.\n\nhttps://i.redd.it/eodhr85esc9d1.gif",
        "Thank god that building is able to bear the weight of sooooo manyyyyyyyyyy students🙏",
        "Perfect timeline too. This was in 2014-15. 10th Bihar Board exams. Parents \"Helping\" their children.",
        "I think in bihar they make bridges with sand and spit, instead of concrete and steel",
        "My village has people who have apparently scored 99 percentile, and these people can't write an application in English to save their lives. And one suce person is pursuing MBA from a top govt institute.\nOne such person had their clat test manipulated and now they're pursuing a 5 year joint llb course from again a top (non nlu) govt college .\n\nBoth candidates have their parents working as district level presidents in BJ potty and can't write English properly.\n\nThis is from purvanchal.",
        "Make one bridge GDP goes 7%\nMake 2 bridges GDP goes 8%\n\nIf same bridge made again and again GDP becomes 15%\n\nProtect nature, save money, more the IAS CM mantri earns more they spend during erekshuns time, more alcohol is distributed for votes, more jobs created for doctors (whose fathers are ias ips policemen netaji contractor).",
        "Ayyy IRS",
        "Satya vachan",
        "They keep voting for BJP and Nitish despite everything. 20 years now. Voted again in LS and made Modi PM again. No wonder the state is in this state now lol. Deserves it.",
        "They didn’t put enough Hauk Tuah on that thang.",
        "i am not ever having kids until i see solid hope of this regime falling. this shit ends with me. ",
        "Google map needs a new feature - avoid bridges in Bihar.",
        "Double engine government",
        "Is it 922 or 9.22 sorry I wants to know that",
        "Because of some bhakt young generation future is already started collapsing ",
        "Ek aur ho jaye to aadha dozen ho jaayega!!!!!! 🤣🤣",
        "What India is to the world Bihar is to India.",
        "We get 9x of what we give.",
        "This is absolutely unfair.",
        "Gutkha khake bridge me thukta hai tabhi to bridge strong hoti hai. Iss bar gutkha supply kam ho gya lagta hai",
        "This is all happening because bjp didnt get 400 paar.\n\n\nIf they had more seats they would be able to fix everything and we will get Ram Rajya",
        "People ask what can you do for your country, nobody, not even once, ever asks what the country can do for you.",
        "If you ask you will be labelled anti-national …..😢\n\nOh the irony",
        "There is rationality in paying more to undeveloped states but holy shit 80 years of this should make it obvious the system is a failure. There is zero expectation of seeing development in return. At this IMF is more sane mandating goals to a country in return for aid.",
        "And these are people whom UPSC gives an advantage with hindi medium question book and putting non Hindi speakers at a disadvantage. This is the realm which non-hindi educated states have to swear fealty to. Dalli as the country capital ensured the failure of \"independent\" India which is just replacing British with North Indians",
        "Nitish was an engineer vro.\n\nNot like that's the default path",
        "Well Ram constructed a private DIY bridge with his friends' help, which is probably a better option nowadays than relying on the government.",
        "I see that a lot of the popele here have brought politics to this discussion, rightfully so, but unless we have bureaucratic accountability in this country, a lot more of these things will fall, break, People will die, and we will remain a mere statistic, while the corrupt babus will fill their pockets, and get richer\n\nThere is a reason why even PHD wants to apply for peons  job in the government service, and we all know the reasons why…..\n\nRemember, the politicians can be changed every 5 years, or even sooner, try getting one babu to be accountable and you will understand where the mess lies in",
        "Bihar is the most corrupt state, contractors are mostly choosen on caste / religion basis , credit to the dirty Bihar politics and general social condition of people of Bihar. Nonrules are followed there, that's y bridges collapse. All these tenders are a way to engulf money. Never ever a govt. Chooses the contractor correctly. The method needs reform.",
        "Caste politics every where , this is prime example.",
        "Last election was a true battle of margins in Bihar, we tend to forget that the Bihar government's margin of majority is so small that the number of seats Hindustan Awam Morcha has is the difference between majority and no majority",
        "Saar that's UP.... And bihar",
        "Stoopid government putting restrictions on gutkha",
        "I think we should all unite and do something about this. If all taxpayers unite, it should make a difference. "
    ],
    "cleaned_text": "th days bihar bridge construction years collapses rant another day another bridge collapses tax payers people pay either directlyindirectly including country get nothing lucky end day survive bridge might fall roof might fall billboard might fall someone might run get released writing essay train may collide crush might get lynched youre lucky pollution heat taxes traffic adulterated spices carcinogens dead insects chocolate syrup substandard drugs paper leaks among many things make sure f youre lucky life one layoff away social security put street especially living metro cities lastly youre extremely lucky govt make sure freedom liberties guaranteed constitution cant wear eat pray wantand love marry wantyou cant watch want creator likeits censored life censored lastly youre extremely unlucky jusy muslim country need enjoy lasts thankful grateful govt got another day live ",
    "cleaned_title": "th days bihar bridge construction years collapses rant",
    "cleaned_selftext": "another day another bridge collapses tax payers people pay either directlyindirectly including country get nothing lucky end day survive bridge might fall roof might fall billboard might fall someone might run get released writing essay train may collide crush might get lynched youre lucky pollution heat taxes traffic adulterated spices carcinogens dead insects chocolate syrup substandard drugs paper leaks among many things make sure f youre lucky life one layoff away social security put street especially living metro cities lastly youre extremely lucky govt make sure freedom liberties guaranteed constitution cant wear eat pray wantand love marry wantyou cant watch want creator likeits censored life censored lastly youre extremely unlucky jusy muslim country need enjoy lasts thankful grateful govt got another day live",
    "cleaned_comments": "promised land bihar breaking records someone call guinness world record team xd wondering south indian states rant tax devolution heres answer every rupees paid direct taxes bihar similarly neighbouring states gets rupees maharashtra karnataka get something like rupees rupees respectively like dont want development states especially poorer ones happy help money flowing accountability human development indices improved per capita improved poverty decreased schools built etc etc like south indians living lala land situation somehow utopian absolute terms relative terms south states farrrrrrrrrrrrrrr better northern counterparts bihar conspiring something dont know ground bridge breaking world records opinion southern states tend better northern states maybe ports trade flourished much earlier thus became evolved society lol idk taking wild guess students civil engineers bihar today another day another wastage taxpayers money thank god building able bear weight sooooo manyyyyyyyyyy students perfect timeline th bihar board exams parents helping children think bihar make bridges sand spit instead concrete steel village people apparently scored percentile people cant write application english save lives one suce person pursuing mba top govt institute one person clat test manipulated theyre pursuing year joint llb course top non nlu govt college candidates parents working district level presidents bj potty cant write english properly purvanchal make one bridge gdp goes make bridges gdp goes bridge made gdp becomes protect nature save money ias cm mantri earns spend erekshuns time alcohol distributed votes jobs created doctors whose fathers ias ips policemen netaji contractor ayyy irs satya vachan keep voting bjp nitish despite everything years voted ls made modi pm wonder state state lol deserves didnt put enough hauk tuah thang ever kids see solid hope regime falling shit ends google map needs new feature avoid bridges bihar double engine government sorry wants know bhakt young generation future already started collapsing ek aur ho jaye aadha dozen ho jaayega india world bihar india get x give absolutely unfair gutkha khake bridge thukta hai tabhi bridge strong hoti hai iss bar gutkha supply kam ho gya lagta hai happening bjp didnt get paar seats would able fix everything get ram rajya people ask country nobody even ever asks country ask labelled antinational oh irony rationality paying undeveloped states holy shit years make obvious system failure zero expectation seeing development return imf sane mandating goals country return aid people upsc gives advantage hindi medium question book putting non hindi speakers disadvantage realm nonhindi educated states swear fealty dalli country capital ensured failure independent india replacing british north indians nitish engineer vro like thats default path well ram constructed private diy bridge friends help probably better option nowadays relying government see lot popele brought politics discussion rightfully unless bureaucratic accountability country lot things fall break people die remain mere statistic corrupt babus fill pockets get richer reason even phd wants apply peons job government service know reasons remember politicians changed every years even sooner try getting one babu accountable understand mess lies bihar corrupt state contractors mostly choosen caste religion basis credit dirty bihar politics general social condition people bihar nonrules followed thats bridges collapse tenders way engulf money never ever govt chooses contractor correctly method needs reform caste politics every prime example last election true battle margins bihar tend forget bihar governments margin majority small number seats hindustan awam morcha difference majority majority saar thats bihar stoopid government putting restrictions gutkha think unite something taxpayers unite make difference",
    "light_cleaned_title": "“5th In 9 Days\": Bihar Bridge, Under Construction For 4 Years, Collapses [ and a rant from me below ]",
    "light_cleaned_selftext": "Another day another bridge collapses. Tax payers (all people pay either directly/indirectly or both) including in this country get nothing. You are lucky at the end of the day if you survive. A bridge might fall, a roof might fall, a billboard might fall, someone might run you over and get released after writing an essay, a train may collide and crush you or you might get lynched too.. If youre that lucky then Pollution, Heat, Taxes, Traffic, Adulterated Spices , Carcinogens, Dead insects in your chocolate syrup, Sub-standard drugs, paper leaks among many other things will make sure you are f*%*#$…. If youre so lucky then your life is one layoff away, no social security will put you on the street especially if you are living in Metro cities… Lastly if youre extremely lucky then the govt will make sure you will not have the freedom and liberties guaranteed to you in the constitution. You cant wear eat pray what you want…and love marry whom you want..you cant watch what you want and the creator you like…its censored, your life is censored. And lastly if youre extremely unlucky, then you jusy have to be a muslim in this country , no need of all the above. Enjoy while it lasts, be thankful and grateful to the govt you got another day to live.",
    "light_cleaned_comments": "We are in the promised land. Bihar breaking all the records. Someone call the guinness world record team xD For those wondering why South Indian states rant about tax devolution, here’s the answer : For every 100 rupees paid in direct taxes : Bihar ( similarly its neighbouring states) gets 922 rupees and Maharashtra , Karnataka get something like 7 rupees and 13 rupees respectively It’s not like we dont want the development of other states especially the poorer ones and we are more than happy to help, but where is the money flowing? Where is the accountability? Have their Human development indices improved? Has their per capita improved? Has poverty decreased? Have more schools been built? Etc etc Its not like we South Indians are living in a lala land and our situation is somehow utopian in absolute terms but in relative terms South states are farrrrrrrrrrrrrrr better than their northern counterparts. Bihar is conspiring something we don't know with these -ground- bridge breaking world records. Why in your opinion southern states tend to do better than northern states? Maybe because they had ports and trade flourished there much earlier and they thus became an evolved society, lol idk just taking a wild guess. The students here are civil engineers in Bihar today Another day, another wastage of taxpayers money. Thank god that building is able to bear the weight of sooooo manyyyyyyyyyy students🙏 Perfect timeline too. This was in 2014-15. 10th Bihar Board exams. Parents \"Helping\" their children. I think in bihar they make bridges with sand and spit, instead of concrete and steel My village has people who have apparently scored 99 percentile, and these people can't write an application in English to save their lives. And one suce person is pursuing MBA from a top govt institute. One such person had their clat test manipulated and now they're pursuing a 5 year joint llb course from again a top (non nlu) govt college . Both candidates have their parents working as district level presidents in BJ potty and can't write English properly. This is from purvanchal. Make one bridge GDP goes 7% Make 2 bridges GDP goes 8% If same bridge made again and again GDP becomes 15% Protect nature, save money, more the IAS CM mantri earns more they spend during erekshuns time, more alcohol is distributed for votes, more jobs created for doctors (whose fathers are ias ips policemen netaji contractor). Ayyy IRS Satya vachan They keep voting for BJP and Nitish despite everything. 20 years now. Voted again in LS and made Modi PM again. No wonder the state is in this state now lol. Deserves it. They didn’t put enough Hauk Tuah on that thang. i am not ever having kids until i see solid hope of this regime falling. this shit ends with me. Google map needs a new feature - avoid bridges in Bihar. Double engine government Is it 922 or 9.22 sorry I wants to know that Because of some bhakt young generation future is already started collapsing Ek aur ho jaye to aadha dozen ho jaayega!!!!!! 🤣🤣 What India is to the world Bihar is to India. We get 9x of what we give. This is absolutely unfair. Gutkha khake bridge me thukta hai tabhi to bridge strong hoti hai. Iss bar gutkha supply kam ho gya lagta hai This is all happening because bjp didnt get 400 paar. If they had more seats they would be able to fix everything and we will get Ram Rajya People ask what can you do for your country, nobody, not even once, ever asks what the country can do for you. If you ask you will be labelled anti-national …..😢 Oh the irony There is rationality in paying more to undeveloped states but holy shit 80 years of this should make it obvious the system is a failure. There is zero expectation of seeing development in return. At this IMF is more sane mandating goals to a country in return for aid. And these are people whom UPSC gives an advantage with hindi medium question book and putting non Hindi speakers at a disadvantage. This is the realm which non-hindi educated states have to swear fealty to. Dalli as the country capital ensured the failure of \"independent\" India which is just replacing British with North Indians Nitish was an engineer vro. Not like that's the default path Well Ram constructed a private DIY bridge with his friends' help, which is probably a better option nowadays than relying on the government. I see that a lot of the popele here have brought politics to this discussion, rightfully so, but unless we have bureaucratic accountability in this country, a lot more of these things will fall, break, People will die, and we will remain a mere statistic, while the corrupt babus will fill their pockets, and get richer There is a reason why even PHD wants to apply for peons job in the government service, and we all know the reasons why….. Remember, the politicians can be changed every 5 years, or even sooner, try getting one babu to be accountable and you will understand where the mess lies in Bihar is the most corrupt state, contractors are mostly choosen on caste / religion basis , credit to the dirty Bihar politics and general social condition of people of Bihar. Nonrules are followed there, that's y bridges collapse. All these tenders are a way to engulf money. Never ever a govt. Chooses the contractor correctly. The method needs reform. Caste politics every where , this is prime example. Last election was a true battle of margins in Bihar, we tend to forget that the Bihar government's margin of majority is so small that the number of seats Hindustan Awam Morcha has is the difference between majority and no majority Saar that's UP.... And bihar Stoopid government putting restrictions on gutkha I think we should all unite and do something about this. If all taxpayers unite, it should make a difference."
}