{
    "id": "18wh85h",
    "title": "Tanker drivers stop work in Maharashtra to protest new law on hit-and-run cases, fuel supply hit",
    "url": "https://www.deccanherald.com/india/maharashtra/tanker-drivers-stop-work-in-maharashtra-to-protest-new-law-on-hit-and-run-cases-fuel-supply-hit-2831446",
    "selftext": "This is ridiculous, makes me wonder how often these truck drivers just hit and run that makes them worry so much about a fine.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1704171941.0,
    "convurl": "https://external-preview.redd.it/2HIgUslJIn2iSu4HEROuqvJ7MvEjSLD94yfBi3fBhEA.jpg?auto=webp&s=1fa257fde0a3befea20ff13f3ac6bf24f5bf797e",
    "comments": [
        ">  \"As per the new law, the hit-and- run cases can attract up to 10 years jail term and a fine of Rs 7 lakh. We are drivers, how can we furnish such a big fine amount?\"\n\nDid most of them become tanker drivers to have the 'freedom' of hit-and-run? Lmao",
        "Stupid laws. They are not letting and kill people or break their tiny tiny cars. Roads hamaara bhaap ka hy. Let us be aholes or WE PROTEST\n\n-Trucky.",
        "Probably a stupid question but isn't insurance there for this very purpose? They pay out for any victims as well right?",
        "Sabko Salman Khan banna hai",
        "**Canadian Truckers Protest Edition Let's Go**",
        "jiske pas power hai uske pas free pass hai. Thakurs for example. Fairness ki maa ki aankh. Jisse govt darti hai uski chalti huch hai.",
        "These are huge queues in my city for fuel... Dunno how long this strike will last",
        "That's the issue, they cannot strike people down and run away without a fine anymore /s",
        "Yes but most of the truckers won't have a policy.",
        "You do remember what happened to the Canadian Truckers, right? If our government did something like that, a lot of knickers would get twisted.",
        "Yep",
        "No one kill anyone, accidens happen",
        "Let them be unemployed, high time law and order is enforced strictly in this country",
        "I think it's much more nuanced than you are making out to be. \n\nIn every accident, the general sentiment is that the 'bigger' vehicle is at fault. The law states that if they actually flee after an accident, they will be subjected to 7 lakhs or 10 Lakhs  of fine. \n\nIn the real world if they _don't_ flee, the public will lynch them whether they are at fault or not. \n\nI completely agree that some truck/bus drivers are extremely reckless and even drive under influence, but it's uncommon to see a car or a two wheeler making a mistake, and colliding with a bigger vehicle. According to the drivers if they had 7 lakhs with them they wouldn't be drivers in the first place. \n\nI will not pretend to know the ground reality, but what I will say is it's not as black and white and it requires both reconsideration on the law, and giving a proper explanation to the drivers by the relevant authorities",
        "Is any change based on actual data driven decision making anymore or is it just fuck it, \"change this, change that, make it look good and rhyme\"?\n\nWhat was the penalty before, where there lots of cases before, if exists brainstorm on how to fix the issue, etc. should be a starting point for any change.",
        "Is any change based on actual data driven decision making anymore or is it just fuck it, \"change this, change that, make it look good and rhyme\"?\n\nWhat was the penalty before, were there lots of cases before, if yes brainstorm on how to fix the issue, etc. should be a starting point for any change.",
        "All good points. The deeper issue is, as you can expect, not different from deeper issues with any kind of job in India - no protections, long hours, difficult working enviorment, low pay and so on. \n\nTrucking doesnt earn you a lot of money, but its something you can do with minimum education and a drivers license. \n\nThis law aims to punish truckers without addressing any of their work related struggles. With better pay, and lesser transport related hurdles etc we can reduce the need for truckers to rush transporting goods.",
        "If India did it western politicians would start huffing and puffing.",
        "> we are tank drivers. How can we pay such a big amount?\n\nSounds like these Mfs know they are going to hit and run. I'd like the sentence to be extended to 20 years with a permanent loss of licence. Compensation to be set to a minimum of inr 1.5 million.",
        "This is the actual problem. We sensationally report and read only headlines. \n\nThe problem is how it will be proved. Accidents are always seen as a fault of the bigger vehicle or the survivors fault. And we always avoid the contributing factors- like an auto or scooter will hit a car, and it will be cars fault even if they had no headlights on or were driving on wrong side in the scooter",
        "I think the bigger problem is irrespective of whose fault it is - when an accident happens, what should the driver do? If he stays there, the public will most likely lynch him ('bigger vehicle is always at fault' mentality).\n\nIf he flees, the Govt will register a hit and run case against him and fine 7 Lakhs. \n\nWhether the insurance comes into play or not is a secondary conversation. Right now the main issue is should the drivers preserve their life or freedom? \n\n(Not taking any sides here. Drivers who are reckless, under the influence or otherwise careless _should_ be punished to the full extent of the law)",
        "There should be a law for angry public who believe that only drivers of heavy vehicles are at fault and vandalize vehicles and lynch drivers. The penalty is too high for someone who barely makes 20k a month. No wonder they're on strike.",
        "The laws applicable to non-commercial vehicle drivers cannot be applied to truckers. Truckers barely make 20 - 30k a month to pay 7 lakh as penalty. Pedestrians turn into mobs and blame the heavy vehicle without considering the facts, in that case considering how civil these pedestrians (mobs) are, their protest makes sense. \n\nFirst, make strict regulations for vehicles not following traffic rules (there was a rant post here a while back about the general behavior of road users); second, they need to address the general behaviour of public who engage in mob behavior assaulting drivers and vandalize their vehicles before editing this law.",
        "Mob justice is a problem. However, a sentence or compensation isn't decided based on the income of the criminal. It's decided based on the damages to the victim or aggrieved party. \n\nIndia should push for insurance and licensing requirements for trucking. As for the argument that reforms will jack up logistics, I don't see this playing out in other nations. India isn't an exception. Sectors and industries need to formalize.",
        "Fair points. Yes insurance and licensing requirements need to be forced for trucking.",
        "Drive to the nearest police station maybe",
        "Sure but the drivers can always voluntarily drive over to the police station instead of disappearing",
        "The whole problem is they just disappear after killing someone, and the victims family never gets justice or is compensated by third party insurance",
        "seems like enforcement of existing laws may prevent the need of these additional laws",
        "What do you mean by Thakurs?",
        "This is not joke, in non-urban areas or atleast in states like Bihar, if you stay on the spot after accident, you'll be lynched.",
        "Its the reason why govt wont touch brij bhushan. Thakurs hold the power in UP. Losing Thakur support equals losing UP.",
        "Do you think only Brij Bhushan is Thakur in UP? Brij Bhushan is a goon and He must have done dirty jobs for BJP. This is not a caste issue.",
        "bhaiya ji ye voh wala Tank nahi hai.",
        "during covid there was a video which went viral where police from Palghar came under public pressure and released two innocent sadhus to be lynched by the public...if I'm a trucker I'm not taking that risk..",
        "You wouldn't be singing that tune if some truck runs over your family while the driver is half drunk and driving at 100+ Km/h",
        " Commenting here just to clarify as some people don't seem to understand the concept of fine in cases. The Act mentions no specific amount of fine.\n\nEven if we take their argument of 10 lakh fine into account, that doesn't mean if the driver gets convicted, he'll have to pay 10 lakh rupees. The Court takes the financial status of the accused into account while deciding the quantum of fine. Otherwise even if you impose 10L fine on a driver earning 5k a month, how would that fine even be recovered?",
        "How about driving carefully?",
        "So they want license to kill?",
        "How many times have you heard news of a car or a bike colliding with a truck due to overspeding or rash driving?",
        "It's evident from the video who's at fault \n\nTruck drivers are mostly drunk at night",
        "You must be really dense to think that accidents can only be attributed to truck drivers and there can't be other factors where they may not be at fault.",
        "There are many accidents because of cars and two wheelers\n\nIdiots forget that a 10 ton vehicle takes time to brake and even a slight collision with it will turn your car into a sandwich \n\nBut the car drivers get the blame unlike truck drivers who want to protest",
        "Out govt does a lot already",
        "I remember the amount of restraint the government showed against the Farm Laws protesters.",
        "Their problem is if they stop, public lynch them due to “big vehicle mistake” rule of our mob.",
        "Bro trying gujrat. You can find literal cows on the road with people driving 100. You hit you ded",
        "If he was just a goon bjp would have \"taken care of him\". iykwim. \n\nBut they didn't and let their image take hit. Because keeping in order to keep UP, thakur support is essential. Thats why thakurs are being installed in powerful positions there.",
        "High time for SBI to sponsor some loans for Hit and run cases",
        "You don't know nothing about UP then. If Thakurs have the Highest population then why wouldn't they get representation? What do you mean by installing? They are elected members. Just like I previously said, There are much bigger Thakur leaders then him but he have some \"edge\" over BJP. Also your last line is hella condescending, You don't have to always villainize us.",
        "One of these fuckers drunk drove over my mom. Ran away from the scene. No justice. Fuck these guys",
        "I am sorry to hear that, I hope you are taking it well",
        "It’s not about fine . I have seen how people treat truck drivers even in minor altercations . If they stay on the spot they will die. And since most of them are poor there’s little chance of justice afterwards . If I was one I’m running away even with the law . They almost always abandon truck and run .",
        "That’s the incompetence of law enforcement which won’t be fixed by this law . They can still run away and if the police doesn’t find them - what’s the point ?",
        "There is  speed limit and what is the traffic police is for, to check the drunk drivers,  \n10 lakh fine ? What about insurance then"
    ],
    "cleaned_text": "tanker drivers stop work maharashtra protest new law hitandrun cases fuel supply hit ridiculous makes wonder often truck drivers hit run makes worry much fine ",
    "cleaned_title": "tanker drivers stop work maharashtra protest new law hitandrun cases fuel supply hit",
    "cleaned_selftext": "ridiculous makes wonder often truck drivers hit run makes worry much fine",
    "cleaned_comments": "per new law hitand run cases attract years jail term fine rs lakh drivers furnish big fine amount become tanker drivers freedom hitandrun lmao stupid laws letting kill people break tiny tiny cars roads hamaara bhaap ka hy let us aholes protest trucky probably stupid question isnt insurance purpose pay victims well right sabko salman khan banna hai canadian truckers protest edition lets go jiske pas power hai uske pas free pass hai thakurs example fairness ki maa ki aankh jisse govt darti hai uski chalti huch hai huge queues city fuel dunno long strike last thats issue strike people run away without fine anymore yes truckers wont policy remember happened canadian truckers right government something like lot knickers would get twisted yep one kill anyone accidens happen let unemployed high time law order enforced strictly country think much nuanced making every accident general sentiment bigger vehicle fault law states actually flee accident subjected lakhs lakhs fine real world dont flee public lynch whether fault completely agree truckbus drivers extremely reckless even drive influence uncommon see car two wheeler making mistake colliding bigger vehicle according drivers lakhs wouldnt drivers first place pretend know ground reality say black white requires reconsideration law giving proper explanation drivers relevant authorities change based actual data driven decision making anymore fuck change change make look good rhyme penalty lots cases exists brainstorm fix issue etc starting point change change based actual data driven decision making anymore fuck change change make look good rhyme penalty lots cases yes brainstorm fix issue etc starting point change good points deeper issue expect different deeper issues kind job india protections long hours difficult working enviorment low pay trucking doesnt earn lot money something minimum education drivers license law aims punish truckers without addressing work related struggles better pay lesser transport related hurdles etc reduce need truckers rush transporting goods india western politicians would start huffing puffing tank drivers pay big amount sounds like mfs know going hit run id like sentence extended years permanent loss licence compensation set minimum inr million actual problem sensationally report read headlines problem proved accidents always seen fault bigger vehicle survivors fault always avoid contributing factors like auto scooter hit car cars fault even headlights driving wrong side scooter think bigger problem irrespective whose fault accident happens driver stays public likely lynch bigger vehicle always fault mentality flees govt register hit run case fine lakhs whether insurance comes play secondary conversation right main issue drivers preserve life freedom taking sides drivers reckless influence otherwise careless punished full extent law law angry public believe drivers heavy vehicles fault vandalize vehicles lynch drivers penalty high someone barely makes k month wonder theyre strike laws applicable noncommercial vehicle drivers applied truckers truckers barely make k month pay lakh penalty pedestrians turn mobs blame heavy vehicle without considering facts case considering civil pedestrians mobs protest makes sense first make strict regulations vehicles following traffic rules rant post back general behavior road users second need address general behaviour public engage mob behavior assaulting drivers vandalize vehicles editing law mob justice problem however sentence compensation isnt decided based income criminal decided based damages victim aggrieved party india push insurance licensing requirements trucking argument reforms jack logistics dont see playing nations india isnt exception sectors industries need formalize fair points yes insurance licensing requirements need forced trucking drive nearest police station maybe sure drivers always voluntarily drive police station instead disappearing whole problem disappear killing someone victims family never gets justice compensated third party insurance seems like enforcement existing laws may prevent need additional laws mean thakurs joke nonurban areas atleast states like bihar stay spot accident youll lynched reason govt wont touch brij bhushan thakurs hold power losing thakur support equals losing think brij bhushan thakur brij bhushan goon must done dirty jobs bjp caste issue bhaiya ji ye voh wala tank nahi hai covid video went viral police palghar came public pressure released two innocent sadhus lynched publicif im trucker im taking risk wouldnt singing tune truck runs family driver half drunk driving kmh commenting clarify people dont seem understand concept fine cases act mentions specific amount fine even take argument lakh fine account doesnt mean driver gets convicted hell pay lakh rupees court takes financial status accused account deciding quantum fine otherwise even impose l fine driver earning k month would fine even recovered driving carefully want license kill many times heard news car bike colliding truck due overspeding rash driving evident video whos fault truck drivers mostly drunk night must really dense think accidents attributed truck drivers cant factors may fault many accidents cars two wheelers idiots forget ton vehicle takes time brake even slight collision turn car sandwich car drivers get blame unlike truck drivers want protest govt lot already remember amount restraint government showed farm laws protesters problem stop public lynch due big vehicle mistake rule mob bro trying gujrat find literal cows road people driving hit ded goon bjp would taken care iykwim didnt let image take hit keeping order keep thakur support essential thats thakurs installed powerful positions high time sbi sponsor loans hit run cases dont know nothing thakurs highest population wouldnt get representation mean installing elected members like previously said much bigger thakur leaders edge bjp also last line hella condescending dont always villainize us one fuckers drunk drove mom ran away scene justice fuck guys sorry hear hope taking well fine seen people treat truck drivers even minor altercations stay spot die since poor theres little chance justice afterwards one im running away even law almost always abandon truck run thats incompetence law enforcement wont fixed law still run away police doesnt find whats point speed limit traffic police check drunk drivers lakh fine insurance",
    "light_cleaned_title": "Tanker drivers stop work in Maharashtra to protest new law on hit-and-run cases, fuel supply hit",
    "light_cleaned_selftext": "This is ridiculous, makes me wonder how often these truck drivers just hit and run that makes them worry so much about a fine.",
    "light_cleaned_comments": "> \"As per the new law, the hit-and- run cases can attract up to 10 years jail term and a fine of Rs 7 lakh. We are drivers, how can we furnish such a big fine amount?\" Did most of them become tanker drivers to have the 'freedom' of hit-and-run? Lmao Stupid laws. They are not letting and kill people or break their tiny tiny cars. Roads hamaara bhaap ka hy. Let us be aholes or WE PROTEST -Trucky. Probably a stupid question but isn't insurance there for this very purpose? They pay out for any victims as well right? Sabko Salman Khan banna hai **Canadian Truckers Protest Edition Let's Go** jiske pas power hai uske pas free pass hai. Thakurs for example. Fairness ki maa ki aankh. Jisse govt darti hai uski chalti huch hai. These are huge queues in my city for fuel... Dunno how long this strike will last That's the issue, they cannot strike people down and run away without a fine anymore /s Yes but most of the truckers won't have a policy. You do remember what happened to the Canadian Truckers, right? If our government did something like that, a lot of knickers would get twisted. Yep No one kill anyone, accidens happen Let them be unemployed, high time law and order is enforced strictly in this country I think it's much more nuanced than you are making out to be. In every accident, the general sentiment is that the 'bigger' vehicle is at fault. The law states that if they actually flee after an accident, they will be subjected to 7 lakhs or 10 Lakhs of fine. In the real world if they _don't_ flee, the public will lynch them whether they are at fault or not. I completely agree that some truck/bus drivers are extremely reckless and even drive under influence, but it's uncommon to see a car or a two wheeler making a mistake, and colliding with a bigger vehicle. According to the drivers if they had 7 lakhs with them they wouldn't be drivers in the first place. I will not pretend to know the ground reality, but what I will say is it's not as black and white and it requires both reconsideration on the law, and giving a proper explanation to the drivers by the relevant authorities Is any change based on actual data driven decision making anymore or is it just fuck it, \"change this, change that, make it look good and rhyme\"? What was the penalty before, where there lots of cases before, if exists brainstorm on how to fix the issue, etc. should be a starting point for any change. Is any change based on actual data driven decision making anymore or is it just fuck it, \"change this, change that, make it look good and rhyme\"? What was the penalty before, were there lots of cases before, if yes brainstorm on how to fix the issue, etc. should be a starting point for any change. All good points. The deeper issue is, as you can expect, not different from deeper issues with any kind of job in India - no protections, long hours, difficult working enviorment, low pay and so on. Trucking doesnt earn you a lot of money, but its something you can do with minimum education and a drivers license. This law aims to punish truckers without addressing any of their work related struggles. With better pay, and lesser transport related hurdles etc we can reduce the need for truckers to rush transporting goods. If India did it western politicians would start huffing and puffing. > we are tank drivers. How can we pay such a big amount? Sounds like these Mfs know they are going to hit and run. I'd like the sentence to be extended to 20 years with a permanent loss of licence. Compensation to be set to a minimum of inr 1.5 million. This is the actual problem. We sensationally report and read only headlines. The problem is how it will be proved. Accidents are always seen as a fault of the bigger vehicle or the survivors fault. And we always avoid the contributing factors- like an auto or scooter will hit a car, and it will be cars fault even if they had no headlights on or were driving on wrong side in the scooter I think the bigger problem is irrespective of whose fault it is - when an accident happens, what should the driver do? If he stays there, the public will most likely lynch him ('bigger vehicle is always at fault' mentality). If he flees, the Govt will register a hit and run case against him and fine 7 Lakhs. Whether the insurance comes into play or not is a secondary conversation. Right now the main issue is should the drivers preserve their life or freedom? (Not taking any sides here. Drivers who are reckless, under the influence or otherwise careless _should_ be punished to the full extent of the law) There should be a law for angry public who believe that only drivers of heavy vehicles are at fault and vandalize vehicles and lynch drivers. The penalty is too high for someone who barely makes 20k a month. No wonder they're on strike. The laws applicable to non-commercial vehicle drivers cannot be applied to truckers. Truckers barely make 20 - 30k a month to pay 7 lakh as penalty. Pedestrians turn into mobs and blame the heavy vehicle without considering the facts, in that case considering how civil these pedestrians (mobs) are, their protest makes sense. First, make strict regulations for vehicles not following traffic rules (there was a rant post here a while back about the general behavior of road users); second, they need to address the general behaviour of public who engage in mob behavior assaulting drivers and vandalize their vehicles before editing this law. Mob justice is a problem. However, a sentence or compensation isn't decided based on the income of the criminal. It's decided based on the damages to the victim or aggrieved party. India should push for insurance and licensing requirements for trucking. As for the argument that reforms will jack up logistics, I don't see this playing out in other nations. India isn't an exception. Sectors and industries need to formalize. Fair points. Yes insurance and licensing requirements need to be forced for trucking. Drive to the nearest police station maybe Sure but the drivers can always voluntarily drive over to the police station instead of disappearing The whole problem is they just disappear after killing someone, and the victims family never gets justice or is compensated by third party insurance seems like enforcement of existing laws may prevent the need of these additional laws What do you mean by Thakurs? This is not joke, in non-urban areas or atleast in states like Bihar, if you stay on the spot after accident, you'll be lynched. Its the reason why govt wont touch brij bhushan. Thakurs hold the power in UP. Losing Thakur support equals losing UP. Do you think only Brij Bhushan is Thakur in UP? Brij Bhushan is a goon and He must have done dirty jobs for BJP. This is not a caste issue. bhaiya ji ye voh wala Tank nahi hai. during covid there was a video which went viral where police from Palghar came under public pressure and released two innocent sadhus to be lynched by the public...if I'm a trucker I'm not taking that risk.. You wouldn't be singing that tune if some truck runs over your family while the driver is half drunk and driving at 100+ Km/h Commenting here just to clarify as some people don't seem to understand the concept of fine in cases. The Act mentions no specific amount of fine. Even if we take their argument of 10 lakh fine into account, that doesn't mean if the driver gets convicted, he'll have to pay 10 lakh rupees. The Court takes the financial status of the accused into account while deciding the quantum of fine. Otherwise even if you impose 10L fine on a driver earning 5k a month, how would that fine even be recovered? How about driving carefully? So they want license to kill? How many times have you heard news of a car or a bike colliding with a truck due to overspeding or rash driving? It's evident from the video who's at fault Truck drivers are mostly drunk at night You must be really dense to think that accidents can only be attributed to truck drivers and there can't be other factors where they may not be at fault. There are many accidents because of cars and two wheelers Idiots forget that a 10 ton vehicle takes time to brake and even a slight collision with it will turn your car into a sandwich But the car drivers get the blame unlike truck drivers who want to protest Out govt does a lot already I remember the amount of restraint the government showed against the Farm Laws protesters. Their problem is if they stop, public lynch them due to “big vehicle mistake” rule of our mob. Bro trying gujrat. You can find literal cows on the road with people driving 100. You hit you ded If he was just a goon bjp would have \"taken care of him\". iykwim. But they didn't and let their image take hit. Because keeping in order to keep UP, thakur support is essential. Thats why thakurs are being installed in powerful positions there. High time for SBI to sponsor some loans for Hit and run cases You don't know nothing about UP then. If Thakurs have the Highest population then why wouldn't they get representation? What do you mean by installing? They are elected members. Just like I previously said, There are much bigger Thakur leaders then him but he have some \"edge\" over BJP. Also your last line is hella condescending, You don't have to always villainize us. One of these fuckers drunk drove over my mom. Ran away from the scene. No justice. Fuck these guys I am sorry to hear that, I hope you are taking it well It’s not about fine . I have seen how people treat truck drivers even in minor altercations . If they stay on the spot they will die. And since most of them are poor there’s little chance of justice afterwards . If I was one I’m running away even with the law . They almost always abandon truck and run . That’s the incompetence of law enforcement which won’t be fixed by this law . They can still run away and if the police doesn’t find them - what’s the point ? There is speed limit and what is the traffic police is for, to check the drunk drivers, 10 lakh fine ? What about insurance then"
}