{
    "id": "19ckx0x",
    "title": "HC strikes down rape case against ex-boyfriend after woman’s marriage failed",
    "url": "https://www.hindustantimes.com/cities/mumbai-news/hc-strikes-down-rape-case-against-ex-boyfriend-after-woman-s-marriage-failed-101705775573770.html",
    "selftext": ">Accordingly, she got married to the man chosen by her parents. However, on the third day of the marriage, her husband came to know about her pre-marriage relationship and dropped her at her maternal place.\n\n>After the marriage was annulled, on October 11, 2022, the woman again established contact with the accused and started pursuing him for marriage and approached the police after he started avoiding her. In the FIR registered on January 12, 2023, the woman alleged that the accused sexually exploited her with a false promise of marriage...",
    "flair": "Law & Courts",
    "score": 93,
    "num_comments": 4,
    "created_utc": 1705890557.0,
    "convurl": "https://external-preview.redd.it/v2aG4Odr3LH_GRB8DHtZRZpGhrOAoR1R5V64iziq3a8.jpg?auto=webp&s=8fc878ecf5c4ce53b007b5962bb4a17ce9e49f40",
    "comments": [
        "This outdated law has no place in modern society. The govt needs to remove it before it ruins more lives. Especially now that live-in relationships and pre-marital sex has become so common in cities.",
        "What a shit-show !"
    ],
    "cleaned_text": "hc strikes rape case exboyfriend womans marriage failed accordingly got married man chosen parents however third day marriage husband came know premarriage relationship dropped maternal place marriage annulled october woman established contact accused started pursuing marriage approached police started avoiding fir registered january woman alleged accused sexually exploited false promise marriage ",
    "cleaned_title": "hc strikes rape case exboyfriend womans marriage failed",
    "cleaned_selftext": "accordingly got married man chosen parents however third day marriage husband came know premarriage relationship dropped maternal place marriage annulled october woman established contact accused started pursuing marriage approached police started avoiding fir registered january woman alleged accused sexually exploited false promise marriage",
    "cleaned_comments": "outdated law place modern society govt needs remove ruins lives especially livein relationships premarital sex become common cities shitshow",
    "light_cleaned_title": "HC strikes down rape case against ex-boyfriend after woman’s marriage failed",
    "light_cleaned_selftext": ">Accordingly, she got married to the man chosen by her parents. However, on the third day of the marriage, her husband came to know about her pre-marriage relationship and dropped her at her maternal place. >After the marriage was annulled, on October 11, 2022, the woman again established contact with the accused and started pursuing him for marriage and approached the police after he started avoiding her. In the FIR registered on January 12, 2023, the woman alleged that the accused sexually exploited her with a false promise of marriage...",
    "light_cleaned_comments": "This outdated law has no place in modern society. The govt needs to remove it before it ruins more lives. Especially now that live-in relationships and pre-marital sex has become so common in cities. What a shit-show !"
}