{
    "id": "17omshe",
    "title": "UK Citizen (Divorcee) marrying Indian Citizen",
    "url": "https://www.reddit.com/r/india/comments/17omshe/uk_citizen_divorcee_marrying_indian_citizen/",
    "selftext": "Hello everyone,\n\nI was wondering if anyone knew about how to getting a marriage officially recognised by the Government of India. I have read all I can online and I believe we are eligible to marry under the Special Marriage Act in India.\n\nBrief background - I ( a UK Citizen) have been speaking to a girl for several months. I am now in India for the next 2 months and would like to get married and have this marriage officially recognised by the Indian courts. My Visa is valid for one year and I have all the documentary evidence required including my Divorce certificate. My partner also has all the evidence required.\n\nThe one issue I cannot work out is the requirement of a NOC (No Objection Certificate). When I go to the UK website for information on a NOC as it relates to marriage in India, it states a NOC is not required:\n\nhttps://www.gov.uk/government/publications/marriage-information-note-on-noc\n\nThe website states to print off the declaration in the link above and hand it to the registrar in India.\n\nI also found this link which poses a similar situation that may be helpful - https://www.google.com/amp/s/www.scconline.com/blog/post/2022/02/11/registration-of-marriage/amp/\n\nCan someone definitively explain if I need a NOC or not as a UK Citizen? If yes, please can advise how?",
    "flair": "Law & Courts",
    "score": 3,
    "num_comments": 5,
    "created_utc": 1699221225.0,
    "convurl": "https://external-preview.redd.it/rAni1zW1MmE8Q9ZvSi7N9B6BrnEeNuoXNKR9792h0gQ.jpg?auto=webp&s=cec75916b0da3df2d4605345c87929d5b5a60c02",
    "comments": [
        "Contact lawyer.",
        "Try posting on r/legaladviceindia",
        "Court marriages, ask a lawyer"
    ],
    "cleaned_text": "uk citizen divorcee marrying indian citizen hello everyone wondering anyone knew getting marriage officially recognised government india read online believe eligible marry special marriage act india brief background uk citizen speaking girl several months india next months would like get married marriage officially recognised indian courts visa valid one year documentary evidence required including divorce certificate partner also evidence required one issue work requirement noc objection certificate go uk website information noc relates marriage india states noc required website states print declaration link hand registrar india also found link poses similar situation may helpful someone definitively explain need noc uk citizen yes please advise ",
    "cleaned_title": "uk citizen divorcee marrying indian citizen",
    "cleaned_selftext": "hello everyone wondering anyone knew getting marriage officially recognised government india read online believe eligible marry special marriage act india brief background uk citizen speaking girl several months india next months would like get married marriage officially recognised indian courts visa valid one year documentary evidence required including divorce certificate partner also evidence required one issue work requirement noc objection certificate go uk website information noc relates marriage india states noc required website states print declaration link hand registrar india also found link poses similar situation may helpful someone definitively explain need noc uk citizen yes please advise",
    "cleaned_comments": "contact lawyer try posting rlegaladviceindia court marriages ask lawyer",
    "light_cleaned_title": "UK Citizen (Divorcee) marrying Indian Citizen",
    "light_cleaned_selftext": "Hello everyone, I was wondering if anyone knew about how to getting a marriage officially recognised by the Government of India. I have read all I can online and I believe we are eligible to marry under the Special Marriage Act in India. Brief background - I ( a UK Citizen) have been speaking to a girl for several months. I am now in India for the next 2 months and would like to get married and have this marriage officially recognised by the Indian courts. My Visa is valid for one year and I have all the documentary evidence required including my Divorce certificate. My partner also has all the evidence required. The one issue I cannot work out is the requirement of a NOC (No Objection Certificate). When I go to the UK website for information on a NOC as it relates to marriage in India, it states a NOC is not required: The website states to print off the declaration in the link above and hand it to the registrar in India. I also found this link which poses a similar situation that may be helpful - Can someone definitively explain if I need a NOC or not as a UK Citizen? If yes, please can advise how?",
    "light_cleaned_comments": "Contact lawyer. Try posting on r/legaladviceindia Court marriages, ask a lawyer"
}