{
    "id": "14krv9d",
    "title": "Caught in the Scroll: A survey to understand the involvement of deceptive \"dark\" design patterns in social media addiction.",
    "url": "https://www.reddit.com/r/india/comments/14krv9d/caught_in_the_scroll_a_survey_to_understand_the/",
    "selftext": "Hi all, I am Manish kr Basu, pursuing a master's degree in design from IIT Guwahati, India.  \nI am conducting this survey for my thesis project on understanding the role of deceptive \"dark\" patterns in social media addiction and how to mitigate its impact.  \nThe objective of this Anonymous survey is to gather your valuable insights and opinions regarding your usage of a very popular social media platform 'Instagram' . Please feel free to distribute this survey among individuals who are susceptible to social media addiction.  \n\\*Your responses will be treated with the utmost confidentiality and will be used only for research purposes. All data collected will be anonymised and reported in aggregate to maintain your privacy.  \n[https://forms.gle/dPmepxj12U9gnL1q8](https://forms.gle/dPmepxj12U9gnL1q8)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1687905384.0,
    "convurl": "https://external-preview.redd.it/PFOM1K3dnj27lzR6lHkC0Cs1dedxkWV9rrW1aXZxE1Y.jpg?auto=webp&v=enabled&s=c9a97aa5fc8cf64377810735c7d154a94089867e",
    "comments": [],
    "cleaned_text": "caught scroll survey understand involvement deceptive dark design patterns social media addiction hi manish kr basu pursuing masters degree design iit guwahati india conducting survey thesis project understanding role deceptive dark patterns social media addiction mitigate impact objective anonymous survey gather valuable insights opinions regarding usage popular social media platform instagram please feel free distribute survey among individuals susceptible social media addiction responses treated utmost confidentiality used research purposes data collected anonymised reported aggregate maintain privacy httpsformsgledpmepxjugnlqhttpsformsgledpmepxjugnlq ",
    "cleaned_title": "caught scroll survey understand involvement deceptive dark design patterns social media addiction",
    "cleaned_selftext": "hi manish kr basu pursuing masters degree design iit guwahati india conducting survey thesis project understanding role deceptive dark patterns social media addiction mitigate impact objective anonymous survey gather valuable insights opinions regarding usage popular social media platform instagram please feel free distribute survey among individuals susceptible social media addiction responses treated utmost confidentiality used research purposes data collected anonymised reported aggregate maintain privacy httpsformsgledpmepxjugnlqhttpsformsgledpmepxjugnlq",
    "cleaned_comments": "",
    "light_cleaned_title": "Caught in the Scroll: A survey to understand the involvement of deceptive \"dark\" design patterns in social media addiction.",
    "light_cleaned_selftext": "Hi all, I am Manish kr Basu, pursuing a master's degree in design from IIT Guwahati, India. I am conducting this survey for my thesis project on understanding the role of deceptive \"dark\" patterns in social media addiction and how to mitigate its impact. The objective of this Anonymous survey is to gather your valuable insights and opinions regarding your usage of a very popular social media platform 'Instagram' . Please feel free to distribute this survey among individuals who are susceptible to social media addiction. \\*Your responses will be treated with the utmost confidentiality and will be used only for research purposes. All data collected will be anonymised and reported in aggregate to maintain your privacy. [https://forms.gle/dPmepxj12U9gnL1q8](https://forms.gle/dPmepxj12U9gnL1q8)",
    "light_cleaned_comments": ""
}