{
    "id": "13rpp4d",
    "title": "Unite against big dealers for possession delay in Noida and nearby",
    "url": "https://www.reddit.com/r/india/comments/13rpp4d/unite_against_big_dealers_for_possession_delay_in/",
    "selftext": "https://m.timesofindia.com/city/noida/registries-pending-300-homebuyers-in-noida-hold-protest/amp_articleshow/98260272.cms\n\nWe are facing same issues with Sikka builders for many years now as is there in the article - Possession delay! Is anyone here also going through the same? If yes, let's raise our voice together through protests maybe? \n\nWe bought a flat with Sikka and they keep revising dates for possession. It has been over 5 years. \n\nI am still figuring out but I need to get in touch with all people who are face the same problem in Noida and around. Or if you guys have any suggestions how to deal with this. \n\nI have create a group for this. Please dm or comment so that we can connect.",
    "flair": "AskIndia",
    "score": 4,
    "num_comments": 3,
    "created_utc": 1685040162.0,
    "convurl": "https://external-preview.redd.it/omtlNH9L039ak1cb7RP6ognqAMOObAgL0SuFeLlfecI.jpg?auto=webp&v=enabled&s=27813a2bf909c6f71d645c31f7932b510709f2fa",
    "comments": [
        "Oh boy!! Noida and Builders...."
    ],
    "cleaned_text": "unite big dealers possession delay noida nearby facing issues sikka builders many years article possession delay anyone also going yes lets raise voice together protests maybe bought flat sikka keep revising dates possession years still figuring need get touch people face problem noida around guys suggestions deal create group please dm comment connect ",
    "cleaned_title": "unite big dealers possession delay noida nearby",
    "cleaned_selftext": "facing issues sikka builders many years article possession delay anyone also going yes lets raise voice together protests maybe bought flat sikka keep revising dates possession years still figuring need get touch people face problem noida around guys suggestions deal create group please dm comment connect",
    "cleaned_comments": "oh boy noida builders",
    "light_cleaned_title": "Unite against big dealers for possession delay in Noida and nearby",
    "light_cleaned_selftext": "We are facing same issues with Sikka builders for many years now as is there in the article - Possession delay! Is anyone here also going through the same? If yes, let's raise our voice together through protests maybe? We bought a flat with Sikka and they keep revising dates for possession. It has been over 5 years. I am still figuring out but I need to get in touch with all people who are face the same problem in Noida and around. Or if you guys have any suggestions how to deal with this. I have create a group for this. Please dm or comment so that we can connect.",
    "light_cleaned_comments": "Oh boy!! Noida and Builders...."
}