{
    "id": "16nbb2f",
    "title": "My 4th-Grader Struggles with School Math Question!",
    "url": "https://www.reddit.com/gallery/16nbb2f",
    "selftext": "My 4th-grade daughter faced a perplexing math problem from MRPL DPS School. It left us wondering how students, just beginning to learn multiplication, subtraction, and division, are expected to tackle such challenges. 📚🤯",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695181957.0,
    "convurl": "https://i.redd.it/6kmifj5a2cpb1.jpg",
    "comments": [
        "4th graders should be able to solve these problems comfortably.",
        "Your fourth grade student is just learning multiplication?!",
        "Yes, they're teaching multiplication now with single and double digits.",
        "The math problems in themselves are quite straightforward. However, the language around it might be challenging for a 4th grader.\n\nBut hey, that's how the Indian education system has worked for many years.\n\nYou can probably help her with some que cards for her exams, which allows her to identify if she needs to perform multiplication or division. I used this trick extensively while solving H.C.F. and L.C.M. questions.",
        "If you really want to know, take the opportunity at the next PTM to find out where your kid stands in the class, percentile-wise, subject-wise. \n\nBut this is a good opportunity to tell your kid (and yourself) that if he can't do some questions, its OK. If he can't be a topper, that's OK. The goal should be to perform at his maximum potential, just compete with himself. This is a far more important lesson than some math.  \n\nAnd, by the way, the answer to question 4 on Page 2 is \"none of the above\". The correct answer is 759.",
        "Thanks for the tips, am trying to help her in my best way.",
        "Nope you are wrong",
        "Hey, thanks for your advice! The school doesn’t listen to parents during PTMs; instead, they enforce that the child has to attend remedial classes. When I asked how other kids perform or answer such complex questions, they simply said that 3-4 kids can answer them. I just wanted to focus on the 26th question, part (vi), which is very tricky for a child who has just learned multiplication. I never force or push my child to compete with others. I always encourage and support her potential, and my wife tries creative ways to practice.",
        "If just 3-4 kids in the class can answer the difficult questions, then you're OK. It's probably some shitty ploy to get kids into those remedial classes, and make more money thereby.   \n\nAs someone else mentioned, the difficulty in these questions is not the math part, but the English comprehension. If your daughter is not already doing it, this is a good time to get her into the reading habit (in fact right now is the perfect time: after 2-3 years she'll be stuck on the smartphone and won't listen to you). If you can get her hooked onto reading English novels appropriate for her age, her English comprehension will automatically improve, and more importantly get her into a habit that will last her a lifetime.",
        "I think the question itself is easy considering it's simple multiplication for class 4, but to understand the question requires reading comprehension skills beyond the scope of class 4, but then again I've seen kids nowadays speak fluent english..So maybe it's not?"
    ],
    "cleaned_text": "thgrader struggles school math question thgrade daughter faced perplexing math problem mrpl dps school left us wondering students beginning learn multiplication subtraction division expected tackle challenges ",
    "cleaned_title": "thgrader struggles school math question",
    "cleaned_selftext": "thgrade daughter faced perplexing math problem mrpl dps school left us wondering students beginning learn multiplication subtraction division expected tackle challenges",
    "cleaned_comments": "th graders able solve problems comfortably fourth grade student learning multiplication yes theyre teaching multiplication single double digits math problems quite straightforward however language around might challenging th grader hey thats indian education system worked many years probably help que cards exams allows identify needs perform multiplication division used trick extensively solving hcf lcm questions really want know take opportunity next ptm find kid stands class percentilewise subjectwise good opportunity tell kid cant questions ok cant topper thats ok goal perform maximum potential compete far important lesson math way answer question page none correct answer thanks tips trying help best way nope wrong hey thanks advice school doesnt listen parents ptms instead enforce child attend remedial classes asked kids perform answer complex questions simply said kids answer wanted focus th question part vi tricky child learned multiplication never force push child compete others always encourage support potential wife tries creative ways practice kids class answer difficult questions youre ok probably shitty ploy get kids remedial classes make money thereby someone else mentioned difficulty questions math part english comprehension daughter already good time get reading habit fact right perfect time years shell stuck smartphone wont listen get hooked onto reading english novels appropriate age english comprehension automatically improve importantly get habit last lifetime think question easy considering simple multiplication class understand question requires reading comprehension skills beyond scope class ive seen kids nowadays speak fluent englishso maybe",
    "light_cleaned_title": "My 4th-Grader Struggles with School Math Question!",
    "light_cleaned_selftext": "My 4th-grade daughter faced a perplexing math problem from MRPL DPS School. It left us wondering how students, just beginning to learn multiplication, subtraction, and division, are expected to tackle such challenges. 📚🤯",
    "light_cleaned_comments": "4th graders should be able to solve these problems comfortably. Your fourth grade student is just learning multiplication?! Yes, they're teaching multiplication now with single and double digits. The math problems in themselves are quite straightforward. However, the language around it might be challenging for a 4th grader. But hey, that's how the Indian education system has worked for many years. You can probably help her with some que cards for her exams, which allows her to identify if she needs to perform multiplication or division. I used this trick extensively while solving H.C.F. and L.C.M. questions. If you really want to know, take the opportunity at the next PTM to find out where your kid stands in the class, percentile-wise, subject-wise. But this is a good opportunity to tell your kid (and yourself) that if he can't do some questions, its OK. If he can't be a topper, that's OK. The goal should be to perform at his maximum potential, just compete with himself. This is a far more important lesson than some math. And, by the way, the answer to question 4 on Page 2 is \"none of the above\". The correct answer is 759. Thanks for the tips, am trying to help her in my best way. Nope you are wrong Hey, thanks for your advice! The school doesn’t listen to parents during PTMs; instead, they enforce that the child has to attend remedial classes. When I asked how other kids perform or answer such complex questions, they simply said that 3-4 kids can answer them. I just wanted to focus on the 26th question, part (vi), which is very tricky for a child who has just learned multiplication. I never force or push my child to compete with others. I always encourage and support her potential, and my wife tries creative ways to practice. If just 3-4 kids in the class can answer the difficult questions, then you're OK. It's probably some shitty ploy to get kids into those remedial classes, and make more money thereby. As someone else mentioned, the difficulty in these questions is not the math part, but the English comprehension. If your daughter is not already doing it, this is a good time to get her into the reading habit (in fact right now is the perfect time: after 2-3 years she'll be stuck on the smartphone and won't listen to you). If you can get her hooked onto reading English novels appropriate for her age, her English comprehension will automatically improve, and more importantly get her into a habit that will last her a lifetime. I think the question itself is easy considering it's simple multiplication for class 4, but to understand the question requires reading comprehension skills beyond the scope of class 4, but then again I've seen kids nowadays speak fluent english..So maybe it's not?"
}