{
    "id": "10l1gyb",
    "title": "Which Sneaker Protector to Buy?",
    "url": "https://i.redd.it/wra2ohi339ea1.jpg",
    "selftext": "I'm aware that Crep and Reshoevn8r are the best choices but  Reshoevn8r is sold out everywhere and crep will deliver later than I need. I have a budget of 1200+300 (if needed), Please let me know what sneaker protector will be the best",
    "flair": "AskIndia",
    "score": 7,
    "num_comments": 14,
    "created_utc": 1674661049,
    "convurl": "https://i.redd.it/wra2ohi339ea1.jpg",
    "comments": [
        "Kiwi Waterproof Spray for Shoes, Sneaker Protector for Water &amp; Stain Repellant, Step 2, 200 ml https://amzn.eu/d/2yjY0om\n\nWater Repellent / Waterproof Spray for Shoes, Sneakers and Bags. Premium Nano-Technology Formula. Eco friendly. No Fluoropolymers, Alcohols or PFAS. Stain &amp; Liquid Protection Spray for Shoes, Sneakers and Bags including Fabric, Suede, Leather, Cotton and Canvas (100mL) https://amzn.eu/d/56C7UTn",
        "ek danda lele, koi tera chappal nahi churayega.",
        "Hahahaha... na bro I have some people in my life that may try to ruin my sneaker as soon as they see it. Need water and stain resistance.",
        "&gt;Need water and stain resistance.\n\nuse nirma and plastic cover.",
        "Bas kr hasa hasa ke rulaega kya?",
        "bhai tera spray ke pese me naye joothe aayenge.",
        "Apply 10% discount and go with the NM.",
        "What does this do ?",
        "It prevents your sneaker from water and stains so it can look new for longer periods of time.",
        "Went with vetero on another suggestion. Should I cancel that order?",
        "For how long will the spray effect stay? Need to spray every week?",
        "Idk my first time, but I would think anywhere from a couple of days to a week.",
        "Lmao",
        "Hey op I'm in the same boat as you now. What did you end up buying and how's your review?",
        "Vetero, it's good, not the best probably, but for a mild user like me, it works perfectly!",
        "How often do you have to respray?",
        "I don't go out that often, so I just do a quick \"refill\" type thing, so light spray before leaving every time. I know it isn't ideal but with WFH I get very less chances of taking them out",
        "Every time? Oh wow",
        "Yeah, everything lasts longer when you don't have much of a social life, I can't exactly go to Dmart wearing Pumas hehe"
    ],
    "cleaned_text": "sneaker protector buy im aware crep reshoevnr best choices reshoevnr sold everywhere crep deliver later need budget needed please let know sneaker protector best ",
    "cleaned_title": "sneaker protector buy",
    "cleaned_selftext": "im aware crep reshoevnr best choices reshoevnr sold everywhere crep deliver later need budget needed please let know sneaker protector best",
    "cleaned_comments": "kiwi waterproof spray shoes sneaker protector water amp stain repellant step ml water repellent waterproof spray shoes sneakers bags premium nanotechnology formula eco friendly fluoropolymers alcohols pfas stain amp liquid protection spray shoes sneakers bags including fabric suede leather cotton canvas ml ek danda lele koi tera chappal nahi churayega hahahaha na bro people life may try ruin sneaker soon see need water stain resistance gtneed water stain resistance use nirma plastic cover bas kr hasa hasa ke rulaega kya bhai tera spray ke pese naye joothe aayenge apply discount go nm prevents sneaker water stains look new longer periods time went vetero another suggestion cancel order long spray effect stay need spray every week idk first time would think anywhere couple days week lmao hey op im boat end buying hows review vetero good best probably mild user like works perfectly often respray dont go often quick refill type thing light spray leaving every time know isnt ideal wfh get less chances taking every time oh wow yeah everything lasts longer dont much social life cant exactly go dmart wearing pumas hehe",
    "light_cleaned_title": "Which Sneaker Protector to Buy?",
    "light_cleaned_selftext": "I'm aware that Crep and Reshoevn8r are the best choices but Reshoevn8r is sold out everywhere and crep will deliver later than I need. I have a budget of 1200+300 (if needed), Please let me know what sneaker protector will be the best",
    "light_cleaned_comments": "Kiwi Waterproof Spray for Shoes, Sneaker Protector for Water &amp; Stain Repellant, Step 2, 200 ml Water Repellent / Waterproof Spray for Shoes, Sneakers and Bags. Premium Nano-Technology Formula. Eco friendly. No Fluoropolymers, Alcohols or PFAS. Stain &amp; Liquid Protection Spray for Shoes, Sneakers and Bags including Fabric, Suede, Leather, Cotton and Canvas (100mL) ek danda lele, koi tera chappal nahi churayega. Hahahaha... na bro I have some people in my life that may try to ruin my sneaker as soon as they see it. Need water and stain resistance. &gt;Need water and stain resistance. use nirma and plastic cover. Bas kr hasa hasa ke rulaega kya? bhai tera spray ke pese me naye joothe aayenge. Apply 10% discount and go with the NM. What does this do ? It prevents your sneaker from water and stains so it can look new for longer periods of time. Went with vetero on another suggestion. Should I cancel that order? For how long will the spray effect stay? Need to spray every week? Idk my first time, but I would think anywhere from a couple of days to a week. Lmao Hey op I'm in the same boat as you now. What did you end up buying and how's your review? Vetero, it's good, not the best probably, but for a mild user like me, it works perfectly! How often do you have to respray? I don't go out that often, so I just do a quick \"refill\" type thing, so light spray before leaving every time. I know it isn't ideal but with WFH I get very less chances of taking them out Every time? Oh wow Yeah, everything lasts longer when you don't have much of a social life, I can't exactly go to Dmart wearing Pumas hehe"
}