{
    "id": "12y3ios",
    "title": "UP: Muslim student accuses Times Now Nav Bharat of falsely portraying him as shooter in Umesh Pal case",
    "url": "https://maktoobmedia.com/latest-news/muslim-student-in-up-accuses-times-now-nav-bharat-of-falsely-portraying-him-as-shooter-in-umesh-pal-case/",
    "selftext": "A Muslim student in Uttar Pradesh’s Allahabad has alleged that Times Now Nav Bharat channel falsely portrayed him as a shooter and accused him of being involved in the Umesh Pal murder case. He claims that his photos and visuals were aired during prime time on TV. Following numerous emails and legal notice, the channel took down the video, but did not issue any clarifications.",
    "flair": "Crime",
    "score": 117,
    "num_comments": 6,
    "created_utc": 1682385525.0,
    "convurl": "https://external-preview.redd.it/iftOrT0fHr0OLjbpyxQOjkrLG0Y0qCQj-fq9Sfk6Gis.jpg?auto=webp&v=enabled&s=c55a69dc39052840a2a8a053d7f2b8db4754ce24",
    "comments": [
        "He needs to sue them into oblivion. It is the only way.",
        "Sushant ☕",
        "Chucha kya kr rha h re",
        "We are talking about India and not the USA.",
        "For that, he'll have to stay alive.",
        "The thing is most of us middle class guys prefer to stay away from court kacheri so maybe a settlement will be done"
    ],
    "cleaned_text": "muslim student accuses times nav bharat falsely portraying shooter umesh pal case muslim student uttar pradeshs allahabad alleged times nav bharat channel falsely portrayed shooter accused involved umesh pal murder case claims photos visuals aired prime time tv following numerous emails legal notice channel took video issue clarifications ",
    "cleaned_title": "muslim student accuses times nav bharat falsely portraying shooter umesh pal case",
    "cleaned_selftext": "muslim student uttar pradeshs allahabad alleged times nav bharat channel falsely portrayed shooter accused involved umesh pal murder case claims photos visuals aired prime time tv following numerous emails legal notice channel took video issue clarifications",
    "cleaned_comments": "needs sue oblivion way sushant chucha kya kr rha h talking india usa hell stay alive thing us middle class guys prefer stay away court kacheri maybe settlement done",
    "light_cleaned_title": "UP: Muslim student accuses Times Now Nav Bharat of falsely portraying him as shooter in Umesh Pal case",
    "light_cleaned_selftext": "A Muslim student in Uttar Pradesh’s Allahabad has alleged that Times Now Nav Bharat channel falsely portrayed him as a shooter and accused him of being involved in the Umesh Pal murder case. He claims that his photos and visuals were aired during prime time on TV. Following numerous emails and legal notice, the channel took down the video, but did not issue any clarifications.",
    "light_cleaned_comments": "He needs to sue them into oblivion. It is the only way. Sushant ☕ Chucha kya kr rha h re We are talking about India and not the USA. For that, he'll have to stay alive. The thing is most of us middle class guys prefer to stay away from court kacheri so maybe a settlement will be done"
}