{
    "id": "13wum3w",
    "title": "Ola electric running a huge scam",
    "url": "https://www.reddit.com/r/india/comments/13wum3w/ola_electric_running_a_huge_scam/",
    "selftext": "Hi. I booked Ola S1 pro scooter on 30th May through app and paid in full with credit card. Today when I see the app it shows I need to pay 15000 more to get the scooter delivered due to change in Government policy from June 1 2023. I don't know which government policy it is. I was not informed earlier either through the app or by ohe ola experience centre worker with whose help I booked it. These people just want to extort money and I am fed up of their schemes even before the scooter is delivered. I wanted to trust them but looking back at the reviews of disappointed customers, they were correct and I was wrong.\n\nI want to cancel my order. But I have heard horror stories of receiving refund after even 4 month. Meanwhile I would be required to pay a heft bill on my credit cards and the amount which I can't withdraw later. \n\nGuys, stay away. These people are not to be trusted. I even handed over my adhar and pan details to experience center worker to upload (Now I know completely moronic). Please don't fall in this trap. Willing to share order proof If any Ola executive requests.[Extra charge](https://i.postimg.cc/zvyJpgbw/Screenshot-2023-05-31-23-53-18-60.png)\n\nEdit: the ola experience centre dealer is saying he is working with ola office to give the option for earlier booked price now and that I will be given a choice if I want to pay extra 15 k or cancel the booking before scooter registration. \nPersonally I don't think it's feasible, and he is buying time. What should I do?\n\nEdit: the customer care number is unavailable on the sim with which I booked the scooter as it says the number I dialled is wrong. However my other number connects with customer care but no with representative as they say no booking found on this sim. Talk about fishy. Email is the only option. And yes I have talktime balance as well as unlimited recharge on both sim before anyone points that out.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 11,
    "created_utc": 1685559191.0,
    "convurl": "https://external-preview.redd.it/r7NBtCmm9cMpLHhtHdj2M78hWjeaGv90eFl7zLv_88o.png?auto=webp&v=enabled&s=44ca3bb594d25b03df7937db4d78aa3165b5b0ec",
    "comments": [
        "https://preview.redd.it/va3rox95c93b1.jpeg?width=597&format=pjpg&auto=webp&v=enabled&s=59a3eab12c8366e796c662611d564d9834f9841d\n\nYes, there is indeed ₹15000 charge but this is pretty stupid on Ola's part to demand it later.\n\nOla had increased the price because of Government lowering the subsidy but this was supposed to take effect from 1st Jun.\n\nWhen did you place order? I saw Ola increasing the price from 30th I believe.\n\nRegarding the refund, depending on the bank you can withdraw the refund fully once you receive it.",
        "I booked on 30th May. The ola experience centre guy even told me that it was the last day with discounted price. Also the app was showing the same notification that today is last day with discounted price. Also I got an Sms from ola regarding the same. So in a rush I placed the order the same day. But it's very petty and dishonest for a mass market manufacturer to not disclose such important information beforehand and waiting till now the scooter is out for delivery from factory to customer so that he has no choice but to pay it.",
        "Yes, not denying that it's pretty dishonest. \n\nI don't think you should be paying.  I'm a S1 owner myself but won't stand with these ridiculous actions from the company.",
        "Yeah my trust on this brand is gone. Won't touch again with a 10 foot pole. I don't know how to proceed on Twitter. I will seek help.",
        "Call 08033113311 tomorrow after 8am.",
        "Thanks a lot man. Will do.",
        "The FAME2 subsidy is being cut effective 1st June. The only way you would have been eligible for the old subsidy was if Ola had processed your purchase order and sent it for registration before 31st may. \n\nAther, I heard, is eating the difference if customer already paid the full amount but the company could not process registration prior to 31st May",
        "This is what happens when you blindly book a scooter like you're booking movie tickets.",
        "Yeah, I deserved it. Right?",
        "Yes. How can you make a purchase of 1 lakh + without knowing what comprises that cost, and especially the discounts involved?"
    ],
    "cleaned_text": "ola electric running huge scam hi booked ola pro scooter th may app paid full credit card today see app shows need pay get scooter delivered due change government policy june dont know government policy informed earlier either app ohe ola experience centre worker whose help booked people want extort money fed schemes even scooter delivered wanted trust looking back reviews disappointed customers correct wrong want cancel order heard horror stories receiving refund even month meanwhile would required pay heft bill credit cards amount cant withdraw later guys stay away people trusted even handed adhar pan details experience center worker upload know completely moronic please dont fall trap willing share order proof ola executive requestsextra chargehttpsipostimgcczvyjpgbwscreenshotpng edit ola experience centre dealer saying working ola office give option earlier booked price given choice want pay extra k cancel booking scooter registration personally dont think feasible buying time edit customer care number unavailable sim booked scooter says number dialled wrong however number connects customer care representative say booking found sim talk fishy email option yes talktime balance well unlimited recharge sim anyone points ",
    "cleaned_title": "ola electric running huge scam",
    "cleaned_selftext": "hi booked ola pro scooter th may app paid full credit card today see app shows need pay get scooter delivered due change government policy june dont know government policy informed earlier either app ohe ola experience centre worker whose help booked people want extort money fed schemes even scooter delivered wanted trust looking back reviews disappointed customers correct wrong want cancel order heard horror stories receiving refund even month meanwhile would required pay heft bill credit cards amount cant withdraw later guys stay away people trusted even handed adhar pan details experience center worker upload know completely moronic please dont fall trap willing share order proof ola executive requestsextra chargehttpsipostimgcczvyjpgbwscreenshotpng edit ola experience centre dealer saying working ola office give option earlier booked price given choice want pay extra k cancel booking scooter registration personally dont think feasible buying time edit customer care number unavailable sim booked scooter says number dialled wrong however number connects customer care representative say booking found sim talk fishy email option yes talktime balance well unlimited recharge sim anyone points",
    "cleaned_comments": "yes indeed charge pretty stupid olas part demand later ola increased price government lowering subsidy supposed take effect st jun place order saw ola increasing price th believe regarding refund depending bank withdraw refund fully receive booked th may ola experience centre guy even told last day discounted price also app showing notification today last day discounted price also got sms ola regarding rush placed order day petty dishonest mass market manufacturer disclose important information beforehand waiting till scooter delivery factory customer choice pay yes denying pretty dishonest dont think paying im owner wont stand ridiculous actions company yeah trust brand gone wont touch foot pole dont know proceed twitter seek help call tomorrow thanks lot man fame subsidy cut effective st june way would eligible old subsidy ola processed purchase order sent registration st may ather heard eating difference customer already paid full amount company could process registration prior st may happens blindly book scooter like youre booking movie tickets yeah deserved right yes make purchase lakh without knowing comprises cost especially discounts involved",
    "light_cleaned_title": "Ola electric running a huge scam",
    "light_cleaned_selftext": "Hi. I booked Ola S1 pro scooter on 30th May through app and paid in full with credit card. Today when I see the app it shows I need to pay 15000 more to get the scooter delivered due to change in Government policy from June 1 2023. I don't know which government policy it is. I was not informed earlier either through the app or by ohe ola experience centre worker with whose help I booked it. These people just want to extort money and I am fed up of their schemes even before the scooter is delivered. I wanted to trust them but looking back at the reviews of disappointed customers, they were correct and I was wrong. I want to cancel my order. But I have heard horror stories of receiving refund after even 4 month. Meanwhile I would be required to pay a heft bill on my credit cards and the amount which I can't withdraw later. Guys, stay away. These people are not to be trusted. I even handed over my adhar and pan details to experience center worker to upload (Now I know completely moronic). Please don't fall in this trap. Willing to share order proof If any Ola executive requests.[Extra charge](https://i.postimg.cc/zvyJpgbw/Screenshot-2023-05-31-23-53-18-60.png) Edit: the ola experience centre dealer is saying he is working with ola office to give the option for earlier booked price now and that I will be given a choice if I want to pay extra 15 k or cancel the booking before scooter registration. Personally I don't think it's feasible, and he is buying time. What should I do? Edit: the customer care number is unavailable on the sim with which I booked the scooter as it says the number I dialled is wrong. However my other number connects with customer care but no with representative as they say no booking found on this sim. Talk about fishy. Email is the only option. And yes I have talktime balance as well as unlimited recharge on both sim before anyone points that out.",
    "light_cleaned_comments": "Yes, there is indeed ₹15000 charge but this is pretty stupid on Ola's part to demand it later. Ola had increased the price because of Government lowering the subsidy but this was supposed to take effect from 1st Jun. When did you place order? I saw Ola increasing the price from 30th I believe. Regarding the refund, depending on the bank you can withdraw the refund fully once you receive it. I booked on 30th May. The ola experience centre guy even told me that it was the last day with discounted price. Also the app was showing the same notification that today is last day with discounted price. Also I got an Sms from ola regarding the same. So in a rush I placed the order the same day. But it's very petty and dishonest for a mass market manufacturer to not disclose such important information beforehand and waiting till now the scooter is out for delivery from factory to customer so that he has no choice but to pay it. Yes, not denying that it's pretty dishonest. I don't think you should be paying. I'm a S1 owner myself but won't stand with these ridiculous actions from the company. Yeah my trust on this brand is gone. Won't touch again with a 10 foot pole. I don't know how to proceed on Twitter. I will seek help. Call 08033113311 tomorrow after 8am. Thanks a lot man. Will do. The FAME2 subsidy is being cut effective 1st June. The only way you would have been eligible for the old subsidy was if Ola had processed your purchase order and sent it for registration before 31st may. Ather, I heard, is eating the difference if customer already paid the full amount but the company could not process registration prior to 31st May This is what happens when you blindly book a scooter like you're booking movie tickets. Yeah, I deserved it. Right? Yes. How can you make a purchase of 1 lakh + without knowing what comprises that cost, and especially the discounts involved?"
}