{
    "id": "1aveeak",
    "title": "No place for tech: How digital interventions in NREGA are undermining rural social security",
    "url": "https://www.reddit.com/r/india/comments/1aveeak/no_place_for_tech_how_digital_interventions_in/",
    "selftext": " \n\n[https:\\/\\/internetfreedom.in\\/no-place-for-tech-in-nrega\\/](https://preview.redd.it/mzbti6pnupjc1.jpg?width=1600&format=pjpg&auto=webp&s=cb582191367655ec2a0b3c0bf818bbd4edbb9a06)\n\n## tl;dr\n\nIn recent years, attempts by India’s union  and state governments to introduce digital interventions in NREGA,  including biometric-based payment, attendance and worker verification  systems, or worker site surveillance, have had a direct and adverse  effect on rural workers and their constitutionally guaranteed right to  equality, employment, fair wage, dignity, and privacy. They are leading  to large-scale disempowerment and exclusion of workers across Indian  states. This blog critically examines the digital interventions and  their place in the scheme, and reiterates arguments made by workers  against their integration into the NREGA framework.\n\n## Background\n\nFebruary  02, 2024 marked 18 years since the Mahatma Gandhi National Rural  Employment Guarantee Act (“NREGA”) was enacted. For 18 years, it has  employed rural populations in unskilled labour in exchange for a  guaranteed minimum wage and the protection of their constitutional  rights to a livelihood and to live life with dignity. Though the  statutory safetynet has been breached by [socio-economic externalities](https://www.downtoearth.org.in/blog/economy/mgnrega-is-failing-10-reasons-why-62035?ref=static.internetfreedom.in) and [funding crises](https://www.thehindu.com/news/national/mgnregs-runs-out-of-funds-rural-development-ministry-seeks-supplementary-budget/article67390326.ece?ref=static.internetfreedom.in) a few times in these 18 years, the programme has been able to amass a labour force of [250 million registered workers](https://www.downtoearth.org.in/blog/economy/runup-to-interim-budget-2024-the-minimum-nrega-budget-for-fy-2024-25-must-be-rs-2-71-lakh-crore-94184?ref=static.internetfreedom.in) who continue to reap protections set in stone by the 2005 Act. But now, new and unmet challenges emerge. \n\nSince  January 2023, India’s union and state governments have set out to  integrate digital technologies into the programme, including  biometric-based payment, attendance and worker verification systems, as  well as worker site surveillance. The digitisation of a programme built  for the welfare of economically disenfranchised and low-literacy  populations has a direct and adverse effect on the workers and their  constitutionally guaranteed right to employment, fair wage, dignity, and  privacy. The digital technologies, explored in detail below, disrupt  the law-policy framework of India’s rural employment guarantee scheme  and set back the clock on community-led reform that has propelled NREGA  to the successes it has been able to achieve. \n\nDigital  interventions of this nature, which have now come to form the basis of  the  implementation of the NREGA programme, seem ignorant to the Indian  digital divide and fail to meet the objectives of the Act – including  its foundational promise of guaranteeing social security to rural  populations.\n\n## No place for technology\n\nNREGA, deemed the [largest](https://www.business-standard.com/article/pti-stories/mnrega-world-s-largest-public-works-programme-world-bank-115070701470_1.html?ref=static.internetfreedom.in)  public works programme in the world, is a watershed social security  legislation that has provided a safetynet to economically  underprivileged families in India for nearly two decades. The Act and  supplementing schemes are founded in public advocacy and [civil society efforts](https://www.pria.org/knowledge_resource/1621863093_1618822426_1618816284_15%20years%20in-the%20mgnrega%20story1.pdf?ref=static.internetfreedom.in)  – demands were made loud and clear for rural employment opportunities  to be provided by the union, along with complete transparency and  assurance of wage payments. As a result, the legislation is a  community-led charter of workers’ rights and entitlements with a strong  basis in equitable social security, which empowers a large demographic  of the country to claim employment and benefits as a constitutional  right. \n\nHowever, in recent times, its robust framework is being  undermined at a rapid pace due to the introduction of programmatic  digital interventions. Since the union Ministry of Rural Development  (“MoRD”, “Ministry”) has started rolling technological “solutions” to  the scheme, issues around inaccess, inaccuracy, exclusion and  disenfranchisement have instantaneously become visible, as explored in  more detail in the sections below. \n\n### Aadhaar-based Payment System\n\nOn  January 01, 2024, MoRD made the use of Aadhaar-Based Payment System  (“ABPS”) mandatory for the payment of wages to rural workers under  NREGA. The [new notification](https://www.cnbctv18.com/economy/mgnrega-scheme-workers-giriraj-singh-states-aadhar-18701161.htm?ref=static.internetfreedom.in)  mandates workers to link their Aadhar with their NREGA job cards, and  as MoRD announced, non-compliance will be met with penalties. This move  was met with pushback from [workers](https://www.newsclick.in/tn-agricultural-workers-protest-abps-mgnrega-demand-higher-budget-allocation-and-timely-disbursal?ref=static.internetfreedom.in) and statements of concerns by [local leaders](https://www.deccanherald.com/india/making-aadhaar-based-payment-system-mandatory-an-assault-on-mgnrega-cpim-2832861?ref=static.internetfreedom.in). \n\nThis  is not the first time the Ministry has made a move to make aadhaar  mandatory – on January 30, 2023, it asked state governments to achieve  100% aadhaar seeding for NREGA cards by the end of the financial year.  By August 2023 itself, 6 Crore workers had [fallen out](https://www.epw.in/journal/2023/38/commentary/aadhaar-mandate-mass-job-card-deletions.html?ref=static.internetfreedom.in) of the scheme for not linking their aadhaars. According to a [statement](https://x.com/NREGA_Sangharsh/status/1742882924897395188?s=20&ref=static.internetfreedom.in)  by NREGA Sangharsh Morcha, as the MoRD began steps to make ABPS  mandatory between 2022-23, NREGA account deletions shot up. Workers  whose bank accounts are not linked with their Aadhaar cards continue to  be deleted from the central NREGA system, and forced to [drop out](https://www.newsclick.in/aadhaar-based-wages-labelling-89cr-mgnrega-workers-ineligible-shows-utter-disregard-poor?ref=static.internetfreedom.in)  of the scheme. Reportedly, while job cards of 4.74% of the total  workers were deleted in 2021-22, this number reached nearly 19% in  2022-23 and 7.72% in 2023-24. In less than two years, 7.6 crore job  cards have been [deleted](https://thewire.in/labour/union-government-may-consider-case-by-case-exemptions-to-abps-mgnregs?ref=static.internetfreedom.in) from the system. \n\nBut  how does the system work? ABPS uses a worker’s aadhaar number as their  financial address for where their wage payment goes. It needs three  linkages to initiate and process the payment. [This article](https://www.epw.in/journal/2023/38/commentary/aadhaar-mandate-mass-job-card-deletions.html?ref=static.internetfreedom.in) from Economic and Political Weekly breaks it down best: \n\n>*First,  a worker’s Aadhaar number must be seeded to her job card. Second, her  Aadhaar must be seeded to her bank account via eKYC. Third, the worker’s  Aadhaar must be linked to her bank’s Institutional Identification  Number (IIN) in a “mapper” (or database) created by the National  Payments Corporation of India (NPCI), which acts as the union  government’s payments clearing house.*   \n>  \n>*In  the case of multiple accounts for the same person, the ABPS  automatically sends money to the latest NPCI-mapped account. Only if all  of these links are completed, will a worker’s wage payment be  processed.* ***With mandatory ABPS, even if a worker has worked  under the MGNREGA, and if she is not eligible for ABPS, she cannot  receive her wages.***\n\nThe probabilities of  failure at any point of this transaction is high, as is evidenced by the  large fallout numbers. Even if workers go to banks to get their  payments authenticated, [field studies](https://www.ideasforindia.in/topics/governance/consent-to-nothing-aadhaar-based-payment-systems-in-welfare.html?ref=static.internetfreedom.in)  have shown that bank officials are often in a rush and under pressure  to meet aadhaar seeding targets, leading them to making data entry  errors and flouting consent norms. [Reports show](https://www.thehindu.com/opinion/op-ed/the-efficiency-myth-of-aadhaar-linking/article38067084.ece?ref=static.internetfreedom.in)  that NCPI’s mapper software frequently runs errors and misdirects  payments, which are near impossible to resolve at the local level,  because the nodal aadhaar body, Unique Identification Authority of  India, has no dedicated grievance redress or social audit mechanisms for  workers. Mandatory ABPS continues to have a grave impact on the NREGA  framework. These frequent and pervasive payment failures have even [discouraged workers](https://www.thehindu.com/opinion/op-ed/the-efficiency-myth-of-aadhaar-linking/article38067084.ece?ref=static.internetfreedom.in) from applying for work under the Act. \n\nMoRD  introduced this scheme with an intention to eliminate duplicate  workers’ accounts and reduce wage payment delays. To date, there has  been [little evidence](https://www.thehindu.com/opinion/op-ed/aadhaar-based-pay-a-bad-idea-for-mgnregs/article67786940.ece?ref=static.internetfreedom.in)  in the form of public audits or annual reports from the Ministry to  show that these targets have been met. Instead, reports of exclusion and  widening social unsecurity are far and wide. When the delivery of a  statutory right depends on whether an individual has linked their  aadhaar information to their entitlement, the exclusion becomes grave  and potentially unconstitutional. Section 3 of the Act guarantees every  person who has done the work given to them under the Act wages at the  wage rate for each day of work. Because of externalities outside the  control of the workers, such as technical failures, their basic right  under Section 3 is not being met.\n\nNot only exclusion, but ABPS  raises alarms for cyber fraud vulnerabilities among workers by virtue of  aadhaar data being vulnerable to cloning and data leaks. The pitfalls  of ABPS far outweigh the benefits (if any). So one still wonders why  ABPS was brought in in 2023, and why, even after noting its tremendous  failure, has it been made mandatory again in 2024.\n\n### NREGA Mobile Monitoring System\n\nDemonstrations  around ABPS are not the first time NREGA workers are demonstrating  their dissatisfaction with digital government interventions. The NREGA  Mobile Monitoring System (“NMMS”) App which was made mandatory for  workers to mark their attendance on last year, raised its own league of  problems – exacerbating digital inaccessibility and costing them their  daily wages. \n\nMoRD introduced the NMMS app in May 2022 and made it  mandatory to record attendance of NREGA workers from January 2023. The  app has to be downloaded by “NREGA mates”, who will then capture  photographs of workers at the worksite, tag it with time and  geographical stamps twice a day – when they come to work, and once late  afternoon, before they leave. [Reportedly](https://www.codastory.com/authoritarian-tech/app-watches-indias-workers/?ref=static.internetfreedom.in),  workers are facing loss of wages due to the app malfunctioning and  network connectivity gaps due to which workers are unable to mark their  attendance. Further, the app is in English, and most rural workers have  been unable to navigate it. \n\nIn [IFF’s conversation with NREGA workers](https://www.youtube.com/watch?v=YY_N2SLmJM8&ref=static.internetfreedom.in)  sitting in protest at Jantar Mantar in March 2023 against the NMMS app,  we found out that due to technical glitches and low levels of digital  literacy, workers are not able to claim their rightful wages under the  Act. In Bihar, Chhattisgarh, Jharkhand, Karnataka, Rajasthan, Uttar  Pradesh, West Bengal and other states, the mandatory imposition of the  NMMS App has caused [many problems](https://thewire.in/tech/nrega-workers-nmms-app-protest?ref=static.internetfreedom.in) in similar vein. NREGA Sangharsh Morcha’s [statement](https://www.scribd.com/document/625693767/Open-Letter-to-MoRD-NREGA-Sangharsh-Morcha-English?ref=static.internetfreedom.in)  notes that the poor design of the apps lends to workers being subjected  to pay cuts and not receiving their compensation, which they are  statutorily entitled to receive within 15 days. \n\nWhile offline uploading of NMMS attendance and photographs has been introduced, the facility is still [not operational](https://www.thehindu.com/news/national/clean-swipe-for-mgnregs-attendance-app-only-in-8-states/article65980923.ece?ref=static.internetfreedom.in)  in many areas and states. The introduction of the app has created a  wave of confusion among workers and NREGA mates at worksites, and led  them to live in the fear of not getting attendance everyday due to any  number of reasons. There is also added overhead, where a [story reported](https://www.article-14.com/post/nrega-workers-are-losing-wages-because-of-mandatory-app-attendance--62c39de7b5d3d/?ref=static.internetfreedom.in) that “*Workers  are finding this \\[app\\] absurd because they are being told to stay back  in the heat after their work hours so mates can click their photos and  upload them*,” which may even disproportionately impact female workers who have responsibilities at home.\n\n### Worker surveillance\n\nGoing a step further, union and state governments have also been planning or piloting [electronic surveillance](https://www.thehindu.com/news/national/drones-to-monitor-mgnrega-worksites/article67205578.ece?ref=static.internetfreedom.in)  of scheme workers through drones and facial recognition technologies.  We worry that surveillance of scheme workers will raise several alarms  for their rights to privacy, dignity, and free movement. \n\nIn November 2023, MoRD [revealed an SOP](https://nregaplus.nic.in/netnrega/writereaddata/Circulars/24742-MGNREGA_SOP_DRONE_Bilingual(E&H)_Final_29.11.2023.pdf?ref=static.internetfreedom.in)  for monitoring NREGA workers using drone technology. Beyond existing  worker monitoring mechanisms under NREGA, which include physical  inspections, geo-tagging of sites, ombudsmen audits and feedback and  grievance redress mechanisms, MoRD has set up a drone system for regular  worker monitoring, “special inspections” and real-time status tracking  of work, and assessing the quality of NREGA assets. Further, data  collected by drones may be used by the ombudsmen for enquiring into  complaints against the work/asset. How expansively and to what extent  the drones are utilised for these purposes is left up to the  states/UTs. \n\nMoreover, there are [plans to launch](https://theprint.in/india/governance/modi-govt-plans-face-authentication-for-mgnregs-attendance-eyes-2024-launch/1887436/?ref=static.internetfreedom.in)  facial recognition technology-based worker authentication at sites in  2024. Privacy-invasive surveillance tools cannot be deployed in the  absence of specific legal safeguards, which India currently lacks.  Facial recognition-based authentication is also a [highly inaccurate](https://unbiasthenews.org/no-facing-away-why-indias-facial-recognition-system-is-bad-news-for-minorities/?ref=static.internetfreedom.in)  tool, and is more likely to inaccurately identify on the basis of  gender, age and complexion, yielding low accuracy rates for a diverse  Indian cultural landscape. Given that large numbers of these workers  come from caste and class marginalisations, exposing their faces to  potential surveillance tools like FRT is a human rights concern and  glaring cause for worry. Constant worksite surveillance further has  implications on the rights of workers to freedom of movement, speech, to  privacy, and to live their lives freely and with dignity (read our  detailed constitutional analysis of FR\n\nTs [here](https://drive.google.com/file/d/1fEEmMn0ActuTbgrhgjF4oLKpUF6DkA3i/view?usp=sharing&ref=static.internetfreedom.in)).  The use of flawed and dangerous authentication systems such as facial  recognition may be potentially fatal to the scheme and lead to more and  more workers falling through the cracks.\n\n## Who did you ask?\n\nWhat  do all three of these interventions have in common? The lack of public  consultations and stakeholder participation at every level of their  integration with NREGA. If the policy-makers asked NREGA workers how  digital tools could help them in realising their rights under the Act,  the situation would be very different, and probably none of these  interventions would exist. An integral aspect of deliberative democracy  is bottom-up citizen engagement. NREGA is a law of the people, but the  techno-solutionism being thrust into it does not seem to serve the  interests of the people. Introducing technological interventions in the  domain of social security and welfare delivery without addressing the  digital divide and low rates of internet literacy in the country is a  policy move that is bound to exclude and violate the fundamental rights  of many. \n\nHelp us watch the watchmen.  \n[Donate Now](https://static.internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 2,
    "created_utc": 1708424370.0,
    "convurl": "https://b.thumbs.redditmedia.com/U9kH46DyQIpdOY3MVOlgdWobfGlki-T9Aot_Zwz7X6A.jpg",
    "comments": [
        "Digitization isn't a bad thing if done properly. It helps in combating mismanagement of funds and abuse too. But the issue is this government just bulldozes through implementing new ideas without proper discussions or you know like a alpha test then a beta test then a full launch. We have so many IT companies, they could spend some money and seriously overhaul and a lot of systems. I also dislike the fact that they treat everyone by the lens of gujarat or UP. What is applicable in one state won't be in another, these sort of things should be state's responsibility because they know their constituents better. Centre should focus on other things."
    ],
    "cleaned_text": "place tech digital interventions nrega undermining rural social security httpsinternetfreedominnoplacefortechinnregahttpspreviewredditmzbtipnupjcjpgwidthformatpjpgautowebpscbecabcbfbbdedbba tldr recent years attempts indias union state governments introduce digital interventions nrega including biometricbased payment attendance worker verification systems worker site surveillance direct adverse effect rural workers constitutionally guaranteed right equality employment fair wage dignity privacy leading largescale disempowerment exclusion workers across indian states blog critically examines digital interventions place scheme reiterates arguments made workers integration nrega framework background february marked years since mahatma gandhi national rural employment guarantee act nrega enacted years employed rural populations unskilled labour exchange guaranteed minimum wage protection constitutional rights livelihood live life dignity though statutory safetynet breached socioeconomic externalitieshttpswwwdowntoearthorginblogeconomymgnregaisfailingreasonswhyrefstaticinternetfreedomin funding criseshttpswwwthehinducomnewsnationalmgnregsrunsoutoffundsruraldevelopmentministryseekssupplementarybudgetarticleecerefstaticinternetfreedomin times years programme able amass labour force million registered workershttpswwwdowntoearthorginblogeconomyrunuptointerimbudgettheminimumnregabudgetforfymustberslakhcrorerefstaticinternetfreedomin continue reap protections set stone act new unmet challenges emerge since january indias union state governments set integrate digital technologies programme including biometricbased payment attendance worker verification systems well worker site surveillance digitisation programme built welfare economically disenfranchised lowliteracy populations direct adverse effect workers constitutionally guaranteed right employment fair wage dignity privacy digital technologies explored detail disrupt lawpolicy framework indias rural employment guarantee scheme set back clock communityled reform propelled nrega successes able achieve digital interventions nature come form basis implementation nrega programme seem ignorant indian digital divide fail meet objectives act including foundational promise guaranteeing social security rural populations place technology nrega deemed largesthttpswwwbusinessstandardcomarticleptistoriesmnregaworldslargestpublicworksprogrammeworldbankhtmlrefstaticinternetfreedomin public works programme world watershed social security legislation provided safetynet economically underprivileged families india nearly two decades act supplementing schemes founded public advocacy civil society effortshttpswwwpriaorgknowledgeresourceyearsinthemgnregastorypdfrefstaticinternetfreedomin demands made loud clear rural employment opportunities provided union along complete transparency assurance wage payments result legislation communityled charter workers rights entitlements strong basis equitable social security empowers large demographic country claim employment benefits constitutional right however recent times robust framework undermined rapid pace due introduction programmatic digital interventions since union ministry rural development mord ministry started rolling technological solutions scheme issues around inaccess inaccuracy exclusion disenfranchisement instantaneously become visible explored detail sections aadhaarbased payment system january mord made use aadhaarbased payment system abps mandatory payment wages rural workers nrega new notificationhttpswwwcnbctvcomeconomymgnregaschemeworkersgirirajsinghstatesaadharhtmrefstaticinternetfreedomin mandates workers link aadhar nrega job cards mord announced noncompliance met penalties move met pushback workershttpswwwnewsclickintnagriculturalworkersprotestabpsmgnregademandhigherbudgetallocationandtimelydisbursalrefstaticinternetfreedomin statements concerns local leadershttpswwwdeccanheraldcomindiamakingaadhaarbasedpaymentsystemmandatoryanassaultonmgnregacpimrefstaticinternetfreedomin first time ministry made move make aadhaar mandatory january asked state governments achieve aadhaar seeding nrega cards end financial year august crore workers fallen outhttpswwwepwinjournalcommentaryaadhaarmandatemassjobcarddeletionshtmlrefstaticinternetfreedomin scheme linking aadhaars according statementhttpsxcomnregasangharshstatussrefstaticinternetfreedomin nrega sangharsh morcha mord began steps make abps mandatory nrega account deletions shot workers whose bank accounts linked aadhaar cards continue deleted central nrega system forced drop outhttpswwwnewsclickinaadhaarbasedwageslabellingcrmgnregaworkersineligibleshowsutterdisregardpoorrefstaticinternetfreedomin scheme reportedly job cards total workers deleted number reached nearly less two years crore job cards deletedhttpsthewireinlabouruniongovernmentmayconsidercasebycaseexemptionstoabpsmgnregsrefstaticinternetfreedomin system system work abps uses workers aadhaar number financial address wage payment goes needs three linkages initiate process payment articlehttpswwwepwinjournalcommentaryaadhaarmandatemassjobcarddeletionshtmlrefstaticinternetfreedomin economic political weekly breaks best first workers aadhaar number must seeded job card second aadhaar must seeded bank account via ekyc third workers aadhaar must linked banks institutional identification number iin mapper database created national payments corporation india npci acts union governments payments clearing house case multiple accounts person abps automatically sends money latest npcimapped account links completed workers wage payment processed mandatory abps even worker worked mgnrega eligible abps receive wages probabilities failure point transaction high evidenced large fallout numbers even workers go banks get payments authenticated field studieshttpswwwideasforindiaintopicsgovernanceconsenttonothingaadhaarbasedpaymentsystemsinwelfarehtmlrefstaticinternetfreedomin shown bank officials often rush pressure meet aadhaar seeding targets leading making data entry errors flouting consent norms reports showhttpswwwthehinducomopinionopedtheefficiencymythofaadhaarlinkingarticleecerefstaticinternetfreedomin ncpis mapper software frequently runs errors misdirects payments near impossible resolve local level nodal aadhaar body unique identification authority india dedicated grievance redress social audit mechanisms workers mandatory abps continues grave impact nrega framework frequent pervasive payment failures even discouraged workershttpswwwthehinducomopinionopedtheefficiencymythofaadhaarlinkingarticleecerefstaticinternetfreedomin applying work act mord introduced scheme intention eliminate duplicate workers accounts reduce wage payment delays date little evidencehttpswwwthehinducomopinionopedaadhaarbasedpayabadideaformgnregsarticleecerefstaticinternetfreedomin form public audits annual reports ministry show targets met instead reports exclusion widening social unsecurity far wide delivery statutory right depends whether individual linked aadhaar information entitlement exclusion becomes grave potentially unconstitutional section act guarantees every person done work given act wages wage rate day work externalities outside control workers technical failures basic right section met exclusion abps raises alarms cyber fraud vulnerabilities among workers virtue aadhaar data vulnerable cloning data leaks pitfalls abps far outweigh benefits one still wonders abps brought even noting tremendous failure made mandatory nrega mobile monitoring system demonstrations around abps first time nrega workers demonstrating dissatisfaction digital government interventions nrega mobile monitoring system nmms app made mandatory workers mark attendance last year raised league problems exacerbating digital inaccessibility costing daily wages mord introduced nmms app may made mandatory record attendance nrega workers january app downloaded nrega mates capture photographs workers worksite tag time geographical stamps twice day come work late afternoon leave reportedlyhttpswwwcodastorycomauthoritariantechappwatchesindiasworkersrefstaticinternetfreedomin workers facing loss wages due app malfunctioning network connectivity gaps due workers unable mark attendance app english rural workers unable navigate iffs conversation nrega workershttpswwwyoutubecomwatchvyynslmjmrefstaticinternetfreedomin sitting protest jantar mantar march nmms app found due technical glitches low levels digital literacy workers able claim rightful wages act bihar chhattisgarh jharkhand karnataka rajasthan uttar pradesh west bengal states mandatory imposition nmms app caused many problemshttpsthewireintechnregaworkersnmmsappprotestrefstaticinternetfreedomin similar vein nrega sangharsh morchas statementhttpswwwscribdcomdocumentopenlettertomordnregasangharshmorchaenglishrefstaticinternetfreedomin notes poor design apps lends workers subjected pay cuts receiving compensation statutorily entitled receive within days offline uploading nmms attendance photographs introduced facility still operationalhttpswwwthehinducomnewsnationalcleanswipeformgnregsattendanceapponlyinstatesarticleecerefstaticinternetfreedomin many areas states introduction app created wave confusion among workers nrega mates worksites led live fear getting attendance everyday due number reasons also added overhead story reportedhttpswwwarticlecompostnregaworkersarelosingwagesbecauseofmandatoryappattendancecdebddrefstaticinternetfreedomin workers finding app absurd told stay back heat work hours mates click photos upload may even disproportionately impact female workers responsibilities home worker surveillance going step union state governments also planning piloting electronic surveillancehttpswwwthehinducomnewsnationaldronestomonitormgnregaworksitesarticleecerefstaticinternetfreedomin scheme workers drones facial recognition technologies worry surveillance scheme workers raise several alarms rights privacy dignity free movement november mord revealed sophttpsnregaplusnicinnetnregawritereaddatacircularsmgnregasopdronebilingualehfinalpdfrefstaticinternetfreedomin monitoring nrega workers using drone technology beyond existing worker monitoring mechanisms nrega include physical inspections geotagging sites ombudsmen audits feedback grievance redress mechanisms mord set drone system regular worker monitoring special inspections realtime status tracking work assessing quality nrega assets data collected drones may used ombudsmen enquiring complaints workasset expansively extent drones utilised purposes left statesuts moreover plans launchhttpstheprintinindiagovernancemodigovtplansfaceauthenticationformgnregsattendanceeyeslaunchrefstaticinternetfreedomin facial recognition technologybased worker authentication sites privacyinvasive surveillance tools deployed absence specific legal safeguards india currently lacks facial recognitionbased authentication also highly inaccuratehttpsunbiasthenewsorgnofacingawaywhyindiasfacialrecognitionsystemisbadnewsforminoritiesrefstaticinternetfreedomin tool likely inaccurately identify basis gender age complexion yielding low accuracy rates diverse indian cultural landscape given large numbers workers come caste class marginalisations exposing faces potential surveillance tools like frt human rights concern glaring cause worry constant worksite surveillance implications rights workers freedom movement speech privacy live lives freely dignity read detailed constitutional analysis fr ts herehttpsdrivegooglecomfiledfeemmnactutbgrhgjfolkpufdkaiviewuspsharingrefstaticinternetfreedomin use flawed dangerous authentication systems facial recognition may potentially fatal scheme lead workers falling cracks ask three interventions common lack public consultations stakeholder participation every level integration nrega policymakers asked nrega workers digital tools could help realising rights act situation would different probably none interventions would exist integral aspect deliberative democracy bottomup citizen engagement nrega law people technosolutionism thrust seem serve interests people introducing technological interventions domain social security welfare delivery without addressing digital divide low rates internet literacy country policy move bound exclude violate fundamental rights many help us watch watchmen donate nowhttpsstaticinternetfreedomindonate ",
    "cleaned_title": "place tech digital interventions nrega undermining rural social security",
    "cleaned_selftext": "httpsinternetfreedominnoplacefortechinnregahttpspreviewredditmzbtipnupjcjpgwidthformatpjpgautowebpscbecabcbfbbdedbba tldr recent years attempts indias union state governments introduce digital interventions nrega including biometricbased payment attendance worker verification systems worker site surveillance direct adverse effect rural workers constitutionally guaranteed right equality employment fair wage dignity privacy leading largescale disempowerment exclusion workers across indian states blog critically examines digital interventions place scheme reiterates arguments made workers integration nrega framework background february marked years since mahatma gandhi national rural employment guarantee act nrega enacted years employed rural populations unskilled labour exchange guaranteed minimum wage protection constitutional rights livelihood live life dignity though statutory safetynet breached socioeconomic externalitieshttpswwwdowntoearthorginblogeconomymgnregaisfailingreasonswhyrefstaticinternetfreedomin funding criseshttpswwwthehinducomnewsnationalmgnregsrunsoutoffundsruraldevelopmentministryseekssupplementarybudgetarticleecerefstaticinternetfreedomin times years programme able amass labour force million registered workershttpswwwdowntoearthorginblogeconomyrunuptointerimbudgettheminimumnregabudgetforfymustberslakhcrorerefstaticinternetfreedomin continue reap protections set stone act new unmet challenges emerge since january indias union state governments set integrate digital technologies programme including biometricbased payment attendance worker verification systems well worker site surveillance digitisation programme built welfare economically disenfranchised lowliteracy populations direct adverse effect workers constitutionally guaranteed right employment fair wage dignity privacy digital technologies explored detail disrupt lawpolicy framework indias rural employment guarantee scheme set back clock communityled reform propelled nrega successes able achieve digital interventions nature come form basis implementation nrega programme seem ignorant indian digital divide fail meet objectives act including foundational promise guaranteeing social security rural populations place technology nrega deemed largesthttpswwwbusinessstandardcomarticleptistoriesmnregaworldslargestpublicworksprogrammeworldbankhtmlrefstaticinternetfreedomin public works programme world watershed social security legislation provided safetynet economically underprivileged families india nearly two decades act supplementing schemes founded public advocacy civil society effortshttpswwwpriaorgknowledgeresourceyearsinthemgnregastorypdfrefstaticinternetfreedomin demands made loud clear rural employment opportunities provided union along complete transparency assurance wage payments result legislation communityled charter workers rights entitlements strong basis equitable social security empowers large demographic country claim employment benefits constitutional right however recent times robust framework undermined rapid pace due introduction programmatic digital interventions since union ministry rural development mord ministry started rolling technological solutions scheme issues around inaccess inaccuracy exclusion disenfranchisement instantaneously become visible explored detail sections aadhaarbased payment system january mord made use aadhaarbased payment system abps mandatory payment wages rural workers nrega new notificationhttpswwwcnbctvcomeconomymgnregaschemeworkersgirirajsinghstatesaadharhtmrefstaticinternetfreedomin mandates workers link aadhar nrega job cards mord announced noncompliance met penalties move met pushback workershttpswwwnewsclickintnagriculturalworkersprotestabpsmgnregademandhigherbudgetallocationandtimelydisbursalrefstaticinternetfreedomin statements concerns local leadershttpswwwdeccanheraldcomindiamakingaadhaarbasedpaymentsystemmandatoryanassaultonmgnregacpimrefstaticinternetfreedomin first time ministry made move make aadhaar mandatory january asked state governments achieve aadhaar seeding nrega cards end financial year august crore workers fallen outhttpswwwepwinjournalcommentaryaadhaarmandatemassjobcarddeletionshtmlrefstaticinternetfreedomin scheme linking aadhaars according statementhttpsxcomnregasangharshstatussrefstaticinternetfreedomin nrega sangharsh morcha mord began steps make abps mandatory nrega account deletions shot workers whose bank accounts linked aadhaar cards continue deleted central nrega system forced drop outhttpswwwnewsclickinaadhaarbasedwageslabellingcrmgnregaworkersineligibleshowsutterdisregardpoorrefstaticinternetfreedomin scheme reportedly job cards total workers deleted number reached nearly less two years crore job cards deletedhttpsthewireinlabouruniongovernmentmayconsidercasebycaseexemptionstoabpsmgnregsrefstaticinternetfreedomin system system work abps uses workers aadhaar number financial address wage payment goes needs three linkages initiate process payment articlehttpswwwepwinjournalcommentaryaadhaarmandatemassjobcarddeletionshtmlrefstaticinternetfreedomin economic political weekly breaks best first workers aadhaar number must seeded job card second aadhaar must seeded bank account via ekyc third workers aadhaar must linked banks institutional identification number iin mapper database created national payments corporation india npci acts union governments payments clearing house case multiple accounts person abps automatically sends money latest npcimapped account links completed workers wage payment processed mandatory abps even worker worked mgnrega eligible abps receive wages probabilities failure point transaction high evidenced large fallout numbers even workers go banks get payments authenticated field studieshttpswwwideasforindiaintopicsgovernanceconsenttonothingaadhaarbasedpaymentsystemsinwelfarehtmlrefstaticinternetfreedomin shown bank officials often rush pressure meet aadhaar seeding targets leading making data entry errors flouting consent norms reports showhttpswwwthehinducomopinionopedtheefficiencymythofaadhaarlinkingarticleecerefstaticinternetfreedomin ncpis mapper software frequently runs errors misdirects payments near impossible resolve local level nodal aadhaar body unique identification authority india dedicated grievance redress social audit mechanisms workers mandatory abps continues grave impact nrega framework frequent pervasive payment failures even discouraged workershttpswwwthehinducomopinionopedtheefficiencymythofaadhaarlinkingarticleecerefstaticinternetfreedomin applying work act mord introduced scheme intention eliminate duplicate workers accounts reduce wage payment delays date little evidencehttpswwwthehinducomopinionopedaadhaarbasedpayabadideaformgnregsarticleecerefstaticinternetfreedomin form public audits annual reports ministry show targets met instead reports exclusion widening social unsecurity far wide delivery statutory right depends whether individual linked aadhaar information entitlement exclusion becomes grave potentially unconstitutional section act guarantees every person done work given act wages wage rate day work externalities outside control workers technical failures basic right section met exclusion abps raises alarms cyber fraud vulnerabilities among workers virtue aadhaar data vulnerable cloning data leaks pitfalls abps far outweigh benefits one still wonders abps brought even noting tremendous failure made mandatory nrega mobile monitoring system demonstrations around abps first time nrega workers demonstrating dissatisfaction digital government interventions nrega mobile monitoring system nmms app made mandatory workers mark attendance last year raised league problems exacerbating digital inaccessibility costing daily wages mord introduced nmms app may made mandatory record attendance nrega workers january app downloaded nrega mates capture photographs workers worksite tag time geographical stamps twice day come work late afternoon leave reportedlyhttpswwwcodastorycomauthoritariantechappwatchesindiasworkersrefstaticinternetfreedomin workers facing loss wages due app malfunctioning network connectivity gaps due workers unable mark attendance app english rural workers unable navigate iffs conversation nrega workershttpswwwyoutubecomwatchvyynslmjmrefstaticinternetfreedomin sitting protest jantar mantar march nmms app found due technical glitches low levels digital literacy workers able claim rightful wages act bihar chhattisgarh jharkhand karnataka rajasthan uttar pradesh west bengal states mandatory imposition nmms app caused many problemshttpsthewireintechnregaworkersnmmsappprotestrefstaticinternetfreedomin similar vein nrega sangharsh morchas statementhttpswwwscribdcomdocumentopenlettertomordnregasangharshmorchaenglishrefstaticinternetfreedomin notes poor design apps lends workers subjected pay cuts receiving compensation statutorily entitled receive within days offline uploading nmms attendance photographs introduced facility still operationalhttpswwwthehinducomnewsnationalcleanswipeformgnregsattendanceapponlyinstatesarticleecerefstaticinternetfreedomin many areas states introduction app created wave confusion among workers nrega mates worksites led live fear getting attendance everyday due number reasons also added overhead story reportedhttpswwwarticlecompostnregaworkersarelosingwagesbecauseofmandatoryappattendancecdebddrefstaticinternetfreedomin workers finding app absurd told stay back heat work hours mates click photos upload may even disproportionately impact female workers responsibilities home worker surveillance going step union state governments also planning piloting electronic surveillancehttpswwwthehinducomnewsnationaldronestomonitormgnregaworksitesarticleecerefstaticinternetfreedomin scheme workers drones facial recognition technologies worry surveillance scheme workers raise several alarms rights privacy dignity free movement november mord revealed sophttpsnregaplusnicinnetnregawritereaddatacircularsmgnregasopdronebilingualehfinalpdfrefstaticinternetfreedomin monitoring nrega workers using drone technology beyond existing worker monitoring mechanisms nrega include physical inspections geotagging sites ombudsmen audits feedback grievance redress mechanisms mord set drone system regular worker monitoring special inspections realtime status tracking work assessing quality nrega assets data collected drones may used ombudsmen enquiring complaints workasset expansively extent drones utilised purposes left statesuts moreover plans launchhttpstheprintinindiagovernancemodigovtplansfaceauthenticationformgnregsattendanceeyeslaunchrefstaticinternetfreedomin facial recognition technologybased worker authentication sites privacyinvasive surveillance tools deployed absence specific legal safeguards india currently lacks facial recognitionbased authentication also highly inaccuratehttpsunbiasthenewsorgnofacingawaywhyindiasfacialrecognitionsystemisbadnewsforminoritiesrefstaticinternetfreedomin tool likely inaccurately identify basis gender age complexion yielding low accuracy rates diverse indian cultural landscape given large numbers workers come caste class marginalisations exposing faces potential surveillance tools like frt human rights concern glaring cause worry constant worksite surveillance implications rights workers freedom movement speech privacy live lives freely dignity read detailed constitutional analysis fr ts herehttpsdrivegooglecomfiledfeemmnactutbgrhgjfolkpufdkaiviewuspsharingrefstaticinternetfreedomin use flawed dangerous authentication systems facial recognition may potentially fatal scheme lead workers falling cracks ask three interventions common lack public consultations stakeholder participation every level integration nrega policymakers asked nrega workers digital tools could help realising rights act situation would different probably none interventions would exist integral aspect deliberative democracy bottomup citizen engagement nrega law people technosolutionism thrust seem serve interests people introducing technological interventions domain social security welfare delivery without addressing digital divide low rates internet literacy country policy move bound exclude violate fundamental rights many help us watch watchmen donate nowhttpsstaticinternetfreedomindonate",
    "cleaned_comments": "digitization isnt bad thing done properly helps combating mismanagement funds abuse issue government bulldozes implementing new ideas without proper discussions know like alpha test beta test full launch many companies could spend money seriously overhaul lot systems also dislike fact treat everyone lens gujarat applicable one state wont another sort things states responsibility know constituents better centre focus things",
    "light_cleaned_title": "No place for tech: How digital interventions in NREGA are undermining rural social security",
    "light_cleaned_selftext": "[https:\\/\\/internetfreedom.in\\/no-place-for-tech-in-nrega\\/](https://preview.redd.it/mzbti6pnupjc1.jpg?width=1600&format=pjpg&auto=webp&s=cb582191367655ec2a0b3c0bf818bbd4edbb9a06) ## tl;dr In recent years, attempts by India’s union and state governments to introduce digital interventions in NREGA, including biometric-based payment, attendance and worker verification systems, or worker site surveillance, have had a direct and adverse effect on rural workers and their constitutionally guaranteed right to equality, employment, fair wage, dignity, and privacy. They are leading to large-scale disempowerment and exclusion of workers across Indian states. This blog critically examines the digital interventions and their place in the scheme, and reiterates arguments made by workers against their integration into the NREGA framework. ## Background February 02, 2024 marked 18 years since the Mahatma Gandhi National Rural Employment Guarantee Act (“NREGA”) was enacted. For 18 years, it has employed rural populations in unskilled labour in exchange for a guaranteed minimum wage and the protection of their constitutional rights to a livelihood and to live life with dignity. Though the statutory safetynet has been breached by [socio-economic externalities](https://www.downtoearth.org.in/blog/economy/mgnrega-is-failing-10-reasons-why-62035?ref=static.internetfreedom.in) and [funding crises](https://www.thehindu.com/news/national/mgnregs-runs-out-of-funds-rural-development-ministry-seeks-supplementary-budget/article67390326.ece?ref=static.internetfreedom.in) a few times in these 18 years, the programme has been able to amass a labour force of [250 million registered workers](https://www.downtoearth.org.in/blog/economy/runup-to-interim-budget-2024-the-minimum-nrega-budget-for-fy-2024-25-must-be-rs-2-71-lakh-crore-94184?ref=static.internetfreedom.in) who continue to reap protections set in stone by the 2005 Act. But now, new and unmet challenges emerge. Since January 2023, India’s union and state governments have set out to integrate digital technologies into the programme, including biometric-based payment, attendance and worker verification systems, as well as worker site surveillance. The digitisation of a programme built for the welfare of economically disenfranchised and low-literacy populations has a direct and adverse effect on the workers and their constitutionally guaranteed right to employment, fair wage, dignity, and privacy. The digital technologies, explored in detail below, disrupt the law-policy framework of India’s rural employment guarantee scheme and set back the clock on community-led reform that has propelled NREGA to the successes it has been able to achieve. Digital interventions of this nature, which have now come to form the basis of the implementation of the NREGA programme, seem ignorant to the Indian digital divide and fail to meet the objectives of the Act – including its foundational promise of guaranteeing social security to rural populations. ## No place for technology NREGA, deemed the [largest](https://www.business-standard.com/article/pti-stories/mnrega-world-s-largest-public-works-programme-world-bank-115070701470_1.html?ref=static.internetfreedom.in) public works programme in the world, is a watershed social security legislation that has provided a safetynet to economically underprivileged families in India for nearly two decades. The Act and supplementing schemes are founded in public advocacy and [civil society efforts](https://www.pria.org/knowledge_resource/1621863093_1618822426_1618816284_15%20years%20in-the%20mgnrega%20story1.pdf?ref=static.internetfreedom.in) – demands were made loud and clear for rural employment opportunities to be provided by the union, along with complete transparency and assurance of wage payments. As a result, the legislation is a community-led charter of workers’ rights and entitlements with a strong basis in equitable social security, which empowers a large demographic of the country to claim employment and benefits as a constitutional right. However, in recent times, its robust framework is being undermined at a rapid pace due to the introduction of programmatic digital interventions. Since the union Ministry of Rural Development (“MoRD”, “Ministry”) has started rolling technological “solutions” to the scheme, issues around inaccess, inaccuracy, exclusion and disenfranchisement have instantaneously become visible, as explored in more detail in the sections below. ### Aadhaar-based Payment System On January 01, 2024, MoRD made the use of Aadhaar-Based Payment System (“ABPS”) mandatory for the payment of wages to rural workers under NREGA. The [new notification](https://www.cnbctv18.com/economy/mgnrega-scheme-workers-giriraj-singh-states-aadhar-18701161.htm?ref=static.internetfreedom.in) mandates workers to link their Aadhar with their NREGA job cards, and as MoRD announced, non-compliance will be met with penalties. This move was met with pushback from [workers](https://www.newsclick.in/tn-agricultural-workers-protest-abps-mgnrega-demand-higher-budget-allocation-and-timely-disbursal?ref=static.internetfreedom.in) and statements of concerns by [local leaders](https://www.deccanherald.com/india/making-aadhaar-based-payment-system-mandatory-an-assault-on-mgnrega-cpim-2832861?ref=static.internetfreedom.in). This is not the first time the Ministry has made a move to make aadhaar mandatory – on January 30, 2023, it asked state governments to achieve 100% aadhaar seeding for NREGA cards by the end of the financial year. By August 2023 itself, 6 Crore workers had [fallen out](https://www.epw.in/journal/2023/38/commentary/aadhaar-mandate-mass-job-card-deletions.html?ref=static.internetfreedom.in) of the scheme for not linking their aadhaars. According to a [statement](https://x.com/NREGA_Sangharsh/status/1742882924897395188?s=20&ref=static.internetfreedom.in) by NREGA Sangharsh Morcha, as the MoRD began steps to make ABPS mandatory between 2022-23, NREGA account deletions shot up. Workers whose bank accounts are not linked with their Aadhaar cards continue to be deleted from the central NREGA system, and forced to [drop out](https://www.newsclick.in/aadhaar-based-wages-labelling-89cr-mgnrega-workers-ineligible-shows-utter-disregard-poor?ref=static.internetfreedom.in) of the scheme. Reportedly, while job cards of 4.74% of the total workers were deleted in 2021-22, this number reached nearly 19% in 2022-23 and 7.72% in 2023-24. In less than two years, 7.6 crore job cards have been [deleted](https://thewire.in/labour/union-government-may-consider-case-by-case-exemptions-to-abps-mgnregs?ref=static.internetfreedom.in) from the system. But how does the system work? ABPS uses a worker’s aadhaar number as their financial address for where their wage payment goes. It needs three linkages to initiate and process the payment. [This article](https://www.epw.in/journal/2023/38/commentary/aadhaar-mandate-mass-job-card-deletions.html?ref=static.internetfreedom.in) from Economic and Political Weekly breaks it down best: >*First, a worker’s Aadhaar number must be seeded to her job card. Second, her Aadhaar must be seeded to her bank account via eKYC. Third, the worker’s Aadhaar must be linked to her bank’s Institutional Identification Number (IIN) in a “mapper” (or database) created by the National Payments Corporation of India (NPCI), which acts as the union government’s payments clearing house.* > >*In the case of multiple accounts for the same person, the ABPS automatically sends money to the latest NPCI-mapped account. Only if all of these links are completed, will a worker’s wage payment be processed.* ***With mandatory ABPS, even if a worker has worked under the MGNREGA, and if she is not eligible for ABPS, she cannot receive her wages.*** The probabilities of failure at any point of this transaction is high, as is evidenced by the large fallout numbers. Even if workers go to banks to get their payments authenticated, [field studies](https://www.ideasforindia.in/topics/governance/consent-to-nothing-aadhaar-based-payment-systems-in-welfare.html?ref=static.internetfreedom.in) have shown that bank officials are often in a rush and under pressure to meet aadhaar seeding targets, leading them to making data entry errors and flouting consent norms. [Reports show](https://www.thehindu.com/opinion/op-ed/the-efficiency-myth-of-aadhaar-linking/article38067084.ece?ref=static.internetfreedom.in) that NCPI’s mapper software frequently runs errors and misdirects payments, which are near impossible to resolve at the local level, because the nodal aadhaar body, Unique Identification Authority of India, has no dedicated grievance redress or social audit mechanisms for workers. Mandatory ABPS continues to have a grave impact on the NREGA framework. These frequent and pervasive payment failures have even [discouraged workers](https://www.thehindu.com/opinion/op-ed/the-efficiency-myth-of-aadhaar-linking/article38067084.ece?ref=static.internetfreedom.in) from applying for work under the Act. MoRD introduced this scheme with an intention to eliminate duplicate workers’ accounts and reduce wage payment delays. To date, there has been [little evidence](https://www.thehindu.com/opinion/op-ed/aadhaar-based-pay-a-bad-idea-for-mgnregs/article67786940.ece?ref=static.internetfreedom.in) in the form of public audits or annual reports from the Ministry to show that these targets have been met. Instead, reports of exclusion and widening social unsecurity are far and wide. When the delivery of a statutory right depends on whether an individual has linked their aadhaar information to their entitlement, the exclusion becomes grave and potentially unconstitutional. Section 3 of the Act guarantees every person who has done the work given to them under the Act wages at the wage rate for each day of work. Because of externalities outside the control of the workers, such as technical failures, their basic right under Section 3 is not being met. Not only exclusion, but ABPS raises alarms for cyber fraud vulnerabilities among workers by virtue of aadhaar data being vulnerable to cloning and data leaks. The pitfalls of ABPS far outweigh the benefits (if any). So one still wonders why ABPS was brought in in 2023, and why, even after noting its tremendous failure, has it been made mandatory again in 2024. ### NREGA Mobile Monitoring System Demonstrations around ABPS are not the first time NREGA workers are demonstrating their dissatisfaction with digital government interventions. The NREGA Mobile Monitoring System (“NMMS”) App which was made mandatory for workers to mark their attendance on last year, raised its own league of problems – exacerbating digital inaccessibility and costing them their daily wages. MoRD introduced the NMMS app in May 2022 and made it mandatory to record attendance of NREGA workers from January 2023. The app has to be downloaded by “NREGA mates”, who will then capture photographs of workers at the worksite, tag it with time and geographical stamps twice a day – when they come to work, and once late afternoon, before they leave. [Reportedly](https://www.codastory.com/authoritarian-tech/app-watches-indias-workers/?ref=static.internetfreedom.in), workers are facing loss of wages due to the app malfunctioning and network connectivity gaps due to which workers are unable to mark their attendance. Further, the app is in English, and most rural workers have been unable to navigate it. In [IFF’s conversation with NREGA workers](https://www.youtube.com/watch?v=YY_N2SLmJM8&ref=static.internetfreedom.in) sitting in protest at Jantar Mantar in March 2023 against the NMMS app, we found out that due to technical glitches and low levels of digital literacy, workers are not able to claim their rightful wages under the Act. In Bihar, Chhattisgarh, Jharkhand, Karnataka, Rajasthan, Uttar Pradesh, West Bengal and other states, the mandatory imposition of the NMMS App has caused [many problems](https://thewire.in/tech/nrega-workers-nmms-app-protest?ref=static.internetfreedom.in) in similar vein. NREGA Sangharsh Morcha’s [statement](https://www.scribd.com/document/625693767/Open-Letter-to-MoRD-NREGA-Sangharsh-Morcha-English?ref=static.internetfreedom.in) notes that the poor design of the apps lends to workers being subjected to pay cuts and not receiving their compensation, which they are statutorily entitled to receive within 15 days. While offline uploading of NMMS attendance and photographs has been introduced, the facility is still [not operational](https://www.thehindu.com/news/national/clean-swipe-for-mgnregs-attendance-app-only-in-8-states/article65980923.ece?ref=static.internetfreedom.in) in many areas and states. The introduction of the app has created a wave of confusion among workers and NREGA mates at worksites, and led them to live in the fear of not getting attendance everyday due to any number of reasons. There is also added overhead, where a [story reported](https://www.article-14.com/post/nrega-workers-are-losing-wages-because-of-mandatory-app-attendance--62c39de7b5d3d/?ref=static.internetfreedom.in) that “*Workers are finding this \\[app\\] absurd because they are being told to stay back in the heat after their work hours so mates can click their photos and upload them*,” which may even disproportionately impact female workers who have responsibilities at home. ### Worker surveillance Going a step further, union and state governments have also been planning or piloting [electronic surveillance](https://www.thehindu.com/news/national/drones-to-monitor-mgnrega-worksites/article67205578.ece?ref=static.internetfreedom.in) of scheme workers through drones and facial recognition technologies. We worry that surveillance of scheme workers will raise several alarms for their rights to privacy, dignity, and free movement. In November 2023, MoRD [revealed an SOP](https://nregaplus.nic.in/netnrega/writereaddata/Circulars/24742-MGNREGA_SOP_DRONE_Bilingual(E&H)_Final_29.11.2023.pdf?ref=static.internetfreedom.in) for monitoring NREGA workers using drone technology. Beyond existing worker monitoring mechanisms under NREGA, which include physical inspections, geo-tagging of sites, ombudsmen audits and feedback and grievance redress mechanisms, MoRD has set up a drone system for regular worker monitoring, “special inspections” and real-time status tracking of work, and assessing the quality of NREGA assets. Further, data collected by drones may be used by the ombudsmen for enquiring into complaints against the work/asset. How expansively and to what extent the drones are utilised for these purposes is left up to the states/UTs. Moreover, there are [plans to launch](https://theprint.in/india/governance/modi-govt-plans-face-authentication-for-mgnregs-attendance-eyes-2024-launch/1887436/?ref=static.internetfreedom.in) facial recognition technology-based worker authentication at sites in 2024. Privacy-invasive surveillance tools cannot be deployed in the absence of specific legal safeguards, which India currently lacks. Facial recognition-based authentication is also a [highly inaccurate](https://unbiasthenews.org/no-facing-away-why-indias-facial-recognition-system-is-bad-news-for-minorities/?ref=static.internetfreedom.in) tool, and is more likely to inaccurately identify on the basis of gender, age and complexion, yielding low accuracy rates for a diverse Indian cultural landscape. Given that large numbers of these workers come from caste and class marginalisations, exposing their faces to potential surveillance tools like FRT is a human rights concern and glaring cause for worry. Constant worksite surveillance further has implications on the rights of workers to freedom of movement, speech, to privacy, and to live their lives freely and with dignity (read our detailed constitutional analysis of FR Ts [here](https://drive.google.com/file/d/1fEEmMn0ActuTbgrhgjF4oLKpUF6DkA3i/view?usp=sharing&ref=static.internetfreedom.in)). The use of flawed and dangerous authentication systems such as facial recognition may be potentially fatal to the scheme and lead to more and more workers falling through the cracks. ## Who did you ask? What do all three of these interventions have in common? The lack of public consultations and stakeholder participation at every level of their integration with NREGA. If the policy-makers asked NREGA workers how digital tools could help them in realising their rights under the Act, the situation would be very different, and probably none of these interventions would exist. An integral aspect of deliberative democracy is bottom-up citizen engagement. NREGA is a law of the people, but the techno-solutionism being thrust into it does not seem to serve the interests of the people. Introducing technological interventions in the domain of social security and welfare delivery without addressing the digital divide and low rates of internet literacy in the country is a policy move that is bound to exclude and violate the fundamental rights of many. Help us watch the watchmen. [Donate Now](https://static.internetfreedom.in/donate)",
    "light_cleaned_comments": "Digitization isn't a bad thing if done properly. It helps in combating mismanagement of funds and abuse too. But the issue is this government just bulldozes through implementing new ideas without proper discussions or you know like a alpha test then a beta test then a full launch. We have so many IT companies, they could spend some money and seriously overhaul and a lot of systems. I also dislike the fact that they treat everyone by the lens of gujarat or UP. What is applicable in one state won't be in another, these sort of things should be state's responsibility because they know their constituents better. Centre should focus on other things."
}