{
    "id": "17dqim2",
    "title": "[Flipkart] How can I recover from loss?",
    "url": "https://www.reddit.com/r/india/comments/17dqim2/flipkart_how_can_i_recover_from_loss/",
    "selftext": "**Background**\n\nCurrently, I stay with my parents in a small town with no closeby TV shops. \n\nThey have been asking me to suggest them a TV but I wanted to make them happy by gifting them one. Reliability was a major factor so was strict with either Sony, Samsung or LG.\n\n**Reason to purchase online**\n\nI had previously purchased Sony 55X80AJ for Rs.71.4k from Amazon in 2021 and had no troubles.\n\nWith that experience, On 14th Oct, I purchased Samsung iSmart 55inch TV (cue60) for Rs.39,000 (with no-cost discount its Rs. 37,973). I choose 3-months No-cost EMI.\n\n**On the day of open-box delivery (20th Oct)**\n\nDelivery agent and I saw that there were some scratches on the TV's panel and we weren't sure if it had peel-able plastic screen guard on the panel that you remove after installation.\n\n* Delivery agent also said that it happened to another Samsung 65inch TV and it was returned by the customer.\n* I was 70% sure there was a screen guard cause it had a small plastic flap on left side of the TV that is used to help remove screen guard from the screen (just like in phones). For example, please look at the top-right white flap extension ([https://m.media-amazon.com/images/I/61RofAW9BML.\\_SL1500\\_.jpg](https://m.media-amazon.com/images/I/61RofAW9BML._SL1500_.jpg))\n* I say 70% surety cause it had other stickers on the screen exactly like this one on both sides of the TV [https://eu.community.samsung.com/t5/image/serverpage/image-id/605448i53DEE990731D995B/strip-exif-metadata/true/image-dimensions/2000?v=v2&px=-1](https://eu.community.samsung.com/t5/image/serverpage/image-id/605448i53DEE990731D995B/strip-exif-metadata/true/image-dimensions/2000?v=v2&px=-1). I wasn't exactly sure if the flap was meant to remove these side stickers.\n\n**Call to Samsung customer care**\n\n* Samsung care couldn't confirm if it had peel-able screen guard. \"Some models have it and some don't\" was their answer.\n* My request got denied for Samsung installer/engineers phone number but instead they raised a request for visit during first half of the very next day.\n\n**First call to Flipkart customer care**\n\nMe: I don't want a refund, I want a replacement TV as **my first EMI already started**.\n\nFK: Let me check your return policy sir.\n\nFK: No problem sir, Just ask delivery agent to replace (There is an button to raise replacement on agents phone app).\n\nSo, delivery is rejected but a replacement request was raised, TV gets repacked and returned.\n\n&#x200B;\n\nNext day at **2AM** I wake up, I get a notification saying my order was cancelled and refund was initiated. I immediately call Flipkart customer care.\n\n**Second call to Flipkart customer care**\n\nFK: Sorry sir but your order has been cancelled by the seller and nothing can be done now for replacement.\n\nMe: but your colleague confirmed it would be replaced.\n\nFK: Sorry sir, that was a wrong information but nothing can be done now.\n\nMe: ok but what about my EMI's interest payment? \n\nFK: Sorry sir, we cant do anything.\n\n&#x200B;\n\n**Aftermath**\n\nProcessing fee Rs.199/-\n\nICICI EMI breakdown:\n\n|Month|Principal|Interest|\n|:-|:-|:-|\n|1 (Billed)|12500.86|474.35|\n|2|12657.02|318.19|\n|3|12815.12|160.08|\n\nI wasn't aware that credit card had **foreclosure fee of 3% (outstanding principal) + advanced EMI interest + GST**. \n\nSince, I got my refund back today, would bank automatically foreclose this EMI? \n\nIf its not foreclosed automatically, I believe it makes more sense to just pay the interest amount for 3-months and be done with it? \n\nDoes it make sense to raise Consumer complaint to get back my interest payment due to \"**Flipkart's fault**\"? \n\nI say \"Flipkarts fault\" because I was ready to take the TV and go with my gut and risk but Flipkart assured a replacement.\n\nAll my conversations with Samsung, Flipkart are recorded.\n\nAfter this issue, I see many redditors have faced issue with Flipkart. As always I was at correct place but at a wrong time :(",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697971524.0,
    "convurl": "https://external-preview.redd.it/eHRTKw_kjx2SynPosq1g1uiew8IwiCJXl1gXdlAf1Qs.jpg?auto=webp&s=1dc812178889e56356a48929cc8a829321f43289",
    "comments": [
        "why did you accept order if it was open delivery and you saw scratches?\n\nis this first time you are using reddit?\n\nThere are weekly 3-4 post about getting scammed by Flipkart seller, you won't get refund. You won't get replacement. That's unfortunate truth. You can continue to try for next 6 month too.",
        "Man, there's a separate sub where people share their shitty experience with flopkart.",
        ">why did you accept order if it was open delivery and you saw scratches?\n\nAs TV was damaged, I didn't accept order instead a replacement request was raised by delivery agent. \n\n&#x200B;\n\n>is this first time you are using reddit?\n\nYes sir, I rarely use r/india :(\n\nHad I knew these troubles with high cost items would have never went with it.\n\nMost people who come to reddit for these Flipkart issues have no prior clue about Flipkart's shitty service.\n\nThis is the first time I had ever been in this situation, earlier I had fake adidas socks sent and I got it replaced with no problems from Flipkart.\n\nExperience with Amazon was better.\n\n&#x200B;\n\n>There are weekly 3-4 post about getting scammed by Flipkart seller, you won't get refund. You won't get replacement. That's unfortunate truth. You can continue to try for next 6 month too.\n\nTo add insult to injury, I call customer care again and 1.5 minutes in the call telling my ordeal to Flipkart customer care they just cut the call :)",
        "If only I knew before :(",
        "Raise fraud transaction issue with your credit card company and see its possible to revert. \n\n\nGo to consumer court website and attach all emails photo/SS. No point in waiting, Flipkart won't do anything.",
        "Actually, I posted this on an another sub and it seems I have 15 days to cancel EMI order without any charges and impact to credit score.\n\nAll fees and charges will be reversed.\n\nCancellation has to be done manually through customer care call.\n\nThis works for ICICI and not sure about other banks.",
        "All charges should be auto reversed including the processing charge +GST. EMI will be forclosed without any charge. I have multiple ICICI credit cards and everything gets adjusted on both Amazon and Flipkart. If they canceled it after the statement is generated then it gets adjusted in the next cycle.",
        "When I called the bank they said its not auto reversed or emi doesnt get cancelled automatic ally (even if I got refund from merchant) and that I have to call then explicitly and get it cancelled within 15 days. \n\nAnyways they assured all charges will be reversed with no impact on credit history.\n\nSince my billing cycle already started on 18th of this month, they suggested to pay off first EMI and then to give them a call for full refund. \n\nDoes that sounds fair?",
        "If the statement is generated and EMI charges are in it then pay off the full statement amount. Also, check your current statement for the reversal. It shouldn't take more than 2-3 days after the refund is initiated by FK."
    ],
    "cleaned_text": "flipkart recover loss background currently stay parents small town closeby tv shops asking suggest tv wanted make happy gifting one reliability major factor strict either sony samsung lg reason purchase online previously purchased sony xaj rsk amazon troubles experience th oct purchased samsung ismart inch tv cue rs nocost discount rs choose months nocost emi day openbox delivery th oct delivery agent saw scratches tvs panel werent sure peelable plastic screen guard panel remove installation delivery agent also said happened another samsung inch tv returned customer sure screen guard cause small plastic flap left side tv used help remove screen guard screen like phones example please look topright white flap extension httpsmmediaamazoncomimagesirofawbmlsljpghttpsmmediaamazoncomimagesirofawbmlsljpg say surety cause stickers screen exactly like one sides tv httpseucommunitysamsungcomtimageserverpageimageidideedbstripexifmetadatatrueimagedimensionsvvpxhttpseucommunitysamsungcomtimageserverpageimageidideedbstripexifmetadatatrueimagedimensionsvvpx wasnt exactly sure flap meant remove side stickers call samsung customer care samsung care couldnt confirm peelable screen guard models dont answer request got denied samsung installerengineers phone number instead raised request visit first half next day first call flipkart customer care dont want refund want replacement tv first emi already started fk let check return policy sir fk problem sir ask delivery agent replace button raise replacement agents phone app delivery rejected replacement request raised tv gets repacked returned xb next day wake get notification saying order cancelled refund initiated immediately call flipkart customer care second call flipkart customer care fk sorry sir order cancelled seller nothing done replacement colleague confirmed would replaced fk sorry sir wrong information nothing done ok emis interest payment fk sorry sir cant anything xb aftermath processing fee rs icici emi breakdown monthprincipalinterest billed wasnt aware credit card foreclosure fee outstanding principal advanced emi interest gst since got refund back today would bank automatically foreclose emi foreclosed automatically believe makes sense pay interest amount months done make sense raise consumer complaint get back interest payment due flipkarts fault say flipkarts fault ready take tv go gut risk flipkart assured replacement conversations samsung flipkart recorded issue see many redditors faced issue flipkart always correct place wrong time ",
    "cleaned_title": "flipkart recover loss",
    "cleaned_selftext": "background currently stay parents small town closeby tv shops asking suggest tv wanted make happy gifting one reliability major factor strict either sony samsung lg reason purchase online previously purchased sony xaj rsk amazon troubles experience th oct purchased samsung ismart inch tv cue rs nocost discount rs choose months nocost emi day openbox delivery th oct delivery agent saw scratches tvs panel werent sure peelable plastic screen guard panel remove installation delivery agent also said happened another samsung inch tv returned customer sure screen guard cause small plastic flap left side tv used help remove screen guard screen like phones example please look topright white flap extension httpsmmediaamazoncomimagesirofawbmlsljpghttpsmmediaamazoncomimagesirofawbmlsljpg say surety cause stickers screen exactly like one sides tv httpseucommunitysamsungcomtimageserverpageimageidideedbstripexifmetadatatrueimagedimensionsvvpxhttpseucommunitysamsungcomtimageserverpageimageidideedbstripexifmetadatatrueimagedimensionsvvpx wasnt exactly sure flap meant remove side stickers call samsung customer care samsung care couldnt confirm peelable screen guard models dont answer request got denied samsung installerengineers phone number instead raised request visit first half next day first call flipkart customer care dont want refund want replacement tv first emi already started fk let check return policy sir fk problem sir ask delivery agent replace button raise replacement agents phone app delivery rejected replacement request raised tv gets repacked returned xb next day wake get notification saying order cancelled refund initiated immediately call flipkart customer care second call flipkart customer care fk sorry sir order cancelled seller nothing done replacement colleague confirmed would replaced fk sorry sir wrong information nothing done ok emis interest payment fk sorry sir cant anything xb aftermath processing fee rs icici emi breakdown monthprincipalinterest billed wasnt aware credit card foreclosure fee outstanding principal advanced emi interest gst since got refund back today would bank automatically foreclose emi foreclosed automatically believe makes sense pay interest amount months done make sense raise consumer complaint get back interest payment due flipkarts fault say flipkarts fault ready take tv go gut risk flipkart assured replacement conversations samsung flipkart recorded issue see many redditors faced issue flipkart always correct place wrong time",
    "cleaned_comments": "accept order open delivery saw scratches first time using reddit weekly post getting scammed flipkart seller wont get refund wont get replacement thats unfortunate truth continue try next month man theres separate sub people share shitty experience flopkart accept order open delivery saw scratches tv damaged didnt accept order instead replacement request raised delivery agent xb first time using reddit yes sir rarely use rindia knew troubles high cost items would never went people come reddit flipkart issues prior clue flipkarts shitty service first time ever situation earlier fake adidas socks sent got replaced problems flipkart experience amazon better xb weekly post getting scammed flipkart seller wont get refund wont get replacement thats unfortunate truth continue try next month add insult injury call customer care minutes call telling ordeal flipkart customer care cut call knew raise fraud transaction issue credit card company see possible revert go consumer court website attach emails photoss point waiting flipkart wont anything actually posted another sub seems days cancel emi order without charges impact credit score fees charges reversed cancellation done manually customer care call works icici sure banks charges auto reversed including processing charge gst emi forclosed without charge multiple icici credit cards everything gets adjusted amazon flipkart canceled statement generated gets adjusted next cycle called bank said auto reversed emi doesnt get cancelled automatic ally even got refund merchant call explicitly get cancelled within days anyways assured charges reversed impact credit history since billing cycle already started th month suggested pay first emi give call full refund sounds fair statement generated emi charges pay full statement amount also check current statement reversal shouldnt take days refund initiated fk",
    "light_cleaned_title": "[Flipkart] How can I recover from loss?",
    "light_cleaned_selftext": "**Background** Currently, I stay with my parents in a small town with no closeby TV shops. They have been asking me to suggest them a TV but I wanted to make them happy by gifting them one. Reliability was a major factor so was strict with either Sony, Samsung or LG. **Reason to purchase online** I had previously purchased Sony 55X80AJ for Rs.71.4k from Amazon in 2021 and had no troubles. With that experience, On 14th Oct, I purchased Samsung iSmart 55inch TV (cue60) for Rs.39,000 (with no-cost discount its Rs. 37,973). I choose 3-months No-cost EMI. **On the day of open-box delivery (20th Oct)** Delivery agent and I saw that there were some scratches on the TV's panel and we weren't sure if it had peel-able plastic screen guard on the panel that you remove after installation. * Delivery agent also said that it happened to another Samsung 65inch TV and it was returned by the customer. * I was 70% sure there was a screen guard cause it had a small plastic flap on left side of the TV that is used to help remove screen guard from the screen (just like in phones). For example, please look at the top-right white flap extension ([https://m.media-amazon.com/images/I/61RofAW9BML.\\_SL1500\\_.jpg](https://m.media-amazon.com/images/I/61RofAW9BML._SL1500_.jpg)) * I say 70% surety cause it had other stickers on the screen exactly like this one on both sides of the TV [https://eu.community.samsung.com/t5/image/serverpage/image-id/605448i53DEE990731D995B/strip-exif-metadata/true/image-dimensions/2000?v=v2&px=-1](https://eu.community.samsung.com/t5/image/serverpage/image-id/605448i53DEE990731D995B/strip-exif-metadata/true/image-dimensions/2000?v=v2&px=-1). I wasn't exactly sure if the flap was meant to remove these side stickers. **Call to Samsung customer care** * Samsung care couldn't confirm if it had peel-able screen guard. \"Some models have it and some don't\" was their answer. * My request got denied for Samsung installer/engineers phone number but instead they raised a request for visit during first half of the very next day. **First call to Flipkart customer care** Me: I don't want a refund, I want a replacement TV as **my first EMI already started**. FK: Let me check your return policy sir. FK: No problem sir, Just ask delivery agent to replace (There is an button to raise replacement on agents phone app). So, delivery is rejected but a replacement request was raised, TV gets repacked and returned. &#x200B; Next day at **2AM** I wake up, I get a notification saying my order was cancelled and refund was initiated. I immediately call Flipkart customer care. **Second call to Flipkart customer care** FK: Sorry sir but your order has been cancelled by the seller and nothing can be done now for replacement. Me: but your colleague confirmed it would be replaced. FK: Sorry sir, that was a wrong information but nothing can be done now. Me: ok but what about my EMI's interest payment? FK: Sorry sir, we cant do anything. &#x200B; **Aftermath** Processing fee Rs.199/- ICICI EMI breakdown: |Month|Principal|Interest| |:-|:-|:-| |1 (Billed)|12500.86|474.35| |2|12657.02|318.19| |3|12815.12|160.08| I wasn't aware that credit card had **foreclosure fee of 3% (outstanding principal) + advanced EMI interest + GST**. Since, I got my refund back today, would bank automatically foreclose this EMI? If its not foreclosed automatically, I believe it makes more sense to just pay the interest amount for 3-months and be done with it? Does it make sense to raise Consumer complaint to get back my interest payment due to \"**Flipkart's fault**\"? I say \"Flipkarts fault\" because I was ready to take the TV and go with my gut and risk but Flipkart assured a replacement. All my conversations with Samsung, Flipkart are recorded. After this issue, I see many redditors have faced issue with Flipkart. As always I was at correct place but at a wrong time :(",
    "light_cleaned_comments": "why did you accept order if it was open delivery and you saw scratches? is this first time you are using reddit? There are weekly 3-4 post about getting scammed by Flipkart seller, you won't get refund. You won't get replacement. That's unfortunate truth. You can continue to try for next 6 month too. Man, there's a separate sub where people share their shitty experience with flopkart. >why did you accept order if it was open delivery and you saw scratches? As TV was damaged, I didn't accept order instead a replacement request was raised by delivery agent. &#x200B; >is this first time you are using reddit? Yes sir, I rarely use r/india :( Had I knew these troubles with high cost items would have never went with it. Most people who come to reddit for these Flipkart issues have no prior clue about Flipkart's shitty service. This is the first time I had ever been in this situation, earlier I had fake adidas socks sent and I got it replaced with no problems from Flipkart. Experience with Amazon was better. &#x200B; >There are weekly 3-4 post about getting scammed by Flipkart seller, you won't get refund. You won't get replacement. That's unfortunate truth. You can continue to try for next 6 month too. To add insult to injury, I call customer care again and 1.5 minutes in the call telling my ordeal to Flipkart customer care they just cut the call :) If only I knew before :( Raise fraud transaction issue with your credit card company and see its possible to revert. Go to consumer court website and attach all emails photo/SS. No point in waiting, Flipkart won't do anything. Actually, I posted this on an another sub and it seems I have 15 days to cancel EMI order without any charges and impact to credit score. All fees and charges will be reversed. Cancellation has to be done manually through customer care call. This works for ICICI and not sure about other banks. All charges should be auto reversed including the processing charge +GST. EMI will be forclosed without any charge. I have multiple ICICI credit cards and everything gets adjusted on both Amazon and Flipkart. If they canceled it after the statement is generated then it gets adjusted in the next cycle. When I called the bank they said its not auto reversed or emi doesnt get cancelled automatic ally (even if I got refund from merchant) and that I have to call then explicitly and get it cancelled within 15 days. Anyways they assured all charges will be reversed with no impact on credit history. Since my billing cycle already started on 18th of this month, they suggested to pay off first EMI and then to give them a call for full refund. Does that sounds fair? If the statement is generated and EMI charges are in it then pay off the full statement amount. Also, check your current statement for the reversal. It shouldn't take more than 2-3 days after the refund is initiated by FK."
}