{
    "id": "1dv66t1",
    "title": "Advertisers will soon have to obtain self-declaration certificates before publishing digital ads! We write to MIB explaining how this is going to ruin the tour... | Internet Freedom Foundation",
    "url": "https://www.reddit.com/r/india/comments/1dv66t1/advertisers_will_soon_have_to_obtain/",
    "selftext": "https://preview.redd.it/uoh17jhj0iad1.jpg?width=1600&format=pjpg&auto=webp&s=a2551b2b226f7e3865a4e161dbd639fe81c5e8e5\n\n# tl;dr\n\nAs per MIB’s new rule which went into effect on June 18, 2024, all advertisers and advertising agencies have to obtain a ‘Self-Declaration Certificate’ (“**SDC**”) for all new ads, including digital ads, that will be published/ broadcasted. Meant to tackle the issue of misleading claims in ads, this move by MIB attempts to fill a policy gap that doesn’t exist with a rushed and, to quite an extent, an unfeasible intervention, thereby increasing compliance burden of advertisers.\n\n# Important documents\n\n1. IFF’s letter to MIB on SDC dated June 15, 2024 ([~link~](https://drive.google.com/file/d/1TBGxuhWNx5M6tzsoRuHRI1ds_V4bM5Ko/view?usp=sharing&ref=static.internetfreedom.in))\n2. MIB’s guidelines for uploading SDC ([~link~](https://cbcindia.gov.in/cbc/uploads/mandate/Self_Declaration_Portal_Guidelines.pdf?ref=static.internetfreedom.in))\n3. MIB’s feature on the Press Council of India’s portal ([~link~](https://cbcindia.gov.in/cbc/advt-login?ref=static.internetfreedom.in))\n\n# Why should you care?\n\nAs per a recent analysis, ad impressions on digital mediums [~increased~](https://tamindia.com/wp-content/uploads/2024/05/TAM-AdEx-A-Pixelated-view-into-Digital-Advertising-Trends-for-Y-2023.pdf?ref=static.internetfreedom.in) by almost 4 times in 2023 as compared to 2019 and even within 2023, there was a surge of 71% in ad impressions during Quarter 4 over Quarter 1. Another [~report~](https://www.financialexpress.com/business/brandwagon-indian-advertising-industry-grew-8-6-over-2022-to-hold-a-market-size-of-rs-93166-crore-reveals-dentsus-digital-report-2024-3388403/?ref=static.internetfreedom.in) published in 2020 reveals that the digital advertising market will reach INR 62,045 crore in 2025. The report also reveals that digital media has surpassed television and secures the largest ad expenditure share of 44%, followed by television (32%) and print media (20%). Given the exponential rise previously and currently being witnessed in the digital ads market, we believe that the self-declaration model prescribed by the Ministry will not be feasible for implementation on digital platforms and must be recalled. \n\n# Background\n\nOn June 04, 2024, the Ministry of Information and Broadcasting (“**MIB**”) launched a [~feature~](https://cbcindia.gov.in/cbc/advt-login?ref=static.internetfreedom.in) on the Press Council of India’s portal that [~facilitates~](https://pib.gov.in/PressReleasePage.aspx?PRID=2022649&ref=static.internetfreedom.in) self-declaration by advertisers and advertising agencies for digital advertisements (“**ads**”). This move by MIB imposes an obligation on all advertisers and advertising agencies to obtain a ‘Self-Declaration Certificate’ (“**SDC**”) for all new ads that will be issued/telecast/aired/published on or after June 18, 2024. Advertisers will only obtain the SDC once they have submitted their self-declaration form signed by an authorised representative. MIB has also released [~Guidelines~](https://cbcindia.gov.in/cbc/uploads/mandate/Self_Declaration_Portal_Guidelines.pdf?ref=static.internetfreedom.in) for advertisers using the Press Council of India portal to upload SDCs. These guidelines list the various details and documents, such as a letter of authorisation and full script of advertisement, that need to be submitted by advertisers in order to obtain their SDC. \n\nReportedly, the SDC is meant to tackle the problem of misleading claims in ads and to ensure compliance with all relevant regulatory guidelines. This decision by MIB [~follows~](https://www.livemint.com/companies/advertising-self-declaration-rules-i-b-ministry-patanjali-ayurved-misleading-ads-supreme-court-case-11718728961595.html?ref=static.internetfreedom.in#:~:text=The%20Patanjali%20effect,misleading%20claims%20in%20its%20advertisements.) a May 07, 2024 directive issued by the Supreme Court (“**SC**”) in the *Indian Medical Association Vs. Union of India* \\[Writ Petition (Civil) No 645/2022\\], where the SC instructed all advertisers/advertising agencies to submit an SDC before publishing or broadcasting any advertisement. The case pertained to the misleading advertisements published by Patanjali Ayurved.\n\n# Noble intentions, misguided actions\n\nWe appreciate the Ministry’s efforts to streamline and ease the process by supplying a sample format for the letter of authorisation. Given the rising instances of misleading ads, both on offline and online platforms, we understand the intent and reasoning behind introducing such a guideline. However, the Ministry must reevaluate if these proposed measures constitute a proportionate and feasible response. The prescribed method of self-declaration will undoubtedly increase compliance burden for all organisations, including micro and small entities, and will also increase difficulty for the Ministry as the volume of ads is higher on digital platforms as compared to non-digital platforms. Given that several ads published on digital platforms are automated, the Ministry must consider the infeasibility of implementation of the SDC mandate for such ads. \n\nNotably, MIB [~met~](https://economictimes.indiatimes.com/industry/media/entertainment/media/self-declaration-on-ads-should-be-done-by-june-18-mib-to-media/articleshow/110919621.cms?ref=static.internetfreedom.in) with members of the media and advertising industry to discuss the guidelines. In the meeting, industry members reportedly shared their concerns about the difficulties in implementing the SDC mandate. Notably, the Indian Society of Advertisers (“**ISA**”) [~wrote~](https://event.indiantelevision.com/banner/sdp.pdf?ref=static.internetfreedom.in) to MIB requesting postponement of the prescribed process until the SC hears the concerns of the ISA about the directive passed on May 7, 2024. In the letter, the ISA lists the [~complexities~](https://indiantelevision.com/regulators/ib-ministry/ad-self-certification%3A-industry-requests-mib-to-postpone-implementation-240614?ref=static.internetfreedom.in) and practical challenges associated with the SDC process such as a lack of security for the uploads, lagging, slow uploads, challenges in OTP generation, file size limitation of 1 MB for every creative, signing authority for each creative, duration of validity of the certification, whether every language version, social media message, tweet, reel, AFP, brand integration needs to be certified, etc. We believe that, in general, the Ministry must conduct more broad-based discussions with other relevant stakeholders such as civil society and researchers. \n\n# Latest developments\n\nOn June 25, MIB met with the media and advertising industry stakeholders including Meta, Google, and ISA where it [~reportedly~](https://www.storyboard18.com/how-it-works/exclusive-mib-to-form-core-committee-to-address-issues-with-self-declaration-certificate-mechanism-35406.htm?ref=static.internetfreedom.in) acknowledged challenges and concerns raised by them. Stakeholders shared that they witnessed multiple campaign cancellations by brands and a reduction in the number of ads being placed in the week since the SDC regime came into effect. \n\nSuggestions made by stakeholders during the meeting that the Ministry is [~reportedly~](https://www.hindustantimes.com/india-news/centre-likely-to-ease-rules-on-self-declaration-for-ads-after-industry-meeting-101719381351973.html?ref=static.internetfreedom.in) considering include simplifying the mechanism of obtaining the SDC and reducing the SDC mandate to certain sectors such as the food and health sectors. MIB has also decided to form a 'core committee' with key stakeholders including advertisers to have insights into the industry's concerns and challenges. \n\nRecent [reporting](https://www.hindustantimes.com/india-news/centre-to-issue-advisory-easing-rules-for-self-declaration-for-advertisements-101720016613844.html?ref=static.internetfreedom.in) reveals that MIB will soon issue an advisory to ease the rules on self-declaration of advertisements by limiting the SDCs only to ads related to food and health products and requiring advertisers to apply for them only once a year.\n\n# Policy 101: don’t fill a gap that doesn’t exist\n\nSince MIB has referred to the SC directive dated May 07, 2024, we cautioned the Ministry in our [~letter~](https://drive.google.com/file/d/1TBGxuhWNx5M6tzsoRuHRI1ds_V4bM5Ko/view?usp=sharing&ref=static.internetfreedom.in) against the introduction of any rushed policy interventions aimed at regulating product endorsement on digital platforms by social media influencers, celebrities, and public figures. We are concerned by the SC’s statements which bestowed equal responsibility on advertisers and endorsers for misleading advertisements. Any attempt to regulate endorsements made by influencers or celebrities in the same/similar way as that of advertisers may lead to consequences for online free speech. It is also worth evaluating if there is indeed a policy gap to be filled here since the Ministry of Consumer Affairs has already released health and wellness [~guidelines~](https://pib.gov.in/PressReleasePage.aspx?PRID=1947344&ref=static.internetfreedom.in) as well as the ‘[~Endorsement Know-Hows~](https://consumeraffairs.nic.in/sites/default/files/filefield_paths/Endorsement_Know-Hows.pdf?ref=static.internetfreedom.in)’ guidelines for celebrities, influencers and virtual influencers. These guidelines also [~require~](https://www.medianama.com/2023/01/223-india-new-guidelines-social-media-influencers-explained-2/?ref=static.internetfreedom.in) influencers and celebrities to mandatorily make disclosures whenever there’s a material connection “between an advertiser and celebrity/influencer that may affect the weight or credibility of the representation made by the celebrity/influencer”.\n\nWe further brought to the Ministry’s notice that the [~Consumer Protection Act, 2019~](https://www.indiacode.nic.in/bitstream/123456789/15256/1/a2019-35.pdf?ref=static.internetfreedom.in) already defines and prohibits misleading ads and has a penalty provision of up to 10 lakh rupees on manufacturers, advertisers, and endorsers. Further, the ‘Guidelines for Prevention of Misleading Advertisements and Endorsements for Misleading Advertisements, 2022’ notified by the Central Consumer Protection Authority comprehensively [~lays down~](https://www.medianama.com/2022/06/223-summary-india-guidelines-misleading-ads-2/?ref=static.internetfreedom.in) the dos and don’ts for as well as duties of advertisers, specifically regarding surrogate ads, free claims, bait ads, and ads targeting children. Given that adequate legal instruments exist to regulate misleading ads and to establish accountability of advertisers, we requested MIB to reconsider the need for such a policy as well as the rushed compliance timeline proposed by the Ministry.\n\n[Help us sustain the work we do](https://static.internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 23,
    "num_comments": 1,
    "created_utc": 1720097469.0,
    "convurl": "https://b.thumbs.redditmedia.com/3NF9YSBZmDtrMgwmkikC1xNDiudbSrbZ1U05UBaJzrQ.jpg",
    "comments": [
        "If its scoped to advertisements and not all posts (which I'm a bit confused about because of the quoted line)\n\n  \n> Any attempt to regulate endorsements made by influencers or celebrities in the same/similar way as that of advertisers may lead to consequences for online free speech\n\n  \nThen it seems like an OK deal right? Its an implicit ban on advertisements online, which means a move to paid subscriptions without ads..",
        "\" toh matlab abhi public ko maamu banana band ?\""
    ],
    "cleaned_text": "advertisers soon obtain selfdeclaration certificates publishing digital ads write mib explaining going ruin tour internet freedom foundation tldr per mibs new rule went effect june advertisers advertising agencies obtain selfdeclaration certificate sdc new ads including digital ads published broadcasted meant tackle issue misleading claims ads move mib attempts fill policy gap doesnt exist rushed quite extent unfeasible intervention thereby increasing compliance burden advertisers important documents iffs letter mib sdc dated june linkhttpsdrivegooglecomfiledtbgxuhwnxmtzsoruhridsvbmkoviewuspsharingrefstaticinternetfreedomin mibs guidelines uploading sdc linkhttpscbcindiagovincbcuploadsmandateselfdeclarationportalguidelinespdfrefstaticinternetfreedomin mibs feature press council indias portal linkhttpscbcindiagovincbcadvtloginrefstaticinternetfreedomin care per recent analysis ad impressions digital mediums increasedhttpstamindiacomwpcontentuploadstamadexapixelatedviewintodigitaladvertisingtrendsforypdfrefstaticinternetfreedomin almost times compared even within surge ad impressions quarter quarter another reporthttpswwwfinancialexpresscombusinessbrandwagonindianadvertisingindustrygrewovertoholdamarketsizeofrscrorerevealsdentsusdigitalreportrefstaticinternetfreedomin published reveals digital advertising market reach inr crore report also reveals digital media surpassed television secures largest ad expenditure share followed television print media given exponential rise previously currently witnessed digital ads market believe selfdeclaration model prescribed ministry feasible implementation digital platforms must recalled background june ministry information broadcasting mib launched featurehttpscbcindiagovincbcadvtloginrefstaticinternetfreedomin press council indias portal facilitateshttpspibgovinpressreleasepageaspxpridrefstaticinternetfreedomin selfdeclaration advertisers advertising agencies digital advertisements ads move mib imposes obligation advertisers advertising agencies obtain selfdeclaration certificate sdc new ads issuedtelecastairedpublished june advertisers obtain sdc submitted selfdeclaration form signed authorised representative mib also released guidelineshttpscbcindiagovincbcuploadsmandateselfdeclarationportalguidelinespdfrefstaticinternetfreedomin advertisers using press council india portal upload sdcs guidelines list various details documents letter authorisation full script advertisement need submitted advertisers order obtain sdc reportedly sdc meant tackle problem misleading claims ads ensure compliance relevant regulatory guidelines decision mib followshttpswwwlivemintcomcompaniesadvertisingselfdeclarationrulesibministrypatanjaliayurvedmisleadingadssupremecourtcasehtmlrefstaticinternetfreedomintextthepatanjalieffectmisleadingclaimsinitsadvertisements may directive issued supreme court sc indian medical association vs union india writ petition civil sc instructed advertisersadvertising agencies submit sdc publishing broadcasting advertisement case pertained misleading advertisements published patanjali ayurved noble intentions misguided actions appreciate ministrys efforts streamline ease process supplying sample format letter authorisation given rising instances misleading ads offline online platforms understand intent reasoning behind introducing guideline however ministry must reevaluate proposed measures constitute proportionate feasible response prescribed method selfdeclaration undoubtedly increase compliance burden organisations including micro small entities also increase difficulty ministry volume ads higher digital platforms compared nondigital platforms given several ads published digital platforms automated ministry must consider infeasibility implementation sdc mandate ads notably mib methttpseconomictimesindiatimescomindustrymediaentertainmentmediaselfdeclarationonadsshouldbedonebyjunemibtomediaarticleshowcmsrefstaticinternetfreedomin members media advertising industry discuss guidelines meeting industry members reportedly shared concerns difficulties implementing sdc mandate notably indian society advertisers isa wrotehttpseventindiantelevisioncombannersdppdfrefstaticinternetfreedomin mib requesting postponement prescribed process sc hears concerns isa directive passed may letter isa lists complexitieshttpsindiantelevisioncomregulatorsibministryadselfcertificationaindustryrequestsmibtopostponeimplementationrefstaticinternetfreedomin practical challenges associated sdc process lack security uploads lagging slow uploads challenges otp generation file size limitation mb every creative signing authority creative duration validity certification whether every language version social media message tweet reel afp brand integration needs certified etc believe general ministry must conduct broadbased discussions relevant stakeholders civil society researchers latest developments june mib met media advertising industry stakeholders including meta google isa reportedlyhttpswwwstoryboardcomhowitworksexclusivemibtoformcorecommitteetoaddressissueswithselfdeclarationcertificatemechanismhtmrefstaticinternetfreedomin acknowledged challenges concerns raised stakeholders shared witnessed multiple campaign cancellations brands reduction number ads placed week since sdc regime came effect suggestions made stakeholders meeting ministry reportedlyhttpswwwhindustantimescomindianewscentrelikelytoeaserulesonselfdeclarationforadsafterindustrymeetinghtmlrefstaticinternetfreedomin considering include simplifying mechanism obtaining sdc reducing sdc mandate certain sectors food health sectors mib also decided form core committee key stakeholders including advertisers insights industrys concerns challenges recent reportinghttpswwwhindustantimescomindianewscentretoissueadvisoryeasingrulesforselfdeclarationforadvertisementshtmlrefstaticinternetfreedomin reveals mib soon issue advisory ease rules selfdeclaration advertisements limiting sdcs ads related food health products requiring advertisers apply year policy dont fill gap doesnt exist since mib referred sc directive dated may cautioned ministry letterhttpsdrivegooglecomfiledtbgxuhwnxmtzsoruhridsvbmkoviewuspsharingrefstaticinternetfreedomin introduction rushed policy interventions aimed regulating product endorsement digital platforms social media influencers celebrities public figures concerned scs statements bestowed equal responsibility advertisers endorsers misleading advertisements attempt regulate endorsements made influencers celebrities samesimilar way advertisers may lead consequences online free speech also worth evaluating indeed policy gap filled since ministry consumer affairs already released health wellness guidelineshttpspibgovinpressreleasepageaspxpridrefstaticinternetfreedomin well endorsement knowhowshttpsconsumeraffairsnicinsitesdefaultfilesfilefieldpathsendorsementknowhowspdfrefstaticinternetfreedomin guidelines celebrities influencers virtual influencers guidelines also requirehttpswwwmedianamacomindianewguidelinessocialmediainfluencersexplainedrefstaticinternetfreedomin influencers celebrities mandatorily make disclosures whenever theres material connection advertiser celebrityinfluencer may affect weight credibility representation made celebrityinfluencer brought ministrys notice consumer protection act httpswwwindiacodenicinbitstreamapdfrefstaticinternetfreedomin already defines prohibits misleading ads penalty provision lakh rupees manufacturers advertisers endorsers guidelines prevention misleading advertisements endorsements misleading advertisements notified central consumer protection authority comprehensively lays downhttpswwwmedianamacomsummaryindiaguidelinesmisleadingadsrefstaticinternetfreedomin dos donts well duties advertisers specifically regarding surrogate ads free claims bait ads ads targeting children given adequate legal instruments exist regulate misleading ads establish accountability advertisers requested mib reconsider need policy well rushed compliance timeline proposed ministry help us sustain work dohttpsstaticinternetfreedomindonate ",
    "cleaned_title": "advertisers soon obtain selfdeclaration certificates publishing digital ads write mib explaining going ruin tour internet freedom foundation",
    "cleaned_selftext": "tldr per mibs new rule went effect june advertisers advertising agencies obtain selfdeclaration certificate sdc new ads including digital ads published broadcasted meant tackle issue misleading claims ads move mib attempts fill policy gap doesnt exist rushed quite extent unfeasible intervention thereby increasing compliance burden advertisers important documents iffs letter mib sdc dated june linkhttpsdrivegooglecomfiledtbgxuhwnxmtzsoruhridsvbmkoviewuspsharingrefstaticinternetfreedomin mibs guidelines uploading sdc linkhttpscbcindiagovincbcuploadsmandateselfdeclarationportalguidelinespdfrefstaticinternetfreedomin mibs feature press council indias portal linkhttpscbcindiagovincbcadvtloginrefstaticinternetfreedomin care per recent analysis ad impressions digital mediums increasedhttpstamindiacomwpcontentuploadstamadexapixelatedviewintodigitaladvertisingtrendsforypdfrefstaticinternetfreedomin almost times compared even within surge ad impressions quarter quarter another reporthttpswwwfinancialexpresscombusinessbrandwagonindianadvertisingindustrygrewovertoholdamarketsizeofrscrorerevealsdentsusdigitalreportrefstaticinternetfreedomin published reveals digital advertising market reach inr crore report also reveals digital media surpassed television secures largest ad expenditure share followed television print media given exponential rise previously currently witnessed digital ads market believe selfdeclaration model prescribed ministry feasible implementation digital platforms must recalled background june ministry information broadcasting mib launched featurehttpscbcindiagovincbcadvtloginrefstaticinternetfreedomin press council indias portal facilitateshttpspibgovinpressreleasepageaspxpridrefstaticinternetfreedomin selfdeclaration advertisers advertising agencies digital advertisements ads move mib imposes obligation advertisers advertising agencies obtain selfdeclaration certificate sdc new ads issuedtelecastairedpublished june advertisers obtain sdc submitted selfdeclaration form signed authorised representative mib also released guidelineshttpscbcindiagovincbcuploadsmandateselfdeclarationportalguidelinespdfrefstaticinternetfreedomin advertisers using press council india portal upload sdcs guidelines list various details documents letter authorisation full script advertisement need submitted advertisers order obtain sdc reportedly sdc meant tackle problem misleading claims ads ensure compliance relevant regulatory guidelines decision mib followshttpswwwlivemintcomcompaniesadvertisingselfdeclarationrulesibministrypatanjaliayurvedmisleadingadssupremecourtcasehtmlrefstaticinternetfreedomintextthepatanjalieffectmisleadingclaimsinitsadvertisements may directive issued supreme court sc indian medical association vs union india writ petition civil sc instructed advertisersadvertising agencies submit sdc publishing broadcasting advertisement case pertained misleading advertisements published patanjali ayurved noble intentions misguided actions appreciate ministrys efforts streamline ease process supplying sample format letter authorisation given rising instances misleading ads offline online platforms understand intent reasoning behind introducing guideline however ministry must reevaluate proposed measures constitute proportionate feasible response prescribed method selfdeclaration undoubtedly increase compliance burden organisations including micro small entities also increase difficulty ministry volume ads higher digital platforms compared nondigital platforms given several ads published digital platforms automated ministry must consider infeasibility implementation sdc mandate ads notably mib methttpseconomictimesindiatimescomindustrymediaentertainmentmediaselfdeclarationonadsshouldbedonebyjunemibtomediaarticleshowcmsrefstaticinternetfreedomin members media advertising industry discuss guidelines meeting industry members reportedly shared concerns difficulties implementing sdc mandate notably indian society advertisers isa wrotehttpseventindiantelevisioncombannersdppdfrefstaticinternetfreedomin mib requesting postponement prescribed process sc hears concerns isa directive passed may letter isa lists complexitieshttpsindiantelevisioncomregulatorsibministryadselfcertificationaindustryrequestsmibtopostponeimplementationrefstaticinternetfreedomin practical challenges associated sdc process lack security uploads lagging slow uploads challenges otp generation file size limitation mb every creative signing authority creative duration validity certification whether every language version social media message tweet reel afp brand integration needs certified etc believe general ministry must conduct broadbased discussions relevant stakeholders civil society researchers latest developments june mib met media advertising industry stakeholders including meta google isa reportedlyhttpswwwstoryboardcomhowitworksexclusivemibtoformcorecommitteetoaddressissueswithselfdeclarationcertificatemechanismhtmrefstaticinternetfreedomin acknowledged challenges concerns raised stakeholders shared witnessed multiple campaign cancellations brands reduction number ads placed week since sdc regime came effect suggestions made stakeholders meeting ministry reportedlyhttpswwwhindustantimescomindianewscentrelikelytoeaserulesonselfdeclarationforadsafterindustrymeetinghtmlrefstaticinternetfreedomin considering include simplifying mechanism obtaining sdc reducing sdc mandate certain sectors food health sectors mib also decided form core committee key stakeholders including advertisers insights industrys concerns challenges recent reportinghttpswwwhindustantimescomindianewscentretoissueadvisoryeasingrulesforselfdeclarationforadvertisementshtmlrefstaticinternetfreedomin reveals mib soon issue advisory ease rules selfdeclaration advertisements limiting sdcs ads related food health products requiring advertisers apply year policy dont fill gap doesnt exist since mib referred sc directive dated may cautioned ministry letterhttpsdrivegooglecomfiledtbgxuhwnxmtzsoruhridsvbmkoviewuspsharingrefstaticinternetfreedomin introduction rushed policy interventions aimed regulating product endorsement digital platforms social media influencers celebrities public figures concerned scs statements bestowed equal responsibility advertisers endorsers misleading advertisements attempt regulate endorsements made influencers celebrities samesimilar way advertisers may lead consequences online free speech also worth evaluating indeed policy gap filled since ministry consumer affairs already released health wellness guidelineshttpspibgovinpressreleasepageaspxpridrefstaticinternetfreedomin well endorsement knowhowshttpsconsumeraffairsnicinsitesdefaultfilesfilefieldpathsendorsementknowhowspdfrefstaticinternetfreedomin guidelines celebrities influencers virtual influencers guidelines also requirehttpswwwmedianamacomindianewguidelinessocialmediainfluencersexplainedrefstaticinternetfreedomin influencers celebrities mandatorily make disclosures whenever theres material connection advertiser celebrityinfluencer may affect weight credibility representation made celebrityinfluencer brought ministrys notice consumer protection act httpswwwindiacodenicinbitstreamapdfrefstaticinternetfreedomin already defines prohibits misleading ads penalty provision lakh rupees manufacturers advertisers endorsers guidelines prevention misleading advertisements endorsements misleading advertisements notified central consumer protection authority comprehensively lays downhttpswwwmedianamacomsummaryindiaguidelinesmisleadingadsrefstaticinternetfreedomin dos donts well duties advertisers specifically regarding surrogate ads free claims bait ads ads targeting children given adequate legal instruments exist regulate misleading ads establish accountability advertisers requested mib reconsider need policy well rushed compliance timeline proposed ministry help us sustain work dohttpsstaticinternetfreedomindonate",
    "cleaned_comments": "scoped advertisements posts im bit confused quoted line attempt regulate endorsements made influencers celebrities samesimilar way advertisers may lead consequences online free speech seems like ok deal right implicit ban advertisements online means move paid subscriptions without ads toh matlab abhi public ko maamu banana band",
    "light_cleaned_title": "Advertisers will soon have to obtain self-declaration certificates before publishing digital ads! We write to MIB explaining how this is going to ruin the tour... | Internet Freedom Foundation",
    "light_cleaned_selftext": "# tl;dr As per MIB’s new rule which went into effect on June 18, 2024, all advertisers and advertising agencies have to obtain a ‘Self-Declaration Certificate’ (“**SDC**”) for all new ads, including digital ads, that will be published/ broadcasted. Meant to tackle the issue of misleading claims in ads, this move by MIB attempts to fill a policy gap that doesn’t exist with a rushed and, to quite an extent, an unfeasible intervention, thereby increasing compliance burden of advertisers. # Important documents 1. IFF’s letter to MIB on SDC dated June 15, 2024 ([~link~](https://drive.google.com/file/d/1TBGxuhWNx5M6tzsoRuHRI1ds_V4bM5Ko/view?usp=sharing&ref=static.internetfreedom.in)) 2. MIB’s guidelines for uploading SDC ([~link~](https://cbcindia.gov.in/cbc/uploads/mandate/Self_Declaration_Portal_Guidelines.pdf?ref=static.internetfreedom.in)) 3. MIB’s feature on the Press Council of India’s portal ([~link~](https://cbcindia.gov.in/cbc/advt-login?ref=static.internetfreedom.in)) # Why should you care? As per a recent analysis, ad impressions on digital mediums [~increased~](https://tamindia.com/wp-content/uploads/2024/05/TAM-AdEx-A-Pixelated-view-into-Digital-Advertising-Trends-for-Y-2023.pdf?ref=static.internetfreedom.in) by almost 4 times in 2023 as compared to 2019 and even within 2023, there was a surge of 71% in ad impressions during Quarter 4 over Quarter 1. Another [~report~](https://www.financialexpress.com/business/brandwagon-indian-advertising-industry-grew-8-6-over-2022-to-hold-a-market-size-of-rs-93166-crore-reveals-dentsus-digital-report-2024-3388403/?ref=static.internetfreedom.in) published in 2020 reveals that the digital advertising market will reach INR 62,045 crore in 2025. The report also reveals that digital media has surpassed television and secures the largest ad expenditure share of 44%, followed by television (32%) and print media (20%). Given the exponential rise previously and currently being witnessed in the digital ads market, we believe that the self-declaration model prescribed by the Ministry will not be feasible for implementation on digital platforms and must be recalled. # Background On June 04, 2024, the Ministry of Information and Broadcasting (“**MIB**”) launched a [~feature~](https://cbcindia.gov.in/cbc/advt-login?ref=static.internetfreedom.in) on the Press Council of India’s portal that [~facilitates~](https://pib.gov.in/PressReleasePage.aspx?PRID=2022649&ref=static.internetfreedom.in) self-declaration by advertisers and advertising agencies for digital advertisements (“**ads**”). This move by MIB imposes an obligation on all advertisers and advertising agencies to obtain a ‘Self-Declaration Certificate’ (“**SDC**”) for all new ads that will be issued/telecast/aired/published on or after June 18, 2024. Advertisers will only obtain the SDC once they have submitted their self-declaration form signed by an authorised representative. MIB has also released [~Guidelines~](https://cbcindia.gov.in/cbc/uploads/mandate/Self_Declaration_Portal_Guidelines.pdf?ref=static.internetfreedom.in) for advertisers using the Press Council of India portal to upload SDCs. These guidelines list the various details and documents, such as a letter of authorisation and full script of advertisement, that need to be submitted by advertisers in order to obtain their SDC. Reportedly, the SDC is meant to tackle the problem of misleading claims in ads and to ensure compliance with all relevant regulatory guidelines. This decision by MIB [~follows~](https://www.livemint.com/companies/advertising-self-declaration-rules-i-b-ministry-patanjali-ayurved-misleading-ads-supreme-court-case-11718728961595.html?ref=static.internetfreedom.in#:~:text=The%20Patanjali%20effect,misleading%20claims%20in%20its%20advertisements.) a May 07, 2024 directive issued by the Supreme Court (“**SC**”) in the *Indian Medical Association Vs. Union of India* \\[Writ Petition (Civil) No 645/2022\\], where the SC instructed all advertisers/advertising agencies to submit an SDC before publishing or broadcasting any advertisement. The case pertained to the misleading advertisements published by Patanjali Ayurved. # Noble intentions, misguided actions We appreciate the Ministry’s efforts to streamline and ease the process by supplying a sample format for the letter of authorisation. Given the rising instances of misleading ads, both on offline and online platforms, we understand the intent and reasoning behind introducing such a guideline. However, the Ministry must reevaluate if these proposed measures constitute a proportionate and feasible response. The prescribed method of self-declaration will undoubtedly increase compliance burden for all organisations, including micro and small entities, and will also increase difficulty for the Ministry as the volume of ads is higher on digital platforms as compared to non-digital platforms. Given that several ads published on digital platforms are automated, the Ministry must consider the infeasibility of implementation of the SDC mandate for such ads. Notably, MIB [~met~](https://economictimes.indiatimes.com/industry/media/entertainment/media/self-declaration-on-ads-should-be-done-by-june-18-mib-to-media/articleshow/110919621.cms?ref=static.internetfreedom.in) with members of the media and advertising industry to discuss the guidelines. In the meeting, industry members reportedly shared their concerns about the difficulties in implementing the SDC mandate. Notably, the Indian Society of Advertisers (“**ISA**”) [~wrote~](https://event.indiantelevision.com/banner/sdp.pdf?ref=static.internetfreedom.in) to MIB requesting postponement of the prescribed process until the SC hears the concerns of the ISA about the directive passed on May 7, 2024. In the letter, the ISA lists the [~complexities~](https://indiantelevision.com/regulators/ib-ministry/ad-self-certification%3A-industry-requests-mib-to-postpone-implementation-240614?ref=static.internetfreedom.in) and practical challenges associated with the SDC process such as a lack of security for the uploads, lagging, slow uploads, challenges in OTP generation, file size limitation of 1 MB for every creative, signing authority for each creative, duration of validity of the certification, whether every language version, social media message, tweet, reel, AFP, brand integration needs to be certified, etc. We believe that, in general, the Ministry must conduct more broad-based discussions with other relevant stakeholders such as civil society and researchers. # Latest developments On June 25, MIB met with the media and advertising industry stakeholders including Meta, Google, and ISA where it [~reportedly~](https://www.storyboard18.com/how-it-works/exclusive-mib-to-form-core-committee-to-address-issues-with-self-declaration-certificate-mechanism-35406.htm?ref=static.internetfreedom.in) acknowledged challenges and concerns raised by them. Stakeholders shared that they witnessed multiple campaign cancellations by brands and a reduction in the number of ads being placed in the week since the SDC regime came into effect. Suggestions made by stakeholders during the meeting that the Ministry is [~reportedly~](https://www.hindustantimes.com/india-news/centre-likely-to-ease-rules-on-self-declaration-for-ads-after-industry-meeting-101719381351973.html?ref=static.internetfreedom.in) considering include simplifying the mechanism of obtaining the SDC and reducing the SDC mandate to certain sectors such as the food and health sectors. MIB has also decided to form a 'core committee' with key stakeholders including advertisers to have insights into the industry's concerns and challenges. Recent [reporting](https://www.hindustantimes.com/india-news/centre-to-issue-advisory-easing-rules-for-self-declaration-for-advertisements-101720016613844.html?ref=static.internetfreedom.in) reveals that MIB will soon issue an advisory to ease the rules on self-declaration of advertisements by limiting the SDCs only to ads related to food and health products and requiring advertisers to apply for them only once a year. # Policy 101: don’t fill a gap that doesn’t exist Since MIB has referred to the SC directive dated May 07, 2024, we cautioned the Ministry in our [~letter~](https://drive.google.com/file/d/1TBGxuhWNx5M6tzsoRuHRI1ds_V4bM5Ko/view?usp=sharing&ref=static.internetfreedom.in) against the introduction of any rushed policy interventions aimed at regulating product endorsement on digital platforms by social media influencers, celebrities, and public figures. We are concerned by the SC’s statements which bestowed equal responsibility on advertisers and endorsers for misleading advertisements. Any attempt to regulate endorsements made by influencers or celebrities in the same/similar way as that of advertisers may lead to consequences for online free speech. It is also worth evaluating if there is indeed a policy gap to be filled here since the Ministry of Consumer Affairs has already released health and wellness [~guidelines~](https://pib.gov.in/PressReleasePage.aspx?PRID=1947344&ref=static.internetfreedom.in) as well as the ‘[~Endorsement Know-Hows~](https://consumeraffairs.nic.in/sites/default/files/filefield_paths/Endorsement_Know-Hows.pdf?ref=static.internetfreedom.in)’ guidelines for celebrities, influencers and virtual influencers. These guidelines also [~require~](https://www.medianama.com/2023/01/223-india-new-guidelines-social-media-influencers-explained-2/?ref=static.internetfreedom.in) influencers and celebrities to mandatorily make disclosures whenever there’s a material connection “between an advertiser and celebrity/influencer that may affect the weight or credibility of the representation made by the celebrity/influencer”. We further brought to the Ministry’s notice that the [~Consumer Protection Act, 2019~](https://www.indiacode.nic.in/bitstream/123456789/15256/1/a2019-35.pdf?ref=static.internetfreedom.in) already defines and prohibits misleading ads and has a penalty provision of up to 10 lakh rupees on manufacturers, advertisers, and endorsers. Further, the ‘Guidelines for Prevention of Misleading Advertisements and Endorsements for Misleading Advertisements, 2022’ notified by the Central Consumer Protection Authority comprehensively [~lays down~](https://www.medianama.com/2022/06/223-summary-india-guidelines-misleading-ads-2/?ref=static.internetfreedom.in) the dos and don’ts for as well as duties of advertisers, specifically regarding surrogate ads, free claims, bait ads, and ads targeting children. Given that adequate legal instruments exist to regulate misleading ads and to establish accountability of advertisers, we requested MIB to reconsider the need for such a policy as well as the rushed compliance timeline proposed by the Ministry. [Help us sustain the work we do](https://static.internetfreedom.in/donate)",
    "light_cleaned_comments": "If its scoped to advertisements and not all posts (which I'm a bit confused about because of the quoted line) > Any attempt to regulate endorsements made by influencers or celebrities in the same/similar way as that of advertisers may lead to consequences for online free speech Then it seems like an OK deal right? Its an implicit ban on advertisements online, which means a move to paid subscriptions without ads.. \" toh matlab abhi public ko maamu banana band ?\""
}