{
    "id": "17afwz9",
    "title": "Govt Accepts Resignation of Scapegoated IIPS Director After Revoking His Suspension for Unflattering NFHS Data",
    "url": "https://thewire.in/government/ks-james-iips-director-resignation-nfhs-health-ministry",
    "selftext": "Fudge the data and then falsify progress and \"Vikas\". This is Amrut Kaal.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1697596269.0,
    "convurl": "https://external-preview.redd.it/W-p-IpG-b5kAv4R_H2WeX6Mhlkr9EzXujKUeBaTx_Qk.jpg?auto=webp&s=14117f4a8c426221316be20d8edaa0d162ae893e",
    "comments": [
        "> The data showed that anaemia had increased in the NFHS-5 period (2019-21) as compared to the previous round, NFHS-4.   \n\n> Apart from this, NFHS-5 also revealed that India was not open defecation-free – a claim repeatedly made by the members of the ruling BJP and several Union ministers. The survey showed that in no state or Union Territory (UT), except Lakshadweep, 100% of the population have access to toilet facilities. Similarly, the NFHS-5 data also raised questions about the ‘success’ of the Ujjwala scheme to encourage LPG as cooking fuel.   \n\nOne more institution felled for not toeing the line and supporting the false narratives. We are going the China way, soon all our data would be suspect.",
        "I always use govt. data to prove my point during online discussions , how much longer till we can't even trust the data published by the government?",
        "There is no war in ba sing se"
    ],
    "cleaned_text": "govt accepts resignation scapegoated iips director revoking suspension unflattering nfhs data fudge data falsify progress vikas amrut kaal ",
    "cleaned_title": "govt accepts resignation scapegoated iips director revoking suspension unflattering nfhs data",
    "cleaned_selftext": "fudge data falsify progress vikas amrut kaal",
    "cleaned_comments": "data showed anaemia increased nfhs period compared previous round nfhs apart nfhs also revealed india open defecationfree claim repeatedly made members ruling bjp several union ministers survey showed state union territory ut except lakshadweep population access toilet facilities similarly nfhs data also raised questions success ujjwala scheme encourage lpg cooking fuel one institution felled toeing line supporting false narratives going china way soon data would suspect always use govt data prove point online discussions much longer till cant even trust data published government war ba sing se",
    "light_cleaned_title": "Govt Accepts Resignation of Scapegoated IIPS Director After Revoking His Suspension for Unflattering NFHS Data",
    "light_cleaned_selftext": "Fudge the data and then falsify progress and \"Vikas\". This is Amrut Kaal.",
    "light_cleaned_comments": "> The data showed that anaemia had increased in the NFHS-5 period (2019-21) as compared to the previous round, NFHS-4. > Apart from this, NFHS-5 also revealed that India was not open defecation-free – a claim repeatedly made by the members of the ruling BJP and several Union ministers. The survey showed that in no state or Union Territory (UT), except Lakshadweep, 100% of the population have access to toilet facilities. Similarly, the NFHS-5 data also raised questions about the ‘success’ of the Ujjwala scheme to encourage LPG as cooking fuel. One more institution felled for not toeing the line and supporting the false narratives. We are going the China way, soon all our data would be suspect. I always use govt. data to prove my point during online discussions , how much longer till we can't even trust the data published by the government? There is no war in ba sing se"
}