{
    "id": "18lbd43",
    "title": "Debunking claims of muslim appeasement.",
    "url": "https://www.reddit.com/r/india/comments/18lbd43/debunking_claims_of_muslim_appeasement/",
    "selftext": "Since the birth of Indian right wing they have been blaming the left of muslim appeasement. This has been a major factor in their campaigns for gathering majority votes.\n\nIf congress and other left parties are actively pursuing muslim appeasement for the last 70 years then the muslim community should be quite prosperous today. They should be having highest level of education and standards of living. They should be having the highest per capita income and expenditure.\n\nFacts however are that muslims are the poorest community. Out of all the people below poverty line too muslims take the largest share.\n\nMuslims are the only community with higher illiteracy at 42.70 percent than the national average.\n\nMuslims also form the bottom tier in HDI and standard of living in both urban and rural areas.\nWith an MPCE of 833, muslims form the bottom line of both per capita income and expenditure.\n\n\nhttps://www.hindustantimes.com/india-news/muslims-in-india-the-poorest-religious-group-with-high-inequality-and-limited-opportunities-data-analysis-reveals-101688097160955-amp.html/\n\n\nhttps://m.thewire.in/article/education/census-literacy-religion/\n\nhttps://m.timesofindia.com/india/muslims-have-lowest-living-standard-in-india-govt-survey/articleshow/21936020.cms/\n\nhttps://www.thehindu.com/news/national/muslims-poorest-among-religious-groups-says-nsso-survey/article5042032.ece/amp/\n\nhttps://www.businesstoday.in/amp/latest/economy-politics/story/upper-caste-hindus-own-41-per-cent-india-total-wealth-study-170486-2019-02-14/\n\nhttps://www.businessinsider.in/india/news/there-is-a-caste-and-religion-bias-in-salaries-says-an-oxfam-report/amp_articleshow/94219196.cms/",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 79,
    "created_utc": 1702913266.0,
    "convurl": "https://external-preview.redd.it/tu9sg0g_kKLRJ87EBmoLhkfav7FqIywqFuLJ-lFyEYk.jpg?auto=webp&s=e3a23ec5a6331c87be631396200e0a95daaf3eb2",
    "comments": [
        "Why was the left against removal of the “triple Talak” divorce?",
        "Which left party opposed it?",
        "\nInteresting thing would be to study women empowerment in each community. Participation of women in labour force, age of marriage and number of children borne that will open up why HDI is low etc \n\nYou are assuming that believing Muslims will choose modern education for women against building a mosque or starting madarasa. Appeasement means giving what they want.",
        ">Appeasement means giving what they want.\n\nYes it does but whose wants\n\nSome religious leaders or a group of most qualified and educated people from the community.",
        "Congress was against it and staged a walkout:\n\nhttps://www.indiatoday.in/amp/india/story/triple-talaq-bill-passed-in-lok-sabha-with-303-votes-1573568-2019-07-25\n\nI also read plenty of articles by leftist who were against removing triple talak.",
        ">age of marriage and number of children borne that will open up why HDI is low etc\n\nAge of marriage is restricted to above 21 now. \n\nAnd age of consent at 18 through POCSO.\n\nAverage birthrate of muslims is 2.3 not so far from Hindus whose birthrate is 1.9",
        "Big mistake",
        "Sure. I would still call it “Muslim appeasement”",
        "Removal of triple talaq actually helped muslim women giving them equal rights to divorce",
        "You could have simply run a google search for your query. \n\nRead: https://www.indiatoday.in/india/story/triple-talaq-bill-rajya-sabha-congress-party-reaction-1575353-2019-07-30\n\n>\"We had fundamentally supported this bill. We also wanted amendment for the provision of support to Muslim women. Our opposition was on two-three issues. The Supreme Court had struck down triple talaq, you had also struck down down triple talaq through the law, then what is the need to criminalise an imaginary thing?\" senior Congress leader Abhishek Manu Singhvi said.\n\nThe unfairness of criminalisation was covered extensively: https://www.thehindu.com/opinion/op-ed/a-case-of-unprincipled-criminalisation/article25902926.ece\n\n>The Bill is a classic case of an unfair and deceptive legislative move with a populist agenda, which in a country like India should call for a novel and effective judicial scrutiny. First of all, in the emblematic judgment in Shayara Bano the majority on the Bench had invalidated the practice by terming it as unconstitutional. The simple and plain effect of the verdict is that the pronouncement of triple talaq is a nullity having no legal effect at all on a subsisting marriage, and despite the husband’s gesture, the matrimonial bond would remain intact, without being dissolved, in the eye of the law. Therefore, the Bill proposes to criminalise an act which is non est in the eye of the law. The disproportionate punishment of imprisonment for three years for a civil wrong without even a civil consequence due to the Supreme Court’s judgment is antithetical to the very idea of principled criminalisation. \n\n>Second, the majority verdict in Shayara Bano did not direct the government or Parliament to criminalise triple talaq or “to give effect to the order”, as implied in the Bill. There was no need to do so either, as the judgment got effectuated on its own. The judgment had no intention to create any deterrent, since the very act of triple talaq is void ab initio , according to the Supreme Court. The Bill thus tries to distort the intent and content of what the court said in Shayara Bano . An analogy between criminalisation of dowry and triple talaq does not make sense. In the case of dowry, transaction is a reality, whereas in triple talaq, after the top court holding that it is a nullity, there is no act at all in the legal sense to constitute an offence. The Bill thus assumes validity for an action which the court invalidated, and as such the very thematic premise for the Bill is artificial, erroneous and even contemptuous.\n\n>Third, criminalisation of triple talaq, can only motivate a “clever” husband to resort to other methods of divorce which do not fall within the ambit of the Bill or to simply desert his wife. Thus the Bill does not serve the Muslim woman’s interest.\n\nThe law also created an unfair situation: https://scroll.in/article/895448/civil-offence-for-hindus-crime-for-muslims-the-triple-talaq-ordinance-is-plainly-discriminatory\n\n>Deserting one’s wife without a valid divorce is now a criminal offence for Muslim men but a civil offence for men of other communities. The ordinance must go.\n\nThese objections were widely covered and this is why the bill was opposed by INC and like minded parties.",
        "It was not a \"big mistake\". They had actual reasons. You can read my comment: https://www.reddit.com/r/india/comments/18lbd43/debunking_claims_of_muslim_appeasement/kdwqcyp/",
        "> I also read plenty of articles by leftist who were against removing triple talak.\n\nI am amused. You read \"plenty of articles\", but you still don't know why the bill was opposed?",
        "Yeah it should not be a criminal offence. Just make the verbal divorce void.",
        "Yeah I see it now. It should not be a criminal offence",
        "But, removed of triple talak was deemed anti Islamic.",
        "but maulanas or extreme muslims didn't wanted that",
        "\n\n>If congress and other left parties are actively pursuing muslim appeasement for the last 70 years then the muslim community should be quite prosperous today. They should be having highest level of education and standards of living. They should be having the highest per capita income and expenditure.\n\nYou make a very flawed assumption. That appeasement should equal the progress of the community. Ground reality is that appeasement is the means to create and nurture a vote bank. Progress & development (both financial and social) are not related at all to the appeaser.",
        "Why would the left be against something that strengthens family structures ? You tell me.",
        "An example of appeasement is changing the law after the case of the shyara bano case, not the development metrics that you have shown",
        "How does uplift any community at all",
        "Why would a community demand for some hokus pokus instead of actual financial and social progress when everything is on the table. \n\nThe whole point of appeasement is that politicians accept demands without question. That's a golden opportunity for some progressive measures.",
        "The difference between 2.3 and 1.9 is huge. Below 2.1 populate degrowth starts",
        "PhD in Islamic studies isn't really education.",
        "OP is smart at setting narratives",
        "The past government didn't make  any attempts to improve the standards of living but provided freebies(free pilgrimage) to secure vote bank . Hence, nothing is reflected in development indices . Indians on large are fed up with this sort of appeasement strategies",
        "> Why would a community demand for some hokus pokus instead of actual financial and social progress\n\nIf you really have to ask that question you have a lot to learn. Happiness on earth is useless for muslims. The eternal afterlife is their only goal.",
        "Most of the time a man usually gives the verbal talaq and kicks the wife out of the house. \n\nMaking the triple talaq void is a progressive measure which will improve the lives of muslim women.\n\nHowever criminalizing it would be a step too far.",
        " Muslims need to be more educated so they can make more sensible demands",
        "Who said it is.",
        "> Some religious leaders or a group of most qualified and educated people from the community.\n\nLook at current politics, do you think most educated hindus wanted those statues or that temple built over other critical infra like hospitals, colleges? Do you think most hindus wanted rapists and criminals to get away free? \nWhat happens is what political powerful groups want?",
        "Only a Muslim would believe it's education. For the rest of the world, it's a PHD in ancient garbage. Same for the Hindu version.",
        "All theological studies are theological studies\n\nThey can make you a good priest\n\nBut for better policies for a community those degrees have no value",
        "Due I never said anything about such PhD. Why are you replying to me?\n\nGo check the comment thread again",
        "⚠️\n\n1. WAQF ACT 1995\n2. STATE CONTROL OF HINDU TEMPLES \n3. ALLOWING 50000 ROHINGYAS IN INDIA WHO KILLED 100s OF HINDU FAMILY IN MYANMAR\n4. NO ACTION ON ILLEGAL BANGLADESHIS IN INDIA, ALL SETTLING IN W.B AND TMC MAKING THEM THEIR VOTEBANK\n4. THE RTE ACT\n5. PLACE OF WORSHIP ACT \n\nAnd the list goes on n on...",
        "> Why would a community demand for some hokus pokus instead of actual financial and social progress when everything is on the table.\n\nBecause emotions are drive votes more than progress. You can rule for 20 years bringing people from argiculture to computers, but still it just takes some drivel from some popular especially religious folks to turn the voters against their interest. Just look at Trump and Republicans in USA. Republicans haven't decreased budget deficits in a century I think and they still campaign on that they will reduce budget deficits and run the country positive. Democrats have much more often ran on budget surplus and reducing debt. US is prime example of undereducated or religious or older people voting against their interests and in favor of rich leaders against whom they want to stick it.\n\n> The whole point of appeasement is that politicians accept demands without question. That's a golden opportunity for some progressive measures.\n\nJust get survey of things which will get the people to vote for your more, you will find progressive measures aren't vote winners. People will take losses if it meant that their group name was getting PR.",
        "\"Appeasement\" doesn't mean Upliftment , it means creation of a permanently aggrieved class by emplowering a few within that class or by pandering to their sentiments especially those that are detrimental to their progress.\n\nYour obeservations reagarding their socio economic indicatiors may be correct, however the cause can be attributed to Appeasement.\n\nAnother example of an aggreived class are the SC / ST they have been given quotas and appeased while at the same time they have been deprived of the infrastructure  to benefit from them such that only a few manage to benefit from it while the rest still languish. and the best part is they have been led to believe that this is because they are being oppressed by a caste that barely makes up 5% of the population!.",
        "So what Is the solution to all this",
        "None of these have any measures to improve standards of living of muslims",
        ">ALLOWING 50000 ROHINGYAS IN INDIA WHO KILLED 100s OF HINDU FAMILY IN MYANMAR\n\nThere are no Hindus in Myanmar. There are Buddhists and muslims and tribal Christians",
        "https://www.aljazeera.com/news/2018/5/22/amnesty-rohingya-fighters-killed-scores-of-hindus-in-myanmar\n\nQuoting from your favourite jihadi news portal 🥺☝️",
        "Then why do Muslims always end up voting for impotent mfs who can't improve their standard of living..",
        "They get what they elect 🙏😷",
        "the critical infrastructure is also getting built. what's exactly with this belief that only temples are being built. \n\nas for what a group wants, that doesn't always happen. When it happens and political parties cave in like spineless idiots, then it's rightly called appeasement.\n\ncase in point - Shah Bano verdict overturned by Rajiv Gandhi.",
        "> the critical infrastructure is also getting built. what's exactly with this belief that only temples are being built.\n\nHow many IIMs or IITs announced or started work on. What is the progress of the Namami Gange? Currently, only thing that happens in Parliament is bulldozing of bills without any discussion, and PM is campaigning for his party of tax payer money 99 days out 100 (a bit exaggeration).\n\n> case in point - Shah Bano verdict overturned by Rajiv Gandhi.\n\nShah Bano verdict is appeasement by Congress. There were multiple rapists and murders released by BJP, just look at Bilkis Bano's case and fucking Pragya Thakur being MP to appease the religious vote bank voters. \"Cow protection\" groups and laws. For a country that is 67% non-veg multiple states restriction non-veg for small group of people. Banning sale on days just for small sections of people. Both that and all these by BJP are cases of appeasement only. India is growing at 6-7%, when it was growing at 8-10% last decade, these are already inflation adjusted.",
        "7 new IITs and 7 new IIMs came up, 15 new AIIMS came up. about 320 new universities came into existence in India in last decade. major pollution centers like Kanpur are being checked.\n\nat least try to visit these places and then say stuff. just because you want to pretend that nothing happened doesn't mean that nothing happened.\n\n\nThe Bilkis Bano rapists weren't let go off by BJP, they were by courts. They were garlanded by idiots and that's condemnable but to suggest that BJP let them go is just plain stupid.\n\n\nand with the half baked reasonings you have, i won't even bother explaining how growth percentages work. Just to point it out though, Germany had a growth rate of 0.3% this year. by your metrics, Germans are basically a bunch of babbons who can't figure out how to grow their economy at 8% rate.\n\nor maybe the explanations are a bit more nuanced and you are not seeking nuances.",
        "> 7 new IITs and 7 new IIMs came up\n\nAll announced and planned before 2013. \n\n> about 320 new universities came into existence in India in last decade.\n\nHow many are good enough? How many NITs added? 1 completed, no announced? AIIMS Amendment came in 2012 only. Phase 4 was already negotiated on when announced in 2014-15. \n\nPrivate Universities coming up is due to rules being so open that literal garbage institutes can become universities and issue degrees. And, private education prices have been 15% yoy most of the period.\n\n> at least try to visit these places and then say stuff. just because you want to pretend that nothing happened doesn't mean that nothing happened.\n\nWell, I did. Ganga and Yamuna pollution I just recently saw. \n\n> The Bilkis Bano rapists weren't let go off by BJP, they were by courts. They were garlanded by idiots and that's condemnable but to suggest that BJP let them go is just plain stupid.\n\nThe state and central govt had full power to fight against it which they didn't choose.\n\nhttps://www.indiatoday.in/india/story/release-of-bilkis-bano-well-behaved-rapists-a-recap-2287299-2022-10-19\n\n> The state government wrote to the Ministry of Home Affairs on June 28, 2022 seeking its decision on the release. The approval came in on July 11, 2022.\n\nIn his letter, the Joint Secretary of Gujarat’s Home Ministry, Mayursinh Vaghela, mentioned the \"concurrence/approval\" of the central government for the premature release. However, the affidavit does not show the reasoning or the deliberations carried out by the central government before giving their nod.\n\n> and with the half baked reasonings you have, i won't even bother explaining how growth percentages work. Just to point it out though, Germany had a growth rate of 0.3% this year. by your metrics, Germans are basically a bunch of babbons who can't figure out how to grow their economy at 8% rate.\n\nGermany has a gdp per capita of $51k, India is $2.25k, Bangladesh is $2.47k. Bangladesh was much lower a decade ago. Germany has an average age of 45 years and population growth of 0. When China had average age as India (28-29) it was growing at 10-12%.\n\nIndian Govt is undelivering to appease the religious leaders and criminals. Add in competition is much smaller as Supreme leader sells of Airports, ports to Adani. Air flight ticket has more than doubled in the last 6 years, while Crude price today within 40% of 2016-17, and 10% of the 2018, much lower than 2012-2014. Railway ridership is stagnant or worse than 2012. It basically stopped growing from 2013.\n\nI can announce hundreds things, but they need to actually work. We are sacrificing 3-5% of yearly growth for appeasement politics of BJP.",
        "announcements mean jackshit. governments announce tons and tons of things but the one who actually materialises them gets the credit. \n\n\na university doesn't become \"good enough\" overnight. It takes time for things to improve. There is no magic wand here. your argument was that basic infrastructure wasn't getting built, now you're moving goalposts.\n\n\nprivate education has always been expensive. welcome to the 21st century. The fact still remains that enough government institutions have also come up. The demand to supply ratio was always skewed and will remain skewed.\n\n\nwell, i visited those places too and apparently i found things much cleaner than they were 5 years ago. Namami gange has nothing to do with yamuna though, nice attempt at sneaking it in.\n\n\nwhy should the state fight a judicial release?\n\n\nChina is also a dictatorship with absolutely no rules and checks. They fucked up their own environment and completely disregarded everything and everyone for that growth. you want that 10% through brute force with no negotiations?\n\n\ntenders are released. If you think Adani is buying everything, you're free to buy those things. make a cooperative, pool in money and buy those things.",
        "> a university doesn't become \"good enough\" overnight. It takes time for things to improve. There is no magic wand here. your argument was that basic infrastructure wasn't getting built, now you're moving goalposts.\n\nGovt isn't building private universities either. You moved the goal posts to the offside falg.\n\n> announcements mean jackshit. governments announce tons and tons of things but the one who actually materialises them gets the credit.\n\nWe have data for 9 years of this govt. We all know and it is widely reported of missed growth that India has had, despite taking on more deficit.\n\n> private education has always been expensive. welcome to the 21st century. The fact still remains that enough government institutions have also come up. The demand to supply ratio was always skewed and will remain skewed.\n\nLook at the NITs, IITs and IIMs added. Govt hasn't built up new institutes.\n\n> China is also a dictatorship with absolutely no rules and checks. They fucked up their own environment and completely disregarded everything and everyone for that growth. you want that 10% through brute force with no negotiations?\n\nBJP Govt isn't really saving environment either. China has much more actual rules and checks than Indian govt. \n\n> tenders are released. If you think Adani is buying everything, you're free to buy those things. \n\nNo. Multiple tenders were given to Adani despite lower bids and even with many ports there were additional grants and leeways given after the initial tender. No competition rules were taken into account either. Adani was funded by political support on Indian banks and LIC. Govt straight up refused to investigate Adani recently despite allegations and evidences to support those.\n\n> make a cooperative, pool in money and buy those things.\n\nSeems like Indian govt is doing that for Adani really.",
        "the private universities are still part of that basic infrastructure you're rambling about. Your point was that only temples are being built which is just a bullshit notion.\n\n\nReported by whom, publications that cater to your biases?\n\n\nagain 7 IITs and IIMs and 15 AIIMS. contribution to these  from the previous government was zilch.\n\n\ncare to tell me those \"rules and regulations\" china so faithfully follows. We're talking about a nation that royally fucked it's own people in the great leap forward and disregarded every single environmental law so that they can build the three gorges. They have 996 workflow for their workers, their labour unions basically have no powers so stop hyping them up just because you want to shit on your own nation.\n\n\n\nwell, if you think that such a thing happened, then take adani to courts. The whole opposition and their machinery will stand behind you since you have evidence that every contract was unfairly awarded. I mean atleast listen to your own thoughts before you pen them down.",
        "> the private universities are still part of that basic infrastructure you're rambling about. Your point was that only temples are being built which is just a bullshit notion.\n\nIf you want to move it to corner only,  then quality of the education needs to be quantified? Quality of these private universities are shit, that is why more Indian leave for education abroad. \n\n> Your point was that only temples are being built which is just a bullshit notion.\n\nIt was about appeasement. Temple and statues are just small example. But, I guess you were from those private universities that recently came up, so having rational discussion is impossibe.\n\n> again 7 IITs and IIMs and 15 AIIMS. contribution to these from the previous government was zilch.\n\nWell, clearly there aren't enough top quality institutes not being built. Only 1 NIT added, no IIM added. They produce the top quality of talent that now goes abroad more.\n\n> care to tell me those \"rules and regulations\" china so faithfully follows. We're talking about a nation that royally fucked it's own people in the great leap forward and disregarded every single environmental law so that they can build the three gorges.\n\nIf you have to bring up great leap forward from 1958-62, when China started growing from 1980s just shows you don't understand anything. Regarding Three Gorges Dam, it seems to be doing it job. It isn't appeasement construction. It has been there since 1994 and opened in 2003. There is 20 years of data, and for most measures it has prevented massive flood recently and helped with it growth. All dams have environmental, so do statues and temples.\n\n>  They have 996 workflow for their workers, their labour unions basically have no powers so stop hyping them up just because you want to shit on your own nation.\n\nChina had gdp per capita of 194$ in 1980, India was $266. Currently, India is $2.25k, China is $12.5k.\n\n> well, if you think that such a thing happened, then take adani to courts.\n\nPeople did. There is limit when the whole political apparatus refuses to investigate because BJP ka laddla hai.\n\n> The whole opposition and their machinery will stand behind you since you have evidence that every contract was unfairly awarded.\n\nSEBI needs to do its job, which it isn't because it controlled by central govt and they put their guy which doesn't care about rules as long as he gets money.\n\n> I mean atleast listen to your own thoughts before you pen them down.\n\nRead this comment thread, where it was on appeasement done by BJP, you have brought it here. Rather than recognizing appeasements. Acting as if development didn't happen before 2014, despite India's highest growth phase being 2003-2011.",
        "quantification takes time, something that you clearly don't seem to have. A 5 year old University won't produce top quality graduates, it'll take time and in that time, you'll also get your quantification. \n\n\nlol, mate look at your own arguments. They are diametrically opposite from any notion of rationality. It's just word salad for the lazy mind. \n\n\nThat's your argument, that brain drain is happening from top universities? were you sleeping from 2000-2014 because it has been happening since then. People move to IITs so that they can get a job at the new and shiny private tech company.\n\n\nthe argument was environmental concerns, way to miss the point. every single environmental concern was thrown out of the window for three gorges. Those concerns weren't just raised nationally but globally. so pick a side. \n\n\nwell, we can raise the GDP fairly quickly too if people are willing to be forced into working 72 hours every week like China. That's what 996 adds to btw. so you're game?\n\n\nand what happened to those cases?\n\n\nSEBI is doing its job. just because its workings doesn't fall in line with your preconceptions doesn't mean it's not working.\n\n\n\ni read the thread. I see no \"appeasement\" of the Hindus by BJP and so commented. The day BJP government will overturn a Hindu equivalent of Shah Bano is the day I'll vote against them and go to protests against them. Until then, legally recognising freedom fighters other than Gandhi family and fulfilling a core manifesto promise isn't appeasement.",
        "It's not huge and muslims are not making dozen babies anymore. Instead they are being systemically deprived",
        "There’s Muslim personal law. For Muslim women age of marriage is when women starts menstruating based on the Sunnat of Ayesha",
        "Redundant after POCSO and the new bill which restricts age of marriage to 21",
        "I don't want disease in my life",
        "You need serious educational help and some reading material to bring yourself up to the speed.\n\nThere are multiple HC judgements upholding minor marriages of Muslim women",
        "As of right now. Supreme court judgement upholds POCSO",
        "According to shakha boys the reason Muslims are lagging is their own doing and religious conservatism. The reason Hindus are lagging is because of Muslim appeasement. The reason India is lagging is because of Christian missionaries and George Soros. The only great hope is Modiji's Hindutva to lift them from the abyss.",
        "Yes in New India, temple of worship is more important than the temple of the brain.",
        "Which India do you live in? Shakha boys and their thought is the majority thought now and they all jerk off to majority appeasement. Maybe you have heard about Ayodhya to bas jhaki hai, Kashi Mathura baki hai.",
        "Hindus and muslims both are quite conservative even today.\n\nMuslims are lagging because of multiple reasons. Some are similar to why dalits are lagging. Discrimination, negligence, lack of educational campaigns and lack of leadership with a progressive vision.\n\nHindus are lagging mostly because of casteism which is evident from the fact that the biggest share of wealth is concentrated with the high caste Hindus.\n\nhttps://indianexpress.com/article/india/upper-caste-hindus-richest-in-india-own-41-total-assets-says-study-on-wealth-distribution-5582984/lite/\n\nI don't see how Shah Bano or triple talaq affect Hindus. They do however were unfair towards muslim women.\n\nWhen comparing effects of Shah Bano vs Bilkis Bano the former's influence is limited within muslim gender dynamics while the latter does démoralisé all women.\n\nSo effects of hindu appeasement usually leach out to other communities significantly more often than muslim distraction campaigns.\n\nIf Hindutva can fix everything it would have done it by now. It's been a decade. The fact that hindutva not only fails but makes things worse is evident from the handling of second wave of COVID where Modiji was busy with election campaign and kumbh mela while actually spreading the virus. Heck hindutva can't even make enough oxygen for the unfortunate people who got sick during that time.\n\nIf something fails the crisis test it will fail the long term development test too because there will be multiple crisis during that long term.",
        "Then why do muslims keep voting same parties. From your research it is clear that the people they are voting for have not made any difference in their life in 65 years",
        "They don't have an alternative.\n\nSame reason people vote for BJP\n\nTemple and cow politics is just a distraction to get votes\n\nThey do nothing for average Hindu.\n\nThey don't provide employment to the 20 percent unemployed hindu youths.\n\nThey don't protect hindu women\n\nIn fact there are cases of dalit women being raped for eating beef\n\nhttps://www.indiatoday.in/amp/india/story/mewat-murder-gangrape-beef-biryani-cow-vigilantes-340463-2016-09-11\n\nhttps://www.thecitizen.in/amp/index.php/en/NewsDetail/index/2/8214/Cow-Fury:-4-Dalits-Stripped-and-Beaten-by-Shiv-Sena\n\nhttps://indianexpress.com/article/india/india-news-india/dalits-gujarat-una-cow-vigilantes-2927109/\n\nhttps://www.ndtv.com/india-news/they-asked-do-you-eat-beef-says-gangraped-haryana-woman-1457258/amp/1\n\nhttps://m.youtube.com/watch?v=fLCRi_GwNe8",
        "then they should just vote for NOTA and make their views known to the political parties. Unless they know that the muslims are unhappy with their elected members performance, they are not going to see any improvements in their lives.",
        "Ok ji.🙏👍",
        "Ok",
        "But blud you are a NRI.",
        "Yes. But don't worry I am not one of those who chant about how Modi has developed India while refusing to return. I visit India often and I have investments and business in India too. Due to legal bottlenecks and bureaucracy I have transferred my other businesses to Singapore and New York.",
        "Check this out. These guys should be staying in the Dev-looped nation right?\n\nIn fact more NRI should be coming to India seeing all the vikaas.\n\nhttps://www.dailyo.in/news/6500-millionaires-expected-to-leave-india-this-year-why-are-the-super-rich-emigrating-abroad-40123",
        "Solution:\n\nThings that privilaged peoole like me receive:\n\n* Reliable Quality of Primary Education\n   * Improve quality of Municipal Schools\n   * Improve quality of teachers\n   * Commitment from parents - I could count on my parents to check in whith me and help me with my homework in school and once that started going over their heads they gave me confidence\n   * Community Involvement - I could count in my neighbors and extended family to call me out if they saw me engage in irresponsible behavior.\n* Pass unpopular laws\n   * Comon Civil Code\n   * Tripple Talak\n   * Inheritance laws\n\nThis is just the beginning, one can do a PhD on this.",
        "That's a good vision",
        "You don't have to convince me about Hindutva, it is regressive and not the idea that India represents.",
        "True",
        "Why do you think appeasement means upliftment ?\n\nAppeasing means placating the religious leaders of minority communities so as to not upset them.\n\nIt is hypocritical by the government.\n\nThat's all it is.",
        "India banned Salman Rushdie's novel. I would say that's appeasement",
        "I oppose any form of censorship in education.",
        "And I agree with you",
        "The reason Indian Muslims aren't well off is that they're a barbaric race of war mongering infidels who only wish to impose their religion and its draconian laws on everyone else. \n\nThey refuse to believe that they are the same people as the Hindus, Sikhs etc by claiming they are Turkish or what not (while looking like a literal labourer).\n\nThey persecute the progressives in their religion the most, and most kids get their education from Madrasas. I can go on and on, but the list will never end.\n\nAlso, denying they are not appeased is like saying Modiji respects Mahatma Gandhi. Absolutely untrue",
        "So you are a muslim too?"
    ],
    "cleaned_text": "debunking claims muslim appeasement since birth indian right wing blaming left muslim appeasement major factor campaigns gathering majority votes congress left parties actively pursuing muslim appeasement last years muslim community quite prosperous today highest level education standards living highest per capita income expenditure facts however muslims poorest community people poverty line muslims take largest share muslims community higher illiteracy percent national average muslims also form bottom tier hdi standard living urban rural areas mpce muslims form bottom line per capita income expenditure ",
    "cleaned_title": "debunking claims muslim appeasement",
    "cleaned_selftext": "since birth indian right wing blaming left muslim appeasement major factor campaigns gathering majority votes congress left parties actively pursuing muslim appeasement last years muslim community quite prosperous today highest level education standards living highest per capita income expenditure facts however muslims poorest community people poverty line muslims take largest share muslims community higher illiteracy percent national average muslims also form bottom tier hdi standard living urban rural areas mpce muslims form bottom line per capita income expenditure",
    "cleaned_comments": "left removal triple talak divorce left party opposed interesting thing would study women empowerment community participation women labour force age marriage number children borne open hdi low etc assuming believing muslims choose modern education women building mosque starting madarasa appeasement means giving want appeasement means giving want yes whose wants religious leaders group qualified educated people community congress staged walkout also read plenty articles leftist removing triple talak age marriage number children borne open hdi low etc age marriage restricted age consent pocso average birthrate muslims far hindus whose birthrate big mistake sure would still call muslim appeasement removal triple talaq actually helped muslim women giving equal rights divorce could simply run google search query read fundamentally supported bill also wanted amendment provision support muslim women opposition twothree issues supreme court struck triple talaq also struck triple talaq law need criminalise imaginary thing senior congress leader abhishek manu singhvi said unfairness criminalisation covered extensively bill classic case unfair deceptive legislative move populist agenda country like india call novel effective judicial scrutiny first emblematic judgment shayara bano majority bench invalidated practice terming unconstitutional simple plain effect verdict pronouncement triple talaq nullity legal effect subsisting marriage despite husbands gesture matrimonial bond would remain intact without dissolved eye law therefore bill proposes criminalise act non est eye law disproportionate punishment imprisonment three years civil wrong without even civil consequence due supreme courts judgment antithetical idea principled criminalisation second majority verdict shayara bano direct government parliament criminalise triple talaq give effect order implied bill need either judgment got effectuated judgment intention create deterrent since act triple talaq void ab initio according supreme court bill thus tries distort intent content court said shayara bano analogy criminalisation dowry triple talaq make sense case dowry transaction reality whereas triple talaq top court holding nullity act legal sense constitute offence bill thus assumes validity action court invalidated thematic premise bill artificial erroneous even contemptuous third criminalisation triple talaq motivate clever husband resort methods divorce fall within ambit bill simply desert wife thus bill serve muslim womans interest law also created unfair situation deserting ones wife without valid divorce criminal offence muslim men civil offence men communities ordinance must go objections widely covered bill opposed inc like minded parties big mistake actual reasons read comment also read plenty articles leftist removing triple talak amused read plenty articles still dont know bill opposed yeah criminal offence make verbal divorce void yeah see criminal offence removed triple talak deemed anti islamic maulanas extreme muslims didnt wanted congress left parties actively pursuing muslim appeasement last years muslim community quite prosperous today highest level education standards living highest per capita income expenditure make flawed assumption appeasement equal progress community ground reality appeasement means create nurture vote bank progress development financial social related appeaser would left something strengthens family structures tell example appeasement changing law case shyara bano case development metrics shown uplift community would community demand hokus pokus instead actual financial social progress everything table whole point appeasement politicians accept demands without question thats golden opportunity progressive measures difference huge populate degrowth starts phd islamic studies isnt really education op smart setting narratives past government didnt make attempts improve standards living provided freebiesfree pilgrimage secure vote bank hence nothing reflected development indices indians large fed sort appeasement strategies would community demand hokus pokus instead actual financial social progress really ask question lot learn happiness earth useless muslims eternal afterlife goal time man usually gives verbal talaq kicks wife house making triple talaq void progressive measure improve lives muslim women however criminalizing would step far muslims need educated make sensible demands said religious leaders group qualified educated people community look current politics think educated hindus wanted statues temple built critical infra like hospitals colleges think hindus wanted rapists criminals get away free happens political powerful groups want muslim would believe education rest world phd ancient garbage hindu version theological studies theological studies make good priest better policies community degrees value due never said anything phd replying go check comment thread waqf act state control hindu temples allowing rohingyas india killed hindu family myanmar action illegal bangladeshis india settling wb tmc making votebank rte act place worship act list goes n would community demand hokus pokus instead actual financial social progress everything table emotions drive votes progress rule years bringing people argiculture computers still takes drivel popular especially religious folks turn voters interest look trump republicans usa republicans havent decreased budget deficits century think still campaign reduce budget deficits run country positive democrats much often ran budget surplus reducing debt us prime example undereducated religious older people voting interests favor rich leaders want stick whole point appeasement politicians accept demands without question thats golden opportunity progressive measures get survey things get people vote find progressive measures arent vote winners people take losses meant group name getting pr appeasement doesnt mean upliftment means creation permanently aggrieved class emplowering within class pandering sentiments especially detrimental progress obeservations reagarding socio economic indicatiors may correct however cause attributed appeasement another example aggreived class sc st given quotas appeased time deprived infrastructure benefit manage benefit rest still languish best part led believe oppressed caste barely makes population solution none measures improve standards living muslims allowing rohingyas india killed hindu family myanmar hindus myanmar buddhists muslims tribal christians quoting favourite jihadi news portal muslims always end voting impotent mfs cant improve standard living get elect critical infrastructure also getting built whats exactly belief temples built group wants doesnt always happen happens political parties cave like spineless idiots rightly called appeasement case point shah bano verdict overturned rajiv gandhi critical infrastructure also getting built whats exactly belief temples built many iims iits announced started work progress namami gange currently thing happens parliament bulldozing bills without discussion pm campaigning party tax payer money days bit exaggeration case point shah bano verdict overturned rajiv gandhi shah bano verdict appeasement congress multiple rapists murders released bjp look bilkis banos case fucking pragya thakur mp appease religious vote bank voters cow protection groups laws country nonveg multiple states restriction nonveg small group people banning sale days small sections people bjp cases appeasement india growing growing last decade already inflation adjusted new iits new iims came new aiims came new universities came existence india last decade major pollution centers like kanpur checked least try visit places say stuff want pretend nothing happened doesnt mean nothing happened bilkis bano rapists werent let go bjp courts garlanded idiots thats condemnable suggest bjp let go plain stupid half baked reasonings wont even bother explaining growth percentages work point though germany growth rate year metrics germans basically bunch babbons cant figure grow economy rate maybe explanations bit nuanced seeking nuances new iits new iims came announced planned new universities came existence india last decade many good enough many nits added completed announced aiims amendment came phase already negotiated announced private universities coming due rules open literal garbage institutes become universities issue degrees private education prices yoy period least try visit places say stuff want pretend nothing happened doesnt mean nothing happened well ganga yamuna pollution recently saw bilkis bano rapists werent let go bjp courts garlanded idiots thats condemnable suggest bjp let go plain stupid state central govt full power fight didnt choose state government wrote ministry home affairs june seeking decision release approval came july letter joint secretary gujarats home ministry mayursinh vaghela mentioned concurrenceapproval central government premature release however affidavit show reasoning deliberations carried central government giving nod half baked reasonings wont even bother explaining growth percentages work point though germany growth rate year metrics germans basically bunch babbons cant figure grow economy rate germany gdp per capita k india k bangladesh k bangladesh much lower decade ago germany average age years population growth china average age india growing indian govt undelivering appease religious leaders criminals add competition much smaller supreme leader sells airports ports adani air flight ticket doubled last years crude price today within much lower railway ridership stagnant worse basically stopped growing announce hundreds things need actually work sacrificing yearly growth appeasement politics bjp announcements mean jackshit governments announce tons tons things one actually materialises gets credit university doesnt become good enough overnight takes time things improve magic wand argument basic infrastructure wasnt getting built youre moving goalposts private education always expensive welcome st century fact still remains enough government institutions also come demand supply ratio always skewed remain skewed well visited places apparently found things much cleaner years ago namami gange nothing yamuna though nice attempt sneaking state fight judicial release china also dictatorship absolutely rules checks fucked environment completely disregarded everything everyone growth want brute force negotiations tenders released think adani buying everything youre free buy things make cooperative pool money buy things university doesnt become good enough overnight takes time things improve magic wand argument basic infrastructure wasnt getting built youre moving goalposts govt isnt building private universities either moved goal posts offside falg announcements mean jackshit governments announce tons tons things one actually materialises gets credit data years govt know widely reported missed growth india despite taking deficit private education always expensive welcome st century fact still remains enough government institutions also come demand supply ratio always skewed remain skewed look nits iits iims added govt hasnt built new institutes china also dictatorship absolutely rules checks fucked environment completely disregarded everything everyone growth want brute force negotiations bjp govt isnt really saving environment either china much actual rules checks indian govt tenders released think adani buying everything youre free buy things multiple tenders given adani despite lower bids even many ports additional grants leeways given initial tender competition rules taken account either adani funded political support indian banks lic govt straight refused investigate adani recently despite allegations evidences support make cooperative pool money buy things seems like indian govt adani really private universities still part basic infrastructure youre rambling point temples built bullshit notion reported publications cater biases iits iims aiims contribution previous government zilch care tell rules regulations china faithfully follows talking nation royally fucked people great leap forward disregarded every single environmental law build three gorges workflow workers labour unions basically powers stop hyping want shit nation well think thing happened take adani courts whole opposition machinery stand behind since evidence every contract unfairly awarded mean atleast listen thoughts pen private universities still part basic infrastructure youre rambling point temples built bullshit notion want move corner quality education needs quantified quality private universities shit indian leave education abroad point temples built bullshit notion appeasement temple statues small example guess private universities recently came rational discussion impossibe iits iims aiims contribution previous government zilch well clearly arent enough top quality institutes built nit added iim added produce top quality talent goes abroad care tell rules regulations china faithfully follows talking nation royally fucked people great leap forward disregarded every single environmental law build three gorges bring great leap forward china started growing shows dont understand anything regarding three gorges dam seems job isnt appeasement construction since opened years data measures prevented massive flood recently helped growth dams environmental statues temples workflow workers labour unions basically powers stop hyping want shit nation china gdp per capita india currently india k china k well think thing happened take adani courts people limit whole political apparatus refuses investigate bjp ka laddla hai whole opposition machinery stand behind since evidence every contract unfairly awarded sebi needs job isnt controlled central govt put guy doesnt care rules long gets money mean atleast listen thoughts pen read comment thread appeasement done bjp brought rather recognizing appeasements acting development didnt happen despite indias highest growth phase quantification takes time something clearly dont seem year old university wont produce top quality graduates itll take time time youll also get quantification lol mate look arguments diametrically opposite notion rationality word salad lazy mind thats argument brain drain happening top universities sleeping happening since people move iits get job new shiny private tech company argument environmental concerns way miss point every single environmental concern thrown window three gorges concerns werent raised nationally globally pick side well raise gdp fairly quickly people willing forced working hours every week like china thats adds btw youre game happened cases sebi job workings doesnt fall line preconceptions doesnt mean working read thread see appeasement hindus bjp commented day bjp government overturn hindu equivalent shah bano day ill vote go protests legally recognising freedom fighters gandhi family fulfilling core manifesto promise isnt appeasement huge muslims making dozen babies anymore instead systemically deprived theres muslim personal law muslim women age marriage women starts menstruating based sunnat ayesha redundant pocso new bill restricts age marriage dont want disease life need serious educational help reading material bring speed multiple hc judgements upholding minor marriages muslim women right supreme court judgement upholds pocso according shakha boys reason muslims lagging religious conservatism reason hindus lagging muslim appeasement reason india lagging christian missionaries george soros great hope modijis hindutva lift abyss yes new india temple worship important temple brain india live shakha boys thought majority thought jerk majority appeasement maybe heard ayodhya bas jhaki hai kashi mathura baki hai hindus muslims quite conservative even today muslims lagging multiple reasons similar dalits lagging discrimination negligence lack educational campaigns lack leadership progressive vision hindus lagging mostly casteism evident fact biggest share wealth concentrated high caste hindus dont see shah bano triple talaq affect hindus however unfair towards muslim women comparing effects shah bano vs bilkis bano formers influence limited within muslim gender dynamics latter dmoralis women effects hindu appeasement usually leach communities significantly often muslim distraction campaigns hindutva fix everything would done decade fact hindutva fails makes things worse evident handling second wave covid modiji busy election campaign kumbh mela actually spreading virus heck hindutva cant even make enough oxygen unfortunate people got sick time something fails crisis test fail long term development test multiple crisis long term muslims keep voting parties research clear people voting made difference life years dont alternative reason people vote bjp temple cow politics distraction get votes nothing average hindu dont provide employment percent unemployed hindu youths dont protect hindu women fact cases dalit women raped eating beef vote nota make views known political parties unless know muslims unhappy elected members performance going see improvements lives ok ji ok blud nri yes dont worry one chant modi developed india refusing return visit india often investments business india due legal bottlenecks bureaucracy transferred businesses singapore new york check guys staying devlooped nation right fact nri coming india seeing vikaas solution things privilaged peoole like receive reliable quality primary education improve quality municipal schools improve quality teachers commitment parents could count parents check whith help homework school started going heads gave confidence community involvement could count neighbors extended family call saw engage irresponsible behavior pass unpopular laws comon civil code tripple talak inheritance laws beginning one phd thats good vision dont convince hindutva regressive idea india represents true think appeasement means upliftment appeasing means placating religious leaders minority communities upset hypocritical government thats india banned salman rushdies novel would say thats appeasement oppose form censorship education agree reason indian muslims arent well theyre barbaric race war mongering infidels wish impose religion draconian laws everyone else refuse believe people hindus sikhs etc claiming turkish looking like literal labourer persecute progressives religion kids get education madrasas go list never end also denying appeased like saying modiji respects mahatma gandhi absolutely untrue muslim",
    "light_cleaned_title": "Debunking claims of muslim appeasement.",
    "light_cleaned_selftext": "Since the birth of Indian right wing they have been blaming the left of muslim appeasement. This has been a major factor in their campaigns for gathering majority votes. If congress and other left parties are actively pursuing muslim appeasement for the last 70 years then the muslim community should be quite prosperous today. They should be having highest level of education and standards of living. They should be having the highest per capita income and expenditure. Facts however are that muslims are the poorest community. Out of all the people below poverty line too muslims take the largest share. Muslims are the only community with higher illiteracy at 42.70 percent than the national average. Muslims also form the bottom tier in HDI and standard of living in both urban and rural areas. With an MPCE of 833, muslims form the bottom line of both per capita income and expenditure.",
    "light_cleaned_comments": "Why was the left against removal of the “triple Talak” divorce? Which left party opposed it? Interesting thing would be to study women empowerment in each community. Participation of women in labour force, age of marriage and number of children borne that will open up why HDI is low etc You are assuming that believing Muslims will choose modern education for women against building a mosque or starting madarasa. Appeasement means giving what they want. >Appeasement means giving what they want. Yes it does but whose wants Some religious leaders or a group of most qualified and educated people from the community. Congress was against it and staged a walkout: I also read plenty of articles by leftist who were against removing triple talak. >age of marriage and number of children borne that will open up why HDI is low etc Age of marriage is restricted to above 21 now. And age of consent at 18 through POCSO. Average birthrate of muslims is 2.3 not so far from Hindus whose birthrate is 1.9 Big mistake Sure. I would still call it “Muslim appeasement” Removal of triple talaq actually helped muslim women giving them equal rights to divorce You could have simply run a google search for your query. Read: >\"We had fundamentally supported this bill. We also wanted amendment for the provision of support to Muslim women. Our opposition was on two-three issues. The Supreme Court had struck down triple talaq, you had also struck down down triple talaq through the law, then what is the need to criminalise an imaginary thing?\" senior Congress leader Abhishek Manu Singhvi said. The unfairness of criminalisation was covered extensively: >The Bill is a classic case of an unfair and deceptive legislative move with a populist agenda, which in a country like India should call for a novel and effective judicial scrutiny. First of all, in the emblematic judgment in Shayara Bano the majority on the Bench had invalidated the practice by terming it as unconstitutional. The simple and plain effect of the verdict is that the pronouncement of triple talaq is a nullity having no legal effect at all on a subsisting marriage, and despite the husband’s gesture, the matrimonial bond would remain intact, without being dissolved, in the eye of the law. Therefore, the Bill proposes to criminalise an act which is non est in the eye of the law. The disproportionate punishment of imprisonment for three years for a civil wrong without even a civil consequence due to the Supreme Court’s judgment is antithetical to the very idea of principled criminalisation. >Second, the majority verdict in Shayara Bano did not direct the government or Parliament to criminalise triple talaq or “to give effect to the order”, as implied in the Bill. There was no need to do so either, as the judgment got effectuated on its own. The judgment had no intention to create any deterrent, since the very act of triple talaq is void ab initio , according to the Supreme Court. The Bill thus tries to distort the intent and content of what the court said in Shayara Bano . An analogy between criminalisation of dowry and triple talaq does not make sense. In the case of dowry, transaction is a reality, whereas in triple talaq, after the top court holding that it is a nullity, there is no act at all in the legal sense to constitute an offence. The Bill thus assumes validity for an action which the court invalidated, and as such the very thematic premise for the Bill is artificial, erroneous and even contemptuous. >Third, criminalisation of triple talaq, can only motivate a “clever” husband to resort to other methods of divorce which do not fall within the ambit of the Bill or to simply desert his wife. Thus the Bill does not serve the Muslim woman’s interest. The law also created an unfair situation: >Deserting one’s wife without a valid divorce is now a criminal offence for Muslim men but a civil offence for men of other communities. The ordinance must go. These objections were widely covered and this is why the bill was opposed by INC and like minded parties. It was not a \"big mistake\". They had actual reasons. You can read my comment: > I also read plenty of articles by leftist who were against removing triple talak. I am amused. You read \"plenty of articles\", but you still don't know why the bill was opposed? Yeah it should not be a criminal offence. Just make the verbal divorce void. Yeah I see it now. It should not be a criminal offence But, removed of triple talak was deemed anti Islamic. but maulanas or extreme muslims didn't wanted that >If congress and other left parties are actively pursuing muslim appeasement for the last 70 years then the muslim community should be quite prosperous today. They should be having highest level of education and standards of living. They should be having the highest per capita income and expenditure. You make a very flawed assumption. That appeasement should equal the progress of the community. Ground reality is that appeasement is the means to create and nurture a vote bank. Progress & development (both financial and social) are not related at all to the appeaser. Why would the left be against something that strengthens family structures ? You tell me. An example of appeasement is changing the law after the case of the shyara bano case, not the development metrics that you have shown How does uplift any community at all Why would a community demand for some hokus pokus instead of actual financial and social progress when everything is on the table. The whole point of appeasement is that politicians accept demands without question. That's a golden opportunity for some progressive measures. The difference between 2.3 and 1.9 is huge. Below 2.1 populate degrowth starts PhD in Islamic studies isn't really education. OP is smart at setting narratives The past government didn't make any attempts to improve the standards of living but provided freebies(free pilgrimage) to secure vote bank . Hence, nothing is reflected in development indices . Indians on large are fed up with this sort of appeasement strategies > Why would a community demand for some hokus pokus instead of actual financial and social progress If you really have to ask that question you have a lot to learn. Happiness on earth is useless for muslims. The eternal afterlife is their only goal. Most of the time a man usually gives the verbal talaq and kicks the wife out of the house. Making the triple talaq void is a progressive measure which will improve the lives of muslim women. However criminalizing it would be a step too far. Muslims need to be more educated so they can make more sensible demands Who said it is. > Some religious leaders or a group of most qualified and educated people from the community. Look at current politics, do you think most educated hindus wanted those statues or that temple built over other critical infra like hospitals, colleges? Do you think most hindus wanted rapists and criminals to get away free? What happens is what political powerful groups want? Only a Muslim would believe it's education. For the rest of the world, it's a PHD in ancient garbage. Same for the Hindu version. All theological studies are theological studies They can make you a good priest But for better policies for a community those degrees have no value Due I never said anything about such PhD. Why are you replying to me? Go check the comment thread again ⚠️ 1. WAQF ACT 1995 2. STATE CONTROL OF HINDU TEMPLES 3. ALLOWING 50000 ROHINGYAS IN INDIA WHO KILLED 100s OF HINDU FAMILY IN MYANMAR 4. NO ACTION ON ILLEGAL BANGLADESHIS IN INDIA, ALL SETTLING IN W.B AND TMC MAKING THEM THEIR VOTEBANK 4. THE RTE ACT 5. PLACE OF WORSHIP ACT And the list goes on n on... > Why would a community demand for some hokus pokus instead of actual financial and social progress when everything is on the table. Because emotions are drive votes more than progress. You can rule for 20 years bringing people from argiculture to computers, but still it just takes some drivel from some popular especially religious folks to turn the voters against their interest. Just look at Trump and Republicans in USA. Republicans haven't decreased budget deficits in a century I think and they still campaign on that they will reduce budget deficits and run the country positive. Democrats have much more often ran on budget surplus and reducing debt. US is prime example of undereducated or religious or older people voting against their interests and in favor of rich leaders against whom they want to stick it. > The whole point of appeasement is that politicians accept demands without question. That's a golden opportunity for some progressive measures. Just get survey of things which will get the people to vote for your more, you will find progressive measures aren't vote winners. People will take losses if it meant that their group name was getting PR. \"Appeasement\" doesn't mean Upliftment , it means creation of a permanently aggrieved class by emplowering a few within that class or by pandering to their sentiments especially those that are detrimental to their progress. Your obeservations reagarding their socio economic indicatiors may be correct, however the cause can be attributed to Appeasement. Another example of an aggreived class are the SC / ST they have been given quotas and appeased while at the same time they have been deprived of the infrastructure to benefit from them such that only a few manage to benefit from it while the rest still languish. and the best part is they have been led to believe that this is because they are being oppressed by a caste that barely makes up 5% of the population!. So what Is the solution to all this None of these have any measures to improve standards of living of muslims >ALLOWING 50000 ROHINGYAS IN INDIA WHO KILLED 100s OF HINDU FAMILY IN MYANMAR There are no Hindus in Myanmar. There are Buddhists and muslims and tribal Christians Quoting from your favourite jihadi news portal 🥺☝️ Then why do Muslims always end up voting for impotent mfs who can't improve their standard of living.. They get what they elect 🙏😷 the critical infrastructure is also getting built. what's exactly with this belief that only temples are being built. as for what a group wants, that doesn't always happen. When it happens and political parties cave in like spineless idiots, then it's rightly called appeasement. case in point - Shah Bano verdict overturned by Rajiv Gandhi. > the critical infrastructure is also getting built. what's exactly with this belief that only temples are being built. How many IIMs or IITs announced or started work on. What is the progress of the Namami Gange? Currently, only thing that happens in Parliament is bulldozing of bills without any discussion, and PM is campaigning for his party of tax payer money 99 days out 100 (a bit exaggeration). > case in point - Shah Bano verdict overturned by Rajiv Gandhi. Shah Bano verdict is appeasement by Congress. There were multiple rapists and murders released by BJP, just look at Bilkis Bano's case and fucking Pragya Thakur being MP to appease the religious vote bank voters. \"Cow protection\" groups and laws. For a country that is 67% non-veg multiple states restriction non-veg for small group of people. Banning sale on days just for small sections of people. Both that and all these by BJP are cases of appeasement only. India is growing at 6-7%, when it was growing at 8-10% last decade, these are already inflation adjusted. 7 new IITs and 7 new IIMs came up, 15 new AIIMS came up. about 320 new universities came into existence in India in last decade. major pollution centers like Kanpur are being checked. at least try to visit these places and then say stuff. just because you want to pretend that nothing happened doesn't mean that nothing happened. The Bilkis Bano rapists weren't let go off by BJP, they were by courts. They were garlanded by idiots and that's condemnable but to suggest that BJP let them go is just plain stupid. and with the half baked reasonings you have, i won't even bother explaining how growth percentages work. Just to point it out though, Germany had a growth rate of 0.3% this year. by your metrics, Germans are basically a bunch of babbons who can't figure out how to grow their economy at 8% rate. or maybe the explanations are a bit more nuanced and you are not seeking nuances. > 7 new IITs and 7 new IIMs came up All announced and planned before 2013. > about 320 new universities came into existence in India in last decade. How many are good enough? How many NITs added? 1 completed, no announced? AIIMS Amendment came in 2012 only. Phase 4 was already negotiated on when announced in 2014-15. Private Universities coming up is due to rules being so open that literal garbage institutes can become universities and issue degrees. And, private education prices have been 15% yoy most of the period. > at least try to visit these places and then say stuff. just because you want to pretend that nothing happened doesn't mean that nothing happened. Well, I did. Ganga and Yamuna pollution I just recently saw. > The Bilkis Bano rapists weren't let go off by BJP, they were by courts. They were garlanded by idiots and that's condemnable but to suggest that BJP let them go is just plain stupid. The state and central govt had full power to fight against it which they didn't choose. > The state government wrote to the Ministry of Home Affairs on June 28, 2022 seeking its decision on the release. The approval came in on July 11, 2022. In his letter, the Joint Secretary of Gujarat’s Home Ministry, Mayursinh Vaghela, mentioned the \"concurrence/approval\" of the central government for the premature release. However, the affidavit does not show the reasoning or the deliberations carried out by the central government before giving their nod. > and with the half baked reasonings you have, i won't even bother explaining how growth percentages work. Just to point it out though, Germany had a growth rate of 0.3% this year. by your metrics, Germans are basically a bunch of babbons who can't figure out how to grow their economy at 8% rate. Germany has a gdp per capita of $51k, India is $2.25k, Bangladesh is $2.47k. Bangladesh was much lower a decade ago. Germany has an average age of 45 years and population growth of 0. When China had average age as India (28-29) it was growing at 10-12%. Indian Govt is undelivering to appease the religious leaders and criminals. Add in competition is much smaller as Supreme leader sells of Airports, ports to Adani. Air flight ticket has more than doubled in the last 6 years, while Crude price today within 40% of 2016-17, and 10% of the 2018, much lower than 2012-2014. Railway ridership is stagnant or worse than 2012. It basically stopped growing from 2013. I can announce hundreds things, but they need to actually work. We are sacrificing 3-5% of yearly growth for appeasement politics of BJP. announcements mean jackshit. governments announce tons and tons of things but the one who actually materialises them gets the credit. a university doesn't become \"good enough\" overnight. It takes time for things to improve. There is no magic wand here. your argument was that basic infrastructure wasn't getting built, now you're moving goalposts. private education has always been expensive. welcome to the 21st century. The fact still remains that enough government institutions have also come up. The demand to supply ratio was always skewed and will remain skewed. well, i visited those places too and apparently i found things much cleaner than they were 5 years ago. Namami gange has nothing to do with yamuna though, nice attempt at sneaking it in. why should the state fight a judicial release? China is also a dictatorship with absolutely no rules and checks. They fucked up their own environment and completely disregarded everything and everyone for that growth. you want that 10% through brute force with no negotiations? tenders are released. If you think Adani is buying everything, you're free to buy those things. make a cooperative, pool in money and buy those things. > a university doesn't become \"good enough\" overnight. It takes time for things to improve. There is no magic wand here. your argument was that basic infrastructure wasn't getting built, now you're moving goalposts. Govt isn't building private universities either. You moved the goal posts to the offside falg. > announcements mean jackshit. governments announce tons and tons of things but the one who actually materialises them gets the credit. We have data for 9 years of this govt. We all know and it is widely reported of missed growth that India has had, despite taking on more deficit. > private education has always been expensive. welcome to the 21st century. The fact still remains that enough government institutions have also come up. The demand to supply ratio was always skewed and will remain skewed. Look at the NITs, IITs and IIMs added. Govt hasn't built up new institutes. > China is also a dictatorship with absolutely no rules and checks. They fucked up their own environment and completely disregarded everything and everyone for that growth. you want that 10% through brute force with no negotiations? BJP Govt isn't really saving environment either. China has much more actual rules and checks than Indian govt. > tenders are released. If you think Adani is buying everything, you're free to buy those things. No. Multiple tenders were given to Adani despite lower bids and even with many ports there were additional grants and leeways given after the initial tender. No competition rules were taken into account either. Adani was funded by political support on Indian banks and LIC. Govt straight up refused to investigate Adani recently despite allegations and evidences to support those. > make a cooperative, pool in money and buy those things. Seems like Indian govt is doing that for Adani really. the private universities are still part of that basic infrastructure you're rambling about. Your point was that only temples are being built which is just a bullshit notion. Reported by whom, publications that cater to your biases? again 7 IITs and IIMs and 15 AIIMS. contribution to these from the previous government was zilch. care to tell me those \"rules and regulations\" china so faithfully follows. We're talking about a nation that royally fucked it's own people in the great leap forward and disregarded every single environmental law so that they can build the three gorges. They have 996 workflow for their workers, their labour unions basically have no powers so stop hyping them up just because you want to shit on your own nation. well, if you think that such a thing happened, then take adani to courts. The whole opposition and their machinery will stand behind you since you have evidence that every contract was unfairly awarded. I mean atleast listen to your own thoughts before you pen them down. > the private universities are still part of that basic infrastructure you're rambling about. Your point was that only temples are being built which is just a bullshit notion. If you want to move it to corner only, then quality of the education needs to be quantified? Quality of these private universities are shit, that is why more Indian leave for education abroad. > Your point was that only temples are being built which is just a bullshit notion. It was about appeasement. Temple and statues are just small example. But, I guess you were from those private universities that recently came up, so having rational discussion is impossibe. > again 7 IITs and IIMs and 15 AIIMS. contribution to these from the previous government was zilch. Well, clearly there aren't enough top quality institutes not being built. Only 1 NIT added, no IIM added. They produce the top quality of talent that now goes abroad more. > care to tell me those \"rules and regulations\" china so faithfully follows. We're talking about a nation that royally fucked it's own people in the great leap forward and disregarded every single environmental law so that they can build the three gorges. If you have to bring up great leap forward from 1958-62, when China started growing from 1980s just shows you don't understand anything. Regarding Three Gorges Dam, it seems to be doing it job. It isn't appeasement construction. It has been there since 1994 and opened in 2003. There is 20 years of data, and for most measures it has prevented massive flood recently and helped with it growth. All dams have environmental, so do statues and temples. > They have 996 workflow for their workers, their labour unions basically have no powers so stop hyping them up just because you want to shit on your own nation. China had gdp per capita of 194$ in 1980, India was $266. Currently, India is $2.25k, China is $12.5k. > well, if you think that such a thing happened, then take adani to courts. People did. There is limit when the whole political apparatus refuses to investigate because BJP ka laddla hai. > The whole opposition and their machinery will stand behind you since you have evidence that every contract was unfairly awarded. SEBI needs to do its job, which it isn't because it controlled by central govt and they put their guy which doesn't care about rules as long as he gets money. > I mean atleast listen to your own thoughts before you pen them down. Read this comment thread, where it was on appeasement done by BJP, you have brought it here. Rather than recognizing appeasements. Acting as if development didn't happen before 2014, despite India's highest growth phase being 2003-2011. quantification takes time, something that you clearly don't seem to have. A 5 year old University won't produce top quality graduates, it'll take time and in that time, you'll also get your quantification. lol, mate look at your own arguments. They are diametrically opposite from any notion of rationality. It's just word salad for the lazy mind. That's your argument, that brain drain is happening from top universities? were you sleeping from 2000-2014 because it has been happening since then. People move to IITs so that they can get a job at the new and shiny private tech company. the argument was environmental concerns, way to miss the point. every single environmental concern was thrown out of the window for three gorges. Those concerns weren't just raised nationally but globally. so pick a side. well, we can raise the GDP fairly quickly too if people are willing to be forced into working 72 hours every week like China. That's what 996 adds to btw. so you're game? and what happened to those cases? SEBI is doing its job. just because its workings doesn't fall in line with your preconceptions doesn't mean it's not working. i read the thread. I see no \"appeasement\" of the Hindus by BJP and so commented. The day BJP government will overturn a Hindu equivalent of Shah Bano is the day I'll vote against them and go to protests against them. Until then, legally recognising freedom fighters other than Gandhi family and fulfilling a core manifesto promise isn't appeasement. It's not huge and muslims are not making dozen babies anymore. Instead they are being systemically deprived There’s Muslim personal law. For Muslim women age of marriage is when women starts menstruating based on the Sunnat of Ayesha Redundant after POCSO and the new bill which restricts age of marriage to 21 I don't want disease in my life You need serious educational help and some reading material to bring yourself up to the speed. There are multiple HC judgements upholding minor marriages of Muslim women As of right now. Supreme court judgement upholds POCSO According to shakha boys the reason Muslims are lagging is their own doing and religious conservatism. The reason Hindus are lagging is because of Muslim appeasement. The reason India is lagging is because of Christian missionaries and George Soros. The only great hope is Modiji's Hindutva to lift them from the abyss. Yes in New India, temple of worship is more important than the temple of the brain. Which India do you live in? Shakha boys and their thought is the majority thought now and they all jerk off to majority appeasement. Maybe you have heard about Ayodhya to bas jhaki hai, Kashi Mathura baki hai. Hindus and muslims both are quite conservative even today. Muslims are lagging because of multiple reasons. Some are similar to why dalits are lagging. Discrimination, negligence, lack of educational campaigns and lack of leadership with a progressive vision. Hindus are lagging mostly because of casteism which is evident from the fact that the biggest share of wealth is concentrated with the high caste Hindus. I don't see how Shah Bano or triple talaq affect Hindus. They do however were unfair towards muslim women. When comparing effects of Shah Bano vs Bilkis Bano the former's influence is limited within muslim gender dynamics while the latter does démoralisé all women. So effects of hindu appeasement usually leach out to other communities significantly more often than muslim distraction campaigns. If Hindutva can fix everything it would have done it by now. It's been a decade. The fact that hindutva not only fails but makes things worse is evident from the handling of second wave of COVID where Modiji was busy with election campaign and kumbh mela while actually spreading the virus. Heck hindutva can't even make enough oxygen for the unfortunate people who got sick during that time. If something fails the crisis test it will fail the long term development test too because there will be multiple crisis during that long term. Then why do muslims keep voting same parties. From your research it is clear that the people they are voting for have not made any difference in their life in 65 years They don't have an alternative. Same reason people vote for BJP Temple and cow politics is just a distraction to get votes They do nothing for average Hindu. They don't provide employment to the 20 percent unemployed hindu youths. They don't protect hindu women In fact there are cases of dalit women being raped for eating beef then they should just vote for NOTA and make their views known to the political parties. Unless they know that the muslims are unhappy with their elected members performance, they are not going to see any improvements in their lives. Ok ji.🙏👍 Ok But blud you are a NRI. Yes. But don't worry I am not one of those who chant about how Modi has developed India while refusing to return. I visit India often and I have investments and business in India too. Due to legal bottlenecks and bureaucracy I have transferred my other businesses to Singapore and New York. Check this out. These guys should be staying in the Dev-looped nation right? In fact more NRI should be coming to India seeing all the vikaas. Solution: Things that privilaged peoole like me receive: * Reliable Quality of Primary Education * Improve quality of Municipal Schools * Improve quality of teachers * Commitment from parents - I could count on my parents to check in whith me and help me with my homework in school and once that started going over their heads they gave me confidence * Community Involvement - I could count in my neighbors and extended family to call me out if they saw me engage in irresponsible behavior. * Pass unpopular laws * Comon Civil Code * Tripple Talak * Inheritance laws This is just the beginning, one can do a PhD on this. That's a good vision You don't have to convince me about Hindutva, it is regressive and not the idea that India represents. True Why do you think appeasement means upliftment ? Appeasing means placating the religious leaders of minority communities so as to not upset them. It is hypocritical by the government. That's all it is. India banned Salman Rushdie's novel. I would say that's appeasement I oppose any form of censorship in education. And I agree with you The reason Indian Muslims aren't well off is that they're a barbaric race of war mongering infidels who only wish to impose their religion and its draconian laws on everyone else. They refuse to believe that they are the same people as the Hindus, Sikhs etc by claiming they are Turkish or what not (while looking like a literal labourer). They persecute the progressives in their religion the most, and most kids get their education from Madrasas. I can go on and on, but the list will never end. Also, denying they are not appeased is like saying Modiji respects Mahatma Gandhi. Absolutely untrue So you are a muslim too?"
}