{
    "id": "13ms26a",
    "title": "BJP leader Yashpal Benam responds to the followers who are trolling him as his daughter is marrying a Muslim | Janjwar Media",
    "url": "https://v.redd.it/qr2xyats411b1",
    "selftext": "Source: https://twitter.com/janjwar_com/status/1659465881397886976\n\n### Translation\n\nBJP Leader Yashpal Benam says that he is not bothered by all the attention and questioning of some sections of society about his daughter marrying a Muslim. He mentions it’s 21st century and both the kids are adults by age and are fully qualified by age to take independent decisions. \n\nHe also says that even inside Hindu religion, earlier, there used to be so many barriers towards marriage among different castes, but now those barriers have become almost non-existent and hence even inter-religious marriages should also stop being a taboo. ",
    "flair": "Politics",
    "score": 403,
    "num_comments": 52,
    "created_utc": 1684589274.0,
    "convurl": "https://external-preview.redd.it/vXsnfe7OHadKPQE1O26euNTvYZ-E8iJK9GakkAx3GYM.png?format=pjpg&auto=webp&v=enabled&s=297a34ca57b57d9e31d4ee9888ad28d5c9199449",
    "comments": [
        "Talk about growing snakes in your backyard. What did he expect, he's in a party of incels.\n\nI remember chaddis were violently protesting a consensual Hindu-Muslim marriage when Siddharamaiah was CM in 15/16. He personally intervened, provided heavy police security outside the marriage venue and put the violent chaddis in jail.",
        "When you spread hate and misinformation and still think it won't come back and bite you. Hypocrisy",
        "My country is so f***ed up that basic stuff like this is discussed in our everyday media .\nWhy the f is this even in news ?",
        "u/savevideo",
        "You reap what you sow !!\n\nHatred will only results in more hatred. To all Hindu, Muslim, Sikh or Christian out there love knows no boundaries. It is futile to oppose interfaith marriage if both man and woman are agrees with it. A Muslim girl can marry a Hindu boy, a Hindu girl can marry a Christian and so on.",
        "Reading in news that wedding has been cancelled for now.",
        "And yet he is in the BJP.",
        "Mark of Vishnu",
        "r/LeopardsAteMyFace",
        "Irony creates itself. With release of Kerala files- loss in KN,  RSS supporter scientist leaks files of DRDO to ISI and now this. \n\nI guess funds in PM CARES should be utilised to buy burnol and Blood pressure medicines for rt wing members",
        "The thirst for power makes people agnostic towards political opinions, I am certain most of old BJP leadership thinks Modi is full of shit.",
        "Benam Baadshah",
        "Agreed \n\nBut the thing is it's not easy now, damage is done . I have fallen for a girl but i often overthink the future possibilities of me being put in jail on accusations of love jihad if suppose the girls family is not happy\n\nI am only 20, Engineering first year and although I am an atheist (my family too) legally we all still are muslims",
        "oh they definitely do. Just that he is too popular.",
        "Difficult times indeed 😔",
        "Where my bajrandal chaddis at?.",
        "Btw he was talking about Ankita Bhandari case. What happened to that case? is the case suppressed?",
        "Technically, that's not a bad thing. I doubt that the BJP will ever decline in power drastically. They've pretty much embedded themselves into Indian politics by now.\n\nA more realistic future is for them to gradually become more progressive as some of the more outdated ideologies get phased out with time. \n\nIsn't it better if BJP becomes more progressive with time rather than staying the way they are? That way we'll have more options to choose from.",
        "BJP cannot decline in power simply because of human nature. All countries have an entho-religious nationalist group, that gains power every few years. Arab Springs brought in pure Islamist government overturning secular but undemocratic rule. Republicans in the US still use churches and pastor connections to get votes, same with the Conservatives in the UK and Marine Le Pen in France. Why would Hindus and Indians be any different ? Every state has this problem.",
        "Which is why I said it's unrealistic. Them becoming more progressive over time is not impossible on the other hand.",
        "Considering everything, he handled the question of his daughter quite well.",
        "Which marriage was this? How was Siddharamaiahs earlier stint as the CM of karnataka seen btw",
        "Opening scene if Gujarat files",
        "Development wise nothing much better than BJP. But he was pro-poor and had many schemes which helped poor. Some were stupid freebies but overall not so bad. \nCorruption wise also they were bad, but BJP this time were worse.",
        "Dude, run!",
        "Clean, no-nonsense governance. Fiscally prudent. Strong stance against communalism. Siddhu himself is an atheist. \n\nHere you go\n\nhttps://indianexpress.com/article/india/india-news-india/hindu-muslim-couple-gets-married-amid-high-security-in-karnataka-2758177/",
        "Why ?",
        "They will kill you. There are multiple cases of the girls' families \"complaining\" to police about their child being abducted and police arresting the person. In many marriage registration offices, the clerical staff has contacts with VHP and as soon as anyone arrives for marriage under special marriage act, they inform VHP,  who then pressurize the girl's family to cancel the marriage.",
        "Yeah but i don't plan on marriage or anything else for that matter \nAlso , keeping everything aside i don't think these goons are that deserving to dictate my love life don't you think?\nI am just normal friends with her and won't confess anyways it's just that I sometimes overthink",
        ">\tIsn’t it better if BJP becomes more progressive with time\n\nIf you look at the leadership of the party over the years, it's going in the opposite direction. I honestly wouldn't be surprised if a couple decades down the line, Pragya Thakur or Yati Narsinghanand becomes their PM candidate",
        "Ah! Anyway, be safe and take care.",
        "A guy DMed me on this comment and said that main bohot Ganda phasunga I should not do such things.\nUpon looking at his profile my dude was active in Sham Sharma show and had recently posted how muslim men tend to be more leaning towards beating their wives.\nI am thinking if he was insecure that I may end up with a Hindu girl or was he genuinely concerned about me?",
        "You are overthinking here.\n\nI think her daughter has.medical problems due to which arrange marriage was not possible for her"
    ],
    "cleaned_text": "bjp leader yashpal benam responds followers trolling daughter marrying muslim janjwar media source translation bjp leader yashpal benam says bothered attention questioning sections society daughter marrying muslim mentions st century kids adults age fully qualified age take independent decisions also says even inside hindu religion earlier used many barriers towards marriage among different castes barriers become almost nonexistent hence even interreligious marriages also stop taboo ",
    "cleaned_title": "bjp leader yashpal benam responds followers trolling daughter marrying muslim janjwar media",
    "cleaned_selftext": "source translation bjp leader yashpal benam says bothered attention questioning sections society daughter marrying muslim mentions st century kids adults age fully qualified age take independent decisions also says even inside hindu religion earlier used many barriers towards marriage among different castes barriers become almost nonexistent hence even interreligious marriages also stop taboo",
    "cleaned_comments": "talk growing snakes backyard expect hes party incels remember chaddis violently protesting consensual hindumuslim marriage siddharamaiah cm personally intervened provided heavy police security outside marriage venue put violent chaddis jail spread hate misinformation still think wont come back bite hypocrisy country fed basic stuff like discussed everyday media f even news usavevideo reap sow hatred results hatred hindu muslim sikh christian love knows boundaries futile oppose interfaith marriage man woman agrees muslim girl marry hindu boy hindu girl marry christian reading news wedding cancelled yet bjp mark vishnu rleopardsatemyface irony creates release kerala files loss kn rss supporter scientist leaks files drdo isi guess funds pm cares utilised buy burnol blood pressure medicines rt wing members thirst power makes people agnostic towards political opinions certain old bjp leadership thinks modi full shit benam baadshah agreed thing easy damage done fallen girl often overthink future possibilities put jail accusations love jihad suppose girls family happy engineering first year although atheist family legally still muslims oh definitely popular difficult times indeed bajrandal chaddis btw talking ankita bhandari case happened case case suppressed technically thats bad thing doubt bjp ever decline power drastically theyve pretty much embedded indian politics realistic future gradually become progressive outdated ideologies get phased time isnt better bjp becomes progressive time rather staying way way well options choose bjp decline power simply human nature countries enthoreligious nationalist group gains power every years arab springs brought pure islamist government overturning secular undemocratic rule republicans us still use churches pastor connections get votes conservatives uk marine le pen france would hindus indians different every state problem said unrealistic becoming progressive time impossible hand considering everything handled question daughter quite well marriage siddharamaiahs earlier stint cm karnataka seen btw opening scene gujarat files development wise nothing much better bjp propoor many schemes helped poor stupid freebies overall bad corruption wise also bad bjp time worse dude run clean nononsense governance fiscally prudent strong stance communalism siddhu atheist go kill multiple cases girls families complaining police child abducted police arresting person many marriage registration offices clerical staff contacts vhp soon anyone arrives marriage special marriage act inform vhp pressurize girls family cancel marriage yeah dont plan marriage anything else matter also keeping everything aside dont think goons deserving dictate love life dont think normal friends wont confess anyways sometimes overthink isnt better bjp becomes progressive time look leadership party years going opposite direction honestly wouldnt surprised couple decades line pragya thakur yati narsinghanand becomes pm candidate ah anyway safe take care guy dmed comment said main bohot ganda phasunga things upon looking profile dude active sham sharma show recently posted muslim men tend leaning towards beating wives thinking insecure may end hindu girl genuinely concerned overthinking think daughter hasmedical problems due arrange marriage possible",
    "light_cleaned_title": "BJP leader Yashpal Benam responds to the followers who are trolling him as his daughter is marrying a Muslim | Janjwar Media",
    "light_cleaned_selftext": "Source: ### Translation BJP Leader Yashpal Benam says that he is not bothered by all the attention and questioning of some sections of society about his daughter marrying a Muslim. He mentions it’s 21st century and both the kids are adults by age and are fully qualified by age to take independent decisions. He also says that even inside Hindu religion, earlier, there used to be so many barriers towards marriage among different castes, but now those barriers have become almost non-existent and hence even inter-religious marriages should also stop being a taboo.",
    "light_cleaned_comments": "Talk about growing snakes in your backyard. What did he expect, he's in a party of incels. I remember chaddis were violently protesting a consensual Hindu-Muslim marriage when Siddharamaiah was CM in 15/16. He personally intervened, provided heavy police security outside the marriage venue and put the violent chaddis in jail. When you spread hate and misinformation and still think it won't come back and bite you. Hypocrisy My country is so f***ed up that basic stuff like this is discussed in our everyday media . Why the f is this even in news ? u/savevideo You reap what you sow !! Hatred will only results in more hatred. To all Hindu, Muslim, Sikh or Christian out there love knows no boundaries. It is futile to oppose interfaith marriage if both man and woman are agrees with it. A Muslim girl can marry a Hindu boy, a Hindu girl can marry a Christian and so on. Reading in news that wedding has been cancelled for now. And yet he is in the BJP. Mark of Vishnu r/LeopardsAteMyFace Irony creates itself. With release of Kerala files- loss in KN, RSS supporter scientist leaks files of DRDO to ISI and now this. I guess funds in PM CARES should be utilised to buy burnol and Blood pressure medicines for rt wing members The thirst for power makes people agnostic towards political opinions, I am certain most of old BJP leadership thinks Modi is full of shit. Benam Baadshah Agreed But the thing is it's not easy now, damage is done . I have fallen for a girl but i often overthink the future possibilities of me being put in jail on accusations of love jihad if suppose the girls family is not happy I am only 20, Engineering first year and although I am an atheist (my family too) legally we all still are muslims oh they definitely do. Just that he is too popular. Difficult times indeed 😔 Where my bajrandal chaddis at?. Btw he was talking about Ankita Bhandari case. What happened to that case? is the case suppressed? Technically, that's not a bad thing. I doubt that the BJP will ever decline in power drastically. They've pretty much embedded themselves into Indian politics by now. A more realistic future is for them to gradually become more progressive as some of the more outdated ideologies get phased out with time. Isn't it better if BJP becomes more progressive with time rather than staying the way they are? That way we'll have more options to choose from. BJP cannot decline in power simply because of human nature. All countries have an entho-religious nationalist group, that gains power every few years. Arab Springs brought in pure Islamist government overturning secular but undemocratic rule. Republicans in the US still use churches and pastor connections to get votes, same with the Conservatives in the UK and Marine Le Pen in France. Why would Hindus and Indians be any different ? Every state has this problem. Which is why I said it's unrealistic. Them becoming more progressive over time is not impossible on the other hand. Considering everything, he handled the question of his daughter quite well. Which marriage was this? How was Siddharamaiahs earlier stint as the CM of karnataka seen btw Opening scene if Gujarat files Development wise nothing much better than BJP. But he was pro-poor and had many schemes which helped poor. Some were stupid freebies but overall not so bad. Corruption wise also they were bad, but BJP this time were worse. Dude, run! Clean, no-nonsense governance. Fiscally prudent. Strong stance against communalism. Siddhu himself is an atheist. Here you go Why ? They will kill you. There are multiple cases of the girls' families \"complaining\" to police about their child being abducted and police arresting the person. In many marriage registration offices, the clerical staff has contacts with VHP and as soon as anyone arrives for marriage under special marriage act, they inform VHP, who then pressurize the girl's family to cancel the marriage. Yeah but i don't plan on marriage or anything else for that matter Also , keeping everything aside i don't think these goons are that deserving to dictate my love life don't you think? I am just normal friends with her and won't confess anyways it's just that I sometimes overthink > Isn’t it better if BJP becomes more progressive with time If you look at the leadership of the party over the years, it's going in the opposite direction. I honestly wouldn't be surprised if a couple decades down the line, Pragya Thakur or Yati Narsinghanand becomes their PM candidate Ah! Anyway, be safe and take care. A guy DMed me on this comment and said that main bohot Ganda phasunga I should not do such things. Upon looking at his profile my dude was active in Sham Sharma show and had recently posted how muslim men tend to be more leaning towards beating their wives. I am thinking if he was insecure that I may end up with a Hindu girl or was he genuinely concerned about me? You are overthinking here. I think her daughter has.medical problems due to which arrange marriage was not possible for her"
}