{
    "id": "18bb8tf",
    "title": "\"Some things are best left unsaid\" : Justice SK Kaul On Deletion Of Petitions Against Centre's Delay In Judges' Appointments",
    "url": "https://www.livelaw.in/top-stories/justice-sk-kaul-on-deletion-of-petitions-against-centres-delay-in-judges-appointments-243736",
    "selftext": "When Prashant Bhushan said that the deletion of the case was unusual, Justice Kaul said, \"some things are best left unsaid\".",
    "flair": "Law & Courts",
    "score": 33,
    "num_comments": 6,
    "created_utc": 1701780505.0,
    "convurl": "https://external-preview.redd.it/4g9hfCBIbDFRc-iWr6O2h4_b9Ma2J0n2iMtXhtCO9hI.jpg?auto=webp&s=0769877fd03a39203a3d23890bc933977be07e9b",
    "comments": [
        "\"The judges appointment matter is not listed today. It is strange that it is deleted,\" Bhushan said.\n\n\"I will just say one thing. I have not deleted the matter,\" Justice Kaul said.\n\n\"Your lordship should ask for an explanation from the Registry,\" Bhushan replied.\n\n\"I am sure the Chief Justice is aware of it,\" responded Justice Kaul.\n\n\"Very strange. A judicial order to list it today is there,\" Bhushan pointed out.\n\n\"Yesterday I found it was deleted. I checked up,\" Justice Kaul said.\n\nWhen Bhushan said it was \"very unusual\", Justice Kaul replied, \"somethings are best left unsaid sometimes\".\n\n\"I clarify that it is not that I have deleted the matter or that I am unwilling to take the matter. Both\", Justice Kaul said in conclusion.\n\n\n\nOn several previous occasion, the bench had criticised the Central Government for sitting over collegium resolutions. The Centre's \"pick and choose\" approach whereby only certain recommendations are approved and certain others are kept pending also came under the harsh criticism of the Court.\n\n\nOn the previous hearing date, the Court had flagged the selective approach in notifying the transfer of judges and specifically highlighted that four judges of the Gujarat High Court have not been transferred, despite the collegium recommendations.\n\nJustice Kaul, who had earlier told the Attorney General that he will post the matter at regular intervals to monitor the progress in appointments, is retiring with effect from December 25. The Court will close for summer vacations on December 15.",
        "He is basically saying it is deleted on CJI's order.",
        "I doubt cji would do that without informing/consulting him",
        "If it were not with CJI's consent, he wouldn't be saying that.",
        "Ofcourse that can't happen without the cji's consent. It's rather that he would've known it too. \n\nJustice kaul was harsh in the previous hearings and in his overall term. He's retiring soon. Its a neat look at how they manage things up there",
        "> \"All that is necessary for the triumph of evil is that good men do nothing.\" (Edmund Burke)   \n\nBad Things Happen Because Good People Don't Speak Out"
    ],
    "cleaned_text": "things best left unsaid justice sk kaul deletion petitions centres delay judges appointments prashant bhushan said deletion case unusual justice kaul said things best left unsaid ",
    "cleaned_title": "things best left unsaid justice sk kaul deletion petitions centres delay judges appointments",
    "cleaned_selftext": "prashant bhushan said deletion case unusual justice kaul said things best left unsaid",
    "cleaned_comments": "judges appointment matter listed today strange deleted bhushan said say one thing deleted matter justice kaul said lordship ask explanation registry bhushan replied sure chief justice aware responded justice kaul strange judicial order list today bhushan pointed yesterday found deleted checked justice kaul said bhushan said unusual justice kaul replied somethings best left unsaid sometimes clarify deleted matter unwilling take matter justice kaul said conclusion several previous occasion bench criticised central government sitting collegium resolutions centres pick choose approach whereby certain recommendations approved certain others kept pending also came harsh criticism court previous hearing date court flagged selective approach notifying transfer judges specifically highlighted four judges gujarat high court transferred despite collegium recommendations justice kaul earlier told attorney general post matter regular intervals monitor progress appointments retiring effect december court close summer vacations december basically saying deleted cjis order doubt cji would without informingconsulting cjis consent wouldnt saying ofcourse cant happen without cjis consent rather wouldve known justice kaul harsh previous hearings overall term hes retiring soon neat look manage things necessary triumph evil good men nothing edmund burke bad things happen good people dont speak",
    "light_cleaned_title": "\"Some things are best left unsaid\" : Justice SK Kaul On Deletion Of Petitions Against Centre's Delay In Judges' Appointments",
    "light_cleaned_selftext": "When Prashant Bhushan said that the deletion of the case was unusual, Justice Kaul said, \"some things are best left unsaid\".",
    "light_cleaned_comments": "\"The judges appointment matter is not listed today. It is strange that it is deleted,\" Bhushan said. \"I will just say one thing. I have not deleted the matter,\" Justice Kaul said. \"Your lordship should ask for an explanation from the Registry,\" Bhushan replied. \"I am sure the Chief Justice is aware of it,\" responded Justice Kaul. \"Very strange. A judicial order to list it today is there,\" Bhushan pointed out. \"Yesterday I found it was deleted. I checked up,\" Justice Kaul said. When Bhushan said it was \"very unusual\", Justice Kaul replied, \"somethings are best left unsaid sometimes\". \"I clarify that it is not that I have deleted the matter or that I am unwilling to take the matter. Both\", Justice Kaul said in conclusion. On several previous occasion, the bench had criticised the Central Government for sitting over collegium resolutions. The Centre's \"pick and choose\" approach whereby only certain recommendations are approved and certain others are kept pending also came under the harsh criticism of the Court. On the previous hearing date, the Court had flagged the selective approach in notifying the transfer of judges and specifically highlighted that four judges of the Gujarat High Court have not been transferred, despite the collegium recommendations. Justice Kaul, who had earlier told the Attorney General that he will post the matter at regular intervals to monitor the progress in appointments, is retiring with effect from December 25. The Court will close for summer vacations on December 15. He is basically saying it is deleted on CJI's order. I doubt cji would do that without informing/consulting him If it were not with CJI's consent, he wouldn't be saying that. Ofcourse that can't happen without the cji's consent. It's rather that he would've known it too. Justice kaul was harsh in the previous hearings and in his overall term. He's retiring soon. Its a neat look at how they manage things up there > \"All that is necessary for the triumph of evil is that good men do nothing.\" (Edmund Burke) Bad Things Happen Because Good People Don't Speak Out"
}