{
    "id": "1ewrw86",
    "title": "Centre Asks UPSC To Withdraw Lateral Entry Amid Row",
    "url": "https://www.ndtv.com/india-news/cancel-lateral-entry-ad-minister-writes-to-upsc-head-amid-massive-row-6376565",
    "selftext": "The move triggered a debate on lateral entry into bureaucracy, with Congress leader Rahul Gandhi denouncing the process as an \"attack on Dalits\". The ruling BJP countered by pointing out that the concept emerged under a Congress-led government.\n\nHowever, Union Minister Chirag Paswan, the BJP's Bihar ally, echoed the criticism. \"Reservation provisions must be there in any government appointment. There are no ifs and buts in this. No reservation exists in the private sector and if it is not implemented in government positions as well... The information came up before me on Sunday and it is a matter of concern for me,\" Mr Paswan was quoted as saying by news agency Press Trust of India.",
    "flair": "Policy/Economy",
    "score": 8,
    "num_comments": 1,
    "created_utc": 1724148908.0,
    "convurl": "https://external-preview.redd.it/_i0cm9UZ2i1nueEPm6gvZUhnkVCJzH_gWwXqAnt-dPM.jpg?auto=webp&s=12f09cf229aab9b76bc0bd271f86345e6828e5c3",
    "comments": [
        "Papa is now afraid of Rahul Gandhi."
    ],
    "cleaned_text": "centre asks upsc withdraw lateral entry amid row move triggered debate lateral entry bureaucracy congress leader rahul gandhi denouncing process attack dalits ruling bjp countered pointing concept emerged congressled government however union minister chirag paswan bjps bihar ally echoed criticism reservation provisions must government appointment ifs buts reservation exists private sector implemented government positions well information came sunday matter concern mr paswan quoted saying news agency press trust india ",
    "cleaned_title": "centre asks upsc withdraw lateral entry amid row",
    "cleaned_selftext": "move triggered debate lateral entry bureaucracy congress leader rahul gandhi denouncing process attack dalits ruling bjp countered pointing concept emerged congressled government however union minister chirag paswan bjps bihar ally echoed criticism reservation provisions must government appointment ifs buts reservation exists private sector implemented government positions well information came sunday matter concern mr paswan quoted saying news agency press trust india",
    "cleaned_comments": "papa afraid rahul gandhi",
    "light_cleaned_title": "Centre Asks UPSC To Withdraw Lateral Entry Amid Row",
    "light_cleaned_selftext": "The move triggered a debate on lateral entry into bureaucracy, with Congress leader Rahul Gandhi denouncing the process as an \"attack on Dalits\". The ruling BJP countered by pointing out that the concept emerged under a Congress-led government. However, Union Minister Chirag Paswan, the BJP's Bihar ally, echoed the criticism. \"Reservation provisions must be there in any government appointment. There are no ifs and buts in this. No reservation exists in the private sector and if it is not implemented in government positions as well... The information came up before me on Sunday and it is a matter of concern for me,\" Mr Paswan was quoted as saying by news agency Press Trust of India.",
    "light_cleaned_comments": "Papa is now afraid of Rahul Gandhi."
}