{
    "id": "16mldqz",
    "title": "Help me buy a phone (between 40k and 50k)",
    "url": "https://www.reddit.com/r/india/comments/16mldqz/help_me_buy_a_phone_between_40k_and_50k/",
    "selftext": "Right now, it's looking like I have the following choices:\n\nGOOGLE Pixel 7a \\[8GB/128GB\\] - [44k on Flipkart](https://www.flipkart.com/google-pixel-7a-sea-128-gb/p/itmb4d7b100b1a4d) :\n\n* Tensor G2 processor, comparable to SD888\n* Apparently poor battery life\n* 90hz OLED\n* Best photos\n* Stock Android\n\nSAMSUNG Galaxy S21 FE \\[8GB/128GB\\] - [45k on Samsung](https://www.samsung.com/in/smartphones/galaxy-s21-5g/galaxy-s21-fe-5g/buy/) :\n\n* SD 888\n* Decent battery life (?)\n* 120hz AMOLED\n* Decent photos (?)\n* OneUI\n\nNOTHING Phone (2) \\[8GB/128GB\\] - [44k on Flipkart](https://www.flipkart.com/nothing-phone-2-dark-grey-128-gb/p/itmc1490711c3eb9?pid=MOBGZSDKDHFGSDCZ&marketplace=FLIPKART&sattr[]=ram&st=ram) :\n\n* SD 8+ Gen1\n* Decent battery life (?)\n* 120hz LTPO OLED\n* Decent photos (?)\n* NothingOS\n\nONEPLUS 11R \\[8GB/128GB\\] - [40k on Flipkart](https://www.flipkart.com/oneplus-11r-5g-sonic-black-128-gb/p/itmd8344a066fd54?pid=MOBGN3AF8GEAKKNA) :\n\n* SD 8+ Gen1\n* Decent battery life (?)\n* 120hz AMOLED\n* Decent photos (?)\n* OxygenOS\n\nWhat other options do I have in the 40-50k price range with similar specs. I have been a budget phone user all my life and I'm trying to pay a decent price for a decent phone. The Samsung and Pixel provide 4 years of Android updates for example. I want something that will last me at least that long.\n\nAlso, I am not touching any of the Xiaomi/Poco/Oppo/Redmi/Mi/etc. I understand OnePlus and Nothing may not be considered in the same class as Samsung and Google, but they're better than the others atleast",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 66,
    "created_utc": 1695112136,
    "convurl": "https://external-preview.redd.it/D72ciOTKRdJCAZw4-OoOG7OLOYisfrNCZX6GmcnceqM.jpg?auto=webp&s=1524f8f07fc4bfb66cc773b94594a566ff410bab",
    "comments": [
        "Motorola edge 40 Neo launches 21st. Should be 35k. Looks impressive. Maybe check it out?\n\n\nCleanest os outside of pixel. 2 Android updates on 40 Neo. 7030 would be better than Google tensor.",
        "Pixel 7a for camera, \nS21 fe close 2nd for overall, good camera and overall reliability,\nOther 2 incase looks, in hand feel, gaming are important and you can make do with average camera.",
        "You can get a pixel 7a for around 30k from next month most probably, because pixel 8 is launching in october so according to previous pricing patterns of pixel phones, price of pixel 7 and pixel 7a will drop most probably by a good margin.",
        "Pixel for the camera. Baaki torrenting aur free maal toh kisi mei bhi chal jayega.",
        "Torrenting?",
        "Piratebay/kickass/free maal",
        "20fe is cheaper and is a better phone than 21fe",
        "What does the choice of phone have to do with this lol. You can do this on any phone",
        "Wait for S23 FE",
        "SD865, maybe I would've bought it when it came out in 2020, not now tho. My friend has it, and I didn't like the camera",
        "Edge 40 Neo is going to be launched around 25K.",
        "Nothing",
        "Apps brother.",
        "iPhone 13 during BBD or Amazon Great Indian Festival sale",
        "Bura lagta hai jab photos achi nahi aati. iPhone kyu nahi le raha?",
        "It would probably launch at >50k no? I'd have to wait for the next sale which would take much longer. I wanted to buy a phone during next month's Diwali sale. Otherwise, S23FE does look to be a decent phone, is it worth waiting",
        "Brother, I'm only buying Android. All of them use the PlayStore on the latest version of Android, all of them have support for the same apps",
        "Not really an iPhone fan tbh, I pretty much \"require\" being able to install cracked apps. I probably won't be able to adapt to it after being a pirate for so long",
        "I second this I'm an iPhone user from 2017 n I've seen a lot of my frnds admiring camera of my phones no matter which phone they've",
        "Yes but you can get it a bit cheaper by using discounts (like samsung referral) and credit card during Diwali sale or maybe exchange your old device.\n\n In any case if it's still out of your budget, after S23FE's launch (pixel 8 will also launch during same time), older devices from these companies will become cheaper, so you can grab those too.",
        "If you're into photography, definitely go for the 7a. It will take the best photos for sure. I bought a 7, 6 months ago and I love it. It doesn't have a snapdragon if you care about that, I only use my phone for calls and photos, so it didn't matter to me.",
        "* No Side-loading (hopefully that's changing)\n* Lack of cracked apps\n* I **despise** the notch",
        "True, I'll see what prices look like during Diwali and see if it's worth it",
        "Before switching to Apple, I was a die-hard Android user, and I must admit that I do miss the Google Rewards programme, which gives users free money to spend on apps and free maal possibility. Google's UI is quicker while being simpler. Camera toh tujhe pata hi hain. Samsung ki toh maa-bhen hojati hai 2 saal mein.",
        "I don't care much for photos other than the random stuff here and there. Definitely not \"into\" photography. But when I do need it, I would appreciate it if it was a decent experience",
        "Vaise bhi big billion days aa raha hain, thoda rukja.",
        "Hopefully? Inse nahi hoga ye bohot bade kattar hain. Inko paise bhi bhookh hain.",
        "Thats why I switched to apple to get a much better camera and a more fluid UI.",
        "Well, EU forced the USB-C adoption and Apple caved. I can imagine side-loading coming to Apple too\n\n[https://www.business-standard.com/technology/tech-news/wwdc-2023-apple-may-open-up-iphones-to-sideloading-apps-with-ios-17-123041700081\\_1.html](https://www.business-standard.com/technology/tech-news/wwdc-2023-apple-may-open-up-iphones-to-sideloading-apps-with-ios-17-123041700081_1.html)",
        "This is definitely tree, all my friends flock to the nearest iPhone user when someone needs a photo taken. This isn't really that important to me, and the Pixel should be able to take decent photos.\n\nI'm not gonna compare the photo capture capabilities of each phone, but it's not an important factor for me.",
        "For 30-35k, I'd be happy to buy the 7a. The difference between 7a and 7 are so small that it's not worth it",
        "If the base Nothing (2) goes under 40k, I might consider it because the OnePlus 11R is essentially the same phone ([Comparison](https://www.gsmarena.com/compare.php3?idPhone1=11915&idPhone2=12386#diff-))",
        "Uh just exchange your phone for iqoo 11 or one plus 11",
        "I'd get like 5k off max, I don't trust the iQoo brand. I wanna spend a decent amount of money for a decent brand. I hope to use it for a while",
        "Well you can wait for sale and get s23 for a reasonable 50k on exchange, otherwise one plus 11 is best phone especially 16/256 variant as it will last you 4 years easily",
        "Having used the above 4, Nothing 2 is best overall.",
        "Feeling is mutual, even I think 7a is a better deal for the price",
        "That could be a possibility. 16/256 definitely sounds nice, 8 Gen2, LTPO AMOLED. Current 59k on Flipkart and 61k on Amazon. I doubt it will go under 50k for Diwali, but maybe with exchange",
        "I'm really interested in the Nothing, but I really don't like the look of NothingOS. I hope it lets us go back to Stock, or I'll just use Nova Launcher. 4k more than OP11R for similar specs. Maybe",
        "Future proofing man, as long you get it around 50k pricing its a steal deal with little to no downside whatsoever. Plus 8 gen 2 is arguably most stable android soc till date plus 16/256 of lpddr5x ram and ufs 4.0 storage simply means your phone will fly to a long time come.",
        "Yeah, I definitely agree with you, but we all have budgets for a reason. Let's see how Diwali affect OnePlus",
        "True true budget constraints can be big issue but you can always wait for sale and see if you can get killer deal and even if you don’t there is a upcoming one plus 11r upgrade with 8gen2 so you can take a look into that",
        "11R upgrade? I didn't see anything about that",
        "This one bro https://m.gsmarena.com/oneplus_ace_2_pro-12473.php it’s basically 11r but with 8gen 2 and all the perks that come with 8gen2 its expected to launch next quarter sometime in November",
        "I think you should go to nothing's sub before (if) you decide nothing phone, i see a lot of complains... Like someone said wait till the next pixel is out for a price drop in the 7 series and btw 7 is better than 7a for slightly more money I know it's obvious but thats something mkbhd ponted out lol...make sure s21 Fe is SD because I don't think they sell the SD version in India yet plus I own it (Exynos wala)...would personally suggest pixel and while you're at it just Google smartphone processor rankings there are mediatek and other processors with better performance numbers than snapdragon...also snapdragon 7 plus gen 2 is better than most 800 series SD processors",
        "Then you can check out the OnePlus 11R or Nothing Phone 2. I would lean towards the Nothing Phone 2",
        "Don't buy Nothing Phone 2. \n\nUsers have claimed it has poor speakers like a 15k phone. Camera and Haptics are shit. Gaming ain't good. Watch Mr Techpedia's video on it. \n\nPixel 7a isn't worth it. Pixel 7 might.\n\nOnePlus 11r's gaming performance ain't good. It has curved display but doesn't use Gorilla Glass in front. It uses something like dragon tail so it might be fragile. \n\nYou can go for OnePlus 11 during BBD or GIF sale, price is expected to come under 50k",
        "[XDA says the difference between Pixel 7 and 7a is minimal, sometimes inconsequential](https://www.xda-developers.com/google-pixel-7a-vs-7/). The only thing I see myself being worried  about is the OLED 90hz vs AMOLED 120hz. Currently 7a is 43k, 7 is 60k, so a difference of 17k. If the Pixel 7 goes under 50k during sale, maybe, but otherwise I don't see it's worth\n\nAs for Nothing (2), I realise that it might not be the best. Speakers aren't an issue, I'd need to see how bad the camera is and how is gaming bad on 8+ Gen1. I'll look at some reviews before making a decision\n\nIf OP11 goes under 50k, it definitely seems like a good deal. Otherwise, OP11R isn't that bad either tbh",
        "I'd need to check out that MKBHD video. [XDA says the difference between Pixel 7 and 7a is minimal, sometimes inconsequential](https://www.xda-developers.com/google-pixel-7a-vs-7/) so I'm interested to see. The only big difference (for me) is the 90hz OLED vs 120hz AMOLED\n\nIf I was getting S21FE it'll definitely be the SD888 version",
        "Bruh, pixel 7 is usually under 50k on Flipkart, idk the current price but expect under 45k in BBD. \n\nI am also considering buying OP11R but there is an issue you might wanna know- like slight jitters in UI here and there.\n\nAlso, do keep a tab over Moto Edge 30 Ultra. I found it to be better than OP11R and NP2",
        "[It's definitely at 60k rn, maybe they hiked it before the sale to make the sale discount look bigger ](https://www.flipkart.com/google-pixel-7-obsidian-128-gb/p/itm45d75002be0e7). If it's usually under 50k, that's good but what would the real differences be (see my edit in previous reply)\n\nIs that jitter issue only known on the OP11R or the OP11 too\n\nI should probably look more into the Motorola phones, wasn't really part of my searches",
        "I see, thanks. Will look into this too",
        ">It's definitely at 60k rn, maybe they hiked it before the sale to make the sale discount look bigger \n\nScamkart at it again lol. Do Google \"price history tracker\" and use it. Helps you make better decisions\n\n>Is that jitter issue only known on the OP11R or the OP11 too\n\nOnly 11R only afaik. Also, these are mild. But those who tried Oxygen OS 14 beta have claimed the UI is very smooth there.",
        "Also, join telegram groups of the phones you are interested in. You can talk to the users and get their input",
        "\n>Scamkart at it again lol. Do Google \"price history tracker\n\nWill do so\n\n>Only 11R only afaik. Also, these are mild. But those who tried Oxygen OS 14 beta have claimed the UI is very smooth there\n\nOkay, that doesn't sound too bad, software issues can be fixed",
        "I guess the camera sensors too not sure",
        "OS is the best part. But to each its own. You can go with some other launcher. \n\nOP might have similar specs but I doubt OP is anymore good. Used OP for few days (borrowed from a friend). Felt like using some Xiaomi non premium phone.",
        "Easy, pixel 7a anytime",
        "Guys, what would be the price of OnePlus 11 during Amazon Great Indian Festival sales? I have a very strict budget of 50k.",
        "It's sitting around 59k/61k rn, could go down to 53-55k. With exchange, maybe under 50k",
        "Sadly I was including the exchange price lol. Guess I'll take the L and wait for 12R.",
        "IMO nothing phone 2 does not justify it's price",
        "Here my all personal experiences . I sold last week Pixel 6a,7a ,7 on OLX at cheaper price. The main issues with G Pixel is Tensor chipset heat up , battery backup more service center only in Mumbai. \n\nI do not know about Nothing and  Oneplus  never bought and tried . \n\nBasically I'm iOS user so I just tried Google Pixel phones .  my friends are android users trusted brand Samsung , Motorola .",
        ">Tensor G2 processor\n\nYes the main problem is tensor ( from exynos )  and I sold pixel 7a ,7 ,6a at cheaper price last week on OLX .",
        "Whatever you do, don’t buy from Flipkart",
        "Ahh shit, why is that now?",
        "Too much scamming. Open box delivery is basically a way to push blame to the customer once delivered. The delivery guy hardly waits for you to actually check anything. They’ll deny any returns or issues once delivered. \n\nMy friend bought a pixel and it came with a scratched frame which he didn’t notice in low lighting at his door and all the 0.3 seconds that the delivery boy waited to snap a photo of it being delivered. He noticed it after half an hour or so and Flipkart straight out denied everything because “open box delivery“ \n\nAmazon is way better in terms of customer support but if you choose to buy a pixel, Flipkart is your only choice. I decided to go with a OnePlus over a pixel for my grandfather a few days back because I didn’t want to deal with Flipkart.",
        "What did you buy ultimately?",
        "Nothing lmao, still stuck on my Poco bullshit phone",
        "Any update OP which one did you go for?",
        "Sorry for the late reply, I just went with the S23 lmao. Ended up costing around 65k. Doesn't feel like a cheapo thing anymore, but it's pretty small. Got used to it now though",
        "Like using it? How is the performance?",
        "I really like it. Coming from the Poco X3 Pro which about as big as the S23 Ultra, the base S23 is a lot smaller. But I really like the feel of it now, I'm happy\n\nBattery life is decent, just sometimes it feels like apps opening and videos playing feels a bit laggy. Might just be me, but idk"
    ],
    "cleaned_text": "help buy phone k k right looking like following choices google pixel gbgb k flipkarthttpswwwflipkartcomgooglepixelaseagbpitmbdbbad tensor g processor comparable sd apparently poor battery life hz oled best photos stock android samsung galaxy fe gbgb k samsunghttpswwwsamsungcominsmartphonesgalaxysggalaxysfegbuy sd decent battery life hz amoled decent photos oneui nothing phone gbgb k flipkarthttpswwwflipkartcomnothingphonedarkgreygbpitmccebpidmobgzsdkdhfgsdczmarketplaceflipkartsattrramstram sd gen decent battery life hz ltpo oled decent photos nothingos oneplus r gbgb k flipkarthttpswwwflipkartcomoneplusrgsonicblackgbpitmdafdpidmobgnafgeakkna sd gen decent battery life hz amoled decent photos oxygenos options k price range similar specs budget phone user life im trying pay decent price decent phone samsung pixel provide years android updates example want something last least long also touching xiaomipocoopporedmimietc understand oneplus nothing may considered class samsung google theyre better others atleast ",
    "cleaned_title": "help buy phone k k",
    "cleaned_selftext": "right looking like following choices google pixel gbgb k flipkarthttpswwwflipkartcomgooglepixelaseagbpitmbdbbad tensor g processor comparable sd apparently poor battery life hz oled best photos stock android samsung galaxy fe gbgb k samsunghttpswwwsamsungcominsmartphonesgalaxysggalaxysfegbuy sd decent battery life hz amoled decent photos oneui nothing phone gbgb k flipkarthttpswwwflipkartcomnothingphonedarkgreygbpitmccebpidmobgzsdkdhfgsdczmarketplaceflipkartsattrramstram sd gen decent battery life hz ltpo oled decent photos nothingos oneplus r gbgb k flipkarthttpswwwflipkartcomoneplusrgsonicblackgbpitmdafdpidmobgnafgeakkna sd gen decent battery life hz amoled decent photos oxygenos options k price range similar specs budget phone user life im trying pay decent price decent phone samsung pixel provide years android updates example want something last least long also touching xiaomipocoopporedmimietc understand oneplus nothing may considered class samsung google theyre better others atleast",
    "cleaned_comments": "motorola edge neo launches st k looks impressive maybe check cleanest os outside pixel android updates neo would better google tensor pixel camera fe close nd overall good camera overall reliability incase looks hand feel gaming important make average camera get pixel around k next month probably pixel launching october according previous pricing patterns pixel phones price pixel pixel drop probably good margin pixel camera baaki torrenting aur free maal toh kisi mei bhi chal jayega torrenting piratebaykickassfree maal fe cheaper better phone fe choice phone lol phone wait fe sd maybe wouldve bought came tho friend didnt like camera edge neo going launched around k nothing apps brother iphone bbd amazon great indian festival sale bura lagta hai jab photos achi nahi aati iphone kyu nahi le raha would probably launch k id wait next sale would take much longer wanted buy phone next months diwali sale otherwise sfe look decent phone worth waiting brother im buying android use playstore latest version android support apps really iphone fan tbh pretty much require able install cracked apps probably wont able adapt pirate long second im iphone user n ive seen lot frnds admiring camera phones matter phone theyve yes get bit cheaper using discounts like samsung referral credit card diwali sale maybe exchange old device case still budget sfes launch pixel also launch time older devices companies become cheaper grab youre photography definitely go take best photos sure bought months ago love doesnt snapdragon care use phone calls photos didnt matter sideloading hopefully thats changing lack cracked apps despise notch true ill see prices look like diwali see worth switching apple diehard android user must admit miss google rewards programme gives users free money spend apps free maal possibility googles ui quicker simpler camera toh tujhe pata hi hain samsung ki toh maabhen hojati hai saal mein dont care much photos random stuff definitely photography need would appreciate decent experience vaise bhi big billion days aa raha hain thoda rukja hopefully inse nahi hoga ye bohot bade kattar hain inko paise bhi bhookh hain thats switched apple get much better camera fluid ui well eu forced usbc adoption apple caved imagine sideloading coming apple httpswwwbusinessstandardcomtechnologytechnewswwdcapplemayopenupiphonestosideloadingappswithioshtmlhttpswwwbusinessstandardcomtechnologytechnewswwdcapplemayopenupiphonestosideloadingappswithioshtml definitely tree friends flock nearest iphone user someone needs photo taken isnt really important pixel able take decent photos im gon na compare photo capture capabilities phone important factor k id happy buy difference small worth base nothing goes k might consider oneplus r essentially phone comparisonhttpswwwgsmarenacomcomparephpidphoneidphonediff uh exchange phone iqoo one plus id get like k max dont trust iqoo brand wan na spend decent amount money decent brand hope use well wait sale get reasonable k exchange otherwise one plus best phone especially variant last years easily used nothing best overall feeling mutual even think better deal price could possibility definitely sounds nice gen ltpo amoled current k flipkart k amazon doubt go k diwali maybe exchange im really interested nothing really dont like look nothingos hope lets us go back stock ill use nova launcher k opr similar specs maybe future proofing man long get around k pricing steal deal little downside whatsoever plus gen arguably stable android soc till date plus lpddrx ram ufs storage simply means phone fly long time come yeah definitely agree budgets reason lets see diwali affect oneplus true true budget constraints big issue always wait sale see get killer deal even dont upcoming one plus r upgrade gen take look r upgrade didnt see anything one bro basically r gen perks come gen expected launch next quarter sometime november think go nothings sub decide nothing phone see lot complains like someone said wait till next pixel price drop series btw better slightly money know obvious thats something mkbhd ponted lolmake sure fe sd dont think sell sd version india yet plus exynos walawould personally suggest pixel youre google smartphone processor rankings mediatek processors better performance numbers snapdragonalso snapdragon plus gen better series sd processors check oneplus r nothing phone would lean towards nothing phone dont buy nothing phone users claimed poor speakers like k phone camera haptics shit gaming aint good watch mr techpedias video pixel isnt worth pixel might oneplus rs gaming performance aint good curved display doesnt use gorilla glass front uses something like dragon tail might fragile go oneplus bbd gif sale price expected come k xda says difference pixel minimal sometimes inconsequentialhttpswwwxdadeveloperscomgooglepixelavs thing see worried oled hz vs amoled hz currently k k difference k pixel goes k sale maybe otherwise dont see worth nothing realise might best speakers arent issue id need see bad camera gaming bad gen ill look reviews making decision op goes k definitely seems like good deal otherwise opr isnt bad either tbh id need check mkbhd video xda says difference pixel minimal sometimes inconsequentialhttpswwwxdadeveloperscomgooglepixelavs im interested see big difference hz oled vs hz amoled getting sfe itll definitely sd version bruh pixel usually k flipkart idk current price expect k bbd also considering buying opr issue might wan na know like slight jitters ui also keep tab moto edge ultra found better opr np definitely k rn maybe hiked sale make sale discount look bigger httpswwwflipkartcomgooglepixelobsidiangbpitmdbee usually k thats good would real differences see edit previous reply jitter issue known opr op probably look motorola phones wasnt really part searches see thanks look definitely k rn maybe hiked sale make sale discount look bigger scamkart lol google price history tracker use helps make better decisions jitter issue known opr op r afaik also mild tried oxygen os beta claimed ui smooth also join telegram groups phones interested talk users get input scamkart lol google price history tracker r afaik also mild tried oxygen os beta claimed ui smooth okay doesnt sound bad software issues fixed guess camera sensors sure os best part go launcher op might similar specs doubt op anymore good used op days borrowed friend felt like using xiaomi non premium phone easy pixel anytime guys would price oneplus amazon great indian festival sales strict budget k sitting around kk rn could go k exchange maybe k sadly including exchange price lol guess ill take l wait r imo nothing phone justify price personal experiences sold last week pixel aa olx cheaper price main issues g pixel tensor chipset heat battery backup service center mumbai know nothing oneplus never bought tried basically im ios user tried google pixel phones friends android users trusted brand samsung motorola tensor g processor yes main problem tensor exynos sold pixel cheaper price last week olx whatever dont buy flipkart ahh shit much scamming open box delivery basically way push blame customer delivered delivery guy hardly waits actually check anything theyll deny returns issues delivered friend bought pixel came scratched frame didnt notice low lighting door seconds delivery boy waited snap photo delivered noticed half hour flipkart straight denied everything open box delivery amazon way better terms customer support choose buy pixel flipkart choice decided go oneplus pixel grandfather days back didnt want deal flipkart buy ultimately nothing lmao still stuck poco bullshit phone update op one go sorry late reply went lmao ended costing around k doesnt feel like cheapo thing anymore pretty small got used though like using performance really like coming poco x pro big ultra base lot smaller really like feel im happy battery life decent sometimes feels like apps opening videos playing feels bit laggy might idk",
    "light_cleaned_title": "Help me buy a phone (between 40k and 50k)",
    "light_cleaned_selftext": "Right now, it's looking like I have the following choices: GOOGLE Pixel 7a \\[8GB/128GB\\] - [44k on Flipkart](https://www.flipkart.com/google-pixel-7a-sea-128-gb/p/itmb4d7b100b1a4d) : * Tensor G2 processor, comparable to SD888 * Apparently poor battery life * 90hz OLED * Best photos * Stock Android SAMSUNG Galaxy S21 FE \\[8GB/128GB\\] - [45k on Samsung](https://www.samsung.com/in/smartphones/galaxy-s21-5g/galaxy-s21-fe-5g/buy/) : * SD 888 * Decent battery life (?) * 120hz AMOLED * Decent photos (?) * OneUI NOTHING Phone (2) \\[8GB/128GB\\] - [44k on Flipkart](https://www.flipkart.com/nothing-phone-2-dark-grey-128-gb/p/itmc1490711c3eb9?pid=MOBGZSDKDHFGSDCZ&marketplace=FLIPKART&sattr[]=ram&st=ram) : * SD 8+ Gen1 * Decent battery life (?) * 120hz LTPO OLED * Decent photos (?) * NothingOS ONEPLUS 11R \\[8GB/128GB\\] - [40k on Flipkart](https://www.flipkart.com/oneplus-11r-5g-sonic-black-128-gb/p/itmd8344a066fd54?pid=MOBGN3AF8GEAKKNA) : * SD 8+ Gen1 * Decent battery life (?) * 120hz AMOLED * Decent photos (?) * OxygenOS What other options do I have in the 40-50k price range with similar specs. I have been a budget phone user all my life and I'm trying to pay a decent price for a decent phone. The Samsung and Pixel provide 4 years of Android updates for example. I want something that will last me at least that long. Also, I am not touching any of the Xiaomi/Poco/Oppo/Redmi/Mi/etc. I understand OnePlus and Nothing may not be considered in the same class as Samsung and Google, but they're better than the others atleast",
    "light_cleaned_comments": "Motorola edge 40 Neo launches 21st. Should be 35k. Looks impressive. Maybe check it out? Cleanest os outside of pixel. 2 Android updates on 40 Neo. 7030 would be better than Google tensor. Pixel 7a for camera, S21 fe close 2nd for overall, good camera and overall reliability, Other 2 incase looks, in hand feel, gaming are important and you can make do with average camera. You can get a pixel 7a for around 30k from next month most probably, because pixel 8 is launching in october so according to previous pricing patterns of pixel phones, price of pixel 7 and pixel 7a will drop most probably by a good margin. Pixel for the camera. Baaki torrenting aur free maal toh kisi mei bhi chal jayega. Torrenting? Piratebay/kickass/free maal 20fe is cheaper and is a better phone than 21fe What does the choice of phone have to do with this lol. You can do this on any phone Wait for S23 FE SD865, maybe I would've bought it when it came out in 2020, not now tho. My friend has it, and I didn't like the camera Edge 40 Neo is going to be launched around 25K. Nothing Apps brother. iPhone 13 during BBD or Amazon Great Indian Festival sale Bura lagta hai jab photos achi nahi aati. iPhone kyu nahi le raha? It would probably launch at >50k no? I'd have to wait for the next sale which would take much longer. I wanted to buy a phone during next month's Diwali sale. Otherwise, S23FE does look to be a decent phone, is it worth waiting Brother, I'm only buying Android. All of them use the PlayStore on the latest version of Android, all of them have support for the same apps Not really an iPhone fan tbh, I pretty much \"require\" being able to install cracked apps. I probably won't be able to adapt to it after being a pirate for so long I second this I'm an iPhone user from 2017 n I've seen a lot of my frnds admiring camera of my phones no matter which phone they've Yes but you can get it a bit cheaper by using discounts (like samsung referral) and credit card during Diwali sale or maybe exchange your old device. In any case if it's still out of your budget, after S23FE's launch (pixel 8 will also launch during same time), older devices from these companies will become cheaper, so you can grab those too. If you're into photography, definitely go for the 7a. It will take the best photos for sure. I bought a 7, 6 months ago and I love it. It doesn't have a snapdragon if you care about that, I only use my phone for calls and photos, so it didn't matter to me. * No Side-loading (hopefully that's changing) * Lack of cracked apps * I **despise** the notch True, I'll see what prices look like during Diwali and see if it's worth it Before switching to Apple, I was a die-hard Android user, and I must admit that I do miss the Google Rewards programme, which gives users free money to spend on apps and free maal possibility. Google's UI is quicker while being simpler. Camera toh tujhe pata hi hain. Samsung ki toh maa-bhen hojati hai 2 saal mein. I don't care much for photos other than the random stuff here and there. Definitely not \"into\" photography. But when I do need it, I would appreciate it if it was a decent experience Vaise bhi big billion days aa raha hain, thoda rukja. Hopefully? Inse nahi hoga ye bohot bade kattar hain. Inko paise bhi bhookh hain. Thats why I switched to apple to get a much better camera and a more fluid UI. Well, EU forced the USB-C adoption and Apple caved. I can imagine side-loading coming to Apple too [https://www.business-standard.com/technology/tech-news/wwdc-2023-apple-may-open-up-iphones-to-sideloading-apps-with-ios-17-123041700081\\_1.html](https://www.business-standard.com/technology/tech-news/wwdc-2023-apple-may-open-up-iphones-to-sideloading-apps-with-ios-17-123041700081_1.html) This is definitely tree, all my friends flock to the nearest iPhone user when someone needs a photo taken. This isn't really that important to me, and the Pixel should be able to take decent photos. I'm not gonna compare the photo capture capabilities of each phone, but it's not an important factor for me. For 30-35k, I'd be happy to buy the 7a. The difference between 7a and 7 are so small that it's not worth it If the base Nothing (2) goes under 40k, I might consider it because the OnePlus 11R is essentially the same phone ([Comparison](https://www.gsmarena.com/compare.php3?idPhone1=11915&idPhone2=12386#diff-)) Uh just exchange your phone for iqoo 11 or one plus 11 I'd get like 5k off max, I don't trust the iQoo brand. I wanna spend a decent amount of money for a decent brand. I hope to use it for a while Well you can wait for sale and get s23 for a reasonable 50k on exchange, otherwise one plus 11 is best phone especially 16/256 variant as it will last you 4 years easily Having used the above 4, Nothing 2 is best overall. Feeling is mutual, even I think 7a is a better deal for the price That could be a possibility. 16/256 definitely sounds nice, 8 Gen2, LTPO AMOLED. Current 59k on Flipkart and 61k on Amazon. I doubt it will go under 50k for Diwali, but maybe with exchange I'm really interested in the Nothing, but I really don't like the look of NothingOS. I hope it lets us go back to Stock, or I'll just use Nova Launcher. 4k more than OP11R for similar specs. Maybe Future proofing man, as long you get it around 50k pricing its a steal deal with little to no downside whatsoever. Plus 8 gen 2 is arguably most stable android soc till date plus 16/256 of lpddr5x ram and ufs 4.0 storage simply means your phone will fly to a long time come. Yeah, I definitely agree with you, but we all have budgets for a reason. Let's see how Diwali affect OnePlus True true budget constraints can be big issue but you can always wait for sale and see if you can get killer deal and even if you don’t there is a upcoming one plus 11r upgrade with 8gen2 so you can take a look into that 11R upgrade? I didn't see anything about that This one bro it’s basically 11r but with 8gen 2 and all the perks that come with 8gen2 its expected to launch next quarter sometime in November I think you should go to nothing's sub before (if) you decide nothing phone, i see a lot of complains... Like someone said wait till the next pixel is out for a price drop in the 7 series and btw 7 is better than 7a for slightly more money I know it's obvious but thats something mkbhd ponted out lol...make sure s21 Fe is SD because I don't think they sell the SD version in India yet plus I own it (Exynos wala)...would personally suggest pixel and while you're at it just Google smartphone processor rankings there are mediatek and other processors with better performance numbers than snapdragon...also snapdragon 7 plus gen 2 is better than most 800 series SD processors Then you can check out the OnePlus 11R or Nothing Phone 2. I would lean towards the Nothing Phone 2 Don't buy Nothing Phone 2. Users have claimed it has poor speakers like a 15k phone. Camera and Haptics are shit. Gaming ain't good. Watch Mr Techpedia's video on it. Pixel 7a isn't worth it. Pixel 7 might. OnePlus 11r's gaming performance ain't good. It has curved display but doesn't use Gorilla Glass in front. It uses something like dragon tail so it might be fragile. You can go for OnePlus 11 during BBD or GIF sale, price is expected to come under 50k [XDA says the difference between Pixel 7 and 7a is minimal, sometimes inconsequential](https://www.xda-developers.com/google-pixel-7a-vs-7/). The only thing I see myself being worried about is the OLED 90hz vs AMOLED 120hz. Currently 7a is 43k, 7 is 60k, so a difference of 17k. If the Pixel 7 goes under 50k during sale, maybe, but otherwise I don't see it's worth As for Nothing (2), I realise that it might not be the best. Speakers aren't an issue, I'd need to see how bad the camera is and how is gaming bad on 8+ Gen1. I'll look at some reviews before making a decision If OP11 goes under 50k, it definitely seems like a good deal. Otherwise, OP11R isn't that bad either tbh I'd need to check out that MKBHD video. [XDA says the difference between Pixel 7 and 7a is minimal, sometimes inconsequential](https://www.xda-developers.com/google-pixel-7a-vs-7/) so I'm interested to see. The only big difference (for me) is the 90hz OLED vs 120hz AMOLED If I was getting S21FE it'll definitely be the SD888 version Bruh, pixel 7 is usually under 50k on Flipkart, idk the current price but expect under 45k in BBD. I am also considering buying OP11R but there is an issue you might wanna know- like slight jitters in UI here and there. Also, do keep a tab over Moto Edge 30 Ultra. I found it to be better than OP11R and NP2 [It's definitely at 60k rn, maybe they hiked it before the sale to make the sale discount look bigger ](https://www.flipkart.com/google-pixel-7-obsidian-128-gb/p/itm45d75002be0e7). If it's usually under 50k, that's good but what would the real differences be (see my edit in previous reply) Is that jitter issue only known on the OP11R or the OP11 too I should probably look more into the Motorola phones, wasn't really part of my searches I see, thanks. Will look into this too >It's definitely at 60k rn, maybe they hiked it before the sale to make the sale discount look bigger Scamkart at it again lol. Do Google \"price history tracker\" and use it. Helps you make better decisions >Is that jitter issue only known on the OP11R or the OP11 too Only 11R only afaik. Also, these are mild. But those who tried Oxygen OS 14 beta have claimed the UI is very smooth there. Also, join telegram groups of the phones you are interested in. You can talk to the users and get their input >Scamkart at it again lol. Do Google \"price history tracker Will do so >Only 11R only afaik. Also, these are mild. But those who tried Oxygen OS 14 beta have claimed the UI is very smooth there Okay, that doesn't sound too bad, software issues can be fixed I guess the camera sensors too not sure OS is the best part. But to each its own. You can go with some other launcher. OP might have similar specs but I doubt OP is anymore good. Used OP for few days (borrowed from a friend). Felt like using some Xiaomi non premium phone. Easy, pixel 7a anytime Guys, what would be the price of OnePlus 11 during Amazon Great Indian Festival sales? I have a very strict budget of 50k. It's sitting around 59k/61k rn, could go down to 53-55k. With exchange, maybe under 50k Sadly I was including the exchange price lol. Guess I'll take the L and wait for 12R. IMO nothing phone 2 does not justify it's price Here my all personal experiences . I sold last week Pixel 6a,7a ,7 on OLX at cheaper price. The main issues with G Pixel is Tensor chipset heat up , battery backup more service center only in Mumbai. I do not know about Nothing and Oneplus never bought and tried . Basically I'm iOS user so I just tried Google Pixel phones . my friends are android users trusted brand Samsung , Motorola . >Tensor G2 processor Yes the main problem is tensor ( from exynos ) and I sold pixel 7a ,7 ,6a at cheaper price last week on OLX . Whatever you do, don’t buy from Flipkart Ahh shit, why is that now? Too much scamming. Open box delivery is basically a way to push blame to the customer once delivered. The delivery guy hardly waits for you to actually check anything. They’ll deny any returns or issues once delivered. My friend bought a pixel and it came with a scratched frame which he didn’t notice in low lighting at his door and all the 0.3 seconds that the delivery boy waited to snap a photo of it being delivered. He noticed it after half an hour or so and Flipkart straight out denied everything because “open box delivery“ Amazon is way better in terms of customer support but if you choose to buy a pixel, Flipkart is your only choice. I decided to go with a OnePlus over a pixel for my grandfather a few days back because I didn’t want to deal with Flipkart. What did you buy ultimately? Nothing lmao, still stuck on my Poco bullshit phone Any update OP which one did you go for? Sorry for the late reply, I just went with the S23 lmao. Ended up costing around 65k. Doesn't feel like a cheapo thing anymore, but it's pretty small. Got used to it now though Like using it? How is the performance? I really like it. Coming from the Poco X3 Pro which about as big as the S23 Ultra, the base S23 is a lot smaller. But I really like the feel of it now, I'm happy Battery life is decent, just sometimes it feels like apps opening and videos playing feels a bit laggy. Might just be me, but idk"
}