{
    "id": "15g68im",
    "title": "The Registration of Births and Deaths (Amendment) Bill, 2023, has been passed in the Lok Sabha after only 22 minutes of being considered for discussion! It is important to note how this bill seeks to track the life and death of citizens.",
    "url": "https://www.reddit.com/r/india/comments/15g68im/the_registration_of_births_and_deaths_amendment/",
    "selftext": "Clause 4 & 13 are concerning. They focus on developing a database of births & deaths to be used to update every other govt. database including voter rolls, NPR, etc; & making birth certificates mandatory for schools, govt. jobs, voter registration, marriage registration, etc.\n\nThe opposition argued that the bill does not meet the legality, necessity, and proportionality criteria laid down in the Puttaswamy judgment, creating mass surveillance infrastructure for profiling, targeting, and discrimination against Indian citizens.\n\nAs pointed out by Asaduddin Owaisi in the Parliament, around 38% of children under the age of 5 lack a birth certificate and only 56.4% have registered births in rural areas, making access to government schemes more difficult for those in rural areas.\n\nThis bill puts in place a government surveillance and population tracking tool covering every aspect of an individual’s life.\n\nRead more:[*https://m.thewire.in/article/tech/registration-of-births-deaths-aadhaar-voter-id*](https://m.thewire.in/article/tech/registration-of-births-deaths-aadhaar-voter-id)",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690975216.0,
    "convurl": "https://external-preview.redd.it/_MlKGeUM1a6DL5mNk4nhs1qpV-E8TLI-dekXqFmWF0w.jpg?auto=webp&s=e30923610d60b3f78e1f18054eeb81a8e418f604",
    "comments": [
        "Don't mind me. I am just working on a list.\n\nThanks to current government, we know have:\n\n* LTCG tax\n* confusing GST (which some states are not getting their share of on time)\n* 30% tax on crypto gains with no consideration for losses\n* debt funds that are now less profitable. Long term capital gains from debt removed. All capital gains from debt & International equity to be at slab rate.\n* reduced interest rate on PPFs\n* no safe investment that can beat inflation forcing us to take riskier investments\n* GST on health insurance premium\n* Poor health spending and worse - tax money being wasted on quackery like AYUSH and AYUSH quacks who now can sneak into medical hospitals\n* demonetisation which even the govt doesn't talk about\n* sky high fuel prices and general cost of living\n* unemployment.\n* 20% TCS on foreign investments\n* Alleged stock market fraud by crony capitalist not being investigated.\n* Newly imposed limits on EPF contributions and the accrued interests introduced in Budget 2021 resulting in higher tax on withdrawal before maturity\n*80C and base slabs unchanged despite high inflation\n* New Surcharge of 10% on income above 50 Lakhs\n* New Surcharge for income above ₹1 crore was increased to 15% from 12%.\n* New Tax regime introduced and made default which is worse than old tax regime for most\n* Jan Vishwas Bill- lessens punishment on pharma companies that skip on quality. **<NEW!>**\n* ~~2% GST on private hostel and paying accommodations.~~**<NEW!>**[Law or AAR ruling?]\n\n**For those who don't want to get political, DO NOT READ FURTHER.**\n\n* An Aadhaar system that was bulldozed through Parliament as a money bill (??) and was forced on the public with little to no discussion or consensus with regards to privacy and potential government abuse.\n* PM Cares fund (that the public donated to and government employees had to donate to) which despite the name and government push is NOT a public fund thus not held accountable.\n* Pegasus scandal\n* Falling rankings in things like Press Freedom Index\n* NDA government - No Data Available on things like migrant worker deaths during Covid among other things\n* FCRA amendment- governments can stop NGOs from using foreign funds e.g. Amnesty International, GreenPeace. Also includes educational institutes like JNU from doing the same.\n* Electoral bond - you can anonymously donate as much as you like to political parties. \n* CAA - violates secular principle. Can be disastrous if paired with NCC.\n* The Registration of Births and Deaths (Amendment) Bill, 2023 (passed within 22 minutes!) that could lead to mass surveillance infrastructure for profiling, targeting, and discrimination against Indian citizens.**<NEW!>**\n\n\n**Please let me know of any corrections or additions.**",
        "We do need to track birth, death and cause of death. \r\n\r\nIt can help for future planning, gender ratio, leading indicators of deaths, population tracking.",
        "We are tracking birth and death",
        "How is this tracking? People are only born once and dies once in life, just 2 events. It is actually good for citizens. In Australia if someone dies it is automatically notified to all banks, telcos, insurance etc. Makes it easier for the family.",
        "Dont expect mindless idiots of this great nation give you hope. Fuckers deserve what they get.",
        "Birth certificate is such a necessary piece of document, am surprised why even today its not that prevalent in India, e.g in Singapore they notify live birth, all the concerned agency gets notification and you then approach them to get certificate printed.\n\nSingapore uses this info then to process visa requirement for ltvp, e.g children's which are born outside are needed to provide lot many vaccination proofs before they are allowed entry, while born inside simply pass through.",
        ">New Surcharge of 10% on income above 50 Lakhs  \n>  \n>New Surcharge for income above ₹1 crore was increased to 15% from 12%.\n\nWhy shouldn't the filthy rich be taxed more and in Context this are definitely rich.",
        "But we also have to suffer because of those fckers.",
        "We have a huge rural population that still uses midwives and such. \n\nWe are not a city state.",
        "There doesn't seem to be any issue with the clauses. Makes total sense.",
        "Add the riots. Babri Masjid riots when BJP came to prominence. Modi came to prominence after Godhra Riots. CAA riots, Farm Laws riots, Gurgaon riots, Manipur riots, Hizab-Halal riots in Karnataka. ALL THESE RIOTS DURING BJP RULE.",
        "Register and vote",
        "Estimates says India only issues about 65% of the death certificate. That's not tracking. \r\nNo one knows about birth certificates. OP's article says a lot of people don't have a birth certificate.",
        "Farmer protests, JNU protests..",
        "I think the article puts it correctly. On the surface, tracking or birth and death certificates is super important, especially to make life easier for folks dealing with inheritance scenarios, ensuring that, expired person’s identities are not stolen, etc. \n\nAs much as I think that the whole Aadhar scheme is one of indias biggest security nightmares, it has streamlined and simplified the KYC process for a lot of services. It’s a whole other story that people who should have no business getting our Aadhar info keep asking for it and get access to it with no resistance.\n\nThe issue is that there’s been no serious discussion of privacy and consequences of these laws and what the approved use cases for these databases would be. The lack of discussion is the biggest problem in my opinion.",
        "This govt really doesn’t give a sh!t about the poor & underprivileged. They want to digitise everything without actually putting in the infrastructure to make sure basic documents reach the poor free of cost and without any assurance of protecting your data or legal consequences for stolen or leaked data. Another disaster of a decision.",
        "You have heard about gram panchayats right",
        "> This bill puts in place a government surveillance and population tracking tool covering every aspect of an individual’s life.\n\nTracking from cradle to grave is the issue.",
        "well, what new riot/bomb blast/mass murder they are planning for the next election?",
        "So ?"
    ],
    "cleaned_text": "registration births deaths amendment bill passed lok sabha minutes considered discussion important note bill seeks track life death citizens clause concerning focus developing database births deaths used update every govt database including voter rolls npr etc making birth certificates mandatory schools govt jobs voter registration marriage registration etc opposition argued bill meet legality necessity proportionality criteria laid puttaswamy judgment creating mass surveillance infrastructure profiling targeting discrimination indian citizens pointed asaduddin owaisi parliament around children age lack birth certificate registered births rural areas making access government schemes difficult rural areas bill puts place government surveillance population tracking tool covering every aspect individuals life read morehttpsmthewireinarticletechregistrationofbirthsdeathsaadhaarvoteridhttpsmthewireinarticletechregistrationofbirthsdeathsaadhaarvoterid ",
    "cleaned_title": "registration births deaths amendment bill passed lok sabha minutes considered discussion important note bill seeks track life death citizens",
    "cleaned_selftext": "clause concerning focus developing database births deaths used update every govt database including voter rolls npr etc making birth certificates mandatory schools govt jobs voter registration marriage registration etc opposition argued bill meet legality necessity proportionality criteria laid puttaswamy judgment creating mass surveillance infrastructure profiling targeting discrimination indian citizens pointed asaduddin owaisi parliament around children age lack birth certificate registered births rural areas making access government schemes difficult rural areas bill puts place government surveillance population tracking tool covering every aspect individuals life read morehttpsmthewireinarticletechregistrationofbirthsdeathsaadhaarvoteridhttpsmthewireinarticletechregistrationofbirthsdeathsaadhaarvoterid",
    "cleaned_comments": "dont mind working list thanks current government know ltcg tax confusing gst states getting share time tax crypto gains consideration losses debt funds less profitable long term capital gains debt removed capital gains debt international equity slab rate reduced interest rate ppfs safe investment beat inflation forcing us take riskier investments gst health insurance premium poor health spending worse tax money wasted quackery like ayush ayush quacks sneak medical hospitals demonetisation even govt doesnt talk sky high fuel prices general cost living unemployment tcs foreign investments alleged stock market fraud crony capitalist investigated newly imposed limits epf contributions accrued interests introduced budget resulting higher tax withdrawal maturity c base slabs unchanged despite high inflation new surcharge income lakhs new surcharge income crore increased new tax regime introduced made default worse old tax regime jan vishwas bill lessens punishment pharma companies skip quality new gst private hostel paying accommodationsnewlaw aar ruling dont want get political read aadhaar system bulldozed parliament money bill forced public little discussion consensus regards privacy potential government abuse pm cares fund public donated government employees donate despite name government push public fund thus held accountable pegasus scandal falling rankings things like press freedom index nda government data available things like migrant worker deaths covid among things fcra amendment governments stop ngos using foreign funds eg amnesty international greenpeace also includes educational institutes like jnu electoral bond anonymously donate much like political parties caa violates secular principle disastrous paired ncc registration births deaths amendment bill passed within minutes could lead mass surveillance infrastructure profiling targeting discrimination indian citizensnew please let know corrections additions need track birth death cause death help future planning gender ratio leading indicators deaths population tracking tracking birth death tracking people born dies life events actually good citizens australia someone dies automatically notified banks telcos insurance etc makes easier family dont expect mindless idiots great nation give hope fuckers deserve get birth certificate necessary piece document surprised even today prevalent india eg singapore notify live birth concerned agency gets notification approach get certificate printed singapore uses info process visa requirement ltvp eg childrens born outside needed provide lot many vaccination proofs allowed entry born inside simply pass new surcharge income lakhs new surcharge income crore increased shouldnt filthy rich taxed context definitely rich also suffer fckers huge rural population still uses midwives city state doesnt seem issue clauses makes total sense add riots babri masjid riots bjp came prominence modi came prominence godhra riots caa riots farm laws riots gurgaon riots manipur riots hizabhalal riots karnataka riots bjp rule register vote estimates says india issues death certificate thats tracking one knows birth certificates ops article says lot people dont birth certificate farmer protests jnu protests think article puts correctly surface tracking birth death certificates super important especially make life easier folks dealing inheritance scenarios ensuring expired persons identities stolen etc much think whole aadhar scheme one indias biggest security nightmares streamlined simplified kyc process lot services whole story people business getting aadhar info keep asking get access resistance issue theres serious discussion privacy consequences laws approved use cases databases would lack discussion biggest problem opinion govt really doesnt give sht poor underprivileged want digitise everything without actually putting infrastructure make sure basic documents reach poor free cost without assurance protecting data legal consequences stolen leaked data another disaster decision heard gram panchayats right bill puts place government surveillance population tracking tool covering every aspect individuals life tracking cradle grave issue well new riotbomb blastmass murder planning next election",
    "light_cleaned_title": "The Registration of Births and Deaths (Amendment) Bill, 2023, has been passed in the Lok Sabha after only 22 minutes of being considered for discussion! It is important to note how this bill seeks to track the life and death of citizens.",
    "light_cleaned_selftext": "Clause 4 & 13 are concerning. They focus on developing a database of births & deaths to be used to update every other govt. database including voter rolls, NPR, etc; & making birth certificates mandatory for schools, govt. jobs, voter registration, marriage registration, etc. The opposition argued that the bill does not meet the legality, necessity, and proportionality criteria laid down in the Puttaswamy judgment, creating mass surveillance infrastructure for profiling, targeting, and discrimination against Indian citizens. As pointed out by Asaduddin Owaisi in the Parliament, around 38% of children under the age of 5 lack a birth certificate and only 56.4% have registered births in rural areas, making access to government schemes more difficult for those in rural areas. This bill puts in place a government surveillance and population tracking tool covering every aspect of an individual’s life. Read more:[*https://m.thewire.in/article/tech/registration-of-births-deaths-aadhaar-voter-id*](https://m.thewire.in/article/tech/registration-of-births-deaths-aadhaar-voter-id)",
    "light_cleaned_comments": "Don't mind me. I am just working on a list. Thanks to current government, we know have: * LTCG tax * confusing GST (which some states are not getting their share of on time) * 30% tax on crypto gains with no consideration for losses * debt funds that are now less profitable. Long term capital gains from debt removed. All capital gains from debt & International equity to be at slab rate. * reduced interest rate on PPFs * no safe investment that can beat inflation forcing us to take riskier investments * GST on health insurance premium * Poor health spending and worse - tax money being wasted on quackery like AYUSH and AYUSH quacks who now can sneak into medical hospitals * demonetisation which even the govt doesn't talk about * sky high fuel prices and general cost of living * unemployment. * 20% TCS on foreign investments * Alleged stock market fraud by crony capitalist not being investigated. * Newly imposed limits on EPF contributions and the accrued interests introduced in Budget 2021 resulting in higher tax on withdrawal before maturity *80C and base slabs unchanged despite high inflation * New Surcharge of 10% on income above 50 Lakhs * New Surcharge for income above ₹1 crore was increased to 15% from 12%. * New Tax regime introduced and made default which is worse than old tax regime for most * Jan Vishwas Bill- lessens punishment on pharma companies that skip on quality. **<NEW!>** * ~~2% GST on private hostel and paying accommodations.~~**<NEW!>**[Law or AAR ruling?] **For those who don't want to get political, DO NOT READ FURTHER.** * An Aadhaar system that was bulldozed through Parliament as a money bill (??) and was forced on the public with little to no discussion or consensus with regards to privacy and potential government abuse. * PM Cares fund (that the public donated to and government employees had to donate to) which despite the name and government push is NOT a public fund thus not held accountable. * Pegasus scandal * Falling rankings in things like Press Freedom Index * NDA government - No Data Available on things like migrant worker deaths during Covid among other things * FCRA amendment- governments can stop NGOs from using foreign funds e.g. Amnesty International, GreenPeace. Also includes educational institutes like JNU from doing the same. * Electoral bond - you can anonymously donate as much as you like to political parties. * CAA - violates secular principle. Can be disastrous if paired with NCC. * The Registration of Births and Deaths (Amendment) Bill, 2023 (passed within 22 minutes!) that could lead to mass surveillance infrastructure for profiling, targeting, and discrimination against Indian citizens.**<NEW!>** **Please let me know of any corrections or additions.** We do need to track birth, death and cause of death. It can help for future planning, gender ratio, leading indicators of deaths, population tracking. We are tracking birth and death How is this tracking? People are only born once and dies once in life, just 2 events. It is actually good for citizens. In Australia if someone dies it is automatically notified to all banks, telcos, insurance etc. Makes it easier for the family. Dont expect mindless idiots of this great nation give you hope. Fuckers deserve what they get. Birth certificate is such a necessary piece of document, am surprised why even today its not that prevalent in India, e.g in Singapore they notify live birth, all the concerned agency gets notification and you then approach them to get certificate printed. Singapore uses this info then to process visa requirement for ltvp, e.g children's which are born outside are needed to provide lot many vaccination proofs before they are allowed entry, while born inside simply pass through. >New Surcharge of 10% on income above 50 Lakhs > >New Surcharge for income above ₹1 crore was increased to 15% from 12%. Why shouldn't the filthy rich be taxed more and in Context this are definitely rich. But we also have to suffer because of those fckers. We have a huge rural population that still uses midwives and such. We are not a city state. There doesn't seem to be any issue with the clauses. Makes total sense. Add the riots. Babri Masjid riots when BJP came to prominence. Modi came to prominence after Godhra Riots. CAA riots, Farm Laws riots, Gurgaon riots, Manipur riots, Hizab-Halal riots in Karnataka. ALL THESE RIOTS DURING BJP RULE. Register and vote Estimates says India only issues about 65% of the death certificate. That's not tracking. No one knows about birth certificates. OP's article says a lot of people don't have a birth certificate. Farmer protests, JNU protests.. I think the article puts it correctly. On the surface, tracking or birth and death certificates is super important, especially to make life easier for folks dealing with inheritance scenarios, ensuring that, expired person’s identities are not stolen, etc. As much as I think that the whole Aadhar scheme is one of indias biggest security nightmares, it has streamlined and simplified the KYC process for a lot of services. It’s a whole other story that people who should have no business getting our Aadhar info keep asking for it and get access to it with no resistance. The issue is that there’s been no serious discussion of privacy and consequences of these laws and what the approved use cases for these databases would be. The lack of discussion is the biggest problem in my opinion. This govt really doesn’t give a sh!t about the poor & underprivileged. They want to digitise everything without actually putting in the infrastructure to make sure basic documents reach the poor free of cost and without any assurance of protecting your data or legal consequences for stolen or leaked data. Another disaster of a decision. You have heard about gram panchayats right > This bill puts in place a government surveillance and population tracking tool covering every aspect of an individual’s life. Tracking from cradle to grave is the issue. well, what new riot/bomb blast/mass murder they are planning for the next election? So ?"
}