{
    "id": "15eipg3",
    "title": "Gujarat government is thinking to make a law where signature of parents is mandatory for love marriages. Can they do it ?",
    "url": "https://www.reddit.com/r/india/comments/15eipg3/gujarat_government_is_thinking_to_make_a_law/",
    "selftext": "As todays  news came  Gujarat CM  visited patidar community (major community in Gujarat to promote BJP) and told them that goverment will think to implement the law of parents signature in love marriages and in this case opposition is also with government.\n\nPatidar is major political community in Gujarat and they are thinking that this law will decrease crime by 50% as after love  marriage girl suffers or parents commits suiside.\n\nI think this will direct hit on personal choices and freedom to marry anyone\n\n[Source](https://www.google.com/amp/s/m.timesofindia.com/city/ahmedabad/gujarat-mlas-make-consent-of-parents-mandatory-for-love-marriages/amp_articleshow/98718564.cms)\n\nWhat's your view on this ?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690815917.0,
    "convurl": "https://external-preview.redd.it/5N_50DLF7cP96A9ZXrMa4MTmDh0uXYwsvkI8pUPib0I.jpg?auto=webp&s=78f455461256183b6997480baa58a0ba7d255194",
    "comments": [
        "“After marriage girl suffers or parent commit suiside”\n\nNow only girls will commit suiside when parent say repeatedly “No”.\n\nNot for love marriage but they are paddling it like in Gujarat every Hindu girl is in love with Muslim and they are going to marry and India will have 6 karod by 2050 Muslim population if this is not passed.",
        "That's not what crime is",
        "Awesome, I think we should support it but  only for gujarat (guess why)",
        "Gujrat model.",
        "I've read this 3 times but fail to understand the logic behind how signatures will stop suicides or crimes .\n\nThen why don't we go to the next level and when we all cross the age of 10 we sign a document saying we commint any crimes.",
        "One death is better than two.\n\n- Gujrat politicians.",
        "So basically all poor people. A lot of well to do / who can afford have already left for other states/ countries.\nNo one wants to go back lmao",
        "It's a democracy. If majority of Gujjus want it to be law, then it should be.",
        "That's a bullshit argument. Democracy doesn't mean you can oppress those who don't have a majority opinion. An individual's rights needs to be respected as well.",
        "Where do individual rights stop and will of the majority start?\n\nIf it's illegal, it should be challenged in courts. We laymen can't decide what people of a state want to do. Unless you're a Gujju, then yeah, you should raise your point.",
        "It is Gujarat. They can do anything.",
        "If the honorable Supreme Court is not under any pressure, this kind of laws will be infringing the liberty of the adult individual and will be thrown out.",
        "It should only be challenged in courts? People should just shut up about it? Why? Why can't people have discourse regarding something that affects them outside of a courtroom?",
        "> India will have 6 karod by 2050 Muslim population if this is not passed.\n\nIndia had [17.2cr muslims](https://www.census2011.co.in/religion.php) in 2011",
        "So, by your logic, if majority kashmir folks want to be part of Pakistan, there is nothing else needed? We should allow it? \n\nWonder why then the government intervenes and shuts internet etc. Why have a central government exert power in one place but simply listen to the state's residents wish for another?",
        "The law will survive until SC steps in. No more.",
        "This law has no place in modern soceity. If at all govt thinks that general welfare of Girls marrying without parents consent needs additional support for her well being, special cells can be formed that regularly check on Girls wellfare post marraige and also keep parents posted with updates.\n\nGirls marrying without parents consent might find themselves isolated and aliented in case the said marraige did not turn out the way she expected it to be. Its our duty to ensure that we are able to create a safe space for them to feel cared for. If bad husbands also know that there's someone regularly checking on their wife, they would be careful about probable case of abuse or domestic violence.\n\nBut no way, a law should require adults to seek parents consent before getting married.\n\nIf parents feel they were let down by their children, its a natural process of dealing with adult children, govt has no role in moral policing so that parents can feel empowered again.",
        "By this idiot's logic, the Holocaust was completely fine because the killing and rape of jews wasn't illegal in Germany at the time. \nBrain-lacking buffoon.",
        "Are you perhaps retarded? Do you even understand how democracies are supposed to work?",
        "There’s a strong rumour of a new bill being proposed that a guy needs to have a basic degree to start a genocide.\n\nAnyone know how I can apply for ‘Entire Political Science’",
        "Easy solution… just tell the magistrate you dont love each other and get married",
        "Nothing will happen. Idiots will vote for criminals thinking their bigoted and perverted desires will be fulfilled but the law wouldn't be passed cos its a complete subversion of human rights. Of course one good thing is that the people who vote based on these perversions  will get the Govt and society they deserve. You can check how people talk about nazi Germany-won't be far from how people will talk about this cancerous regime and the generation that enabled it, in future.",
        "Edited",
        "That's literally what voting and civic participation are all about. The problem is that education is in such a bad shape that people literally don't know what their civic rights and duties are. Most responsible governments invite the views of and consult stakeholders and even the average voter before lawmaking of this nature, but you're too unaware to realise that it's your duty to be informed and participate in the State's governance, and instead go around lecturing people who are responsibly engaging in discussions and opinion building. The goverment is for the people of the state, you are the people, it's literally for you to decide.",
        "Let's make law where signature of parents is required to hold hands with someone and eat from the same plate of oreo ke pakode in public.",
        "It's valid that they can make any law if majority agrees in democracy but in our constitution it is also mentioned that if certain law interfere with basic rights, then it's illegal. This particular law would be directly against Right to Freedom.",
        "No. I don't even vote lol",
        "It doesn't effect me so honestly, I don't care",
        "But it's boring af. That's why we elect people to do it instead of us.",
        "How do you even remember these laws? Are you like a lawyer or something ?",
        "Wont it be against Article 21?",
        "Its basic social science lol. Everyone is taught this 9th or 10th class. Also when u prepare for govt job, u have to study everything taught from 6th to 12th again.",
        "> that this law will decrease crime by 50%\n\n\"crime\"??",
        "I don't remember that stuff. I was only interested in STEM and history, so I never really paid attention to civics. Mugged up some basic questions for boards, which was enough",
        "> I've read this 3 times but fail to understand the logic behind how signatures will stop suicides or crimes \n\nLeaders are old men and some old women. They dislike their children marrying against their wishes, so they ask for law to give them control. Next they will ask that to make court marriages and inter caste marriages illegal, and only parent approved marriages to take place. They will just cite one anecdote, like people do on reddit to justify their demand.",
        "This law is absolutely retarded if it becomes a thing. Adults are already at the age where they're free to do as they please and marry who they want to. What would happen if the parent refuses to sign? The marriage becomes void then? This law is literally meddling with human rights more than anything. \n\nBasically the Gujarat government is saying you should marry someone who your parents like and your word has zero value to it. It's like the Gujarat government takes special effort in looking like fucking idiots. Every day they progress back to the stone age. Also to every young couple who voted for the BJP in Gujarat, I hope you're happy now.",
        "So let's remove a fundamental right if the majority of the people agree to it? Literally meaning your word has zero value and your parents can veto any marriage proposal thereby leaving you either single for life or stuck in a marriage you hate. Fucking brilliant move",
        "We're glad",
        "Why are you pent up. It's only applicable in Gujarat. I don't live there, so I don't care.",
        "Cause Gujarat is just as much a part of India as any other state. What the fuck do you mean by why am I so pent up? You're casually talking about a law that violates human rights and dignity. How old are you even?",
        "Don't worry. There are millions like me who do vote.",
        "So you support this law then?",
        "Dude. Adopt fake parents from a drama company. Get married. And denounce them after a few months.",
        "Early 20s, but that's not the point. Like chill, man. I'm from the south. These stupid state laws will only be in the North. They never come here. Besides, as others are pointing, the Supreme Court will strike it down. Why worry.\n\nAre you like in a love marriage with a Gujju or something. Then maybe you should worry.",
        "ROFL where is the constitutional right of freedom?",
        "You're ridiculous if you think people from other states should just sit and watch Gujarati politicians fuck up everything.",
        "No man. Law is stupid.",
        "When a person is above 18,it is not your buisness",
        "It’s Gujarat. What do you expect? Reap what you sow",
        "I agree with you that the law is stupid and bad for love marriage pursuers. But why do you care? You seem from Kerala. Gujjus voted bjp. Let them reap what they sow. \n\nIt's like what you see in Global news where Russia attacks Ukraine and stuff. It's bad thing but no point in getting pent up. We are common people, we can't change these things (unless you're like a super powerful fellow then you do you)",
        "Don't think sc will be taking pressure on such bs issues",
        "Unconstitutional. Adults entering in contracts do not need their parents' approval. Article 21 violation.",
        "It violates fundamental rights (Art 19). Courts will invalidate it in the blink of an eye.",
        "Gujarat Government is encroaching on personal rights of two adult individuals. It is unconstitutional. What next they decide where someone can work and where someone can't? What women can do and what women can't?",
        "I think it's a great move in Indian context.",
        ">It doesn't effect me so honestly, I don't care\n\n First they came for the socialists, and I did not speak out—because I was not a socialist.\n\nThen they came for the trade unionists, and I did not speak out—because I was not a trade unionist.\n\nThen they came for the Jews, and I did not speak out—because I was not a Jew.\n\nThen they came for me—and there was no one left to speak for me.\n\n—Martin Niemöller\n\n&#x200B;\n\nDon't worry, you'll be fucked one day for sure.",
        "Court will declare it unconstitutional even if it gets passed.",
        "The state that put Ashant Dhara act will have no problem putting this into force.",
        "Look around you. When was there any freedom anyway? And then people wonder why are some running away to never return.",
        "Boycott Gujjus.",
        "Why?",
        "Oreo pakoda? Tf?",
        "Go out of Gujarat and get married and then don't come back.",
        "If this bill passes then i will lose faith in law and i am a law student.",
        "Guj parents need to chill. \nLaw will never pass.",
        "Modi abandoned wife despite done by parents.\n\nThere are large abusive arrange marriages.\nThere is no government in Gujarat, CM is merely a puppet cm . Proof?? Ask any one Gujarat cm name, most will not be able to tell without googling",
        "Lol you really think jdgs care for rights ( except few)"
    ],
    "cleaned_text": "gujarat government thinking make law signature parents mandatory love marriages todays news came gujarat cm visited patidar community major community gujarat promote bjp told goverment think implement law parents signature love marriages case opposition also government patidar major political community gujarat thinking law decrease crime love marriage girl suffers parents commits suiside think direct hit personal choices freedom marry anyone sourcehttpswwwgooglecomampsmtimesofindiacomcityahmedabadgujaratmlasmakeconsentofparentsmandatoryforlovemarriagesamparticleshowcms whats view ",
    "cleaned_title": "gujarat government thinking make law signature parents mandatory love marriages",
    "cleaned_selftext": "todays news came gujarat cm visited patidar community major community gujarat promote bjp told goverment think implement law parents signature love marriages case opposition also government patidar major political community gujarat thinking law decrease crime love marriage girl suffers parents commits suiside think direct hit personal choices freedom marry anyone sourcehttpswwwgooglecomampsmtimesofindiacomcityahmedabadgujaratmlasmakeconsentofparentsmandatoryforlovemarriagesamparticleshowcms whats view",
    "cleaned_comments": "marriage girl suffers parent commit suiside girls commit suiside parent say repeatedly love marriage paddling like gujarat every hindu girl love muslim going marry india karod muslim population passed thats crime awesome think support gujarat guess gujrat model ive read times fail understand logic behind signatures stop suicides crimes dont go next level cross age sign document saying commint crimes one death better two gujrat politicians basically poor people lot well afford already left states countries one wants go back lmao democracy majority gujjus want law thats bullshit argument democracy doesnt mean oppress dont majority opinion individuals rights needs respected well individual rights stop majority start illegal challenged courts laymen cant decide people state want unless youre gujju yeah raise point gujarat anything honorable supreme court pressure kind laws infringing liberty adult individual thrown challenged courts people shut cant people discourse regarding something affects outside courtroom india karod muslim population passed india cr muslimshttpswwwcensuscoinreligionphp logic majority kashmir folks want part pakistan nothing else needed allow wonder government intervenes shuts internet etc central government exert power one place simply listen states residents wish another law survive sc steps law place modern soceity govt thinks general welfare girls marrying without parents consent needs additional support well special cells formed regularly check girls wellfare post marraige also keep parents posted updates girls marrying without parents consent might find isolated aliented case said marraige turn way expected duty ensure able create safe space feel cared bad husbands also know theres someone regularly checking wife would careful probable case abuse domestic violence way law require adults seek parents consent getting married parents feel let children natural process dealing adult children govt role moral policing parents feel empowered idiots logic holocaust completely fine killing rape jews wasnt illegal germany time brainlacking buffoon perhaps retarded even understand democracies supposed work theres strong rumour new bill proposed guy needs basic degree start genocide anyone know apply entire political science easy solution tell magistrate dont love get married nothing happen idiots vote criminals thinking bigoted perverted desires fulfilled law wouldnt passed cos complete subversion human rights course one good thing people vote based perversions get govt society deserve check people talk nazi germanywont far people talk cancerous regime generation enabled future edited thats literally voting civic participation problem education bad shape people literally dont know civic rights duties responsible governments invite views consult stakeholders even average voter lawmaking nature youre unaware realise duty informed participate states governance instead go around lecturing people responsibly engaging discussions opinion building goverment people state people literally decide lets make law signature parents required hold hands someone eat plate oreo ke pakode public valid make law majority agrees democracy constitution also mentioned certain law interfere basic rights illegal particular law would directly right freedom dont even vote lol doesnt effect honestly dont care boring af thats elect people instead us even remember laws like lawyer something wont article basic social science lol everyone taught th th class also u prepare govt job u study everything taught th th law decrease crime crime dont remember stuff interested stem history never really paid attention civics mugged basic questions boards enough ive read times fail understand logic behind signatures stop suicides crimes leaders old men old women dislike children marrying wishes ask law give control next ask make court marriages inter caste marriages illegal parent approved marriages take place cite one anecdote like people reddit justify demand law absolutely retarded becomes thing adults already age theyre free please marry want would happen parent refuses sign marriage becomes void law literally meddling human rights anything basically gujarat government saying marry someone parents like word zero value like gujarat government takes special effort looking like fucking idiots every day progress back stone age also every young couple voted bjp gujarat hope youre happy lets remove fundamental right majority people agree literally meaning word zero value parents veto marriage proposal thereby leaving either single life stuck marriage hate fucking brilliant move glad pent applicable gujarat dont live dont care cause gujarat much part india state fuck mean pent youre casually talking law violates human rights dignity old even dont worry millions like vote support law dude adopt fake parents drama company get married denounce months early thats point like chill man im south stupid state laws north never come besides others pointing supreme court strike worry like love marriage gujju something maybe worry rofl constitutional right freedom youre ridiculous think people states sit watch gujarati politicians fuck everything man law stupid person buisness gujarat expect reap sow agree law stupid bad love marriage pursuers care seem kerala gujjus voted bjp let reap sow like see global news russia attacks ukraine stuff bad thing point getting pent common people cant change things unless youre like super powerful fellow dont think sc taking pressure bs issues unconstitutional adults entering contracts need parents approval article violation violates fundamental rights art courts invalidate blink eye gujarat government encroaching personal rights two adult individuals unconstitutional next decide someone work someone cant women women cant think great move indian context doesnt effect honestly dont care first came socialists speak outbecause socialist came trade unionists speak outbecause trade unionist came jews speak outbecause jew came meand one left speak martin niemller xb dont worry youll fucked one day sure court declare unconstitutional even gets passed state put ashant dhara act problem putting force look around freedom anyway people wonder running away never return boycott gujjus oreo pakoda tf go gujarat get married dont come back bill passes lose faith law law student guj parents need chill law never pass modi abandoned wife despite done parents large abusive arrange marriages government gujarat cm merely puppet cm proof ask one gujarat cm name able tell without googling lol really think jdgs care rights except",
    "light_cleaned_title": "Gujarat government is thinking to make a law where signature of parents is mandatory for love marriages. Can they do it ?",
    "light_cleaned_selftext": "As todays news came Gujarat CM visited patidar community (major community in Gujarat to promote BJP) and told them that goverment will think to implement the law of parents signature in love marriages and in this case opposition is also with government. Patidar is major political community in Gujarat and they are thinking that this law will decrease crime by 50% as after love marriage girl suffers or parents commits suiside. I think this will direct hit on personal choices and freedom to marry anyone [Source](https://www.google.com/amp/s/m.timesofindia.com/city/ahmedabad/gujarat-mlas-make-consent-of-parents-mandatory-for-love-marriages/amp_articleshow/98718564.cms) What's your view on this ?",
    "light_cleaned_comments": "“After marriage girl suffers or parent commit suiside” Now only girls will commit suiside when parent say repeatedly “No”. Not for love marriage but they are paddling it like in Gujarat every Hindu girl is in love with Muslim and they are going to marry and India will have 6 karod by 2050 Muslim population if this is not passed. That's not what crime is Awesome, I think we should support it but only for gujarat (guess why) Gujrat model. I've read this 3 times but fail to understand the logic behind how signatures will stop suicides or crimes . Then why don't we go to the next level and when we all cross the age of 10 we sign a document saying we commint any crimes. One death is better than two. - Gujrat politicians. So basically all poor people. A lot of well to do / who can afford have already left for other states/ countries. No one wants to go back lmao It's a democracy. If majority of Gujjus want it to be law, then it should be. That's a bullshit argument. Democracy doesn't mean you can oppress those who don't have a majority opinion. An individual's rights needs to be respected as well. Where do individual rights stop and will of the majority start? If it's illegal, it should be challenged in courts. We laymen can't decide what people of a state want to do. Unless you're a Gujju, then yeah, you should raise your point. It is Gujarat. They can do anything. If the honorable Supreme Court is not under any pressure, this kind of laws will be infringing the liberty of the adult individual and will be thrown out. It should only be challenged in courts? People should just shut up about it? Why? Why can't people have discourse regarding something that affects them outside of a courtroom? > India will have 6 karod by 2050 Muslim population if this is not passed. India had [17.2cr muslims](https://www.census2011.co.in/religion.php) in 2011 So, by your logic, if majority kashmir folks want to be part of Pakistan, there is nothing else needed? We should allow it? Wonder why then the government intervenes and shuts internet etc. Why have a central government exert power in one place but simply listen to the state's residents wish for another? The law will survive until SC steps in. No more. This law has no place in modern soceity. If at all govt thinks that general welfare of Girls marrying without parents consent needs additional support for her well being, special cells can be formed that regularly check on Girls wellfare post marraige and also keep parents posted with updates. Girls marrying without parents consent might find themselves isolated and aliented in case the said marraige did not turn out the way she expected it to be. Its our duty to ensure that we are able to create a safe space for them to feel cared for. If bad husbands also know that there's someone regularly checking on their wife, they would be careful about probable case of abuse or domestic violence. But no way, a law should require adults to seek parents consent before getting married. If parents feel they were let down by their children, its a natural process of dealing with adult children, govt has no role in moral policing so that parents can feel empowered again. By this idiot's logic, the Holocaust was completely fine because the killing and rape of jews wasn't illegal in Germany at the time. Brain-lacking buffoon. Are you perhaps retarded? Do you even understand how democracies are supposed to work? There’s a strong rumour of a new bill being proposed that a guy needs to have a basic degree to start a genocide. Anyone know how I can apply for ‘Entire Political Science’ Easy solution… just tell the magistrate you dont love each other and get married Nothing will happen. Idiots will vote for criminals thinking their bigoted and perverted desires will be fulfilled but the law wouldn't be passed cos its a complete subversion of human rights. Of course one good thing is that the people who vote based on these perversions will get the Govt and society they deserve. You can check how people talk about nazi Germany-won't be far from how people will talk about this cancerous regime and the generation that enabled it, in future. Edited That's literally what voting and civic participation are all about. The problem is that education is in such a bad shape that people literally don't know what their civic rights and duties are. Most responsible governments invite the views of and consult stakeholders and even the average voter before lawmaking of this nature, but you're too unaware to realise that it's your duty to be informed and participate in the State's governance, and instead go around lecturing people who are responsibly engaging in discussions and opinion building. The goverment is for the people of the state, you are the people, it's literally for you to decide. Let's make law where signature of parents is required to hold hands with someone and eat from the same plate of oreo ke pakode in public. It's valid that they can make any law if majority agrees in democracy but in our constitution it is also mentioned that if certain law interfere with basic rights, then it's illegal. This particular law would be directly against Right to Freedom. No. I don't even vote lol It doesn't effect me so honestly, I don't care But it's boring af. That's why we elect people to do it instead of us. How do you even remember these laws? Are you like a lawyer or something ? Wont it be against Article 21? Its basic social science lol. Everyone is taught this 9th or 10th class. Also when u prepare for govt job, u have to study everything taught from 6th to 12th again. > that this law will decrease crime by 50% \"crime\"?? I don't remember that stuff. I was only interested in STEM and history, so I never really paid attention to civics. Mugged up some basic questions for boards, which was enough > I've read this 3 times but fail to understand the logic behind how signatures will stop suicides or crimes Leaders are old men and some old women. They dislike their children marrying against their wishes, so they ask for law to give them control. Next they will ask that to make court marriages and inter caste marriages illegal, and only parent approved marriages to take place. They will just cite one anecdote, like people do on reddit to justify their demand. This law is absolutely retarded if it becomes a thing. Adults are already at the age where they're free to do as they please and marry who they want to. What would happen if the parent refuses to sign? The marriage becomes void then? This law is literally meddling with human rights more than anything. Basically the Gujarat government is saying you should marry someone who your parents like and your word has zero value to it. It's like the Gujarat government takes special effort in looking like fucking idiots. Every day they progress back to the stone age. Also to every young couple who voted for the BJP in Gujarat, I hope you're happy now. So let's remove a fundamental right if the majority of the people agree to it? Literally meaning your word has zero value and your parents can veto any marriage proposal thereby leaving you either single for life or stuck in a marriage you hate. Fucking brilliant move We're glad Why are you pent up. It's only applicable in Gujarat. I don't live there, so I don't care. Cause Gujarat is just as much a part of India as any other state. What the fuck do you mean by why am I so pent up? You're casually talking about a law that violates human rights and dignity. How old are you even? Don't worry. There are millions like me who do vote. So you support this law then? Dude. Adopt fake parents from a drama company. Get married. And denounce them after a few months. Early 20s, but that's not the point. Like chill, man. I'm from the south. These stupid state laws will only be in the North. They never come here. Besides, as others are pointing, the Supreme Court will strike it down. Why worry. Are you like in a love marriage with a Gujju or something. Then maybe you should worry. ROFL where is the constitutional right of freedom? You're ridiculous if you think people from other states should just sit and watch Gujarati politicians fuck up everything. No man. Law is stupid. When a person is above 18,it is not your buisness It’s Gujarat. What do you expect? Reap what you sow I agree with you that the law is stupid and bad for love marriage pursuers. But why do you care? You seem from Kerala. Gujjus voted bjp. Let them reap what they sow. It's like what you see in Global news where Russia attacks Ukraine and stuff. It's bad thing but no point in getting pent up. We are common people, we can't change these things (unless you're like a super powerful fellow then you do you) Don't think sc will be taking pressure on such bs issues Unconstitutional. Adults entering in contracts do not need their parents' approval. Article 21 violation. It violates fundamental rights (Art 19). Courts will invalidate it in the blink of an eye. Gujarat Government is encroaching on personal rights of two adult individuals. It is unconstitutional. What next they decide where someone can work and where someone can't? What women can do and what women can't? I think it's a great move in Indian context. >It doesn't effect me so honestly, I don't care First they came for the socialists, and I did not speak out—because I was not a socialist. Then they came for the trade unionists, and I did not speak out—because I was not a trade unionist. Then they came for the Jews, and I did not speak out—because I was not a Jew. Then they came for me—and there was no one left to speak for me. —Martin Niemöller &#x200B; Don't worry, you'll be fucked one day for sure. Court will declare it unconstitutional even if it gets passed. The state that put Ashant Dhara act will have no problem putting this into force. Look around you. When was there any freedom anyway? And then people wonder why are some running away to never return. Boycott Gujjus. Why? Oreo pakoda? Tf? Go out of Gujarat and get married and then don't come back. If this bill passes then i will lose faith in law and i am a law student. Guj parents need to chill. Law will never pass. Modi abandoned wife despite done by parents. There are large abusive arrange marriages. There is no government in Gujarat, CM is merely a puppet cm . Proof?? Ask any one Gujarat cm name, most will not be able to tell without googling Lol you really think jdgs care for rights ( except few)"
}