{
    "id": "1begylf",
    "title": "Concern about CAA: A foreign spy can easily masquerade himself as a non-Muslim while applying for citizenship.",
    "url": "https://www.reddit.com/r/india/comments/1begylf/concern_about_caa_a_foreign_spy_can_easily/",
    "selftext": "If someone who came before 31st December, 2014, doesn’t have any document mentioning the religion, only his/her statement before magistrate is ok to establish the religion of a refugee as per the latest citizenship amendment. \n\nWouldn’t a spy from any of our nearby countries masquerade himself as a non-Muslim while applying for citizenship? Our NSA Ajit Doval lived as a Muslim when he allegedly spied while living in Pakistan for approx 8 years. \n\nMany of us don’t know, but even without CAA, we have been issuing citizenship to persecuted people but after thorough verifications. Look at the article below which reported about 108 Hindus being granted citizenship in Aug 2023. \n\nhttps://timesofindia.indiatimes.com/city/ahmedabad/108-hindu-migrants-granted-citizenship/amp_articleshow/103621832.cms\n\nThorough verifications in my person opinion are must for the security of our country. This half thought policy can prove to be a blunder by the government for vote bank politics. \n\nPlease do correct if I have missed anything. \n",
    "flair": "Policy/Economy",
    "score": 301,
    "num_comments": 70,
    "created_utc": 1710407557.0,
    "convurl": "https://external-preview.redd.it/YHtj1HQRS386ZGnVjEiPQ47W-8xepxbGRYK2FUJWcIk.jpg?auto=webp&s=5bbd281b328012cf2fb092e67e9c04edb4401518",
    "comments": [
        "Mandatory dick check for CAA.",
        "That is what spies do. \n\nCAA give priorirty to a few religions from a couple of countries. It doesn't mean they can waltz into the MEA, take a shit in the ministers toilet, and walk out with a brand new passport.\n\nTheir application may get priority, but they have to undergo all mandatory verification. \n\nPeople in India get Aadhar faking their information. So, yes, people will also get passports faking their information",
        "\"It doesn't mean they can waltz into the MEA, take a shit in the ministers toilet, and walk out with a brand new passport.\"\n\nNot until you honeytrap the average RSS member working for the government",
        "So terrorists without cut dicks and pretend as hindus and come cause damage here",
        "lol! This is only for people who have come to India prior to 2014. It’s nothing but a ploy to harass Muslims using NRC.",
        "Spies don't need to come through CAA, they will come with perfectly valid legal documents if there Logistics team is any good.\n\nPush comes to shove they will come with Nepali or US, UK, Canada citizenship.",
        "Sanghi Chaddis think through their ass. They just need to rush in additional voters before election.\n\nAnd 2014? These suckers can bring in whatever ordinance and nullify court orders or whats in constitution, changing CAA eligibility date would be piece of cake for them.",
        "It's pretty sad that Indian Muslim identity has become like a buzzword for political fodder, in such a mainstream way. \n\nNo one even questions the ethics of generalising 200cr people on the basis of which family they were born. Every debate requires a Muslim filter to proceed. And if it fails, again we get stuck in questioning the identity of what is a good Muslim.\n\nInstead of discussing the \"good\" & \"bad\" of CAA. One should question the intentions for it to exist in the first place. Not the consequences of it when it applies.",
        "their* logistics*\n\n>there Logistics team is any good.",
        "Lmao a foreign spy does not need CAA.",
        "How's that an argument for making it easy?",
        "Ideally a spy won't get into so much of documentation to get citizenship of India.",
        "It can be easily available",
        "Paxkit@ni ill@gals are protesting in Delhi but Indian citizens are barred from even Delhi.",
        " Yea very easy",
        "I left my father’s house few years back. Now I live in another state and find flaws with every housekeeping activity at his house, I am his son after all. I have devised certain derogatory words like “pajamas”, “kurtas” etc. to dismiss and humiliate my brother and sister living there. \n\nThis story has no connection with you, just ranting, because using derogatory terms against them is easier than working on the real issue. Now bye, its time for me to go lick some white boots.",
        "I left my father’s house few years back. Now I live in another state and find flaws with every housekeeping activity at his house, I am his son after all. I have devised certain derogatory words like “pajamas”, “kurtas” etc. to dismiss and humiliate my brother and sister living there.\n\nThis story has no connection with you, just ranting, because using derogatory terms against them is easier than working on the real issue. Now bye, its time for me to go lick some white boots.",
        "Hey Moron, what are you ranting about. CAA is a distraction that would have never come to light but for need for these chaddis to divert attention from the electoral bonds issue on eve of elections.\n\nYes go lick the boots. Thats all you are capable off.",
        "> Indian Muslim\n\nThe current notification for CAA 2019 has nothing to do with Indian Muslims.",
        "Right. Because people who leave have the best idea about what’s happening back home. I am sure white fraternity find it woke and appreciate it when a migrant slave is talking shit about things back home. \n\nYup, boot licking is all I can do after leaving home, cursing and humiliating them, calling names to people back home. Sounds familiar?",
        "It absolutely has to do with Muslims in India.",
        "bhai konsi movie dekh kr aya hai",
        "Shut up, as if you don't make any mistakes.",
        "I did. It's called Yalla6969",
        "How would they verify religion?",
        "How so? It has to do specifically with non-Muslim refugees right? I thought that was the whole purpose. The act doesn't even mention the word anywhere.",
        "You should visit r/worldnews. Even white people from Us and Eu dont want them. Maybe just maybe doing terrorist activities everywhere comes back to bite.",
        "I don’t think the problem is in their religion. I think it’s in their brains. Shiting on country you left when it was in bad shape, and giving lectures from foreign lands might be in fashion in their brains. But, no one likes a person like that. I don’t even have a problem if these people have advices, but all they have is judgement and hatred. It is always easier to criticize and throw your philosophy when you are away from the situation. Most of the people cursing ambani’s for lavish wedding wouldn’t spare 5 bucks for funding someone’s food. But, chaddis are the ones responsible for everything that is wrong with the country.",
        "As it has been done for ages, from the document.",
        "Lol, have you read the CAA rules. There is no religion verification, you don't even need to show your valid passport from that country. As long as you can show that one of your grandparents was from that country. You are good.",
        "There are 19 lakhs immigrants identified as non Indian in Assam NRC. All of them are trying to prove for a long time that they are Indian by giving many docs. The 13 lakh Hindus will go scot free and LIE to court that they are from Bangladesh (even though for many years they were claiming otherwise). But the 6 lakh muslims will be put in detention centres and all rights taken from them. This is plain and simple discrimination on religious ground and constitutionally invalid.",
        "At present, we are discussing CAA and the recent notification, not NRC. CAA being linked with NRC is a future concept and not yet officially implemented.",
        "Sweetheart, Assam NRC is already completed. Sec 7 of CAA automatically and immediately drops all ongoing proceedings in Foreigners Tribunal. What you are talking about is all India NRC, which is yet to happen. I am merely illustrating to you that it does indeed affect Indian muslims in Assam today and treats them unequally when compared to their hindu friends.",
        ">As long as you can show that one of your grandparents was from that country.\n\nShow physically or on the document?",
        "Just attempt to induce fear. Meanwhile number of Bangladeshi's holding indian passports illegally.",
        "You should bring ashes for DNA verification /s",
        ">Push comes to shove they will come with Nepali or US, UK, Canada citizenship.\n\n1. Why would they bother doing that when they can very easily just activate the sleepers they probs have in India already? The ones that would have came from Pakistan or Bangladesh?\n\n2. Why do you not think embedding deep cover operatives in India through CAA makes sense for foreign intelligence? Seems like a goldmine of a way to spy. \n\n2. And why would a Pakistani or Bangladeshi spy get a US, UK or Canadian passport to spy when that’s harder and will require more work and effort?",
        "1. It's cheaper to get the documents and also low risk. If I am a spy master, I want results, not complications.\n\n2. CAA candidates may be potential recruits, but they will still face challenges getting jobs with sensitive information.\n\n3. Spies don't have to be limited to Pakistanis or Bangladeshis. The IB had recruited Britishers to spy on China in the 60s .David Coleman headley was a former Pakistani military cadet with American citizenship. He recced the Mumbai attacks.  The Americans most probably have the maximum assets in India.",
        "yeah.. then imagine if they let muslims as well, they don't even have to pretend to be other religion... so... are you a anti-immigration right winger or are you a dumbass?",
        "The fact that it leaves them out is the whole problem.",
        "Why do you want muslims from neighbouring muslim countries to come to india for citizenship?",
        "Why do you think someone who belongs to a certain religion should have precedence over the other just because of their faith in a democracy?",
        "are you serious? If Muslims aren't safe in their own countries how is it our fault? If we take them too then what's the point of partition?",
        "Thanks for the shoutout."
    ],
    "cleaned_text": "concern caa foreign spy easily masquerade nonmuslim applying citizenship someone came st december doesnt document mentioning religion hisher statement magistrate ok establish religion refugee per latest citizenship amendment wouldnt spy nearby countries masquerade nonmuslim applying citizenship nsa ajit doval lived muslim allegedly spied living pakistan approx years many us dont know even without caa issuing citizenship persecuted people thorough verifications look article reported hindus granted citizenship aug thorough verifications person opinion must security country half thought policy prove blunder government vote bank politics please correct missed anything ",
    "cleaned_title": "concern caa foreign spy easily masquerade nonmuslim applying citizenship",
    "cleaned_selftext": "someone came st december doesnt document mentioning religion hisher statement magistrate ok establish religion refugee per latest citizenship amendment wouldnt spy nearby countries masquerade nonmuslim applying citizenship nsa ajit doval lived muslim allegedly spied living pakistan approx years many us dont know even without caa issuing citizenship persecuted people thorough verifications look article reported hindus granted citizenship aug thorough verifications person opinion must security country half thought policy prove blunder government vote bank politics please correct missed anything",
    "cleaned_comments": "mandatory dick check caa spies caa give priorirty religions couple countries doesnt mean waltz mea take shit ministers toilet walk brand new passport application may get priority undergo mandatory verification people india get aadhar faking information yes people also get passports faking information doesnt mean waltz mea take shit ministers toilet walk brand new passport honeytrap average rss member working government terrorists without cut dicks pretend hindus come cause damage lol people come india prior nothing ploy harass muslims using nrc spies dont need come caa come perfectly valid legal documents logistics team good push comes shove come nepali us uk canada citizenship sanghi chaddis think ass need rush additional voters election suckers bring whatever ordinance nullify court orders whats constitution changing caa eligibility date would piece cake pretty sad indian muslim identity become like buzzword political fodder mainstream way one even questions ethics generalising cr people basis family born every debate requires muslim filter proceed fails get stuck questioning identity good muslim instead discussing good bad caa one question intentions exist first place consequences applies logistics logistics team good lmao foreign spy need caa hows argument making easy ideally spy wont get much documentation get citizenship india easily available paxkitni illgals protesting delhi indian citizens barred even delhi yea easy left fathers house years back live another state find flaws every housekeeping activity house son devised certain derogatory words like pajamas kurtas etc dismiss humiliate brother sister living story connection ranting using derogatory terms easier working real issue bye time go lick white boots left fathers house years back live another state find flaws every housekeeping activity house son devised certain derogatory words like pajamas kurtas etc dismiss humiliate brother sister living story connection ranting using derogatory terms easier working real issue bye time go lick white boots hey moron ranting caa distraction would never come light need chaddis divert attention electoral bonds issue eve elections yes go lick boots thats capable indian muslim current notification caa nothing indian muslims right people leave best idea whats happening back home sure white fraternity find woke appreciate migrant slave talking shit things back home yup boot licking leaving home cursing humiliating calling names people back home sounds familiar absolutely muslims india bhai konsi movie dekh kr aya hai shut dont make mistakes called yalla would verify religion specifically nonmuslim refugees right thought whole purpose act doesnt even mention word anywhere visit rworldnews even white people us eu dont want maybe maybe terrorist activities everywhere comes back bite dont think problem religion think brains shiting country left bad shape giving lectures foreign lands might fashion brains one likes person like dont even problem people advices judgement hatred always easier criticize throw philosophy away situation people cursing ambanis lavish wedding wouldnt spare bucks funding someones food chaddis ones responsible everything wrong country done ages document lol read caa rules religion verification dont even need show valid passport country long show one grandparents country good lakhs immigrants identified non indian assam nrc trying prove long time indian giving many docs lakh hindus go scot free lie court bangladesh even though many years claiming otherwise lakh muslims put detention centres rights taken plain simple discrimination religious ground constitutionally invalid present discussing caa recent notification nrc caa linked nrc future concept yet officially implemented sweetheart assam nrc already completed sec caa automatically immediately drops ongoing proceedings foreigners tribunal talking india nrc yet happen merely illustrating indeed affect indian muslims assam today treats unequally compared hindu friends long show one grandparents country show physically document attempt induce fear meanwhile number bangladeshis holding indian passports illegally bring ashes dna verification push comes shove come nepali us uk canada citizenship would bother easily activate sleepers probs india already ones would came pakistan bangladesh think embedding deep cover operatives india caa makes sense foreign intelligence seems like goldmine way spy would pakistani bangladeshi spy get us uk canadian passport spy thats harder require work effort cheaper get documents also low risk spy master want results complications caa candidates may potential recruits still face challenges getting jobs sensitive information spies dont limited pakistanis bangladeshis ib recruited britishers spy china david coleman headley former pakistani military cadet american citizenship recced mumbai attacks americans probably maximum assets india yeah imagine let muslims well dont even pretend religion antiimmigration right winger dumbass fact leaves whole problem want muslims neighbouring muslim countries come india citizenship think someone belongs certain religion precedence faith democracy serious muslims arent safe countries fault take whats point partition thanks shoutout",
    "light_cleaned_title": "Concern about CAA: A foreign spy can easily masquerade himself as a non-Muslim while applying for citizenship.",
    "light_cleaned_selftext": "If someone who came before 31st December, 2014, doesn’t have any document mentioning the religion, only his/her statement before magistrate is ok to establish the religion of a refugee as per the latest citizenship amendment. Wouldn’t a spy from any of our nearby countries masquerade himself as a non-Muslim while applying for citizenship? Our NSA Ajit Doval lived as a Muslim when he allegedly spied while living in Pakistan for approx 8 years. Many of us don’t know, but even without CAA, we have been issuing citizenship to persecuted people but after thorough verifications. Look at the article below which reported about 108 Hindus being granted citizenship in Aug 2023. Thorough verifications in my person opinion are must for the security of our country. This half thought policy can prove to be a blunder by the government for vote bank politics. Please do correct if I have missed anything.",
    "light_cleaned_comments": "Mandatory dick check for CAA. That is what spies do. CAA give priorirty to a few religions from a couple of countries. It doesn't mean they can waltz into the MEA, take a shit in the ministers toilet, and walk out with a brand new passport. Their application may get priority, but they have to undergo all mandatory verification. People in India get Aadhar faking their information. So, yes, people will also get passports faking their information \"It doesn't mean they can waltz into the MEA, take a shit in the ministers toilet, and walk out with a brand new passport.\" Not until you honeytrap the average RSS member working for the government So terrorists without cut dicks and pretend as hindus and come cause damage here lol! This is only for people who have come to India prior to 2014. It’s nothing but a ploy to harass Muslims using NRC. Spies don't need to come through CAA, they will come with perfectly valid legal documents if there Logistics team is any good. Push comes to shove they will come with Nepali or US, UK, Canada citizenship. Sanghi Chaddis think through their ass. They just need to rush in additional voters before election. And 2014? These suckers can bring in whatever ordinance and nullify court orders or whats in constitution, changing CAA eligibility date would be piece of cake for them. It's pretty sad that Indian Muslim identity has become like a buzzword for political fodder, in such a mainstream way. No one even questions the ethics of generalising 200cr people on the basis of which family they were born. Every debate requires a Muslim filter to proceed. And if it fails, again we get stuck in questioning the identity of what is a good Muslim. Instead of discussing the \"good\" & \"bad\" of CAA. One should question the intentions for it to exist in the first place. Not the consequences of it when it applies. their* logistics* >there Logistics team is any good. Lmao a foreign spy does not need CAA. How's that an argument for making it easy? Ideally a spy won't get into so much of documentation to get citizenship of India. It can be easily available Paxkit@ni ill@gals are protesting in Delhi but Indian citizens are barred from even Delhi. Yea very easy I left my father’s house few years back. Now I live in another state and find flaws with every housekeeping activity at his house, I am his son after all. I have devised certain derogatory words like “pajamas”, “kurtas” etc. to dismiss and humiliate my brother and sister living there. This story has no connection with you, just ranting, because using derogatory terms against them is easier than working on the real issue. Now bye, its time for me to go lick some white boots. I left my father’s house few years back. Now I live in another state and find flaws with every housekeeping activity at his house, I am his son after all. I have devised certain derogatory words like “pajamas”, “kurtas” etc. to dismiss and humiliate my brother and sister living there. This story has no connection with you, just ranting, because using derogatory terms against them is easier than working on the real issue. Now bye, its time for me to go lick some white boots. Hey Moron, what are you ranting about. CAA is a distraction that would have never come to light but for need for these chaddis to divert attention from the electoral bonds issue on eve of elections. Yes go lick the boots. Thats all you are capable off. > Indian Muslim The current notification for CAA 2019 has nothing to do with Indian Muslims. Right. Because people who leave have the best idea about what’s happening back home. I am sure white fraternity find it woke and appreciate it when a migrant slave is talking shit about things back home. Yup, boot licking is all I can do after leaving home, cursing and humiliating them, calling names to people back home. Sounds familiar? It absolutely has to do with Muslims in India. bhai konsi movie dekh kr aya hai Shut up, as if you don't make any mistakes. I did. It's called Yalla6969 How would they verify religion? How so? It has to do specifically with non-Muslim refugees right? I thought that was the whole purpose. The act doesn't even mention the word anywhere. You should visit r/worldnews. Even white people from Us and Eu dont want them. Maybe just maybe doing terrorist activities everywhere comes back to bite. I don’t think the problem is in their religion. I think it’s in their brains. Shiting on country you left when it was in bad shape, and giving lectures from foreign lands might be in fashion in their brains. But, no one likes a person like that. I don’t even have a problem if these people have advices, but all they have is judgement and hatred. It is always easier to criticize and throw your philosophy when you are away from the situation. Most of the people cursing ambani’s for lavish wedding wouldn’t spare 5 bucks for funding someone’s food. But, chaddis are the ones responsible for everything that is wrong with the country. As it has been done for ages, from the document. Lol, have you read the CAA rules. There is no religion verification, you don't even need to show your valid passport from that country. As long as you can show that one of your grandparents was from that country. You are good. There are 19 lakhs immigrants identified as non Indian in Assam NRC. All of them are trying to prove for a long time that they are Indian by giving many docs. The 13 lakh Hindus will go scot free and LIE to court that they are from Bangladesh (even though for many years they were claiming otherwise). But the 6 lakh muslims will be put in detention centres and all rights taken from them. This is plain and simple discrimination on religious ground and constitutionally invalid. At present, we are discussing CAA and the recent notification, not NRC. CAA being linked with NRC is a future concept and not yet officially implemented. Sweetheart, Assam NRC is already completed. Sec 7 of CAA automatically and immediately drops all ongoing proceedings in Foreigners Tribunal. What you are talking about is all India NRC, which is yet to happen. I am merely illustrating to you that it does indeed affect Indian muslims in Assam today and treats them unequally when compared to their hindu friends. >As long as you can show that one of your grandparents was from that country. Show physically or on the document? Just attempt to induce fear. Meanwhile number of Bangladeshi's holding indian passports illegally. You should bring ashes for DNA verification /s >Push comes to shove they will come with Nepali or US, UK, Canada citizenship. 1. Why would they bother doing that when they can very easily just activate the sleepers they probs have in India already? The ones that would have came from Pakistan or Bangladesh? 2. Why do you not think embedding deep cover operatives in India through CAA makes sense for foreign intelligence? Seems like a goldmine of a way to spy. 2. And why would a Pakistani or Bangladeshi spy get a US, UK or Canadian passport to spy when that’s harder and will require more work and effort? 1. It's cheaper to get the documents and also low risk. If I am a spy master, I want results, not complications. 2. CAA candidates may be potential recruits, but they will still face challenges getting jobs with sensitive information. 3. Spies don't have to be limited to Pakistanis or Bangladeshis. The IB had recruited Britishers to spy on China in the 60s .David Coleman headley was a former Pakistani military cadet with American citizenship. He recced the Mumbai attacks. The Americans most probably have the maximum assets in India. yeah.. then imagine if they let muslims as well, they don't even have to pretend to be other religion... so... are you a anti-immigration right winger or are you a dumbass? The fact that it leaves them out is the whole problem. Why do you want muslims from neighbouring muslim countries to come to india for citizenship? Why do you think someone who belongs to a certain religion should have precedence over the other just because of their faith in a democracy? are you serious? If Muslims aren't safe in their own countries how is it our fault? If we take them too then what's the point of partition? Thanks for the shoutout."
}