{
    "id": "17l96co",
    "title": "US Pres Candidate Ramaswamy: Want a hard commitment from India to choke Malacca Strait",
    "url": "https://www.youtube.com/live/vASj4OML254?si=mLT6Shpi36Nigmk-",
    "selftext": "58:00 - Ramaswamy says he wants to \"upgrade the US-India alliance\" and bring it to a level India would be \"thrilled to have something even resembling\", and in exchange he wants a hard commitment that India will block Malacca strait **in the event of China's Taiwan invasion** \n\nThoughts",
    "flair": "Politics",
    "score": 8,
    "num_comments": 26,
    "created_utc": 1698835056.0,
    "convurl": "https://external-preview.redd.it/6Sw4nrbGFkAbYgLUeMPHipAWN0XJ5FHFCFJNe33r4x8.jpg?auto=webp&s=f3b1d1a37fcbf9aa79dc67b10ba4703f4d5c52be",
    "comments": [
        "There are 4 from democrats, 9 from Republicans and 2 independent candidates \n\nUS don't give a crap about this guy. He is discussed only in Indian media. Just another guy doing the bla bla.",
        ">US don't give a crap about this guy\n\nLol no. He has a higher rating than DeSantis, the Florida governor. Probably the third highest in the Republican primaries.",
        "Certified lunatic",
        "The US MAGA crowd will never accept a brown skinned Pharma guy as their POTUS OR VP.",
        "I would like to send his parents some cakes for migrating to USA from saving us from this shithead. Having periyars name, how ironic.",
        "how?\n\nHe is securing a strategic deal with India.\n\nIn case of chinese invasion of taiwan if India chokes the malacca strait it will be disastrous for china.",
        "What a punchable face.",
        "You make it sound like China doesn't automatically assume the US will block the strait, with or without India. Dragging India in just opens up India as a target.",
        "I can’t believe he wants to get rid of birth right citizenship when he benefited from it.",
        ">India as a target.\n\nCommon bro, we are talking about china,\n\nIndia is a target of china.\n\nIf we doesn't oppose china right now, we will be their next actual target.\n\nWe have already lost a large chunk of land, do you want to lose more?",
        " A border dispute doesn't mean China wants war with India. So what if China occupies a \"large chunk of land\"? What difference does it make other than hurting some nationalistic egos? It's useless hinterlands. There is a huge difference between a border skirmish with sticks and stones and ALL OUT WAR. I hate it when people think wars are a walk in the park. Take a look at Ukraine and Gaza right now and put down the xbox/ps5 controllers for once.",
        "WAHHH!\n\nAre you serious?\n\nYou have no idea about the importance of Aksai chin, \n\nAksai chin have large deposits of zinc which india really needs.\n\nChina also claims arunachal pradesh, are you planning to gift them arunachal pradesh or smth?\n\n\"hurting nationalistic ego\" LMAO, are you drunk? someone enters your home, kills your family members and occupies your home, what will you do?\n\nwait and watch? \n\nPeople like you are the reason why everyone makes fun about india.\n\nSkirmish with sticks and stones? they literally killed our brothers \n\nwo soldie bhi kisi ka beta, kisi ka bap, kisi ke pati ya kisi ka bhai tha.\n\nShame on you.",
        "He is an American , he will promote  Indian interest's as long as only it serves his American goals.",
        "Doesn’t matter. Unless Trump is convicted of a felony and thereby barred from running, he **will** be the Republican candidate in 2024.",
        "Nah, people like you are literally why India is backward and destined to be backward instead of the superpower it should be. Keep dreaming of war with China like it's a smart move. Don't bother replying since I'm blocking your idiotic takes.",
        "LMAO, some idiot just blocked me here",
        "My point was that a lot of people would vote for him if he's the rep candidate",
        "A lot of people would vote for anyone with an \"R\" next to their name. I don't see him being mentioned much in mass media, except during and after debates. \n\nI could be wrong, but, even with higher approval ratings, he simply doesn't have the name-recognition as most other major candidates. It's also abundantly clear that he's intentionally \"dumbed down\" his platform to appeal to Christian evangelists (but I suppose they wouldn't notice or care, so long as he tells them what they want to hear).",
        ">so what if China occupies a \"large chunk of land\"\n\nWow, I have no words. This is beyond brain dead, people like you are the main reason why people think Indians are a bunch of morons.",
        "Vivek Ramaswamy & Dinesh D'Souza, the only good republicans in USA."
    ],
    "cleaned_text": "us pres candidate ramaswamy want hard commitment india choke malacca strait ramaswamy says wants upgrade usindia alliance bring level india would thrilled something even resembling exchange wants hard commitment india block malacca strait event chinas taiwan invasion thoughts ",
    "cleaned_title": "us pres candidate ramaswamy want hard commitment india choke malacca strait",
    "cleaned_selftext": "ramaswamy says wants upgrade usindia alliance bring level india would thrilled something even resembling exchange wants hard commitment india block malacca strait event chinas taiwan invasion thoughts",
    "cleaned_comments": "democrats republicans independent candidates us dont give crap guy discussed indian media another guy bla bla us dont give crap guy lol higher rating desantis florida governor probably third highest republican primaries certified lunatic us maga crowd never accept brown skinned pharma guy potus vp would like send parents cakes migrating usa saving us shithead periyars name ironic securing strategic deal india case chinese invasion taiwan india chokes malacca strait disastrous china punchable face make sound like china doesnt automatically assume us block strait without india dragging india opens india target cant believe wants get rid birth right citizenship benefited india target common bro talking china india target china doesnt oppose china right next actual target already lost large chunk land want lose border dispute doesnt mean china wants war india china occupies large chunk land difference make hurting nationalistic egos useless hinterlands huge difference border skirmish sticks stones war hate people think wars walk park take look ukraine gaza right put xboxps controllers wahhh serious idea importance aksai chin aksai chin large deposits zinc india really needs china also claims arunachal pradesh planning gift arunachal pradesh smth hurting nationalistic ego lmao drunk someone enters home kills family members occupies home wait watch people like reason everyone makes fun india skirmish sticks stones literally killed brothers wo soldie bhi kisi ka beta kisi ka bap kisi ke pati ya kisi ka bhai tha shame american promote indian interests long serves american goals doesnt matter unless trump convicted felony thereby barred running republican candidate nah people like literally india backward destined backward instead superpower keep dreaming war china like smart move dont bother replying since im blocking idiotic takes lmao idiot blocked point lot people would vote hes rep candidate lot people would vote anyone r next name dont see mentioned much mass media except debates could wrong even higher approval ratings simply doesnt namerecognition major candidates also abundantly clear hes intentionally dumbed platform appeal christian evangelists suppose wouldnt notice care long tells want hear china occupies large chunk land wow words beyond brain dead people like main reason people think indians bunch morons vivek ramaswamy dinesh dsouza good republicans usa",
    "light_cleaned_title": "US Pres Candidate Ramaswamy: Want a hard commitment from India to choke Malacca Strait",
    "light_cleaned_selftext": "58:00 - Ramaswamy says he wants to \"upgrade the US-India alliance\" and bring it to a level India would be \"thrilled to have something even resembling\", and in exchange he wants a hard commitment that India will block Malacca strait **in the event of China's Taiwan invasion** Thoughts",
    "light_cleaned_comments": "There are 4 from democrats, 9 from Republicans and 2 independent candidates US don't give a crap about this guy. He is discussed only in Indian media. Just another guy doing the bla bla. >US don't give a crap about this guy Lol no. He has a higher rating than DeSantis, the Florida governor. Probably the third highest in the Republican primaries. Certified lunatic The US MAGA crowd will never accept a brown skinned Pharma guy as their POTUS OR VP. I would like to send his parents some cakes for migrating to USA from saving us from this shithead. Having periyars name, how ironic. how? He is securing a strategic deal with India. In case of chinese invasion of taiwan if India chokes the malacca strait it will be disastrous for china. What a punchable face. You make it sound like China doesn't automatically assume the US will block the strait, with or without India. Dragging India in just opens up India as a target. I can’t believe he wants to get rid of birth right citizenship when he benefited from it. >India as a target. Common bro, we are talking about china, India is a target of china. If we doesn't oppose china right now, we will be their next actual target. We have already lost a large chunk of land, do you want to lose more? A border dispute doesn't mean China wants war with India. So what if China occupies a \"large chunk of land\"? What difference does it make other than hurting some nationalistic egos? It's useless hinterlands. There is a huge difference between a border skirmish with sticks and stones and ALL OUT WAR. I hate it when people think wars are a walk in the park. Take a look at Ukraine and Gaza right now and put down the xbox/ps5 controllers for once. WAHHH! Are you serious? You have no idea about the importance of Aksai chin, Aksai chin have large deposits of zinc which india really needs. China also claims arunachal pradesh, are you planning to gift them arunachal pradesh or smth? \"hurting nationalistic ego\" LMAO, are you drunk? someone enters your home, kills your family members and occupies your home, what will you do? wait and watch? People like you are the reason why everyone makes fun about india. Skirmish with sticks and stones? they literally killed our brothers wo soldie bhi kisi ka beta, kisi ka bap, kisi ke pati ya kisi ka bhai tha. Shame on you. He is an American , he will promote Indian interest's as long as only it serves his American goals. Doesn’t matter. Unless Trump is convicted of a felony and thereby barred from running, he **will** be the Republican candidate in 2024. Nah, people like you are literally why India is backward and destined to be backward instead of the superpower it should be. Keep dreaming of war with China like it's a smart move. Don't bother replying since I'm blocking your idiotic takes. LMAO, some idiot just blocked me here My point was that a lot of people would vote for him if he's the rep candidate A lot of people would vote for anyone with an \"R\" next to their name. I don't see him being mentioned much in mass media, except during and after debates. I could be wrong, but, even with higher approval ratings, he simply doesn't have the name-recognition as most other major candidates. It's also abundantly clear that he's intentionally \"dumbed down\" his platform to appeal to Christian evangelists (but I suppose they wouldn't notice or care, so long as he tells them what they want to hear). >so what if China occupies a \"large chunk of land\" Wow, I have no words. This is beyond brain dead, people like you are the main reason why people think Indians are a bunch of morons. Vivek Ramaswamy & Dinesh D'Souza, the only good republicans in USA."
}