{
    "id": "1ayw4l1",
    "title": "While A Journalist Spends Time in Jail For Doing His Duty, An Old, Ailing Man  Even Unable To Even Sip Water & Dies Behind Bars, What happened to Article 21?  Justice  Rekha Sharma",
    "url": "https://www.livelaw.in/top-stories/cjar-seminar-former-delhi-hc-judge-rekha-sharma-bench-fixing-electoral-bonds-khalid-250414",
    "selftext": "During the seminar hosted today by Campaign for Judicial Accountability and Reforms (CJAR) at ISIL, Delhi, former Delhi High Court Judge Rekha Sharma lamented that the Supreme Court has lost its credibility in the eyes of the public.\n\n",
    "flair": "Law & Courts",
    "score": 174,
    "num_comments": 4,
    "created_utc": 1708785771.0,
    "convurl": "https://external-preview.redd.it/5Hv1Xm45mLWQHu8RkUJAjvly2SfekuT1gkZY3OkJeSc.jpg?auto=webp&s=578f33c5b276698b38c030fc87311db417355862",
    "comments": [
        "More from the seminar\n\n[Media As Fourth Pillar Of Democracy Has Failed The Country: Justice Kurian Joseph](https://www.livelaw.in/top-stories/cjar-seminar-justice-kurian-joseph-media-failure-fourth-pillar-democracy-250411)",
        "India isn’t a free country anymore. Wake up to reality! We are under fascist dictatorship of 11th avatar of Vishnu, Vishwaguru Modizi 🫡",
        "With so many misuses of power, not everything should fall on the supreme court. They will be overwhelmed. Local, city and state level courts need to also be held accountable.",
        "Meanwhile Gujarat HC  grants 10 day parole to Bilkis Bano case convict to attend his nephew's wedding."
    ],
    "cleaned_text": "journalist spends time jail duty old ailing man even unable even sip water dies behind bars happened article justice rekha sharma seminar hosted today campaign judicial accountability reforms cjar isil delhi former delhi high court judge rekha sharma lamented supreme court lost credibility eyes public ",
    "cleaned_title": "journalist spends time jail duty old ailing man even unable even sip water dies behind bars happened article justice rekha sharma",
    "cleaned_selftext": "seminar hosted today campaign judicial accountability reforms cjar isil delhi former delhi high court judge rekha sharma lamented supreme court lost credibility eyes public",
    "cleaned_comments": "seminar media fourth pillar democracy failed country justice kurian josephhttpswwwlivelawintopstoriescjarseminarjusticekurianjosephmediafailurefourthpillardemocracy india isnt free country anymore wake reality fascist dictatorship th avatar vishnu vishwaguru modizi many misuses power everything fall supreme court overwhelmed local city state level courts need also held accountable meanwhile gujarat hc grants day parole bilkis bano case convict attend nephews wedding",
    "light_cleaned_title": "While A Journalist Spends Time in Jail For Doing His Duty, An Old, Ailing Man Even Unable To Even Sip Water & Dies Behind Bars, What happened to Article 21? Justice Rekha Sharma",
    "light_cleaned_selftext": "During the seminar hosted today by Campaign for Judicial Accountability and Reforms (CJAR) at ISIL, Delhi, former Delhi High Court Judge Rekha Sharma lamented that the Supreme Court has lost its credibility in the eyes of the public.",
    "light_cleaned_comments": "More from the seminar [Media As Fourth Pillar Of Democracy Has Failed The Country: Justice Kurian Joseph](https://www.livelaw.in/top-stories/cjar-seminar-justice-kurian-joseph-media-failure-fourth-pillar-democracy-250411) India isn’t a free country anymore. Wake up to reality! We are under fascist dictatorship of 11th avatar of Vishnu, Vishwaguru Modizi 🫡 With so many misuses of power, not everything should fall on the supreme court. They will be overwhelmed. Local, city and state level courts need to also be held accountable. Meanwhile Gujarat HC grants 10 day parole to Bilkis Bano case convict to attend his nephew's wedding."
}