{
    "id": "12761yk",
    "title": "Ram Navmi 2023 yields 21 separate incidents of anti-muslim violence and hate speech",
    "url": "https://www.reddit.com/gallery/12761yk",
    "selftext": "Videos and on the ground footage collected by Meer Faisal: https://twitter.com/meerfaisal01/status/1641508613264121856?t=7b6N410xA9hfmSJYIYo7Ug&amp;s=19",
    "flair": "Crime",
    "score": 275,
    "num_comments": 96,
    "created_utc": 1680226656,
    "convurl": "https://i.redd.it/vi9dwquwazqa1.jpg",
    "comments": [
        "We are seeing 21 separate incidents across 13 states all over India. Most of this is happening in public and under police supervision.\n\nAll of this is happening while muslims are fasting in the month of Ramzan \n\nIt should be a matter of collective outrage that **there is no full page National media coverage**\n\nPosting links to news that is being reported (will continue to update throughout the day):\n\n[Violence erupts in Howrah over Ram Navami procession](https://www.thehindu.com/news/national/other-states/violence-erupts-in-howrah-over-ram-navami-procession/article66680602.ece)\n\n\n[Arson, Tension In Maharashtra City On Ram Navami Eve, Police Cars Targeted](https://www.google.com/amp/s/www.ndtv.com/india-news/violence-in-maharashtra-city-on-ram-navami-eve-police-cars-set-on-fire-3905168/amp/1)\n\n[Stones pelted at Ram Navami procession in Vadodara](https://m.rediff.com/news/report/stones-pelted-at-ram-navami-procession-in-vadodara/20230330.htm)\n\n[Why is Ram Navami marred by violence?](https://www.indiatoday.in/india/video/why-is-ram-navami-marred-by-violence-2353715-2023-03-30)\n\n+++---+++++++++++\n\nExcerpt from recently released report:\n\n[A Single Factor Is Common to All Communal Riots During Religious Processions in India](https://www.google.com/amp/s/m.thewire.in/article/communalism/riots-religious-processions-ram-navami/amp)\n\n-----++++++\n\n\n[StrawhatKaptaan makes this observation](https://twitter.com/StrawhatKaptaan/status/1641422256562921473?t=Pf3l6EjeQv4Q6aPgb7T1eg&amp;s=19)\n\nWe are seeing the same pattern in these incidents\n\n1) Hindus take rallies through muslim majority areas.\n\n2) Play provocative songs.\n\n3) Pelt stones on masjid's/Dargah's.\n\n4) Muslims retaliate to protect themselves,News channels show only the part where muslims fight back.\n\n5) Police arrest muslims",
        "21st incident took place in Beenjhbayala,Ganganagar, Rajasthan.\n\nhttps://preview.redd.it/i6d2jm8zv0ra1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=fd5b60e8fa5ebe589ccb6f3c3065f17fac57c471\n\n[https://twitter.com/meerfaisal01/status/1641560200716099584?t=pkxNa0wGPwQTH9UABjIhiQ&amp;s=19](https://twitter.com/meerfaisal01/status/1641560200716099584?t=pkxNa0wGPwQTH9UABjIhiQ&amp;s=19)",
        "[https://twitter.com/meerfaisal01/status/1641593479422939136?t=gC98Fe32gWF43XPFkq\\_dbw&amp;s=19](https://twitter.com/meerfaisal01/status/1641593479422939136?t=gC98Fe32gWF43XPFkq_dbw&amp;s=19)\n\nPeople of the Muslim community welcomed the procession taken out on Ram Navami in Mewat, Sikri, of Rajasthan's Bharatpur district by showering flowers\n\nhttps://preview.redd.it/jkkyq2chw0ra1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=55090495875fca4311d5efa64616d85bd91b995f",
        "Ok bro",
        "Why are you not speaking against stone pelting incidents ?",
        "I am. You don't want to read. Not my fault:\n\n\n\nWe are seeing the same pattern in these incidents\n\n1) Hindus take rallies through muslim majority areas.\n\n2) Play provocative songs.\n\n3) Pelt stones on masjid's/Dargah's.\n\n4) Muslims retaliate to protect themselves,News channels show only the part where muslims fight back.\n\n5) Police arrest muslims",
        "Gonna completely ignore the stone peltings done by peaceful community in Vadodara,sambhajinagar,WB ?",
        "I am more scared for what is to happen on Eid.",
        "A lot has changed. The violence is now state sponsored and supported by the media and elected officials. You are overlooking the fact that we had the ability to control this and report it for what it was.\n\nWe no longer have that. We now live in the age of the IT cell",
        "This gets posted but stone pelting by muslim youth does not?",
        "I did post about it. Here are the facts again:\n\n1) Hindus take rallies through muslim majority areas.\n\n2) Play provocative songs, brandish swords\n\n3) Pelt stones on masjid's/Dargah's.\n\n4) Muslims retaliate to protect themselves,News channels show only the part where muslims fight back.\n\n5) Police arrest muslims",
        "Unlike your side, which is objective and driven by op India 😂😂",
        "Jai Shree Ram is the new Allah hu akbar.",
        "Yeap, it’s state sponsored now.",
        "purey din TV par to vahi aata hai..",
        "purey din TV par to vahi aata hai..",
        "Vo to TV me aayega hi...",
        "Blinded by hatred and lost common sense is the name of this disease",
        "That Raja Singh guy is a menace. He's provoking the youth here, even my cousins support him now it's disgusting",
        "And this is after FIR was issued",
        "BJP for you",
        "why?",
        "Because now apparently these rowdy elements will have a ‘reason’ to do something stupid during the muslim festival. And justify it by saying, that they did to us on Ramnavmi.",
        "Almost in all of the cases the ones in rally are at fault but the aurangabad seems to be different.",
        "This isn't the India or the Hinduism i loved growing up, this is the exact opposite of it.",
        "I get what you are saying at a personal level.\n\n However India and Hinduism have always culturally and historical contained these contradictions.",
        "sad state of affairs. In these incidents usually the property of innocents are destroyed, the social fabric is disturbed and nothing good comes out of this. If muslims do this on EID then its a win for the right wing political party as people will vote for them due to these incidents.",
        "There are footages out from both sides, whom I should believe?",
        "You are free to judge and decide.",
        "Our country itself is being ruled by bigots",
        "This is the most secular country, muslim and hindu both celebrate their festivals by going to mosques and Dargha.",
        "What exactly are these provocative slogans?",
        "The soundtrack of Hindu rashtra. See original twitter thread for actual footage from yesterday \n\nhttps://youtu.be/OBXz-cafkRM",
        "People cherry-pick the good parts of their religion and ignore the bad parts.",
        "Meanwhile courts busy with defamation cases while u can literally see the pattern of crimes on every hindu festival just to ignite nd infuriate muslims",
        "What is the other side of being lynched?",
        "Ded",
        "So these festivals are just becoming an excuse to harras and assault minority.",
        "I heard in rally women weren't seen which raises suspicion that it was pre-planned",
        "All this is happening after Shinde govt took power from Uddhav.\n\nAm I wrong to assume something like this didn't happen under his watch?",
        "Absolutely a major factor",
        "A calendar for killing and assault",
        "Ouch",
        "A wise man said - it will be disaster fir India if gautamdas becomes pm. Today we can see it. The government is just impotent to these incidents",
        "Not just impotent. In some cases, eager and willing",
        "Based username btw",
        "Future is looking bright, people burning in the streets. India being invaded by china and other neighbours while Modi's escape to Mauritius with his girlfriend Adani",
        "BJP doing the usual BJP things.",
        "\"BuT VrO BHaji PaV Ruled states have the best law and order, bro trust mein vro, dekh muxllo ko police kaisi dhoti hai aur hum unhe kaise humiliate karte hai.\"",
        "plz coment on bengal incident too",
        "Link is included. I personally feel it was a failure of the government and law and order",
        "wtf why are people downvoting or is it that they just wana hear only one sided propoganda. What i believe is that stones get pelted from both the sides but the liberals and western media covers only one side beause it suites there agenda where the hell is us congreswomen or media not commenting on stone peltin in bengal ???",
        "and just for clarification i am not a supporter of bjp or the government but i do fell that the western media often covers only one side and runs propoganda against india",
        "no, you're deliberately ignoring the other parts",
        "Really? \n\nSo the entire fault is Hindus and Hindus should not go through Muslims areas.",
        "In picture 10/20\n\nWhy are muslims arrested?",
        "So what do you think about this?",
        "People who hate speech and do violence fof them even Ram from above wouldn't be happy about it.",
        "It sad But alsooo What abt the atrocities done by Muslims on ram navami ?? Pelted stones on ram mandir etc ? Please post both news and wht happnd in howrah is so sad, can we please stay together and in peace !!",
        "Did you see steps 2 and 3?",
        "where the fuck they arrested Muslims ? look at the howrah peltings there Muslims were first to pelt stones and police did nothing...",
        "I'd wager that these are coordinated by a central committee somewhere. The same template cannot be seen everywhere suddenly. Keep a record of names. They will face punishment one day.",
        "If you don't want to see, you also don't want to believe"
    ],
    "cleaned_text": "ram navmi yields separate incidents antimuslim violence hate speech videos ground footage collected meer faisal ",
    "cleaned_title": "ram navmi yields separate incidents antimuslim violence hate speech",
    "cleaned_selftext": "videos ground footage collected meer faisal",
    "cleaned_comments": "seeing separate incidents across states india happening public police supervision happening muslims fasting month ramzan matter collective outrage full page national media coverage posting links news reported continue update throughout day violence erupts howrah ram navami processionhttpswwwthehinducomnewsnationalotherstatesviolenceeruptsinhowrahoverramnavamiprocessionarticleece arson tension maharashtra city ram navami eve police cars targetedhttpswwwgooglecomampswwwndtvcomindianewsviolenceinmaharashtracityonramnavamievepolicecarssetonfireamp stones pelted ram navami procession vadodarahttpsmrediffcomnewsreportstonespeltedatramnavamiprocessioninvadodarahtm ram navami marred violencehttpswwwindiatodayinindiavideowhyisramnavamimarredbyviolence excerpt recently released report single factor common communal riots religious processions indiahttpswwwgooglecomampsmthewireinarticlecommunalismriotsreligiousprocessionsramnavamiamp strawhatkaptaan makes observationhttpstwittercomstrawhatkaptaanstatustpflejeqvqapgbtegamps seeing pattern incidents hindus take rallies muslim majority areas play provocative songs pelt stones masjidsdargahs muslims retaliate protect themselvesnews channels show part muslims fight back police arrest muslims st incident took place beenjhbayalaganganagar rajasthan httpstwittercommeerfaisalstatustpkxnawgpwqthuabjihiqampshttpstwittercommeerfaisalstatustpkxnawgpwqthuabjihiqamps httpstwittercommeerfaisalstatustgcfegwfxpfkqdbwampshttpstwittercommeerfaisalstatustgcfegwfxpfkqdbwamps people muslim community welcomed procession taken ram navami mewat sikri rajasthans bharatpur district showering flowers ok bro speaking stone pelting incidents dont want read fault seeing pattern incidents hindus take rallies muslim majority areas play provocative songs pelt stones masjidsdargahs muslims retaliate protect themselvesnews channels show part muslims fight back police arrest muslims gon na completely ignore stone peltings done peaceful community vadodarasambhajinagarwb scared happen eid lot changed violence state sponsored supported media elected officials overlooking fact ability control report longer live age cell gets posted stone pelting muslim youth post facts hindus take rallies muslim majority areas play provocative songs brandish swords pelt stones masjidsdargahs muslims retaliate protect themselvesnews channels show part muslims fight back police arrest muslims unlike side objective driven op india jai shree ram new allah hu akbar yeap state sponsored purey din tv par vahi aata hai purey din tv par vahi aata hai vo tv aayega hi blinded hatred lost common sense name disease raja singh guy menace hes provoking youth even cousins support disgusting fir issued bjp apparently rowdy elements reason something stupid muslim festival justify saying us ramnavmi almost cases ones rally fault aurangabad seems different isnt india hinduism loved growing exact opposite get saying personal level however india hinduism always culturally historical contained contradictions sad state affairs incidents usually property innocents destroyed social fabric disturbed nothing good comes muslims eid win right wing political party people vote due incidents footages sides believe free judge decide country ruled bigots secular country muslim hindu celebrate festivals going mosques dargha exactly provocative slogans soundtrack hindu rashtra see original twitter thread actual footage yesterday people cherrypick good parts religion ignore bad parts meanwhile courts busy defamation cases u literally see pattern crimes every hindu festival ignite nd infuriate muslims side lynched ded festivals becoming excuse harras assault minority heard rally women werent seen raises suspicion preplanned happening shinde govt took power uddhav wrong assume something like didnt happen watch absolutely major factor calendar killing assault ouch wise man said disaster fir india gautamdas becomes pm today see government impotent incidents impotent cases eager willing based username btw future looking bright people burning streets india invaded china neighbours modis escape mauritius girlfriend adani bjp usual bjp things vro bhaji pav ruled states best law order bro trust mein vro dekh muxllo ko police kaisi dhoti hai aur hum unhe kaise humiliate karte hai plz coment bengal incident link included personally feel failure government law order wtf people downvoting wana hear one sided propoganda believe stones get pelted sides liberals western media covers one side beause suites agenda hell us congreswomen media commenting stone peltin bengal clarification supporter bjp government fell western media often covers one side runs propoganda india youre deliberately ignoring parts really entire fault hindus hindus go muslims areas picture muslims arrested think people hate speech violence fof even ram wouldnt happy sad alsooo abt atrocities done muslims ram navami pelted stones ram mandir etc please post news wht happnd howrah sad please stay together peace see steps fuck arrested muslims look howrah peltings muslims first pelt stones police nothing id wager coordinated central committee somewhere template seen everywhere suddenly keep record names face punishment one day dont want see also dont want believe",
    "light_cleaned_title": "Ram Navmi 2023 yields 21 separate incidents of anti-muslim violence and hate speech",
    "light_cleaned_selftext": "Videos and on the ground footage collected by Meer Faisal:",
    "light_cleaned_comments": "We are seeing 21 separate incidents across 13 states all over India. Most of this is happening in public and under police supervision. All of this is happening while muslims are fasting in the month of Ramzan It should be a matter of collective outrage that **there is no full page National media coverage** Posting links to news that is being reported (will continue to update throughout the day): [Violence erupts in Howrah over Ram Navami procession](https://www.thehindu.com/news/national/other-states/violence-erupts-in-howrah-over-ram-navami-procession/article66680602.ece) [Arson, Tension In Maharashtra City On Ram Navami Eve, Police Cars Targeted](https://www.google.com/amp/s/www.ndtv.com/india-news/violence-in-maharashtra-city-on-ram-navami-eve-police-cars-set-on-fire-3905168/amp/1) [Stones pelted at Ram Navami procession in Vadodara](https://m.rediff.com/news/report/stones-pelted-at-ram-navami-procession-in-vadodara/20230330.htm) [Why is Ram Navami marred by violence?](https://www.indiatoday.in/india/video/why-is-ram-navami-marred-by-violence-2353715-2023-03-30) +++---+++++++++++ Excerpt from recently released report: [A Single Factor Is Common to All Communal Riots During Religious Processions in India](https://www.google.com/amp/s/m.thewire.in/article/communalism/riots-religious-processions-ram-navami/amp) -----++++++ [StrawhatKaptaan makes this observation](https://twitter.com/StrawhatKaptaan/status/1641422256562921473?t=Pf3l6EjeQv4Q6aPgb7T1eg&amp;s=19) We are seeing the same pattern in these incidents 1) Hindus take rallies through muslim majority areas. 2) Play provocative songs. 3) Pelt stones on masjid's/Dargah's. 4) Muslims retaliate to protect themselves,News channels show only the part where muslims fight back. 5) Police arrest muslims 21st incident took place in Beenjhbayala,Ganganagar, Rajasthan. [https://twitter.com/meerfaisal01/status/1641560200716099584?t=pkxNa0wGPwQTH9UABjIhiQ&amp;s=19](https://twitter.com/meerfaisal01/status/1641560200716099584?t=pkxNa0wGPwQTH9UABjIhiQ&amp;s=19) [https://twitter.com/meerfaisal01/status/1641593479422939136?t=gC98Fe32gWF43XPFkq\\_dbw&amp;s=19](https://twitter.com/meerfaisal01/status/1641593479422939136?t=gC98Fe32gWF43XPFkq_dbw&amp;s=19) People of the Muslim community welcomed the procession taken out on Ram Navami in Mewat, Sikri, of Rajasthan's Bharatpur district by showering flowers Ok bro Why are you not speaking against stone pelting incidents ? I am. You don't want to read. Not my fault: We are seeing the same pattern in these incidents 1) Hindus take rallies through muslim majority areas. 2) Play provocative songs. 3) Pelt stones on masjid's/Dargah's. 4) Muslims retaliate to protect themselves,News channels show only the part where muslims fight back. 5) Police arrest muslims Gonna completely ignore the stone peltings done by peaceful community in Vadodara,sambhajinagar,WB ? I am more scared for what is to happen on Eid. A lot has changed. The violence is now state sponsored and supported by the media and elected officials. You are overlooking the fact that we had the ability to control this and report it for what it was. We no longer have that. We now live in the age of the IT cell This gets posted but stone pelting by muslim youth does not? I did post about it. Here are the facts again: 1) Hindus take rallies through muslim majority areas. 2) Play provocative songs, brandish swords 3) Pelt stones on masjid's/Dargah's. 4) Muslims retaliate to protect themselves,News channels show only the part where muslims fight back. 5) Police arrest muslims Unlike your side, which is objective and driven by op India 😂😂 Jai Shree Ram is the new Allah hu akbar. Yeap, it’s state sponsored now. purey din TV par to vahi aata hai.. purey din TV par to vahi aata hai.. Vo to TV me aayega hi... Blinded by hatred and lost common sense is the name of this disease That Raja Singh guy is a menace. He's provoking the youth here, even my cousins support him now it's disgusting And this is after FIR was issued BJP for you why? Because now apparently these rowdy elements will have a ‘reason’ to do something stupid during the muslim festival. And justify it by saying, that they did to us on Ramnavmi. Almost in all of the cases the ones in rally are at fault but the aurangabad seems to be different. This isn't the India or the Hinduism i loved growing up, this is the exact opposite of it. I get what you are saying at a personal level. However India and Hinduism have always culturally and historical contained these contradictions. sad state of affairs. In these incidents usually the property of innocents are destroyed, the social fabric is disturbed and nothing good comes out of this. If muslims do this on EID then its a win for the right wing political party as people will vote for them due to these incidents. There are footages out from both sides, whom I should believe? You are free to judge and decide. Our country itself is being ruled by bigots This is the most secular country, muslim and hindu both celebrate their festivals by going to mosques and Dargha. What exactly are these provocative slogans? The soundtrack of Hindu rashtra. See original twitter thread for actual footage from yesterday People cherry-pick the good parts of their religion and ignore the bad parts. Meanwhile courts busy with defamation cases while u can literally see the pattern of crimes on every hindu festival just to ignite nd infuriate muslims What is the other side of being lynched? Ded So these festivals are just becoming an excuse to harras and assault minority. I heard in rally women weren't seen which raises suspicion that it was pre-planned All this is happening after Shinde govt took power from Uddhav. Am I wrong to assume something like this didn't happen under his watch? Absolutely a major factor A calendar for killing and assault Ouch A wise man said - it will be disaster fir India if gautamdas becomes pm. Today we can see it. The government is just impotent to these incidents Not just impotent. In some cases, eager and willing Based username btw Future is looking bright, people burning in the streets. India being invaded by china and other neighbours while Modi's escape to Mauritius with his girlfriend Adani BJP doing the usual BJP things. \"BuT VrO BHaji PaV Ruled states have the best law and order, bro trust mein vro, dekh muxllo ko police kaisi dhoti hai aur hum unhe kaise humiliate karte hai.\" plz coment on bengal incident too Link is included. I personally feel it was a failure of the government and law and order wtf why are people downvoting or is it that they just wana hear only one sided propoganda. What i believe is that stones get pelted from both the sides but the liberals and western media covers only one side beause it suites there agenda where the hell is us congreswomen or media not commenting on stone peltin in bengal ??? and just for clarification i am not a supporter of bjp or the government but i do fell that the western media often covers only one side and runs propoganda against india no, you're deliberately ignoring the other parts Really? So the entire fault is Hindus and Hindus should not go through Muslims areas. In picture 10/20 Why are muslims arrested? So what do you think about this? People who hate speech and do violence fof them even Ram from above wouldn't be happy about it. It sad But alsooo What abt the atrocities done by Muslims on ram navami ?? Pelted stones on ram mandir etc ? Please post both news and wht happnd in howrah is so sad, can we please stay together and in peace !! Did you see steps 2 and 3? where the fuck they arrested Muslims ? look at the howrah peltings there Muslims were first to pelt stones and police did nothing... I'd wager that these are coordinated by a central committee somewhere. The same template cannot be seen everywhere suddenly. Keep a record of names. They will face punishment one day. If you don't want to see, you also don't want to believe"
}