{
    "id": "1h1b3cu",
    "title": "any entry in the revenue records declaring the land as Takia, graveyard and Maszid, enjoys conclusivity, and, is required to be ensured to be protected even at the site concerned, despite evidence of purported prolonged non-user thereof by the Muslim community.",
    "url": "https://www.reddit.com/r/india/comments/1h1b3cu/any_entry_in_the_revenue_records_declaring_the/",
    "selftext": "\nThe High Court of Punjab and Haryana has delivered a judgment with ordering a survey.\n\n\n\nThe Court looked at the revenue records and reached a conclusion that it delivered as follows \n\n\n\n\"any entry in the revenue records declaring the land as Takia, graveyard and Maszid, enjoys conclusivity, and, is required to be ensured to be protected even at the site concerned, despite evidence of purported prolonged non-user thereof by the Muslim community.\"\n\n\n\nThe Court noted that admittedly the disputed land was donated by Maharaja Kapurthala and declared as \"Takia, graveyard and the Maszid\" to Nikke Sha, Slamat Sha sons of Sube Shah on 14 Katak in 1922.\n\n\n\nThe Sha brothers migrated to Pakistan after partition and subsequently, the land was mutated in the name of the Gram Panchayat.\n\n\n\nHowever, after partition a re-survey was conducted in the year 1966, and the apposite Misl Haqiat was prepared wherebys in the ownership column the State was declared to be the owner, whereas, in the relevant classification column the property was described as Maszid, graveyard and Takia. of the Gram Panchayat.\n\n\n\nConsidering the revenue entry, the disputed property as \"Gair Mumkin Maszid, Takia as well as graveyard\", the  Wakf Tribunal, declared the land as Waqf property.\n\n\n\nThe bench relied on Syed Mohd. Salie Labbai (dead) by LRs and others V. Mohd. Hanifa (dead) by LRs and others,, 1968 wherein the Apex Court held that, \"once a Kabarstan has been held to be a public graveyard then it vests in the public and constitutes a wakf and it cannot be divested by non-user but will always continue to be so whether it is used or not.\"\n\n\n\nhttps://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-any-land-declared-as-masjid-graveyard-in-revenue-records-must-be-protected-even-if-it-is-not-used-by-muslim-community-from-long-time-276408\n\n",
    "flair": "Law & Courts",
    "score": 3,
    "num_comments": 0,
    "created_utc": 1732731854.0,
    "convurl": "https://external-preview.redd.it/R2ZUyIvrN3Pr9uagNG-YnUEdeFtAigQJsjf2sudj-H8.jpg?auto=webp&s=b06ab47ec74050a15235aa724462c87e49be8b0f",
    "comments": [],
    "cleaned_text": "entry revenue records declaring land takia graveyard maszid enjoys conclusivity required ensured protected even site concerned despite evidence purported prolonged nonuser thereof muslim community high court punjab haryana delivered judgment ordering survey court looked revenue records reached conclusion delivered follows entry revenue records declaring land takia graveyard maszid enjoys conclusivity required ensured protected even site concerned despite evidence purported prolonged nonuser thereof muslim community court noted admittedly disputed land donated maharaja kapurthala declared takia graveyard maszid nikke sha slamat sha sons sube shah katak sha brothers migrated pakistan partition subsequently land mutated name gram panchayat however partition resurvey conducted year apposite misl haqiat prepared wherebys ownership column state declared owner whereas relevant classification column property described maszid graveyard takia gram panchayat considering revenue entry disputed property gair mumkin maszid takia well graveyard wakf tribunal declared land waqf property bench relied syed mohd salie labbai dead lrs others v mohd hanifa dead lrs others wherein apex court held kabarstan held public graveyard vests public constitutes wakf divested nonuser always continue whether used ",
    "cleaned_title": "entry revenue records declaring land takia graveyard maszid enjoys conclusivity required ensured protected even site concerned despite evidence purported prolonged nonuser thereof muslim community",
    "cleaned_selftext": "high court punjab haryana delivered judgment ordering survey court looked revenue records reached conclusion delivered follows entry revenue records declaring land takia graveyard maszid enjoys conclusivity required ensured protected even site concerned despite evidence purported prolonged nonuser thereof muslim community court noted admittedly disputed land donated maharaja kapurthala declared takia graveyard maszid nikke sha slamat sha sons sube shah katak sha brothers migrated pakistan partition subsequently land mutated name gram panchayat however partition resurvey conducted year apposite misl haqiat prepared wherebys ownership column state declared owner whereas relevant classification column property described maszid graveyard takia gram panchayat considering revenue entry disputed property gair mumkin maszid takia well graveyard wakf tribunal declared land waqf property bench relied syed mohd salie labbai dead lrs others v mohd hanifa dead lrs others wherein apex court held kabarstan held public graveyard vests public constitutes wakf divested nonuser always continue whether used",
    "cleaned_comments": "",
    "light_cleaned_title": "any entry in the revenue records declaring the land as Takia, graveyard and Maszid, enjoys conclusivity, and, is required to be ensured to be protected even at the site concerned, despite evidence of purported prolonged non-user thereof by the Muslim community.",
    "light_cleaned_selftext": "The High Court of Punjab and Haryana has delivered a judgment with ordering a survey. The Court looked at the revenue records and reached a conclusion that it delivered as follows \"any entry in the revenue records declaring the land as Takia, graveyard and Maszid, enjoys conclusivity, and, is required to be ensured to be protected even at the site concerned, despite evidence of purported prolonged non-user thereof by the Muslim community.\" The Court noted that admittedly the disputed land was donated by Maharaja Kapurthala and declared as \"Takia, graveyard and the Maszid\" to Nikke Sha, Slamat Sha sons of Sube Shah on 14 Katak in 1922. The Sha brothers migrated to Pakistan after partition and subsequently, the land was mutated in the name of the Gram Panchayat. However, after partition a re-survey was conducted in the year 1966, and the apposite Misl Haqiat was prepared wherebys in the ownership column the State was declared to be the owner, whereas, in the relevant classification column the property was described as Maszid, graveyard and Takia. of the Gram Panchayat. Considering the revenue entry, the disputed property as \"Gair Mumkin Maszid, Takia as well as graveyard\", the Wakf Tribunal, declared the land as Waqf property. The bench relied on Syed Mohd. Salie Labbai (dead) by LRs and others V. Mohd. Hanifa (dead) by LRs and others,, 1968 wherein the Apex Court held that, \"once a Kabarstan has been held to be a public graveyard then it vests in the public and constitutes a wakf and it cannot be divested by non-user but will always continue to be so whether it is used or not.\"",
    "light_cleaned_comments": ""
}