{
    "id": "15fzmaz",
    "title": "Am I the only one who found Abhijit Chavda's analysis of the situation in Manipur a little...skewed?",
    "url": "https://www.reddit.com/r/india/comments/15fzmaz/am_i_the_only_one_who_found_abhijit_chavdas/",
    "selftext": "https://youtu.be/ewLfLGi-gUk\n\nAs much as I appreciate Abhijit Chavda's thorough analysis of the situation in Manipur at no point in the video does he address the numerous assaults committed by Meiteis too. It's not fair for him to state that justice has to be served for Meitei people alone, when atrocities have been committed by them against kuki people too. \n\nPlease do watch the video; would like to hear everyone else's thoughts.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690953195.0,
    "convurl": "https://external-preview.redd.it/zRKDQkyVZuEpizsvwrFIH81fOBE-PY_g0DBl79y4JqU.jpg?auto=webp&s=dcd1b6993b48d2da591049090171364c86710080",
    "comments": [
        "It will piss off his fans. Most people aren’t looking for opinions they are looking for echo chambers",
        "Yes. He is a government supporter and hence he is biased. \n\nHe uses the term \"vassals\" because that makes India the 2end best country to live in. (After US)\nHe even criticizes US rules etc to make India look better. \n\nRemember when Manipur Violence broke, He said he won't say much because the situation is volatile. (in line with BJPs policy)\n\nThen when that video went viral on social media, He came out with a pro BJP analysis of the situation. So now the situation is not volatile anymore? What changed?",
        "Paisa",
        "That fellow is a right wing mouthpiece. Dumb as rocks.",
        "There are a lot of extremists in YouTube and Abhijith Lavda is one of em",
        "Initially I thought Abhijit Chavda was well read and well informed. But as i saw more of his videos - I realised he had very strong biases that color his views. At times his interpretation could be termed is very questionable. \n\nI stopped watching him - because he was no longer coming across as an expert but just someone wanted to pander to certain audiences.",
        "Why would you watch this asshat's videos lol",
        "Expecting truth from mouth piece of the Govt is just un realistic..."
    ],
    "cleaned_text": "one found abhijit chavdas analysis situation manipur littleskewed much appreciate abhijit chavdas thorough analysis situation manipur point video address numerous assaults committed meiteis fair state justice served meitei people alone atrocities committed kuki people please watch video would like hear everyone elses thoughts ",
    "cleaned_title": "one found abhijit chavdas analysis situation manipur littleskewed",
    "cleaned_selftext": "much appreciate abhijit chavdas thorough analysis situation manipur point video address numerous assaults committed meiteis fair state justice served meitei people alone atrocities committed kuki people please watch video would like hear everyone elses thoughts",
    "cleaned_comments": "piss fans people arent looking opinions looking echo chambers yes government supporter hence biased uses term vassals makes india end best country live us even criticizes us rules etc make india look better remember manipur violence broke said wont say much situation volatile line bjps policy video went viral social media came pro bjp analysis situation situation volatile anymore changed paisa fellow right wing mouthpiece dumb rocks lot extremists youtube abhijith lavda one em initially thought abhijit chavda well read well informed saw videos realised strong biases color views times interpretation could termed questionable stopped watching longer coming across expert someone wanted pander certain audiences would watch asshats videos lol expecting truth mouth piece govt un realistic",
    "light_cleaned_title": "Am I the only one who found Abhijit Chavda's analysis of the situation in Manipur a little...skewed?",
    "light_cleaned_selftext": "As much as I appreciate Abhijit Chavda's thorough analysis of the situation in Manipur at no point in the video does he address the numerous assaults committed by Meiteis too. It's not fair for him to state that justice has to be served for Meitei people alone, when atrocities have been committed by them against kuki people too. Please do watch the video; would like to hear everyone else's thoughts.",
    "light_cleaned_comments": "It will piss off his fans. Most people aren’t looking for opinions they are looking for echo chambers Yes. He is a government supporter and hence he is biased. He uses the term \"vassals\" because that makes India the 2end best country to live in. (After US) He even criticizes US rules etc to make India look better. Remember when Manipur Violence broke, He said he won't say much because the situation is volatile. (in line with BJPs policy) Then when that video went viral on social media, He came out with a pro BJP analysis of the situation. So now the situation is not volatile anymore? What changed? Paisa That fellow is a right wing mouthpiece. Dumb as rocks. There are a lot of extremists in YouTube and Abhijith Lavda is one of em Initially I thought Abhijit Chavda was well read and well informed. But as i saw more of his videos - I realised he had very strong biases that color his views. At times his interpretation could be termed is very questionable. I stopped watching him - because he was no longer coming across as an expert but just someone wanted to pander to certain audiences. Why would you watch this asshat's videos lol Expecting truth from mouth piece of the Govt is just un realistic..."
}