{
    "id": "18cavpx",
    "title": "8 Independent MLAsbin Rajasthan critical for decision of who will be the CM",
    "url": "https://thenewsdispatcher.in/independent-mlas-in-rajasthan-2023-assembly/",
    "selftext": "Vasundhara Raje commands the loyalty of 25 MLAs in the state. Of she decides to play ball, BJP might see it's tally fall to 90 from the current 115.\n\nWith 8 Independent and 3 from BSP (most likely) the total tally would cross majority mark and BJP government will still have 101 seats.",
    "flair": "Politics",
    "score": 3,
    "num_comments": 1,
    "created_utc": 1701888155.0,
    "convurl": "https://external-preview.redd.it/Ui6hK60tbZAePMYcVJraaSPbPdlpeOzmzg2cPMjaSp4.jpg?auto=webp&s=b0a2f3fafdc13b2fa7fb496b866cab35c26f1b78",
    "comments": [
        "The Hindutva Forces of Rajasthan have long rallied behind the banner of Olden Royals. But now, the central command is ready to abandon the need to pander to the Royals.. Raje has long held a very simple proposal, she leads the Hindutva camps but at the same time works with the Secularists to weaken them to the point they always need her to win. \n\nThis marks a tremendous shift in the political winds of the Desert State. \n\nThe long standing Gehlot - Raje era of hidden Secularist-Hindutva cooperation have ended. Roving bands of Hindutva soldiers have taken over Jaipur."
    ],
    "cleaned_text": "independent mlasbin rajasthan critical decision cm vasundhara raje commands loyalty mlas state decides play ball bjp might see tally fall current independent bsp likely total tally would cross majority mark bjp government still seats ",
    "cleaned_title": "independent mlasbin rajasthan critical decision cm",
    "cleaned_selftext": "vasundhara raje commands loyalty mlas state decides play ball bjp might see tally fall current independent bsp likely total tally would cross majority mark bjp government still seats",
    "cleaned_comments": "hindutva forces rajasthan long rallied behind banner olden royals central command ready abandon need pander royals raje long held simple proposal leads hindutva camps time works secularists weaken point always need win marks tremendous shift political winds desert state long standing gehlot raje era hidden secularisthindutva cooperation ended roving bands hindutva soldiers taken jaipur",
    "light_cleaned_title": "8 Independent MLAsbin Rajasthan critical for decision of who will be the CM",
    "light_cleaned_selftext": "Vasundhara Raje commands the loyalty of 25 MLAs in the state. Of she decides to play ball, BJP might see it's tally fall to 90 from the current 115. With 8 Independent and 3 from BSP (most likely) the total tally would cross majority mark and BJP government will still have 101 seats.",
    "light_cleaned_comments": "The Hindutva Forces of Rajasthan have long rallied behind the banner of Olden Royals. But now, the central command is ready to abandon the need to pander to the Royals.. Raje has long held a very simple proposal, she leads the Hindutva camps but at the same time works with the Secularists to weaken them to the point they always need her to win. This marks a tremendous shift in the political winds of the Desert State. The long standing Gehlot - Raje era of hidden Secularist-Hindutva cooperation have ended. Roving bands of Hindutva soldiers have taken over Jaipur."
}