{
    "id": "150tzlb",
    "title": "In Monsoon Session, Cong to oppose 3 Bills, raise Manipur issue, Centre’s ‘assault’ on federalism",
    "url": "https://indianexpress.com/article/political-pulse/in-monsoon-session-cong-to-oppose-3-bills-raise-manipur-issue-centres-assault-on-federalism-8840272/",
    "selftext": "The party is set to demand resignation of Union Home Minister Amit Shah over the violence in Manipur",
    "flair": "Politics",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1689473805.0,
    "convurl": "https://external-preview.redd.it/g0TToCC4R2-0yR-EUQSM9NYxpiGljXGNSE784YyBUPA.jpg?auto=webp&s=25bdfe68607a90cef134c770586974a2d53822fc",
    "comments": [
        "Finally opposition getting their act together.",
        "I guess the monsoon session will be cancelled and on the last day, all bills will be passed without discussion. Or if the opposition actually succeeds in raising issues, their statements will be removed from the hemisphere.",
        "They don't need to cancel, the honourable speaker will just enter, smile, pass everything without looking at the opposition and adjourn."
    ],
    "cleaned_text": "monsoon session cong oppose bills raise manipur issue centres assault federalism party set demand resignation union home minister amit shah violence manipur ",
    "cleaned_title": "monsoon session cong oppose bills raise manipur issue centres assault federalism",
    "cleaned_selftext": "party set demand resignation union home minister amit shah violence manipur",
    "cleaned_comments": "finally opposition getting act together guess monsoon session cancelled last day bills passed without discussion opposition actually succeeds raising issues statements removed hemisphere dont need cancel honourable speaker enter smile pass everything without looking opposition adjourn",
    "light_cleaned_title": "In Monsoon Session, Cong to oppose 3 Bills, raise Manipur issue, Centre’s ‘assault’ on federalism",
    "light_cleaned_selftext": "The party is set to demand resignation of Union Home Minister Amit Shah over the violence in Manipur",
    "light_cleaned_comments": "Finally opposition getting their act together. I guess the monsoon session will be cancelled and on the last day, all bills will be passed without discussion. Or if the opposition actually succeeds in raising issues, their statements will be removed from the hemisphere. They don't need to cancel, the honourable speaker will just enter, smile, pass everything without looking at the opposition and adjourn."
}