{
    "id": "14zkr2f",
    "title": "Need some help with Times Prime, and i think they are scamming me.",
    "url": "https://www.reddit.com/gallery/14zkr2f",
    "selftext": "So i recently bought the subscription for times prime, upon purchase i saw that something called times prime lite was already activated, i have not purchased the lite version nor the option for any auto renewal was on.\nSince the lite version is active i have to wait till January next year so that the lite expires and the full wala activates.\nQuestion 1. Can i cancel the lite membership? As i tried to but didn’t see any option for it.\nQuestion 2. Is there any way to get to their support team as i saw that the only way to reach them is creating a ticket and its the most useless support i have ever seen.\nAs i have attached an image for reference asking them to help me regarding the same but on the first para they’re saying - we “doesn’t” support cancellation after which in the next para they’re giving directions on how to cancel the membership which does not work.\nTheir english itself seems very sus to me,\nQuestion 3: they trying to scam me?\n\nNote:  the second image you can see times lite annual purchased on January 2023 valid till January 2024, i didn’t even know what this was back then and just installed this on July 6th 2023 so how is it possible.\n\nPlease help guys..",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689351525.0,
    "convurl": "https://i.redd.it/98wbm04fhybb1.jpg",
    "comments": [
        "How did you pay ? For UPI/debit card based payment you should see the payment subscription and can cancel from your side. In case of credit card you should contact your bank",
        "Its not a subscription really, its a one time payment for one year access to prime features…. I’m not even getting normal support I’m wondering how they will give prime features. :/\nVery disappointed with it man..",
        "I tried to reply to you ⬆️",
        "If it is one time payment and you want to cancel your membership for the year you have already paid for then it might be headache to resolve. Maybe threat of contacting customer support agencies if they are not providing services they promised.",
        "They literally have no email id or phone number where i can reach them…",
        "https://preview.redd.it/ktq8q8e4kybb1.jpeg?width=1080&format=pjpg&auto=webp&s=77e117a9c149c2cb977712217e2d6dcfedde32ac",
        "I called that number but apparently  its  the number to opt out from SMS or download the app… upon calling it says “thank you” and then disconnects.",
        "When did you call ? I think this number is to ask them to contact you as you are supposed to give missed call. You can try to drop a mail and contact them on social media.",
        "Social media is the only thing left to try other options dont work, and is my post taken down?",
        "Post is up but probably most people don't have any experience with specific issues you are facing so don't want to comment.",
        "I saw the post as grey, was just wondering…thank for the help man",
        "Honestly double check your method of payment to confirm that they won't be able to deduct any more money, try to contact and see if you can't get membership cancelled and if it doesn't work then write it down an life lesson.",
        "Auto renewal is on, I do my purchases through apple ID and i have not setup any instalment, just a one time payment.",
        "Auto renewal is not on*"
    ],
    "cleaned_text": "need help times prime think scamming recently bought subscription times prime upon purchase saw something called times prime lite already activated purchased lite version option auto renewal since lite version active wait till january next year lite expires full wala activates question cancel lite membership tried didnt see option question way get support team saw way reach creating ticket useless support ever seen attached image reference asking help regarding first para theyre saying doesnt support cancellation next para theyre giving directions cancel membership work english seems sus question trying scam note second image see times lite annual purchased january valid till january didnt even know back installed july th possible please help guys ",
    "cleaned_title": "need help times prime think scamming",
    "cleaned_selftext": "recently bought subscription times prime upon purchase saw something called times prime lite already activated purchased lite version option auto renewal since lite version active wait till january next year lite expires full wala activates question cancel lite membership tried didnt see option question way get support team saw way reach creating ticket useless support ever seen attached image reference asking help regarding first para theyre saying doesnt support cancellation next para theyre giving directions cancel membership work english seems sus question trying scam note second image see times lite annual purchased january valid till january didnt even know back installed july th possible please help guys",
    "cleaned_comments": "pay upidebit card based payment see payment subscription cancel side case credit card contact bank subscription really one time payment one year access prime features im even getting normal support im wondering give prime features disappointed man tried reply one time payment want cancel membership year already paid might headache resolve maybe threat contacting customer support agencies providing services promised literally email id phone number reach called number apparently number opt sms download app upon calling says thank disconnects call think number ask contact supposed give missed call try drop mail contact social media social media thing left try options dont work post taken post probably people dont experience specific issues facing dont want comment saw post grey wonderingthank help man honestly double check method payment confirm wont able deduct money try contact see cant get membership cancelled doesnt work write life lesson auto renewal purchases apple id setup instalment one time payment auto renewal",
    "light_cleaned_title": "Need some help with Times Prime, and i think they are scamming me.",
    "light_cleaned_selftext": "So i recently bought the subscription for times prime, upon purchase i saw that something called times prime lite was already activated, i have not purchased the lite version nor the option for any auto renewal was on. Since the lite version is active i have to wait till January next year so that the lite expires and the full wala activates. Question 1. Can i cancel the lite membership? As i tried to but didn’t see any option for it. Question 2. Is there any way to get to their support team as i saw that the only way to reach them is creating a ticket and its the most useless support i have ever seen. As i have attached an image for reference asking them to help me regarding the same but on the first para they’re saying - we “doesn’t” support cancellation after which in the next para they’re giving directions on how to cancel the membership which does not work. Their english itself seems very sus to me, Question 3: they trying to scam me? Note: the second image you can see times lite annual purchased on January 2023 valid till January 2024, i didn’t even know what this was back then and just installed this on July 6th 2023 so how is it possible. Please help guys..",
    "light_cleaned_comments": "How did you pay ? For UPI/debit card based payment you should see the payment subscription and can cancel from your side. In case of credit card you should contact your bank Its not a subscription really, its a one time payment for one year access to prime features…. I’m not even getting normal support I’m wondering how they will give prime features. :/ Very disappointed with it man.. I tried to reply to you ⬆️ If it is one time payment and you want to cancel your membership for the year you have already paid for then it might be headache to resolve. Maybe threat of contacting customer support agencies if they are not providing services they promised. They literally have no email id or phone number where i can reach them… I called that number but apparently its the number to opt out from SMS or download the app… upon calling it says “thank you” and then disconnects. When did you call ? I think this number is to ask them to contact you as you are supposed to give missed call. You can try to drop a mail and contact them on social media. Social media is the only thing left to try other options dont work, and is my post taken down? Post is up but probably most people don't have any experience with specific issues you are facing so don't want to comment. I saw the post as grey, was just wondering…thank for the help man Honestly double check your method of payment to confirm that they won't be able to deduct any more money, try to contact and see if you can't get membership cancelled and if it doesn't work then write it down an life lesson. Auto renewal is on, I do my purchases through apple ID and i have not setup any instalment, just a one time payment. Auto renewal is not on*"
}