{
    "id": "1dddiw0",
    "title": "Video of crowded Vande Bharat Express goes viral: 'Encroachment of now every train is complete'",
    "url": "https://www.moneycontrol.com/news/trends/vande-bharat-video-of-crowded-vande-bharat-express-goes-viral-encroachment-of-now-every-train-is-complete-12746000.html",
    "selftext": "And you wonder why we can't have nice things , while I am aware of such incidents in South India, most of the news reporting such incidents seem to come from North India only\n\nIs it really a North Indian phenomenon ",
    "flair": "Rant / Vent",
    "score": 263,
    "num_comments": 57,
    "created_utc": 1718110824.0,
    "convurl": "https://external-preview.redd.it/6YnCb7Qg8aU3jH23-3MvfuJyFMNWYycWYUk6C-p7o0s.jpg?auto=webp&s=be94796e29c86093ca3c005ba5c655840ec96991",
    "comments": [
        "BIMARU people and their fetish of treating Indian Railways like their home.",
        "The site expects a full NEET exam multiple choice to see content.",
        "Really no excuse. They had to Stop the train and get authorities to send everyone out. Or else refund the money for everyone who booked the tickets.",
        "Now, we will see the racist mentality of a few illiterates and unaware people who will blame people of certain states for all the issues. They won’t account for population density and the tracks per km and will try to throw irrational logics. \n\nThe Ministry of Railways should be blamed first for all the shit show. People can be blamed but not primarily. \n\nRailways have an entire police force called RPF responsible for maintaining law and order which doesn’t come under the ambit of any state governments. The hijacking of reserved coaches has become a routine occurrence only after the number of general and sleeper coaches have been reduced.",
        "……And here we go again! North vs South.\n\nIt’s INDIAN RAILWAYS last I checked!! Or have they split it to South Indian Railways & North Indian Railways.",
        "They are intentionally ruining the Indian Railways into a hellish, broken and incompetent mess so that when this government hands it over to the private sector the middle class will welcome it cheerfully.\n\nThe Indian Railways used to be a well-oiled, wonderfully managed operation not too long ago.",
        "If people just had two brain cells to blame the Ministry of Railways over this instead of blaming people, this problem wouldn’t have compounded to this extent. \n\nPeople can be blamed but not primarily.",
        "literally never happens in south India...just saying. It shouldn't be some herculean task to set a precedent and stop this.",
        "Country is filled with idiots bro. We have forgotten how to make the government accountable. Hate is the new trend.",
        "It's just true tho...I've never seen this happen down south and I traveled a lot by train around Telangana, Tamil nadu and kerala.",
        "Yes there should be severe checking and heavy fines. Increasing the ticket fares is also fine.\n\nEventually this is just gonna kick out the BIMARU people from the Indian Railways at the end of the day.",
        "Provisions and acts are already there. The issue is of implementation and taking accountability. Hope you can understand that. \n\nAnd one more thing, check the Indian railways sub, the problem is pan India and not restricted to some states only, though some people are just living in their fake superiority to conveniently ignore the truth.",
        "It has to do with behavior. Read a recent incident where one such ticketless person pushed the ticket checker from the running train to death.",
        "Check the Indian railways sub. You will get the reality check. \n\nThe issue is pan India now.",
        "Overcrowding in sleeper compartments by ticketless migrant laborer passengers have been the norm even during Pre-Modi days.\n\nNone of the affluent - social media- wielding 3rd AC travellers batted an eyelid then.\n\nNow 3rd AC has become the nee SL.\nAnd the said people are annoyed.",
        "Nope the railways was never a well managed organisation. I have been travelling in trains even before modi came to power. They were always incompetent.",
        "Stop blaming BIMARU people for everything. I'm from another state but I'm getting tired of this narrative.",
        "Rail mantri is shit. He is always busy in PR like his boss. He knows nothing except tweeting. ",
        "All the tricks are done to sell Railways to Adani.",
        "Not like today, you are a Chaddi chap Sanghi",
        "Lmao.",
        "Adani Rail, noiceee....",
        "Maybe the fucking government should start spending the taxpayer money on getting more trains and infrastructure to support the increasing population?!",
        "ok now dont normalize it.",
        "Before trains used to have 10 to 12 nonac reserved coaches and 5 to 6 general compartment coaches. And only 4 to 5 ac coaches. And it's True most people cannot afford ac trains. While now, most trains have been turned to ac and most more than half coaches are ac. Either government should reduce rate of ac coaches so that everyone can afford. Or change back to more number of general compartments and nonac coaches like it used to be....",
        "This is all intentional. So the government can sell the entire thing to Adani or Ambani. The current railways minister was not replaced in the upcoming cabinet for a reason.",
        "Travelling in trains for the first 25 years of my life. Never once did I see encroachment in 3rd AC on any lines connecting Delhi ,Mumbai,madhya Pradesh and Orissa.\n\nIt's not a question of whether encroachment existed , it's on how it has increased and how bad it has become now. People tolerated it back then , they don't now , not because of politics but because the scale of inconvenience has increased",
        "This never used to happen before. Railways were the one good thing we had, they fucked it up by decreasing the number of low cost seats on trains.",
        "Indian railways was never really well managed, but it would always have enough general or sleeper coaches to accommodate encroachers. Now, there aren't enough general or sleeper coaches so problems spiled to AC coaches, more premier trains like Vande Bharat. \n\nAfaik, there is already data to show that more AC coaches have been added at expense of sleeper/general coaches. Normal trains replaced with express or premier trains. If normal people don't have any option they will take risks and when those risks get rewarded as a single TT or security can't handle 10-12+ people, people will get used to it. You need to provide people better alternatives.",
        "What is bimaru?",
        "Acronym for the states of Bihar, Madhya Pradesh, Rajasthan, and Uttar Pradesh",
        "Please define will managed?? What exactly were the issues you faced before??",
        "It's better to blame the management and person in charge than the common man of the condition that the Indian railways currently has.",
        "I am sorry to correct you but Indian railways was the only government department which was not only better managed but well planned, over the years the condition has been made trash.",
        "Stop putting north south on everything. Dumbfuck OP",
        "Indian railways was never \"wonderfully managed\". Management was always shitty in some way or other.",
        "In south it does not happen…. But if it does happen, it’s because of people from BIMARU. They are the ones who spoil all the culture…. All corridors have been spat with paan… and so the list goes on",
        "I have lived in Hyderabad, Nagpur and Bangalore and my job was field work, so have travelled frequently to remote areas 200 km away from those cities. I am sure locals there also used to eat paan. I have seen people urinating on roads and being as whatever you blame other states people to be. \n\nYou should remove the blindfold you are having over your eyes and try to see the actual reality. The moment you use the “All” word, it just shows your ignorance and blind hatred.",
        "IIT & Wharton meritdhari railway minister.",
        "No way! Railways were never spectacular but these issues were rare and certainly something you wouldn't observe in 1AC, 2AC, and even 3AC clases... 3AC sometimes would have non ticket passengers but it was nowhere close to what it is these days. This is a direct result of the utter stupidity of reducing the count of general coaches....",
        "They probably want to move people away from using railways to using their own cars like west. That's why there are so many new highways are being built even though most people don't have their own cars.",
        "On point, its getting out of hands now, I always chose trains over travelling via bus, seems like AC bus is now the only option for managable distances like 700kms",
        "Only a matter of time before this happens on aircrafts: https://youtu.be/p9ALs5gPnvc?si=HHJdz-uYzqPr_KtW[Here](https://youtu.be/p9ALs5gPnvc?si=HHJdz-uYzqPr_KtW)",
        "Prafull Patel tactics copy paste from Air India.\n1. Force costly capex on the balance sheet. Increase debt and service cost.\n2. Destroy service quality, weaken strong networks with adverse decision making. \nWe are here now.\n3. Ruin mangement by pushing out non adhering staff.\n4. Stack up debt. Cry hoarse when debt servicing starts affecting normal operations.\n5. Hire a consulting company to turn around the business. \n6. Tell them to suggest selling the business in part or in full to private entities. \n7. Raise a quote which is high enough that no actual bidder makes a big. \n8. Do a second round at significant discount. \n9. Continue killing the service by hiving off essential features to send service in tailspin.\n10. Sell at a loss to public exchequer. \n11. Profit from private donation to bonds.\n\nWe will see how far they will get into these steps in NDA 3.",
        "\"that's why we should privatize railways\" \n\nI still dont understand why it's so difficult for govt to give same output as a private company",
        "Yes, you're right. Crowds were not seen in AC compartments but were always there in sleeper(reserved) compartments. As for hygiene and sanitation, nothing has changed."
    ],
    "cleaned_text": "video crowded vande bharat express goes viral encroachment every train complete wonder cant nice things aware incidents south india news reporting incidents seem come north india really north indian phenomenon ",
    "cleaned_title": "video crowded vande bharat express goes viral encroachment every train complete",
    "cleaned_selftext": "wonder cant nice things aware incidents south india news reporting incidents seem come north india really north indian phenomenon",
    "cleaned_comments": "bimaru people fetish treating indian railways like home site expects full neet exam multiple choice see content really excuse stop train get authorities send everyone else refund money everyone booked tickets see racist mentality illiterates unaware people blame people certain states issues wont account population density tracks per km try throw irrational logics ministry railways blamed first shit show people blamed primarily railways entire police force called rpf responsible maintaining law order doesnt come ambit state governments hijacking reserved coaches become routine occurrence number general sleeper coaches reduced go north vs south indian railways last checked split south indian railways north indian railways intentionally ruining indian railways hellish broken incompetent mess government hands private sector middle class welcome cheerfully indian railways used welloiled wonderfully managed operation long ago people two brain cells blame ministry railways instead blaming people problem wouldnt compounded extent people blamed primarily literally never happens south indiajust saying shouldnt herculean task set precedent stop country filled idiots bro forgotten make government accountable hate new trend true thoive never seen happen south traveled lot train around telangana tamil nadu kerala yes severe checking heavy fines increasing ticket fares also fine eventually gon na kick bimaru people indian railways end day provisions acts already issue implementation taking accountability hope understand one thing check indian railways sub problem pan india restricted states though people living fake superiority conveniently ignore truth behavior read recent incident one ticketless person pushed ticket checker running train death check indian railways sub get reality check issue pan india overcrowding sleeper compartments ticketless migrant laborer passengers norm even premodi days none affluent social media wielding rd ac travellers batted eyelid rd ac become nee sl said people annoyed nope railways never well managed organisation travelling trains even modi came power always incompetent stop blaming bimaru people everything im another state im getting tired narrative rail mantri shit always busy pr like boss knows nothing except tweeting tricks done sell railways adani like today chaddi chap sanghi lmao adani rail noiceee maybe fucking government start spending taxpayer money getting trains infrastructure support increasing population ok dont normalize trains used nonac reserved coaches general compartment coaches ac coaches true people afford ac trains trains turned ac half coaches ac either government reduce rate ac coaches everyone afford change back number general compartments nonac coaches like used intentional government sell entire thing adani ambani current railways minister replaced upcoming cabinet reason travelling trains first years life never see encroachment rd ac lines connecting delhi mumbaimadhya pradesh orissa question whether encroachment existed increased bad become people tolerated back dont politics scale inconvenience increased never used happen railways one good thing fucked decreasing number low cost seats trains indian railways never really well managed would always enough general sleeper coaches accommodate encroachers arent enough general sleeper coaches problems spiled ac coaches premier trains like vande bharat afaik already data show ac coaches added expense sleepergeneral coaches normal trains replaced express premier trains normal people dont option take risks risks get rewarded single tt security cant handle people people get used need provide people better alternatives bimaru acronym states bihar madhya pradesh rajasthan uttar pradesh please define managed exactly issues faced better blame management person charge common man condition indian railways currently sorry correct indian railways government department better managed well planned years condition made trash stop putting north south everything dumbfuck op indian railways never wonderfully managed management always shitty way south happen happen people bimaru ones spoil culture corridors spat paan list goes lived hyderabad nagpur bangalore job field work travelled frequently remote areas km away cities sure locals also used eat paan seen people urinating roads whatever blame states people remove blindfold eyes try see actual reality moment use word shows ignorance blind hatred iit wharton meritdhari railway minister way railways never spectacular issues rare certainly something wouldnt observe ac ac even ac clases ac sometimes would non ticket passengers nowhere close days direct result utter stupidity reducing count general coaches probably want move people away using railways using cars like west thats many new highways built even though people dont cars point getting hands always chose trains travelling via bus seems like ac bus option managable distances like kms matter time happens aircrafts prafull patel tactics copy paste air india force costly capex balance sheet increase debt service cost destroy service quality weaken strong networks adverse decision making ruin mangement pushing non adhering staff stack debt cry hoarse debt servicing starts affecting normal operations hire consulting company turn around business tell suggest selling business part full private entities raise quote high enough actual bidder makes big second round significant discount continue killing service hiving essential features send service tailspin sell loss public exchequer profit private donation bonds see far get steps nda thats privatize railways still dont understand difficult govt give output private company yes youre right crowds seen ac compartments always sleeperreserved compartments hygiene sanitation nothing changed",
    "light_cleaned_title": "Video of crowded Vande Bharat Express goes viral: 'Encroachment of now every train is complete'",
    "light_cleaned_selftext": "And you wonder why we can't have nice things , while I am aware of such incidents in South India, most of the news reporting such incidents seem to come from North India only Is it really a North Indian phenomenon",
    "light_cleaned_comments": "BIMARU people and their fetish of treating Indian Railways like their home. The site expects a full NEET exam multiple choice to see content. Really no excuse. They had to Stop the train and get authorities to send everyone out. Or else refund the money for everyone who booked the tickets. Now, we will see the racist mentality of a few illiterates and unaware people who will blame people of certain states for all the issues. They won’t account for population density and the tracks per km and will try to throw irrational logics. The Ministry of Railways should be blamed first for all the shit show. People can be blamed but not primarily. Railways have an entire police force called RPF responsible for maintaining law and order which doesn’t come under the ambit of any state governments. The hijacking of reserved coaches has become a routine occurrence only after the number of general and sleeper coaches have been reduced. ……And here we go again! North vs South. It’s INDIAN RAILWAYS last I checked!! Or have they split it to South Indian Railways & North Indian Railways. They are intentionally ruining the Indian Railways into a hellish, broken and incompetent mess so that when this government hands it over to the private sector the middle class will welcome it cheerfully. The Indian Railways used to be a well-oiled, wonderfully managed operation not too long ago. If people just had two brain cells to blame the Ministry of Railways over this instead of blaming people, this problem wouldn’t have compounded to this extent. People can be blamed but not primarily. literally never happens in south India...just saying. It shouldn't be some herculean task to set a precedent and stop this. Country is filled with idiots bro. We have forgotten how to make the government accountable. Hate is the new trend. It's just true tho...I've never seen this happen down south and I traveled a lot by train around Telangana, Tamil nadu and kerala. Yes there should be severe checking and heavy fines. Increasing the ticket fares is also fine. Eventually this is just gonna kick out the BIMARU people from the Indian Railways at the end of the day. Provisions and acts are already there. The issue is of implementation and taking accountability. Hope you can understand that. And one more thing, check the Indian railways sub, the problem is pan India and not restricted to some states only, though some people are just living in their fake superiority to conveniently ignore the truth. It has to do with behavior. Read a recent incident where one such ticketless person pushed the ticket checker from the running train to death. Check the Indian railways sub. You will get the reality check. The issue is pan India now. Overcrowding in sleeper compartments by ticketless migrant laborer passengers have been the norm even during Pre-Modi days. None of the affluent - social media- wielding 3rd AC travellers batted an eyelid then. Now 3rd AC has become the nee SL. And the said people are annoyed. Nope the railways was never a well managed organisation. I have been travelling in trains even before modi came to power. They were always incompetent. Stop blaming BIMARU people for everything. I'm from another state but I'm getting tired of this narrative. Rail mantri is shit. He is always busy in PR like his boss. He knows nothing except tweeting. All the tricks are done to sell Railways to Adani. Not like today, you are a Chaddi chap Sanghi Lmao. Adani Rail, noiceee.... Maybe the fucking government should start spending the taxpayer money on getting more trains and infrastructure to support the increasing population?! ok now dont normalize it. Before trains used to have 10 to 12 nonac reserved coaches and 5 to 6 general compartment coaches. And only 4 to 5 ac coaches. And it's True most people cannot afford ac trains. While now, most trains have been turned to ac and most more than half coaches are ac. Either government should reduce rate of ac coaches so that everyone can afford. Or change back to more number of general compartments and nonac coaches like it used to be.... This is all intentional. So the government can sell the entire thing to Adani or Ambani. The current railways minister was not replaced in the upcoming cabinet for a reason. Travelling in trains for the first 25 years of my life. Never once did I see encroachment in 3rd AC on any lines connecting Delhi ,Mumbai,madhya Pradesh and Orissa. It's not a question of whether encroachment existed , it's on how it has increased and how bad it has become now. People tolerated it back then , they don't now , not because of politics but because the scale of inconvenience has increased This never used to happen before. Railways were the one good thing we had, they fucked it up by decreasing the number of low cost seats on trains. Indian railways was never really well managed, but it would always have enough general or sleeper coaches to accommodate encroachers. Now, there aren't enough general or sleeper coaches so problems spiled to AC coaches, more premier trains like Vande Bharat. Afaik, there is already data to show that more AC coaches have been added at expense of sleeper/general coaches. Normal trains replaced with express or premier trains. If normal people don't have any option they will take risks and when those risks get rewarded as a single TT or security can't handle 10-12+ people, people will get used to it. You need to provide people better alternatives. What is bimaru? Acronym for the states of Bihar, Madhya Pradesh, Rajasthan, and Uttar Pradesh Please define will managed?? What exactly were the issues you faced before?? It's better to blame the management and person in charge than the common man of the condition that the Indian railways currently has. I am sorry to correct you but Indian railways was the only government department which was not only better managed but well planned, over the years the condition has been made trash. Stop putting north south on everything. Dumbfuck OP Indian railways was never \"wonderfully managed\". Management was always shitty in some way or other. In south it does not happen…. But if it does happen, it’s because of people from BIMARU. They are the ones who spoil all the culture…. All corridors have been spat with paan… and so the list goes on I have lived in Hyderabad, Nagpur and Bangalore and my job was field work, so have travelled frequently to remote areas 200 km away from those cities. I am sure locals there also used to eat paan. I have seen people urinating on roads and being as whatever you blame other states people to be. You should remove the blindfold you are having over your eyes and try to see the actual reality. The moment you use the “All” word, it just shows your ignorance and blind hatred. IIT & Wharton meritdhari railway minister. No way! Railways were never spectacular but these issues were rare and certainly something you wouldn't observe in 1AC, 2AC, and even 3AC clases... 3AC sometimes would have non ticket passengers but it was nowhere close to what it is these days. This is a direct result of the utter stupidity of reducing the count of general coaches.... They probably want to move people away from using railways to using their own cars like west. That's why there are so many new highways are being built even though most people don't have their own cars. On point, its getting out of hands now, I always chose trains over travelling via bus, seems like AC bus is now the only option for managable distances like 700kms Only a matter of time before this happens on aircrafts: Prafull Patel tactics copy paste from Air India. 1. Force costly capex on the balance sheet. Increase debt and service cost. 2. Destroy service quality, weaken strong networks with adverse decision making. We are here now. 3. Ruin mangement by pushing out non adhering staff. 4. Stack up debt. Cry hoarse when debt servicing starts affecting normal operations. 5. Hire a consulting company to turn around the business. 6. Tell them to suggest selling the business in part or in full to private entities. 7. Raise a quote which is high enough that no actual bidder makes a big. 8. Do a second round at significant discount. 9. Continue killing the service by hiving off essential features to send service in tailspin. 10. Sell at a loss to public exchequer. 11. Profit from private donation to bonds. We will see how far they will get into these steps in NDA 3. \"that's why we should privatize railways\" I still dont understand why it's so difficult for govt to give same output as a private company Yes, you're right. Crowds were not seen in AC compartments but were always there in sleeper(reserved) compartments. As for hygiene and sanitation, nothing has changed."
}