{
    "id": "17kk8ru",
    "title": "Potential state-sponsored surveillance of opposition leaders, among others | IFF's Statement",
    "url": "https://www.reddit.com/r/india/comments/17kk8ru/potential_statesponsored_surveillance_of/",
    "selftext": "https://preview.redd.it/r4sxrd45bjxb1.png?width=1600&format=png&auto=webp&s=27382279514cf40141bde98b14a9f139ce079e12\n\nShort Statement: Several MPs, including Priyanka Chaturvedi, Mahua Moitra, Shashi Tharoor, Supriya Shrinate, Sitaram Yechury, Pawan Khera, Raghav Chadha, Asaduddin Owaisi are potentially being targeted by state-sponsored attackers, as per an Apple threat notification received by them. \n\nThe potential use of such illegal and unlawful surveillance tools on political figures is antithetical to the democratic ideals of our country. Such reports suggesting government surveillance in the lead up to the general and several state elections is a further cause of concern. \n\nApple has reportedly stated that it does not attribute the threat notifications to any specific state-sponsored attacker & shared its inability to provide reasoning behind sending threat notifications, citing potential risk of such attackers evading detection in the future. \n\n[https://x.com/timesofindia/status/1719266794878476419](https://x.com/timesofindia/status/1719266794878476419?s=20)\n\nIn 2021, the alleged use of the Pegasus spyware by the Union government to surveil over 300 verified Indians, including ministers, opposition leaders, & journalists, was investigated by the committee of experts constituted by the Supreme Court (SC). \n\n[https://internetfreedom.in/iffs-statement-on-hacking-revelations-made-by-the-pegasus-project/](https://internetfreedom.in/iffs-statement-on-hacking-revelations-made-by-the-pegasus-project/) \n\nThe Committee report, shared with the SC in a sealed envelope, is yet to be available publicly. In light of these rising instances of such unethical & unlawful surveillance, the report must be made public, in the interest of transparency. \n\n[https://internetfreedom.in/pegasus-investigation-report-to-remain-in-sealed-cover-even-though-it-contains-evidence-that-5-phones-had-malware/](https://internetfreedom.in/pegasus-investigation-report-to-remain-in-sealed-cover-even-though-it-contains-evidence-that-5-phones-had-malware/) \n\nThe recent disclosures by MPs raises alarm & highlights the urgent need for surveillance reform. We urge the Indian Govt to reject the use of surveillance tech. There needs to be an impartial investigation to determine the source & extent of the potential attack. ",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698756512.0,
    "convurl": "https://external-preview.redd.it/93xKYuQk6nZFG70L-ulE1ODtL4wKuoH1kG0FpviTvWU.jpg?auto=webp&s=ec03025f0f2fff1a907783e3958d40a4a0d7a5f8",
    "comments": [],
    "cleaned_text": "potential statesponsored surveillance opposition leaders among others iffs statement short statement several mps including priyanka chaturvedi mahua moitra shashi tharoor supriya shrinate sitaram yechury pawan khera raghav chadha asaduddin owaisi potentially targeted statesponsored attackers per apple threat notification received potential use illegal unlawful surveillance tools political figures antithetical democratic ideals country reports suggesting government surveillance lead general several state elections cause concern apple reportedly stated attribute threat notifications specific statesponsored attacker shared inability provide reasoning behind sending threat notifications citing potential risk attackers evading detection future httpsxcomtimesofindiastatushttpsxcomtimesofindiastatuss alleged use pegasus spyware union government surveil verified indians including ministers opposition leaders journalists investigated committee experts constituted supreme court sc httpsinternetfreedominiffsstatementonhackingrevelationsmadebythepegasusprojecthttpsinternetfreedominiffsstatementonhackingrevelationsmadebythepegasusproject committee report shared sc sealed envelope yet available publicly light rising instances unethical unlawful surveillance report must made public interest transparency httpsinternetfreedominpegasusinvestigationreporttoremaininsealedcovereventhoughitcontainsevidencethatphoneshadmalwarehttpsinternetfreedominpegasusinvestigationreporttoremaininsealedcovereventhoughitcontainsevidencethatphoneshadmalware recent disclosures mps raises alarm highlights urgent need surveillance reform urge indian govt reject use surveillance tech needs impartial investigation determine source extent potential attack ",
    "cleaned_title": "potential statesponsored surveillance opposition leaders among others iffs statement",
    "cleaned_selftext": "short statement several mps including priyanka chaturvedi mahua moitra shashi tharoor supriya shrinate sitaram yechury pawan khera raghav chadha asaduddin owaisi potentially targeted statesponsored attackers per apple threat notification received potential use illegal unlawful surveillance tools political figures antithetical democratic ideals country reports suggesting government surveillance lead general several state elections cause concern apple reportedly stated attribute threat notifications specific statesponsored attacker shared inability provide reasoning behind sending threat notifications citing potential risk attackers evading detection future httpsxcomtimesofindiastatushttpsxcomtimesofindiastatuss alleged use pegasus spyware union government surveil verified indians including ministers opposition leaders journalists investigated committee experts constituted supreme court sc httpsinternetfreedominiffsstatementonhackingrevelationsmadebythepegasusprojecthttpsinternetfreedominiffsstatementonhackingrevelationsmadebythepegasusproject committee report shared sc sealed envelope yet available publicly light rising instances unethical unlawful surveillance report must made public interest transparency httpsinternetfreedominpegasusinvestigationreporttoremaininsealedcovereventhoughitcontainsevidencethatphoneshadmalwarehttpsinternetfreedominpegasusinvestigationreporttoremaininsealedcovereventhoughitcontainsevidencethatphoneshadmalware recent disclosures mps raises alarm highlights urgent need surveillance reform urge indian govt reject use surveillance tech needs impartial investigation determine source extent potential attack",
    "cleaned_comments": "",
    "light_cleaned_title": "Potential state-sponsored surveillance of opposition leaders, among others | IFF's Statement",
    "light_cleaned_selftext": "Short Statement: Several MPs, including Priyanka Chaturvedi, Mahua Moitra, Shashi Tharoor, Supriya Shrinate, Sitaram Yechury, Pawan Khera, Raghav Chadha, Asaduddin Owaisi are potentially being targeted by state-sponsored attackers, as per an Apple threat notification received by them. The potential use of such illegal and unlawful surveillance tools on political figures is antithetical to the democratic ideals of our country. Such reports suggesting government surveillance in the lead up to the general and several state elections is a further cause of concern. Apple has reportedly stated that it does not attribute the threat notifications to any specific state-sponsored attacker & shared its inability to provide reasoning behind sending threat notifications, citing potential risk of such attackers evading detection in the future. [https://x.com/timesofindia/status/1719266794878476419](https://x.com/timesofindia/status/1719266794878476419?s=20) In 2021, the alleged use of the Pegasus spyware by the Union government to surveil over 300 verified Indians, including ministers, opposition leaders, & journalists, was investigated by the committee of experts constituted by the Supreme Court (SC). [https://internetfreedom.in/iffs-statement-on-hacking-revelations-made-by-the-pegasus-project/](https://internetfreedom.in/iffs-statement-on-hacking-revelations-made-by-the-pegasus-project/) The Committee report, shared with the SC in a sealed envelope, is yet to be available publicly. In light of these rising instances of such unethical & unlawful surveillance, the report must be made public, in the interest of transparency. [https://internetfreedom.in/pegasus-investigation-report-to-remain-in-sealed-cover-even-though-it-contains-evidence-that-5-phones-had-malware/](https://internetfreedom.in/pegasus-investigation-report-to-remain-in-sealed-cover-even-though-it-contains-evidence-that-5-phones-had-malware/) The recent disclosures by MPs raises alarm & highlights the urgent need for surveillance reform. We urge the Indian Govt to reject the use of surveillance tech. There needs to be an impartial investigation to determine the source & extent of the potential attack.",
    "light_cleaned_comments": ""
}