{
    "id": "18r44lj",
    "title": "There's a loophole in our Consumer helpline system. The company (here AJIO) can just claim they had sent a correct product and easily close the complaint.",
    "url": "https://www.reddit.com/gallery/18r44lj",
    "selftext": "The first pic is the response from AJIO to the NCH (national consumer protection).\n\n- Here you can clearly see in the 2nd pic, the button is missing (hence an unfinished product). \n - In the 3rd pic (grey pants), the color is clearly fading from the crease. \n\n\nAfter getting frustrated with the AJIO customer care service, any helpless consumer would approach a higher authority. In this case NCH (consumer helpline).  \n\nHowever, as you can see the company can just claim they had sent a \"correct\" product and easily \"close\" the complaint. In the end, the helpless customer will forever remain vulnerable only.  \n\nNow my last option is to arrange a lawyer to litigate for paltry 1600 Rs. products... Day by day my hatred towards our system is increasing.",
    "flair": "Law & Courts",
    "score": 371,
    "num_comments": 56,
    "created_utc": 1703581629.0,
    "convurl": "https://i.redd.it/p5pzdhitul8c1.jpg",
    "comments": [
        "Ask them the detailed documentation of the investigation they have conducted. Let your lawyer communicate with them",
        "No buddy. Who will pay Rs. 5000 to an advocate for 2k. Rs products?  I fought hard for a week, but now my soul feels like giving up.",
        "Try tweeting about it. It should bring some attention and tag consumer helpline as well. Hope you get a resolution",
        "https://consumerhelpline.gov.in\nOr\n1800114000",
        "Coming to your second point - Nobody can communicate with their \"head\" team. The whole game by the \"telephone\" care is to contact their Email team. Later Email team will ask you to contact them via the \"telephone\" team.  \n\nIn other words, they are ready to play with your mind and energy.",
        "Already did that.  The **first** pic was the company's response to the consumer helpline.",
        "Call the number and ask them to reopen the case and you are unsatisfied with the response.\n\nMy man, I went against HDFC bank as well as TATA and won. You can choose to keep fighting against it.",
        "Already called them. They said your \"next\" option is to fight legally.",
        "Have you tried asking for escalation 🤔\n\nMost of the e commerce do xray scan only when dispatching the items\n\nThey cannot validate it via that and nch is of no use if company says correct item delivered then complaint will get closed and they won’t even submit proofs.",
        "That’s not a loophole, that is straight of lying and scamming. Please register a complaint with consumer forum.",
        "Bro please try to read properly.\n\nThe **first** pic is the response from the company to the Consumer forum itself.",
        "If you contact them via Email, you will be lucky if they contact you in 48 hours.\nThe whole experience is infuriating.",
        "Tweet on social media . Fuck these companies . I pretty much much restrict ordering form either customer centric platform like Amazon or just the brand website. Ajio and Myntra are doghsite with customer care",
        "Agree. A big waste of time and raising your BP ordering from such sites.",
        "Tweet about it by tagging them. Let the world know.\n\nTwitter is very useful for any complaint redressal mechanisms provided the company is responsive on Twitter.",
        "Their investigation is BS. They sent me used ladies pants instead of men's trousers. It came in a sealed Ajio bag. They refused to take it back and said they did their investigation and they sent me the correct product.\n\nI asked them to delete my account and I'm never buying from them again",
        "Thanks for stating your experience in support of this post.",
        "So you hate the system because it is working as intended?\n\nThe national consumer helpline doesn't have the power to force the company to agree to anything. They're there to help you escalate. Another level of serious notification to the company that the consumer isn't satisfied and give them a chance to rectify their mistake or place on record their justification.\n\nYou can use all of this documentation to file an actual case in the consumer court, where the magistrate will have the power to force the company through judgement.\n\nAnd yes the process is necessary to avoid frivolous complains.\n\nCheck how to file a consumer court complaint. You don't even need any legal learning. Just determination. You're likely to not only get your money back but also some extra amount in lieu of your time and effort.",
        "See my point is that half of the complaints won't even proceed further if in the first step itself the culpable company denies any claim of wrongdoing.",
        "Tweet about it tagging their CEO, their marketing head, Mr. Ambani also. \nDid the same for Myntra. Ladies shirt delivered instead of men's jacket, about 2k price differential, refused to take return (after sharing pics), closed case. Straightaway tweeted, within 2 hrs someone was on the phone with me, got replacement in 2 days.",
        "Sorry my bad.",
        "Just because Ajio replied that to the national consumer helpline does not mean it ends there. I had a similar issue with Jiomart where they blatantly said that I had requested for a refund outside of the return period and tried to close the issue then and there. I had proof that I had contacted Jiomart the very next day and I called up the national helpline and pointed out the attachment that proved my side and the helpline composed a reply back to Jiomart. \n\nIt was a back and forth process and went on for about a month but I did get my refund at the end. \n\nPersevere, follow up with the national helpline. Don't leave it at this.",
        "Trying to sort out with the company directly was the right first step. Consumer forum is the right second step. This forum, as you have found out is just a discussion and records platform. They don't actively mediate anything. The next options are:\n1. Issue chargeback if you used a credit card, or\n2. File a case on edaakhil.\n\nFor edaakhil, court fees etc should be nil, for such small claims. If not they usually get covered by the company if you've won. Also you don't need a lawyer. You can represent yourself. If you have a strong case, with all the evidence, and sufficient time and resources, go for it. If you don't, then this feeling of being cheated by the system will keep bringing you down. Don't let these companies turn you into a pushover.\n\nThis way, you'll also learn a bit more about the system. The system is only as effective as the people who belong to it and how they use it",
        "Exactly same issue with me",
        "You can file case on e court from the same link.",
        "OP, you need to raise the grievance again in this same portal explaining how you have received an unsatisfactory and false reply. \n\nKeep filing multiple grievances one after another, they'll ultimately give up and refund you. They'll do it because\n\n1) They're bound to reply within deadlines. \n2) Any reply that they give here will act as evidence which can later be used in the court against. \n\nI personally think just one more grievance here explaining their lies and how is against consumer protection acts and rules (Google and quote the relevant section), will do the case in your favour. \n\nIn the next grievance they'll be bound to explain how they're not lying and therefore they'll refund you. \n\nDon't give up here even it takes 6 months, and also because it's free of cost.",
        "Hope it gets resolved.",
        "Guess the consumer protection system won't do anything against ambani",
        "I had a similar issue dealing with Flipkart through consumerhelpline.gov - their agent would just close the case without any resolution.",
        "AJIO is owned by Ambani, against whom nothing can be done.",
        "Looks like it's true 🤯",
        "Used ladies panties ka ek apna hi market Hai. Will be worth more than your mens trouser. Post it online and see the demand.",
        "You have documents that they are denying the fact , you also have the wrong product, you can file an online complaint against them using the consumer forum online portal.",
        "Blud, the first pic shows the response from the company to the Consumer forum itself.",
        "Then file a rti, that what was the investigation and how they reached this conclusion. \n\nAlso you can escalate this in the consumer forum as grievances",
        "Does not work, consumer gets to only create ticket and then only company can comment. \n\nI called that number and even sent email, they asked me to file edaakil which is not an easy job",
        "Never buy from Flipkart and Ajio. Or any other e-commerce store either. India has zero customer protection, you are fucked.\n\nOnly Amazon or offline stores for me. Sorry buddy, this is a lesson learnt for you. Very frustrating for sure.",
        "Consumer Courts doesn't need a lawyer for representation. Use your Twitter and try to get a reply. Although I know any legal matter no matter how small, it is cumbersome and frustrating.",
        "Don't forget Flipkart. r/FuckFlipkart",
        "Ajio is a juta company. Aaj kal har kuch din main op jaise hi aam log aate hai is company ke karan online. Logo ko aur zyada yeh baat failane chaiye ki yeh company sain koi bhi saman na kharide",
        "The only correct answer here. People please use cc to buy items. If the item is defective and the company fucks you over just file a chargeback with your cc provider/bank. \nThe burden of proof gets shifted to the merchant and the banks always try to side with the customer and deal with all the formalities for you.",
        "Accept that Indian Govt consumer redressal is just a farce. The big companies also know this so they do not care about a consumer complaint.Anyway do you think that the current govt which is supported and run by oligarchs will really care for  the consumer, never. \n\nJust cut you losses and move on. Accept this as a tax of living in India. As a last ditch effort publish your case on social media and tag the company.\n\n\nI had a similar experience and approached a lawyer friend. He clearly told me to move on, said that you will never get justice in Indian courts given the resources these companies have.",
        "They didn’t send the product and closed the thread. Should I chargeback",
        "Never order anything from any Jio app. I HAVE suffered with my Sony Headphone.  Pani me gea paisa",
        "Forum just require them to send you a reply. It doesn't have to be a correct as this is a non biding forum",
        "That’s why they say be a shareholder of Reliance not a customer",
        "They blocked me on Twitter after my 1st attempt at mocking them.",
        "They blocked me on Twitter after my 1st attempt at mocking them.",
        "Lol they blocked me on Twitter after my 1st attempt at mocking them.",
        "Take screenshot of that and tag the consumer forum as well as local police station",
        "If you've started don't give up. Also don't put too much effort into it, you've clearly already lost but consider it doing a greater good for the community so they can't do it to others, or at least get the message that it can backfire. Treat it like a bi-weekly thing you have to check up on from time to time. If more people put even 1% effort in pursuing legal remedies than they do in their careers, society would be a much better place."
    ],
    "cleaned_text": "theres loophole consumer helpline system company ajio claim sent correct product easily close complaint first pic response ajio nch national consumer protection clearly see nd pic button missing hence unfinished product rd pic grey pants color clearly fading crease getting frustrated ajio customer care service helpless consumer would approach higher authority case nch consumer helpline however see company claim sent correct product easily close complaint end helpless customer forever remain vulnerable last option arrange lawyer litigate paltry rs products day day hatred towards system increasing ",
    "cleaned_title": "theres loophole consumer helpline system company ajio claim sent correct product easily close complaint",
    "cleaned_selftext": "first pic response ajio nch national consumer protection clearly see nd pic button missing hence unfinished product rd pic grey pants color clearly fading crease getting frustrated ajio customer care service helpless consumer would approach higher authority case nch consumer helpline however see company claim sent correct product easily close complaint end helpless customer forever remain vulnerable last option arrange lawyer litigate paltry rs products day day hatred towards system increasing",
    "cleaned_comments": "ask detailed documentation investigation conducted let lawyer communicate buddy pay rs advocate k rs products fought hard week soul feels like giving try tweeting bring attention tag consumer helpline well hope get resolution coming second point nobody communicate head team whole game telephone care contact email team later email team ask contact via telephone team words ready play mind energy already first pic companys response consumer helpline call number ask reopen case unsatisfied response man went hdfc bank well tata choose keep fighting already called said next option fight legally tried asking escalation e commerce xray scan dispatching items validate via nch use company says correct item delivered complaint get closed wont even submit proofs thats loophole straight lying scamming please register complaint consumer forum bro please try read properly first pic response company consumer forum contact via email lucky contact hours whole experience infuriating tweet social media fuck companies pretty much much restrict ordering form either customer centric platform like amazon brand website ajio myntra doghsite customer care agree big waste time raising bp ordering sites tweet tagging let world know twitter useful complaint redressal mechanisms provided company responsive twitter investigation bs sent used ladies pants instead mens trousers came sealed ajio bag refused take back said investigation sent correct product asked delete account im never buying thanks stating experience support post hate system working intended national consumer helpline doesnt power force company agree anything theyre help escalate another level serious notification company consumer isnt satisfied give chance rectify mistake place record justification use documentation file actual case consumer court magistrate power force company judgement yes process necessary avoid frivolous complains check file consumer court complaint dont even need legal learning determination youre likely get money back also extra amount lieu time effort see point half complaints wont even proceed first step culpable company denies claim wrongdoing tweet tagging ceo marketing head mr ambani also myntra ladies shirt delivered instead mens jacket k price differential refused take return sharing pics closed case straightaway tweeted within hrs someone phone got replacement days sorry bad ajio replied national consumer helpline mean ends similar issue jiomart blatantly said requested refund outside return period tried close issue proof contacted jiomart next day called national helpline pointed attachment proved side helpline composed reply back jiomart back forth process went month get refund end persevere follow national helpline dont leave trying sort company directly right first step consumer forum right second step forum found discussion records platform dont actively mediate anything next options issue chargeback used credit card file case edaakhil edaakhil court fees etc nil small claims usually get covered company youve also dont need lawyer represent strong case evidence sufficient time resources go dont feeling cheated system keep bringing dont let companies turn pushover way youll also learn bit system system effective people belong use exactly issue file case e court link op need raise grievance portal explaining received unsatisfactory false reply keep filing multiple grievances one another theyll ultimately give refund theyll theyre bound reply within deadlines reply give act evidence later used court personally think one grievance explaining lies consumer protection acts rules google quote relevant section case favour next grievance theyll bound explain theyre lying therefore theyll refund dont give even takes months also free cost hope gets resolved guess consumer protection system wont anything ambani similar issue dealing flipkart consumerhelplinegov agent would close case without resolution ajio owned ambani nothing done looks like true used ladies panties ka ek apna hi market hai worth mens trouser post online see demand documents denying fact also wrong product file online complaint using consumer forum online portal blud first pic shows response company consumer forum file rti investigation reached conclusion also escalate consumer forum grievances work consumer gets create ticket company comment called number even sent email asked file edaakil easy job never buy flipkart ajio ecommerce store either india zero customer protection fucked amazon offline stores sorry buddy lesson learnt frustrating sure consumer courts doesnt need lawyer representation use twitter try get reply although know legal matter matter small cumbersome frustrating dont forget flipkart rfuckflipkart ajio juta company aaj kal har kuch din main op jaise hi aam log aate hai company ke karan online logo ko aur zyada yeh baat failane chaiye ki yeh company sain koi bhi saman na kharide correct answer people please use cc buy items item defective company fucks file chargeback cc providerbank burden proof gets shifted merchant banks always try side customer deal formalities accept indian govt consumer redressal farce big companies also know care consumer complaintanyway think current govt supported run oligarchs really care consumer never cut losses move accept tax living india last ditch effort publish case social media tag company similar experience approached lawyer friend clearly told move said never get justice indian courts given resources companies didnt send product closed thread chargeback never order anything jio app suffered sony headphone pani gea paisa forum require send reply doesnt correct non biding forum thats say shareholder reliance customer blocked twitter st attempt mocking blocked twitter st attempt mocking lol blocked twitter st attempt mocking take screenshot tag consumer forum well local police station youve started dont give also dont put much effort youve clearly already lost consider greater good community cant others least get message backfire treat like biweekly thing check time time people put even effort pursuing legal remedies careers society would much better place",
    "light_cleaned_title": "There's a loophole in our Consumer helpline system. The company (here AJIO) can just claim they had sent a correct product and easily close the complaint.",
    "light_cleaned_selftext": "The first pic is the response from AJIO to the NCH (national consumer protection). - Here you can clearly see in the 2nd pic, the button is missing (hence an unfinished product). - In the 3rd pic (grey pants), the color is clearly fading from the crease. After getting frustrated with the AJIO customer care service, any helpless consumer would approach a higher authority. In this case NCH (consumer helpline). However, as you can see the company can just claim they had sent a \"correct\" product and easily \"close\" the complaint. In the end, the helpless customer will forever remain vulnerable only. Now my last option is to arrange a lawyer to litigate for paltry 1600 Rs. products... Day by day my hatred towards our system is increasing.",
    "light_cleaned_comments": "Ask them the detailed documentation of the investigation they have conducted. Let your lawyer communicate with them No buddy. Who will pay Rs. 5000 to an advocate for 2k. Rs products? I fought hard for a week, but now my soul feels like giving up. Try tweeting about it. It should bring some attention and tag consumer helpline as well. Hope you get a resolution Or 1800114000 Coming to your second point - Nobody can communicate with their \"head\" team. The whole game by the \"telephone\" care is to contact their Email team. Later Email team will ask you to contact them via the \"telephone\" team. In other words, they are ready to play with your mind and energy. Already did that. The **first** pic was the company's response to the consumer helpline. Call the number and ask them to reopen the case and you are unsatisfied with the response. My man, I went against HDFC bank as well as TATA and won. You can choose to keep fighting against it. Already called them. They said your \"next\" option is to fight legally. Have you tried asking for escalation 🤔 Most of the e commerce do xray scan only when dispatching the items They cannot validate it via that and nch is of no use if company says correct item delivered then complaint will get closed and they won’t even submit proofs. That’s not a loophole, that is straight of lying and scamming. Please register a complaint with consumer forum. Bro please try to read properly. The **first** pic is the response from the company to the Consumer forum itself. If you contact them via Email, you will be lucky if they contact you in 48 hours. The whole experience is infuriating. Tweet on social media . Fuck these companies . I pretty much much restrict ordering form either customer centric platform like Amazon or just the brand website. Ajio and Myntra are doghsite with customer care Agree. A big waste of time and raising your BP ordering from such sites. Tweet about it by tagging them. Let the world know. Twitter is very useful for any complaint redressal mechanisms provided the company is responsive on Twitter. Their investigation is BS. They sent me used ladies pants instead of men's trousers. It came in a sealed Ajio bag. They refused to take it back and said they did their investigation and they sent me the correct product. I asked them to delete my account and I'm never buying from them again Thanks for stating your experience in support of this post. So you hate the system because it is working as intended? The national consumer helpline doesn't have the power to force the company to agree to anything. They're there to help you escalate. Another level of serious notification to the company that the consumer isn't satisfied and give them a chance to rectify their mistake or place on record their justification. You can use all of this documentation to file an actual case in the consumer court, where the magistrate will have the power to force the company through judgement. And yes the process is necessary to avoid frivolous complains. Check how to file a consumer court complaint. You don't even need any legal learning. Just determination. You're likely to not only get your money back but also some extra amount in lieu of your time and effort. See my point is that half of the complaints won't even proceed further if in the first step itself the culpable company denies any claim of wrongdoing. Tweet about it tagging their CEO, their marketing head, Mr. Ambani also. Did the same for Myntra. Ladies shirt delivered instead of men's jacket, about 2k price differential, refused to take return (after sharing pics), closed case. Straightaway tweeted, within 2 hrs someone was on the phone with me, got replacement in 2 days. Sorry my bad. Just because Ajio replied that to the national consumer helpline does not mean it ends there. I had a similar issue with Jiomart where they blatantly said that I had requested for a refund outside of the return period and tried to close the issue then and there. I had proof that I had contacted Jiomart the very next day and I called up the national helpline and pointed out the attachment that proved my side and the helpline composed a reply back to Jiomart. It was a back and forth process and went on for about a month but I did get my refund at the end. Persevere, follow up with the national helpline. Don't leave it at this. Trying to sort out with the company directly was the right first step. Consumer forum is the right second step. This forum, as you have found out is just a discussion and records platform. They don't actively mediate anything. The next options are: 1. Issue chargeback if you used a credit card, or 2. File a case on edaakhil. For edaakhil, court fees etc should be nil, for such small claims. If not they usually get covered by the company if you've won. Also you don't need a lawyer. You can represent yourself. If you have a strong case, with all the evidence, and sufficient time and resources, go for it. If you don't, then this feeling of being cheated by the system will keep bringing you down. Don't let these companies turn you into a pushover. This way, you'll also learn a bit more about the system. The system is only as effective as the people who belong to it and how they use it Exactly same issue with me You can file case on e court from the same link. OP, you need to raise the grievance again in this same portal explaining how you have received an unsatisfactory and false reply. Keep filing multiple grievances one after another, they'll ultimately give up and refund you. They'll do it because 1) They're bound to reply within deadlines. 2) Any reply that they give here will act as evidence which can later be used in the court against. I personally think just one more grievance here explaining their lies and how is against consumer protection acts and rules (Google and quote the relevant section), will do the case in your favour. In the next grievance they'll be bound to explain how they're not lying and therefore they'll refund you. Don't give up here even it takes 6 months, and also because it's free of cost. Hope it gets resolved. Guess the consumer protection system won't do anything against ambani I had a similar issue dealing with Flipkart through consumerhelpline.gov - their agent would just close the case without any resolution. AJIO is owned by Ambani, against whom nothing can be done. Looks like it's true 🤯 Used ladies panties ka ek apna hi market Hai. Will be worth more than your mens trouser. Post it online and see the demand. You have documents that they are denying the fact , you also have the wrong product, you can file an online complaint against them using the consumer forum online portal. Blud, the first pic shows the response from the company to the Consumer forum itself. Then file a rti, that what was the investigation and how they reached this conclusion. Also you can escalate this in the consumer forum as grievances Does not work, consumer gets to only create ticket and then only company can comment. I called that number and even sent email, they asked me to file edaakil which is not an easy job Never buy from Flipkart and Ajio. Or any other e-commerce store either. India has zero customer protection, you are fucked. Only Amazon or offline stores for me. Sorry buddy, this is a lesson learnt for you. Very frustrating for sure. Consumer Courts doesn't need a lawyer for representation. Use your Twitter and try to get a reply. Although I know any legal matter no matter how small, it is cumbersome and frustrating. Don't forget Flipkart. r/FuckFlipkart Ajio is a juta company. Aaj kal har kuch din main op jaise hi aam log aate hai is company ke karan online. Logo ko aur zyada yeh baat failane chaiye ki yeh company sain koi bhi saman na kharide The only correct answer here. People please use cc to buy items. If the item is defective and the company fucks you over just file a chargeback with your cc provider/bank. The burden of proof gets shifted to the merchant and the banks always try to side with the customer and deal with all the formalities for you. Accept that Indian Govt consumer redressal is just a farce. The big companies also know this so they do not care about a consumer complaint.Anyway do you think that the current govt which is supported and run by oligarchs will really care for the consumer, never. Just cut you losses and move on. Accept this as a tax of living in India. As a last ditch effort publish your case on social media and tag the company. I had a similar experience and approached a lawyer friend. He clearly told me to move on, said that you will never get justice in Indian courts given the resources these companies have. They didn’t send the product and closed the thread. Should I chargeback Never order anything from any Jio app. I HAVE suffered with my Sony Headphone. Pani me gea paisa Forum just require them to send you a reply. It doesn't have to be a correct as this is a non biding forum That’s why they say be a shareholder of Reliance not a customer They blocked me on Twitter after my 1st attempt at mocking them. They blocked me on Twitter after my 1st attempt at mocking them. Lol they blocked me on Twitter after my 1st attempt at mocking them. Take screenshot of that and tag the consumer forum as well as local police station If you've started don't give up. Also don't put too much effort into it, you've clearly already lost but consider it doing a greater good for the community so they can't do it to others, or at least get the message that it can backfire. Treat it like a bi-weekly thing you have to check up on from time to time. If more people put even 1% effort in pursuing legal remedies than they do in their careers, society would be a much better place."
}