{
    "id": "1ezaujz",
    "title": "If the rapist is caught guilty, what then?",
    "url": "https://www.reddit.com/r/india/comments/1ezaujz/if_the_rapist_is_caught_guilty_what_then/",
    "selftext": "What happens if the rapists are caught anyways? \n\nBeing Hanged? The girl prolly had to face hours of pain of broken bones and bleedings out of various parts of her body before dying, and the worst the rapist is facing instant death? And if the girl does not die, what happens? She suffered so much , prolly damaged for life, maybe physically, but surely mentally.\n\nBeing imprisoned? For 10 years, 20, even lifetime is a good deal for the rapist. Day by day thinking I am paying for his food, living and other amenities through my taxes. The girl prolly begged him to stop, and now he is prolly laughing with his buddies and cracking jokes.\n\nGautam Gambhir (Ex-mayor of Delhi) also strived for fear of pain as a punishment letting the rapist face consequences not even imaginable to him. Treat him like an animal he is, boil him to death like a lobster, skin him alive like a goat. (Though not agreeing towards public executions as its a bad sight and prolly end up on social medias of small children)\n\nThe rapists should've him thumbs cut-off or have his nose cut-off and let him out in the open world. Let his thumbless / noseless mark him as a rapist for the whole world to see whenever he goes to a resto or buys a buss ticket. And give the same treatment to the girls who get caught in false allegations. For me false rape cases is even worse than rape .\n\nEven I have a sister, what if something happens to her then? I would be uneasy for my whole life that nothing happened to the guy that he is afraid off to his core while the girl was prolly horrified of the things which were gonna happen to her the moment she was grabbed by his arms\n\nIk nothing will happen, but I just wanted to rant it out, I barely post on reddit, but I really wanted to say this anonymously to someone\n\nhttps://preview.redd.it/p3xs993hjekd1.jpg?width=605&format=pjpg&auto=webp&s=c254e06e5c9a15bd89f585b6280d6b02407def90\n\n",
    "flair": "Rant / Vent",
    "score": 38,
    "num_comments": 38,
    "created_utc": 1724414238.0,
    "convurl": "https://b.thumbs.redditmedia.com/rBy3u2PCkvYUcwjU4cD6bM3WVxaSLXsEp0B7AJbhCOM.jpg",
    "comments": [
        "I’m very anti death penalty, and that extends to rape(as much as my emotions may disagree). A state which can’t be trusted to protect its women can’t be trusted to justly dole out barbaric punishment either.",
        "Capital punishment is required to instill the fear on these criminals. Else they would continue to commit such crimes or take it lightly",
        "A weak and spineless government doesn't have the power to punish anyone, forget the powerful. The hammer of justice only hits the weak and poor of this country.",
        "I'm all about rehabilitation of criminals but some crimes are just deserve a swift hammer of justice.",
        "This has been sufficiently discussed and without a doubt harsher punishment does not equal lesser r@pes. Only better sex education, change in mentality and better policing will lead to lesser r@pes.",
        ">For me false rape cases is even worse than rape .\n\n???? Both are horrible af, OP.  How can you say that false rape cases are worse than rape after writing how painful the incident must have been for the girl?",
        "A lot of you may disagree with me and may down vote. I don't agree with capital punishments or mob justices unless the whole system is collapsed and you have to take up arms and fight.\n\n\nFirst of all the crime has happened and there's no way anyone can do anything to change it. I would to see prisons as correction facilities rather than a torture house or something, where you give a chance to the culprit realise his wrong doings  and make him repay to the society through his services in jail.\n\n\nCapital punishments will only instill fear, and may prevent the crime rate to some extent only because people are afraid of the consequences not because of the understanding that it is wrong to do something like that.\n\n\nWe have to understand why a crime like r*pe happens especially in our society. It has to do with objectification of women, sex deprivation, abuse of power, humiliating other sex, porn addiction and unequal status of women in our society, etc. If you really want to see changes, then we have to change this mindset. Majority of people (both men and women) still don't understand what r*pe does to a victim and how grave that crime is otherwise there won't be any victim shaming in this country.\n\n\nThere are two things the state can do: 1) provide a complete support and rehabilitation of the victim and make laws against ostracization of victims by society.\n2) Regarding the culprits, increase jail time and during their jail time put them under some kind of rehabilitation program as well.",
        "OP would u rather have a false rape case put on you pr be raped (brutally) by a man who is much stronger than you? Answer quick",
        "Exactly this. We should rather, as OP said, try to give them pain",
        "If Capital punishment is given ,then How can Politician support Rapist?",
        "Just replying here, i am sorry about comparing the false rape case being worse than rape case. Some comments pointed it out and i cant reply to all because of my exam tomorrow.\nBut just that I said it from my pov, I would never rape or even touch a girl without her consent, so I have a fear of a false case destroying my career. I should've seen it from a girl's pov.",
        "Prove it. Prove that the death penalty acts as a deterrent. Then suggest it to others. Why should we bother hearing nonsense without any evidence ?",
        "True, but more than half of the politicians have active criminal cases, will they pass any such law? We need a complete reboot.",
        "Judah's Cradle",
        "Life imprisonment until he is released on Independence day as a celebration and paid respect to on stage by political leaders!",
        "Pain is barbaric punishment. I’m assuming you mean some variation of torture?\n\nWe should just keep these prisoners fed (to their min required calories) and kept away from society. Nothing more, nothing less",
        "Then you aren’t for rehabilitation. This is just cognitive dissonance",
        "Chemical castration for dogs is who cannot control their desires :)",
        "bhai eak movi hai \"gulab gang\" kar kay uss mea eak scene hai pehel vo karo fir 1din bad execute",
        "True, killing/torturing them doesn’t actually solve the rape problem in india. Most people who rape are not educated and are not doing financially good . India has a long way to go in solving the financial problem of the poor but we atleast can run mass ads for consent and sex education .",
        "Prevention is better than cure  \nDacoit is worse than chor",
        "Jail for them\n\nThe lost life would never come back",
        "Biryani",
        "But i believe they should be made to realise how much pain the woman had endured. And hence teaching them to develop empathy. But somewhere i feel this is a lost cause against rapists. Because if you would have seen the nirbhaya interview, you would have realised these people are beyond any goodness and there's nothing you can do to instill empathy in them. So ig its just fair that they endure the pain. And mainly there should be a change in society. If you might have followed the recent badlapur case, the police literally did not accept to file an FIR. The protectors of law blame the victims instead of helping them. There should also be a background check on people who are elected for influential positions. And mainly changing the mindset of people and atleast create a comfortable system which has swift prosecution and one which doesnt blame the victim. These are long term solutions though. Atleast for now, what we can do is instill fear in the hearts of these rapists . Also in prospective ones.",
        "When I see these, I realize the animal lives within us. I can tell you the reason I do not go around inflicting violence is the same reason why I find it difficult to inflict such violence on an accused. I also strongly believe someone who wants to boil a criminal alive would also not find much hesitation in inflicting pain on any innocent person too. \n\nA society or a government should not become torturers and killers. That is a short cut and easy way out. It treats the symptom but not the disease. Meaningful changes are harder to bring in but those are the changes that drives us forward as a just society.\n\nJustice is not retribution to make us happy. Justice is making sure an aggrieved victim party has the recourse to law and law enforcement to find the truth and take corrective action.",
        "I am a bit conflicted on this issue, although I would prefer stringent and authoritative action against the perpetrator, which equates with the gravity of the crime. I do believe in the possibility of redemption and a second chance at a normal life in society.\n\nThis would, of course, depend on the severity of the crime, past convictions, and level of remorse displayed. Although this may be arbitrary, I do think that rehabilitation and psychological help are not solutions that can or should be dismissed completely. \n\nTo conclude, this is a very complex and challenging issue with many differing viewpoints and reasonings. It would ultimately be an issue of ethics, morals, and our own sense of justice. It should be an amalgamation of both retribution and attrition coupled with promoting a safe environment and protection of civil rights and liberties of the affected.",
        "The state will be protecting its women by instilling fear of pain",
        "Then they will resolve to sexual assault by other means like inserting objects.",
        "Excuse me sir, rape is no way a sign of any civility. For a BARBARIC ACT, needs a BARBARIC punishment. \n\nAgree with what OP said, the lives of countless girls are getting wiped out in this country every hour or even more, as we speak. There is no slowing down these monsters. \n\n\nSo the only way is to instill FEAR in their minds so they think a 1000 times before they can even eve-tease a girl, let alone these heinous crimes.",
        "The pain isn't of the one who died, but the loved ones who stay back. The life has been lost, at least we can make some of the pain of their loved ones go away by serving the justice the rapist deserves",
        "Studies show fear/harsh treatment against inmates will not lower the crime rate infact they increase the repeated offenders",
        "Civil society can push them to act and pass such laws. All of us have to own it up and act on it. Am sure things will change for the better going forward.",
        "Yes sir, but imagine you loved ur daughter whole life and suddenly this happens man, as a pare t you would be shook. \n\nNo one can imagine that pain. \n\nLife is unfair sir.",
        "Winds of change propelled by civil society can force such a change.",
        "Not only do I not trust the Indian government to torture the right people, barbarous punishment is an expense on the state for the possibility of keeping people in check through terror. It won’t fix anything, it’s a bandaid solution to shit culture",
        "You bring up a problem of ineffectual policing and think torture is the solution?",
        "How do you know that fear will stop them?",
        "Yeah. For the short term. Maybe after effective policing, we can stop it.",
        "We have given out death sentences to rape and murder cases. But that didn't always turn out very good.\n\nLook up the Hetal Parekh murder case. The house help was hanged on the basis of circumstantial evidence, and there's still debate on the correctness of the judgement."
    ],
    "cleaned_text": "rapist caught guilty happens rapists caught anyways hanged girl prolly face hours pain broken bones bleedings various parts body dying worst rapist facing instant death girl die happens suffered much prolly damaged life maybe physically surely mentally imprisoned years even lifetime good deal rapist day day thinking paying food living amenities taxes girl prolly begged stop prolly laughing buddies cracking jokes gautam gambhir exmayor delhi also strived fear pain punishment letting rapist face consequences even imaginable treat like animal boil death like lobster skin alive like goat though agreeing towards public executions bad sight prolly end social medias small children rapists shouldve thumbs cutoff nose cutoff let open world let thumbless noseless mark rapist whole world see whenever goes resto buys buss ticket give treatment girls get caught false allegations false rape cases even worse rape even sister something happens would uneasy whole life nothing happened guy afraid core girl prolly horrified things gon na happen moment grabbed arms ik nothing happen wanted rant barely post reddit really wanted say anonymously someone ",
    "cleaned_title": "rapist caught guilty",
    "cleaned_selftext": "happens rapists caught anyways hanged girl prolly face hours pain broken bones bleedings various parts body dying worst rapist facing instant death girl die happens suffered much prolly damaged life maybe physically surely mentally imprisoned years even lifetime good deal rapist day day thinking paying food living amenities taxes girl prolly begged stop prolly laughing buddies cracking jokes gautam gambhir exmayor delhi also strived fear pain punishment letting rapist face consequences even imaginable treat like animal boil death like lobster skin alive like goat though agreeing towards public executions bad sight prolly end social medias small children rapists shouldve thumbs cutoff nose cutoff let open world let thumbless noseless mark rapist whole world see whenever goes resto buys buss ticket give treatment girls get caught false allegations false rape cases even worse rape even sister something happens would uneasy whole life nothing happened guy afraid core girl prolly horrified things gon na happen moment grabbed arms ik nothing happen wanted rant barely post reddit really wanted say anonymously someone",
    "cleaned_comments": "im anti death penalty extends rapeas much emotions may disagree state cant trusted protect women cant trusted justly dole barbaric punishment either capital punishment required instill fear criminals else would continue commit crimes take lightly weak spineless government doesnt power punish anyone forget powerful hammer justice hits weak poor country im rehabilitation criminals crimes deserve swift hammer justice sufficiently discussed without doubt harsher punishment equal lesser rpes better sex education change mentality better policing lead lesser rpes false rape cases even worse rape horrible af op say false rape cases worse rape writing painful incident must girl lot may disagree may vote dont agree capital punishments mob justices unless whole system collapsed take arms fight first crime happened theres way anyone anything change would see prisons correction facilities rather torture house something give chance culprit realise wrong doings make repay society services jail capital punishments instill fear may prevent crime rate extent people afraid consequences understanding wrong something like understand crime like rpe happens especially society objectification women sex deprivation abuse power humiliating sex porn addiction unequal status women society etc really want see changes change mindset majority people men women still dont understand rpe victim grave crime otherwise wont victim shaming country two things state provide complete support rehabilitation victim make laws ostracization victims society regarding culprits increase jail time jail time put kind rehabilitation program well op would u rather false rape case put pr raped brutally man much stronger answer quick exactly rather op said try give pain capital punishment given politician support rapist replying sorry comparing false rape case worse rape case comments pointed cant reply exam tomorrow said pov would never rape even touch girl without consent fear false case destroying career shouldve seen girls pov prove prove death penalty acts deterrent suggest others bother hearing nonsense without evidence true half politicians active criminal cases pass law need complete reboot judahs cradle life imprisonment released independence day celebration paid respect stage political leaders pain barbaric punishment im assuming mean variation torture keep prisoners fed min required calories kept away society nothing nothing less arent rehabilitation cognitive dissonance chemical castration dogs control desires bhai eak movi hai gulab gang kar kay uss mea eak scene hai pehel vo karo fir din bad execute true killingtorturing doesnt actually solve rape problem india people rape educated financially good india long way go solving financial problem poor atleast run mass ads consent sex education prevention better cure dacoit worse chor jail lost life would never come back biryani believe made realise much pain woman endured hence teaching develop empathy somewhere feel lost cause rapists would seen nirbhaya interview would realised people beyond goodness theres nothing instill empathy ig fair endure pain mainly change society might followed recent badlapur case police literally accept file fir protectors law blame victims instead helping also background check people elected influential positions mainly changing mindset people atleast create comfortable system swift prosecution one doesnt blame victim long term solutions though atleast instill fear hearts rapists also prospective ones see realize animal lives within us tell reason go around inflicting violence reason find difficult inflict violence accused also strongly believe someone wants boil criminal alive would also find much hesitation inflicting pain innocent person society government become torturers killers short cut easy way treats symptom disease meaningful changes harder bring changes drives us forward society justice retribution make us happy justice making sure aggrieved victim party recourse law law enforcement find truth take corrective action bit conflicted issue although would prefer stringent authoritative action perpetrator equates gravity crime believe possibility redemption second chance normal life society would course depend severity crime past convictions level remorse displayed although may arbitrary think rehabilitation psychological help solutions dismissed completely conclude complex challenging issue many differing viewpoints reasonings would ultimately issue ethics morals sense justice amalgamation retribution attrition coupled promoting safe environment protection civil rights liberties affected state protecting women instilling fear pain resolve sexual assault means like inserting objects excuse sir rape way sign civility barbaric act needs barbaric punishment agree op said lives countless girls getting wiped country every hour even speak slowing monsters way instill fear minds think times even evetease girl let alone heinous crimes pain isnt one died loved ones stay back life lost least make pain loved ones go away serving justice rapist deserves studies show fearharsh treatment inmates lower crime rate infact increase repeated offenders civil society push act pass laws us act sure things change better going forward yes sir imagine loved ur daughter whole life suddenly happens man pare would shook one imagine pain life unfair sir winds change propelled civil society force change trust indian government torture right people barbarous punishment expense state possibility keeping people check terror wont fix anything bandaid solution shit culture bring problem ineffectual policing think torture solution know fear stop yeah short term maybe effective policing stop given death sentences rape murder cases didnt always turn good look hetal parekh murder case house help hanged basis circumstantial evidence theres still debate correctness judgement",
    "light_cleaned_title": "If the rapist is caught guilty, what then?",
    "light_cleaned_selftext": "What happens if the rapists are caught anyways? Being Hanged? The girl prolly had to face hours of pain of broken bones and bleedings out of various parts of her body before dying, and the worst the rapist is facing instant death? And if the girl does not die, what happens? She suffered so much , prolly damaged for life, maybe physically, but surely mentally. Being imprisoned? For 10 years, 20, even lifetime is a good deal for the rapist. Day by day thinking I am paying for his food, living and other amenities through my taxes. The girl prolly begged him to stop, and now he is prolly laughing with his buddies and cracking jokes. Gautam Gambhir (Ex-mayor of Delhi) also strived for fear of pain as a punishment letting the rapist face consequences not even imaginable to him. Treat him like an animal he is, boil him to death like a lobster, skin him alive like a goat. (Though not agreeing towards public executions as its a bad sight and prolly end up on social medias of small children) The rapists should've him thumbs cut-off or have his nose cut-off and let him out in the open world. Let his thumbless / noseless mark him as a rapist for the whole world to see whenever he goes to a resto or buys a buss ticket. And give the same treatment to the girls who get caught in false allegations. For me false rape cases is even worse than rape . Even I have a sister, what if something happens to her then? I would be uneasy for my whole life that nothing happened to the guy that he is afraid off to his core while the girl was prolly horrified of the things which were gonna happen to her the moment she was grabbed by his arms Ik nothing will happen, but I just wanted to rant it out, I barely post on reddit, but I really wanted to say this anonymously to someone",
    "light_cleaned_comments": "I’m very anti death penalty, and that extends to rape(as much as my emotions may disagree). A state which can’t be trusted to protect its women can’t be trusted to justly dole out barbaric punishment either. Capital punishment is required to instill the fear on these criminals. Else they would continue to commit such crimes or take it lightly A weak and spineless government doesn't have the power to punish anyone, forget the powerful. The hammer of justice only hits the weak and poor of this country. I'm all about rehabilitation of criminals but some crimes are just deserve a swift hammer of justice. This has been sufficiently discussed and without a doubt harsher punishment does not equal lesser r@pes. Only better sex education, change in mentality and better policing will lead to lesser r@pes. >For me false rape cases is even worse than rape . ???? Both are horrible af, OP. How can you say that false rape cases are worse than rape after writing how painful the incident must have been for the girl? A lot of you may disagree with me and may down vote. I don't agree with capital punishments or mob justices unless the whole system is collapsed and you have to take up arms and fight. First of all the crime has happened and there's no way anyone can do anything to change it. I would to see prisons as correction facilities rather than a torture house or something, where you give a chance to the culprit realise his wrong doings and make him repay to the society through his services in jail. Capital punishments will only instill fear, and may prevent the crime rate to some extent only because people are afraid of the consequences not because of the understanding that it is wrong to do something like that. We have to understand why a crime like r*pe happens especially in our society. It has to do with objectification of women, sex deprivation, abuse of power, humiliating other sex, porn addiction and unequal status of women in our society, etc. If you really want to see changes, then we have to change this mindset. Majority of people (both men and women) still don't understand what r*pe does to a victim and how grave that crime is otherwise there won't be any victim shaming in this country. There are two things the state can do: 1) provide a complete support and rehabilitation of the victim and make laws against ostracization of victims by society. 2) Regarding the culprits, increase jail time and during their jail time put them under some kind of rehabilitation program as well. OP would u rather have a false rape case put on you pr be raped (brutally) by a man who is much stronger than you? Answer quick Exactly this. We should rather, as OP said, try to give them pain If Capital punishment is given ,then How can Politician support Rapist? Just replying here, i am sorry about comparing the false rape case being worse than rape case. Some comments pointed it out and i cant reply to all because of my exam tomorrow. But just that I said it from my pov, I would never rape or even touch a girl without her consent, so I have a fear of a false case destroying my career. I should've seen it from a girl's pov. Prove it. Prove that the death penalty acts as a deterrent. Then suggest it to others. Why should we bother hearing nonsense without any evidence ? True, but more than half of the politicians have active criminal cases, will they pass any such law? We need a complete reboot. Judah's Cradle Life imprisonment until he is released on Independence day as a celebration and paid respect to on stage by political leaders! Pain is barbaric punishment. I’m assuming you mean some variation of torture? We should just keep these prisoners fed (to their min required calories) and kept away from society. Nothing more, nothing less Then you aren’t for rehabilitation. This is just cognitive dissonance Chemical castration for dogs is who cannot control their desires :) bhai eak movi hai \"gulab gang\" kar kay uss mea eak scene hai pehel vo karo fir 1din bad execute True, killing/torturing them doesn’t actually solve the rape problem in india. Most people who rape are not educated and are not doing financially good . India has a long way to go in solving the financial problem of the poor but we atleast can run mass ads for consent and sex education . Prevention is better than cure Dacoit is worse than chor Jail for them The lost life would never come back Biryani But i believe they should be made to realise how much pain the woman had endured. And hence teaching them to develop empathy. But somewhere i feel this is a lost cause against rapists. Because if you would have seen the nirbhaya interview, you would have realised these people are beyond any goodness and there's nothing you can do to instill empathy in them. So ig its just fair that they endure the pain. And mainly there should be a change in society. If you might have followed the recent badlapur case, the police literally did not accept to file an FIR. The protectors of law blame the victims instead of helping them. There should also be a background check on people who are elected for influential positions. And mainly changing the mindset of people and atleast create a comfortable system which has swift prosecution and one which doesnt blame the victim. These are long term solutions though. Atleast for now, what we can do is instill fear in the hearts of these rapists . Also in prospective ones. When I see these, I realize the animal lives within us. I can tell you the reason I do not go around inflicting violence is the same reason why I find it difficult to inflict such violence on an accused. I also strongly believe someone who wants to boil a criminal alive would also not find much hesitation in inflicting pain on any innocent person too. A society or a government should not become torturers and killers. That is a short cut and easy way out. It treats the symptom but not the disease. Meaningful changes are harder to bring in but those are the changes that drives us forward as a just society. Justice is not retribution to make us happy. Justice is making sure an aggrieved victim party has the recourse to law and law enforcement to find the truth and take corrective action. I am a bit conflicted on this issue, although I would prefer stringent and authoritative action against the perpetrator, which equates with the gravity of the crime. I do believe in the possibility of redemption and a second chance at a normal life in society. This would, of course, depend on the severity of the crime, past convictions, and level of remorse displayed. Although this may be arbitrary, I do think that rehabilitation and psychological help are not solutions that can or should be dismissed completely. To conclude, this is a very complex and challenging issue with many differing viewpoints and reasonings. It would ultimately be an issue of ethics, morals, and our own sense of justice. It should be an amalgamation of both retribution and attrition coupled with promoting a safe environment and protection of civil rights and liberties of the affected. The state will be protecting its women by instilling fear of pain Then they will resolve to sexual assault by other means like inserting objects. Excuse me sir, rape is no way a sign of any civility. For a BARBARIC ACT, needs a BARBARIC punishment. Agree with what OP said, the lives of countless girls are getting wiped out in this country every hour or even more, as we speak. There is no slowing down these monsters. So the only way is to instill FEAR in their minds so they think a 1000 times before they can even eve-tease a girl, let alone these heinous crimes. The pain isn't of the one who died, but the loved ones who stay back. The life has been lost, at least we can make some of the pain of their loved ones go away by serving the justice the rapist deserves Studies show fear/harsh treatment against inmates will not lower the crime rate infact they increase the repeated offenders Civil society can push them to act and pass such laws. All of us have to own it up and act on it. Am sure things will change for the better going forward. Yes sir, but imagine you loved ur daughter whole life and suddenly this happens man, as a pare t you would be shook. No one can imagine that pain. Life is unfair sir. Winds of change propelled by civil society can force such a change. Not only do I not trust the Indian government to torture the right people, barbarous punishment is an expense on the state for the possibility of keeping people in check through terror. It won’t fix anything, it’s a bandaid solution to shit culture You bring up a problem of ineffectual policing and think torture is the solution? How do you know that fear will stop them? Yeah. For the short term. Maybe after effective policing, we can stop it. We have given out death sentences to rape and murder cases. But that didn't always turn out very good. Look up the Hetal Parekh murder case. The house help was hanged on the basis of circumstantial evidence, and there's still debate on the correctness of the judgement."
}