{
    "id": "1er07m5",
    "title": "Picture speaks😎",
    "url": "https://www.reddit.com/gallery/1er07m5",
    "selftext": "So a scammer tried to scam me… asked me my Aadhar and picture for getting gate pass to his flat visit (I am looking for rental flat)… so I felt fishy. Inserted url in the image and sent him two pics. Man clicked those pic and I got his ip.\n\nSoon he got the images he asked me 2000, which I refused and After me abusing him for being scammer, he tried to blackmail me- and then😎\n",
    "flair": "Crime",
    "score": 5,
    "num_comments": 5,
    "created_utc": 1723527903.0,
    "convurl": "https://i.redd.it/l1y1c19bddid1.jpg",
    "comments": [
        "Heckar hai Bhai heckar hai",
        "How did u get his ip???",
        "Sent a picture - which has embedded hidden links in it… so if he clicks it- and views it, there will be small redirection to google or so, but we will get his ip!"
    ],
    "cleaned_text": "picture speaks scammer tried scam asked aadhar picture getting gate pass flat visit looking rental flat felt fishy inserted url image sent two pics man clicked pic got ip soon got images asked refused abusing scammer tried blackmail ",
    "cleaned_title": "picture speaks",
    "cleaned_selftext": "scammer tried scam asked aadhar picture getting gate pass flat visit looking rental flat felt fishy inserted url image sent two pics man clicked pic got ip soon got images asked refused abusing scammer tried blackmail",
    "cleaned_comments": "heckar hai bhai heckar hai u get ip sent picture embedded hidden links clicks views small redirection google get ip",
    "light_cleaned_title": "Picture speaks😎",
    "light_cleaned_selftext": "So a scammer tried to scam me… asked me my Aadhar and picture for getting gate pass to his flat visit (I am looking for rental flat)… so I felt fishy. Inserted url in the image and sent him two pics. Man clicked those pic and I got his ip. Soon he got the images he asked me 2000, which I refused and After me abusing him for being scammer, he tried to blackmail me- and then😎",
    "light_cleaned_comments": "Heckar hai Bhai heckar hai How did u get his ip??? Sent a picture - which has embedded hidden links in it… so if he clicks it- and views it, there will be small redirection to google or so, but we will get his ip!"
}