{
    "id": "1h0yu48",
    "title": "From a republic to a republic of unequals",
    "url": "https://www.thehindu.com/opinion/lead/from-a-republic-to-a-republic-of-unequals/article68913929.ece",
    "selftext": "The neoliberal ideological order shadows the constitutional vision of creating an egalitarian social order in India.\n\nThe article is written by Venkatanarayanan Sethuraman who is Associate Professor and Head of the Department of International Studies, Political Science and History at Christ University, Bengaluru. The views expressed are personal.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1732692196.0,
    "convurl": "https://external-preview.redd.it/zvzs4bJdaC1Eg7r-ZqCl6C6fFUJIiMvJUzS5SpDy6FY.jpg?auto=webp&s=c1a9fceadc6c987d65cef7987fa9b03835cc6f50",
    "comments": [
        "Lucas Chancel and Thomas Piketty from the Paris School of Economics have documented the rising inequality in India in their work, “Indian Income Inequality, 1922-2015: From British Raj to Billionaire Raj?” (2019).\n\nTheir research shows that the top 1% of earners had a share of less than 21% of total income in the 1930s. But after Independence, due to welfare state intervention, based on constitutional ideology, this gap reduced where the top 1% earners had a share of 6% of the total income in the 1980s.\n\nThey reiterated this inequality status in their recent research in 2024 emphasising that the top 1% of income and wealth shares have reached 22.6% and 40.1% by 2022-23, which is considered very high.",
        "This is a real problem and we don't even need sophisticated research to understand how unequal our society is becoming day by day. India seriously needs drastic measures to check it, otherwise we will go the US way. ",
        "The people who should realize this they're unbothered. They're the ones who write \"Proud Indian\" when they see Indians on the World's Billionaire List. They're least bothered about their own financial situation. Government is busy fueling the vague proud that India is going to become third largest economy in the world but doesn't give required attention to the growing income and wealth inequality in the country."
    ],
    "cleaned_text": "republic republic unequals neoliberal ideological order shadows constitutional vision creating egalitarian social order india article written venkatanarayanan sethuraman associate professor head department international studies political science history christ university bengaluru views expressed personal ",
    "cleaned_title": "republic republic unequals",
    "cleaned_selftext": "neoliberal ideological order shadows constitutional vision creating egalitarian social order india article written venkatanarayanan sethuraman associate professor head department international studies political science history christ university bengaluru views expressed personal",
    "cleaned_comments": "lucas chancel thomas piketty paris school economics documented rising inequality india work indian income inequality british raj billionaire raj research shows top earners share less total income independence due welfare state intervention based constitutional ideology gap reduced top earners share total income reiterated inequality status recent research emphasising top income wealth shares reached considered high real problem dont even need sophisticated research understand unequal society becoming day day india seriously needs drastic measures check otherwise go us way people realize theyre unbothered theyre ones write proud indian see indians worlds billionaire list theyre least bothered financial situation government busy fueling vague proud india going become third largest economy world doesnt give required attention growing income wealth inequality country",
    "light_cleaned_title": "From a republic to a republic of unequals",
    "light_cleaned_selftext": "The neoliberal ideological order shadows the constitutional vision of creating an egalitarian social order in India. The article is written by Venkatanarayanan Sethuraman who is Associate Professor and Head of the Department of International Studies, Political Science and History at Christ University, Bengaluru. The views expressed are personal.",
    "light_cleaned_comments": "Lucas Chancel and Thomas Piketty from the Paris School of Economics have documented the rising inequality in India in their work, “Indian Income Inequality, 1922-2015: From British Raj to Billionaire Raj?” (2019). Their research shows that the top 1% of earners had a share of less than 21% of total income in the 1930s. But after Independence, due to welfare state intervention, based on constitutional ideology, this gap reduced where the top 1% earners had a share of 6% of the total income in the 1980s. They reiterated this inequality status in their recent research in 2024 emphasising that the top 1% of income and wealth shares have reached 22.6% and 40.1% by 2022-23, which is considered very high. This is a real problem and we don't even need sophisticated research to understand how unequal our society is becoming day by day. India seriously needs drastic measures to check it, otherwise we will go the US way. The people who should realize this they're unbothered. They're the ones who write \"Proud Indian\" when they see Indians on the World's Billionaire List. They're least bothered about their own financial situation. Government is busy fueling the vague proud that India is going to become third largest economy in the world but doesn't give required attention to the growing income and wealth inequality in the country."
}