{
    "id": "1566f11",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries & Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/1566f11/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&format=png&auto=webp&s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689989409.0,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "The Sky Is Pink. Priyanka is so pretty.",
        "Unbreakable Kimmy Schmidt, gives me the positivity I require and let's me explore the world for it's scary and beautiful part"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionrestrictsronsortnewtall ",
    "cleaned_title": "biweekly movies tv shows documentaries podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionrestrictsronsortnewtall",
    "cleaned_comments": "sky pink priyanka pretty unbreakable kimmy schmidt gives positivity require lets explore world scary beautiful part",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries & Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "The Sky Is Pink. Priyanka is so pretty. Unbreakable Kimmy Schmidt, gives me the positivity I require and let's me explore the world for it's scary and beautiful part"
}