{
    "id": "1607olf",
    "title": "Delhi pogrom: Court slams Delhi Police for making ‘artificial statements’ about Muslim youth, acquits him",
    "url": "https://maktoobmedia.com/latest-news/delhi-pogrom-court-slams-delhi-police-for-making-artificial-statements-about-muslim-youth-acquits-him/",
    "selftext": "While acquitting a Muslim man in a case connected to the 2020 northeast Delhi pogrom, a Delhi court on Thursday criticized Delhi Police for making “artificial statements” about his alleged involvement in the violence.\n\nAdditional Sessions Judge Pulastya Pramachala of Karkardooma Court observed that though the prosecution established the incident of riot and vandalism, it failed to prove Javed’s presence in the unlawful assembly beyond any reasonable doubt, Live Law reported.\n\n“My foregoing discussion and observations lead me to hold that prosecution though established the incident of riot, and vandalism, but it failed to prove presence of accused in the unlawful assembly responsible for such incidents, beyond reasonable doubts,” the court said.\n\n“It is also established on the record that charge sheet was filed for multiple incidents in this case, in mechanical manner and without actually investigating such incidents properly. There was no evidence of offence u/s 436 IPC and such Section was also invoked without ascertaining the actual situation,” the court said.\n\nOn 26 February, 2023, charges were framed against Javed for the offences punishable under Section 147, 148, 427, 435, 436 and 149 of Indian Penal Code, 1860.\n\nWhile acquitting Javed, Additional Sessions Judge Pulastya Pramachala compared the testimonies given by the IO and a constable, both prosecution witnesses, regarding his arrest and observed that both had had given different description, Live Law reported.\n\nThe judge said: “IO was probably making artificial statement in respect of the time of getting knowledge about involvement of accused Javed in the incidents being probed in this case. That could be reason for him to first claim that Ct. Pawan/PW9 had told him about involvement of Javed on 27.02.2020 itself, but he could not say about the reasons for not mentioning name of Javed in the FIR.”\n\nThis comes days after the same court had said it is suspicious that the Delhi Police “manipulated evidence” and filed chargesheets in a “predetermined and mechanical manner” while discharging three Muslim men in a case relating to the 2020 northeast Delhi pogrom.\n\n“It is worth to mention here that this order of discharge is being passed on account of realizing that the reported incidents were not properly and completely investigated and that the chargesheets were filed in predetermined, mechanical and erroneous manner, with subsequent actions to only cover up the initial wrong actions,” Additional Sessions Judge Pulastya Pramachala of Karkardooma Courts said.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1692896613.0,
    "convurl": "https://external-preview.redd.it/pSyQAWiX73Cw4UVdFZgzC0fwpB3BmZm5HqTen4eHZCo.jpg?auto=webp&s=7d5d1fe52aed3e5a95fe6a10445933dc1c18903c",
    "comments": [
        "I wonder how many Muslims were arrested on false charges by Amit Shah's Delhi Police",
        "Good movie by the court, but the job has been done.",
        ">but the job has been done\n\nHe didn't hang or spend decades in the jail like a lot of innocents.",
        "Yes, he fared better than those others.",
        "These are things that make me angry. \n\n\nI hate this place, just imagine if it was another chaddi judge who are also filling up our parliament, police, courts."
    ],
    "cleaned_text": "delhi pogrom court slams delhi police making artificial statements muslim youth acquits acquitting muslim man case connected northeast delhi pogrom delhi court thursday criticized delhi police making artificial statements alleged involvement violence additional sessions judge pulastya pramachala karkardooma court observed though prosecution established incident riot vandalism failed prove javeds presence unlawful assembly beyond reasonable doubt live law reported foregoing discussion observations lead hold prosecution though established incident riot vandalism failed prove presence accused unlawful assembly responsible incidents beyond reasonable doubts court said also established record charge sheet filed multiple incidents case mechanical manner without actually investigating incidents properly evidence offence us ipc section also invoked without ascertaining actual situation court said february charges framed javed offences punishable section indian penal code acquitting javed additional sessions judge pulastya pramachala compared testimonies given io constable prosecution witnesses regarding arrest observed given different description live law reported judge said io probably making artificial statement respect time getting knowledge involvement accused javed incidents probed case could reason first claim ct pawanpw told involvement javed could say reasons mentioning name javed fir comes days court said suspicious delhi police manipulated evidence filed chargesheets predetermined mechanical manner discharging three muslim men case relating northeast delhi pogrom worth mention order discharge passed account realizing reported incidents properly completely investigated chargesheets filed predetermined mechanical erroneous manner subsequent actions cover initial wrong actions additional sessions judge pulastya pramachala karkardooma courts said ",
    "cleaned_title": "delhi pogrom court slams delhi police making artificial statements muslim youth acquits",
    "cleaned_selftext": "acquitting muslim man case connected northeast delhi pogrom delhi court thursday criticized delhi police making artificial statements alleged involvement violence additional sessions judge pulastya pramachala karkardooma court observed though prosecution established incident riot vandalism failed prove javeds presence unlawful assembly beyond reasonable doubt live law reported foregoing discussion observations lead hold prosecution though established incident riot vandalism failed prove presence accused unlawful assembly responsible incidents beyond reasonable doubts court said also established record charge sheet filed multiple incidents case mechanical manner without actually investigating incidents properly evidence offence us ipc section also invoked without ascertaining actual situation court said february charges framed javed offences punishable section indian penal code acquitting javed additional sessions judge pulastya pramachala compared testimonies given io constable prosecution witnesses regarding arrest observed given different description live law reported judge said io probably making artificial statement respect time getting knowledge involvement accused javed incidents probed case could reason first claim ct pawanpw told involvement javed could say reasons mentioning name javed fir comes days court said suspicious delhi police manipulated evidence filed chargesheets predetermined mechanical manner discharging three muslim men case relating northeast delhi pogrom worth mention order discharge passed account realizing reported incidents properly completely investigated chargesheets filed predetermined mechanical erroneous manner subsequent actions cover initial wrong actions additional sessions judge pulastya pramachala karkardooma courts said",
    "cleaned_comments": "wonder many muslims arrested false charges amit shahs delhi police good movie court job done job done didnt hang spend decades jail like lot innocents yes fared better others things make angry hate place imagine another chaddi judge also filling parliament police courts",
    "light_cleaned_title": "Delhi pogrom: Court slams Delhi Police for making ‘artificial statements’ about Muslim youth, acquits him",
    "light_cleaned_selftext": "While acquitting a Muslim man in a case connected to the 2020 northeast Delhi pogrom, a Delhi court on Thursday criticized Delhi Police for making “artificial statements” about his alleged involvement in the violence. Additional Sessions Judge Pulastya Pramachala of Karkardooma Court observed that though the prosecution established the incident of riot and vandalism, it failed to prove Javed’s presence in the unlawful assembly beyond any reasonable doubt, Live Law reported. “My foregoing discussion and observations lead me to hold that prosecution though established the incident of riot, and vandalism, but it failed to prove presence of accused in the unlawful assembly responsible for such incidents, beyond reasonable doubts,” the court said. “It is also established on the record that charge sheet was filed for multiple incidents in this case, in mechanical manner and without actually investigating such incidents properly. There was no evidence of offence u/s 436 IPC and such Section was also invoked without ascertaining the actual situation,” the court said. On 26 February, 2023, charges were framed against Javed for the offences punishable under Section 147, 148, 427, 435, 436 and 149 of Indian Penal Code, 1860. While acquitting Javed, Additional Sessions Judge Pulastya Pramachala compared the testimonies given by the IO and a constable, both prosecution witnesses, regarding his arrest and observed that both had had given different description, Live Law reported. The judge said: “IO was probably making artificial statement in respect of the time of getting knowledge about involvement of accused Javed in the incidents being probed in this case. That could be reason for him to first claim that Ct. Pawan/PW9 had told him about involvement of Javed on 27.02.2020 itself, but he could not say about the reasons for not mentioning name of Javed in the FIR.” This comes days after the same court had said it is suspicious that the Delhi Police “manipulated evidence” and filed chargesheets in a “predetermined and mechanical manner” while discharging three Muslim men in a case relating to the 2020 northeast Delhi pogrom. “It is worth to mention here that this order of discharge is being passed on account of realizing that the reported incidents were not properly and completely investigated and that the chargesheets were filed in predetermined, mechanical and erroneous manner, with subsequent actions to only cover up the initial wrong actions,” Additional Sessions Judge Pulastya Pramachala of Karkardooma Courts said.",
    "light_cleaned_comments": "I wonder how many Muslims were arrested on false charges by Amit Shah's Delhi Police Good movie by the court, but the job has been done. >but the job has been done He didn't hang or spend decades in the jail like a lot of innocents. Yes, he fared better than those others. These are things that make me angry. I hate this place, just imagine if it was another chaddi judge who are also filling up our parliament, police, courts."
}