{
    "id": "154eldf",
    "title": "Two Kuki Christian tribe women were made naked and raped by Meitei tribe in Kangpokpi district, Manipur of India. Kukis and Meiteis entered in an ethnic conflict in May, more than 80 people killed and 200 churches have been burnt by Meitei tribe.",
    "url": "https://www.reddit.com/r/india/comments/154eldf/two_kuki_christian_tribe_women_were_made_naked/",
    "selftext": "Those two women were later gang raped publicly. Anti- INDIA Party leader of Manipur recently quit the party as he claimed that BJP is silent on this issue because allegedly it is a state sponsored violence against minorities in The state of Manipur\n\n249 churches have been burnt and destroyed completely. \n\nThis is clearly a conflict out of control. Where is the military, where is the police, where are the tweets from the anti- INDIA party?\n\nMiddle class almost pays 3-4 months of their salary as income tax excluding the taxation on purchases, vehicle tax, fuel tax etc etc . \n\nAll our hard earned money is sponsoring the luxurious lifestyle of ministers and police leaders while the common man and woman get butchered and bartered everyday just cause they follow a different God. A Christian God in this case. \n\nSmriti Irani and other puppets of Anti-INDIA party Have made thousands of tweets against Rahul Gandhi, INDIA alliance, etc but zero tweets on this issue. \n\nNo wonder these guys wanted to get rid of Twitter in India. When news media fail, Twitter is the only source for people to learn the current events and the truth.\n\nhttps://www.thehindu.com/news/national/video-of-sexual-violence-on-women-in-manipur-emerges-police-promise-arrests-soon/article67098429.ece/amp/\n\nhttps://indianexpress.com/article/india/archbishop-imphal-claims-249-churches-burnt-in-manipur-8669677/lite/\n\nhttps://www.indiatoday.in/amp/india/story/mizoram-bjp-vice-president-vanramchhuanga-resigns-protest-manipur-church-burnings-2406490-2023-07-14",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689820578.0,
    "convurl": "https://external-preview.redd.it/LrdwT7y8aqeNlo_1o9F_fN8pj_w5eb2w1hyuDKtLGVw.jpg?auto=webp&s=a050d377b1277f65192df519880e9b5a97b5a525",
    "comments": [
        "Don't expect anything from Smriti Irani: women have disowned her long back. A disgrace to the gender."
    ],
    "cleaned_text": "two kuki christian tribe women made naked raped meitei tribe kangpokpi district manipur india kukis meiteis entered ethnic conflict may people killed churches burnt meitei tribe two women later gang raped publicly anti india party leader manipur recently quit party claimed bjp silent issue allegedly state sponsored violence minorities state manipur churches burnt destroyed completely clearly conflict control military police tweets anti india party middle class almost pays months salary income tax excluding taxation purchases vehicle tax fuel tax etc etc hard earned money sponsoring luxurious lifestyle ministers police leaders common man woman get butchered bartered everyday cause follow different god christian god case smriti irani puppets antiindia party made thousands tweets rahul gandhi india alliance etc zero tweets issue wonder guys wanted get rid twitter india news media fail twitter source people learn current events truth ",
    "cleaned_title": "two kuki christian tribe women made naked raped meitei tribe kangpokpi district manipur india kukis meiteis entered ethnic conflict may people killed churches burnt meitei tribe",
    "cleaned_selftext": "two women later gang raped publicly anti india party leader manipur recently quit party claimed bjp silent issue allegedly state sponsored violence minorities state manipur churches burnt destroyed completely clearly conflict control military police tweets anti india party middle class almost pays months salary income tax excluding taxation purchases vehicle tax fuel tax etc etc hard earned money sponsoring luxurious lifestyle ministers police leaders common man woman get butchered bartered everyday cause follow different god christian god case smriti irani puppets antiindia party made thousands tweets rahul gandhi india alliance etc zero tweets issue wonder guys wanted get rid twitter india news media fail twitter source people learn current events truth",
    "cleaned_comments": "dont expect anything smriti irani women disowned long back disgrace gender",
    "light_cleaned_title": "Two Kuki Christian tribe women were made naked and raped by Meitei tribe in Kangpokpi district, Manipur of India. Kukis and Meiteis entered in an ethnic conflict in May, more than 80 people killed and 200 churches have been burnt by Meitei tribe.",
    "light_cleaned_selftext": "Those two women were later gang raped publicly. Anti- INDIA Party leader of Manipur recently quit the party as he claimed that BJP is silent on this issue because allegedly it is a state sponsored violence against minorities in The state of Manipur 249 churches have been burnt and destroyed completely. This is clearly a conflict out of control. Where is the military, where is the police, where are the tweets from the anti- INDIA party? Middle class almost pays 3-4 months of their salary as income tax excluding the taxation on purchases, vehicle tax, fuel tax etc etc . All our hard earned money is sponsoring the luxurious lifestyle of ministers and police leaders while the common man and woman get butchered and bartered everyday just cause they follow a different God. A Christian God in this case. Smriti Irani and other puppets of Anti-INDIA party Have made thousands of tweets against Rahul Gandhi, INDIA alliance, etc but zero tweets on this issue. No wonder these guys wanted to get rid of Twitter in India. When news media fail, Twitter is the only source for people to learn the current events and the truth.",
    "light_cleaned_comments": "Don't expect anything from Smriti Irani: women have disowned her long back. A disgrace to the gender."
}