{
    "id": "14xewg6",
    "title": "What is your opinion on a separate state being created out of Manipur for the Kukis?",
    "url": "https://www.reddit.com/r/india/comments/14xewg6/what_is_your_opinion_on_a_separate_state_being/",
    "selftext": "I am a proponent of smaller states. I have roots in UP so I am doubly invested in the concept.\n\nThere is some fear in the minds of many people regarding creation of new states, which I dont agree with. Even the current UP CM said this when asked about dividing UP - (We believe in uniting not dividing.\")[https://www.ndtv.com/india-news/uttar-pradesh-chief-minister-yogi-adityanath-on-any-plan-to-split-up-believe-in-uniting-not-dividing-2357716)\n\nI dont think union government will split the state of Manipur. It could ignite demand for seperate states in other regions and both congress and BJP will lose more states permanently if this happens.\n\nAn alternative is seperate electorate/administration for Kukis. If other regions start demanding the same, it will trigger an even bigger long term threat to BJP and its hindutva ideology.\n\nWhat do you think?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689139264.0,
    "convurl": "https://external-preview.redd.it/jvpQhUu5TCum1RrDCbXDv1PL7wacHRdeAbacaKjqOSU.jpg?auto=webp&s=d4349c4364b58f491a0b9a51744cc24339b5eb47",
    "comments": [
        "I do not agree on any more invisible lines but for administration we can make changes. I cannot imagine one person taking responsibility for such a big area.",
        "Smaller state ideas are generally from the concept that they can give importance to it and economic development comes and healthy competition is maintained. But yours is not such a great economy, that by splitting it will do any advantage. It will only increase burden on economy as new administration and development of capitals will be in demand. My opinion is small, non performing states which fail miserably in developing of their state should be united, under some separation of powers.",
        "Logically smaller states make sense for better administration, especially for a country as populous as ours \n\nHowever, the motivation for drawing lines in India is rather dangerous. I’m not a fan",
        "depends on how they divide it. if they give them the land that they already own, what was the fight even for then? lol. if they don't give them the land they own and only partial land, it might lead to more bloodshed. there needs to be peaceful talks but since this is allegedly state sponsored, it won't happen else it would have already happened.",
        "From what I understand, manipur will be pretty hard to divide in smaller state? Do they split the valley? Or some other boundary?",
        "Interpreting the logic of separation of Manipur agianst UP is wrong because if UP were to be separated it wil be for administrative purpose meanwhile the demand for separation in Manipur is to prevent the annihilation of the Kukis by the Meiteis who are aggressively pursuing their genocidal cause by any means. If Telangana and AP can become 2 separate states why would it be any more difficult for Manipur. And its not like other states were clamoring for fragmentation even then. Even if Manipur gets separated grants and funds from the central government will still be dictated by the population, area, income parity etc. Sure it will require more funding to help stabilise the economy after intense and devastating civil unrest but should that stop the central government? There will never be peace in Manipur at this rate and the only way to mitigate the damage that has been already done is separation. Kukis and meiteis can never live together again.",
        "I don't know about Manipur but UP should be divided",
        "UP will never be divided, where else you can get this huge number of morons in a single state, it's a holy cow for national politics, whoever wins UP wins the centre, no way they are dividing it, also there's a fear of muslims getting concentrated in a new state and getting a CM elected (if UP is broken, it's a 20% muslim state, remember bogi statement of 80,20)",
        "honestly India should have 120ish states.",
        "swinging to the far end of the debate here, but I am with you if it shifts the overton window",
        "I'm with you 100% but this question is about Manipur",
        "You may know more than me on the matter then. Why would it be hard?",
        "There is a great resistance to further subdivision of states, regardless of how states are divided. I mean, its obvious that the parent state will have a smaller GDP/budget as well as national level influence so they have no benefit. \n\nBut yeah, there is very little hope for any solution that involves seperation",
        "I agree on the comparison between UP and Manipur being apples and oranges, but there is a lot of resistance to any state splitting - regardless of the reason. Plus any splitting states will further motivate other regionalist claims\n\nBut we agree on a seperate state for Manipur.",
        "I support separate state, only way to be safe for kukis, if there was no voilence then other solutions could have been considered, but since all of this has happened, seperation is the only solution left.",
        "Also majority of cowshed people have no sympathy for kukis anyway (christian), just look at the sheer amount of churches destroyed.",
        "Well we clearly Don't want Rwanda situation"
    ],
    "cleaned_text": "opinion separate state created manipur kukis proponent smaller states roots doubly invested concept fear minds many people regarding creation new states dont agree even current cm said asked dividing believe uniting dividinghttpswwwndtvcomindianewsuttarpradeshchiefministeryogiadityanathonanyplantosplitupbelieveinunitingnotdividing dont think union government split state manipur could ignite demand seperate states regions congress bjp lose states permanently happens alternative seperate electorateadministration kukis regions start demanding trigger even bigger long term threat bjp hindutva ideology think ",
    "cleaned_title": "opinion separate state created manipur kukis",
    "cleaned_selftext": "proponent smaller states roots doubly invested concept fear minds many people regarding creation new states dont agree even current cm said asked dividing believe uniting dividinghttpswwwndtvcomindianewsuttarpradeshchiefministeryogiadityanathonanyplantosplitupbelieveinunitingnotdividing dont think union government split state manipur could ignite demand seperate states regions congress bjp lose states permanently happens alternative seperate electorateadministration kukis regions start demanding trigger even bigger long term threat bjp hindutva ideology think",
    "cleaned_comments": "agree invisible lines administration make changes imagine one person taking responsibility big area smaller state ideas generally concept give importance economic development comes healthy competition maintained great economy splitting advantage increase burden economy new administration development capitals demand opinion small non performing states fail miserably developing state united separation powers logically smaller states make sense better administration especially country populous however motivation drawing lines india rather dangerous im fan depends divide give land already fight even lol dont give land partial land might lead bloodshed needs peaceful talks since allegedly state sponsored wont happen else would already happened understand manipur pretty hard divide smaller state split valley boundary interpreting logic separation manipur agianst wrong separated wil administrative purpose meanwhile demand separation manipur prevent annihilation kukis meiteis aggressively pursuing genocidal cause means telangana ap become separate states would difficult manipur like states clamoring fragmentation even even manipur gets separated grants funds central government still dictated population area income parity etc sure require funding help stabilise economy intense devastating civil unrest stop central government never peace manipur rate way mitigate damage already done separation kukis meiteis never live together dont know manipur divided never divided else get huge number morons single state holy cow national politics whoever wins wins centre way dividing also theres fear muslims getting concentrated new state getting cm elected broken muslim state remember bogi statement honestly india ish states swinging far end debate shifts overton window im question manipur may know matter would hard great resistance subdivision states regardless states divided mean obvious parent state smaller gdpbudget well national level influence benefit yeah little hope solution involves seperation agree comparison manipur apples oranges lot resistance state splitting regardless reason plus splitting states motivate regionalist claims agree seperate state manipur support separate state way safe kukis voilence solutions could considered since happened seperation solution left also majority cowshed people sympathy kukis anyway christian look sheer amount churches destroyed well clearly dont want rwanda situation",
    "light_cleaned_title": "What is your opinion on a separate state being created out of Manipur for the Kukis?",
    "light_cleaned_selftext": "I am a proponent of smaller states. I have roots in UP so I am doubly invested in the concept. There is some fear in the minds of many people regarding creation of new states, which I dont agree with. Even the current UP CM said this when asked about dividing UP - (We believe in uniting not dividing.\")[https://www.ndtv.com/india-news/uttar-pradesh-chief-minister-yogi-adityanath-on-any-plan-to-split-up-believe-in-uniting-not-dividing-2357716) I dont think union government will split the state of Manipur. It could ignite demand for seperate states in other regions and both congress and BJP will lose more states permanently if this happens. An alternative is seperate electorate/administration for Kukis. If other regions start demanding the same, it will trigger an even bigger long term threat to BJP and its hindutva ideology. What do you think?",
    "light_cleaned_comments": "I do not agree on any more invisible lines but for administration we can make changes. I cannot imagine one person taking responsibility for such a big area. Smaller state ideas are generally from the concept that they can give importance to it and economic development comes and healthy competition is maintained. But yours is not such a great economy, that by splitting it will do any advantage. It will only increase burden on economy as new administration and development of capitals will be in demand. My opinion is small, non performing states which fail miserably in developing of their state should be united, under some separation of powers. Logically smaller states make sense for better administration, especially for a country as populous as ours However, the motivation for drawing lines in India is rather dangerous. I’m not a fan depends on how they divide it. if they give them the land that they already own, what was the fight even for then? lol. if they don't give them the land they own and only partial land, it might lead to more bloodshed. there needs to be peaceful talks but since this is allegedly state sponsored, it won't happen else it would have already happened. From what I understand, manipur will be pretty hard to divide in smaller state? Do they split the valley? Or some other boundary? Interpreting the logic of separation of Manipur agianst UP is wrong because if UP were to be separated it wil be for administrative purpose meanwhile the demand for separation in Manipur is to prevent the annihilation of the Kukis by the Meiteis who are aggressively pursuing their genocidal cause by any means. If Telangana and AP can become 2 separate states why would it be any more difficult for Manipur. And its not like other states were clamoring for fragmentation even then. Even if Manipur gets separated grants and funds from the central government will still be dictated by the population, area, income parity etc. Sure it will require more funding to help stabilise the economy after intense and devastating civil unrest but should that stop the central government? There will never be peace in Manipur at this rate and the only way to mitigate the damage that has been already done is separation. Kukis and meiteis can never live together again. I don't know about Manipur but UP should be divided UP will never be divided, where else you can get this huge number of morons in a single state, it's a holy cow for national politics, whoever wins UP wins the centre, no way they are dividing it, also there's a fear of muslims getting concentrated in a new state and getting a CM elected (if UP is broken, it's a 20% muslim state, remember bogi statement of 80,20) honestly India should have 120ish states. swinging to the far end of the debate here, but I am with you if it shifts the overton window I'm with you 100% but this question is about Manipur You may know more than me on the matter then. Why would it be hard? There is a great resistance to further subdivision of states, regardless of how states are divided. I mean, its obvious that the parent state will have a smaller GDP/budget as well as national level influence so they have no benefit. But yeah, there is very little hope for any solution that involves seperation I agree on the comparison between UP and Manipur being apples and oranges, but there is a lot of resistance to any state splitting - regardless of the reason. Plus any splitting states will further motivate other regionalist claims But we agree on a seperate state for Manipur. I support separate state, only way to be safe for kukis, if there was no voilence then other solutions could have been considered, but since all of this has happened, seperation is the only solution left. Also majority of cowshed people have no sympathy for kukis anyway (christian), just look at the sheer amount of churches destroyed. Well we clearly Don't want Rwanda situation"
}