{
    "id": "1g6mdk9",
    "title": "Railways to re-engage retired staff to overcome manpower shortage",
    "url": "https://www.thehindu.com/news/national/railways-to-re-engage-retired-staff-to-overcome-manpower-shortage/article68769441.ece",
    "selftext": "Move to tide over the crisis of over 2 lakh vacancies in various categories across the railway network",
    "flair": "Policy/Economy",
    "score": 25,
    "num_comments": 15,
    "created_utc": 1729269038.0,
    "convurl": "https://external-preview.redd.it/gw_pTwMLcCRK6LZiHkwEYDMBFovTn9hvv5xRuYObzFM.jpg?auto=webp&s=224c6275cc3de85437a6ff0c4a240edad97a28e1",
    "comments": [
        "Unemployment is over the roof. Yet they need retired staff to take care ? \n\n\nHire  young and train them quickly- how difficult is that? ",
        "Why? bring the young guns in.",
        "How dare you suggest something logical",
        "Man power shortage, which was created by refusing to hire critical personnel for a decade?",
        "People will adjust ma",
        "Training is really tough. It's not as easy as it's made to be.",
        "They want to destroy the railways. They want to make it so bad that people become okay with privatisation. That's the end goal",
        "So the option is to keep recalling oldies until one of them  misses stuff due to old age?",
        "I never said that. I was just answering a specific question of yours. I never agreed what they are doing by a mile lol. This is not something that emerges just over a day, the govt nicely skipped a couple of hiring cycles and this is the monster that rears it's head.",
        "Np. My misunderstanding. Sorry about that.",
        "Don't pay new recruits, threaten retires with pension stoppage, har psu ki kahani.",
        "No disagreement here. Govt can hire some experienced hands and support them with new recruits. Current scheme is only to save money. ",
        "Soon they will hire the souls of the railway employees who left this Earth.",
        "They stopped entry to Railways via the UPSC exam, merged 8 railway services into one now there is a shortage, who woulda thunk? \n\n\n(ik they are restarting the entry from '24/25)",
        "It's all good. Your other points are valid."
    ],
    "cleaned_text": "railways reengage retired staff overcome manpower shortage move tide crisis lakh vacancies various categories across railway network ",
    "cleaned_title": "railways reengage retired staff overcome manpower shortage",
    "cleaned_selftext": "move tide crisis lakh vacancies various categories across railway network",
    "cleaned_comments": "unemployment roof yet need retired staff take care hire young train quickly difficult bring young guns dare suggest something logical man power shortage created refusing hire critical personnel decade people adjust training really tough easy made want destroy railways want make bad people become okay privatisation thats end goal option keep recalling oldies one misses stuff due old age never said answering specific question never agreed mile lol something emerges day govt nicely skipped couple hiring cycles monster rears head np misunderstanding sorry dont pay new recruits threaten retires pension stoppage har psu ki kahani disagreement govt hire experienced hands support new recruits current scheme save money soon hire souls railway employees left earth stopped entry railways via upsc exam merged railway services one shortage woulda thunk ik restarting entry good points valid",
    "light_cleaned_title": "Railways to re-engage retired staff to overcome manpower shortage",
    "light_cleaned_selftext": "Move to tide over the crisis of over 2 lakh vacancies in various categories across the railway network",
    "light_cleaned_comments": "Unemployment is over the roof. Yet they need retired staff to take care ? Hire young and train them quickly- how difficult is that? Why? bring the young guns in. How dare you suggest something logical Man power shortage, which was created by refusing to hire critical personnel for a decade? People will adjust ma Training is really tough. It's not as easy as it's made to be. They want to destroy the railways. They want to make it so bad that people become okay with privatisation. That's the end goal So the option is to keep recalling oldies until one of them misses stuff due to old age? I never said that. I was just answering a specific question of yours. I never agreed what they are doing by a mile lol. This is not something that emerges just over a day, the govt nicely skipped a couple of hiring cycles and this is the monster that rears it's head. Np. My misunderstanding. Sorry about that. Don't pay new recruits, threaten retires with pension stoppage, har psu ki kahani. No disagreement here. Govt can hire some experienced hands and support them with new recruits. Current scheme is only to save money. Soon they will hire the souls of the railway employees who left this Earth. They stopped entry to Railways via the UPSC exam, merged 8 railway services into one now there is a shortage, who woulda thunk? (ik they are restarting the entry from '24/25) It's all good. Your other points are valid."
}