{
    "id": "1bzp2k8",
    "title": "Another day another FedEx Scam ",
    "url": "https://www.reddit.com/r/india/comments/1bzp2k8/another_day_another_fedex_scam/",
    "selftext": "https://www.hindustantimes.com/cities/bengaluru-news/cyber-fraudsters-make-bengaluru-woman-strip-on-cam-extorts-rs-15-lakh-report-101712636183895.html\n\nHow to stay safe?\n\n1. Ask for a waybill number from the caller. \n2. When shipments arrive you also get an email with all the details, do check for that or ask for an email .\n3. Visit the official site to check if there's really a shipment. You could also call the toll free number of the shipment company to confirm the same.\n4. Inform the police/ block the number if you do not have the time \n\n\nThese cases don't seem to end, this time the scammer tricked the victim to strip. (What?)\n\nI almost fell into a trap like this, when the trend had just started but being aware of this scam already helped me do some prechecks.\n\nSo I was expecting a shipment from my cousin in Poland in January, in the same week that she shipped my bro and I got sms from FedEx telling a shipment has been received and later they even tried reaching out, I'm not sure how they got my brother's phone number as well. I suspect they are tracking our previous shipments also. \n\nWhen I got a call, it did not seem like a customer care person talking, for one his English was broken (this is FedEx not a local company) second ,my cousin sent it via DHL n not FedEx.  To be sure I asked for a waybill number the person hung up and I blocked the number. \n\nIt's been 3 months still we see people getting tricked easily. \n\n\n",
    "flair": "Crime",
    "score": 6,
    "num_comments": 0,
    "created_utc": 1712659710.0,
    "convurl": "https://external-preview.redd.it/XuCW0q3YYnUkgTtn79_Eqroc8WRaGzQ4IxwGilgVPIM.jpg?auto=webp&s=852cbb3860dba0c96e6aa8479da29cabf6ee13d9",
    "comments": [],
    "cleaned_text": "another day another fedex scam stay safe ask waybill number caller shipments arrive also get email details check ask email visit official site check theres really shipment could also call toll free number shipment company confirm inform police block number time cases dont seem end time scammer tricked victim strip almost fell trap like trend started aware scam already helped prechecks expecting shipment cousin poland january week shipped bro got sms fedex telling shipment received later even tried reaching im sure got brothers phone number well suspect tracking previous shipments also got call seem like customer care person talking one english broken fedex local company second cousin sent via dhl n fedex sure asked waybill number person hung blocked number months still see people getting tricked easily ",
    "cleaned_title": "another day another fedex scam",
    "cleaned_selftext": "stay safe ask waybill number caller shipments arrive also get email details check ask email visit official site check theres really shipment could also call toll free number shipment company confirm inform police block number time cases dont seem end time scammer tricked victim strip almost fell trap like trend started aware scam already helped prechecks expecting shipment cousin poland january week shipped bro got sms fedex telling shipment received later even tried reaching im sure got brothers phone number well suspect tracking previous shipments also got call seem like customer care person talking one english broken fedex local company second cousin sent via dhl n fedex sure asked waybill number person hung blocked number months still see people getting tricked easily",
    "cleaned_comments": "",
    "light_cleaned_title": "Another day another FedEx Scam",
    "light_cleaned_selftext": "How to stay safe? 1. Ask for a waybill number from the caller. 2. When shipments arrive you also get an email with all the details, do check for that or ask for an email . 3. Visit the official site to check if there's really a shipment. You could also call the toll free number of the shipment company to confirm the same. 4. Inform the police/ block the number if you do not have the time These cases don't seem to end, this time the scammer tricked the victim to strip. (What?) I almost fell into a trap like this, when the trend had just started but being aware of this scam already helped me do some prechecks. So I was expecting a shipment from my cousin in Poland in January, in the same week that she shipped my bro and I got sms from FedEx telling a shipment has been received and later they even tried reaching out, I'm not sure how they got my brother's phone number as well. I suspect they are tracking our previous shipments also. When I got a call, it did not seem like a customer care person talking, for one his English was broken (this is FedEx not a local company) second ,my cousin sent it via DHL n not FedEx. To be sure I asked for a waybill number the person hung up and I blocked the number. It's been 3 months still we see people getting tricked easily.",
    "light_cleaned_comments": ""
}