{
    "id": "xpp2fp",
    "title": "Are Amazon Contests a Fraud?",
    "url": "https://i.redd.it/kevsitxt5gq91.jpg",
    "selftext": "I had participated in a Spin and Win contest and the lucky winner was supposed to get a Macbook Air. Winners name were to be announced on 19th September. When I check the Contest Winners page on Amazon, there’s no winner for a Macbook Air. Had happened earlier with me once, wherein the Lucky winner was supposed to get an iPad Pro, but again there was no mention of the Winner, so took a screenshot this time.\n\nAre these contests a Fraud?",
    "flair": "Rant / Vent",
    "score": 18,
    "num_comments": 17,
    "created_utc": 1664304364,
    "convurl": "https://i.redd.it/kevsitxt5gq91.jpg",
    "comments": [
        "Why do you think so?",
        "They have a winners list displayed, but all have one few rows of Amazon pay balance. There’s no one who won this.",
        "What does your heart tell you? It’s probably right.",
        "Only Amazon knows",
        "i don't think billion dollar company will risk reputation for a macbook air.",
        "Well kinda",
        "They're very real. When you look at the marketing budget Amazon would have, the price of one MacBook is nothing, as opposed to the risk of losing reputation by running fake contests.",
        "For best savings this festive season. Uninstall these apps.",
        "I have participated in roughly 100 + such Amazon quizzes. \n\nNever won anything",
        "I guess that's still possible, given the number of people participating in the contest. My question to their team was that even if I did not win, someone must have one. Why was that not mentioned in the winner's list?",
        "I think so cuz I've participated many times but got nothing bro.",
        "My friends have won a few things. So not a fraud.",
        "They won your responses.",
        "Here's my question. Is he already an avid user of amazon. I feel these \"lucky\" draws are more biased to regular buyers to nudge them to use it more compared to rare users",
        "I have won 50 bucks on pay wallet balance many years ago",
        "Not an avid Amazon user. But regular purchases, like we all do. It may be biased but definitely not a scam/fraud.",
        "So, why is there nobody who won the Macbook? Only a bunch of people who won Amazon Pay balances"
    ],
    "cleaned_text": "amazon contests fraud participated spin win contest lucky winner supposed get macbook air winners name announced th september check contest winners page amazon theres winner macbook air happened earlier wherein lucky winner supposed get ipad pro mention winner took screenshot time contests fraud ",
    "cleaned_title": "amazon contests fraud",
    "cleaned_selftext": "participated spin win contest lucky winner supposed get macbook air winners name announced th september check contest winners page amazon theres winner macbook air happened earlier wherein lucky winner supposed get ipad pro mention winner took screenshot time contests fraud",
    "cleaned_comments": "think winners list displayed one rows amazon pay balance theres one heart tell probably right amazon knows dont think billion dollar company risk reputation macbook air well kinda theyre real look marketing budget amazon would price one macbook nothing opposed risk losing reputation running fake contests best savings festive season uninstall apps participated roughly amazon quizzes never anything guess thats still possible given number people participating contest question team even win someone must one mentioned winners list think cuz ive participated many times got nothing bro friends things fraud responses heres question already avid user amazon feel lucky draws biased regular buyers nudge use compared rare users bucks pay wallet balance many years ago avid amazon user regular purchases like may biased definitely scamfraud nobody macbook bunch people amazon pay balances",
    "light_cleaned_title": "Are Amazon Contests a Fraud?",
    "light_cleaned_selftext": "I had participated in a Spin and Win contest and the lucky winner was supposed to get a Macbook Air. Winners name were to be announced on 19th September. When I check the Contest Winners page on Amazon, there’s no winner for a Macbook Air. Had happened earlier with me once, wherein the Lucky winner was supposed to get an iPad Pro, but again there was no mention of the Winner, so took a screenshot this time. Are these contests a Fraud?",
    "light_cleaned_comments": "Why do you think so? They have a winners list displayed, but all have one few rows of Amazon pay balance. There’s no one who won this. What does your heart tell you? It’s probably right. Only Amazon knows i don't think billion dollar company will risk reputation for a macbook air. Well kinda They're very real. When you look at the marketing budget Amazon would have, the price of one MacBook is nothing, as opposed to the risk of losing reputation by running fake contests. For best savings this festive season. Uninstall these apps. I have participated in roughly 100 + such Amazon quizzes. Never won anything I guess that's still possible, given the number of people participating in the contest. My question to their team was that even if I did not win, someone must have one. Why was that not mentioned in the winner's list? I think so cuz I've participated many times but got nothing bro. My friends have won a few things. So not a fraud. They won your responses. Here's my question. Is he already an avid user of amazon. I feel these \"lucky\" draws are more biased to regular buyers to nudge them to use it more compared to rare users I have won 50 bucks on pay wallet balance many years ago Not an avid Amazon user. But regular purchases, like we all do. It may be biased but definitely not a scam/fraud. So, why is there nobody who won the Macbook? Only a bunch of people who won Amazon Pay balances"
}