{
    "id": "1dso3fm",
    "title": "Need Support for Petition to Make Rape laws Gender-Neutral under Bharatiya Nyaya Sanhita",
    "url": "https://www.change.org/Make_Indias_RapeLaws_GenderNeutral_In_BharatiyaNyayaSanhita",
    "selftext": "\nStarting from today, ie. from 1st of July 2024,  sexual assault of a man will no longer be a \"crime\" in India under the new Bharatiya Nyaya Sanhita laws. And the already marginalised community of transgender persons will continue to face discrimination in receiving protection from being raped. Transgender victims are not taken as seriously as women rape victims and even the punishment for rape of both has huge difference which shows the disparity. \n\n\nResearch shows that men who are sexually abused are more likely to develop suicidal thoughts just like women survivors. Including just women victims in the ambit of rape victims is discriminatory. It is violation of Fundamental rights of men and transgender persons under Article 14, 15 and 21 which guarantees equal treatment before law and non-discrimination.\n\nHence, I created a petition on 23rd June, 2024  to make our rape laws gender-neutral in the BNS. (After me, some others have also created similar petitions on same website). \n\nKindly check out & go through my petition to understand WHY this cause is important.\n\n Each signature matters as it represents your voice. Please sign, share and support my petition .✊️🙏\n\n\n\n",
    "flair": "Law & Courts",
    "score": 488,
    "num_comments": 60,
    "created_utc": 1719823222.0,
    "convurl": "https://external-preview.redd.it/qijQXlBIDmoePr09w-8a7BfSdUHBw-VaoLSZXYa3h6U.jpg?auto=webp&s=56e1125927b39e69f5c752776eaa83ed6874e245",
    "comments": [
        "https://www.thehindu.com/news/national/centre-likely-to-amend-bns-to-include-section-on-sexual-crimes-against-men-transgender-people/article68352479.ece they are already planning this",
        "Tried to sign it but it keeps showing an error.",
        "Done. \n\nPost it in other subreddits too so that more people can sign it",
        "Did my duty",
        "Change dot org petition does fuck all. India does not have legal recognition to such petition and they are always ignored.\n\nWe need a system like UK where public can create petition and any petition getting more than 10k votes gets an official response and any petition with over 100k response is discussed in the parliament.\n\n  \n\n\nhttps://en.wikipedia.org/wiki/UK_Parliament_petitions_website",
        "Likely to include doesn't mean shit",
        "It is based on the assumption that the removal of rape law for male victims was not intentional which it obviously was.",
        "If Hindu is reporting it, it must have got some substantial proof of it happening, won’t have reported otherwise.",
        "It was pointed to the Centre at the time of passing of BNS itself that the new laws leave men vulnerable by not only not including them but also removing the only law that punishes rape of men by men. The Centre went ahead and passed it anyway. This is just PR now.",
        "Yeah they are doing it because of the backlash, but I just wanted to tell op that maybe this will happen as I thought it’s relevant to his cause.",
        "Yes, they are giving statements because of the backlash. That doesn't mean an actual amendment.",
        "Okay let’s hope for the best :)",
        "Did my part.",
        "I signed the petition... but I wonder how this will work? Will other lawmakers support this too?",
        "Love how when the Bill was being passed, everyone was busy blaming opposition for getting kicked out of Parliament and now that the Bill is Act and going in effect, people are remembering what is written in it...",
        "Entire left liberal side is going to oppose what you're doing. I'm surprised there aren't any comments calling people \"incels\" for even thinking about this.",
        "Yes..thanks for bringing it up. I saw the Hindu post too. However, this is not the first time we are debating the need for gender neutral rape law. There have been numerous writ petitions in courts and even private member bills in Parliament yet no governmnent had the guts to make rape laws gender-neutral . They did not even keep the recommendation of the Parliamentary Standing Commitee which was reviewing the BNS bill.\n\nBringing back Section 377 is not the same as making rape law \"gender-neutral\".  This is an important thing to note. The gravity of \"rape\" is same regardless of your gender.  If they bring another similar section to 377 it does not solve the issue.",
        "Yeah I get what you are saying, I just wanted you to have this information as I thought it was relevant for your cause.",
        "I am a woman too and a survivor.I believe anyone fighting for basic equality (which is huge part of leftist ideology) should have the conscience to oppose this. Protection of law is a basic right of all people.",
        "Very true. Too much fan following of one leader and unjustified but planned shaming of another leader lead us to shift focus from real issues. It's truly a shame that now we have to beg for our basic rights in the biggest democracy.",
        "Grateful 🙏🙏",
        "We cannot guarantee change. But previously lawmakers have put up new laws after petitions. So being positive and raising voice is the only thing we can do. I have read a recent Hindu article that law makers are now contemplating a new law for men after the backlash.  Maybe it wont happen very quickly. Maybe after 5-10 years the change happens. Still it is worth it for our future generation. \n\nIn times like these, I  want to remember Ravish Kumar's quote - \n\n\"Not All Battles are Fought For Victory. Some are Fought to Tell The World That Somebody was There On the Battlefield.\"",
        "I just feel it is a very big over-sight. How can experts in law unsee such a big loophole is kind of puzzling for me. But yes I get that it might be a drama to bring back the whole 377 section including the criminalisation of consentual sex part which was rightly removed by SC.",
        "Appreciate it . Thanks dost.",
        "Thank you so much",
        "Thanks a lot. Yes thinking of posting it in other sub reddits too.",
        "I agree . Petitions in UK are much more impactful due to their system. But India mein bhi hua hai yr actions and changes after petitions.",
        "Yes and you're thinking correctly. You should read this - https://timesofindia.indiatimes.com/india/activists-join-chorus-against-gender-neutral-rape-laws/articleshow/18840879.cms",
        "After the removal of 377, there is no law for sexual assault of men, only assault. Assault carries a maximum penalty of two years. In the Trans Act, assault including sexual assault have a maximum penalty of two years. Coincidence? I think not. The government has taken a stance that two years should be maximum for rape if you are not a woman. Simple.",
        "Yeah...that is what I pointed out in my petition. That this is discriminatory towards men and transgender persons. All rapes are equally grave.",
        "I don't disagree with you. Quote the opposite. I agree that it is discriminatory. But the discrimination is intentional. They said this as much during the discussion of the Trans Bill itself that 'enraging the modesty of a woman is not the same as engaging the modesty of an eunuch'. The amendment raised by DMK MP Tiruchi Siva to make it equal to rape law was VOTED DOWN by the NDA. It is not an oversight. It is intentional. And while I respect the attempt at a petition and have signed it, petitions can only fix oversights, not intention to do harm by a government.",
        "I understand your valid point and frustration. We all know certain ongoing things are very intentional and unfair.",
        "Is it ? DMing the petition link.",
        "I understand and know your concern is valid. This is sadly seen all over the world. We should stand with all victims. I hope some day women like us can bring change.",
        "I'm not sure if you've lived in India for the past decade. \n\nBut signing petitions will do fuck all. \n\nPeople protest outside for months and no one gives a shit so you really think your online petition will make any difference at all? \n\nThe current regime is too arrogant, they won't give a shit about you unless you start hurting them electorally.",
        "*demagoguery",
        "Be informed and Vote next time",
        "Done. Constitution should not be a zero sum game i.e., safeguarding women’s rights do not qualify subjugating men.",
        "wait what?",
        "Yeah new laws",
        "Absolutely right.",
        "Well I have been living in India since birth. A millenial. Anyway, the road safety laws were made based on petitions. But I know that they are not as powerful as UK petitions. It is also bringing awareness....the more people know the more pressure. There is a post in Hindu that govt is now being pressured to create a law for men after backlash",
        "Well from what I've read, they're creating separate laws for men which will be drafted soon. \n\nHence, the reason for excluding from the given section. \n\nIt has been ongoing from before the backlash, it's just that this government sucks at communicating and discussing their bills at parliament so people know nothing about most of it until it's passed.",
        "See if they wanted they could have included when they launched this entire new law code. They have added many new sections like  anti-trafficking , false promise to marry as seperate sexual offence with imprisionment called Section 69 etc. So, they already launched whatever new laws they wanted. Thing is they never expected the backlash that they are getting similar to how they thought of 400+. Pure delusion!  So now they are under pressure to create a new law because people are not as dumb like before.",
        "Yeah that's the thing. \n\nIf the bill was discussed in the parliament and scrutinised, all these issues with the bill would have been discussed, listed down and improved upon before it was passed.\n\nThat's the basic process, the BJP is so arrogant they never follow this process. \n\nThey just want to bulldoze everything to show that they're still in charge. \n\nEven the farm Bill could have easily worked if it was just passed after following a basic parliamentary process but it didn't because they tried to shove it down our throat.",
        "These are sad times unfortunately. Kind if helpless situation for us citizens.",
        "Yeah. \n\nBut I do see the change. Most people have stopped buying their nonsense and finally seeing them for what they are. \n\nAnd with the NEET Scam, NET Scam, infrastructure failing all over the country, the smoke screen of development and good governance has faded and people are finally seeing their true colors.\n\nIt's a slow process and it's just the beginning. This government will not go down quietly, it's gonna be a long ugly fight.",
        "Yes..let us keeo fingers crossed and be positive.",
        "That news article is from 11 years ago.",
        "Our vote matters. But better people need to fight elections.",
        "Since tou already read it deeply and I have some doubts. How the following two situation get handled now-\n\n1) A men rapes another man. Will the victim be able to press charges?\n\n2) A adult women rapes an underage. Will posco interfere or it will be the class underage male fault ?\n\n3) An adult male rapes a underage male.",
        "1) A man rapes another man is no longer a crime under the new BNS which started operating yesterday.\n\n2) An adult woman rapes underage then POCSO will apply. POCSO is gender-neutral law.\n\n3) An adult male rapes an underage male , POCSO applies here too.\n\nI have covered these issues in my petition so if you read it you will know.",
        "It's not just transgenders. I'm a straight male and I was sexually assaulted as a teenager.",
        "Wouldn't work here anyway, because government will just ignore such shit. We have to force politicians to deal with the matter, or kick them out of power.",
        "I agree that signing this petition does not guarantee change. However, it would help in reflecting public opinion and in a democracy, public opinion matters.",
        "So?",
        "An assertion relying on a veryyyy old article is kinda weak, bro.",
        "Sorry to hear that. Yes...this petition is for straight males being raped by both men and women. Also to give equal protection to transgenders.",
        "Done."
    ],
    "cleaned_text": "need support petition make rape laws genderneutral bharatiya nyaya sanhita starting today ie st july sexual assault man longer crime india new bharatiya nyaya sanhita laws already marginalised community transgender persons continue face discrimination receiving protection raped transgender victims taken seriously women rape victims even punishment rape huge difference shows disparity research shows men sexually abused likely develop suicidal thoughts like women survivors including women victims ambit rape victims discriminatory violation fundamental rights men transgender persons article guarantees equal treatment law nondiscrimination hence created petition rd june make rape laws genderneutral bns others also created similar petitions website kindly check go petition understand cause important signature matters represents voice please sign share support petition ",
    "cleaned_title": "need support petition make rape laws genderneutral bharatiya nyaya sanhita",
    "cleaned_selftext": "starting today ie st july sexual assault man longer crime india new bharatiya nyaya sanhita laws already marginalised community transgender persons continue face discrimination receiving protection raped transgender victims taken seriously women rape victims even punishment rape huge difference shows disparity research shows men sexually abused likely develop suicidal thoughts like women survivors including women victims ambit rape victims discriminatory violation fundamental rights men transgender persons article guarantees equal treatment law nondiscrimination hence created petition rd june make rape laws genderneutral bns others also created similar petitions website kindly check go petition understand cause important signature matters represents voice please sign share support petition",
    "cleaned_comments": "already planning tried sign keeps showing error done post subreddits people sign duty change dot org petition fuck india legal recognition petition always ignored need system like uk public create petition petition getting k votes gets official response petition k response discussed parliament likely include doesnt mean shit based assumption removal rape law male victims intentional obviously hindu reporting must got substantial proof happening wont reported otherwise pointed centre time passing bns new laws leave men vulnerable including also removing law punishes rape men men centre went ahead passed anyway pr yeah backlash wanted tell op maybe happen thought relevant cause yes giving statements backlash doesnt mean actual amendment okay lets hope best part signed petition wonder work lawmakers support love bill passed everyone busy blaming opposition getting kicked parliament bill act going effect people remembering written entire left liberal side going oppose youre im surprised arent comments calling people incels even thinking yesthanks bringing saw hindu post however first time debating need gender neutral rape law numerous writ petitions courts even private member bills parliament yet governmnent guts make rape laws genderneutral even keep recommendation parliamentary standing commitee reviewing bns bill bringing back section making rape law genderneutral important thing note gravity rape regardless gender bring another similar section solve issue yeah get saying wanted information thought relevant cause woman survivori believe anyone fighting basic equality huge part leftist ideology conscience oppose protection law basic right people true much fan following one leader unjustified planned shaming another leader lead us shift focus real issues truly shame beg basic rights biggest democracy grateful guarantee change previously lawmakers put new laws petitions positive raising voice thing read recent hindu article law makers contemplating new law men backlash maybe wont happen quickly maybe years change happens still worth future generation times like want remember ravish kumars quote battles fought victory fought tell world somebody battlefield feel big oversight experts law unsee big loophole kind puzzling yes get might drama bring back whole section including criminalisation consentual sex part rightly removed sc appreciate thanks dost thank much thanks lot yes thinking posting sub reddits agree petitions uk much impactful due system india mein bhi hua hai yr actions changes petitions yes youre thinking correctly read removal law sexual assault men assault assault carries maximum penalty two years trans act assault including sexual assault maximum penalty two years coincidence think government taken stance two years maximum rape woman simple yeahthat pointed petition discriminatory towards men transgender persons rapes equally grave dont disagree quote opposite agree discriminatory discrimination intentional said much discussion trans bill enraging modesty woman engaging modesty eunuch amendment raised dmk mp tiruchi siva make equal rape law voted nda oversight intentional respect attempt petition signed petitions fix oversights intention harm government understand valid point frustration know certain ongoing things intentional unfair dming petition link understand know concern valid sadly seen world stand victims hope day women like us bring change im sure youve lived india past decade signing petitions fuck people protest outside months one gives shit really think online petition make difference current regime arrogant wont give shit unless start hurting electorally demagoguery informed vote next time done constitution zero sum game ie safeguarding womens rights qualify subjugating men wait yeah new laws absolutely right well living india since birth millenial anyway road safety laws made based petitions know powerful uk petitions also bringing awarenessthe people know pressure post hindu govt pressured create law men backlash well ive read theyre creating separate laws men drafted soon hence reason excluding given section ongoing backlash government sucks communicating discussing bills parliament people know nothing passed see wanted could included launched entire new law code added many new sections like antitrafficking false promise marry seperate sexual offence imprisionment called section etc already launched whatever new laws wanted thing never expected backlash getting similar thought pure delusion pressure create new law people dumb like yeah thats thing bill discussed parliament scrutinised issues bill would discussed listed improved upon passed thats basic process bjp arrogant never follow process want bulldoze everything show theyre still charge even farm bill could easily worked passed following basic parliamentary process didnt tried shove throat sad times unfortunately kind helpless situation us citizens yeah see change people stopped buying nonsense finally seeing neet scam net scam infrastructure failing country smoke screen development good governance faded people finally seeing true colors slow process beginning government go quietly gon na long ugly fight yeslet us keeo fingers crossed positive news article years ago vote matters better people need fight elections since tou already read deeply doubts following two situation get handled men rapes another man victim able press charges adult women rapes underage posco interfere class underage male fault adult male rapes underage male man rapes another man longer crime new bns started operating yesterday adult woman rapes underage pocso apply pocso genderneutral law adult male rapes underage male pocso applies covered issues petition read know transgenders im straight male sexually assaulted teenager wouldnt work anyway government ignore shit force politicians deal matter kick power agree signing petition guarantee change however would help reflecting public opinion democracy public opinion matters assertion relying veryyyy old article kinda weak bro sorry hear yesthis petition straight males raped men women also give equal protection transgenders done",
    "light_cleaned_title": "Need Support for Petition to Make Rape laws Gender-Neutral under Bharatiya Nyaya Sanhita",
    "light_cleaned_selftext": "Starting from today, ie. from 1st of July 2024, sexual assault of a man will no longer be a \"crime\" in India under the new Bharatiya Nyaya Sanhita laws. And the already marginalised community of transgender persons will continue to face discrimination in receiving protection from being raped. Transgender victims are not taken as seriously as women rape victims and even the punishment for rape of both has huge difference which shows the disparity. Research shows that men who are sexually abused are more likely to develop suicidal thoughts just like women survivors. Including just women victims in the ambit of rape victims is discriminatory. It is violation of Fundamental rights of men and transgender persons under Article 14, 15 and 21 which guarantees equal treatment before law and non-discrimination. Hence, I created a petition on 23rd June, 2024 to make our rape laws gender-neutral in the BNS. (After me, some others have also created similar petitions on same website). Kindly check out & go through my petition to understand WHY this cause is important. Each signature matters as it represents your voice. Please sign, share and support my petition .✊️🙏",
    "light_cleaned_comments": "they are already planning this Tried to sign it but it keeps showing an error. Done. Post it in other subreddits too so that more people can sign it Did my duty Change dot org petition does fuck all. India does not have legal recognition to such petition and they are always ignored. We need a system like UK where public can create petition and any petition getting more than 10k votes gets an official response and any petition with over 100k response is discussed in the parliament. Likely to include doesn't mean shit It is based on the assumption that the removal of rape law for male victims was not intentional which it obviously was. If Hindu is reporting it, it must have got some substantial proof of it happening, won’t have reported otherwise. It was pointed to the Centre at the time of passing of BNS itself that the new laws leave men vulnerable by not only not including them but also removing the only law that punishes rape of men by men. The Centre went ahead and passed it anyway. This is just PR now. Yeah they are doing it because of the backlash, but I just wanted to tell op that maybe this will happen as I thought it’s relevant to his cause. Yes, they are giving statements because of the backlash. That doesn't mean an actual amendment. Okay let’s hope for the best :) Did my part. I signed the petition... but I wonder how this will work? Will other lawmakers support this too? Love how when the Bill was being passed, everyone was busy blaming opposition for getting kicked out of Parliament and now that the Bill is Act and going in effect, people are remembering what is written in it... Entire left liberal side is going to oppose what you're doing. I'm surprised there aren't any comments calling people \"incels\" for even thinking about this. Yes..thanks for bringing it up. I saw the Hindu post too. However, this is not the first time we are debating the need for gender neutral rape law. There have been numerous writ petitions in courts and even private member bills in Parliament yet no governmnent had the guts to make rape laws gender-neutral . They did not even keep the recommendation of the Parliamentary Standing Commitee which was reviewing the BNS bill. Bringing back Section 377 is not the same as making rape law \"gender-neutral\". This is an important thing to note. The gravity of \"rape\" is same regardless of your gender. If they bring another similar section to 377 it does not solve the issue. Yeah I get what you are saying, I just wanted you to have this information as I thought it was relevant for your cause. I am a woman too and a survivor.I believe anyone fighting for basic equality (which is huge part of leftist ideology) should have the conscience to oppose this. Protection of law is a basic right of all people. Very true. Too much fan following of one leader and unjustified but planned shaming of another leader lead us to shift focus from real issues. It's truly a shame that now we have to beg for our basic rights in the biggest democracy. Grateful 🙏🙏 We cannot guarantee change. But previously lawmakers have put up new laws after petitions. So being positive and raising voice is the only thing we can do. I have read a recent Hindu article that law makers are now contemplating a new law for men after the backlash. Maybe it wont happen very quickly. Maybe after 5-10 years the change happens. Still it is worth it for our future generation. In times like these, I want to remember Ravish Kumar's quote - \"Not All Battles are Fought For Victory. Some are Fought to Tell The World That Somebody was There On the Battlefield.\" I just feel it is a very big over-sight. How can experts in law unsee such a big loophole is kind of puzzling for me. But yes I get that it might be a drama to bring back the whole 377 section including the criminalisation of consentual sex part which was rightly removed by SC. Appreciate it . Thanks dost. Thank you so much Thanks a lot. Yes thinking of posting it in other sub reddits too. I agree . Petitions in UK are much more impactful due to their system. But India mein bhi hua hai yr actions and changes after petitions. Yes and you're thinking correctly. You should read this - After the removal of 377, there is no law for sexual assault of men, only assault. Assault carries a maximum penalty of two years. In the Trans Act, assault including sexual assault have a maximum penalty of two years. Coincidence? I think not. The government has taken a stance that two years should be maximum for rape if you are not a woman. Simple. Yeah...that is what I pointed out in my petition. That this is discriminatory towards men and transgender persons. All rapes are equally grave. I don't disagree with you. Quote the opposite. I agree that it is discriminatory. But the discrimination is intentional. They said this as much during the discussion of the Trans Bill itself that 'enraging the modesty of a woman is not the same as engaging the modesty of an eunuch'. The amendment raised by DMK MP Tiruchi Siva to make it equal to rape law was VOTED DOWN by the NDA. It is not an oversight. It is intentional. And while I respect the attempt at a petition and have signed it, petitions can only fix oversights, not intention to do harm by a government. I understand your valid point and frustration. We all know certain ongoing things are very intentional and unfair. Is it ? DMing the petition link. I understand and know your concern is valid. This is sadly seen all over the world. We should stand with all victims. I hope some day women like us can bring change. I'm not sure if you've lived in India for the past decade. But signing petitions will do fuck all. People protest outside for months and no one gives a shit so you really think your online petition will make any difference at all? The current regime is too arrogant, they won't give a shit about you unless you start hurting them electorally. *demagoguery Be informed and Vote next time Done. Constitution should not be a zero sum game i.e., safeguarding women’s rights do not qualify subjugating men. wait what? Yeah new laws Absolutely right. Well I have been living in India since birth. A millenial. Anyway, the road safety laws were made based on petitions. But I know that they are not as powerful as UK petitions. It is also bringing awareness....the more people know the more pressure. There is a post in Hindu that govt is now being pressured to create a law for men after backlash Well from what I've read, they're creating separate laws for men which will be drafted soon. Hence, the reason for excluding from the given section. It has been ongoing from before the backlash, it's just that this government sucks at communicating and discussing their bills at parliament so people know nothing about most of it until it's passed. See if they wanted they could have included when they launched this entire new law code. They have added many new sections like anti-trafficking , false promise to marry as seperate sexual offence with imprisionment called Section 69 etc. So, they already launched whatever new laws they wanted. Thing is they never expected the backlash that they are getting similar to how they thought of 400+. Pure delusion! So now they are under pressure to create a new law because people are not as dumb like before. Yeah that's the thing. If the bill was discussed in the parliament and scrutinised, all these issues with the bill would have been discussed, listed down and improved upon before it was passed. That's the basic process, the BJP is so arrogant they never follow this process. They just want to bulldoze everything to show that they're still in charge. Even the farm Bill could have easily worked if it was just passed after following a basic parliamentary process but it didn't because they tried to shove it down our throat. These are sad times unfortunately. Kind if helpless situation for us citizens. Yeah. But I do see the change. Most people have stopped buying their nonsense and finally seeing them for what they are. And with the NEET Scam, NET Scam, infrastructure failing all over the country, the smoke screen of development and good governance has faded and people are finally seeing their true colors. It's a slow process and it's just the beginning. This government will not go down quietly, it's gonna be a long ugly fight. Yes..let us keeo fingers crossed and be positive. That news article is from 11 years ago. Our vote matters. But better people need to fight elections. Since tou already read it deeply and I have some doubts. How the following two situation get handled now- 1) A men rapes another man. Will the victim be able to press charges? 2) A adult women rapes an underage. Will posco interfere or it will be the class underage male fault ? 3) An adult male rapes a underage male. 1) A man rapes another man is no longer a crime under the new BNS which started operating yesterday. 2) An adult woman rapes underage then POCSO will apply. POCSO is gender-neutral law. 3) An adult male rapes an underage male , POCSO applies here too. I have covered these issues in my petition so if you read it you will know. It's not just transgenders. I'm a straight male and I was sexually assaulted as a teenager. Wouldn't work here anyway, because government will just ignore such shit. We have to force politicians to deal with the matter, or kick them out of power. I agree that signing this petition does not guarantee change. However, it would help in reflecting public opinion and in a democracy, public opinion matters. So? An assertion relying on a veryyyy old article is kinda weak, bro. Sorry to hear that. Yes...this petition is for straight males being raped by both men and women. Also to give equal protection to transgenders. Done."
}