{
    "id": "qsq4ns",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/qsq4ns/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 28,
    "num_comments": 43,
    "created_utc": 1636767021,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Watched Wind River last week, great movie. Must watch.",
        "Watched free guy, was pretty fun",
        "Shang-Chi : Nice fight choreography..",
        "Kanakam Kamini kalaham was a laugh riot. Abosutely hilarious",
        "Jungle cruise.. Watch with family\\kids..",
        "Jai Bhim was great. It's available in Hindi too.",
        "Been hearing great things about Arcane on Netflix.",
        "Red notice. Fun entertainer.",
        "Our Little Sister (2015) by Hirokazu Kore-eda\n\nFeel good movie about four sisters living together. I saw someone call it a live-action Studio Ghibli movie and I'm inclined to agree.",
        "rewatched nightcrawler a couple of days ago. such a great movie, scary and bonechilling antihero executed to perfection by jake gyllenhaal. \n\nbinge watched mieruko chan yesterday, really liked it.",
        "Watched Eternals today. It was so boring I fell asleep midway!",
        "Hobbs &amp; Shaw if you need a multistarrer action flick for the weekend",
        "Guys watch succession great series. It's about business and family politics of a rich family. Great show by HBO.",
        "I second this. Succession is great.",
        "Saw Maid on Netflix. Can't remember the last time a movie or show made me feel this many emotions.",
        "Is it good?",
        "Liked a Marvel movie after a long time. Fuck the Marvel Universe and the larger plot, I just want good standalone movies.",
        "What genre?",
        "That shootout scene was amazing! Movie overall was pretty disturbing and depressing which was kinda the point. This movie deserves to be watched by more people.",
        "Good time pass movie. Won't be bored watching it.",
        "&gt;Is it good?\n\nsame old action comedy stuff",
        "&gt; Hell or High water\n\nI liked hell or high water and would definitely recommend - great actors who stays in their characters through out and it feels real. cinematography was on point, writing was great but I dont know why but I had much more expectations from it maybe because of the reviews. Its a slow burn in the start and you expect something big is about to happen but in the end it kinda lets you down. Jeff's epilogue is great but idk why i felt I needed something more in the end.",
        "I highly recommend watching Magnificent Century. It is a Turkish TV series, all episodes freely available on YouTube. It's based Suleiman - The Magnificent's life, politics and succession struggles. If you liked GoT then you'll love this show to death.\nP.S - Language is in Turkish but english subtitles are there.",
        "Watched Jai bhim, it's a must watch movie.\nAlso, Free guy!! An ocassioal gamer myself, loved it.",
        "It's funny.",
        "Arcane - A league of legends TV series made by RIOT games. As a dota player I would never have imagined I would say this, but RIOT knocked it out of the park with this series. So far 6 episodes have come out and they are insanely animated with a great story. I highly recommend [Arcane](https://www.imdb.com/title/tt11126994/).",
        "Over dramatic, stopped watching after 30 mins",
        "+1",
        "Dune 2021 was amazing. Denis has managed to pull it off. Now I am waiting for part 2.",
        "watched squid game!",
        "Watched Jai Bhim today. It was exceptional.",
        "Hindi dubbing was so bad",
        "Watched Asuran and Bhavesh Joshi Superhero.. now my blood is boiling at all the injustice in the world.",
        "Yes, as usual, dubbed movies are never as good as the original one. But it was still much better than the Hindi movies we get nowadays.",
        "Felt more like a Shaolin Soccer kind of movie, doesn't feel like a MCU movie",
        "Yesss I love this show",
        "&gt; Bhavesh Joshi Superhero.\n\nhow is that one? Missed it when it came out.",
        "Check out the works of Hirokazu Kore-eda if you are into drama films. Nobody knows, Still Walking( its serene and simple ending still gets me every time), Our Little Sister and of course Shoplifters (believe me this one has a very real dramatic twist).\n\nIf you prefer dramatic thrillers then go with Villeneuves' works like Enemy, Incendies and Sicario",
        "Though critics reviews are not so good, the movie is definitely good. I really liked it's genuineness. Harsh wardhan Kapoor has not been able to express some of moments that well but others he fits. The movie will have the intended effect on viewer."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "watched wind river last week great movie must watch watched free guy pretty fun shangchi nice fight choreography kanakam kamini kalaham laugh riot abosutely hilarious jungle cruise watch familykids jai bhim great available hindi hearing great things arcane netflix red notice fun entertainer little sister hirokazu koreeda feel good movie four sisters living together saw someone call liveaction studio ghibli movie im inclined agree rewatched nightcrawler couple days ago great movie scary bonechilling antihero executed perfection jake gyllenhaal binge watched mieruko chan yesterday really liked watched eternals today boring fell asleep midway hobbs amp shaw need multistarrer action flick weekend guys watch succession great series business family politics rich family great show hbo second succession great saw maid netflix cant remember last time movie show made feel many emotions good liked marvel movie long time fuck marvel universe larger plot want good standalone movies genre shootout scene amazing movie overall pretty disturbing depressing kinda point movie deserves watched people good time pass movie wont bored watching gtis good old action comedy stuff gt hell high water liked hell high water would definitely recommend great actors stays characters feels real cinematography point writing great dont know much expectations maybe reviews slow burn start expect something big happen end kinda lets jeffs epilogue great idk felt needed something end highly recommend watching magnificent century turkish tv series episodes freely available youtube based suleiman magnificents life politics succession struggles liked got youll love show death ps language turkish english subtitles watched jai bhim must watch movie also free guy ocassioal gamer loved funny arcane league legends tv series made riot games dota player would never imagined would say riot knocked park series far episodes come insanely animated great story highly recommend arcanehttpswwwimdbcomtitlett dramatic stopped watching mins dune amazing denis managed pull waiting part watched squid game watched jai bhim today exceptional hindi dubbing bad watched asuran bhavesh joshi superhero blood boiling injustice world yes usual dubbed movies never good original one still much better hindi movies get nowadays felt like shaolin soccer kind movie doesnt feel like mcu movie yesss love show gt bhavesh joshi superhero one missed came check works hirokazu koreeda drama films nobody knows still walking serene simple ending still gets every time little sister course shoplifters believe one real dramatic twist prefer dramatic thrillers go villeneuves works like enemy incendies sicario though critics reviews good movie definitely good really liked genuineness harsh wardhan kapoor able express moments well others fits movie intended effect viewer",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Watched Wind River last week, great movie. Must watch. Watched free guy, was pretty fun Shang-Chi : Nice fight choreography.. Kanakam Kamini kalaham was a laugh riot. Abosutely hilarious Jungle cruise.. Watch with family\\kids.. Jai Bhim was great. It's available in Hindi too. Been hearing great things about Arcane on Netflix. Red notice. Fun entertainer. Our Little Sister (2015) by Hirokazu Kore-eda Feel good movie about four sisters living together. I saw someone call it a live-action Studio Ghibli movie and I'm inclined to agree. rewatched nightcrawler a couple of days ago. such a great movie, scary and bonechilling antihero executed to perfection by jake gyllenhaal. binge watched mieruko chan yesterday, really liked it. Watched Eternals today. It was so boring I fell asleep midway! Hobbs &amp; Shaw if you need a multistarrer action flick for the weekend Guys watch succession great series. It's about business and family politics of a rich family. Great show by HBO. I second this. Succession is great. Saw Maid on Netflix. Can't remember the last time a movie or show made me feel this many emotions. Is it good? Liked a Marvel movie after a long time. Fuck the Marvel Universe and the larger plot, I just want good standalone movies. What genre? That shootout scene was amazing! Movie overall was pretty disturbing and depressing which was kinda the point. This movie deserves to be watched by more people. Good time pass movie. Won't be bored watching it. &gt;Is it good? same old action comedy stuff &gt; Hell or High water I liked hell or high water and would definitely recommend - great actors who stays in their characters through out and it feels real. cinematography was on point, writing was great but I dont know why but I had much more expectations from it maybe because of the reviews. Its a slow burn in the start and you expect something big is about to happen but in the end it kinda lets you down. Jeff's epilogue is great but idk why i felt I needed something more in the end. I highly recommend watching Magnificent Century. It is a Turkish TV series, all episodes freely available on YouTube. It's based Suleiman - The Magnificent's life, politics and succession struggles. If you liked GoT then you'll love this show to death. P.S - Language is in Turkish but english subtitles are there. Watched Jai bhim, it's a must watch movie. Also, Free guy!! An ocassioal gamer myself, loved it. It's funny. Arcane - A league of legends TV series made by RIOT games. As a dota player I would never have imagined I would say this, but RIOT knocked it out of the park with this series. So far 6 episodes have come out and they are insanely animated with a great story. I highly recommend [Arcane](https://www.imdb.com/title/tt11126994/). Over dramatic, stopped watching after 30 mins +1 Dune 2021 was amazing. Denis has managed to pull it off. Now I am waiting for part 2. watched squid game! Watched Jai Bhim today. It was exceptional. Hindi dubbing was so bad Watched Asuran and Bhavesh Joshi Superhero.. now my blood is boiling at all the injustice in the world. Yes, as usual, dubbed movies are never as good as the original one. But it was still much better than the Hindi movies we get nowadays. Felt more like a Shaolin Soccer kind of movie, doesn't feel like a MCU movie Yesss I love this show &gt; Bhavesh Joshi Superhero. how is that one? Missed it when it came out. Check out the works of Hirokazu Kore-eda if you are into drama films. Nobody knows, Still Walking( its serene and simple ending still gets me every time), Our Little Sister and of course Shoplifters (believe me this one has a very real dramatic twist). If you prefer dramatic thrillers then go with Villeneuves' works like Enemy, Incendies and Sicario Though critics reviews are not so good, the movie is definitely good. I really liked it's genuineness. Harsh wardhan Kapoor has not been able to express some of moments that well but others he fits. The movie will have the intended effect on viewer."
}