{
    "id": "1dvbukd",
    "title": "Sick and tired of male discrimination in this country",
    "url": "https://www.reddit.com/r/india/comments/1dvbukd/sick_and_tired_of_male_discrimination_in_this/",
    "selftext": "First of all let me start with myself, I am a software developer at a company that is not primarily focused on technology. I achieved a 98.5 percentile in the JEE Mains, gained admission to one of the premier colleges in the country, and completed my BTech. At the time of college placements there was a recession due to covid and placements were badly affected. [The situation is even worse for 2024 graduates](https://www.business-standard.com/india-news/iits-turn-to-alumni-for-jobs-as-38-students-of-2024-batch-yet-to-be-placed-124052300331_1.html) . Based on previous year placements I was expecting above 15 LPA package but got less than 10 LPA. Only two of the FAANG companies visited out campus, now let me tell you how they hired us freshers,\n\nFrom our branch that consisted of 90 + boys and roughly 12 Girls they selected 3-4 girls (I am not sure about one of them)  but no boy not even the branch topper.\n\nOne of my friends cleared first round of the interview and was ready for the second round but at the final moment they released a new list of students who were eligible for second interview. The new list had more girls and names of many boys was dropped including his.\n\nThere are other 5 girls who got placed with 30+ LPA at non-FAANG companies. The remaining couple of girls also got placed at very decent companies. As far as I know none of the 12 girls is unemployed.\n\n  \nCut to the recession part a lot of boys including my friends who are very talented didn't secure a job. Some of them were great dudes had 8.5+ GPA did competitive coding and yet they are struggling to find even a 4 LPA job. PS I am not talking about people from some tier 2 or tier 3 colleges they're from so called premier colleges like IITs and NITs.\n\n  \nAt my current company there were about 40 Freshers and only one girl among us. All of us have wanted to quit this job because there is no high - tech work here and we feel like we aren't learning enough at the initial stage of our career and we worked hard to get into premier colleges and had high hopes. After one year only one of us was able to leave this company and secure a very nice job at  FAANG . And guess who that person might be??? That person is the only girl among all the other freshers. \n\nMy friends in other companies have shared similar stories. \n\n  \nMeanwhile neither me nor any of my friends were  able to secure even an interview for a top level company.\n\nMany of our seniors who are 2-3 years older than us have worked tooth and nail for this company and never got a significant increment . All of them are boys and are unable to find another job even after having so much experience. And all of them are boys because the few girls they had with them when they were freshers left for better companies one or two years after joining.\n\nOnce I was looking for further studies and found this:\n\n* [ IITs have 20% supernumerary seats reserved for female candidates. ](https://www.allenoverseas.com/blog/supernumerary-seats-reservation-for-girls-in-jee-advanced/)\n* [Top business schools like IIMs,FMS,SPJIMR provide female candidates with extra points or marks to increase female intake](https://www.shiksha.com/mba/articles/how-much-cat-score-is-required-for-fms-blogId-19565).\n\nBecause of the horrible gender ratio that is consistent across engineering ie, roughly 1:10 girl to boy. Most of the boys are single. Most of them never had a close friendship with a single girl. I have seen so many guys that were both intelligent and funny having self doubt because of not finding a girl. Meanwhile most of the girls at college and office are taken , the single ones are single by choice and have plenty of good boys running after them.\n\nThe most sad part is that almost all of those boys will get to know a girl only after their arranged marriage.\n\nI have seen guys from college and work being extremely sad and sometimes even saw them cry because of loneliness. \n\n  \nI broke up with my girlfriend years ago and now for me too the only option is arrange marriage if I don't want to die alone. But arrange marriages scare the shit out of me as there are so many discriminatory laws against men. Not finding the right girl is my biggest fear as I have seen so many women misuse the [dowry](https://www.legalserviceindia.com/article/l467-Misuse-of-Anti-Dowry-Laws.html) and [marriage](https://lawbeat.in/top-stories/misuse-498a-supreme-court-union-govt-consider-pragmatic-realities-make-necessary-changes-new-law)  laws to get money from their husbands and cheat on them. \n\nSo many false rape cases are framed against men, one of my friends dad is a lawyer and he frequently asks him to stay aways from wrong kind of girls, but on the other [hand](https://www.indiatimes.com/explainers/news/can-women-be-charged-for-rape-in-india-556642.html) the laws does not even consider that a woman can be a rapist\n\nFor finding a good match in this arranged marriage market I need to earn more which brings me back to the hellish cycle of job hunt. \n\n  \nIn western countries single men are encouraged to step outside of their houses and meet girls and it is pretty normalised by the society. But what are we supposed to do.  \n\nI have nothing against girls but we boys are being screwed by system and society and idk why but nobody seems to talk about it.  \n ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1720112666.0,
    "convurl": "https://external-preview.redd.it/jjKsaDa56PpKv7XDGinCXlrS1csw8K_MFUiAAUiIu1s.jpg?auto=webp&s=bb4a891492afa53722b246ef5b7157504ab0d94e",
    "comments": [],
    "cleaned_text": "sick tired male discrimination country first let start software developer company primarily focused technology achieved percentile jee mains gained admission one premier colleges country completed btech time college placements recession due covid placements badly affected situation even worse graduateshttpswwwbusinessstandardcomindianewsiitsturntoalumniforjobsasstudentsofbatchyettobeplacedhtml based previous year placements expecting lpa package got less lpa two faang companies visited campus let tell hired us freshers branch consisted boys roughly girls selected girls sure one boy even branch topper one friends cleared first round interview ready second round final moment released new list students eligible second interview new list girls names many boys dropped including girls got placed lpa nonfaang companies remaining couple girls also got placed decent companies far know none girls unemployed cut recession part lot boys including friends talented didnt secure job great dudes gpa competitive coding yet struggling find even lpa job ps talking people tier tier colleges theyre called premier colleges like iits nits current company freshers one girl among us us wanted quit job high tech work feel like arent learning enough initial stage career worked hard get premier colleges high hopes one year one us able leave company secure nice job faang guess person might person girl among freshers friends companies shared similar stories meanwhile neither friends able secure even interview top level company many seniors years older us worked tooth nail company never got significant increment boys unable find another job even much experience boys girls freshers left better companies one two years joining looking studies found iits supernumerary seats reserved female candidates httpswwwallenoverseascomblogsupernumeraryseatsreservationforgirlsinjeeadvanced top business schools like iimsfmsspjimr provide female candidates extra points marks increase female intakehttpswwwshikshacommbaarticleshowmuchcatscoreisrequiredforfmsblogid horrible gender ratio consistent across engineering ie roughly girl boy boys single never close friendship single girl seen many guys intelligent funny self doubt finding girl meanwhile girls college office taken single ones single choice plenty good boys running sad part almost boys get know girl arranged marriage seen guys college work extremely sad sometimes even saw cry loneliness broke girlfriend years ago option arrange marriage dont want die alone arrange marriages scare shit many discriminatory laws men finding right girl biggest fear seen many women misuse dowryhttpswwwlegalserviceindiacomarticlelmisuseofantidowrylawshtml marriagehttpslawbeatintopstoriesmisuseasupremecourtuniongovtconsiderpragmaticrealitiesmakenecessarychangesnewlaw laws get money husbands cheat many false rape cases framed men one friends dad lawyer frequently asks stay aways wrong kind girls handhttpswwwindiatimescomexplainersnewscanwomenbechargedforrapeinindiahtml laws even consider woman rapist finding good match arranged marriage market need earn brings back hellish cycle job hunt western countries single men encouraged step outside houses meet girls pretty normalised society supposed nothing girls boys screwed system society idk nobody seems talk ",
    "cleaned_title": "sick tired male discrimination country",
    "cleaned_selftext": "first let start software developer company primarily focused technology achieved percentile jee mains gained admission one premier colleges country completed btech time college placements recession due covid placements badly affected situation even worse graduateshttpswwwbusinessstandardcomindianewsiitsturntoalumniforjobsasstudentsofbatchyettobeplacedhtml based previous year placements expecting lpa package got less lpa two faang companies visited campus let tell hired us freshers branch consisted boys roughly girls selected girls sure one boy even branch topper one friends cleared first round interview ready second round final moment released new list students eligible second interview new list girls names many boys dropped including girls got placed lpa nonfaang companies remaining couple girls also got placed decent companies far know none girls unemployed cut recession part lot boys including friends talented didnt secure job great dudes gpa competitive coding yet struggling find even lpa job ps talking people tier tier colleges theyre called premier colleges like iits nits current company freshers one girl among us us wanted quit job high tech work feel like arent learning enough initial stage career worked hard get premier colleges high hopes one year one us able leave company secure nice job faang guess person might person girl among freshers friends companies shared similar stories meanwhile neither friends able secure even interview top level company many seniors years older us worked tooth nail company never got significant increment boys unable find another job even much experience boys girls freshers left better companies one two years joining looking studies found iits supernumerary seats reserved female candidates httpswwwallenoverseascomblogsupernumeraryseatsreservationforgirlsinjeeadvanced top business schools like iimsfmsspjimr provide female candidates extra points marks increase female intakehttpswwwshikshacommbaarticleshowmuchcatscoreisrequiredforfmsblogid horrible gender ratio consistent across engineering ie roughly girl boy boys single never close friendship single girl seen many guys intelligent funny self doubt finding girl meanwhile girls college office taken single ones single choice plenty good boys running sad part almost boys get know girl arranged marriage seen guys college work extremely sad sometimes even saw cry loneliness broke girlfriend years ago option arrange marriage dont want die alone arrange marriages scare shit many discriminatory laws men finding right girl biggest fear seen many women misuse dowryhttpswwwlegalserviceindiacomarticlelmisuseofantidowrylawshtml marriagehttpslawbeatintopstoriesmisuseasupremecourtuniongovtconsiderpragmaticrealitiesmakenecessarychangesnewlaw laws get money husbands cheat many false rape cases framed men one friends dad lawyer frequently asks stay aways wrong kind girls handhttpswwwindiatimescomexplainersnewscanwomenbechargedforrapeinindiahtml laws even consider woman rapist finding good match arranged marriage market need earn brings back hellish cycle job hunt western countries single men encouraged step outside houses meet girls pretty normalised society supposed nothing girls boys screwed system society idk nobody seems talk",
    "cleaned_comments": "",
    "light_cleaned_title": "Sick and tired of male discrimination in this country",
    "light_cleaned_selftext": "First of all let me start with myself, I am a software developer at a company that is not primarily focused on technology. I achieved a 98.5 percentile in the JEE Mains, gained admission to one of the premier colleges in the country, and completed my BTech. At the time of college placements there was a recession due to covid and placements were badly affected. [The situation is even worse for 2024 graduates](https://www.business-standard.com/india-news/iits-turn-to-alumni-for-jobs-as-38-students-of-2024-batch-yet-to-be-placed-124052300331_1.html) . Based on previous year placements I was expecting above 15 LPA package but got less than 10 LPA. Only two of the FAANG companies visited out campus, now let me tell you how they hired us freshers, From our branch that consisted of 90 + boys and roughly 12 Girls they selected 3-4 girls (I am not sure about one of them) but no boy not even the branch topper. One of my friends cleared first round of the interview and was ready for the second round but at the final moment they released a new list of students who were eligible for second interview. The new list had more girls and names of many boys was dropped including his. There are other 5 girls who got placed with 30+ LPA at non-FAANG companies. The remaining couple of girls also got placed at very decent companies. As far as I know none of the 12 girls is unemployed. Cut to the recession part a lot of boys including my friends who are very talented didn't secure a job. Some of them were great dudes had 8.5+ GPA did competitive coding and yet they are struggling to find even a 4 LPA job. PS I am not talking about people from some tier 2 or tier 3 colleges they're from so called premier colleges like IITs and NITs. At my current company there were about 40 Freshers and only one girl among us. All of us have wanted to quit this job because there is no high - tech work here and we feel like we aren't learning enough at the initial stage of our career and we worked hard to get into premier colleges and had high hopes. After one year only one of us was able to leave this company and secure a very nice job at FAANG . And guess who that person might be??? That person is the only girl among all the other freshers. My friends in other companies have shared similar stories. Meanwhile neither me nor any of my friends were able to secure even an interview for a top level company. Many of our seniors who are 2-3 years older than us have worked tooth and nail for this company and never got a significant increment . All of them are boys and are unable to find another job even after having so much experience. And all of them are boys because the few girls they had with them when they were freshers left for better companies one or two years after joining. Once I was looking for further studies and found this: * [ IITs have 20% supernumerary seats reserved for female candidates. ](https://www.allenoverseas.com/blog/supernumerary-seats-reservation-for-girls-in-jee-advanced/) * [Top business schools like IIMs,FMS,SPJIMR provide female candidates with extra points or marks to increase female intake](https://www.shiksha.com/mba/articles/how-much-cat-score-is-required-for-fms-blogId-19565). Because of the horrible gender ratio that is consistent across engineering ie, roughly 1:10 girl to boy. Most of the boys are single. Most of them never had a close friendship with a single girl. I have seen so many guys that were both intelligent and funny having self doubt because of not finding a girl. Meanwhile most of the girls at college and office are taken , the single ones are single by choice and have plenty of good boys running after them. The most sad part is that almost all of those boys will get to know a girl only after their arranged marriage. I have seen guys from college and work being extremely sad and sometimes even saw them cry because of loneliness. I broke up with my girlfriend years ago and now for me too the only option is arrange marriage if I don't want to die alone. But arrange marriages scare the shit out of me as there are so many discriminatory laws against men. Not finding the right girl is my biggest fear as I have seen so many women misuse the [dowry](https://www.legalserviceindia.com/article/l467-Misuse-of-Anti-Dowry-Laws.html) and [marriage](https://lawbeat.in/top-stories/misuse-498a-supreme-court-union-govt-consider-pragmatic-realities-make-necessary-changes-new-law) laws to get money from their husbands and cheat on them. So many false rape cases are framed against men, one of my friends dad is a lawyer and he frequently asks him to stay aways from wrong kind of girls, but on the other [hand](https://www.indiatimes.com/explainers/news/can-women-be-charged-for-rape-in-india-556642.html) the laws does not even consider that a woman can be a rapist For finding a good match in this arranged marriage market I need to earn more which brings me back to the hellish cycle of job hunt. In western countries single men are encouraged to step outside of their houses and meet girls and it is pretty normalised by the society. But what are we supposed to do. I have nothing against girls but we boys are being screwed by system and society and idk why but nobody seems to talk about it.",
    "light_cleaned_comments": ""
}