{
    "id": "1d76fnh",
    "title": "Election Commission of India ad is a waste of tax-payer's money.",
    "url": "https://i.redd.it/bwzfqmkxed4d1.jpeg",
    "selftext": "Full page ad in Times of India, Mumbai, Monday, 3 June, 2024",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 12,
    "created_utc": 1717426572.0,
    "convurl": "https://i.redd.it/bwzfqmkxed4d1.jpeg",
    "comments": [
        "Atleast these are good rather then those ads by government where they try to gain popularity by giving out false info on the schemes they introduced 😔😅",
        "How is this a waste? This will encourage youth to become first time voters. This is putting casting your vote as a positive action. It's a good use of our money. We need more people to come out and vote.",
        "1.35 lakh crore spent for 2024 elections! \n\nJust to put that in perspective...that money is equal to...\n\n2024-2025 budget allocation for the following ministers combined.\n\nISRO - 13,042 Cr.\nMinistry of Atomic energy - 24,968 Cr\nHealth ministry - 90,658 Cr\nFisheries - 2,352 Cr\nEnvironment ministry - 3,265 Cr\n\n\nAnd still short of 1000 Cr ....\n\nSo much of our money spent on elections. Hope we choose a worthy government.",
        "Let's also divide the election budget by 5, as this expenditure is incurred every 5 years. Let's also put our support for one nation one election when it lands.",
        "One nation one election leads to to further centralization of power and lower accountability towards citizens. It is ripe for abuse no matter who sits in the chair.",
        "Lol if it hasn't gone through your head yet, it is election outreach. And conducting an election on this scale isn't easy, especially in a country like ours.",
        "What is the cost of this ad?",
        "Thanks for your comment.\n\nNow I understand that \"outreach\" is the latest fancy word for wasting the tax-payer's money.\n\nSo, because it is not easy to conduct an election on this scale, we have a good excuse for wasting money.",
        "You're talking like as if they misspent and laundered money that was meant for a highway project.\n\nYes, it's not easy to conduct an election on a scale like India. People came to vote him sweltering heat and I think it's not unreasonable to thank them.",
        "Mind taking over and showing them how its done? 🤔"
    ],
    "cleaned_text": "election commission india ad waste taxpayers money full page ad times india mumbai monday june ",
    "cleaned_title": "election commission india ad waste taxpayers money",
    "cleaned_selftext": "full page ad times india mumbai monday june",
    "cleaned_comments": "atleast good rather ads government try gain popularity giving false info schemes introduced waste encourage youth become first time voters putting casting vote positive action good use money need people come vote lakh crore spent elections put perspectivethat money equal budget allocation following ministers combined isro cr ministry atomic energy cr health ministry cr fisheries cr environment ministry cr still short cr much money spent elections hope choose worthy government lets also divide election budget expenditure incurred every years lets also put support one nation one election lands one nation one election leads centralization power lower accountability towards citizens ripe abuse matter sits chair lol hasnt gone head yet election outreach conducting election scale isnt easy especially country like cost ad thanks comment understand outreach latest fancy word wasting taxpayers money easy conduct election scale good excuse wasting money youre talking like misspent laundered money meant highway project yes easy conduct election scale like india people came vote sweltering heat think unreasonable thank mind taking showing done",
    "light_cleaned_title": "Election Commission of India ad is a waste of tax-payer's money.",
    "light_cleaned_selftext": "Full page ad in Times of India, Mumbai, Monday, 3 June, 2024",
    "light_cleaned_comments": "Atleast these are good rather then those ads by government where they try to gain popularity by giving out false info on the schemes they introduced 😔😅 How is this a waste? This will encourage youth to become first time voters. This is putting casting your vote as a positive action. It's a good use of our money. We need more people to come out and vote. 1.35 lakh crore spent for 2024 elections! Just to put that in perspective...that money is equal to... 2024-2025 budget allocation for the following ministers combined. ISRO - 13,042 Cr. Ministry of Atomic energy - 24,968 Cr Health ministry - 90,658 Cr Fisheries - 2,352 Cr Environment ministry - 3,265 Cr And still short of 1000 Cr .... So much of our money spent on elections. Hope we choose a worthy government. Let's also divide the election budget by 5, as this expenditure is incurred every 5 years. Let's also put our support for one nation one election when it lands. One nation one election leads to to further centralization of power and lower accountability towards citizens. It is ripe for abuse no matter who sits in the chair. Lol if it hasn't gone through your head yet, it is election outreach. And conducting an election on this scale isn't easy, especially in a country like ours. What is the cost of this ad? Thanks for your comment. Now I understand that \"outreach\" is the latest fancy word for wasting the tax-payer's money. So, because it is not easy to conduct an election on this scale, we have a good excuse for wasting money. You're talking like as if they misspent and laundered money that was meant for a highway project. Yes, it's not easy to conduct an election on a scale like India. People came to vote him sweltering heat and I think it's not unreasonable to thank them. Mind taking over and showing them how its done? 🤔"
}