{
    "id": "137bi9e",
    "title": "what is the trick to get success in booking train tatkal tickets online?",
    "url": "https://www.reddit.com/r/india/comments/137bi9e/what_is_the_trick_to_get_success_in_booking_train/",
    "selftext": "Any trick ? I tried amazon pay , Paytm , apps. but no luck. IRCTC website is slow. other apps like confirmkt , EaseMyTrip the same pop up message its 10:15 am for AC , 11:15am for Sleeper Class since the correct time is 10am & 11am. However , offline is horrible experiences making a Q line is chasing 1st No. in Varanasi Rail reservation building. The same bad situations in other Railway stations like some random guys put tatkal forms with numbers in advance and we never know this day & time.\n\nhttps://preview.redd.it/xca8nbsd7rxa1.png?width=354&format=png&auto=webp&v=enabled&s=e41cf1f488419da006f65106998c5d1bd5ec889b",
    "flair": "AskIndia",
    "score": 18,
    "num_comments": 35,
    "created_utc": 1683179492.0,
    "convurl": "https://b.thumbs.redditmedia.com/--yQL3sMB2UvmuLCucAKvitlHln86aGo7PI4q9tbztQ.jpg",
    "comments": [
        "You can try ConfrmTkt if that works. Its ironic that the shitty IRCTC site will be used to book tickets for bullet trains.",
        "I read somewhere chrome browser is faster catching net speed over other browsers.",
        "Browsers have nothing to do with this. Most browsers are fast enough, including Egde. The issue is with IRCTC and sheer number of people trying to access the platform at the same time.",
        "previously we used to be able to pre-populate the traveller info using plugins, does it work now?",
        "Dont use master list... Its slow",
        "Good device, good internet, fast typing, rest is your luck.",
        "if you're the passenger then do add your travel bio details in your profile first. Try UPI scan option. Be right on time. Works for me everytime. Never missed so far",
        "IRCTC website? what is the browser?",
        "Always book via Desktop/Laptop. \n\nAdd your names to passenger list and verify it before hand. \n\nAlso pay via IRCTC wallet. \n\nClick search button exact 10.00 am / 11.00am, select your passengers from drop down list (saved before hand in passenger list) and pay via irctc wallet.\n\nIt works for me 99% of time",
        "how about this from desktop\n\n[https://www.amazon.in/train-tickets/](https://www.amazon.in/train-tickets/)",
        "Edge/Chrome. For me website>mobile app",
        "Install IRCTC app...add passengers into master passenger list in advance...atleast before 8 am as the app doesn't allow you to add passenger details after 9 am...be ready by 9.58 am for AC booking...it reloads for eternity but don't panic...wait...pay via card even if it's expensive by 10-15 rupees than upi...\n\nNever ever got Tatkal ticket waitlisted....been booking atleast for the past 5 years by following above steps",
        ">\\>mobile app\n\nwhat is that app? link here pls",
        "I log onto IRCTC or Easymytrip at 10am and book, simple. You booking non ac? I believe AC booking starts at 10am, non AC 11, right?",
        "> IRCTC app\n\n[https://play.google.com/store/apps/details?id=cris.org.in.prs.ima&hl=en&gl=US](https://play.google.com/store/apps/details?id=cris.org.in.prs.ima&hl=en&gl=US) , is this ?",
        "yes , AC starts at 10 am and Non AC SL starts at 11am . but on 3rd party apps like amazon india , paytm , etc. it there was a pop up message : booking starts at 10:15 am and 11:15 am and by the time all reservation finished. who will gonna tell amazon , paytm this tatkal tickets do exists within 3 minutes.",
        "[https://play.google.com/store/apps/details?id=cris.org.in.prs.ima&hl=en&gl=US](https://play.google.com/store/apps/details?id=cris.org.in.prs.ima&hl=en&gl=US)",
        "Yes... this is the one...it opens at 10 am for AC which is 15 mins earlier than all other service providers and agent apps...so you can book Tatkal easily here",
        "Good advice from others. Alternatively, find a secluded station.",
        "Garmi ke tym baa, lagan tej ba,.\nKucho Karla tohar ticket confirm na hoi.",
        "\n>who will gonna tell amazon , paytm this tatkal tickets do exists within 3 minutes.\n\nThis restriction is from IRCTC and not from the third party service.",
        "I've seen someone use the website and it was horrible. I've never used it myself and always booked through their app. Never had any kind of issues, the whole process was smooth.\n\nOn the app, add the passengers after you make an account and then start booking. I have booked tickets at random times and never had issues either. Also, if you're gonna book tickets a day or two before your expected travel date, you'll almost never find a seat, even in tatkal. That's just my experience.",
        "I have 100% Success rate on IRCTC app.. AMA",
        "I'm struggling to book my family's tickets from last 5 days bro 😭",
        "Today I tried but app is dead slow from 09:59 am to 10:05 am  Booking for AC tatkal ticket  AND  from 10:59am  to 11:05 am to book SL class  because Rail server is busy since lakhs of people accessing. is that correct?\n\nhttps://preview.redd.it/ic4fqbx0s7ya1.png?width=864&format=png&auto=webp&v=enabled&s=c16ac10aa4c4c61009b5028fc81f1aa3ae38a1dd",
        "Today I tried but app is dead slow from 09:59 am to 10:05 am  Booking  for AC tatkal ticket  AND  from 10:59am  to 11:05 am to book SL class   because Rail server is busy since lakhs of people accessing. is that  correct?\n\nhttps://preview.redd.it/ddho2z5us7ya1.png?width=864&format=png&auto=webp&v=enabled&s=7a5b846228f9cbd78edf25f17b7789c6eee20ec9",
        ">This restriction is from IRCTC and not from the third party service.\n\nyes we all know but what is the point amazon , paytm like 3rd party apps. opened tatkal windows? but if someone want to book General ticket then it is useful .",
        "amazon pay , screenshot I already shared. if you want to book Normal then it is OK .",
        " Today I tried but app is dead slow from 09:59 am to 10:05 am  Booking  for AC tatkal ticket  AND  from 10:59am  to 11:05 am to book SL class   because Rail server is busy since lakhs of people accessing. is that  correct? \n\nhttps://preview.redd.it/i5ni1ndht7ya1.png?width=864&format=png&auto=webp&v=enabled&s=c72f7bcc6adc13bf9b386bec38d426cfaaaca554",
        "offline is only the best solution to get taktal tickets what I analysed. make a queue line physically turning up at Railway booking if your number is 1 and 2 then you will get tatkal tickets.\n\nTatkal booking server is faster at Railways Booking.",
        "Yeah...it ll be pretty slow but you'll be able to book",
        "Can you book for me pls?",
        "Woah that's brilliant, please give tips?? What all to keep in mind?",
        "Just login 2 minutes before the booking time and pay using UPI.. I use GPay in Razor Pay.. that’s it..",
        "Will VPS help in booking tickets??\n\nas it gives tremendous speed"
    ],
    "cleaned_text": "trick get success booking train tatkal tickets online trick tried amazon pay paytm apps luck irctc website slow apps like confirmkt easemytrip pop message ac sleeper class since correct time however offline horrible experiences making q line chasing st varanasi rail reservation building bad situations railway stations like random guys put tatkal forms numbers advance never know day time ",
    "cleaned_title": "trick get success booking train tatkal tickets online",
    "cleaned_selftext": "trick tried amazon pay paytm apps luck irctc website slow apps like confirmkt easemytrip pop message ac sleeper class since correct time however offline horrible experiences making q line chasing st varanasi rail reservation building bad situations railway stations like random guys put tatkal forms numbers advance never know day time",
    "cleaned_comments": "try confrmtkt works ironic shitty irctc site used book tickets bullet trains read somewhere chrome browser faster catching net speed browsers browsers nothing browsers fast enough including egde issue irctc sheer number people trying access platform time previously used able prepopulate traveller info using plugins work dont use master list slow good device good internet fast typing rest luck youre passenger add travel bio details profile first try upi scan option right time works everytime never missed far irctc website browser always book via desktoplaptop add names passenger list verify hand also pay via irctc wallet click search button exact select passengers drop list saved hand passenger list pay via irctc wallet works time desktop httpswwwamazonintrainticketshttpswwwamazonintraintickets edgechrome websitemobile app install irctc appadd passengers master passenger list advanceatleast app doesnt allow add passenger details ambe ready ac bookingit reloads eternity dont panicwaitpay via card even expensive rupees upi never ever got tatkal ticket waitlistedbeen booking atleast past years following steps mobile app app link pls log onto irctc easymytrip book simple booking non ac believe ac booking starts non ac right irctc app httpsplaygooglecomstoreappsdetailsidcrisorginprsimahlenglushttpsplaygooglecomstoreappsdetailsidcrisorginprsimahlenglus yes ac starts non ac sl starts rd party apps like amazon india paytm etc pop message booking starts time reservation finished gon na tell amazon paytm tatkal tickets exists within minutes httpsplaygooglecomstoreappsdetailsidcrisorginprsimahlenglushttpsplaygooglecomstoreappsdetailsidcrisorginprsimahlenglus yes oneit opens ac mins earlier service providers agent appsso book tatkal easily good advice others alternatively find secluded station garmi ke tym baa lagan tej ba kucho karla tohar ticket confirm na hoi gon na tell amazon paytm tatkal tickets exists within minutes restriction irctc third party service ive seen someone use website horrible ive never used always booked app never kind issues whole process smooth app add passengers make account start booking booked tickets random times never issues either also youre gon na book tickets day two expected travel date youll almost never find seat even tatkal thats experience success rate irctc app ama im struggling book familys tickets last days bro today tried app dead slow booking ac tatkal ticket book sl class rail server busy since lakhs people accessing correct today tried app dead slow booking ac tatkal ticket book sl class rail server busy since lakhs people accessing correct restriction irctc third party service yes know point amazon paytm like rd party apps opened tatkal windows someone want book general ticket useful amazon pay screenshot already shared want book normal ok today tried app dead slow booking ac tatkal ticket book sl class rail server busy since lakhs people accessing correct offline best solution get taktal tickets analysed make queue line physically turning railway booking number get tatkal tickets tatkal booking server faster railways booking yeahit pretty slow youll able book book pls woah thats brilliant please give tips keep mind login minutes booking time pay using upi use gpay razor pay thats vps help booking tickets gives tremendous speed",
    "light_cleaned_title": "what is the trick to get success in booking train tatkal tickets online?",
    "light_cleaned_selftext": "Any trick ? I tried amazon pay , Paytm , apps. but no luck. IRCTC website is slow. other apps like confirmkt , EaseMyTrip the same pop up message its 10:15 am for AC , 11:15am for Sleeper Class since the correct time is 10am & 11am. However , offline is horrible experiences making a Q line is chasing 1st No. in Varanasi Rail reservation building. The same bad situations in other Railway stations like some random guys put tatkal forms with numbers in advance and we never know this day & time.",
    "light_cleaned_comments": "You can try ConfrmTkt if that works. Its ironic that the shitty IRCTC site will be used to book tickets for bullet trains. I read somewhere chrome browser is faster catching net speed over other browsers. Browsers have nothing to do with this. Most browsers are fast enough, including Egde. The issue is with IRCTC and sheer number of people trying to access the platform at the same time. previously we used to be able to pre-populate the traveller info using plugins, does it work now? Dont use master list... Its slow Good device, good internet, fast typing, rest is your luck. if you're the passenger then do add your travel bio details in your profile first. Try UPI scan option. Be right on time. Works for me everytime. Never missed so far IRCTC website? what is the browser? Always book via Desktop/Laptop. Add your names to passenger list and verify it before hand. Also pay via IRCTC wallet. Click search button exact 10.00 am / 11.00am, select your passengers from drop down list (saved before hand in passenger list) and pay via irctc wallet. It works for me 99% of time how about this from desktop [https://www.amazon.in/train-tickets/](https://www.amazon.in/train-tickets/) Edge/Chrome. For me website>mobile app Install IRCTC app...add passengers into master passenger list in advance...atleast before 8 am as the app doesn't allow you to add passenger details after 9 am...be ready by 9.58 am for AC booking...it reloads for eternity but don't panic...wait...pay via card even if it's expensive by 10-15 rupees than upi... Never ever got Tatkal ticket waitlisted....been booking atleast for the past 5 years by following above steps >\\>mobile app what is that app? link here pls I log onto IRCTC or Easymytrip at 10am and book, simple. You booking non ac? I believe AC booking starts at 10am, non AC 11, right? > IRCTC app [https://play.google.com/store/apps/details?id=cris.org.in.prs.ima&hl=en&gl=US](https://play.google.com/store/apps/details?id=cris.org.in.prs.ima&hl=en&gl=US) , is this ? yes , AC starts at 10 am and Non AC SL starts at 11am . but on 3rd party apps like amazon india , paytm , etc. it there was a pop up message : booking starts at 10:15 am and 11:15 am and by the time all reservation finished. who will gonna tell amazon , paytm this tatkal tickets do exists within 3 minutes. [https://play.google.com/store/apps/details?id=cris.org.in.prs.ima&hl=en&gl=US](https://play.google.com/store/apps/details?id=cris.org.in.prs.ima&hl=en&gl=US) Yes... this is the one...it opens at 10 am for AC which is 15 mins earlier than all other service providers and agent apps...so you can book Tatkal easily here Good advice from others. Alternatively, find a secluded station. Garmi ke tym baa, lagan tej ba,. Kucho Karla tohar ticket confirm na hoi. >who will gonna tell amazon , paytm this tatkal tickets do exists within 3 minutes. This restriction is from IRCTC and not from the third party service. I've seen someone use the website and it was horrible. I've never used it myself and always booked through their app. Never had any kind of issues, the whole process was smooth. On the app, add the passengers after you make an account and then start booking. I have booked tickets at random times and never had issues either. Also, if you're gonna book tickets a day or two before your expected travel date, you'll almost never find a seat, even in tatkal. That's just my experience. I have 100% Success rate on IRCTC app.. AMA I'm struggling to book my family's tickets from last 5 days bro 😭 Today I tried but app is dead slow from 09:59 am to 10:05 am Booking for AC tatkal ticket AND from 10:59am to 11:05 am to book SL class because Rail server is busy since lakhs of people accessing. is that correct? Today I tried but app is dead slow from 09:59 am to 10:05 am Booking for AC tatkal ticket AND from 10:59am to 11:05 am to book SL class because Rail server is busy since lakhs of people accessing. is that correct? >This restriction is from IRCTC and not from the third party service. yes we all know but what is the point amazon , paytm like 3rd party apps. opened tatkal windows? but if someone want to book General ticket then it is useful . amazon pay , screenshot I already shared. if you want to book Normal then it is OK . Today I tried but app is dead slow from 09:59 am to 10:05 am Booking for AC tatkal ticket AND from 10:59am to 11:05 am to book SL class because Rail server is busy since lakhs of people accessing. is that correct? offline is only the best solution to get taktal tickets what I analysed. make a queue line physically turning up at Railway booking if your number is 1 and 2 then you will get tatkal tickets. Tatkal booking server is faster at Railways Booking. Yeah...it ll be pretty slow but you'll be able to book Can you book for me pls? Woah that's brilliant, please give tips?? What all to keep in mind? Just login 2 minutes before the booking time and pay using UPI.. I use GPay in Razor Pay.. that’s it.. Will VPS help in booking tickets?? as it gives tremendous speed"
}