{
    "id": "1e1zkcb",
    "title": "The Republic of ACs | Long Reads News - The Indian Express",
    "url": "https://indianexpress.com/article/long-reads/the-republic-of-acs-9450393/",
    "selftext": "Since 2010, air conditioner ownership in India has increased threefold, reaching 24 units per 100 households in 2023, according to the World Energy Outlook 2023 report by the International Energy Agency (IEA). \n",
    "flair": "Policy/Economy",
    "score": 2,
    "num_comments": 3,
    "created_utc": 1720837975.0,
    "convurl": "https://external-preview.redd.it/HGdng4Z8DneW0rlz0bcDag7qXTILuzcZGFm0SxXQTQc.jpg?auto=webp&s=f58ead5faaa026643a70b407c2e495a78e8a7287",
    "comments": [
        "The [story without paywall](https://txtify.it/https://indianexpress.com/article/long-reads/the-republic-of-acs-9450393/)",
        "Should remove 28% GST one ac's, literally makes no sense, we are in the same latitude as Persian gulf countries yet we are expected to live without acs",
        "India needs a total overhaul of civic planning and architecture execution in home design with relevant materials used to keep the temperatures and carbon footprint low."
    ],
    "cleaned_text": "republic acs long reads news indian express since air conditioner ownership india increased threefold reaching units per households according world energy outlook report international energy agency iea ",
    "cleaned_title": "republic acs long reads news indian express",
    "cleaned_selftext": "since air conditioner ownership india increased threefold reaching units per households according world energy outlook report international energy agency iea",
    "cleaned_comments": "story without paywallhttpstxtifyithttpsindianexpresscomarticlelongreadstherepublicofacs remove gst one acs literally makes sense latitude persian gulf countries yet expected live without acs india needs total overhaul civic planning architecture execution home design relevant materials used keep temperatures carbon footprint low",
    "light_cleaned_title": "The Republic of ACs | Long Reads News - The Indian Express",
    "light_cleaned_selftext": "Since 2010, air conditioner ownership in India has increased threefold, reaching 24 units per 100 households in 2023, according to the World Energy Outlook 2023 report by the International Energy Agency (IEA).",
    "light_cleaned_comments": "The [story without paywall](https://txtify.it/https://indianexpress.com/article/long-reads/the-republic-of-acs-9450393/) Should remove 28% GST one ac's, literally makes no sense, we are in the same latitude as Persian gulf countries yet we are expected to live without acs India needs a total overhaul of civic planning and architecture execution in home design with relevant materials used to keep the temperatures and carbon footprint low."
}