{
    "id": "wh9mg2",
    "title": "Jio is the worst. Rant.",
    "url": "https://i.redd.it/78532q8dczf91.jpg",
    "selftext": "Been trying to relocate my Airtel broadband. Tried calling their customer care number several times from my jio number. The call gets disconnected and immediately i receive this message. Tried many times and this happened every single time. Wtf is wrong with jio doing this unfair practise.",
    "flair": "Rant / Vent",
    "score": 59,
    "num_comments": 8,
    "created_utc": 1659742264,
    "convurl": "https://i.redd.it/78532q8dczf91.jpg",
    "comments": [
        "You can turn off these marketing communications from Jio by turning on DND for all categories. Just to to Jio[dot]com and sign in with your number. Then go to settings and turn on DND.    These companies make money through these ads. You can't expect them to turn these off willingly. You can turn these off for yourself though.",
        "Airtel is no less. In April I had no internet for 4 weeks, just 2 days less than a month, the customer care would not pick up instead end on robocall. They would repeat that they are trying to fix on their end, but nothing came. Finally when I protested by not paying the bill of that month, they agreed to fix it, and the problem was a broken wire at there exchange box. So indian telecompanies on a whole are worst. I was forced to pay bill for a month of internet which I didn't used. Also, i tried emailing them, their ceo, their regional office(the regional office didn't even pick phone). No replies whatsoever.",
        "The point here is that they're actually tailoring their ads based on the number that you're dialling. Won't be surprised if the mfs actually start listening to your conversations and try to tailor ads to that as well.  \n\nAnd customized ads are just a part of the story: what else Jio does with this information (and who they sell it to) is a different can of worms altogether.",
        "You are dialing 121 through your jio sim. 121 is not Airtel broadband customer care number, it is Airtel sim customer care number and only works through Airtel sim.\n\n  \n\n\nIf you want to contact customer care for broadband, use [this](https://www.airtel.in/broadband-nodal-support).\n\n  \n\n\nWhen you dail 121 from your jio device, it calls Jio's service. Please reply if I'm wrong.",
        "Well, the sd tailoring isn't done by Jio itself but by the ad companies. These companies have algorithms and they purchase your IP history to get a gist of your browsing habits. Once done, the algorithms tailor that ad for you. The same thing done by Google, Facebook, and Amazon, and many others. These companies' main business is literally ads. That is their main source of revenue.",
        "VI is way worst. It keeps calling me from different numbers the whole day with numbers that look genuine. Also keeps asking me to buy a plan by SMS, when am already subscribed to a similar plan.",
        "Thanks, did it!",
        "even airtel does the same. They call me for everyday , even if i already have ongoing plan."
    ],
    "cleaned_text": "jio worst rant trying relocate airtel broadband tried calling customer care number several times jio number call gets disconnected immediately receive message tried many times happened every single time wtf wrong jio unfair practise ",
    "cleaned_title": "jio worst rant",
    "cleaned_selftext": "trying relocate airtel broadband tried calling customer care number several times jio number call gets disconnected immediately receive message tried many times happened every single time wtf wrong jio unfair practise",
    "cleaned_comments": "turn marketing communications jio turning dnd categories jiodotcom sign number go settings turn dnd companies make money ads cant expect turn willingly turn though airtel less april internet weeks days less month customer care would pick instead end robocall would repeat trying fix end nothing came finally protested paying bill month agreed fix problem broken wire exchange box indian telecompanies whole worst forced pay bill month internet didnt used also tried emailing ceo regional officethe regional office didnt even pick phone replies whatsoever point theyre actually tailoring ads based number youre dialling wont surprised mfs actually start listening conversations try tailor ads well customized ads part story else jio information sell different worms altogether dialing jio sim airtel broadband customer care number airtel sim customer care number works airtel sim want contact customer care broadband use thishttpswwwairtelinbroadbandnodalsupport dail jio device calls jios service please reply im wrong well sd tailoring isnt done jio ad companies companies algorithms purchase ip history get gist browsing habits done algorithms tailor ad thing done google facebook amazon many others companies main business literally ads main source revenue vi way worst keeps calling different numbers whole day numbers look genuine also keeps asking buy plan sms already subscribed similar plan thanks even airtel call everyday even already ongoing plan",
    "light_cleaned_title": "Jio is the worst. Rant.",
    "light_cleaned_selftext": "Been trying to relocate my Airtel broadband. Tried calling their customer care number several times from my jio number. The call gets disconnected and immediately i receive this message. Tried many times and this happened every single time. Wtf is wrong with jio doing this unfair practise.",
    "light_cleaned_comments": "You can turn off these marketing communications from Jio by turning on DND for all categories. Just to to Jio[dot]com and sign in with your number. Then go to settings and turn on DND. These companies make money through these ads. You can't expect them to turn these off willingly. You can turn these off for yourself though. Airtel is no less. In April I had no internet for 4 weeks, just 2 days less than a month, the customer care would not pick up instead end on robocall. They would repeat that they are trying to fix on their end, but nothing came. Finally when I protested by not paying the bill of that month, they agreed to fix it, and the problem was a broken wire at there exchange box. So indian telecompanies on a whole are worst. I was forced to pay bill for a month of internet which I didn't used. Also, i tried emailing them, their ceo, their regional office(the regional office didn't even pick phone). No replies whatsoever. The point here is that they're actually tailoring their ads based on the number that you're dialling. Won't be surprised if the mfs actually start listening to your conversations and try to tailor ads to that as well. And customized ads are just a part of the story: what else Jio does with this information (and who they sell it to) is a different can of worms altogether. You are dialing 121 through your jio sim. 121 is not Airtel broadband customer care number, it is Airtel sim customer care number and only works through Airtel sim. If you want to contact customer care for broadband, use [this](https://www.airtel.in/broadband-nodal-support). When you dail 121 from your jio device, it calls Jio's service. Please reply if I'm wrong. Well, the sd tailoring isn't done by Jio itself but by the ad companies. These companies have algorithms and they purchase your IP history to get a gist of your browsing habits. Once done, the algorithms tailor that ad for you. The same thing done by Google, Facebook, and Amazon, and many others. These companies' main business is literally ads. That is their main source of revenue. VI is way worst. It keeps calling me from different numbers the whole day with numbers that look genuine. Also keeps asking me to buy a plan by SMS, when am already subscribed to a similar plan. Thanks, did it! even airtel does the same. They call me for everyday , even if i already have ongoing plan."
}