{
    "id": "1c56oob",
    "title": "Custom scam",
    "url": "https://i.redd.it/oi0atsnilruc1.jpeg",
    "selftext": "Today I received a call from IVR saying that I have a parcel from DHL.  It was all professionally done.\n\nWhen I clicked 1. It was transferred to a agent, whose English was very good and he started asking me if I had sent something to China.\n\nI was actually planning to import something from china, so I legitimately believed everything until now.\n\nI asked what was in the parcel, he said 1 laptop, 15 passports and 1 kg of MDMA😂. This is where they failed. Then I passed the time for 15 mins where he told he will transfer the call to Mumbai police station so that they can question me. Then he ended the call because I was asking too much questions 😂",
    "flair": "Rant / Vent",
    "score": 8,
    "num_comments": 1,
    "created_utc": 1713239796.0,
    "convurl": "https://i.redd.it/oi0atsnilruc1.jpeg",
    "comments": [
        "How do you guys have the guts to pick phone calls of scammers and bully them ? Mera toh koi random wrong number call bhee incoming ho toh phatt jati hai ... Uthata bhee nahi"
    ],
    "cleaned_text": "custom scam today received call ivr saying parcel dhl professionally done clicked transferred agent whose english good started asking sent something china actually planning import something china legitimately believed everything asked parcel said laptop passports kg mdma failed passed time mins told transfer call mumbai police station question ended call asking much questions ",
    "cleaned_title": "custom scam",
    "cleaned_selftext": "today received call ivr saying parcel dhl professionally done clicked transferred agent whose english good started asking sent something china actually planning import something china legitimately believed everything asked parcel said laptop passports kg mdma failed passed time mins told transfer call mumbai police station question ended call asking much questions",
    "cleaned_comments": "guys guts pick phone calls scammers bully mera toh koi random wrong number call bhee incoming ho toh phatt jati hai uthata bhee nahi",
    "light_cleaned_title": "Custom scam",
    "light_cleaned_selftext": "Today I received a call from IVR saying that I have a parcel from DHL. It was all professionally done. When I clicked 1. It was transferred to a agent, whose English was very good and he started asking me if I had sent something to China. I was actually planning to import something from china, so I legitimately believed everything until now. I asked what was in the parcel, he said 1 laptop, 15 passports and 1 kg of MDMA😂. This is where they failed. Then I passed the time for 15 mins where he told he will transfer the call to Mumbai police station so that they can question me. Then he ended the call because I was asking too much questions 😂",
    "light_cleaned_comments": "How do you guys have the guts to pick phone calls of scammers and bully them ? Mera toh koi random wrong number call bhee incoming ho toh phatt jati hai ... Uthata bhee nahi"
}