{
    "id": "17rwycb",
    "title": "In Three Years, Nearly 2 Lakh Women Went Missing In Madhya Pradesh. Here's Why",
    "url": "https://www.thequint.com/news/india/in-three-years-nearly-2-lakh-women-went-missing-in-madhya-pradesh-heres-why",
    "selftext": "Madhya Pradesh has the highest number of missing women and children in India. Hunger, climate change are to blame.",
    "flair": "Crime",
    "score": 26,
    "num_comments": 1,
    "created_utc": 1699593488.0,
    "convurl": "https://external-preview.redd.it/Gn1Cnh0d0ezFCGQb6fZOd8JQS2JeDUqeFaUiQBV8xzY.jpg?auto=webp&s=1b5585176f04da93a0d4f89ebbe91c094e15f5ce",
    "comments": [
        "CLICK BAIT AS FUCK\n\n> Hunger, climate change are to blame.\n\nmigration may be the word, definitely not missing (as they were abducted or dead)\n\nAlso behind a paywall. So, we dont know what they mean\n\nI wouldn't pay a dime for this crap \"news\" paper.",
        "Did you even open the article? It's not paid and you can expand the full article. Also, they cite NCRB from Home Minster as the source of the data. Are you saying Home Ministry is lying about 2 lakh missing women?"
    ],
    "cleaned_text": "three years nearly lakh women went missing madhya pradesh heres madhya pradesh highest number missing women children india hunger climate change blame ",
    "cleaned_title": "three years nearly lakh women went missing madhya pradesh heres",
    "cleaned_selftext": "madhya pradesh highest number missing women children india hunger climate change blame",
    "cleaned_comments": "click bait fuck hunger climate change blame migration may word definitely missing abducted dead also behind paywall dont know mean wouldnt pay dime crap news paper even open article paid expand full article also cite ncrb home minster source data saying home ministry lying lakh missing women",
    "light_cleaned_title": "In Three Years, Nearly 2 Lakh Women Went Missing In Madhya Pradesh. Here's Why",
    "light_cleaned_selftext": "Madhya Pradesh has the highest number of missing women and children in India. Hunger, climate change are to blame.",
    "light_cleaned_comments": "CLICK BAIT AS FUCK > Hunger, climate change are to blame. migration may be the word, definitely not missing (as they were abducted or dead) Also behind a paywall. So, we dont know what they mean I wouldn't pay a dime for this crap \"news\" paper. Did you even open the article? It's not paid and you can expand the full article. Also, they cite NCRB from Home Minster as the source of the data. Are you saying Home Ministry is lying about 2 lakh missing women?"
}