{
    "id": "167vexk",
    "title": "India a ‘Hindu Rashtra’ whether some accept it or not: Mohan Bhagwat",
    "url": "https://www.hindustantimes.com/india-news/rss-chief-bhagwat-declares-india-a-hindu-rashtra-urges-media-to-promote-nation-building-and-positivity-101693554719099.html",
    "selftext": "It's really baffling how these fkers can get away with saying anything they want and no one will raise a finger",
    "flair": "Politics",
    "score": 1,
    "num_comments": 84,
    "created_utc": 1693637499.0,
    "convurl": "https://external-preview.redd.it/RoPcOWGqDAhnMJJmFHcoDmHhfh0A_LsTXyVdvy1h-sU.jpg?auto=webp&s=0df382312fa31ede4524fb5dc009d28485776a77",
    "comments": [
        "Okay then tell your cronies to stop doing whatever they shit they are trying to pull. If we are already a Hindu Rashtra so now can we please focus on the real issues. \n\nFr this is the same argument I make whenever someone says we need to be a Hindu Rashtra. We already fucking are. We are 84% of the population. How are we not a Hindu Rashtra. What laws are their that discomfort the Hindus? If women going to temples is an issue it is the issue of the religion, not the country. Same for some more bullshit.",
        "go suck a dick Mohan",
        "Next step: India a \"Hindi rasthra\" whether some accept it or not.\n\nThese retards are unknowingly or knowingly destroying the idea of india. The result will be like that of the USSR especially if language is touched. Mark my words.\n\nGive respect, take respect. Don't think hindu and hinthi, both issues, will get a free pass. \n\nDon't create problems where none exists and destroy something like india.",
        "Speak what u want when ur in power . Wait till that changes",
        "Iski maa ka",
        "Bhaaagwat saaar, its not about some accept it or not. It's about constitution recognizing it. Per our current constitution we are a secular nation.",
        "Hindutva rashtra.",
        "No",
        "Mohan: is it a Hindu Dick ?",
        "RSS is a Terrorist organisation. Ban RSS and save future generations.",
        "Aa gaya bhadwa apni aukaat pe",
        "These fools don't know what they're doing, were running too close to sun and burning is inevitable if we don't come back.\n\nSoon these baboons will start forcing Hindi upon all states and then USSR is what will happen to India. Their false sense of pride will be the downfall of idea of India, and unity in diversity.",
        "I agree, it's already functioning like one. They don't even need to officially declare it",
        "like plugging your ears with your fingers and triumphantly saying 'Í cant hear you'\n\nHe used to be better",
        "Do these people have any other thought other than this",
        "Accept nahi kiya toh kya kerega tu? \nGenocide? \nGas chamber bana phir \n\nSanatani nahi tanatani hai ye log",
        "Why care for still ongoing atrocities in Manipur when UCC under hintoo rashtra, and ISRO PR can make people forget it",
        "Nuremberg them, they were banned before and it didn't work.",
        "For some people, Hindu Rashtra isnt about that. Its about bring as much discomfort and problems for minorities esp Muslims. Then only, will they feel proud about their religion. Its a shame that it has come to that.",
        "India is a strict islamophobic country, that's the version of Hindu rastra is.",
        "> What laws are their that discomfort the Hindus? \n\nFor those people, I think it would be the laws that still make it technically illegal to slaughter muslims wholesale.",
        "Well the person they hate most aka Nehru came to the rescue and had to convince Sardarji to lift the ban. They won't remember this though. Sardarji who died the same year we became a republic should have been PM. What a load of bull.",
        "India is a land of problems, but the problems are manageable",
        "Blame Nehru for that. I mean, really he is the reason they did not remain banned the first time.",
        ">What laws are their that discomfort the Hindus? \n\nWarf Board Act \n\n\\*discomforts everyone who is affected",
        "Your time is long gone, Mr Bhagwat. \n\nIndia today will decide on the kind of future it wants.\n\nThink it's time for you to relax & enjoy retirement from active political life.",
        "when life gives you mohan, be gandhi",
        "As long as Muslims are treated as an equal citizen to his or her Hindu counterpart, India is not a Hindu Rashtra. They want to treat muslims as they please. This Brahmin Baniya party wants to restore the glory days of Hindus where upper caste rules the roost and treat others and especially the dalits as dirt. After muslims are taken care of they will target everyone else that's not upper caste.\n\nPS: Not at all saying all Brahmin & Baniya Indians are bad. But that's what BJPee wants.",
        "Should have been killed/ slave labor for life.\n\nSuch ppl don’t deserve anything. They shouldn’t be given the chance to spread hate.\n\nWhat we are seeing now are efforts from the time RSS has been given free reign.",
        ">Its about bring as much discomfort and problems for minorities esp Muslims. Then only, will they feel proud about their religion.\n\nTHIS.",
        "How else do small minded people feel superior?",
        "That'd be a rash tra'vesty!",
        "Some people think the opposite whether some accept it or not. Jaisi jiski soch.",
        "Hmm, So a proper hindu rashtra has riots and minority abuse built in.",
        "Yep, topped off with all that cheesy smegma.",
        "Gulbarg Trials."
    ],
    "cleaned_text": "india hindu rashtra whether accept mohan bhagwat really baffling fkers get away saying anything want one raise finger ",
    "cleaned_title": "india hindu rashtra whether accept mohan bhagwat",
    "cleaned_selftext": "really baffling fkers get away saying anything want one raise finger",
    "cleaned_comments": "okay tell cronies stop whatever shit trying pull already hindu rashtra please focus real issues fr argument make whenever someone says need hindu rashtra already fucking population hindu rashtra laws discomfort hindus women going temples issue issue religion country bullshit go suck dick mohan next step india hindi rasthra whether accept retards unknowingly knowingly destroying idea india result like ussr especially language touched mark words give respect take respect dont think hindu hinthi issues get free pass dont create problems none exists destroy something like india speak u want ur power wait till changes iski maa ka bhaaagwat saaar accept constitution recognizing per current constitution secular nation hindutva rashtra mohan hindu dick rss terrorist organisation ban rss save future generations aa gaya bhadwa apni aukaat pe fools dont know theyre running close sun burning inevitable dont come back soon baboons start forcing hindi upon states ussr happen india false sense pride downfall idea india unity diversity agree already functioning like one dont even need officially declare like plugging ears fingers triumphantly saying cant hear used better people thought accept nahi kiya toh kya kerega tu genocide gas chamber bana phir sanatani nahi tanatani hai ye log care still ongoing atrocities manipur ucc hintoo rashtra isro pr make people forget nuremberg banned didnt work people hindu rashtra isnt bring much discomfort problems minorities esp muslims feel proud religion shame come india strict islamophobic country thats version hindu rastra laws discomfort hindus people think would laws still make technically illegal slaughter muslims wholesale well person hate aka nehru came rescue convince sardarji lift ban wont remember though sardarji died year became republic pm load bull india land problems problems manageable blame nehru mean really reason remain banned first time laws discomfort hindus warf board act discomforts everyone affected time long gone mr bhagwat india today decide kind future wants think time relax enjoy retirement active political life life gives mohan gandhi long muslims treated equal citizen hindu counterpart india hindu rashtra want treat muslims please brahmin baniya party wants restore glory days hindus upper caste rules roost treat others especially dalits dirt muslims taken care target everyone else thats upper caste ps saying brahmin baniya indians bad thats bjpee wants killed slave labor life ppl dont deserve anything shouldnt given chance spread hate seeing efforts time rss given free reign bring much discomfort problems minorities esp muslims feel proud religion else small minded people feel superior thatd rash travesty people think opposite whether accept jaisi jiski soch hmm proper hindu rashtra riots minority abuse built yep topped cheesy smegma gulbarg trials",
    "light_cleaned_title": "India a ‘Hindu Rashtra’ whether some accept it or not: Mohan Bhagwat",
    "light_cleaned_selftext": "It's really baffling how these fkers can get away with saying anything they want and no one will raise a finger",
    "light_cleaned_comments": "Okay then tell your cronies to stop doing whatever they shit they are trying to pull. If we are already a Hindu Rashtra so now can we please focus on the real issues. Fr this is the same argument I make whenever someone says we need to be a Hindu Rashtra. We already fucking are. We are 84% of the population. How are we not a Hindu Rashtra. What laws are their that discomfort the Hindus? If women going to temples is an issue it is the issue of the religion, not the country. Same for some more bullshit. go suck a dick Mohan Next step: India a \"Hindi rasthra\" whether some accept it or not. These retards are unknowingly or knowingly destroying the idea of india. The result will be like that of the USSR especially if language is touched. Mark my words. Give respect, take respect. Don't think hindu and hinthi, both issues, will get a free pass. Don't create problems where none exists and destroy something like india. Speak what u want when ur in power . Wait till that changes Iski maa ka Bhaaagwat saaar, its not about some accept it or not. It's about constitution recognizing it. Per our current constitution we are a secular nation. Hindutva rashtra. No Mohan: is it a Hindu Dick ? RSS is a Terrorist organisation. Ban RSS and save future generations. Aa gaya bhadwa apni aukaat pe These fools don't know what they're doing, were running too close to sun and burning is inevitable if we don't come back. Soon these baboons will start forcing Hindi upon all states and then USSR is what will happen to India. Their false sense of pride will be the downfall of idea of India, and unity in diversity. I agree, it's already functioning like one. They don't even need to officially declare it like plugging your ears with your fingers and triumphantly saying 'Í cant hear you' He used to be better Do these people have any other thought other than this Accept nahi kiya toh kya kerega tu? Genocide? Gas chamber bana phir Sanatani nahi tanatani hai ye log Why care for still ongoing atrocities in Manipur when UCC under hintoo rashtra, and ISRO PR can make people forget it Nuremberg them, they were banned before and it didn't work. For some people, Hindu Rashtra isnt about that. Its about bring as much discomfort and problems for minorities esp Muslims. Then only, will they feel proud about their religion. Its a shame that it has come to that. India is a strict islamophobic country, that's the version of Hindu rastra is. > What laws are their that discomfort the Hindus? For those people, I think it would be the laws that still make it technically illegal to slaughter muslims wholesale. Well the person they hate most aka Nehru came to the rescue and had to convince Sardarji to lift the ban. They won't remember this though. Sardarji who died the same year we became a republic should have been PM. What a load of bull. India is a land of problems, but the problems are manageable Blame Nehru for that. I mean, really he is the reason they did not remain banned the first time. >What laws are their that discomfort the Hindus? Warf Board Act \\*discomforts everyone who is affected Your time is long gone, Mr Bhagwat. India today will decide on the kind of future it wants. Think it's time for you to relax & enjoy retirement from active political life. when life gives you mohan, be gandhi As long as Muslims are treated as an equal citizen to his or her Hindu counterpart, India is not a Hindu Rashtra. They want to treat muslims as they please. This Brahmin Baniya party wants to restore the glory days of Hindus where upper caste rules the roost and treat others and especially the dalits as dirt. After muslims are taken care of they will target everyone else that's not upper caste. PS: Not at all saying all Brahmin & Baniya Indians are bad. But that's what BJPee wants. Should have been killed/ slave labor for life. Such ppl don’t deserve anything. They shouldn’t be given the chance to spread hate. What we are seeing now are efforts from the time RSS has been given free reign. >Its about bring as much discomfort and problems for minorities esp Muslims. Then only, will they feel proud about their religion. THIS. How else do small minded people feel superior? That'd be a rash tra'vesty! Some people think the opposite whether some accept it or not. Jaisi jiski soch. Hmm, So a proper hindu rashtra has riots and minority abuse built in. Yep, topped off with all that cheesy smegma. Gulbarg Trials."
}