{
    "id": "1brk4g2",
    "title": "Irony died a thousand deaths today",
    "url": "https://i.redd.it/g5vjg8kkmhrc1.png",
    "selftext": "Source - https://www.hindustantimes.com/india-news/pm-modi-tells-bill-gates-why-he-called-for-clanging-utensils-in-covid-pandemic-101711775664034.html",
    "flair": "Rant / Vent",
    "score": 118,
    "num_comments": 13,
    "created_utc": 1711811538.0,
    "convurl": "https://i.redd.it/g5vjg8kkmhrc1.png",
    "comments": [
        "lmao bruh tf",
        "At this point mudizi is just seeing how much bs will people readily swallow for him and say ayega to mudi hi.\n\nhttps://preview.redd.it/wk6ldouophrc1.jpeg?width=828&format=pjpg&auto=webp&s=ca720eed1fa5a9189acfc2b166428e3bee48ae3c",
        "Im convinced :')",
        "https://preview.redd.it/0f6vbt8uuhrc1.png?width=2185&format=pjpg&auto=webp&s=556cff35395b591a3251b5ed15a02a63b751885d",
        "https://preview.redd.it/5isvfarh0irc1.jpeg?width=1161&format=pjpg&auto=webp&s=371a330e720f0cdb87b389e4b0f128f46e5a4328",
        "Is this a movie scene ?",
        "https://preview.redd.it/d09fziu9airc1.jpeg?width=1080&format=pjpg&auto=webp&s=09411e6415d8f5658f207379d7b59777826b7707",
        "When you look at the sheer power the government has in the Indian system, yeah Modi is showing restraint. He can definitely get more authoritarian and heavy handed. \n\n\nRemember Emergency? It was completely legal. And it was enacted by Indra Gandhi who was a prime minister even though she wasn't a member of parliament at that time.",
        "\nPrime Minister Narendra Modi recalled how he diligently followed all the Covid-19 protocols in public to gain people's trust\n\nAlso Modiji During  Covind 19 \"I’ve never seen such huge crowds” at an event in West Bengal \"🙄",
        "https://preview.redd.it/xx7jo97ydirc1.jpeg?width=459&format=pjpg&auto=webp&s=45353083b2ee40eb0fd063316a31f361451f45ba\n\nMudi xi rn",
        "BJP campaign ad.",
        "Hypocrisy ki bhi sima hoti hai !!"
    ],
    "cleaned_text": "irony died thousand deaths today source ",
    "cleaned_title": "irony died thousand deaths today",
    "cleaned_selftext": "source",
    "cleaned_comments": "lmao bruh tf point mudizi seeing much bs people readily swallow say ayega mudi hi im convinced movie scene look sheer power government indian system yeah modi showing restraint definitely get authoritarian heavy handed remember emergency completely legal enacted indra gandhi prime minister even though wasnt member parliament time prime minister narendra modi recalled diligently followed covid protocols public gain peoples trust also modiji covind ive never seen huge crowds event west bengal mudi xi rn bjp campaign ad hypocrisy ki bhi sima hoti hai",
    "light_cleaned_title": "Irony died a thousand deaths today",
    "light_cleaned_selftext": "Source -",
    "light_cleaned_comments": "lmao bruh tf At this point mudizi is just seeing how much bs will people readily swallow for him and say ayega to mudi hi. Im convinced :') Is this a movie scene ? When you look at the sheer power the government has in the Indian system, yeah Modi is showing restraint. He can definitely get more authoritarian and heavy handed. Remember Emergency? It was completely legal. And it was enacted by Indra Gandhi who was a prime minister even though she wasn't a member of parliament at that time. Prime Minister Narendra Modi recalled how he diligently followed all the Covid-19 protocols in public to gain people's trust Also Modiji During Covind 19 \"I’ve never seen such huge crowds” at an event in West Bengal \"🙄 Mudi xi rn BJP campaign ad. Hypocrisy ki bhi sima hoti hai !!"
}