{
    "id": "1bjemsm",
    "title": "I hate Rahul Gandhi and hopes he never comes to power",
    "url": "https://www.reddit.com/r/india/comments/1bjemsm/i_hate_rahul_gandhi_and_hopes_he_never_comes_to/",
    "selftext": "I had my fair share of problems with the BJP government and their casteist policies, but there seems to be no other option than them. Congress is smoking some serious shit.\n\nhttps://preview.redd.it/yd7dlqwnxhpc1.jpg?width=906&format=pjpg&auto=webp&s=80f569006f08b98889ef61d9fd0ed5f93867f661\n\nI mean what is this, seriously what the heck is this?\n\nI come from a general middle class family, my entire family pays taxes, insane amount of taxes. And congress is just showing me a middle finger. We are talking here about removing reservation and congress wants to remove 50% cap, I mean what am I supposed to do, commit suicide? I mean I am not rich enough to pay those private institutes... and I am not poor enough either to fall in their freebies scheme.\n\nNo talk of infrastructure, No talk of corruption, No talk to end monopoly of certain companies, No talk of Women Safety in terms of harassment, No talk of making India a manufacturing Hub. No Talk of High Quality Education... Nothing.\n\nAnd who is gonna pay for all of this, I mean do they think we can just print infinite amount of money or something. Rahul gandhi has to be the dumbest guy in politics...\n\nHe is talking debt relief, he is talking about MSP, who is gonna pay for life and accident insurance, who is gonna pay for the new 30 lakh government employees salary... \\[There are around 30 lakh government employees, as of today\\]. He is talking about doubling that number.  \n\n\nThis is bankrupting your own country speedrun. This is gonna raise inflation, reduce GDP growth rate and gonna drive companies from setting up plants in India.\n\n&#x200B;",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1710944534.0,
    "convurl": "https://b.thumbs.redditmedia.com/9LsN3uW9HOYPLcvURaA7PnYtpL3vv9WClXJ5fVeIaOI.jpg",
    "comments": [
        "Well he's putting forward a manifesto. If it resonates with the majority then he'll be voted to power. If removing reservations or providing tax cuts was something the majority agreed with, then we'd have had a regime that could implement them by now 🤷‍♂️. Democracy means rule of the majority. Individual voices(both yours as well as mine) do not mean crap.",
        "he won't. chill.",
        "The majority of the items listed in the manifesto cannot be completed without significantly harming the nation.\nI still recall the extent of corruption that existed during the Congress Raj. Farmers were particularly badly off at that time, having lost all of our economic resources. in your opinion, why does the Modi government distribute 6,000 rupees annually? ans. as apology and componsation for harm done to us during last 60 year.",
        "The current govt is doing almost everything nicely do he has nothing to argue with, hence the only option left is caste based politics"
    ],
    "cleaned_text": "hate rahul gandhi hopes never comes power fair share problems bjp government casteist policies seems option congress smoking serious shit mean seriously heck come general middle class family entire family pays taxes insane amount taxes congress showing middle finger talking removing reservation congress wants remove cap mean supposed commit suicide mean rich enough pay private institutes poor enough either fall freebies scheme talk infrastructure talk corruption talk end monopoly certain companies talk women safety terms harassment talk making india manufacturing hub talk high quality education nothing gon na pay mean think print infinite amount money something rahul gandhi dumbest guy politics talking debt relief talking msp gon na pay life accident insurance gon na pay new lakh government employees salary around lakh government employees today talking doubling number bankrupting country speedrun gon na raise inflation reduce gdp growth rate gon na drive companies setting plants india xb ",
    "cleaned_title": "hate rahul gandhi hopes never comes power",
    "cleaned_selftext": "fair share problems bjp government casteist policies seems option congress smoking serious shit mean seriously heck come general middle class family entire family pays taxes insane amount taxes congress showing middle finger talking removing reservation congress wants remove cap mean supposed commit suicide mean rich enough pay private institutes poor enough either fall freebies scheme talk infrastructure talk corruption talk end monopoly certain companies talk women safety terms harassment talk making india manufacturing hub talk high quality education nothing gon na pay mean think print infinite amount money something rahul gandhi dumbest guy politics talking debt relief talking msp gon na pay life accident insurance gon na pay new lakh government employees salary around lakh government employees today talking doubling number bankrupting country speedrun gon na raise inflation reduce gdp growth rate gon na drive companies setting plants india xb",
    "cleaned_comments": "well hes putting forward manifesto resonates majority hell voted power removing reservations providing tax cuts something majority agreed wed regime could implement democracy means rule majority individual voicesboth well mine mean crap wont chill majority items listed manifesto completed without significantly harming nation still recall extent corruption existed congress raj farmers particularly badly time lost economic resources opinion modi government distribute rupees annually ans apology componsation harm done us last year current govt almost everything nicely nothing argue hence option left caste based politics",
    "light_cleaned_title": "I hate Rahul Gandhi and hopes he never comes to power",
    "light_cleaned_selftext": "I had my fair share of problems with the BJP government and their casteist policies, but there seems to be no other option than them. Congress is smoking some serious shit. I mean what is this, seriously what the heck is this? I come from a general middle class family, my entire family pays taxes, insane amount of taxes. And congress is just showing me a middle finger. We are talking here about removing reservation and congress wants to remove 50% cap, I mean what am I supposed to do, commit suicide? I mean I am not rich enough to pay those private institutes... and I am not poor enough either to fall in their freebies scheme. No talk of infrastructure, No talk of corruption, No talk to end monopoly of certain companies, No talk of Women Safety in terms of harassment, No talk of making India a manufacturing Hub. No Talk of High Quality Education... Nothing. And who is gonna pay for all of this, I mean do they think we can just print infinite amount of money or something. Rahul gandhi has to be the dumbest guy in politics... He is talking debt relief, he is talking about MSP, who is gonna pay for life and accident insurance, who is gonna pay for the new 30 lakh government employees salary... \\[There are around 30 lakh government employees, as of today\\]. He is talking about doubling that number. This is bankrupting your own country speedrun. This is gonna raise inflation, reduce GDP growth rate and gonna drive companies from setting up plants in India. &#x200B;",
    "light_cleaned_comments": "Well he's putting forward a manifesto. If it resonates with the majority then he'll be voted to power. If removing reservations or providing tax cuts was something the majority agreed with, then we'd have had a regime that could implement them by now 🤷‍♂️. Democracy means rule of the majority. Individual voices(both yours as well as mine) do not mean crap. he won't. chill. The majority of the items listed in the manifesto cannot be completed without significantly harming the nation. I still recall the extent of corruption that existed during the Congress Raj. Farmers were particularly badly off at that time, having lost all of our economic resources. in your opinion, why does the Modi government distribute 6,000 rupees annually? ans. as apology and componsation for harm done to us during last 60 year. The current govt is doing almost everything nicely do he has nothing to argue with, hence the only option left is caste based politics"
}