{
    "id": "1c9g1mq",
    "title": "Water purifier companies robbing you in daylight.",
    "url": "https://www.reddit.com/gallery/1c9g1mq",
    "selftext": "I wanted to shed light upon how expensive water purifiers are to maintain. If you get clean water & don't have to pay for the maintenance, well lucky you. I've read about other companies as well & these prices are equivalent to daylight robbery.\n\nI purchased a Livpure water purifier back in 2023 for about 7.2K with all discounts & sale going on. While purchasing this, I checked online, Livpure filter prices were around 2K or so which I thought was expensive but affordable. All ran well all year, other than Livpure's sales calls to buy the AMC. \n\nCut to first week of April 2024, I decided to get my filters changed because according to me I had used it for 6-7 months now. Livpure technician came home, changed filters, membrane etc. & tore me a receipt which in turn split my a** into 7 dragonballs. A bill of Rs. 5095. For context, I stay alone & I was out of station for about 7-8 months in 2023 so, this seemed like a rip-off. I got it done anyway. Cut to 2 days post service, the purifier was continuously throwing out water. To a point that the water tank in my house was getting emptied constantly. I waited for some time thinking it'd be due to the new filter but then raised another complaint. Technician visits, says some pump has gone bad which is Rs. 360 + Rs. 400 service charge. With this bill, my total for this water purifier service was going to be Rs. 5855. I said I don't want to get this part replaced, so the technician repaired it & took the service charge only. Still a total of Rs. 5455 & probably more to uncover which I hope doesn't happen.\n\nIn a gist the calculation is,\n\nYou pay, Rs. 30 per day to own a water purifier like Livpure. On top, your machine can go faulty anytime & the parts are expensive so all the best with that as well. \n\nOR you buy a 2 year AMC that costs about 10K.\n\nAnd the best part of all of this is, after creating a problem called expensive annual maintenance, these companies also have the audacity to sell subscription service where the benefit is that you don't have to service it. 💀💀\n\nIn a world where clean air, clean water, food & shelter are the basic needs of life, almost all of them are getting more & more unaffordable everyday. Be it air purifiers for air quality, price of the daily groceries, real estate & then this water purifier.",
    "flair": "Rant / Vent",
    "score": 236,
    "num_comments": 113,
    "created_utc": 1713700423.0,
    "convurl": "https://i.redd.it/bmj0ekm6ntvc1.jpg",
    "comments": [
        "Yes, realised this couple of years back and now we're buying 20 liters can.",
        "No need to change filters before one year of usage. Our water purifier is a non-RO from Eureka Forbes. They sell the spare parts online, and I just buy those and replace myself. For \\~₹900 total.",
        "So here is the real scam. These water purifiers turn red LED on or something similar when your germ kill kit, filters etc are due for replacement. Now how does the machine know that the part is actually out of order? \n\nThe answer is it really doesn't. There is a timer/clock mechanism inside your purifier which just counts down to 6 months and then it turns those led to red and disables your machine. \n\nI know this because I saw the technician reset the button upon changing the kit and I inquired how come the kit has gone bad if I hadn't even used it for the last 5 months (i was away) he got nervous and spilled the beans on the timer mechanism. \n\nSo the next time the LEDs turned red I reset the clock myself, without changing the kit and sure enough the purifier was on again. I checked the water hardness etc and it was perfectly fine. Which means you don't really need to change the kit as per the period mentioned by the company. It's just one big scam.\n\nAlso think about it. A family of 10 uses a water purifier for obviously a much larger quantity of water and a family of two for much less. However, in both cases the same purifier needs kit replacement after 6 months. That makes no sense whatsoever.",
        "Sediment filter is 1500 (Unilever's quote) in Bangalore. You can purchase it at a local hardware shop for 1000-1200.\n\nThe sensor lights for replacement are just a timer backed lights. They're reset to 1 year by the technician. It depends on usage and amount of sediment in the water supply.",
        "Just ditch RO water altogether bro, did the same recently and brought a 6.5k Simple filter of Rama from Amazon. Apart from this issue of constantly being ripped, our bodies are being ripped of Calcium & Magnesium etc.. the effects of which start to show up within a few years.",
        "me to seedha tap ka paani peeta hu  \npurifier wala kadwa lagta",
        "Simple filter is ok if it's corporation/municipality supplied water but if it's borewell or tanker water then a simple filter might not do the job.",
        "My father got one for our house back in 2018, we used it for a few months and then the filter replacement light started blinking. The technician came at our place charged us a bomb for service + filter change AND broke the machine, he did some make shift fixes with some white tape around the unit and it stopped working a few weeks later. Company refused to the unit even though it was under warranty. We ditched the unit and cut our losses because we spent more in its service and maintenance than the purchase price.",
        "Ham to pani ki 30 rs ki bottle mangvate he\n240 rs me kam ho jata he",
        "Wow same, i bought the Rama filter 8-9 months back and me and the family is so happy with it.",
        "pls don't follow this advise blindly. Always check the TDS.\nMy parents were municipality (Delhi Jal Board) water + filter but have never checked TDS. I was noticing white sediments in my water bottle so got it checked. The TDS was 350, which is very unhealthy. turns out DJB started mixing ground water into supply as there was too much demand. I got an RO installed and TDS is finally below 10. \n\nAlways check TDS before deciding water filtering system.",
        "I don't know about you but I got 1+2 years extended warranty for 500 bucks\n\nPlus I use pre filter due to which actual filters are protected \n\nMy tds is 2200 which is very much high and earlier ro became useless as filters filled with salt (from high tds) within 6-8 months\nBut using the pre filter they are fine now. Using live pure r o from the last 2.5 years.",
        "Annual maintenance & filter replacement cost about ₹2,000/- for PureIt (HUL) water purifier. I got it for ~₹18000/- in Apr-2020.",
        "I pay 1k every 6-8 months. 800 for the filter replacement cost and 200 service charges.",
        "350 is by no means 'very unhealthy' as advertised by every RO company to sell their products.  It's not the best TDS value to have, but certainly not the worst either. You should really be concerned about installing RO only if your TDS crosses 500.",
        "QC - how to put water into it? Do you have tap or pour water manually with pot?",
        "With time we all will have to learn to fix these small appliances ourselves like they do in foreign countries.",
        "Bro go for a subscription model like drinkprime..the service is free..change of filter is free..you juse need to pay for monthly subscription or any extra water you need over your limit for the month..pretty hassle free..check it out..",
        "Healthy tds is about 100 i believe",
        "If you could take the pains ,i would recommend getting a 20L can if water for 5 rupees (someplaces it's 10).\nAs you said you're the only person living it would last you for about 1 and a half or 2 days so.....\n\nEven if you take 10r per day you would be spending around 300 per month on water ......\n\nIdk if I'm taking this out of context as a water purifier is purchased for not having to go through the hassle of getting water every day or two.",
        "I replace my ro filters once a year for around 1200. You dont need these crazy brands, just get a decent once for 4-5k with uv, ro.",
        "Go for Kent RO. Best quality and good service",
        "It is disheartening that basic requirements of life are getting costlier all the time. Due to pollution and climate change",
        "If you go for branded stuff then a ripoff will happen. The same stuff sold by authorised dealer can be bought aftermarket.",
        "but plastic cans leech probably leech plastic, and you can't be assured of quality unless it's bisleri.",
        "You should have bought lg after service is great free 1 year service , latter you can extend it with around 3k. But it will cost you bit high mine was around 17k. But service is great they even changed motor without any charge",
        "My aqua guard is running well since 18 years",
        "Dude NO !!!! Everyone cannot use a simple filter. You're lucky to have a good source of drinking water. Some of us have Borewells",
        "I too was a victim of this tactic/scam. During the routine service they somehow did something which broke some part and we had to call them again after the initial routine service.\n\nNow(since 5 years) I do regular service myself by getting the parts from Amazon. Works out about 50% cheaper and nothing has broken till now. Once the power supply broke, the local shop wanted 1.8k to fix, got the part from Amazon for ~500 and fixed it myself in about 10-15 mins.",
        "Usually water purifiers have two treatment to kill microbes, UV+Ultra filtration, RO+UV, RO+MF/UF along with a sediment filter ( the white one that is installed outside and as the name suggests, it's for filtering  \"bigger\" particles)\n\nRO is required when your source water is salty, I'd higher TDS(Total dissolved solids). If your water has a tds of 200 or less, UV based treatment is enough and you don't need a RO. The only catch here is that, you can't store UV treated water, storing reduces the efficacy (to put in simple terms) and hence you have to wait a few seconds when you want water. \n\nA simple UV + UF/MF should suffice for most of the places and costs around 6-7k with very low running cost.",
        "Damn. You can get a full service kit from Amazon at 1200 including RO membrane. You can pay 200 to the technician and get it done. But it's pretty easy to understand and I would recommend to learn it yourself.\n\nAll you need is to learn and a TDS meter. Thats all",
        "FYI TDS below 10 is also not good. Get the TDS adjusted between 50-150. I learnt it from YouTube and adjusted TDS of aquaguard by myself",
        "It is a sad reality that even after 75 years after independence we are unable to supply actual drinking water to people :(",
        "Mujhe kya Eureka Forbes Wale to aate hi nhi service krne😉",
        "Maybe. I am used to San Francisco tap water which has TDS of 35-50 and this 350 TDS tasted weird.\n\nThe water which flows into Delhi comes from Yamuna which has all kinds of contaminants and I prefer to completely filter them out than risk family health. There isn't any risk to drinking low TDS water so might as well go for it.",
        "low TDS is not unhealthy. That is just plain misinformation based on lack of minerals argument, which makes no sense if you think about it. Just eat a citrus fruit once a month and it will cover whatever mineral intake you get from water",
        "In chattisgarh it cost 50r for a can",
        "Yeah i have kent. Water purifier was purchased in 2012 I guess. Motor was changed once, but the filters ( + small tubes of minerals i guess) are replaced after every 2 years. Their life depends on how clean your tanki ka water is.",
        "I think many RO users underestimate the value of pre-filters. They go a long way in prolonging the life of the main filters which are expensive to replace compared to the pre-filters.",
        "Dude, get drinkprime.",
        "India mein riot kardiya toh anti national kehdenge haha",
        "Even then you have plenty of duplicate bisleri",
        "They’re not mixing ground water, people have dug illegal holes and pipes in djb pipes by which water gets contaminated. The water otherwise is said to be fit to drink",
        "We have a non branded RO with all branded filters and pre carbon and uv and everything. It costed 6K previously, and now 7500 for copper variant. Service cost never more than 1000. All aprts from amazon cost 1K and you can pay 400 to get them installed. There’s no rocket science in it and this segment is commodities.",
        "Bro you need to read about healthy tds level",
        "This thread is all full of misinformation all comments till now are advocating pseudoscience; please ignore it guys. Also I'm reporting it for false information.        \nPlease do the same. \n\nTDS is *not* a measure of purity. It is a measure of total solutes in the solution. High TDS means it's salty water, doesn't always mean water is bad. \n\n\nYour body isn't getting ripped of Ca/Mg as much as the Op wants you to believe. \n\nI drink RO water and I am lactose intolerant, aka no milk/milk products and don't take any calcium supplements. My calcium levels in my blood work are in the normal range. \n\nWhat I'm trying to say is you don't need water to fulfill your nutritional needs. You will need 15 litres of sea water to pull out Mg at RDA (yeah everyday) this is the dumbest myth circulated on WhatsApp any1 that cleared primary school should not fall for it. \n\nOr they should retake maths.",
        "Bro I change it on my own.",
        "It's the same business model like printer companies and ink cartridges. I paid almost as much as the entire ro within 3 years in service and parts for kent.\nIf you are in a proper city go find a good ro parts wholesaler , you will find the same quality parts for 1/3rd price ( yes that's the markup of these companies) . Exact same iso certifications and all .\nAlso these shops have a mechanic as well who will charge 200-300 for any kind of service. \n\nBottom line - Stay away from the after sales service of these companies once your warranty is over. Stick with a local mechanic.",
        "Where are you getting 20L water for 5-10 rupees? Bisleri is 100-110 bucks and local water suppliers are minimum 60 in Pune and Mumbai.",
        "During corona , I went through the process in detail n now service my RO by myself.\n\nIt usually costs around 400-1200 per year based on things changed.",
        "Bro I’m on Aquaguard Aura and there’s a trick to lower the AMC, I get it around Rs 3500 and we are only two people",
        "Any source which you took reference from for the repairs?",
        "Bisleri is plastic as well",
        "Link to buy parts please? ",
        "Not all borewells have bad water. My borewell gives 80 tds only",
        "eureka forbes?",
        "Livpure is the worst. I had their water purifier, in its first year it worked for only 2 odd months rest of time it was with service center for repairs. Threw that thing in garbage after that.",
        "search on amazon",
        "I hate this company. I bought their purifier last year for about 11k. Now that the warranty is expired they are spam calling me for extended warranty/amc and how much it costs? 5.5k. What in the razor and blade model hell is this???? \n\nLike you I too live (mostly) alone. So i have been putting off the purchase. It's too much, half the cost of the machine is too damn much, of course you paid even more and must be livid.",
        "All you need to do is leave india.",
        "Same, for every 6 months charging 5k",
        "Pro tip, All water purifier are made of same components be it an expensive one or the assembled by your local seller. \n\nSo next time call a local RO purifier service. Just be vigilant about the brand of component being replaced. For example Dow membrane is considered good.\n\nBest is to buy locally assembled water purifier with best brand components. They can be serviced by anyone including you. Their are markets which sells RO related components. You just find them get the component at best price and pay local service man just the service charges.",
        "YouTube my bro",
        "Buy a eureka forbes Aquaguard or AO smith. Both are good brands. My Aquaguard is 5-6 years old and AMC is about 3000 per year including filter replacement.",
        "Wait whatttt",
        "Damn! I'm gonna research this out for myself.",
        "It's all a scam. With YouTube and little effort you can change filters yourself.\nBest quality filters don't cost more than ₹1200/-.",
        "I purchased the generic 7 in 1 ro from fk(marq) for 3k. Replaced it's power supply last year. Almost all the good quality generic parts will fit it and will try to get best possible membrane from local supplier. Everything included won't cost more than 5k for a couple years supplies for a small family.",
        "I come from Bhilai where the Bhilai Steel Plant (BSP) is situated. Most of the people living in BSP quarters have never heard of water purifiers. They get drinking water directly from the taps.\n\nThe majority of the population from Bhilai did not use water purifiers for the longest time. Wish it was the same for all other places too. They do charge for the water but it's nothing major.",
        "Thank you. Sounds great. I did check out some aftermarket filters online but wasn't sure of the quality. If they're certified filters, I'd be very happy to get them.",
        "Yesterday only my ro service was done, same company.\nThe sediment filter, carbon filter and membrane(1st time) got replaced and it cost only 4680.\nAlso the RO cost is 18k and 3 years old.",
        "Sounds great. For a place with such high TDS, pre filter makes a lot of sense. Since it's not so high at my place, I don't think pre-filter is required. The only question that comes to my mind however is, why do I have to use a filter to filter water for another filter which will again filter my water. \n\nI know pre-filter does not filter it to a drinkable level & I understand it makes the maintenance cheaper & what not, but it's also 2023-24. I've seen water bottles filtering brown water to drinkable normal water.",
        "That's great. I think changing the filters myself is the takeaway for me from this post.",
        "That's great. Do you do it yourself or get a technician?",
        "Bro, I understand the whole AMC & extended AMC situation. My problem with this is that even with AMC the prices are way too high.\n\nI understand that companies need to make money to sustain, but charging 2-3 times the market price is a plain rip-off.",
        "Yeah! The Livpure guy also suggested that I can get a filter installed from the source water tank.\n\nAnd then, get a pre-filter for my purifier.\n\nAnd then, whatever is left the purifier will make it drinkable.\n\nAnd then, I asked him to leave.",
        "Exactly. Even the AMC is quite expensive. The experience was bad but the fact that you have to pay so much for basic needs like water is so disheartening.",
        "Nah! I love this country however good or bad things are. I've stayed abroad & trust me, grass always looks greener on the other side.",
        "Best hai bhai. Maine hi raheesi dikha ke purifier le liya. Ab dukhi hun",
        "Yeah! Subscription models are a good option. I just don't have those options at my place or I'd have happily taken it up.",
        "I'm guessing they're talking about those water ATMs where you pay 5 bucks & get your can refilled. The only catch is that you'll have to go to that place with the can & get it refilled.",
        "Yeah man! I've done that for the longest time in Bangalore. These things do not exist at the place I live in currently. And also, the water can guys are not dependable, hence I decided to get a purifier for myself.",
        "If it's clean & drinkable you're lucky my friend.",
        "Thanks for the tips folks. Turns out my girlfriend knows how to change the filters & parts herself. She said she'll change all of it, I'll just have to get her the replacement parts. Hence, now I have a purifier technician handy all the time. 😎🤝",
        "Water purifier subscription services work out cheaper? I'm not sure about livpure but Bangalore has drink prime and it's pretty good and the prices are quite competitive!",
        "Sadly I don't have those options where I live. 🤷‍♂️",
        "Mind sharing it ?",
        "Isn't that just normal tap water though? Is it safe for drinking?",
        "All I can say is pre filter costs some 40 bucks and that can save you a lot of money. Try considering it.",
        "Which purifier do you have ? Because I think some of them have micro controllers in order to make self repair hard.",
        "Similar to this\n\nhttps://preview.redd.it/uvd4l8almzvc1.jpeg?width=500&format=pjpg&auto=webp&s=d885c0c3234389372710f1c4427ca1b75acbfd9a",
        "DIY yourself\n\nIt's not rocket science to do regular maintenance of your water filter",
        "Never call a company technician, find a local guy who works on all water purifier \n\nYou will always get a cheap deal \n\nAnd changing filters is no rocket science you can do it yourself as well if you want",
        "DIY",
        "do we really need these RO,UV,MF water filter. i was happy with my pureit basic sedimentary/gravitational water purifier",
        "In Calcutta I buy it from Chandni(a Nehru Place like thing), I pay like maybe 1/6th.  \nGet it replaced by the water purifier guy on the side.  \nWater purification companies are scammers.",
        "I just bought whatever was the cheapest during the sale.",
        "Most RO purifiers have this scam.",
        "Nope it's not😐.",
        "https://www.eurekaforbes.com/amc-kit-and-spares",
        "Only third party parts are available on Amazon. If you want to buy genuine parts, you'll have to buy from Eureka Forbes.",
        "With unemployment at an all time high since the last 10 years, that time to learn has already come.",
        "Fair. I'll check it out. Thanks dost :)",
        "And 10 rs to keep it in the kitchen. Which by the way is not optional because they think I'll \"break\" the \"plastic can\" if I do it myself. XD",
        "Drinkprime caters in gurgaon..I had it there..",
        "No purifier has micro controllers. It's all simple electricals only. YouTube is full of how tos and what to do videos.",
        "Sediment and carbon filters start at 500 for a set on amazon. And the pre-filter membrane can go as low as 40~50 bucks for one if buying a bulk pack. They don't go bad. Best to take and replace yourself.",
        "Pre-filters basically filter dirt. They do nothing to help reduce TDS. Since there is no chance for the water to be free of dissolved dirt, better to us a pre-filter regardless of the tds.",
        "probably eureka forbes themselves buys from third parties :)\n\nanyway third party parts are equally good.",
        "Which model",
        "Livpure RO subscription covers for all RO related expenses. You just need to subscribe to it. Click here to know more :- https://lsh.care/c043o\n\nYou can also use my referral code RA3YY5 for Rs 100/- discount.",
        "I bought samtha water purifier which comes with a stainless steel water tank, I used it for a year and then replaced all parts with Kent, like inline sediment, pre and post carbon, and replaced RO with nano membrane (nf20) because my input water is less than 250 tds. First time I had a local technician assemble it, then on I'm replacing the filters on my own every 18 month. I don't use uv, tds controller, mineral addition, high fi sensors and all that, I only use automatic shut off once tank is full. Nano filter membrane cost less than 1600, outside sediment filter 300(replaced every four months), inline sediment, pre and post carbon 600 each, hollow fiber ultra filtration 400.  I faced problem with Kent parts too, they stop working within 6-8 months. 😡 Both Kent and aqua guard parts are cheating. Better to go for non branded parts and replace it every 10 months.",
        "It's really an eye opener knowing non-branded parts do the same job & also stay longer. Thank you so much for sharing.",
        "old post but can you share the model?",
        "it's a generic RO bought from the local shop. mine is called \"aqua star\"\nthey don't have brand ambassadors so they don't cost that much. lol you can even buy kent filters etc",
        "I am from Bhilai as well, and this is true that we never used any water purifier ever. We never had any major health concerns due to bad quality water. Though this is because the water supply is controlled by Bhilai Steel Plant who does the water treatment before supply.",
        "Hey I'm thinking of buying a plain uv+uf model from aqua guard.They say it'll give change filter error in about 6 months or year or so.Will I be able to change it own my own? How much does it cost ? Their website ain't giving any info. Or should I go for some other brands ?",
        "Learn from this. It is high time you knew some basic handyman skills. Installing fans, changing taps, electrical switches, changing purifier filters, changing engine oil in your vehicle, changing a tyre or repairing a puncture etc are some things every person should know. Pro tip: A handyman kit which includes a drilling machine is a great purchase and will serve you your entire life. I have a Bosch kit that costed around 3.5k. Best purchase ever.",
        "Oh that's great 👍🏻\n\nBTW Which model do you have?",
        "That is the key: non-RO. Branded RO membranes have a chip which makes it impossible to be used with other local parts.",
        "No, branded RO membranes have chips, similar to HP printers. It is impossible to use local parts. It is a rip-off",
        "Did you find any?",
        "Yes. Close by hardware stores know all the hacks."
    ],
    "cleaned_text": "water purifier companies robbing daylight wanted shed light upon expensive water purifiers maintain get clean water dont pay maintenance well lucky ive read companies well prices equivalent daylight robbery purchased livpure water purifier back k discounts sale going purchasing checked online livpure filter prices around k thought expensive affordable ran well year livpures sales calls buy amc cut first week april decided get filters changed according used months livpure technician came home changed filters membrane etc tore receipt turn split dragonballs bill rs context stay alone station months seemed like ripoff got done anyway cut days post service purifier continuously throwing water point water tank house getting emptied constantly waited time thinking itd due new filter raised another complaint technician visits says pump gone bad rs rs service charge bill total water purifier service going rs said dont want get part replaced technician repaired took service charge still total rs probably uncover hope doesnt happen gist calculation pay rs per day water purifier like livpure top machine go faulty anytime parts expensive best well buy year amc costs k best part creating problem called expensive annual maintenance companies also audacity sell subscription service benefit dont service world clean air clean water food shelter basic needs life almost getting unaffordable everyday air purifiers air quality price daily groceries real estate water purifier ",
    "cleaned_title": "water purifier companies robbing daylight",
    "cleaned_selftext": "wanted shed light upon expensive water purifiers maintain get clean water dont pay maintenance well lucky ive read companies well prices equivalent daylight robbery purchased livpure water purifier back k discounts sale going purchasing checked online livpure filter prices around k thought expensive affordable ran well year livpures sales calls buy amc cut first week april decided get filters changed according used months livpure technician came home changed filters membrane etc tore receipt turn split dragonballs bill rs context stay alone station months seemed like ripoff got done anyway cut days post service purifier continuously throwing water point water tank house getting emptied constantly waited time thinking itd due new filter raised another complaint technician visits says pump gone bad rs rs service charge bill total water purifier service going rs said dont want get part replaced technician repaired took service charge still total rs probably uncover hope doesnt happen gist calculation pay rs per day water purifier like livpure top machine go faulty anytime parts expensive best well buy year amc costs k best part creating problem called expensive annual maintenance companies also audacity sell subscription service benefit dont service world clean air clean water food shelter basic needs life almost getting unaffordable everyday air purifiers air quality price daily groceries real estate water purifier",
    "cleaned_comments": "yes realised couple years back buying liters need change filters one year usage water purifier nonro eureka forbes sell spare parts online buy replace total real scam water purifiers turn red led something similar germ kill kit filters etc due replacement machine know part actually order answer really doesnt timerclock mechanism inside purifier counts months turns led red disables machine know saw technician reset button upon changing kit inquired come kit gone bad hadnt even used last months away got nervous spilled beans timer mechanism next time leds turned red reset clock without changing kit sure enough purifier checked water hardness etc perfectly fine means dont really need change kit per period mentioned company one big scam also think family uses water purifier obviously much larger quantity water family two much less however cases purifier needs kit replacement months makes sense whatsoever sediment filter unilevers quote bangalore purchase local hardware shop sensor lights replacement timer backed lights theyre reset year technician depends usage amount sediment water supply ditch ro water altogether bro recently brought k simple filter rama amazon apart issue constantly ripped bodies ripped calcium magnesium etc effects start show within years seedha tap ka paani peeta hu purifier wala kadwa lagta simple filter ok corporationmunicipality supplied water borewell tanker water simple filter might job father got one house back used months filter replacement light started blinking technician came place charged us bomb service filter change broke machine make shift fixes white tape around unit stopped working weeks later company refused unit even though warranty ditched unit cut losses spent service maintenance purchase price ham pani ki rs ki bottle mangvate rs kam ho jata wow bought rama filter months back family happy pls dont follow advise blindly always check tds parents municipality delhi jal board water filter never checked tds noticing white sediments water bottle got checked tds unhealthy turns djb started mixing ground water supply much demand got ro installed tds finally always check tds deciding water filtering system dont know got years extended warranty bucks plus use pre filter due actual filters protected tds much high earlier ro became useless filters filled salt high tds within months using pre filter fine using live pure r last years annual maintenance filter replacement cost pureit hul water purifier got apr pay k every months filter replacement cost service charges means unhealthy advertised every ro company sell products best tds value certainly worst either really concerned installing ro tds crosses qc put water tap pour water manually pot time learn fix small appliances like foreign countries bro go subscription model like drinkprimethe service freechange filter freeyou juse need pay monthly subscription extra water need limit monthpretty hassle freecheck healthy tds believe could take pains would recommend getting l water rupees someplaces said youre person living would last half days even take r per day would spending around per month water idk im taking context water purifier purchased go hassle getting water every day two replace ro filters year around dont need crazy brands get decent k uv ro go kent ro best quality good service disheartening basic requirements life getting costlier time due pollution climate change go branded stuff ripoff happen stuff sold authorised dealer bought aftermarket plastic cans leech probably leech plastic cant assured quality unless bisleri bought lg service great free year service latter extend around k cost bit high mine around k service great even changed motor without charge aqua guard running well since years dude everyone use simple filter youre lucky good source drinking water us borewells victim tacticscam routine service somehow something broke part call initial routine service nowsince years regular service getting parts amazon works cheaper nothing broken till power supply broke local shop wanted k fix got part amazon fixed mins usually water purifiers two treatment kill microbes uvultra filtration rouv romfuf along sediment filter white one installed outside name suggests filtering bigger particles ro required source water salty id higher tdstotal dissolved solids water tds less uv based treatment enough dont need ro catch cant store uv treated water storing reduces efficacy put simple terms hence wait seconds want water simple uv ufmf suffice places costs around k low running cost damn get full service kit amazon including ro membrane pay technician get done pretty easy understand would recommend learn need learn tds meter thats fyi tds also good get tds adjusted learnt youtube adjusted tds aquaguard sad reality even years independence unable supply actual drinking water people mujhe kya eureka forbes wale aate hi nhi service krne maybe used san francisco tap water tds tds tasted weird water flows delhi comes yamuna kinds contaminants prefer completely filter risk family health isnt risk drinking low tds water might well go low tds unhealthy plain misinformation based lack minerals argument makes sense think eat citrus fruit month cover whatever mineral intake get water chattisgarh cost r yeah kent water purifier purchased guess motor changed filters small tubes minerals guess replaced every years life depends clean tanki ka water think many ro users underestimate value prefilters go long way prolonging life main filters expensive replace compared prefilters dude get drinkprime india mein riot kardiya toh anti national kehdenge haha even plenty duplicate bisleri theyre mixing ground water people dug illegal holes pipes djb pipes water gets contaminated water otherwise said fit drink non branded ro branded filters pre carbon uv everything costed k previously copper variant service cost never aprts amazon cost k pay get installed theres rocket science segment commodities bro need read healthy tds level thread full misinformation comments till advocating pseudoscience please ignore guys also im reporting false information please tds measure purity measure total solutes solution high tds means salty water doesnt always mean water bad body isnt getting ripped camg much op wants believe drink ro water lactose intolerant aka milkmilk products dont take calcium supplements calcium levels blood work normal range im trying say dont need water fulfill nutritional needs need litres sea water pull mg rda yeah everyday dumbest myth circulated whatsapp cleared primary school fall retake maths bro change business model like printer companies ink cartridges paid almost much entire ro within years service parts kent proper city go find good ro parts wholesaler find quality parts rd price yes thats markup companies exact iso certifications also shops mechanic well charge kind service bottom line stay away sales service companies warranty stick local mechanic getting l water rupees bisleri bucks local water suppliers minimum pune mumbai corona went process detail n service ro usually costs around per year based things changed bro im aquaguard aura theres trick lower amc get around rs two people source took reference repairs bisleri plastic well link buy parts please borewells bad water borewell gives tds eureka forbes livpure worst water purifier first year worked odd months rest time service center repairs threw thing garbage search amazon hate company bought purifier last year k warranty expired spam calling extended warrantyamc much costs k razor blade model hell like live mostly alone putting purchase much half cost machine damn much course paid even must livid need leave india every months charging k pro tip water purifier made components expensive one assembled local seller next time call local ro purifier service vigilant brand component replaced example dow membrane considered good best buy locally assembled water purifier best brand components serviced anyone including markets sells ro related components find get component best price pay local service man service charges youtube bro buy eureka forbes aquaguard ao smith good brands aquaguard years old amc per year including filter replacement wait whatttt damn im gon na research scam youtube little effort change filters best quality filters dont cost purchased generic ro fkmarq k replaced power supply last year almost good quality generic parts fit try get best possible membrane local supplier everything included wont cost k couple years supplies small family come bhilai bhilai steel plant bsp situated people living bsp quarters never heard water purifiers get drinking water directly taps majority population bhilai use water purifiers longest time wish places charge water nothing major thank sounds great check aftermarket filters online wasnt sure quality theyre certified filters id happy get yesterday ro service done company sediment filter carbon filter membranest time got replaced cost also ro cost k years old sounds great place high tds pre filter makes lot sense since high place dont think prefilter required question comes mind however use filter filter water another filter filter water know prefilter filter drinkable level understand makes maintenance cheaper also ive seen water bottles filtering brown water drinkable normal water thats great think changing filters takeaway post thats great get technician bro understand whole amc extended amc situation problem even amc prices way high understand companies need make money sustain charging times market price plain ripoff yeah livpure guy also suggested get filter installed source water tank get prefilter purifier whatever left purifier make drinkable asked leave exactly even amc quite expensive experience bad fact pay much basic needs like water disheartening nah love country however good bad things ive stayed abroad trust grass always looks greener side best hai bhai maine hi raheesi dikha ke purifier le liya ab dukhi hun yeah subscription models good option dont options place id happily taken im guessing theyre talking water atms pay bucks get refilled catch youll go place get refilled yeah man ive done longest time bangalore things exist place live currently also water guys dependable hence decided get purifier clean drinkable youre lucky friend thanks tips folks turns girlfriend knows change filters parts said shell change ill get replacement parts hence purifier technician handy time water purifier subscription services work cheaper im sure livpure bangalore drink prime pretty good prices quite competitive sadly dont options live mind sharing isnt normal tap water though safe drinking say pre filter costs bucks save lot money try considering purifier think micro controllers order make self repair hard similar diy rocket science regular maintenance water filter never call company technician find local guy works water purifier always get cheap deal changing filters rocket science well want diy really need rouvmf water filter happy pureit basic sedimentarygravitational water purifier calcutta buy chandnia nehru place like thing pay like maybe th get replaced water purifier guy side water purification companies scammers bought whatever cheapest sale ro purifiers scam nope third party parts available amazon want buy genuine parts youll buy eureka forbes unemployment time high since last years time learn already come fair ill check thanks dost rs keep kitchen way optional think ill break plastic xd drinkprime caters gurgaoni purifier micro controllers simple electricals youtube full tos videos sediment carbon filters start set amazon prefilter membrane go low bucks one buying bulk pack dont go bad best take replace prefilters basically filter dirt nothing help reduce tds since chance water free dissolved dirt better us prefilter regardless tds probably eureka forbes buys third parties anyway third party parts equally good model livpure ro subscription covers ro related expenses need subscribe click know also use referral code rayy rs discount bought samtha water purifier comes stainless steel water tank used year replaced parts kent like inline sediment pre post carbon replaced ro nano membrane nf input water less tds first time local technician assemble im replacing filters every month dont use uv tds controller mineral addition high fi sensors use automatic shut tank full nano filter membrane cost less outside sediment filter replaced every four months inline sediment pre post carbon hollow fiber ultra filtration faced problem kent parts stop working within months kent aqua guard parts cheating better go non branded parts replace every months really eye opener knowing nonbranded parts job also stay longer thank much sharing old post share model generic ro bought local shop mine called aqua star dont brand ambassadors dont cost much lol even buy kent filters etc bhilai well true never used water purifier ever never major health concerns due bad quality water though water supply controlled bhilai steel plant water treatment supply hey im thinking buying plain uvuf model aqua guardthey say itll give change filter error months year sowill able change much cost website aint giving info go brands learn high time knew basic handyman skills installing fans changing taps electrical switches changing purifier filters changing engine oil vehicle changing tyre repairing puncture etc things every person know pro tip handyman kit includes drilling machine great purchase serve entire life bosch kit costed around k best purchase ever oh thats great btw model key nonro branded ro membranes chip makes impossible used local parts branded ro membranes chips similar hp printers impossible use local parts ripoff find yes close hardware stores know hacks",
    "light_cleaned_title": "Water purifier companies robbing you in daylight.",
    "light_cleaned_selftext": "I wanted to shed light upon how expensive water purifiers are to maintain. If you get clean water & don't have to pay for the maintenance, well lucky you. I've read about other companies as well & these prices are equivalent to daylight robbery. I purchased a Livpure water purifier back in 2023 for about 7.2K with all discounts & sale going on. While purchasing this, I checked online, Livpure filter prices were around 2K or so which I thought was expensive but affordable. All ran well all year, other than Livpure's sales calls to buy the AMC. Cut to first week of April 2024, I decided to get my filters changed because according to me I had used it for 6-7 months now. Livpure technician came home, changed filters, membrane etc. & tore me a receipt which in turn split my a** into 7 dragonballs. A bill of Rs. 5095. For context, I stay alone & I was out of station for about 7-8 months in 2023 so, this seemed like a rip-off. I got it done anyway. Cut to 2 days post service, the purifier was continuously throwing out water. To a point that the water tank in my house was getting emptied constantly. I waited for some time thinking it'd be due to the new filter but then raised another complaint. Technician visits, says some pump has gone bad which is Rs. 360 + Rs. 400 service charge. With this bill, my total for this water purifier service was going to be Rs. 5855. I said I don't want to get this part replaced, so the technician repaired it & took the service charge only. Still a total of Rs. 5455 & probably more to uncover which I hope doesn't happen. In a gist the calculation is, You pay, Rs. 30 per day to own a water purifier like Livpure. On top, your machine can go faulty anytime & the parts are expensive so all the best with that as well. OR you buy a 2 year AMC that costs about 10K. And the best part of all of this is, after creating a problem called expensive annual maintenance, these companies also have the audacity to sell subscription service where the benefit is that you don't have to service it. 💀💀 In a world where clean air, clean water, food & shelter are the basic needs of life, almost all of them are getting more & more unaffordable everyday. Be it air purifiers for air quality, price of the daily groceries, real estate & then this water purifier.",
    "light_cleaned_comments": "Yes, realised this couple of years back and now we're buying 20 liters can. No need to change filters before one year of usage. Our water purifier is a non-RO from Eureka Forbes. They sell the spare parts online, and I just buy those and replace myself. For \\~₹900 total. So here is the real scam. These water purifiers turn red LED on or something similar when your germ kill kit, filters etc are due for replacement. Now how does the machine know that the part is actually out of order? The answer is it really doesn't. There is a timer/clock mechanism inside your purifier which just counts down to 6 months and then it turns those led to red and disables your machine. I know this because I saw the technician reset the button upon changing the kit and I inquired how come the kit has gone bad if I hadn't even used it for the last 5 months (i was away) he got nervous and spilled the beans on the timer mechanism. So the next time the LEDs turned red I reset the clock myself, without changing the kit and sure enough the purifier was on again. I checked the water hardness etc and it was perfectly fine. Which means you don't really need to change the kit as per the period mentioned by the company. It's just one big scam. Also think about it. A family of 10 uses a water purifier for obviously a much larger quantity of water and a family of two for much less. However, in both cases the same purifier needs kit replacement after 6 months. That makes no sense whatsoever. Sediment filter is 1500 (Unilever's quote) in Bangalore. You can purchase it at a local hardware shop for 1000-1200. The sensor lights for replacement are just a timer backed lights. They're reset to 1 year by the technician. It depends on usage and amount of sediment in the water supply. Just ditch RO water altogether bro, did the same recently and brought a 6.5k Simple filter of Rama from Amazon. Apart from this issue of constantly being ripped, our bodies are being ripped of Calcium & Magnesium etc.. the effects of which start to show up within a few years. me to seedha tap ka paani peeta hu purifier wala kadwa lagta Simple filter is ok if it's corporation/municipality supplied water but if it's borewell or tanker water then a simple filter might not do the job. My father got one for our house back in 2018, we used it for a few months and then the filter replacement light started blinking. The technician came at our place charged us a bomb for service + filter change AND broke the machine, he did some make shift fixes with some white tape around the unit and it stopped working a few weeks later. Company refused to the unit even though it was under warranty. We ditched the unit and cut our losses because we spent more in its service and maintenance than the purchase price. Ham to pani ki 30 rs ki bottle mangvate he 240 rs me kam ho jata he Wow same, i bought the Rama filter 8-9 months back and me and the family is so happy with it. pls don't follow this advise blindly. Always check the TDS. My parents were municipality (Delhi Jal Board) water + filter but have never checked TDS. I was noticing white sediments in my water bottle so got it checked. The TDS was 350, which is very unhealthy. turns out DJB started mixing ground water into supply as there was too much demand. I got an RO installed and TDS is finally below 10. Always check TDS before deciding water filtering system. I don't know about you but I got 1+2 years extended warranty for 500 bucks Plus I use pre filter due to which actual filters are protected My tds is 2200 which is very much high and earlier ro became useless as filters filled with salt (from high tds) within 6-8 months But using the pre filter they are fine now. Using live pure r o from the last 2.5 years. Annual maintenance & filter replacement cost about ₹2,000/- for PureIt (HUL) water purifier. I got it for ~₹18000/- in Apr-2020. I pay 1k every 6-8 months. 800 for the filter replacement cost and 200 service charges. 350 is by no means 'very unhealthy' as advertised by every RO company to sell their products. It's not the best TDS value to have, but certainly not the worst either. You should really be concerned about installing RO only if your TDS crosses 500. QC - how to put water into it? Do you have tap or pour water manually with pot? With time we all will have to learn to fix these small appliances ourselves like they do in foreign countries. Bro go for a subscription model like drinkprime..the service is free..change of filter is free..you juse need to pay for monthly subscription or any extra water you need over your limit for the month..pretty hassle free..check it out.. Healthy tds is about 100 i believe If you could take the pains ,i would recommend getting a 20L can if water for 5 rupees (someplaces it's 10). As you said you're the only person living it would last you for about 1 and a half or 2 days so..... Even if you take 10r per day you would be spending around 300 per month on water ...... Idk if I'm taking this out of context as a water purifier is purchased for not having to go through the hassle of getting water every day or two. I replace my ro filters once a year for around 1200. You dont need these crazy brands, just get a decent once for 4-5k with uv, ro. Go for Kent RO. Best quality and good service It is disheartening that basic requirements of life are getting costlier all the time. Due to pollution and climate change If you go for branded stuff then a ripoff will happen. The same stuff sold by authorised dealer can be bought aftermarket. but plastic cans leech probably leech plastic, and you can't be assured of quality unless it's bisleri. You should have bought lg after service is great free 1 year service , latter you can extend it with around 3k. But it will cost you bit high mine was around 17k. But service is great they even changed motor without any charge My aqua guard is running well since 18 years Dude NO !!!! Everyone cannot use a simple filter. You're lucky to have a good source of drinking water. Some of us have Borewells I too was a victim of this tactic/scam. During the routine service they somehow did something which broke some part and we had to call them again after the initial routine service. Now(since 5 years) I do regular service myself by getting the parts from Amazon. Works out about 50% cheaper and nothing has broken till now. Once the power supply broke, the local shop wanted 1.8k to fix, got the part from Amazon for ~500 and fixed it myself in about 10-15 mins. Usually water purifiers have two treatment to kill microbes, UV+Ultra filtration, RO+UV, RO+MF/UF along with a sediment filter ( the white one that is installed outside and as the name suggests, it's for filtering \"bigger\" particles) RO is required when your source water is salty, I'd higher TDS(Total dissolved solids). If your water has a tds of 200 or less, UV based treatment is enough and you don't need a RO. The only catch here is that, you can't store UV treated water, storing reduces the efficacy (to put in simple terms) and hence you have to wait a few seconds when you want water. A simple UV + UF/MF should suffice for most of the places and costs around 6-7k with very low running cost. Damn. You can get a full service kit from Amazon at 1200 including RO membrane. You can pay 200 to the technician and get it done. But it's pretty easy to understand and I would recommend to learn it yourself. All you need is to learn and a TDS meter. Thats all FYI TDS below 10 is also not good. Get the TDS adjusted between 50-150. I learnt it from YouTube and adjusted TDS of aquaguard by myself It is a sad reality that even after 75 years after independence we are unable to supply actual drinking water to people :( Mujhe kya Eureka Forbes Wale to aate hi nhi service krne😉 Maybe. I am used to San Francisco tap water which has TDS of 35-50 and this 350 TDS tasted weird. The water which flows into Delhi comes from Yamuna which has all kinds of contaminants and I prefer to completely filter them out than risk family health. There isn't any risk to drinking low TDS water so might as well go for it. low TDS is not unhealthy. That is just plain misinformation based on lack of minerals argument, which makes no sense if you think about it. Just eat a citrus fruit once a month and it will cover whatever mineral intake you get from water In chattisgarh it cost 50r for a can Yeah i have kent. Water purifier was purchased in 2012 I guess. Motor was changed once, but the filters ( + small tubes of minerals i guess) are replaced after every 2 years. Their life depends on how clean your tanki ka water is. I think many RO users underestimate the value of pre-filters. They go a long way in prolonging the life of the main filters which are expensive to replace compared to the pre-filters. Dude, get drinkprime. India mein riot kardiya toh anti national kehdenge haha Even then you have plenty of duplicate bisleri They’re not mixing ground water, people have dug illegal holes and pipes in djb pipes by which water gets contaminated. The water otherwise is said to be fit to drink We have a non branded RO with all branded filters and pre carbon and uv and everything. It costed 6K previously, and now 7500 for copper variant. Service cost never more than 1000. All aprts from amazon cost 1K and you can pay 400 to get them installed. There’s no rocket science in it and this segment is commodities. Bro you need to read about healthy tds level This thread is all full of misinformation all comments till now are advocating pseudoscience; please ignore it guys. Also I'm reporting it for false information. Please do the same. TDS is *not* a measure of purity. It is a measure of total solutes in the solution. High TDS means it's salty water, doesn't always mean water is bad. Your body isn't getting ripped of Ca/Mg as much as the Op wants you to believe. I drink RO water and I am lactose intolerant, aka no milk/milk products and don't take any calcium supplements. My calcium levels in my blood work are in the normal range. What I'm trying to say is you don't need water to fulfill your nutritional needs. You will need 15 litres of sea water to pull out Mg at RDA (yeah everyday) this is the dumbest myth circulated on WhatsApp any1 that cleared primary school should not fall for it. Or they should retake maths. Bro I change it on my own. It's the same business model like printer companies and ink cartridges. I paid almost as much as the entire ro within 3 years in service and parts for kent. If you are in a proper city go find a good ro parts wholesaler , you will find the same quality parts for 1/3rd price ( yes that's the markup of these companies) . Exact same iso certifications and all . Also these shops have a mechanic as well who will charge 200-300 for any kind of service. Bottom line - Stay away from the after sales service of these companies once your warranty is over. Stick with a local mechanic. Where are you getting 20L water for 5-10 rupees? Bisleri is 100-110 bucks and local water suppliers are minimum 60 in Pune and Mumbai. During corona , I went through the process in detail n now service my RO by myself. It usually costs around 400-1200 per year based on things changed. Bro I’m on Aquaguard Aura and there’s a trick to lower the AMC, I get it around Rs 3500 and we are only two people Any source which you took reference from for the repairs? Bisleri is plastic as well Link to buy parts please? Not all borewells have bad water. My borewell gives 80 tds only eureka forbes? Livpure is the worst. I had their water purifier, in its first year it worked for only 2 odd months rest of time it was with service center for repairs. Threw that thing in garbage after that. search on amazon I hate this company. I bought their purifier last year for about 11k. Now that the warranty is expired they are spam calling me for extended warranty/amc and how much it costs? 5.5k. What in the razor and blade model hell is this???? Like you I too live (mostly) alone. So i have been putting off the purchase. It's too much, half the cost of the machine is too damn much, of course you paid even more and must be livid. All you need to do is leave india. Same, for every 6 months charging 5k Pro tip, All water purifier are made of same components be it an expensive one or the assembled by your local seller. So next time call a local RO purifier service. Just be vigilant about the brand of component being replaced. For example Dow membrane is considered good. Best is to buy locally assembled water purifier with best brand components. They can be serviced by anyone including you. Their are markets which sells RO related components. You just find them get the component at best price and pay local service man just the service charges. YouTube my bro Buy a eureka forbes Aquaguard or AO smith. Both are good brands. My Aquaguard is 5-6 years old and AMC is about 3000 per year including filter replacement. Wait whatttt Damn! I'm gonna research this out for myself. It's all a scam. With YouTube and little effort you can change filters yourself. Best quality filters don't cost more than ₹1200/-. I purchased the generic 7 in 1 ro from fk(marq) for 3k. Replaced it's power supply last year. Almost all the good quality generic parts will fit it and will try to get best possible membrane from local supplier. Everything included won't cost more than 5k for a couple years supplies for a small family. I come from Bhilai where the Bhilai Steel Plant (BSP) is situated. Most of the people living in BSP quarters have never heard of water purifiers. They get drinking water directly from the taps. The majority of the population from Bhilai did not use water purifiers for the longest time. Wish it was the same for all other places too. They do charge for the water but it's nothing major. Thank you. Sounds great. I did check out some aftermarket filters online but wasn't sure of the quality. If they're certified filters, I'd be very happy to get them. Yesterday only my ro service was done, same company. The sediment filter, carbon filter and membrane(1st time) got replaced and it cost only 4680. Also the RO cost is 18k and 3 years old. Sounds great. For a place with such high TDS, pre filter makes a lot of sense. Since it's not so high at my place, I don't think pre-filter is required. The only question that comes to my mind however is, why do I have to use a filter to filter water for another filter which will again filter my water. I know pre-filter does not filter it to a drinkable level & I understand it makes the maintenance cheaper & what not, but it's also 2023-24. I've seen water bottles filtering brown water to drinkable normal water. That's great. I think changing the filters myself is the takeaway for me from this post. That's great. Do you do it yourself or get a technician? Bro, I understand the whole AMC & extended AMC situation. My problem with this is that even with AMC the prices are way too high. I understand that companies need to make money to sustain, but charging 2-3 times the market price is a plain rip-off. Yeah! The Livpure guy also suggested that I can get a filter installed from the source water tank. And then, get a pre-filter for my purifier. And then, whatever is left the purifier will make it drinkable. And then, I asked him to leave. Exactly. Even the AMC is quite expensive. The experience was bad but the fact that you have to pay so much for basic needs like water is so disheartening. Nah! I love this country however good or bad things are. I've stayed abroad & trust me, grass always looks greener on the other side. Best hai bhai. Maine hi raheesi dikha ke purifier le liya. Ab dukhi hun Yeah! Subscription models are a good option. I just don't have those options at my place or I'd have happily taken it up. I'm guessing they're talking about those water ATMs where you pay 5 bucks & get your can refilled. The only catch is that you'll have to go to that place with the can & get it refilled. Yeah man! I've done that for the longest time in Bangalore. These things do not exist at the place I live in currently. And also, the water can guys are not dependable, hence I decided to get a purifier for myself. If it's clean & drinkable you're lucky my friend. Thanks for the tips folks. Turns out my girlfriend knows how to change the filters & parts herself. She said she'll change all of it, I'll just have to get her the replacement parts. Hence, now I have a purifier technician handy all the time. 😎🤝 Water purifier subscription services work out cheaper? I'm not sure about livpure but Bangalore has drink prime and it's pretty good and the prices are quite competitive! Sadly I don't have those options where I live. 🤷‍♂️ Mind sharing it ? Isn't that just normal tap water though? Is it safe for drinking? All I can say is pre filter costs some 40 bucks and that can save you a lot of money. Try considering it. Which purifier do you have ? Because I think some of them have micro controllers in order to make self repair hard. Similar to this DIY yourself It's not rocket science to do regular maintenance of your water filter Never call a company technician, find a local guy who works on all water purifier You will always get a cheap deal And changing filters is no rocket science you can do it yourself as well if you want DIY do we really need these RO,UV,MF water filter. i was happy with my pureit basic sedimentary/gravitational water purifier In Calcutta I buy it from Chandni(a Nehru Place like thing), I pay like maybe 1/6th. Get it replaced by the water purifier guy on the side. Water purification companies are scammers. I just bought whatever was the cheapest during the sale. Most RO purifiers have this scam. Nope it's not😐. Only third party parts are available on Amazon. If you want to buy genuine parts, you'll have to buy from Eureka Forbes. With unemployment at an all time high since the last 10 years, that time to learn has already come. Fair. I'll check it out. Thanks dost :) And 10 rs to keep it in the kitchen. Which by the way is not optional because they think I'll \"break\" the \"plastic can\" if I do it myself. XD Drinkprime caters in gurgaon..I had it there.. No purifier has micro controllers. It's all simple electricals only. YouTube is full of how tos and what to do videos. Sediment and carbon filters start at 500 for a set on amazon. And the pre-filter membrane can go as low as 40~50 bucks for one if buying a bulk pack. They don't go bad. Best to take and replace yourself. Pre-filters basically filter dirt. They do nothing to help reduce TDS. Since there is no chance for the water to be free of dissolved dirt, better to us a pre-filter regardless of the tds. probably eureka forbes themselves buys from third parties :) anyway third party parts are equally good. Which model Livpure RO subscription covers for all RO related expenses. You just need to subscribe to it. Click here to know more :- You can also use my referral code RA3YY5 for Rs 100/- discount. I bought samtha water purifier which comes with a stainless steel water tank, I used it for a year and then replaced all parts with Kent, like inline sediment, pre and post carbon, and replaced RO with nano membrane (nf20) because my input water is less than 250 tds. First time I had a local technician assemble it, then on I'm replacing the filters on my own every 18 month. I don't use uv, tds controller, mineral addition, high fi sensors and all that, I only use automatic shut off once tank is full. Nano filter membrane cost less than 1600, outside sediment filter 300(replaced every four months), inline sediment, pre and post carbon 600 each, hollow fiber ultra filtration 400. I faced problem with Kent parts too, they stop working within 6-8 months. 😡 Both Kent and aqua guard parts are cheating. Better to go for non branded parts and replace it every 10 months. It's really an eye opener knowing non-branded parts do the same job & also stay longer. Thank you so much for sharing. old post but can you share the model? it's a generic RO bought from the local shop. mine is called \"aqua star\" they don't have brand ambassadors so they don't cost that much. lol you can even buy kent filters etc I am from Bhilai as well, and this is true that we never used any water purifier ever. We never had any major health concerns due to bad quality water. Though this is because the water supply is controlled by Bhilai Steel Plant who does the water treatment before supply. Hey I'm thinking of buying a plain uv+uf model from aqua guard.They say it'll give change filter error in about 6 months or year or so.Will I be able to change it own my own? How much does it cost ? Their website ain't giving any info. Or should I go for some other brands ? Learn from this. It is high time you knew some basic handyman skills. Installing fans, changing taps, electrical switches, changing purifier filters, changing engine oil in your vehicle, changing a tyre or repairing a puncture etc are some things every person should know. Pro tip: A handyman kit which includes a drilling machine is a great purchase and will serve you your entire life. I have a Bosch kit that costed around 3.5k. Best purchase ever. Oh that's great 👍🏻 BTW Which model do you have? That is the key: non-RO. Branded RO membranes have a chip which makes it impossible to be used with other local parts. No, branded RO membranes have chips, similar to HP printers. It is impossible to use local parts. It is a rip-off Did you find any? Yes. Close by hardware stores know all the hacks."
}