{
    "id": "v9mqa9",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/v9mqa9/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 10,
    "num_comments": 4,
    "created_utc": 1654911010,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Watching The Boys, and they don't miss.",
        "Oh, man! \nWhat a ride.\n\nBrutal. \n\nAntony Starr is awesome. He brings so many layers to the character that if anyone else did it, it would have been : meh! \n\nUrban was born to play butcher. What an arsehole. He brings out the essence of the character beautifully.\n\nCan't wait for rest of it.\n\nBest.",
        "* The Boys\n* Nirmal Pathak ki Ghar Wapsi",
        "TV Series: Irma Vep, The Boys Season 3\n\nMovies: 10 Things I Hate About You. heath Ledger is very charming in this movie. A very good rom-com."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "watching boys dont miss oh man ride brutal antony starr awesome brings many layers character anyone else would meh urban born play butcher arsehole brings essence character beautifully cant wait rest best boys nirmal pathak ki ghar wapsi tv series irma vep boys season movies things hate heath ledger charming movie good romcom",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Watching The Boys, and they don't miss. Oh, man! What a ride. Brutal. Antony Starr is awesome. He brings so many layers to the character that if anyone else did it, it would have been : meh! Urban was born to play butcher. What an arsehole. He brings out the essence of the character beautifully. Can't wait for rest of it. Best. * The Boys * Nirmal Pathak ki Ghar Wapsi TV Series: Irma Vep, The Boys Season 3 Movies: 10 Things I Hate About You. heath Ledger is very charming in this movie. A very good rom-com."
}