{
    "id": "18bawac",
    "title": "Supreme Court asks if unmarried women having children through surrogacy is against Indian society",
    "url": "https://www.thehindu.com/news/national/supreme-court-asks-if-unmarried-women-having-children-through-surrogacy-is-against-indian-society/article67607109.ece",
    "selftext": "https://12ft.io/https://www.thehindu.com/news/national/supreme-court-asks-if-unmarried-women-having-children-through-surrogacy-is-against-indian-society/article67607109.ece",
    "flair": "Law & Courts",
    "score": 7,
    "num_comments": 6,
    "created_utc": 1701779230.0,
    "convurl": "https://external-preview.redd.it/Oc43Tl4i58Od8hQ43Mp1GdzMx5Z111TY0l5D-9toUuw.jpg?auto=webp&s=e11f36246506902ea8924a83b70256129a6a99a2",
    "comments": [
        "The Surrogacy (Regulation) Act, 2021 allows a widow, a divorced woman between the age of 35 and 45 years, and an infertile couple to avail the benefit of surrogacy. Representational file image. | Photo Credit: S. Mahinsha\n\nThe Supreme Court on December 5 questioned whether a single, unmarried woman having a child through surrogacy is an “accepted norm” in Indian society.\n\n“A single woman bearing a child is an exception and not a rule in Indian society because our society says to have children within marriage. A single woman bearing a child is outside marriage… That is not the accepted norm of Indian society,” Supreme Court judge B.V. Nagarathna orally observed.\n\nThe Bench, also comprising Justice Ujjal Bhuyan, was hearing a petition filed by a 38-year-old single and unmarried woman to become a mother through surrogacy.\n\nThe petitioner, represented by senior advocate Saurabh Kirpal, said she was “heavily diabetic” and pregnancy would pose a grave risk to her.\n\n“Even an unmarried woman has the right to have a child,” Mr. Kirpal submitted.\n\n\nJustice Nagarathna said the Parliament had recognised the “potential” of a widow or a divorcee, who had gone through marriage and was struck by the “misfortune” of losing her partner through death or divorce, to have a child through surrogacy.\n\nThe petitioner’s side argued that it was not their “misfortune” which led the Parliament to allow divorcees and widows to have children through surrogacy. They argued that the exclusion of unmarried women boiled down to “patriarchal stigma” against them.\n\nJustice Nagarathna said the law has made marriage a basis of classification, and not discrimination.\n\nThe judge said married and unmarried woman enjoy the same status and rights as far as termination of pregnancy was concerned. They were treated on par even in the case of adoption.\n\n“But here we are concerned whether single women can have children through surrogacy when the Parliament has not permitted it… Should this court say unmarried women can go for surrogacy?” Justice Nagarathna said.\n\n“Society may not be used to having a single woman bear children, but is that a reason to deny them the right? A multitude of women choose not to marry, some do not get married not because they wish to… Their choices have to be respected. We cannot force them to get married to have a child,” Mr. Kirpal submitted",
        "Wouldn't expect such comments from a woman",
        "Increase the number of justices and government lawyers in the country and see the development that takes place after that",
        "So...Basically it is legal, if you marry your donor and have a child through surrogacy, then divorce your donor.",
        "That will give parental rights to the \"donor\""
    ],
    "cleaned_text": "supreme court asks unmarried women children surrogacy indian society  ",
    "cleaned_title": "supreme court asks unmarried women children surrogacy indian society",
    "cleaned_selftext": "",
    "cleaned_comments": "surrogacy regulation act allows widow divorced woman age years infertile couple avail benefit surrogacy representational file image photo credit mahinsha supreme court december questioned whether single unmarried woman child surrogacy accepted norm indian society single woman bearing child exception rule indian society society says children within marriage single woman bearing child outside marriage accepted norm indian society supreme court judge bv nagarathna orally observed bench also comprising justice ujjal bhuyan hearing petition filed yearold single unmarried woman become mother surrogacy petitioner represented senior advocate saurabh kirpal said heavily diabetic pregnancy would pose grave risk even unmarried woman right child mr kirpal submitted justice nagarathna said parliament recognised potential widow divorcee gone marriage struck misfortune losing partner death divorce child surrogacy petitioners side argued misfortune led parliament allow divorcees widows children surrogacy argued exclusion unmarried women boiled patriarchal stigma justice nagarathna said law made marriage basis classification discrimination judge said married unmarried woman enjoy status rights far termination pregnancy concerned treated par even case adoption concerned whether single women children surrogacy parliament permitted court say unmarried women go surrogacy justice nagarathna said society may used single woman bear children reason deny right multitude women choose marry get married wish choices respected force get married child mr kirpal submitted wouldnt expect comments woman increase number justices government lawyers country see development takes place sobasically legal marry donor child surrogacy divorce donor give parental rights donor",
    "light_cleaned_title": "Supreme Court asks if unmarried women having children through surrogacy is against Indian society",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "The Surrogacy (Regulation) Act, 2021 allows a widow, a divorced woman between the age of 35 and 45 years, and an infertile couple to avail the benefit of surrogacy. Representational file image. | Photo Credit: S. Mahinsha The Supreme Court on December 5 questioned whether a single, unmarried woman having a child through surrogacy is an “accepted norm” in Indian society. “A single woman bearing a child is an exception and not a rule in Indian society because our society says to have children within marriage. A single woman bearing a child is outside marriage… That is not the accepted norm of Indian society,” Supreme Court judge B.V. Nagarathna orally observed. The Bench, also comprising Justice Ujjal Bhuyan, was hearing a petition filed by a 38-year-old single and unmarried woman to become a mother through surrogacy. The petitioner, represented by senior advocate Saurabh Kirpal, said she was “heavily diabetic” and pregnancy would pose a grave risk to her. “Even an unmarried woman has the right to have a child,” Mr. Kirpal submitted. Justice Nagarathna said the Parliament had recognised the “potential” of a widow or a divorcee, who had gone through marriage and was struck by the “misfortune” of losing her partner through death or divorce, to have a child through surrogacy. The petitioner’s side argued that it was not their “misfortune” which led the Parliament to allow divorcees and widows to have children through surrogacy. They argued that the exclusion of unmarried women boiled down to “patriarchal stigma” against them. Justice Nagarathna said the law has made marriage a basis of classification, and not discrimination. The judge said married and unmarried woman enjoy the same status and rights as far as termination of pregnancy was concerned. They were treated on par even in the case of adoption. “But here we are concerned whether single women can have children through surrogacy when the Parliament has not permitted it… Should this court say unmarried women can go for surrogacy?” Justice Nagarathna said. “Society may not be used to having a single woman bear children, but is that a reason to deny them the right? A multitude of women choose not to marry, some do not get married not because they wish to… Their choices have to be respected. We cannot force them to get married to have a child,” Mr. Kirpal submitted Wouldn't expect such comments from a woman Increase the number of justices and government lawyers in the country and see the development that takes place after that So...Basically it is legal, if you marry your donor and have a child through surrogacy, then divorce your donor. That will give parental rights to the \"donor\""
}