{
    "id": "162vgh6",
    "title": "'As hateful as Tripta Tyagi': Priyanka Chaturvedi on Kathua teacher thrashing student for writing Jai Shri Ram",
    "url": "https://www.hindustantimes.com/india-news/as-hateful-as-tripta-tyagi-priyanka-chaturvedi-on-kathua-teacher-thrashing-student-for-writing-jai-shri-ram-101693142537948.html",
    "selftext": "Are we not gonna talk about how quick they are at arresting this teacher? Meanwhile a certain other teacher will soon be made a minister of child welfare. /s",
    "flair": "Crime",
    "score": 1,
    "num_comments": 18,
    "created_utc": 1693154912,
    "convurl": "https://external-preview.redd.it/ywaxaNf6yiC4x9laGgVXLB6D_1mkCLyHRiL6O3_A1HE.jpg?auto=webp&s=ec8181655f1984eb3ea0df5dcf5248fc30f964b6",
    "comments": [
        "UP case: child was beaten for being Muslim/ bad in studies?\n\nJ&K case: child was beaten for expressing a religious sentiment/vandalising school property?\n\n Not sure how a teacher can justify hurting a child in either case.\n\nUP case: Teacher not arrested after having Muslim child slapped. Father being pressured to withdraw FIR. Twitter users facing censorship for highlighting incident.\n\nJ&K case: Teacher arrested after trashing Hindu child. \n\nWhy the difference in police action? \n\nFirst impulse  was different religion, different treatment. \n\nSecond thought: The J&K case victim is hospitalised- bigger crime, so response had to be proportionate.\n\n**In both cases, there's no excuse to beat children.**",
        "the teacher in j& k has been arrested because administration there is not bigoted.\n\nIn UP , teachers get arrested for prayer like \"lab pe dua\". MP of Muzaffarnagar himself goes to meet tripta tyagi and gives assurance of justice. So , there is false equivalence.\n\nOn one side administration is itself protecting the teacher , on other side administration is swift to take action. If in tripta tyagi case , religion were reversed, then I dont think she would be roaming free till now. MP would never gone to meet her. This is the whole issue. The same set of laws apply differently.",
        "I have an idea. Identify these bigoted teachers and send them to Slap fighting competition  to prove their point.",
        "Writing on blackboard is vandalising school property? Are you out of your mind?",
        "They have also booked J &K Teacher in Child abuse while they have not done the same to UP teacher",
        "seems like the kathua incident was inspired by tripta tyagi",
        "IT cell in action? Why suddenly so many 'reverse' cases after the first one in UP?",
        "it's not vandalizing school property, but kids are not allowed to write on blackboard without permission from the teacher and it certainly is an act which can get you thrashed in most schools in India and is very acceptable.",
        "You did not write things on the blackboard of your class during breaks or after school or even before school when there’s no class going on?",
        ">  although JSR is now a normal Hindu chant, it invokes unease among Muslims\n\nAt this point, it is akin to the allah hu akbar when ISIS and other terror groups used it.",
        "That was the best way I could imagine a school administrator would describe it.",
        "i did but we used to do it during recess and would erase it obviously. writing when there is no teacher around and making sure one doesn't get caught is different, also the teachers would thrash us if we were seen using chalk or duster since it was meant for them unless they ask the student to write",
        "Who is coaching kids to do shit like JSR on board etc? Anyone remember we had shit like this in class? Nope. The present generation of politicians are retards and even roping in children.",
        "Muslim bigots - Get arrested\n\nHindu bigots - Get BJP tickets."
    ],
    "cleaned_text": "hateful tripta tyagi priyanka chaturvedi kathua teacher thrashing student writing jai shri ram gon na talk quick arresting teacher meanwhile certain teacher soon made minister child welfare ",
    "cleaned_title": "hateful tripta tyagi priyanka chaturvedi kathua teacher thrashing student writing jai shri ram",
    "cleaned_selftext": "gon na talk quick arresting teacher meanwhile certain teacher soon made minister child welfare",
    "cleaned_comments": "case child beaten muslim bad studies jk case child beaten expressing religious sentimentvandalising school property sure teacher justify hurting child either case case teacher arrested muslim child slapped father pressured withdraw fir twitter users facing censorship highlighting incident jk case teacher arrested trashing hindu child difference police action first impulse different religion different treatment second thought jk case victim hospitalised bigger crime response proportionate cases theres excuse beat children teacher j k arrested administration bigoted teachers get arrested prayer like lab pe dua mp muzaffarnagar goes meet tripta tyagi gives assurance justice false equivalence one side administration protecting teacher side administration swift take action tripta tyagi case religion reversed dont think would roaming free till mp would never gone meet whole issue set laws apply differently idea identify bigoted teachers send slap fighting competition prove point writing blackboard vandalising school property mind also booked j k teacher child abuse done teacher seems like kathua incident inspired tripta tyagi cell action suddenly many reverse cases first one vandalizing school property kids allowed write blackboard without permission teacher certainly act get thrashed schools india acceptable write things blackboard class breaks school even school theres class going although jsr normal hindu chant invokes unease among muslims point akin allah hu akbar isis terror groups used best way could imagine school administrator would describe used recess would erase obviously writing teacher around making sure one doesnt get caught different also teachers would thrash us seen using chalk duster since meant unless ask student write coaching kids shit like jsr board etc anyone remember shit like class nope present generation politicians retards even roping children muslim bigots get arrested hindu bigots get bjp tickets",
    "light_cleaned_title": "'As hateful as Tripta Tyagi': Priyanka Chaturvedi on Kathua teacher thrashing student for writing Jai Shri Ram",
    "light_cleaned_selftext": "Are we not gonna talk about how quick they are at arresting this teacher? Meanwhile a certain other teacher will soon be made a minister of child welfare. /s",
    "light_cleaned_comments": "UP case: child was beaten for being Muslim/ bad in studies? J&K case: child was beaten for expressing a religious sentiment/vandalising school property? Not sure how a teacher can justify hurting a child in either case. UP case: Teacher not arrested after having Muslim child slapped. Father being pressured to withdraw FIR. Twitter users facing censorship for highlighting incident. J&K case: Teacher arrested after trashing Hindu child. Why the difference in police action? First impulse was different religion, different treatment. Second thought: The J&K case victim is hospitalised- bigger crime, so response had to be proportionate. **In both cases, there's no excuse to beat children.** the teacher in j& k has been arrested because administration there is not bigoted. In UP , teachers get arrested for prayer like \"lab pe dua\". MP of Muzaffarnagar himself goes to meet tripta tyagi and gives assurance of justice. So , there is false equivalence. On one side administration is itself protecting the teacher , on other side administration is swift to take action. If in tripta tyagi case , religion were reversed, then I dont think she would be roaming free till now. MP would never gone to meet her. This is the whole issue. The same set of laws apply differently. I have an idea. Identify these bigoted teachers and send them to Slap fighting competition to prove their point. Writing on blackboard is vandalising school property? Are you out of your mind? They have also booked J &K Teacher in Child abuse while they have not done the same to UP teacher seems like the kathua incident was inspired by tripta tyagi IT cell in action? Why suddenly so many 'reverse' cases after the first one in UP? it's not vandalizing school property, but kids are not allowed to write on blackboard without permission from the teacher and it certainly is an act which can get you thrashed in most schools in India and is very acceptable. You did not write things on the blackboard of your class during breaks or after school or even before school when there’s no class going on? > although JSR is now a normal Hindu chant, it invokes unease among Muslims At this point, it is akin to the allah hu akbar when ISIS and other terror groups used it. That was the best way I could imagine a school administrator would describe it. i did but we used to do it during recess and would erase it obviously. writing when there is no teacher around and making sure one doesn't get caught is different, also the teachers would thrash us if we were seen using chalk or duster since it was meant for them unless they ask the student to write Who is coaching kids to do shit like JSR on board etc? Anyone remember we had shit like this in class? Nope. The present generation of politicians are retards and even roping in children. Muslim bigots - Get arrested Hindu bigots - Get BJP tickets."
}