{
    "id": "17vwdfj",
    "title": "Why mainstream Media doing this?",
    "url": "https://www.reddit.com/gallery/17vwdfj",
    "selftext": "I want a sensible explanation, why I am seeing indian anchors Covering Israel Ground Report but none of them was visiting Manipur?\nI also watched that an Israeli soldier has to ask Times Now  journalist shouting unneccesarily in a war zone to calm down and lower his voice. \nIs Media allowed to show us anything they want? Isn't there any Authority to overwatch Mainstream Media?",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1700062918.0,
    "convurl": "https://i.redd.it/zjzd420w7j0c1.jpg",
    "comments": [
        "Very important thread. I'm saving this.",
        "Each one of them wants their Barkha Dutt moment.",
        "Hell",
        "They want to be celebrities in a Majoritarian society.",
        "Ofcourse they don't wanna cover what's happening in our own country where bjp rules but fly to isreal. You know pay cheque would be canceled. Also remember majority of rw youtuber and influencer either dint talk or tried to white wash what happened",
        "Can someone please bring them back ffs. Ugh.",
        "Israel's information warfare is quite good and Jews do actually run a lot of the world.",
        "If the current state of the media cannot wake up those who support the current Govt, I don't know what can (before its too late)",
        "Somebody has to be honest here. I don't care about downvotes.\n\nIndian politics have succefully created an aura of communal & political h@tred . The level of h@tred is being sky rocketed. \n\nThey aren't news anchors but more of salesmen who know which story sells for max profit.\n\nThey want to maximise their profits  and exploit the already Islam0phobic vibes created by the media. Common man is complicit as well. \n\n\"Those Muslims are coming\" is all what brings max profits now",
        "People here really need to calm themselves.If Indian News agencies want to send their reporters, they can and absolutely should since war reporting has been an integral part of the news ecosystem everywhere.\n\nI understand the inherent pro ruling-regime bias in their reporting but that's not any different from others on ground in Gaza/Israel.Plus I doubt many of these reporters have prior experience and uninhibited access inside Gaza to do ground reports from there so most of their sources are biased towards IDF.The lack of ground reports from Manipur is absolutely reprehensible but it's no excuse to exclude War coverage.Reports coming out of the region are heavily biased towards either side anyway so pick and choose with adequate fact checking.",
        "Because they don't care what you think. They get paid in lakhs and don't care what people think or comment. Even if I was paid crores like sudhir chaudhari for just going nothing, I would happily do it.",
        "War sells, especially in a foreign land",
        "They'll do whatever gets them maximum views/TRP, because the bottom line metric is revenue and human life is not valuable."
    ],
    "cleaned_text": "mainstream media want sensible explanation seeing indian anchors covering israel ground report none visiting manipur also watched israeli soldier ask times journalist shouting unneccesarily war zone calm lower voice media allowed show us anything want isnt authority overwatch mainstream media ",
    "cleaned_title": "mainstream media",
    "cleaned_selftext": "want sensible explanation seeing indian anchors covering israel ground report none visiting manipur also watched israeli soldier ask times journalist shouting unneccesarily war zone calm lower voice media allowed show us anything want isnt authority overwatch mainstream media",
    "cleaned_comments": "important thread im saving one wants barkha dutt moment hell want celebrities majoritarian society ofcourse dont wan na cover whats happening country bjp rules fly isreal know pay cheque would canceled also remember majority rw youtuber influencer either dint talk tried white wash happened someone please bring back ffs ugh israels information warfare quite good jews actually run lot world current state media wake support current govt dont know late somebody honest dont care downvotes indian politics succefully created aura communal political htred level htred sky rocketed arent news anchors salesmen know story sells max profit want maximise profits exploit already islamphobic vibes created media common man complicit well muslims coming brings max profits people really need calm themselvesif indian news agencies want send reporters absolutely since war reporting integral part news ecosystem everywhere understand inherent pro rulingregime bias reporting thats different others ground gazaisraelplus doubt many reporters prior experience uninhibited access inside gaza ground reports sources biased towards idfthe lack ground reports manipur absolutely reprehensible excuse exclude war coveragereports coming region heavily biased towards either side anyway pick choose adequate fact checking dont care think get paid lakhs dont care people think comment even paid crores like sudhir chaudhari going nothing would happily war sells especially foreign land theyll whatever gets maximum viewstrp bottom line metric revenue human life valuable",
    "light_cleaned_title": "Why mainstream Media doing this?",
    "light_cleaned_selftext": "I want a sensible explanation, why I am seeing indian anchors Covering Israel Ground Report but none of them was visiting Manipur? I also watched that an Israeli soldier has to ask Times Now journalist shouting unneccesarily in a war zone to calm down and lower his voice. Is Media allowed to show us anything they want? Isn't there any Authority to overwatch Mainstream Media?",
    "light_cleaned_comments": "Very important thread. I'm saving this. Each one of them wants their Barkha Dutt moment. Hell They want to be celebrities in a Majoritarian society. Ofcourse they don't wanna cover what's happening in our own country where bjp rules but fly to isreal. You know pay cheque would be canceled. Also remember majority of rw youtuber and influencer either dint talk or tried to white wash what happened Can someone please bring them back ffs. Ugh. Israel's information warfare is quite good and Jews do actually run a lot of the world. If the current state of the media cannot wake up those who support the current Govt, I don't know what can (before its too late) Somebody has to be honest here. I don't care about downvotes. Indian politics have succefully created an aura of communal & political h@tred . The level of h@tred is being sky rocketed. They aren't news anchors but more of salesmen who know which story sells for max profit. They want to maximise their profits and exploit the already Islam0phobic vibes created by the media. Common man is complicit as well. \"Those Muslims are coming\" is all what brings max profits now People here really need to calm themselves.If Indian News agencies want to send their reporters, they can and absolutely should since war reporting has been an integral part of the news ecosystem everywhere. I understand the inherent pro ruling-regime bias in their reporting but that's not any different from others on ground in Gaza/Israel.Plus I doubt many of these reporters have prior experience and uninhibited access inside Gaza to do ground reports from there so most of their sources are biased towards IDF.The lack of ground reports from Manipur is absolutely reprehensible but it's no excuse to exclude War coverage.Reports coming out of the region are heavily biased towards either side anyway so pick and choose with adequate fact checking. Because they don't care what you think. They get paid in lakhs and don't care what people think or comment. Even if I was paid crores like sudhir chaudhari for just going nothing, I would happily do it. War sells, especially in a foreign land They'll do whatever gets them maximum views/TRP, because the bottom line metric is revenue and human life is not valuable."
}