{
    "id": "1ahtol6",
    "title": "Trends in India's HDI UNDP human development reports (1990-2021)",
    "url": "https://i.redd.it/ih6fec2qqcgc1.jpeg",
    "selftext": "https://hdr.undp.org/data-center/specific-country-data#/countries/IND",
    "flair": "Policy/Economy",
    "score": 523,
    "num_comments": 134,
    "created_utc": 1706958071.0,
    "convurl": "https://i.redd.it/ih6fec2qqcgc1.jpeg",
    "comments": [
        "Source:\n\nhttps://hdr.undp.org/data-center/specific-country-data#/countries/IND",
        "The govt no longer recognises these indices from foreign organizations.\n\n>We have a set of self-appointed custodians of the world who find it very difficult to stomach that somebody in India is not looking for their approval, is not willing to play the game they want to play. So they invent their rules, their parameters, pass their judgments and make it look as if it is some kind of global exercise.\n\n-[S. Jaishankar ](https://www.news18.com/news/politics/hypocrisy-by-self-appointed-custodians-of-world-jaishankar-trashes-us-think-tanks-report-on-india-3532793.html)",
        "Jaishankar comes across like a very well read man, a smart orator and i believe it's the step in the right direction for the future of India's governance to have such highly capable individuals. \n\nThe above graph is recording incredibly positive data points for two decades...and slightly  negative for ~4 years .... Are we dismissing all of it because the org lies outside our country ? It's Indian representatives may very well have submitted the data...\n\nI am not saying our country is doomed ... But why are we dismissive of data in an age where we need to be collating more and more accurate and detailed data?",
        "Because government wants to push their manipulated data.\n\nIt will conflict with real data. \n\nhttps://www.moneycontrol.com/news/opinion/niti-aayogs-claim-of-a-steep-fall-in-poverty-doesnt-pass-the-smell-test-12106021.html",
        "Avoiding global scrutiny is a step closer towards dictatorship.",
        "And the dumbing down of a billion people .....\n\nAnd for what ? So that a few hundred people can sit in a few seats they like ?",
        "Yeah exactly",
        "Wonder why more Indians are leaving the country if JSK political jumla is to be believed.\n\nhttps://indianexpress.com/article/opinion/columns/poor-middle-class-wealthy-more-indians-are-leaving-country-9091963/lite/",
        "Looks like covid effect? Any data for last year?",
        "Fake news peddled by Soros media,aunty nashanal OP 🤬",
        "It seems hdi has stagnated since 2014.",
        "Our hdi has stagnated since 2014, covid did make things worse tho.",
        "Most nations experienced a drop in HDI due to COVID and aftermath effects.\n\nLet's wait for the new report before making any judgements.",
        "2014 with demo followed by COVID. Things accelerated after COVID 19",
        "BJP will call it global conspiracy or some shit lol",
        "https://preview.redd.it/qikw2gohedgc1.jpeg?width=969&format=pjpg&auto=webp&s=eb7565c51a34546635c9b171d17a0439b2df9548",
        "Yeah it was stagflation effects of demonetisation clearly see a flat candle in 2018",
        "yeah and in 2017-18 the trend reversed way before COVID",
        "Okay",
        "You can clearly see the trend reversal from 2018. Before COVID.",
        "It’s kinda of hard to believe since we have been pulling people out of poverty since many years. Where are we failing? Seems to be education and healthcare ",
        "Forgot the /s",
        "Fun fact: HDI was made by 2 Pakistani economist. So clearly ISI hit job it is.",
        "Of course!",
        "Soros, aunty and nashanal. /s not needed.",
        "Curious, what is the data like for 2021-22?",
        "So Pakistani economists would create a metric that shows their own country in the worst light. ISI maybe on their tail but it's certainly not ISI's job.\n\nPakistani HDi rank is 161 versus Indian HDi of 139",
        "2021 is the last red candle\n\n2022 data not yet available.",
        "Don't want to make it so obvious.\n\nSaw some stat in indian subreddit where India was 1st and Pakistan was 10th in religious harmony or some shit and every indian rejected it.",
        "It started declining in 2018",
        "> Where are we failing?\n\nAccording to the report, the drop between 2020 and 2021 is due to massive drop in life expectancy, so definitely covid effect.",
        "It was demonetisation. A lot of MSMEs went under. 2016 is when it flattens out.",
        "It's almost like 2020-21 was a global pandemic",
        "Well India is definitely a lot better in religious harmony compared to countries like Pakistan and Myanmar.\n\nCanada is at the top in global religious harmony\n\nIndia's ranking would be a lot better if these far right gangs are reigned in.\n\nPakistan is also not very democratic since the army has significant influence on the government.",
        "Yeah but the decline started in 2018",
        "I would believe a report where they've done their homework over random human beings.\n\nOf course they can make mistakes but I don't see how they'll favour Pakistan over India. It's not like Pakistan is important to those making the report or something.\n\nSurprisingly, sectarian violence is down in Pakistan as establishment is busy with PTI and Imran Khan so they don't have time for sectarian stuff.\n\nAlso Saudi and Iran aren't funding the madarssah that give fiery speeches against each other.\n\nAs for non Muslims, there aren't many left to kill or convert so you don't hear many news about it too.",
        "Ok is 22-23 data available?",
        "In India things are getting worse everyday The Modi government is in power. \n\nI think you mean religious intolerance ranking.\n\nWhere India ranks 194.",
        "No",
        "The graph is based off data available till September 8th 2022.",
        "You do know that it was due to COVID right?",
        "Not entirely. You can see the decline in 2018",
        "Also misleading poverty metrics, bjp government brought the threshold of poverty down. For example, if you keep doing that and bring it down to 0, then even by having 1 rupee to your name, you won't be poor. They brought down minimum food requirements used in definition of poverty, and probably don't include inflation in the metric which means not as many people might be lifted out of poverty",
        "Isn't that due to demonetization and shoddy implementation of GST? But now GST is alright but still confusing for a lot",
        "The drop is due to covid and decrease in life expectancy..china is irrelevant because they fudged covid deaths data…their official number is 120k deaths…studies suggest close to 2 million deaths during covid. Indias trend is inline with other countries.\n\nhttps://preview.redd.it/q45s28sbsdgc1.jpeg?width=1290&format=pjpg&auto=webp&s=48231001734bf0c957eafe6e579d383ad004664a",
        "Yeah everyone is fake only vishwaguru is real.",
        "Amartya sen is an indian no? 🤔",
        "I am talking about 2018 what happened there? \n\nWhy is the graph stagnant at 2018",
        "Yeah mostly",
        "I can see an increase till 2019 in the image u shared.",
        "The whole world trend is downwards\n\nhttps://hdr.undp.org/data-center/human-development-index#/indicies/HDI",
        "Yes. But India started declining in 2018 before covid",
        "That blue trendline is China",
        "It's a long way down to ramraj. ",
        "Yeah",
        "No one should take HDI data from such established institutions seriously. Over the time several “Indices”, have been developed by international organisations to measure economy & public welfare under a State. We, must remember that none of these are foolproof. The saying that “Rich becomes richer, & poor becomes poorer”, is the truth and basic norm, and there is no formula to make a correct assessment, and it is a truth be it USA or China; India is no exception.\n\nHDI, developed by UNDP, is a scale from 0 to 1, showing quality of life. The more value, the more enhanced quality of life! HDI depends on 3-factors, (a) Health (Measured by life expectancy), (b) Education Index, & (c) Income Index. The geometric mean of all 3 above is HDI, i.e HDI= ✓[(a)x(b)x(c)]^1/3.\n\nNow, India, with a rapidly growing population, death due to Dengu, ANI virus, TB, etc, has not been able to increase its average life expectancy, which is only about 70 years, against 85 in developed nations. Similarly, region wise education, particularly of poorer families is lacking. In fact, in villages, parents still do not send their wards to schools, rather prefer them to learn family business.\n\nAnd finally the Income index, which is Gross National Income per capita ( As told these do not reflect actual state of income). The PPP model based on purchase power (A scale of $100 -$75,000) is again an average, not distinguishing between poor & rich.\n\nIndia is at 0.633 in the index and India is at 0.123 in the Multi-Dimensional Poverty Index (MPI). Considering huge influx of refugees, uncontrolled births, it assumes a cognisable figure. Based on consistent indicators, methodology and time-series data, India's HDI values were 0.434 in 1990, 0.491 in 2000, 0.575 in 2010, 0.629 in 2015, 0.645 in 2018, 0.645 in 2019, 0.642 in 2020 and 0.633 in 2021. \n\nFrom 2020 HDI value of 0.642, India’s 2021 HDI value reached 0.633 (i.e., it changed by -0.009 points). From 2019 HDI value of 0.645, India’s 2020 HDI value arrived at 0.642 (i.e., it changed by -0.003 points).\n\nIndia’s HDI value for 2021 was 0.633. However, when the value is discounted for inequality, the HDI falls to 0.475, a loss of around 25.0 percent due to inequality in the distribution of the HDI dimension indices.\n\nBetween 1990 and 2021, India’s HDI value increased from 0.434 to 0.633 (based on consistent indicators, methodology and time-series data) — an increase by 45.85 percent and this is quite significant.",
        "You mean purple?",
        "Yeah HDI for 75% of the poorest in India is way worse.",
        "This is because of COVID. Per capita income and years of schooling are improving. Life expectancy fell due to the pandemic.",
        "I mean the sudden rise in economic factors are also result of post covid activities,but BJP clowns do take alot of pride over that.",
        "Drop feels steeper to me, compared to world average",
        "Okay then explain the flat candle in 2018",
        "It's their modus operandi, if any thing good happens in India, its all because of Supreme Leader. If anything bad happens, it happened either because of complicated global reasons, or global conspiracy to defame India or didn't even happened at all.",
        "Demonetisation ",
        "https://preview.redd.it/a11u37c74egc1.jpeg?width=1170&format=pjpg&auto=webp&s=8b761e8e210d05c04189722b2fcd9f3adc7b3d25\n\nFor people screaming Covid, only the last two points are during Covid. Our human develop stagnated since 2014, since we became vishwaguru.\n\nVishwagurus don’t need development, they need ego satisfaction through self appraisal & chest thumping.\n\nWhen I showed this to my roommate (we’re in US), he started spewing Soros & anti-national bullshit. If anything, if west hates India, it hates China even more. You’re not seeing stunted growth since 2014 in China, are you?",
        "Interesting...BJP Cell gonna call this international conspiracy....\n\nI like the fact that they won't be able to explain why even after the nuke test in 1998 and a BJP Government under ABV which has fundamentally the same ideology has such a good record...1998 and 2002 are remarkable in this graph...just shows that this government shat the bed...COVID isn't the reason...the data before 2020 is already going negative....",
        "HDI only includes per capita income, no of years of education and life expectancy. The first two metrics have been increasing constantly so it's apparently the life expectancy decreasing. I highly doubt that, and I would like to see the methodology used.",
        "Yeah but it does like it could have been more significant without masterstroke after masterstroke since 2014",
        "Yeah exactly. HDi growth was completely flat in 2017- 2018",
        "You can check it out at the source document",
        "Yeah we had BJP government before during this time period lead AB Vajpayee who will never approve this hate politics of Modi government. \n\nBasically the Modi-shah duo has complete centralised control because their electoral theopolitical machinery works and they promise leaders they will make them MP/MLA through Modi effect but that they have to do what they say. Anyone who doesn't listen to them is sidelined or bullied.",
        "I can see that and it's not surprising at all.\n\nWith the GDP increasing while HDI decreasing it's quite evident that the Government is working with the sole objective of making the country an Oligarch state.",
        "Even Atal Bihari ruled during this time period and he didn't do that carnage to the economy with demonetisation and stuff the way Modi did.",
        "Ah, nehru at it again",
        "Momentum from pre-2014 leadership can only go so far yk….",
        "Nehru died on 27 May 1964",
        "Nehru still lives as a figment of Modi's imagination.",
        "It does not align with our government thesis, so it is untrue and an attempt to stigmatize the government's image.",
        "Where is the government thesis",
        "Like Atal Bihari",
        "We reject this report, wholeheartedly.\n\nThis is a conspiracy by foreign media to ruin India's image as every developed country is jealous of how fast India is progressing.",
        "It's because half of that growth was intrinsic and was gonna happen irrespective of which party was in power not because of the BJP.",
        "It's not progressing as fast\n\nOur government is fudging data\n\nhttps://www.moneycontrol.com/news/opinion/niti-aayogs-claim-of-a-steep-fall-in-poverty-doesnt-pass-the-smell-test-12106021.html\n\nhttps://www.thequint.com/news/india/new-method-road-highway-calculation-nitin-gadkari",
        "India’s life expectancy is 70 years ( not 76)",
        "While this is worrying, what people are missing is that these trends are there for many other countries as well. \n\n* Germany: [https://hdr.undp.org/data-center/specific-country-data#/countries/DEU](https://hdr.undp.org/data-center/specific-country-data#/countries/DEU)\n* Canada: [https://hdr.undp.org/data-center/specific-country-data#/countries/CAN](https://hdr.undp.org/data-center/specific-country-data#/countries/CAN)\n* Malaysia: [https://hdr.undp.org/data-center/specific-country-data#/countries/MYS](https://hdr.undp.org/data-center/specific-country-data#/countries/MYS)\n* Singapore: [https://hdr.undp.org/data-center/specific-country-data#/countries/SGP](https://hdr.undp.org/data-center/specific-country-data#/countries/SGP)\n\nCovid-19 really did a number on economies all over the world. That combined with climate change and worsened geopolitical situation aren't helping matters at all.",
        "Covid has played some role but Indian HDi was already declining before COVID. You can see the inversion starting from 2017- 2018.",
        "Why are you shamelessly lying like this?",
        "https://preview.redd.it/nq3zuo1o6fgc1.png?width=720&format=pjpg&auto=webp&s=56eeb0ff9f0defa2abf23782b02d5a7fb6b498c1",
        "Did you forget the fact that Amartya Sen(Indian) also Co founded it.\n\nAgain lying by saying the half truth to fulfil your agenda.",
        "Most public will still vote for Modi to remain in power in a few months, so everything seems alright.",
        "So what decreased? Education, life expectancy or income?",
        "Yeah and who was at fault for that shitty move/strategy, till now I've seen no politician taking responsibility\n\nBut Mr Modi said give me 50 days time otherwise call me to any chowraha and I will come to face public and their punishments.",
        "NRI Indian moment",
        "I went to the link OP shared and checked other countries \n\nIt seems to be a global trend rather than just being india specific \n\nYou can check it out as well",
        "He's Bengali, so the worst",
        "In other countries the decline started in 2020. In India it started in 2017-18 way before COVID.\n\nhttps://preview.redd.it/wkidbiiimhgc1.jpeg?width=969&format=pjpg&auto=webp&s=128bf81897f0146e8b28e66a5eec6ca313949857",
        "Everything",
        "Let's see",
        "If you see the report the graph right next to it is comparing against world avg and they both mirror… this is a global phenomenon",
        "My left leg ran 10 kilometers and my right left also ran 10 kilometers. Ooh! I forgot. My hands. They also",
        "Congratulations you ran a marathon.",
        "Wow! All my friends outside of India are respecting me now. They never respected me before. Thanks Modi Ji!",
        "It's called fear not respect.",
        "Real income for sure, possibly education even if literacy may have increased.",
        "sudden fall",
        "Yeah sudden trend reversal from 2017-18",
        "BJP and its members were happy sharing the same indices during the Modi's first term when the indices were still returning good numbers due to inertia from the previous UPA terms."
    ],
    "cleaned_text": "trends indias hdi undp human development reports  ",
    "cleaned_title": "trends indias hdi undp human development reports",
    "cleaned_selftext": "",
    "cleaned_comments": "source govt longer recognises indices foreign organizations set selfappointed custodians world find difficult stomach somebody india looking approval willing play game want play invent rules parameters pass judgments make look kind global exercise jaishankar httpswwwnewscomnewspoliticshypocrisybyselfappointedcustodiansofworldjaishankartrashesusthinktanksreportonindiahtml jaishankar comes across like well read man smart orator believe step right direction future indias governance highly capable individuals graph recording incredibly positive data points two decadesand slightly negative years dismissing org lies outside country indian representatives may well submitted data saying country doomed dismissive data age need collating accurate detailed data government wants push manipulated data conflict real data avoiding global scrutiny step closer towards dictatorship dumbing billion people hundred people sit seats like yeah exactly wonder indians leaving country jsk political jumla believed looks like covid effect data last year fake news peddled soros mediaaunty nashanal op seems hdi stagnated since hdi stagnated since covid make things worse tho nations experienced drop hdi due covid aftermath effects lets wait new report making judgements demo followed covid things accelerated covid bjp call global conspiracy shit lol yeah stagflation effects demonetisation clearly see flat candle yeah trend reversed way covid okay clearly see trend reversal covid kinda hard believe since pulling people poverty since many years failing seems education healthcare forgot fun fact hdi made pakistani economist clearly isi hit job course soros aunty nashanal needed curious data like pakistani economists would create metric shows country worst light isi maybe tail certainly isis job pakistani hdi rank versus indian hdi last red candle data yet available dont want make obvious saw stat indian subreddit india st pakistan th religious harmony shit every indian rejected started declining failing according report drop due massive drop life expectancy definitely covid effect demonetisation lot msmes went flattens almost like global pandemic well india definitely lot better religious harmony compared countries like pakistan myanmar canada top global religious harmony indias ranking would lot better far right gangs reigned pakistan also democratic since army significant influence government yeah decline started would believe report theyve done homework random human beings course make mistakes dont see theyll favour pakistan india like pakistan important making report something surprisingly sectarian violence pakistan establishment busy pti imran khan dont time sectarian stuff also saudi iran arent funding madarssah give fiery speeches non muslims arent many left kill convert dont hear many news ok data available india things getting worse everyday modi government power think mean religious intolerance ranking india ranks graph based data available till september th know due covid right entirely see decline also misleading poverty metrics bjp government brought threshold poverty example keep bring even rupee name wont poor brought minimum food requirements used definition poverty probably dont include inflation metric means many people might lifted poverty isnt due demonetization shoddy implementation gst gst alright still confusing lot drop due covid decrease life expectancychina irrelevant fudged covid deaths datatheir official number k deathsstudies suggest close million deaths covid indias trend inline countries yeah everyone fake vishwaguru real amartya sen indian talking happened graph stagnant yeah mostly see increase till image u shared whole world trend downwards yes india started declining covid blue trendline china long way ramraj yeah one take hdi data established institutions seriously time several indices developed international organisations measure economy public welfare state must remember none foolproof saying rich becomes richer poor becomes poorer truth basic norm formula make correct assessment truth usa china india exception hdi developed undp scale showing quality life value enhanced quality life hdi depends factors health measured life expectancy b education index c income index geometric mean hdi ie hdi axbxc india rapidly growing population death due dengu ani virus tb etc able increase average life expectancy years developed nations similarly region wise education particularly poorer families lacking fact villages parents still send wards schools rather prefer learn family business finally income index gross national income per capita told reflect actual state income ppp model based purchase power scale average distinguishing poor rich india index india multidimensional poverty index mpi considering huge influx refugees uncontrolled births assumes cognisable figure based consistent indicators methodology timeseries data indias hdi values hdi value indias hdi value reached ie changed points hdi value indias hdi value arrived ie changed points indias hdi value however value discounted inequality hdi falls loss around percent due inequality distribution hdi dimension indices indias hdi value increased based consistent indicators methodology timeseries data increase percent quite significant mean purple yeah hdi poorest india way worse covid per capita income years schooling improving life expectancy fell due pandemic mean sudden rise economic factors also result post covid activitiesbut bjp clowns take alot pride drop feels steeper compared world average okay explain flat candle modus operandi thing good happens india supreme leader anything bad happens happened either complicated global reasons global conspiracy defame india didnt even happened demonetisation people screaming covid last two points covid human develop stagnated since since became vishwaguru vishwagurus dont need development need ego satisfaction self appraisal chest thumping showed roommate us started spewing soros antinational bullshit anything west hates india hates china even youre seeing stunted growth since china interestingbjp cell gon na call international conspiracy like fact wont able explain even nuke test bjp government abv fundamentally ideology good record remarkable graphjust shows government shat bedcovid isnt reasonthe data already going negative hdi includes per capita income years education life expectancy first two metrics increasing constantly apparently life expectancy decreasing highly doubt would like see methodology used yeah like could significant without masterstroke masterstroke since yeah exactly hdi growth completely flat check source document yeah bjp government time period lead ab vajpayee never approve hate politics modi government basically modishah duo complete centralised control electoral theopolitical machinery works promise leaders make mpmla modi effect say anyone doesnt listen sidelined bullied see surprising gdp increasing hdi decreasing quite evident government working sole objective making country oligarch state even atal bihari ruled time period didnt carnage economy demonetisation stuff way modi ah nehru momentum pre leadership go far yk nehru died may nehru still lives figment modis imagination align government thesis untrue attempt stigmatize governments image government thesis like atal bihari reject report wholeheartedly conspiracy foreign media ruin indias image every developed country jealous fast india progressing half growth intrinsic gon na happen irrespective party power bjp progressing fast government fudging data indias life expectancy years worrying people missing trends many countries well germany httpshdrundporgdatacenterspecificcountrydatacountriesdeuhttpshdrundporgdatacenterspecificcountrydatacountriesdeu canada httpshdrundporgdatacenterspecificcountrydatacountriescanhttpshdrundporgdatacenterspecificcountrydatacountriescan malaysia httpshdrundporgdatacenterspecificcountrydatacountriesmyshttpshdrundporgdatacenterspecificcountrydatacountriesmys singapore httpshdrundporgdatacenterspecificcountrydatacountriessgphttpshdrundporgdatacenterspecificcountrydatacountriessgp covid really number economies world combined climate change worsened geopolitical situation arent helping matters covid played role indian hdi already declining covid see inversion starting shamelessly lying like forget fact amartya senindian also co founded lying saying half truth fulfil agenda public still vote modi remain power months everything seems alright decreased education life expectancy income yeah fault shitty movestrategy till ive seen politician taking responsibility mr modi said give days time otherwise call chowraha come face public punishments nri indian moment went link op shared checked countries seems global trend rather india specific check well hes bengali worst countries decline started india started way covid everything lets see see report graph right next comparing world avg mirror global phenomenon left leg ran kilometers right left also ran kilometers ooh forgot hands also congratulations ran marathon wow friends outside india respecting never respected thanks modi ji called fear respect real income sure possibly education even literacy may increased sudden fall yeah sudden trend reversal bjp members happy sharing indices modis first term indices still returning good numbers due inertia previous upa terms",
    "light_cleaned_title": "Trends in India's HDI UNDP human development reports (1990-2021)",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "Source: The govt no longer recognises these indices from foreign organizations. >We have a set of self-appointed custodians of the world who find it very difficult to stomach that somebody in India is not looking for their approval, is not willing to play the game they want to play. So they invent their rules, their parameters, pass their judgments and make it look as if it is some kind of global exercise. -[S. Jaishankar ](https://www.news18.com/news/politics/hypocrisy-by-self-appointed-custodians-of-world-jaishankar-trashes-us-think-tanks-report-on-india-3532793.html) Jaishankar comes across like a very well read man, a smart orator and i believe it's the step in the right direction for the future of India's governance to have such highly capable individuals. The above graph is recording incredibly positive data points for two decades...and slightly negative for ~4 years .... Are we dismissing all of it because the org lies outside our country ? It's Indian representatives may very well have submitted the data... I am not saying our country is doomed ... But why are we dismissive of data in an age where we need to be collating more and more accurate and detailed data? Because government wants to push their manipulated data. It will conflict with real data. Avoiding global scrutiny is a step closer towards dictatorship. And the dumbing down of a billion people ..... And for what ? So that a few hundred people can sit in a few seats they like ? Yeah exactly Wonder why more Indians are leaving the country if JSK political jumla is to be believed. Looks like covid effect? Any data for last year? Fake news peddled by Soros media,aunty nashanal OP 🤬 It seems hdi has stagnated since 2014. Our hdi has stagnated since 2014, covid did make things worse tho. Most nations experienced a drop in HDI due to COVID and aftermath effects. Let's wait for the new report before making any judgements. 2014 with demo followed by COVID. Things accelerated after COVID 19 BJP will call it global conspiracy or some shit lol Yeah it was stagflation effects of demonetisation clearly see a flat candle in 2018 yeah and in 2017-18 the trend reversed way before COVID Okay You can clearly see the trend reversal from 2018. Before COVID. It’s kinda of hard to believe since we have been pulling people out of poverty since many years. Where are we failing? Seems to be education and healthcare Forgot the /s Fun fact: HDI was made by 2 Pakistani economist. So clearly ISI hit job it is. Of course! Soros, aunty and nashanal. /s not needed. Curious, what is the data like for 2021-22? So Pakistani economists would create a metric that shows their own country in the worst light. ISI maybe on their tail but it's certainly not ISI's job. Pakistani HDi rank is 161 versus Indian HDi of 139 2021 is the last red candle 2022 data not yet available. Don't want to make it so obvious. Saw some stat in indian subreddit where India was 1st and Pakistan was 10th in religious harmony or some shit and every indian rejected it. It started declining in 2018 > Where are we failing? According to the report, the drop between 2020 and 2021 is due to massive drop in life expectancy, so definitely covid effect. It was demonetisation. A lot of MSMEs went under. 2016 is when it flattens out. It's almost like 2020-21 was a global pandemic Well India is definitely a lot better in religious harmony compared to countries like Pakistan and Myanmar. Canada is at the top in global religious harmony India's ranking would be a lot better if these far right gangs are reigned in. Pakistan is also not very democratic since the army has significant influence on the government. Yeah but the decline started in 2018 I would believe a report where they've done their homework over random human beings. Of course they can make mistakes but I don't see how they'll favour Pakistan over India. It's not like Pakistan is important to those making the report or something. Surprisingly, sectarian violence is down in Pakistan as establishment is busy with PTI and Imran Khan so they don't have time for sectarian stuff. Also Saudi and Iran aren't funding the madarssah that give fiery speeches against each other. As for non Muslims, there aren't many left to kill or convert so you don't hear many news about it too. Ok is 22-23 data available? In India things are getting worse everyday The Modi government is in power. I think you mean religious intolerance ranking. Where India ranks 194. No The graph is based off data available till September 8th 2022. You do know that it was due to COVID right? Not entirely. You can see the decline in 2018 Also misleading poverty metrics, bjp government brought the threshold of poverty down. For example, if you keep doing that and bring it down to 0, then even by having 1 rupee to your name, you won't be poor. They brought down minimum food requirements used in definition of poverty, and probably don't include inflation in the metric which means not as many people might be lifted out of poverty Isn't that due to demonetization and shoddy implementation of GST? But now GST is alright but still confusing for a lot The drop is due to covid and decrease in life expectancy..china is irrelevant because they fudged covid deaths data…their official number is 120k deaths…studies suggest close to 2 million deaths during covid. Indias trend is inline with other countries. Yeah everyone is fake only vishwaguru is real. Amartya sen is an indian no? 🤔 I am talking about 2018 what happened there? Why is the graph stagnant at 2018 Yeah mostly I can see an increase till 2019 in the image u shared. The whole world trend is downwards Yes. But India started declining in 2018 before covid That blue trendline is China It's a long way down to ramraj. Yeah No one should take HDI data from such established institutions seriously. Over the time several “Indices”, have been developed by international organisations to measure economy & public welfare under a State. We, must remember that none of these are foolproof. The saying that “Rich becomes richer, & poor becomes poorer”, is the truth and basic norm, and there is no formula to make a correct assessment, and it is a truth be it USA or China; India is no exception. HDI, developed by UNDP, is a scale from 0 to 1, showing quality of life. The more value, the more enhanced quality of life! HDI depends on 3-factors, (a) Health (Measured by life expectancy), (b) Education Index, & (c) Income Index. The geometric mean of all 3 above is HDI, i.e HDI= ✓[(a)x(b)x(c)]^1/3. Now, India, with a rapidly growing population, death due to Dengu, ANI virus, TB, etc, has not been able to increase its average life expectancy, which is only about 70 years, against 85 in developed nations. Similarly, region wise education, particularly of poorer families is lacking. In fact, in villages, parents still do not send their wards to schools, rather prefer them to learn family business. And finally the Income index, which is Gross National Income per capita ( As told these do not reflect actual state of income). The PPP model based on purchase power (A scale of $100 -$75,000) is again an average, not distinguishing between poor & rich. India is at 0.633 in the index and India is at 0.123 in the Multi-Dimensional Poverty Index (MPI). Considering huge influx of refugees, uncontrolled births, it assumes a cognisable figure. Based on consistent indicators, methodology and time-series data, India's HDI values were 0.434 in 1990, 0.491 in 2000, 0.575 in 2010, 0.629 in 2015, 0.645 in 2018, 0.645 in 2019, 0.642 in 2020 and 0.633 in 2021. From 2020 HDI value of 0.642, India’s 2021 HDI value reached 0.633 (i.e., it changed by -0.009 points). From 2019 HDI value of 0.645, India’s 2020 HDI value arrived at 0.642 (i.e., it changed by -0.003 points). India’s HDI value for 2021 was 0.633. However, when the value is discounted for inequality, the HDI falls to 0.475, a loss of around 25.0 percent due to inequality in the distribution of the HDI dimension indices. Between 1990 and 2021, India’s HDI value increased from 0.434 to 0.633 (based on consistent indicators, methodology and time-series data) — an increase by 45.85 percent and this is quite significant. You mean purple? Yeah HDI for 75% of the poorest in India is way worse. This is because of COVID. Per capita income and years of schooling are improving. Life expectancy fell due to the pandemic. I mean the sudden rise in economic factors are also result of post covid activities,but BJP clowns do take alot of pride over that. Drop feels steeper to me, compared to world average Okay then explain the flat candle in 2018 It's their modus operandi, if any thing good happens in India, its all because of Supreme Leader. If anything bad happens, it happened either because of complicated global reasons, or global conspiracy to defame India or didn't even happened at all. Demonetisation For people screaming Covid, only the last two points are during Covid. Our human develop stagnated since 2014, since we became vishwaguru. Vishwagurus don’t need development, they need ego satisfaction through self appraisal & chest thumping. When I showed this to my roommate (we’re in US), he started spewing Soros & anti-national bullshit. If anything, if west hates India, it hates China even more. You’re not seeing stunted growth since 2014 in China, are you? Interesting...BJP Cell gonna call this international conspiracy.... I like the fact that they won't be able to explain why even after the nuke test in 1998 and a BJP Government under ABV which has fundamentally the same ideology has such a good record...1998 and 2002 are remarkable in this graph...just shows that this government shat the bed...COVID isn't the reason...the data before 2020 is already going negative.... HDI only includes per capita income, no of years of education and life expectancy. The first two metrics have been increasing constantly so it's apparently the life expectancy decreasing. I highly doubt that, and I would like to see the methodology used. Yeah but it does like it could have been more significant without masterstroke after masterstroke since 2014 Yeah exactly. HDi growth was completely flat in 2017- 2018 You can check it out at the source document Yeah we had BJP government before during this time period lead AB Vajpayee who will never approve this hate politics of Modi government. Basically the Modi-shah duo has complete centralised control because their electoral theopolitical machinery works and they promise leaders they will make them MP/MLA through Modi effect but that they have to do what they say. Anyone who doesn't listen to them is sidelined or bullied. I can see that and it's not surprising at all. With the GDP increasing while HDI decreasing it's quite evident that the Government is working with the sole objective of making the country an Oligarch state. Even Atal Bihari ruled during this time period and he didn't do that carnage to the economy with demonetisation and stuff the way Modi did. Ah, nehru at it again Momentum from pre-2014 leadership can only go so far yk…. Nehru died on 27 May 1964 Nehru still lives as a figment of Modi's imagination. It does not align with our government thesis, so it is untrue and an attempt to stigmatize the government's image. Where is the government thesis Like Atal Bihari We reject this report, wholeheartedly. This is a conspiracy by foreign media to ruin India's image as every developed country is jealous of how fast India is progressing. It's because half of that growth was intrinsic and was gonna happen irrespective of which party was in power not because of the BJP. It's not progressing as fast Our government is fudging data India’s life expectancy is 70 years ( not 76) While this is worrying, what people are missing is that these trends are there for many other countries as well. * Germany: [https://hdr.undp.org/data-center/specific-country-data#/countries/DEU](https://hdr.undp.org/data-center/specific-country-data#/countries/DEU) * Canada: [https://hdr.undp.org/data-center/specific-country-data#/countries/CAN](https://hdr.undp.org/data-center/specific-country-data#/countries/CAN) * Malaysia: [https://hdr.undp.org/data-center/specific-country-data#/countries/MYS](https://hdr.undp.org/data-center/specific-country-data#/countries/MYS) * Singapore: [https://hdr.undp.org/data-center/specific-country-data#/countries/SGP](https://hdr.undp.org/data-center/specific-country-data#/countries/SGP) Covid-19 really did a number on economies all over the world. That combined with climate change and worsened geopolitical situation aren't helping matters at all. Covid has played some role but Indian HDi was already declining before COVID. You can see the inversion starting from 2017- 2018. Why are you shamelessly lying like this? Did you forget the fact that Amartya Sen(Indian) also Co founded it. Again lying by saying the half truth to fulfil your agenda. Most public will still vote for Modi to remain in power in a few months, so everything seems alright. So what decreased? Education, life expectancy or income? Yeah and who was at fault for that shitty move/strategy, till now I've seen no politician taking responsibility But Mr Modi said give me 50 days time otherwise call me to any chowraha and I will come to face public and their punishments. NRI Indian moment I went to the link OP shared and checked other countries It seems to be a global trend rather than just being india specific You can check it out as well He's Bengali, so the worst In other countries the decline started in 2020. In India it started in 2017-18 way before COVID. Everything Let's see If you see the report the graph right next to it is comparing against world avg and they both mirror… this is a global phenomenon My left leg ran 10 kilometers and my right left also ran 10 kilometers. Ooh! I forgot. My hands. They also Congratulations you ran a marathon. Wow! All my friends outside of India are respecting me now. They never respected me before. Thanks Modi Ji! It's called fear not respect. Real income for sure, possibly education even if literacy may have increased. sudden fall Yeah sudden trend reversal from 2017-18 BJP and its members were happy sharing the same indices during the Modi's first term when the indices were still returning good numbers due to inertia from the previous UPA terms."
}