{
    "id": "1ebmc2w",
    "title": "2024 Budget & Digital Rights: Data Protection Board & IndiaAI Mission get fresh allocation; funds for long-established schemes see reductions | Internet Freedom Foundation",
    "url": "https://www.reddit.com/r/india/comments/1ebmc2w/2024_budget_digital_rights_data_protection_board/",
    "selftext": "https://preview.redd.it/kmbirrr7hled1.jpg?width=1600&format=pjpg&auto=webp&s=8a597e0357b77b646f52be192717d42b43559ddf\n\n# tl;dr\n\nThe Union Budget for 2024-2025 reveals an overall increase in funds allocation for MeitY, MHA, MIB, and DoT as compared to 2023-2024. The Budget allocated to MeitY has witnessed the highest increase among these ministries – 32.56% over last year's – yet-to-be-formed Data Protection Board and the IndiaAI Mission gets funding for the first time however, rural digital literacy scheme PMGDISHA gets no funding (for the second year in a row). Although DoT cut funding for USOF by \\~80% as compared to 2023-2024 Budget, it increased funding for BharatNet by 70%. While the overall increase in budgetary allocations compared to last year may paint a positive picture, on deeper analysis we realise that the decline in fund allocation towards long-established schemes and projects as well as underutilisation of funds continue to be unaddressed issues and thus a cause of contention.\n\n# Important documents\n\n1. IFF’s post on Union Budget for 2023-2024 ([~Link~](https://internetfreedom.in/budget-2023-2024/?ref=static.internetfreedom.in))\n2. IFF’s posts on the Interim Union Budget for 2024-2025 ([~Link~](https://internetfreedom.in/tag/budget-2024/?ref=static.internetfreedom.in))\n3. Consolidated budgetary data for selected items ([~Link~](https://docs.google.com/spreadsheets/d/1kHychfaB3VoidvMVLGICMCRwn_45KVBKK7JNYEqK_fE/edit?gid=1091729720&ref=static.internetfreedom.in#gid=1091729720))\n\n# Introduction\n\nIn the final session of the 17th LS term, Union Finance Minister, Shrimati Nirmala Sitharaman, presented the Union Interim Budget for the Financial Year (“**FY**”) 2024-2025. In the ongoing Monsoon Session, the Union Finance Minister placed a new Budget for the FY2024-2024 in both houses on July 23, 2024. The Budgeted Estimates (“**BE**”) for the Ministry of Electronics and Information Technology (“**MeitY**”), Ministry of Home Affairs (“**MHA**”), Ministry of Information and Broadcasting (“**MIB**”), and Department of Telecommunications (“**DoT**”) witnessed an overall increase of 15.98% in the 2024-25 Union Budget compared to 2023-2024 BE. \n\nThe budget allocated to MeitY has witnessed the highest increase (32.56%) among these Ministries in comparison to the previous Budget (2023-2024) and DoT witnessed the second highest (14.7%). The Budget for MHA and MIB got a 9.44% and 7.45% increase respectively. The increase in the BE for this fiscal year from the Revised Estimates (“**RE**”) of the previous year was also the highest for MeitY (52.11%). While DoT and MHA saw an increase of 13.79% and 9.44% respectively, MIB witnessed a decrease of 2.41% since the RE of 2023-2024.\n\n||\n||\n||**2019-2020**|**2020-2021**|**2021-2022**|**2022-2023**|**BE 2023-24**|**RE 2023-24**|**BE 2024-25**|\n|**MeitY**|5651.97|5523.2|8256.27|9220.28|16549.04|14421.25|21936.9|\n|**MIB**|4028.82|3380.44|3728.99|4024.13|4692.00|4449.76|4342.55|\n|**DoT**|28395.43|53510.82|43169.58|122509.06|97579.05|98359.41\t|111915.43|\n|**MHA**|16936.83|3860.68|4365.67|4287.64|5901.31|5120.78|6458.24|\n|**Total**|**55013.05**|**66275.14**|**59520.51**|**140041.11**|**124721.4**|**122351.2**|**144653.1**|\n\nTable 1: Total Expenditure for MeitY, MIB, DoT, and MHA (In Rs. Crores)\n\n\n\nDigital Public Infrastructure (“**DPI**”) was an area of focus for the government during the presentation of the Union Budget including the varying schemes aimed at farmers with the digital crop survey, agri-stack, and also the service sector with a proposal for the development of more DPI apps for businesses. However, it appears that DPI(s) found limited specific budgetary allocation even after being a point of focus in the Economic Survey released a day before the Budget 2024-25. DPIs have been attributed for the rise in technological engagement of Indian citizens with more Ministries introducing population-scale interactive technological platforms which are being clubbed under the common banner of DPI. We will soon release a detailed analysis of the Economic Survey 2023-2024 and the over-reliance on technology-centred tools such as AI and DPI within it.\n\n# The Ministry of Electronics and Information Technology\n\nThe total budgetary allocation for MeitY in the Budget for 2024-2025 is ₹21936.9 Cr, which is a 32.57% increase from the previous financial year’s Budget (BE 2023-2024). The increase is even higher when compared to the RE of 2023-2024, i.e., a year-on-year change of 52.11%. This is in contrast to the budgetary trends we witnessed in 2021, 2022 and 2023, where there was underutilisation of the budget. We appreciate the large overall increase in budgetary allocation to MeitY in FY 2024-2025 and hope to see these funds be directed towards infrastructure development aimed at increasing telecom and broadband connectivity, research and deep deliberation into emerging technologies, strengthening of citizen-centric fora and systems, and closing the digital divide.\n\n||\n||\n|**Item (Rs. cr)**|**Actual 2022-23**|**Budget 2023-24**|**Revised 2023-24**|**Budget 2024-25**|\n|**Establishment Expenditure of the Centre**|||||\n|Cyber Security (CERT-In)|176.49|225|208|238|\n|Data Protection Board|0|0|0|2|\n|**Total-Establishment Expenditure**|1815.9|2040.76|2074.5|2352.64|\n|**Central Sector Schemes/Projects**|||||\n|DIGITAL INDIA Program|5518.1|4795.2|4428|4216.51|\n|Pradhan Mantri Gramin Digital Saksharta Abhiyan (PMGDISHA)|250|0|0|0|\n|PLI for Large Scale Electronics and IT Hardware|1654.96|0|0|0|\n|Cyber Security Projects|30.11|400|400|759|\n|Promotion of Digital payment|1989.6|1500|584|0|\n|IndiaAI Mission|0|0|0|551.75|\n|**Total - Central Sector Schemes/ Projects**|5531.09|12440.28|12440.28|17871.26|\n|**Other Central Sector Expenditure**|||||\n|Centre for Development of Advanced Computing (C-DAC)|250|270|270|270|\n|Unique Identification Authority of India (UIDAI)|1219.7|940|800|600|\n|Society for Applied Microwave Electronics Engineering and Research (SAMEER)|131.39|160|150|160|\n|**Total- Autonomous Bodies**|1867.21|2057|1842.5|1700|\n|**Total - Other Central Sector Expenditure**|852.3|2068|1855.5|1713|\n|**Grand Total**|**8199.3**|**16549**|**14421.3**|**21936.9**|\n\nTable 2: Budgetary allocations for specific items for MeitY\n\nThe most notable change in the Budget for 2024-2025, which has direct implications for digital rights, has to be the allocation of ₹2 Cr for the Data Protection Board (“**DPB**”). After a long and arduous journey for data protection legislation, it is disappointing to see funding of a mere ₹2 Cr for a regulatory body whose functioning will have a direct impact on the implementation of the Digital Personal Data Protection Act (“**DPDPA**”), 2023, successful or otherwise. Of this ₹2 crore, only ₹4 lahks is [~reportedly~](https://www.hindustantimes.com/india-news/union-budget-2024-25-health-ministry-allocated-rs-90-958-crore-full-details-101721738915694.html?ref=static.internetfreedom.in) allocated for capital expenditure, which includes fixed assets such as the digital portal, and the rest (₹ 1.96 Cr) is allocated for revenue expenditure (salaries, etc). Since it is unclear when the DPB will become functional, it is difficult to ascertain whether the allocated budget is meant to  be utilised for the entire financial year or a part of it. Either way, a minuscule amount of ₹4 lakhs for capital expenditure on DPB may prove to be insufficient for upskilling and training of the DPB members. In the following Budgets, we hope MeitY ensures that it is adequately resourced for the institutional preparation of the DPB. Adequate funding for key regulatory bodies such as the DPB will contribute to its independent functioning which is necessary to keep checks and balances on the executive. \n\nAllocation towards a prominent regulatory body essential for the cybersecurity health of the country, the Indian Computer Emergency Response Team (“**CERT-In**”) also increased by 5.78% from the previous year’s Budget. On another positive note, funding allocated to ‘Cyber Security Projects’ has seen a massive increase of 89.75% since last year. This substantial increase in allocation was much needed in the backdrop of increasing incidents of data breaches and vulnerabilities and the absence of an operational, robust, and rights-advancing data protection legislation. [~Recent~](https://internetfreedom.in/cybersecurity-report-for-q2-2024/?ref=static.internetfreedom.in) grave cybersecurity incidents, like the Tamil Nadu Police Facial Recognition Portal breach and the Telangana Police Network data leak, have raised concerns about the detection and response capabilities of India’s cybersecurity authorities. It is worth noting that MeitY utilised only ₹30.11 Cr out of the allocated ₹300 Cr in 2022-2023, despite persisting challenges of insufficient resources, outdated infrastructure, and a shortage of skilled professionals. We hope that the same trend of under-utilisation is not followed by the Ministry this fiscal year and ahead.\n\nAnother introduction this year was the addition of ‘IndiaAI Mission’ as a Central Sector Scheme, with a notable allocation of ₹551.75 Cr. This is on top of the infusion of ₹10,371.92 Cr [~approved~](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2012355&ref=static.internetfreedom.in) by the previous National Democratic Alliance (“**NDA**”) cabinet in March 2024 which is to be disbursed over a period of five years to establish the scheme including its Compute Capacity program. The program [~aims~](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2012355&ref=static.internetfreedom.in) to establish a 10,000 Graphics Processing Unit infrastructure to be built with public-private partnerships. The working group appointed by the government on IndiaAI in its October 2023 [~report~](https://www.meity.gov.in/writereaddata/files/IndiaAI-Expert-Group-Report-First-Edition.pdf?ref=static.internetfreedom.in) had recommended at least 24,500 Graphics Processing Units for infrastructural requirements. Moreover, the increased focus on AI and massive budgetary allowances form cause for concern owing to the massive effects of the technology on the climate – with a single ChatGPT search taking 10 times as much energy as a regular Google search, according to the [~Economic Survey 2023-24~](https://www.indiabudget.gov.in/economicsurvey/index.php?ref=static.internetfreedom.in). The Survey cautioned against Artificial Intelligence’s impact not only on climate but also on employment opportunities amidst rising automation in industries making employees redundant. With increasing trends of techno-solutionism plaguing governance in India, increased budgetary focus on bolstering AI capabilities may result in more unnecessary technological interventions – but now with AI.\n\nDisappointingly, the Budget for 2023-2024 and the Interim Budget for 2024-2025 for MeitY did not allocate any funds to Pradhan Mantri Gramin Digital Saksharta Abhiyan (“**PMGDISHA**”), breaking the trend of continuous budgetary support for the rural digital literacy scheme since its inception in 2017. PMGDISHA was key to increased connectivity, telecom penetration, and digital literacy across India. Allocations to the scheme touched an all-time low in 2022 since 2017, and then last year in the FY 2023-24 budget, no funds were allocated towards it. The last impact assessment study of PMGDISHA was carried out by the Indian Institute of Public Administration in 2020-21. The report [~concluded~](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=1843061&ref=static.internetfreedom.in) that the scheme, as a digital literacy programme, “*plays an indispensable part in not only bridging the digital gap in the country but also transforming it into a knowledge economy and society*.” The allocations made to this scheme must increase, and more importantly exist, to ensure its effective progress and robust digital literacy in the country.   \n\n\nhttps://preview.redd.it/5t84souchled1.png?width=1022&format=png&auto=webp&s=2a2993a978cb28fe40f0b6dbef21f14229d23422\n\nFigure 1: Budget Allocation to PMGDISHA (MeitY)\n\nThe other interesting trend is the complete discontinuation of budgetary allocation towards ‘Promotion of Digital Payments’ under MeitY’s budget for this year. Last year, we noted that the allocation to this domain plummeted to ₹1500 Cr as compared to ₹2137 Cr allocated to it in the 2022-2023 RE, reflecting a decline of 29.8%. In the RE of 2023-2024, the allocation was further reduced to ₹584 Cr and finally to 0 in the Budget for 2024-2025. It is also interesting to note that revised allocations increased sharply in 2022-2023 (₹2137 Cr), witnessing a jump of 968.5% as compared to the 2022-2023 BE which stood at ₹200 crores. Even though the allocation in 2023-2024 is higher than the 2022 BE, it stood lower than the RE. \n\nhttps://preview.redd.it/ybiiuvbehled1.png?width=1200&format=png&auto=webp&s=01176f7ed7571b9e35b7c3e17cf81973bfa19e95\n\n  \nFigure 2: Budgetary Allocation to ‘Promotion of Digital Payments’ (MeitY)\n\nMeitY has introduced an item titled ‘Promotion of Digital Transactions (excluding Digital Payments)’ under the DIGITAL INDIA Program, for which it has allocated ₹1.5 Cr. As per MeitY, the objective of this scheme is to promote overall digitisation for the efficient delivery of citizen-centric services and empowerment of citizens. Through this newly introduced item, MeitY hopes to grow the volume of digital transactions in the country. It also believes that this expenditure may have a cascading effect on the promotion of digital payments scheme including estimating and measuring digital economy of India, suggesting a measurement framework for such estimation, and providing suitable policy recommendations for boosting the size and growth of the digital economy in India by leveraging the digital technologies. Interestingly, despite this new addition, the total expenditure towards the DIGITAL INDIA Program has reduced significantly and consistently since the BE for 2022-2023.\n\nhttps://preview.redd.it/rf6zq1mfhled1.png?width=830&format=png&auto=webp&s=7a3c38c34794b9e1251ad96dc2b24efcaa105278\n\nFigure 3: Share of the Digital India Programme in the Total Budgetary Allocation (MeitY)\n\n# The Ministry of Home Affairs\n\nThe total budgetary allocation for MHA is 9.44% higher than what was allocated in the BE for 2023-24 and 9.44% higher than the 2023-2024 revised Budget. The allocation in the budget estimates, net of receipts and recoveries, for MHA is ₹6458.24 Cr. The allocation for planned capital expenditure has marginally dipped as compared to both 2023-2024 BE (by 10.16%) and RE (by 29.39%), which is disappointing.   \n\n\n||\n||\n|**Item (Rs. cr)**|**Actual 2022-2023**|**Budget 2023-2024**|**Revised 2023-2024**|**Budget 2024-2025**|\n|**Total- Establishment Expenditure of the Centre**|2111.7|2491.53|2622.86|2456.5|\n|**Central Sector Schemes/Projects**|||||\n|Helicopter Services|105.61|126|103|115|\n|Disaster Management|186.61|393.65|326.41|288.63|\n|**Total - Central Sector Schemes/Projects**|1330.5|1504.34|1667.58|1709.41|\n|**Total- Other Central Sector Expenditure**|623.82|1728.13|761.75|1613.45|\n|**Total- Other Grants/ Loans/ Transfers**|70.6|67.31|66.3|668.01|\n|**Grand Total**|**4235.69**|**5901.31**|**5120.78**|**6458.24**|\n\nTable 3: Budgetary allocations for specific items for MHA\n\nAdditionally, we notice an interesting trend in allocations to the item ‘Census, Survey and Statistics/ Registrar General of India’. For the past few years, the estimated budget for surveys and census has been large, but the actual utilisation remains minuscule. The biggest dip was seen in 2022-23, where the budget allocated was ₹3676 Cr, but only ₹513.18 Cr was utilised. For BE 2024-25, the allocation remains large, but it is likely to fall into the same pattern of remaining underutilised  \n\n\nhttps://preview.redd.it/9k7es0glhled1.png?width=1128&format=png&auto=webp&s=ee095f22bd9450b54e675010741be0f25e8204a2\n\nFigure 4: Budgetary Allocation to Census, Survey and Statistics/Registrar General of India (MHA)\n\nOn a disappointing note, MHA did not allocate any funds towards its [~Cyber and Information Security~](https://www.mha.gov.in/en/divisionofmha/cyber-and-information-security-cis-division?ref=static.internetfreedom.in) (“**C&IS**”) Division, which includes key schemes such as the Cybercrime Prevention against Women and Children Scheme and the Indian Cybercrime Coordination Centre (“**I4C**”) Scheme. [~Reportedly~](https://theprint.in/economy/budget-2024-mha-gets-rs-2-19-lakh-crore-focus-on-training-and-research-big-boost-for-ib-cisf/2187805/?ref=static.internetfreedom.in), I4C didn’t get fresh funding this year because it “*ceased to exist as a Union government scheme starting 1 July and began working as part of the MHA*”. Interestingly, other Divisions of the MHA such as the Freedom Fighters and Rehabilitation Division and the Police Division still got funding allocated to them. From a reading of the Budget, it is unclear under which item, if at all, is MHA allocating funds for cyber security and awareness efforts. Earlier this year, I4C was [~notified~](https://economictimes.indiatimes.com/news/india/govt-designates-i4c-as-agency-of-mha-to-notify-unlawful-activities-in-cyber-world/articleshow/108501675.cms?from=mdr&ref=static.internetfreedom.in) as the official agency by MHA to notify law enforcement authorities, under the Information Technology Act, 2000, about unlawful activities in the cyberspace. Additionally, funding for a special wing of \"cyber commandos\", reportedly an MHA project meant to tackle cyber threats along with local administration, is also missing from this year’s Budget for MHA, despite [~expectations~](https://www.business-standard.com/budget/news/budget-special-unit-of-cyber-commandos-on-home-ministry-s-100-day-agenda-124062100754_1.html?ref=static.internetfreedom.in).\n\n# The Ministry of Information and Broadcasting\n\nThe total budgetary allocation for MIB in 2024-25 is ₹4342.55 Cr, which is a 7.45% decrease from the 2023-2024 Budget and a 2.41% decrease from the 2023-2024 Revised Budget. This cut comes after MIB seemingly was able to utilise a higher budget allocation last year, which seems incongruent. Interestingly, the total budgetary allocation for FY 2024-2025 is the same as the allocation under the Interim Budget for 2024-2025, a trend uncommon for several other Ministries.   \n\n\n||\n||\n|**Item (Rs. crore)**|**Actual 2022-23**|**Budget 2023-24**|**Revised 2023-24**|**Budget 2024-25**|\n|**Total- Establishment Expenditure**|566.73|535.5|551|566.41|\n|**Total-Central Sector Schemes/ Projects**|596.66|1105|1027.28|1004.31|\n|**Total- Support to Autonomous Bodies**|2875.57|3031.12|2848.1|2748.83|\n|**Grand Total**|**4020.18**|**4692**|**4449.76**|**4342.55**|\n\nTable 4: Budgetary allocations for specific items for MHA\n\nMIB’s total AE since 2014-2015 has been relatively stable, as compared to the AE of MeitY, MHA, and DoT. Notably, DoT has introduced funding for the establishment of the ‘Bhartiya Bhasha Anubhag’ scheme, which is a platform meant to facilitate the translation of various languages into Hindi and vice versa. \n\n# The Department of Telecommunications\n\nIn 2024-25, DoT (which operates under the Ministry of Communications) has been allocated ₹111915.43 Cr, which is a 14.69% increase over the budget allocated in 2023-24 (₹97579.05 Cr) and 13.78% over the RE for 2023-24 (₹98359.41 Cr). \n\n||\n||\n|**Item (Rs. cr)**|**Actual 2022-23**|**Budget 2023-24**|**Revised 2023-24**|**Budget 2024-25**|\n|**Total - Establishment Expenditure of the Centre**|16601.82|22042.91|18462.35|18656.22|\n|**Regulatory Bodies**|||||\n|Telecom Regulatory Authority of India General Fund|232.78|214.35|311.9|110|\n|Telecom Disputes Settlement and Appellate Tribunal (TDSAT)|17.02|24.18|26.18|23.7|\n|Artificial Intelligence and Face Recognition Powered Solution for Telecom SIM Subscriber Verification (ASTR)|0|0.5|0|0|\n|**Total- Regulatory Bodies**|249.8|238.53|338.08|133.7|\n|**Central Sector Schemes/Projects**|||||\n|**Universal Service Obligation Fund**|||||\n|Transfer to Universal Service Obligation (USO) Fund|53500|10400|2000|2000|\n|Compensation to Telecom Service Providers|2000|5000|10600|10100|\n|Bharatnet|1500|5000|5000|8500|\n|R&D (Revenue)|0|400|100|400|\n|Amount met from Universal Service Obligation (USO) Fund|-3500|-10400|-15700|-19000|\n|**Total - Defence Spectrum**|1367.66|2158|2158|0|\n|**DoT Projects**|||||\n|Promotion of Innovation and Incubation of Future Technologies for Telecom Sector|55|0|0|0|\n|Digital Intelligence Unit Project|0|220|50|85|\n|Prevention of Spoofed Incoming International Calls System 'CIOR'|0|0|0|38.76|\n|**Total - DoT Projects**|315.55|2285.32|926.53|2353.19|\n|**Total- Central Sector Schemes/Projects**|55183.21|14843.32|6678.27|4353.19|\n|**Total - Other Central Sector Expenditure**|47175.51|60692.82|73218.79|88906.02|\n|**Grand Total**|**118960.54**|**97579.05**|**98359.41**|**111915.43**|\n\nTable 4: Budgetary allocations for specific items for DoT\n\nSurprisingly, the Universal Services Obligation Fund (“USOF”) took a hit in funds with only ₹2000 Cr allocated to it in the 2024-25 Budget (same as last year’s RE), an 80.77% fall from last year’s ₹10400 Cr. Telecom services providers have [~persistently~](https://www.business-standard.com/budget/news/budget-wish-list-telecom-industry-calls-for-junking-usof-slashing-duties-124011800938_1.html?ref=static.internetfreedom.in) urged the Ministry of Finance to suspend USOF till the existing corpus is exhausted, and in their Budget requests for 2024-25, pressed for an exemption from the service tax on “assignment of right to use natural resources” and the slashing of customs duty on telecom equipment to zero. Allocation to ‘Compensation to Telecom Service Providers’ saw a 102% increase in the 2024-2025 Budget (₹10100 Cr) as compared to the 2023-2024 budget (₹5000 Cr). This item is meant to provide for the “*creation and augmentation of telecom infrastructure and access to various telecom services to people in the rural and remote areas including operation and maintenance of Village Public Telephones*.”\n\nAs far as allocations for BharatNet are concerned, there has been a significant increase of 70% in BE 2024-25 (₹8500 Cr) from BE 2023-24 (₹5000 Cr). The grant goes towards the creation of telecom infrastructure required for providing broadband connectivity to all the Gram Panchayats in the country and facilitating non-discriminatory access to service providers, for provisioning of broadband services in rural areas. The sharp increase in budget is appreciated.\n\nTotal budgetary allocation for regulatory bodies such as the Telecom Regulatory Authority of India (“**TRAI**”) and Telecom Disputes Settlement and Appellate Tribunal has seen a significant dip this year (₹113 Cr) as compared to the previous year (₹238.53 Cr). The funding for TRAI has reduced by 48.68% over the past year, even though DoT utilised the entire revised amount allocated in 2022-2023 for the regulatory body, which was more than the BE for 2022-2023.\n\nAlthough DoT allocated ₹50,00,000 towards ‘Artificial Intelligence and Face Recognition Powered Solution for Telecom SIM Subscriber Verification (ASTR)’ in the 2023-2024 Budget, it has not allocated any funding in the 2024-2025 Budget. Funding for the Digital Intelligence Unit Project, which is meant to investigate fraudulent activity involving telecom resources, such as Unsolicited Commercial Communication, witnessed a drastic reduction of 61.36% in the 2024-2025 Budget (₹85 Cr) as compared to the previous Budget (₹220 Cr). DoT has also allocated ₹38.76 Cr for the first time for the ‘Prevention of Spoofed Incoming International Calls System – 'CIOR' (Centralized International Out Roamer)’.\n\n# Conclusion\n\nThe 2024-25 Budget leaves us with a variety of feelings, some of hope and some of disappointment. While there are some budgetary allocations made for the first time, like the DPB, IndiaAi Mission, and ‘Promotion of Digital Transactions’, long-established budgetary items such as the ‘Promotion of Digital Payments’, PMGDISHA, the Census, I4C, and the USOF either witnessed a complete discontinuation of funds or took a significant hit in the allocated funds. Overall funding towards the DPB includes planned capital expenditure of only ₹4 lakhs which is inadequate to say the least. An additional cause for concern is the decrease in the AE as compared to the RE, and in the RE as compared to the BE, for the last few years. The RE indicates how much is possible for the government to extend to the concerned sector and the AE indicates how much was extended. While some variation among the three is inevitable, too much of a difference can [~reduce~](https://www.indiaspend.com/budget/be-re-or-actuals-what-do-you-need-to-look-at-in-the-upcoming-budget-800937?ref=static.internetfreedom.in) the credibility of the numbers and cause uncertainty. Cuts in and underutilisation of the RE may also negatively affect the implementation of government schemes and projects. In light of the increasing digitisation across sectors and the increasing demand for improved digital literacy as well as access to digital services, we hope that the fund allocation in these concerned sectors continues to witness a positive trend. Although we appreciate the overall increase in BE this year as compared to last year, we hope to see these funds be utilised efficiently and directed towards infrastructure development aimed at increasing tele-connectivity, broadband connectivity, cybersecurity, and overall digital literacy.\n\n  \n",
    "flair": "Policy/Economy",
    "score": 4,
    "num_comments": 0,
    "created_utc": 1721882873.0,
    "convurl": "https://external-preview.redd.it/WKKrMYVqcqE_0DvNgl5wTq2_VCYwg563PyBcihHMj2o.jpg?auto=webp&s=63d14d4d794e8c4db26b2301190371c5d51e4c59",
    "comments": [],
    "cleaned_text": "budget digital rights data protection board indiaai mission get fresh allocation funds longestablished schemes see reductions internet freedom foundation tldr union budget reveals overall increase funds allocation meity mha mib dot compared budget allocated meity witnessed highest increase among ministries last years yettobeformed data protection board indiaai mission gets funding first time however rural digital literacy scheme pmgdisha gets funding second year row although dot cut funding usof compared budget increased funding bharatnet overall increase budgetary allocations compared last year may paint positive picture deeper analysis realise decline fund allocation towards longestablished schemes projects well underutilisation funds continue unaddressed issues thus cause contention important documents iffs post union budget linkhttpsinternetfreedominbudgetrefstaticinternetfreedomin iffs posts interim union budget linkhttpsinternetfreedomintagbudgetrefstaticinternetfreedomin consolidated budgetary data selected items linkhttpsdocsgooglecomspreadsheetsdkhychfabvoidvmvlgicmcrwnkvbkkjnyeqkfeeditgidrefstaticinternetfreedomingid introduction final session th ls term union finance minister shrimati nirmala sitharaman presented union interim budget financial year fy ongoing monsoon session union finance minister placed new budget fy houses july budgeted estimates ministry electronics information technology meity ministry home affairs mha ministry information broadcasting mib department telecommunications dot witnessed overall increase union budget compared budget allocated meity witnessed highest increase among ministries comparison previous budget dot witnessed second highest budget mha mib got increase respectively increase fiscal year revised estimates previous year also highest meity dot mha saw increase respectively mib witnessed decrease since meity mib dot mha total table total expenditure meity mib dot mha rs crores digital public infrastructure dpi area focus government presentation union budget including varying schemes aimed farmers digital crop survey agristack also service sector proposal development dpi apps businesses however appears dpis found limited specific budgetary allocation even point focus economic survey released day budget dpis attributed rise technological engagement indian citizens ministries introducing populationscale interactive technological platforms clubbed common banner dpi soon release detailed analysis economic survey overreliance technologycentred tools ai dpi within ministry electronics information technology total budgetary allocation meity budget cr increase previous financial years budget increase even higher compared ie yearonyear change contrast budgetary trends witnessed underutilisation budget appreciate large overall increase budgetary allocation meity fy hope see funds directed towards infrastructure development aimed increasing telecom broadband connectivity research deep deliberation emerging technologies strengthening citizencentric fora systems closing digital divide item rs cractual budget revised budget establishment expenditure centre cyber security certin data protection board totalestablishment expenditure central sector schemesprojects digital india program pradhan mantri gramin digital saksharta abhiyan pmgdisha pli large scale electronics hardware cyber security projects promotion digital payment indiaai mission total central sector schemes projects central sector expenditure centre development advanced computing cdac unique identification authority india uidai society applied microwave electronics engineering research sameer total autonomous bodies total central sector expenditure grand total table budgetary allocations specific items meity notable change budget direct implications digital rights allocation cr data protection board dpb long arduous journey data protection legislation disappointing see funding mere cr regulatory body whose functioning direct impact implementation digital personal data protection act dpdpa successful otherwise crore lahks reportedlyhttpswwwhindustantimescomindianewsunionbudgethealthministryallocatedrscrorefulldetailshtmlrefstaticinternetfreedomin allocated capital expenditure includes fixed assets digital portal rest cr allocated revenue expenditure salaries etc since unclear dpb become functional difficult ascertain whether allocated budget meant utilised entire financial year part either way minuscule amount lakhs capital expenditure dpb may prove insufficient upskilling training dpb members following budgets hope meity ensures adequately resourced institutional preparation dpb adequate funding key regulatory bodies dpb contribute independent functioning necessary keep checks balances executive allocation towards prominent regulatory body essential cybersecurity health country indian computer emergency response team certin also increased previous years budget another positive note funding allocated cyber security projects seen massive increase since last year substantial increase allocation much needed backdrop increasing incidents data breaches vulnerabilities absence operational robust rightsadvancing data protection legislation recenthttpsinternetfreedomincybersecurityreportforqrefstaticinternetfreedomin grave cybersecurity incidents like tamil nadu police facial recognition portal breach telangana police network data leak raised concerns detection response capabilities indias cybersecurity authorities worth noting meity utilised cr allocated cr despite persisting challenges insufficient resources outdated infrastructure shortage skilled professionals hope trend underutilisation followed ministry fiscal year ahead another introduction year addition indiaai mission central sector scheme notable allocation cr top infusion cr approvedhttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomin previous national democratic alliance nda cabinet march disbursed period five years establish scheme including compute capacity program program aimshttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomin establish graphics processing unit infrastructure built publicprivate partnerships working group appointed government indiaai october reporthttpswwwmeitygovinwritereaddatafilesindiaaiexpertgroupreportfirsteditionpdfrefstaticinternetfreedomin recommended least graphics processing units infrastructural requirements moreover increased focus ai massive budgetary allowances form cause concern owing massive effects technology climate single chatgpt search taking times much energy regular google search according economic survey httpswwwindiabudgetgovineconomicsurveyindexphprefstaticinternetfreedomin survey cautioned artificial intelligences impact climate also employment opportunities amidst rising automation industries making employees redundant increasing trends technosolutionism plaguing governance india increased budgetary focus bolstering ai capabilities may result unnecessary technological interventions ai disappointingly budget interim budget meity allocate funds pradhan mantri gramin digital saksharta abhiyan pmgdisha breaking trend continuous budgetary support rural digital literacy scheme since inception pmgdisha key increased connectivity telecom penetration digital literacy across india allocations scheme touched alltime low since last year fy budget funds allocated towards last impact assessment study pmgdisha carried indian institute public administration report concludedhttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomin scheme digital literacy programme plays indispensable part bridging digital gap country also transforming knowledge economy society allocations made scheme must increase importantly exist ensure effective progress robust digital literacy country figure budget allocation pmgdisha meity interesting trend complete discontinuation budgetary allocation towards promotion digital payments meitys budget year last year noted allocation domain plummeted cr compared cr allocated reflecting decline allocation reduced cr finally budget also interesting note revised allocations increased sharply cr witnessing jump compared stood crores even though allocation higher stood lower figure budgetary allocation promotion digital payments meity meity introduced item titled promotion digital transactions excluding digital payments digital india program allocated cr per meity objective scheme promote overall digitisation efficient delivery citizencentric services empowerment citizens newly introduced item meity hopes grow volume digital transactions country also believes expenditure may cascading effect promotion digital payments scheme including estimating measuring digital economy india suggesting measurement framework estimation providing suitable policy recommendations boosting size growth digital economy india leveraging digital technologies interestingly despite new addition total expenditure towards digital india program reduced significantly consistently since figure share digital india programme total budgetary allocation meity ministry home affairs total budgetary allocation mha higher allocated higher revised budget allocation budget estimates net receipts recoveries mha cr allocation planned capital expenditure marginally dipped compared disappointing item rs cractual budget revised budget total establishment expenditure centre central sector schemesprojects helicopter services disaster management total central sector schemesprojects total central sector expenditure total grants loans transfers grand total table budgetary allocations specific items mha additionally notice interesting trend allocations item census survey statistics registrar general india past years estimated budget surveys census large actual utilisation remains minuscule biggest dip seen budget allocated cr cr utilised allocation remains large likely fall pattern remaining underutilised figure budgetary allocation census survey statisticsregistrar general india mha disappointing note mha allocate funds towards cyber information securityhttpswwwmhagovinendivisionofmhacyberandinformationsecuritycisdivisionrefstaticinternetfreedomin cis division includes key schemes cybercrime prevention women children scheme indian cybercrime coordination centre ic scheme reportedlyhttpstheprintineconomybudgetmhagetsrslakhcrorefocusontrainingandresearchbigboostforibcisfrefstaticinternetfreedomin ic didnt get fresh funding year ceased exist union government scheme starting july began working part mha interestingly divisions mha freedom fighters rehabilitation division police division still got funding allocated reading budget unclear item mha allocating funds cyber security awareness efforts earlier year ic notifiedhttpseconomictimesindiatimescomnewsindiagovtdesignatesicasagencyofmhatonotifyunlawfulactivitiesincyberworldarticleshowcmsfrommdrrefstaticinternetfreedomin official agency mha notify law enforcement authorities information technology act unlawful activities cyberspace additionally funding special wing cyber commandos reportedly mha project meant tackle cyber threats along local administration also missing years budget mha despite expectationshttpswwwbusinessstandardcombudgetnewsbudgetspecialunitofcybercommandosonhomeministrysdayagendahtmlrefstaticinternetfreedomin ministry information broadcasting total budgetary allocation mib cr decrease budget decrease revised budget cut comes mib seemingly able utilise higher budget allocation last year seems incongruent interestingly total budgetary allocation fy allocation interim budget trend uncommon several ministries item rs croreactual budget revised budget total establishment expenditure totalcentral sector schemes projects total support autonomous bodies grand total table budgetary allocations specific items mha mibs total ae since relatively stable compared ae meity mha dot notably dot introduced funding establishment bhartiya bhasha anubhag scheme platform meant facilitate translation various languages hindi vice versa department telecommunications dot operates ministry communications allocated cr increase budget allocated cr cr item rs cractual budget revised budget total establishment expenditure centre regulatory bodies telecom regulatory authority india general fund telecom disputes settlement appellate tribunal tdsat artificial intelligence face recognition powered solution telecom sim subscriber verification astr total regulatory bodies central sector schemesprojects universal service obligation fund transfer universal service obligation uso fund compensation telecom service providers bharatnet rd revenue amount met universal service obligation uso fund total defence spectrum dot projects promotion innovation incubation future technologies telecom sector digital intelligence unit project prevention spoofed incoming international calls system cior total dot projects total central sector schemesprojects total central sector expenditure grand total table budgetary allocations specific items dot surprisingly universal services obligation fund usof took hit funds cr allocated budget last years fall last years cr telecom services providers persistentlyhttpswwwbusinessstandardcombudgetnewsbudgetwishlisttelecomindustrycallsforjunkingusofslashingdutieshtmlrefstaticinternetfreedomin urged ministry finance suspend usof till existing corpus exhausted budget requests pressed exemption service tax assignment right use natural resources slashing customs duty telecom equipment zero allocation compensation telecom service providers saw increase budget cr compared budget cr item meant provide creation augmentation telecom infrastructure access various telecom services people rural remote areas including operation maintenance village public telephones far allocations bharatnet concerned significant increase cr cr grant goes towards creation telecom infrastructure required providing broadband connectivity gram panchayats country facilitating nondiscriminatory access service providers provisioning broadband services rural areas sharp increase budget appreciated total budgetary allocation regulatory bodies telecom regulatory authority india trai telecom disputes settlement appellate tribunal seen significant dip year cr compared previous year cr funding trai reduced past year even though dot utilised entire revised amount allocated regulatory body although dot allocated towards artificial intelligence face recognition powered solution telecom sim subscriber verification astr budget allocated funding budget funding digital intelligence unit project meant investigate fraudulent activity involving telecom resources unsolicited commercial communication witnessed drastic reduction budget cr compared previous budget cr dot also allocated cr first time prevention spoofed incoming international calls system cior centralized international roamer conclusion budget leaves us variety feelings hope disappointment budgetary allocations made first time like dpb indiaai mission promotion digital transactions longestablished budgetary items promotion digital payments pmgdisha census ic usof either witnessed complete discontinuation funds took significant hit allocated funds overall funding towards dpb includes planned capital expenditure lakhs inadequate say least additional cause concern decrease ae compared compared last years indicates much possible government extend concerned sector ae indicates much extended variation among three inevitable much difference reducehttpswwwindiaspendcombudgetbereoractualswhatdoyouneedtolookatintheupcomingbudgetrefstaticinternetfreedomin credibility numbers cause uncertainty cuts underutilisation may also negatively affect implementation government schemes projects light increasing digitisation across sectors increasing demand improved digital literacy well access digital services hope fund allocation concerned sectors continues witness positive trend although appreciate overall increase year compared last year hope see funds utilised efficiently directed towards infrastructure development aimed increasing teleconnectivity broadband connectivity cybersecurity overall digital literacy ",
    "cleaned_title": "budget digital rights data protection board indiaai mission get fresh allocation funds longestablished schemes see reductions internet freedom foundation",
    "cleaned_selftext": "tldr union budget reveals overall increase funds allocation meity mha mib dot compared budget allocated meity witnessed highest increase among ministries last years yettobeformed data protection board indiaai mission gets funding first time however rural digital literacy scheme pmgdisha gets funding second year row although dot cut funding usof compared budget increased funding bharatnet overall increase budgetary allocations compared last year may paint positive picture deeper analysis realise decline fund allocation towards longestablished schemes projects well underutilisation funds continue unaddressed issues thus cause contention important documents iffs post union budget linkhttpsinternetfreedominbudgetrefstaticinternetfreedomin iffs posts interim union budget linkhttpsinternetfreedomintagbudgetrefstaticinternetfreedomin consolidated budgetary data selected items linkhttpsdocsgooglecomspreadsheetsdkhychfabvoidvmvlgicmcrwnkvbkkjnyeqkfeeditgidrefstaticinternetfreedomingid introduction final session th ls term union finance minister shrimati nirmala sitharaman presented union interim budget financial year fy ongoing monsoon session union finance minister placed new budget fy houses july budgeted estimates ministry electronics information technology meity ministry home affairs mha ministry information broadcasting mib department telecommunications dot witnessed overall increase union budget compared budget allocated meity witnessed highest increase among ministries comparison previous budget dot witnessed second highest budget mha mib got increase respectively increase fiscal year revised estimates previous year also highest meity dot mha saw increase respectively mib witnessed decrease since meity mib dot mha total table total expenditure meity mib dot mha rs crores digital public infrastructure dpi area focus government presentation union budget including varying schemes aimed farmers digital crop survey agristack also service sector proposal development dpi apps businesses however appears dpis found limited specific budgetary allocation even point focus economic survey released day budget dpis attributed rise technological engagement indian citizens ministries introducing populationscale interactive technological platforms clubbed common banner dpi soon release detailed analysis economic survey overreliance technologycentred tools ai dpi within ministry electronics information technology total budgetary allocation meity budget cr increase previous financial years budget increase even higher compared ie yearonyear change contrast budgetary trends witnessed underutilisation budget appreciate large overall increase budgetary allocation meity fy hope see funds directed towards infrastructure development aimed increasing telecom broadband connectivity research deep deliberation emerging technologies strengthening citizencentric fora systems closing digital divide item rs cractual budget revised budget establishment expenditure centre cyber security certin data protection board totalestablishment expenditure central sector schemesprojects digital india program pradhan mantri gramin digital saksharta abhiyan pmgdisha pli large scale electronics hardware cyber security projects promotion digital payment indiaai mission total central sector schemes projects central sector expenditure centre development advanced computing cdac unique identification authority india uidai society applied microwave electronics engineering research sameer total autonomous bodies total central sector expenditure grand total table budgetary allocations specific items meity notable change budget direct implications digital rights allocation cr data protection board dpb long arduous journey data protection legislation disappointing see funding mere cr regulatory body whose functioning direct impact implementation digital personal data protection act dpdpa successful otherwise crore lahks reportedlyhttpswwwhindustantimescomindianewsunionbudgethealthministryallocatedrscrorefulldetailshtmlrefstaticinternetfreedomin allocated capital expenditure includes fixed assets digital portal rest cr allocated revenue expenditure salaries etc since unclear dpb become functional difficult ascertain whether allocated budget meant utilised entire financial year part either way minuscule amount lakhs capital expenditure dpb may prove insufficient upskilling training dpb members following budgets hope meity ensures adequately resourced institutional preparation dpb adequate funding key regulatory bodies dpb contribute independent functioning necessary keep checks balances executive allocation towards prominent regulatory body essential cybersecurity health country indian computer emergency response team certin also increased previous years budget another positive note funding allocated cyber security projects seen massive increase since last year substantial increase allocation much needed backdrop increasing incidents data breaches vulnerabilities absence operational robust rightsadvancing data protection legislation recenthttpsinternetfreedomincybersecurityreportforqrefstaticinternetfreedomin grave cybersecurity incidents like tamil nadu police facial recognition portal breach telangana police network data leak raised concerns detection response capabilities indias cybersecurity authorities worth noting meity utilised cr allocated cr despite persisting challenges insufficient resources outdated infrastructure shortage skilled professionals hope trend underutilisation followed ministry fiscal year ahead another introduction year addition indiaai mission central sector scheme notable allocation cr top infusion cr approvedhttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomin previous national democratic alliance nda cabinet march disbursed period five years establish scheme including compute capacity program program aimshttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomin establish graphics processing unit infrastructure built publicprivate partnerships working group appointed government indiaai october reporthttpswwwmeitygovinwritereaddatafilesindiaaiexpertgroupreportfirsteditionpdfrefstaticinternetfreedomin recommended least graphics processing units infrastructural requirements moreover increased focus ai massive budgetary allowances form cause concern owing massive effects technology climate single chatgpt search taking times much energy regular google search according economic survey httpswwwindiabudgetgovineconomicsurveyindexphprefstaticinternetfreedomin survey cautioned artificial intelligences impact climate also employment opportunities amidst rising automation industries making employees redundant increasing trends technosolutionism plaguing governance india increased budgetary focus bolstering ai capabilities may result unnecessary technological interventions ai disappointingly budget interim budget meity allocate funds pradhan mantri gramin digital saksharta abhiyan pmgdisha breaking trend continuous budgetary support rural digital literacy scheme since inception pmgdisha key increased connectivity telecom penetration digital literacy across india allocations scheme touched alltime low since last year fy budget funds allocated towards last impact assessment study pmgdisha carried indian institute public administration report concludedhttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomin scheme digital literacy programme plays indispensable part bridging digital gap country also transforming knowledge economy society allocations made scheme must increase importantly exist ensure effective progress robust digital literacy country figure budget allocation pmgdisha meity interesting trend complete discontinuation budgetary allocation towards promotion digital payments meitys budget year last year noted allocation domain plummeted cr compared cr allocated reflecting decline allocation reduced cr finally budget also interesting note revised allocations increased sharply cr witnessing jump compared stood crores even though allocation higher stood lower figure budgetary allocation promotion digital payments meity meity introduced item titled promotion digital transactions excluding digital payments digital india program allocated cr per meity objective scheme promote overall digitisation efficient delivery citizencentric services empowerment citizens newly introduced item meity hopes grow volume digital transactions country also believes expenditure may cascading effect promotion digital payments scheme including estimating measuring digital economy india suggesting measurement framework estimation providing suitable policy recommendations boosting size growth digital economy india leveraging digital technologies interestingly despite new addition total expenditure towards digital india program reduced significantly consistently since figure share digital india programme total budgetary allocation meity ministry home affairs total budgetary allocation mha higher allocated higher revised budget allocation budget estimates net receipts recoveries mha cr allocation planned capital expenditure marginally dipped compared disappointing item rs cractual budget revised budget total establishment expenditure centre central sector schemesprojects helicopter services disaster management total central sector schemesprojects total central sector expenditure total grants loans transfers grand total table budgetary allocations specific items mha additionally notice interesting trend allocations item census survey statistics registrar general india past years estimated budget surveys census large actual utilisation remains minuscule biggest dip seen budget allocated cr cr utilised allocation remains large likely fall pattern remaining underutilised figure budgetary allocation census survey statisticsregistrar general india mha disappointing note mha allocate funds towards cyber information securityhttpswwwmhagovinendivisionofmhacyberandinformationsecuritycisdivisionrefstaticinternetfreedomin cis division includes key schemes cybercrime prevention women children scheme indian cybercrime coordination centre ic scheme reportedlyhttpstheprintineconomybudgetmhagetsrslakhcrorefocusontrainingandresearchbigboostforibcisfrefstaticinternetfreedomin ic didnt get fresh funding year ceased exist union government scheme starting july began working part mha interestingly divisions mha freedom fighters rehabilitation division police division still got funding allocated reading budget unclear item mha allocating funds cyber security awareness efforts earlier year ic notifiedhttpseconomictimesindiatimescomnewsindiagovtdesignatesicasagencyofmhatonotifyunlawfulactivitiesincyberworldarticleshowcmsfrommdrrefstaticinternetfreedomin official agency mha notify law enforcement authorities information technology act unlawful activities cyberspace additionally funding special wing cyber commandos reportedly mha project meant tackle cyber threats along local administration also missing years budget mha despite expectationshttpswwwbusinessstandardcombudgetnewsbudgetspecialunitofcybercommandosonhomeministrysdayagendahtmlrefstaticinternetfreedomin ministry information broadcasting total budgetary allocation mib cr decrease budget decrease revised budget cut comes mib seemingly able utilise higher budget allocation last year seems incongruent interestingly total budgetary allocation fy allocation interim budget trend uncommon several ministries item rs croreactual budget revised budget total establishment expenditure totalcentral sector schemes projects total support autonomous bodies grand total table budgetary allocations specific items mha mibs total ae since relatively stable compared ae meity mha dot notably dot introduced funding establishment bhartiya bhasha anubhag scheme platform meant facilitate translation various languages hindi vice versa department telecommunications dot operates ministry communications allocated cr increase budget allocated cr cr item rs cractual budget revised budget total establishment expenditure centre regulatory bodies telecom regulatory authority india general fund telecom disputes settlement appellate tribunal tdsat artificial intelligence face recognition powered solution telecom sim subscriber verification astr total regulatory bodies central sector schemesprojects universal service obligation fund transfer universal service obligation uso fund compensation telecom service providers bharatnet rd revenue amount met universal service obligation uso fund total defence spectrum dot projects promotion innovation incubation future technologies telecom sector digital intelligence unit project prevention spoofed incoming international calls system cior total dot projects total central sector schemesprojects total central sector expenditure grand total table budgetary allocations specific items dot surprisingly universal services obligation fund usof took hit funds cr allocated budget last years fall last years cr telecom services providers persistentlyhttpswwwbusinessstandardcombudgetnewsbudgetwishlisttelecomindustrycallsforjunkingusofslashingdutieshtmlrefstaticinternetfreedomin urged ministry finance suspend usof till existing corpus exhausted budget requests pressed exemption service tax assignment right use natural resources slashing customs duty telecom equipment zero allocation compensation telecom service providers saw increase budget cr compared budget cr item meant provide creation augmentation telecom infrastructure access various telecom services people rural remote areas including operation maintenance village public telephones far allocations bharatnet concerned significant increase cr cr grant goes towards creation telecom infrastructure required providing broadband connectivity gram panchayats country facilitating nondiscriminatory access service providers provisioning broadband services rural areas sharp increase budget appreciated total budgetary allocation regulatory bodies telecom regulatory authority india trai telecom disputes settlement appellate tribunal seen significant dip year cr compared previous year cr funding trai reduced past year even though dot utilised entire revised amount allocated regulatory body although dot allocated towards artificial intelligence face recognition powered solution telecom sim subscriber verification astr budget allocated funding budget funding digital intelligence unit project meant investigate fraudulent activity involving telecom resources unsolicited commercial communication witnessed drastic reduction budget cr compared previous budget cr dot also allocated cr first time prevention spoofed incoming international calls system cior centralized international roamer conclusion budget leaves us variety feelings hope disappointment budgetary allocations made first time like dpb indiaai mission promotion digital transactions longestablished budgetary items promotion digital payments pmgdisha census ic usof either witnessed complete discontinuation funds took significant hit allocated funds overall funding towards dpb includes planned capital expenditure lakhs inadequate say least additional cause concern decrease ae compared compared last years indicates much possible government extend concerned sector ae indicates much extended variation among three inevitable much difference reducehttpswwwindiaspendcombudgetbereoractualswhatdoyouneedtolookatintheupcomingbudgetrefstaticinternetfreedomin credibility numbers cause uncertainty cuts underutilisation may also negatively affect implementation government schemes projects light increasing digitisation across sectors increasing demand improved digital literacy well access digital services hope fund allocation concerned sectors continues witness positive trend although appreciate overall increase year compared last year hope see funds utilised efficiently directed towards infrastructure development aimed increasing teleconnectivity broadband connectivity cybersecurity overall digital literacy",
    "cleaned_comments": "",
    "light_cleaned_title": "2024 Budget & Digital Rights: Data Protection Board & IndiaAI Mission get fresh allocation; funds for long-established schemes see reductions | Internet Freedom Foundation",
    "light_cleaned_selftext": "# tl;dr The Union Budget for 2024-2025 reveals an overall increase in funds allocation for MeitY, MHA, MIB, and DoT as compared to 2023-2024. The Budget allocated to MeitY has witnessed the highest increase among these ministries – 32.56% over last year's – yet-to-be-formed Data Protection Board and the IndiaAI Mission gets funding for the first time however, rural digital literacy scheme PMGDISHA gets no funding (for the second year in a row). Although DoT cut funding for USOF by \\~80% as compared to 2023-2024 Budget, it increased funding for BharatNet by 70%. While the overall increase in budgetary allocations compared to last year may paint a positive picture, on deeper analysis we realise that the decline in fund allocation towards long-established schemes and projects as well as underutilisation of funds continue to be unaddressed issues and thus a cause of contention. # Important documents 1. IFF’s post on Union Budget for 2023-2024 ([~Link~](https://internetfreedom.in/budget-2023-2024/?ref=static.internetfreedom.in)) 2. IFF’s posts on the Interim Union Budget for 2024-2025 ([~Link~](https://internetfreedom.in/tag/budget-2024/?ref=static.internetfreedom.in)) 3. Consolidated budgetary data for selected items ([~Link~](https://docs.google.com/spreadsheets/d/1kHychfaB3VoidvMVLGICMCRwn_45KVBKK7JNYEqK_fE/edit?gid=1091729720&ref=static.internetfreedom.in#gid=1091729720)) # Introduction In the final session of the 17th LS term, Union Finance Minister, Shrimati Nirmala Sitharaman, presented the Union Interim Budget for the Financial Year (“**FY**”) 2024-2025. In the ongoing Monsoon Session, the Union Finance Minister placed a new Budget for the FY2024-2024 in both houses on July 23, 2024. The Budgeted Estimates (“**BE**”) for the Ministry of Electronics and Information Technology (“**MeitY**”), Ministry of Home Affairs (“**MHA**”), Ministry of Information and Broadcasting (“**MIB**”), and Department of Telecommunications (“**DoT**”) witnessed an overall increase of 15.98% in the 2024-25 Union Budget compared to 2023-2024 BE. The budget allocated to MeitY has witnessed the highest increase (32.56%) among these Ministries in comparison to the previous Budget (2023-2024) and DoT witnessed the second highest (14.7%). The Budget for MHA and MIB got a 9.44% and 7.45% increase respectively. The increase in the BE for this fiscal year from the Revised Estimates (“**RE**”) of the previous year was also the highest for MeitY (52.11%). While DoT and MHA saw an increase of 13.79% and 9.44% respectively, MIB witnessed a decrease of 2.41% since the RE of 2023-2024. || || ||**2019-2020**|**2020-2021**|**2021-2022**|**2022-2023**|**BE 2023-24**|**RE 2023-24**|**BE 2024-25**| |**MeitY**|5651.97|5523.2|8256.27|9220.28|16549.04|14421.25|21936.9| |**MIB**|4028.82|3380.44|3728.99|4024.13|4692.00|4449.76|4342.55| |**DoT**|28395.43|53510.82|43169.58|122509.06|97579.05|98359.41 |111915.43| |**MHA**|16936.83|3860.68|4365.67|4287.64|5901.31|5120.78|6458.24| |**Total**|**55013.05**|**66275.14**|**59520.51**|**140041.11**|**124721.4**|**122351.2**|**144653.1**| Table 1: Total Expenditure for MeitY, MIB, DoT, and MHA (In Rs. Crores) Digital Public Infrastructure (“**DPI**”) was an area of focus for the government during the presentation of the Union Budget including the varying schemes aimed at farmers with the digital crop survey, agri-stack, and also the service sector with a proposal for the development of more DPI apps for businesses. However, it appears that DPI(s) found limited specific budgetary allocation even after being a point of focus in the Economic Survey released a day before the Budget 2024-25. DPIs have been attributed for the rise in technological engagement of Indian citizens with more Ministries introducing population-scale interactive technological platforms which are being clubbed under the common banner of DPI. We will soon release a detailed analysis of the Economic Survey 2023-2024 and the over-reliance on technology-centred tools such as AI and DPI within it. # The Ministry of Electronics and Information Technology The total budgetary allocation for MeitY in the Budget for 2024-2025 is ₹21936.9 Cr, which is a 32.57% increase from the previous financial year’s Budget (BE 2023-2024). The increase is even higher when compared to the RE of 2023-2024, i.e., a year-on-year change of 52.11%. This is in contrast to the budgetary trends we witnessed in 2021, 2022 and 2023, where there was underutilisation of the budget. We appreciate the large overall increase in budgetary allocation to MeitY in FY 2024-2025 and hope to see these funds be directed towards infrastructure development aimed at increasing telecom and broadband connectivity, research and deep deliberation into emerging technologies, strengthening of citizen-centric fora and systems, and closing the digital divide. || || |**Item (Rs. cr)**|**Actual 2022-23**|**Budget 2023-24**|**Revised 2023-24**|**Budget 2024-25**| |**Establishment Expenditure of the Centre**||||| |Cyber Security (CERT-In)|176.49|225|208|238| |Data Protection Board|0|0|0|2| |**Total-Establishment Expenditure**|1815.9|2040.76|2074.5|2352.64| |**Central Sector Schemes/Projects**||||| |DIGITAL INDIA Program|5518.1|4795.2|4428|4216.51| |Pradhan Mantri Gramin Digital Saksharta Abhiyan (PMGDISHA)|250|0|0|0| |PLI for Large Scale Electronics and IT Hardware|1654.96|0|0|0| |Cyber Security Projects|30.11|400|400|759| |Promotion of Digital payment|1989.6|1500|584|0| |IndiaAI Mission|0|0|0|551.75| |**Total - Central Sector Schemes/ Projects**|5531.09|12440.28|12440.28|17871.26| |**Other Central Sector Expenditure**||||| |Centre for Development of Advanced Computing (C-DAC)|250|270|270|270| |Unique Identification Authority of India (UIDAI)|1219.7|940|800|600| |Society for Applied Microwave Electronics Engineering and Research (SAMEER)|131.39|160|150|160| |**Total- Autonomous Bodies**|1867.21|2057|1842.5|1700| |**Total - Other Central Sector Expenditure**|852.3|2068|1855.5|1713| |**Grand Total**|**8199.3**|**16549**|**14421.3**|**21936.9**| Table 2: Budgetary allocations for specific items for MeitY The most notable change in the Budget for 2024-2025, which has direct implications for digital rights, has to be the allocation of ₹2 Cr for the Data Protection Board (“**DPB**”). After a long and arduous journey for data protection legislation, it is disappointing to see funding of a mere ₹2 Cr for a regulatory body whose functioning will have a direct impact on the implementation of the Digital Personal Data Protection Act (“**DPDPA**”), 2023, successful or otherwise. Of this ₹2 crore, only ₹4 lahks is [~reportedly~](https://www.hindustantimes.com/india-news/union-budget-2024-25-health-ministry-allocated-rs-90-958-crore-full-details-101721738915694.html?ref=static.internetfreedom.in) allocated for capital expenditure, which includes fixed assets such as the digital portal, and the rest (₹ 1.96 Cr) is allocated for revenue expenditure (salaries, etc). Since it is unclear when the DPB will become functional, it is difficult to ascertain whether the allocated budget is meant to be utilised for the entire financial year or a part of it. Either way, a minuscule amount of ₹4 lakhs for capital expenditure on DPB may prove to be insufficient for upskilling and training of the DPB members. In the following Budgets, we hope MeitY ensures that it is adequately resourced for the institutional preparation of the DPB. Adequate funding for key regulatory bodies such as the DPB will contribute to its independent functioning which is necessary to keep checks and balances on the executive. Allocation towards a prominent regulatory body essential for the cybersecurity health of the country, the Indian Computer Emergency Response Team (“**CERT-In**”) also increased by 5.78% from the previous year’s Budget. On another positive note, funding allocated to ‘Cyber Security Projects’ has seen a massive increase of 89.75% since last year. This substantial increase in allocation was much needed in the backdrop of increasing incidents of data breaches and vulnerabilities and the absence of an operational, robust, and rights-advancing data protection legislation. [~Recent~](https://internetfreedom.in/cybersecurity-report-for-q2-2024/?ref=static.internetfreedom.in) grave cybersecurity incidents, like the Tamil Nadu Police Facial Recognition Portal breach and the Telangana Police Network data leak, have raised concerns about the detection and response capabilities of India’s cybersecurity authorities. It is worth noting that MeitY utilised only ₹30.11 Cr out of the allocated ₹300 Cr in 2022-2023, despite persisting challenges of insufficient resources, outdated infrastructure, and a shortage of skilled professionals. We hope that the same trend of under-utilisation is not followed by the Ministry this fiscal year and ahead. Another introduction this year was the addition of ‘IndiaAI Mission’ as a Central Sector Scheme, with a notable allocation of ₹551.75 Cr. This is on top of the infusion of ₹10,371.92 Cr [~approved~](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2012355&ref=static.internetfreedom.in) by the previous National Democratic Alliance (“**NDA**”) cabinet in March 2024 which is to be disbursed over a period of five years to establish the scheme including its Compute Capacity program. The program [~aims~](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2012355&ref=static.internetfreedom.in) to establish a 10,000 Graphics Processing Unit infrastructure to be built with public-private partnerships. The working group appointed by the government on IndiaAI in its October 2023 [~report~](https://www.meity.gov.in/writereaddata/files/IndiaAI-Expert-Group-Report-First-Edition.pdf?ref=static.internetfreedom.in) had recommended at least 24,500 Graphics Processing Units for infrastructural requirements. Moreover, the increased focus on AI and massive budgetary allowances form cause for concern owing to the massive effects of the technology on the climate – with a single ChatGPT search taking 10 times as much energy as a regular Google search, according to the [~Economic Survey 2023-24~](https://www.indiabudget.gov.in/economicsurvey/index.php?ref=static.internetfreedom.in). The Survey cautioned against Artificial Intelligence’s impact not only on climate but also on employment opportunities amidst rising automation in industries making employees redundant. With increasing trends of techno-solutionism plaguing governance in India, increased budgetary focus on bolstering AI capabilities may result in more unnecessary technological interventions – but now with AI. Disappointingly, the Budget for 2023-2024 and the Interim Budget for 2024-2025 for MeitY did not allocate any funds to Pradhan Mantri Gramin Digital Saksharta Abhiyan (“**PMGDISHA**”), breaking the trend of continuous budgetary support for the rural digital literacy scheme since its inception in 2017. PMGDISHA was key to increased connectivity, telecom penetration, and digital literacy across India. Allocations to the scheme touched an all-time low in 2022 since 2017, and then last year in the FY 2023-24 budget, no funds were allocated towards it. The last impact assessment study of PMGDISHA was carried out by the Indian Institute of Public Administration in 2020-21. The report [~concluded~](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=1843061&ref=static.internetfreedom.in) that the scheme, as a digital literacy programme, “*plays an indispensable part in not only bridging the digital gap in the country but also transforming it into a knowledge economy and society*.” The allocations made to this scheme must increase, and more importantly exist, to ensure its effective progress and robust digital literacy in the country. Figure 1: Budget Allocation to PMGDISHA (MeitY) The other interesting trend is the complete discontinuation of budgetary allocation towards ‘Promotion of Digital Payments’ under MeitY’s budget for this year. Last year, we noted that the allocation to this domain plummeted to ₹1500 Cr as compared to ₹2137 Cr allocated to it in the 2022-2023 RE, reflecting a decline of 29.8%. In the RE of 2023-2024, the allocation was further reduced to ₹584 Cr and finally to 0 in the Budget for 2024-2025. It is also interesting to note that revised allocations increased sharply in 2022-2023 (₹2137 Cr), witnessing a jump of 968.5% as compared to the 2022-2023 BE which stood at ₹200 crores. Even though the allocation in 2023-2024 is higher than the 2022 BE, it stood lower than the RE. Figure 2: Budgetary Allocation to ‘Promotion of Digital Payments’ (MeitY) MeitY has introduced an item titled ‘Promotion of Digital Transactions (excluding Digital Payments)’ under the DIGITAL INDIA Program, for which it has allocated ₹1.5 Cr. As per MeitY, the objective of this scheme is to promote overall digitisation for the efficient delivery of citizen-centric services and empowerment of citizens. Through this newly introduced item, MeitY hopes to grow the volume of digital transactions in the country. It also believes that this expenditure may have a cascading effect on the promotion of digital payments scheme including estimating and measuring digital economy of India, suggesting a measurement framework for such estimation, and providing suitable policy recommendations for boosting the size and growth of the digital economy in India by leveraging the digital technologies. Interestingly, despite this new addition, the total expenditure towards the DIGITAL INDIA Program has reduced significantly and consistently since the BE for 2022-2023. Figure 3: Share of the Digital India Programme in the Total Budgetary Allocation (MeitY) # The Ministry of Home Affairs The total budgetary allocation for MHA is 9.44% higher than what was allocated in the BE for 2023-24 and 9.44% higher than the 2023-2024 revised Budget. The allocation in the budget estimates, net of receipts and recoveries, for MHA is ₹6458.24 Cr. The allocation for planned capital expenditure has marginally dipped as compared to both 2023-2024 BE (by 10.16%) and RE (by 29.39%), which is disappointing. || || |**Item (Rs. cr)**|**Actual 2022-2023**|**Budget 2023-2024**|**Revised 2023-2024**|**Budget 2024-2025**| |**Total- Establishment Expenditure of the Centre**|2111.7|2491.53|2622.86|2456.5| |**Central Sector Schemes/Projects**||||| |Helicopter Services|105.61|126|103|115| |Disaster Management|186.61|393.65|326.41|288.63| |**Total - Central Sector Schemes/Projects**|1330.5|1504.34|1667.58|1709.41| |**Total- Other Central Sector Expenditure**|623.82|1728.13|761.75|1613.45| |**Total- Other Grants/ Loans/ Transfers**|70.6|67.31|66.3|668.01| |**Grand Total**|**4235.69**|**5901.31**|**5120.78**|**6458.24**| Table 3: Budgetary allocations for specific items for MHA Additionally, we notice an interesting trend in allocations to the item ‘Census, Survey and Statistics/ Registrar General of India’. For the past few years, the estimated budget for surveys and census has been large, but the actual utilisation remains minuscule. The biggest dip was seen in 2022-23, where the budget allocated was ₹3676 Cr, but only ₹513.18 Cr was utilised. For BE 2024-25, the allocation remains large, but it is likely to fall into the same pattern of remaining underutilised Figure 4: Budgetary Allocation to Census, Survey and Statistics/Registrar General of India (MHA) On a disappointing note, MHA did not allocate any funds towards its [~Cyber and Information Security~](https://www.mha.gov.in/en/divisionofmha/cyber-and-information-security-cis-division?ref=static.internetfreedom.in) (“**C&IS**”) Division, which includes key schemes such as the Cybercrime Prevention against Women and Children Scheme and the Indian Cybercrime Coordination Centre (“**I4C**”) Scheme. [~Reportedly~](https://theprint.in/economy/budget-2024-mha-gets-rs-2-19-lakh-crore-focus-on-training-and-research-big-boost-for-ib-cisf/2187805/?ref=static.internetfreedom.in), I4C didn’t get fresh funding this year because it “*ceased to exist as a Union government scheme starting 1 July and began working as part of the MHA*”. Interestingly, other Divisions of the MHA such as the Freedom Fighters and Rehabilitation Division and the Police Division still got funding allocated to them. From a reading of the Budget, it is unclear under which item, if at all, is MHA allocating funds for cyber security and awareness efforts. Earlier this year, I4C was [~notified~](https://economictimes.indiatimes.com/news/india/govt-designates-i4c-as-agency-of-mha-to-notify-unlawful-activities-in-cyber-world/articleshow/108501675.cms?from=mdr&ref=static.internetfreedom.in) as the official agency by MHA to notify law enforcement authorities, under the Information Technology Act, 2000, about unlawful activities in the cyberspace. Additionally, funding for a special wing of \"cyber commandos\", reportedly an MHA project meant to tackle cyber threats along with local administration, is also missing from this year’s Budget for MHA, despite [~expectations~](https://www.business-standard.com/budget/news/budget-special-unit-of-cyber-commandos-on-home-ministry-s-100-day-agenda-124062100754_1.html?ref=static.internetfreedom.in). # The Ministry of Information and Broadcasting The total budgetary allocation for MIB in 2024-25 is ₹4342.55 Cr, which is a 7.45% decrease from the 2023-2024 Budget and a 2.41% decrease from the 2023-2024 Revised Budget. This cut comes after MIB seemingly was able to utilise a higher budget allocation last year, which seems incongruent. Interestingly, the total budgetary allocation for FY 2024-2025 is the same as the allocation under the Interim Budget for 2024-2025, a trend uncommon for several other Ministries. || || |**Item (Rs. crore)**|**Actual 2022-23**|**Budget 2023-24**|**Revised 2023-24**|**Budget 2024-25**| |**Total- Establishment Expenditure**|566.73|535.5|551|566.41| |**Total-Central Sector Schemes/ Projects**|596.66|1105|1027.28|1004.31| |**Total- Support to Autonomous Bodies**|2875.57|3031.12|2848.1|2748.83| |**Grand Total**|**4020.18**|**4692**|**4449.76**|**4342.55**| Table 4: Budgetary allocations for specific items for MHA MIB’s total AE since 2014-2015 has been relatively stable, as compared to the AE of MeitY, MHA, and DoT. Notably, DoT has introduced funding for the establishment of the ‘Bhartiya Bhasha Anubhag’ scheme, which is a platform meant to facilitate the translation of various languages into Hindi and vice versa. # The Department of Telecommunications In 2024-25, DoT (which operates under the Ministry of Communications) has been allocated ₹111915.43 Cr, which is a 14.69% increase over the budget allocated in 2023-24 (₹97579.05 Cr) and 13.78% over the RE for 2023-24 (₹98359.41 Cr). || || |**Item (Rs. cr)**|**Actual 2022-23**|**Budget 2023-24**|**Revised 2023-24**|**Budget 2024-25**| |**Total - Establishment Expenditure of the Centre**|16601.82|22042.91|18462.35|18656.22| |**Regulatory Bodies**||||| |Telecom Regulatory Authority of India General Fund|232.78|214.35|311.9|110| |Telecom Disputes Settlement and Appellate Tribunal (TDSAT)|17.02|24.18|26.18|23.7| |Artificial Intelligence and Face Recognition Powered Solution for Telecom SIM Subscriber Verification (ASTR)|0|0.5|0|0| |**Total- Regulatory Bodies**|249.8|238.53|338.08|133.7| |**Central Sector Schemes/Projects**||||| |**Universal Service Obligation Fund**||||| |Transfer to Universal Service Obligation (USO) Fund|53500|10400|2000|2000| |Compensation to Telecom Service Providers|2000|5000|10600|10100| |Bharatnet|1500|5000|5000|8500| |R&D (Revenue)|0|400|100|400| |Amount met from Universal Service Obligation (USO) Fund|-3500|-10400|-15700|-19000| |**Total - Defence Spectrum**|1367.66|2158|2158|0| |**DoT Projects**||||| |Promotion of Innovation and Incubation of Future Technologies for Telecom Sector|55|0|0|0| |Digital Intelligence Unit Project|0|220|50|85| |Prevention of Spoofed Incoming International Calls System 'CIOR'|0|0|0|38.76| |**Total - DoT Projects**|315.55|2285.32|926.53|2353.19| |**Total- Central Sector Schemes/Projects**|55183.21|14843.32|6678.27|4353.19| |**Total - Other Central Sector Expenditure**|47175.51|60692.82|73218.79|88906.02| |**Grand Total**|**118960.54**|**97579.05**|**98359.41**|**111915.43**| Table 4: Budgetary allocations for specific items for DoT Surprisingly, the Universal Services Obligation Fund (“USOF”) took a hit in funds with only ₹2000 Cr allocated to it in the 2024-25 Budget (same as last year’s RE), an 80.77% fall from last year’s ₹10400 Cr. Telecom services providers have [~persistently~](https://www.business-standard.com/budget/news/budget-wish-list-telecom-industry-calls-for-junking-usof-slashing-duties-124011800938_1.html?ref=static.internetfreedom.in) urged the Ministry of Finance to suspend USOF till the existing corpus is exhausted, and in their Budget requests for 2024-25, pressed for an exemption from the service tax on “assignment of right to use natural resources” and the slashing of customs duty on telecom equipment to zero. Allocation to ‘Compensation to Telecom Service Providers’ saw a 102% increase in the 2024-2025 Budget (₹10100 Cr) as compared to the 2023-2024 budget (₹5000 Cr). This item is meant to provide for the “*creation and augmentation of telecom infrastructure and access to various telecom services to people in the rural and remote areas including operation and maintenance of Village Public Telephones*.” As far as allocations for BharatNet are concerned, there has been a significant increase of 70% in BE 2024-25 (₹8500 Cr) from BE 2023-24 (₹5000 Cr). The grant goes towards the creation of telecom infrastructure required for providing broadband connectivity to all the Gram Panchayats in the country and facilitating non-discriminatory access to service providers, for provisioning of broadband services in rural areas. The sharp increase in budget is appreciated. Total budgetary allocation for regulatory bodies such as the Telecom Regulatory Authority of India (“**TRAI**”) and Telecom Disputes Settlement and Appellate Tribunal has seen a significant dip this year (₹113 Cr) as compared to the previous year (₹238.53 Cr). The funding for TRAI has reduced by 48.68% over the past year, even though DoT utilised the entire revised amount allocated in 2022-2023 for the regulatory body, which was more than the BE for 2022-2023. Although DoT allocated ₹50,00,000 towards ‘Artificial Intelligence and Face Recognition Powered Solution for Telecom SIM Subscriber Verification (ASTR)’ in the 2023-2024 Budget, it has not allocated any funding in the 2024-2025 Budget. Funding for the Digital Intelligence Unit Project, which is meant to investigate fraudulent activity involving telecom resources, such as Unsolicited Commercial Communication, witnessed a drastic reduction of 61.36% in the 2024-2025 Budget (₹85 Cr) as compared to the previous Budget (₹220 Cr). DoT has also allocated ₹38.76 Cr for the first time for the ‘Prevention of Spoofed Incoming International Calls System – 'CIOR' (Centralized International Out Roamer)’. # Conclusion The 2024-25 Budget leaves us with a variety of feelings, some of hope and some of disappointment. While there are some budgetary allocations made for the first time, like the DPB, IndiaAi Mission, and ‘Promotion of Digital Transactions’, long-established budgetary items such as the ‘Promotion of Digital Payments’, PMGDISHA, the Census, I4C, and the USOF either witnessed a complete discontinuation of funds or took a significant hit in the allocated funds. Overall funding towards the DPB includes planned capital expenditure of only ₹4 lakhs which is inadequate to say the least. An additional cause for concern is the decrease in the AE as compared to the RE, and in the RE as compared to the BE, for the last few years. The RE indicates how much is possible for the government to extend to the concerned sector and the AE indicates how much was extended. While some variation among the three is inevitable, too much of a difference can [~reduce~](https://www.indiaspend.com/budget/be-re-or-actuals-what-do-you-need-to-look-at-in-the-upcoming-budget-800937?ref=static.internetfreedom.in) the credibility of the numbers and cause uncertainty. Cuts in and underutilisation of the RE may also negatively affect the implementation of government schemes and projects. In light of the increasing digitisation across sectors and the increasing demand for improved digital literacy as well as access to digital services, we hope that the fund allocation in these concerned sectors continues to witness a positive trend. Although we appreciate the overall increase in BE this year as compared to last year, we hope to see these funds be utilised efficiently and directed towards infrastructure development aimed at increasing tele-connectivity, broadband connectivity, cybersecurity, and overall digital literacy.",
    "light_cleaned_comments": ""
}