{
    "id": "16srd4r",
    "title": "Lowest household savings in the last 47 years in India -RBI report",
    "url": "https://www.reddit.com/r/india/comments/16srd4r/lowest_household_savings_in_the_last_47_years_in/",
    "selftext": "https://www.zeebiz.com/economy-infra/news-household-net-financial-savings-at-47-year-low-in-fy23-254985#google_vignette\n\nNo mainstream media has dared touch on this news. But based on RBI report, the household savings numbers have fallen to the lowest in almost 47 years. This is a massive setback in a nation likes ours where this is minimal social security for the citizens.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695742784.0,
    "convurl": "https://external-preview.redd.it/8a3ih2MmhKZag9g0REFdd6UpPdjXqW0Xd-RQwv07wmk.jpg?auto=webp&s=c4c9f2fa51613564ca5b32659f2f843abb9154c6",
    "comments": [
        "High inflation, increase in living costs, wage growth not keeping up with inflation and demographic change from being a 'saving for the future' to 'spend now, worry later' could explain low savings for Indians.",
        "I saw a tweet from some BJP guy with a bar graph saying it's all normal",
        "Normal people are saving boat loads of money, it's because Ambani and Adani are in a tough bind that the savings rate has fallen.",
        "Thanks also goes to Nirmala Tai.",
        "This is just sad we have a dark future ahead of us. \n\nKeep smiling on Instagram for likes",
        "&#x200B;\n\nhttps://preview.redd.it/8rcqcoymxnqb1.png?width=480&format=png&auto=webp&s=3d4de0226ed35f1b6e4eced9200cd5a7863c241d",
        "~~Normal~~ upper middle class  FIFY",
        "Her family doesn’t eat savings so it’s okay",
        "I mean fresher salaries have barely budged in the last decade.",
        "This govt would have been ripped apart if it wasn't for the cheap internet. Ab unkills aur aunties insta pe hilate hein din bhar.",
        "Madarchodon ne interest rate hi itna gira diya. Kyun daalein tumhari bank mein?! Not worth it. Isse achha toh cricket mein laga lein, usse tum bhi tax Khao, suwaron.",
        "https://preview.redd.it/a7kuu1rgloqb1.jpeg?width=594&format=pjpg&auto=webp&s=49d6dcee126c53bd7ee548f371567ca3091c740d",
        "The banks hold you money at ransom and get you to subscribe to expensive schemes/cards/etc.",
        "Also subsidies and eventually write off the billionaire loans. \n\nIts incredible how the little guy is still willing to vote for that bastard.",
        "Would be interesting to see how much luxury buying has contributed to this. You do see a lot of people buying phones worth 5x their salaries using 24 month EMIs",
        "High saving rates are not necessarily good for the economy. You want money to be deployed and create goods/services. Money in the bank doesn’t grow the economy",
        "Yes, in an ideal developed economy. But try making that argument with the millions of rural people currently having to sell whatever assets they have just to afford basic necessities. Those are people who have had all their savings wiped out due to very little support from govt during COVID , high unemployment and other failures of govt on various levels in last few years.",
        "Almost 2 decades.\n\nMy brother Joined TCS in 2002 at the package of 2.75 lakhs. \n\nI joined Infosys at the package of 3.15 lakhs in 2009.\n\nMy cousin sister joined Infosys in 2019 at package of 3.5 lakhs",
        ">demographic change from being a 'saving for the future' to 'spend now, worry later\n\nImo this is equally as alarming as inflation",
        "Do we discuss it in CTC or gross in India? I asked my parents and they said \"We discuss it the same way everyone else does\" I don't think they understand the difference.",
        "Lower interest rates is a good thing because then people start investing in infrastructure, which gives a boost to economy.",
        "It's also understandable. Covid changed people's perspective about life and saving money for the future.",
        "My cock is better investment than  infrastructure. Haha."
    ],
    "cleaned_text": "lowest household savings last years india rbi report mainstream media dared touch news based rbi report household savings numbers fallen lowest almost years massive setback nation likes minimal social security citizens ",
    "cleaned_title": "lowest household savings last years india rbi report",
    "cleaned_selftext": "mainstream media dared touch news based rbi report household savings numbers fallen lowest almost years massive setback nation likes minimal social security citizens",
    "cleaned_comments": "high inflation increase living costs wage growth keeping inflation demographic change saving future spend worry later could explain low savings indians saw tweet bjp guy bar graph saying normal normal people saving boat loads money ambani adani tough bind savings rate fallen thanks also goes nirmala tai sad dark future ahead us keep smiling instagram likes xb normal upper middle class fify family doesnt eat savings okay mean fresher salaries barely budged last decade govt would ripped apart wasnt cheap internet ab unkills aur aunties insta pe hilate hein din bhar madarchodon ne interest rate hi itna gira diya kyun daalein tumhari bank mein worth isse achha toh cricket mein laga lein usse tum bhi tax khao suwaron banks hold money ransom get subscribe expensive schemescardsetc also subsidies eventually write billionaire loans incredible little guy still willing vote bastard would interesting see much luxury buying contributed see lot people buying phones worth x salaries using month emis high saving rates necessarily good economy want money deployed create goodsservices money bank doesnt grow economy yes ideal developed economy try making argument millions rural people currently sell whatever assets afford basic necessities people savings wiped due little support govt covid high unemployment failures govt various levels last years almost decades brother joined tcs package lakhs joined infosys package lakhs cousin sister joined infosys package lakhs demographic change saving future spend worry later imo equally alarming inflation discuss ctc gross india asked parents said discuss way everyone else dont think understand difference lower interest rates good thing people start investing infrastructure gives boost economy also understandable covid changed peoples perspective life saving money future cock better investment infrastructure haha",
    "light_cleaned_title": "Lowest household savings in the last 47 years in India -RBI report",
    "light_cleaned_selftext": "No mainstream media has dared touch on this news. But based on RBI report, the household savings numbers have fallen to the lowest in almost 47 years. This is a massive setback in a nation likes ours where this is minimal social security for the citizens.",
    "light_cleaned_comments": "High inflation, increase in living costs, wage growth not keeping up with inflation and demographic change from being a 'saving for the future' to 'spend now, worry later' could explain low savings for Indians. I saw a tweet from some BJP guy with a bar graph saying it's all normal Normal people are saving boat loads of money, it's because Ambani and Adani are in a tough bind that the savings rate has fallen. Thanks also goes to Nirmala Tai. This is just sad we have a dark future ahead of us. Keep smiling on Instagram for likes &#x200B; ~~Normal~~ upper middle class FIFY Her family doesn’t eat savings so it’s okay I mean fresher salaries have barely budged in the last decade. This govt would have been ripped apart if it wasn't for the cheap internet. Ab unkills aur aunties insta pe hilate hein din bhar. Madarchodon ne interest rate hi itna gira diya. Kyun daalein tumhari bank mein?! Not worth it. Isse achha toh cricket mein laga lein, usse tum bhi tax Khao, suwaron. The banks hold you money at ransom and get you to subscribe to expensive schemes/cards/etc. Also subsidies and eventually write off the billionaire loans. Its incredible how the little guy is still willing to vote for that bastard. Would be interesting to see how much luxury buying has contributed to this. You do see a lot of people buying phones worth 5x their salaries using 24 month EMIs High saving rates are not necessarily good for the economy. You want money to be deployed and create goods/services. Money in the bank doesn’t grow the economy Yes, in an ideal developed economy. But try making that argument with the millions of rural people currently having to sell whatever assets they have just to afford basic necessities. Those are people who have had all their savings wiped out due to very little support from govt during COVID , high unemployment and other failures of govt on various levels in last few years. Almost 2 decades. My brother Joined TCS in 2002 at the package of 2.75 lakhs. I joined Infosys at the package of 3.15 lakhs in 2009. My cousin sister joined Infosys in 2019 at package of 3.5 lakhs >demographic change from being a 'saving for the future' to 'spend now, worry later Imo this is equally as alarming as inflation Do we discuss it in CTC or gross in India? I asked my parents and they said \"We discuss it the same way everyone else does\" I don't think they understand the difference. Lower interest rates is a good thing because then people start investing in infrastructure, which gives a boost to economy. It's also understandable. Covid changed people's perspective about life and saving money for the future. My cock is better investment than infrastructure. Haha."
}