{
    "id": "1gaf162",
    "title": "Germany bets on India to reduce reliance on China",
    "url": "https://m.economictimes.com/news/economy/policy/germany-bets-on-india-to-reduce-reliance-on-china/articleshow/114498397.cms",
    "selftext": "\n\nGerman direct investments in India were around 25 billion euros ($27 billion) in 2022, about 20% of the volume invested in China, said Volker Treier, head of foreign trade at the German Chamber of Commerce DIHK. He thinks that share could rise to 40% by the end of the decade.\n\n\n\nDefinitely a step in the right direction for Indian economy. \nIf India wants to grow, then we definitely need to move from a Service economy to a service+manufacturing economy. ",
    "flair": "Policy/Economy",
    "score": 54,
    "num_comments": 0,
    "created_utc": 1729701474.0,
    "convurl": "https://external-preview.redd.it/i-sLKjePTYNjogQQ6ilw8EU_kX_NFJ2M8abLy1rF1Mc.jpg?auto=webp&s=4e1d69df37ae4aa41ca96aad3d5637ed139a501d",
    "comments": [],
    "cleaned_text": "germany bets india reduce reliance china german direct investments india around billion euros billion volume invested china said volker treier head foreign trade german chamber commerce dihk thinks share could rise end decade definitely step right direction indian economy india wants grow definitely need move service economy servicemanufacturing economy ",
    "cleaned_title": "germany bets india reduce reliance china",
    "cleaned_selftext": "german direct investments india around billion euros billion volume invested china said volker treier head foreign trade german chamber commerce dihk thinks share could rise end decade definitely step right direction indian economy india wants grow definitely need move service economy servicemanufacturing economy",
    "cleaned_comments": "",
    "light_cleaned_title": "Germany bets on India to reduce reliance on China",
    "light_cleaned_selftext": "German direct investments in India were around 25 billion euros ($27 billion) in 2022, about 20% of the volume invested in China, said Volker Treier, head of foreign trade at the German Chamber of Commerce DIHK. He thinks that share could rise to 40% by the end of the decade. Definitely a step in the right direction for Indian economy. If India wants to grow, then we definitely need to move from a Service economy to a service+manufacturing economy.",
    "light_cleaned_comments": ""
}