{
    "id": "160plme",
    "title": "Delhi Mumbai Expressway Accident: Rolls-Royce was part of 20-vehicle convoy, hit fuel tanker from behind at over 200 kmph | Gurgaon News - Times of India",
    "url": "https://timesofindia.indiatimes.com/city/gurgaon/rolls-hit-fuel-tanker-from-behind-at-over-200-kmph/articleshow/103038953.cms",
    "selftext": "Rolls Royce was part of A convoy with red beacon that crashed into the fuel tanker. Initially the police claimed that the tanker came on the wrong side and hit the Rolls Royce , unfortunately CCTV footage proved it wrong. \nNo Names mentioned in the article apart from the tanker drivers and colleague.\nSo most definitely will be some politicians or their kids. The convoy did not stop at any toll plaza.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 39,
    "created_utc": 1692939990.0,
    "convurl": "https://external-preview.redd.it/dSGV0Q6UcXOqBf7xSkJkWp3C6BMo8gCdhFus2VCdens.jpg?auto=webp&s=7901883df9b50c622b47eeada1d549b0be8df2e6",
    "comments": [
        "This country is so corrupt that the news channels will not mention the names of the Rolls Royce occupants. I’m sure the driver wouldn’t be arrested nor charged. If the truck driver’s family wants justice, they should buy a gun and shoot the bastards.",
        "But Indi did went on the moon. I thought that would’ve absolve it of all of this corruption?",
        "Good thing there were CCTV cameras \n\nDestroying the truck drivers’ life to save some stupid politician kids/ family members was an easy way out",
        "oh my god, you are so edgy.",
        "So the security rescued their clients and left the truck drivers to die. Charge them with murder and send them to ja. If you don't have empathy you are not a human being fit for society.",
        "I heard of a new law being proposed where running away from crime scene is gonna be another offence. I wish these people be charged with that same crime. Also, death due to negligence.",
        "Video link?",
        "is this part of Bharat NCAP",
        "Agreed 💯",
        "> Good thing there were CCTV cameras \n\nStill nothing will happen. \n\nUSA arrested their former President. Here, even a low-level local gunda connected to local MLA can get away with murder.",
        "Rolls Royce belongs to Vikas Malu, owner of Kuber Group. He was in the car. He is also a suspect for the murder of Satish Kaushik as per his ex-wife.",
        "Here is an article with more details - https://rollengstones.us/?p=4676&feed_id=3875&_unique_id=64e758429a52b",
        "Any idea who the occupants of the Rolls were? 20 car convoy with escorts, Rs. 12 crore RR Phantom etc point to some really big fish.  The media is reporting the names as \"Tasbir and Divya\" but it very possible that this could be staged by PR agents.",
        "How do you know this?",
        "Hit and run is a crime in *many* countries. You can't just run lol.",
        "Quite a few reports pointing to a gent named Vikas Manu of Kuber group.",
        "[Kuber Group Owner Vikas Malu Occupant In Rolls Royce That Collided With Truck On Delhi-Mumbai Expressway](https://www.freepressjournal.in/india/kuber-group-owner-vikas-malu-occupant-in-rolls-royce-that-collided-with-truck-on-delhi-mumbai-expressway-report)\n\nhttps://preview.redd.it/pp3n5rh6c9kb1.jpeg?width=640&format=pjpg&auto=webp&s=7fe14cbd107714d172d08955fc6c4e016e3c9996",
        "Rolce are soooo heavy and hard to slow down.... Stupid cars",
        "Ye comment ko ucha paguchao",
        "Wtf, how on earth does he have so many RR",
        "He keeps ramming them into trucks so he needs extras.",
        "[https://www.ndtv.com/india-news/kuber-group-director-among-injured-in-high-speed-rolls-royce-crash-near-delhi-cop-4329674](https://www.ndtv.com/india-news/kuber-group-director-among-injured-in-high-speed-rolls-royce-crash-near-delhi-cop-4329674)",
        "They did say a “convoy” 🙊",
        "Mr. Manu is just following the footsteps of sage Manu, who weote Manusmriti.",
        "Literally no one says that, what crack are you on",
        "Kuber group. Ranjnigandha wala cuthiya chala raha tha gadi",
        "Finally something that can destroy a rolls royce",
        "Best \"goli maro saalo ko\"",
        "Bechare ka collection kharab ho gaya hoga…\n\nWhy is this asshole not arrested already?",
        "He was allegedly not driving the vehicle.\nHe was a passenger. Currently in the hospital",
        "Ofcourse, he was not driving",
        "I just read that he succumbed to his injuries.",
        "I just read that he succumbed to his injuries.",
        "So did two people in the truck ☹️",
        "New salman bhai?",
        "That’s the sentiment",
        "No it’s not lol tf no one thinks india is absolved of corruption cause ISRO did their thing",
        "That’s the sentiment. Nobody’s is saying this. Indians will be ready for another Amrit kaal soon",
        "Democrats arresting Republicans; Rahul Gandhi was arrested as well. Wake me when they arrest Hunter Biden, while in power.",
        "Unfortunately nothing will happen. They will wait for a few days for the smoke to clear. Pay the victims sone paltry sum and shut them up."
    ],
    "cleaned_text": "delhi mumbai expressway accident rollsroyce part vehicle convoy hit fuel tanker behind kmph gurgaon news times india rolls royce part convoy red beacon crashed fuel tanker initially police claimed tanker came wrong side hit rolls royce unfortunately cctv footage proved wrong names mentioned article apart tanker drivers colleague definitely politicians kids convoy stop toll plaza ",
    "cleaned_title": "delhi mumbai expressway accident rollsroyce part vehicle convoy hit fuel tanker behind kmph gurgaon news times india",
    "cleaned_selftext": "rolls royce part convoy red beacon crashed fuel tanker initially police claimed tanker came wrong side hit rolls royce unfortunately cctv footage proved wrong names mentioned article apart tanker drivers colleague definitely politicians kids convoy stop toll plaza",
    "cleaned_comments": "country corrupt news channels mention names rolls royce occupants im sure driver wouldnt arrested charged truck drivers family wants justice buy gun shoot bastards indi went moon thought wouldve absolve corruption good thing cctv cameras destroying truck drivers life save stupid politician kids family members easy way oh god edgy security rescued clients left truck drivers die charge murder send ja dont empathy human fit society heard new law proposed running away crime scene gon na another offence wish people charged crime also death due negligence video link part bharat ncap agreed good thing cctv cameras still nothing happen usa arrested former president even lowlevel local gunda connected local mla get away murder rolls royce belongs vikas malu owner kuber group car also suspect murder satish kaushik per exwife article details idea occupants rolls car convoy escorts rs crore rr phantom etc point really big fish media reporting names tasbir divya possible could staged pr agents know hit run crime many countries cant run lol quite reports pointing gent named vikas manu kuber group kuber group owner vikas malu occupant rolls royce collided truck delhimumbai expresswayhttpswwwfreepressjournalinindiakubergroupownervikasmaluoccupantinrollsroycethatcollidedwithtruckondelhimumbaiexpresswayreport rolce soooo heavy hard slow stupid cars ye comment ko ucha paguchao wtf earth many rr keeps ramming trucks needs extras httpswwwndtvcomindianewskubergroupdirectoramonginjuredinhighspeedrollsroycecrashneardelhicophttpswwwndtvcomindianewskubergroupdirectoramonginjuredinhighspeedrollsroycecrashneardelhicop say convoy mr manu following footsteps sage manu weote manusmriti literally one says crack kuber group ranjnigandha wala cuthiya chala raha tha gadi finally something destroy rolls royce best goli maro saalo ko bechare ka collection kharab ho gaya hoga asshole arrested already allegedly driving vehicle passenger currently hospital ofcourse driving read succumbed injuries read succumbed injuries two people truck new salman bhai thats sentiment lol tf one thinks india absolved corruption cause isro thing thats sentiment nobodys saying indians ready another amrit kaal soon democrats arresting republicans rahul gandhi arrested well wake arrest hunter biden power unfortunately nothing happen wait days smoke clear pay victims sone paltry sum shut",
    "light_cleaned_title": "Delhi Mumbai Expressway Accident: Rolls-Royce was part of 20-vehicle convoy, hit fuel tanker from behind at over 200 kmph | Gurgaon News - Times of India",
    "light_cleaned_selftext": "Rolls Royce was part of A convoy with red beacon that crashed into the fuel tanker. Initially the police claimed that the tanker came on the wrong side and hit the Rolls Royce , unfortunately CCTV footage proved it wrong. No Names mentioned in the article apart from the tanker drivers and colleague. So most definitely will be some politicians or their kids. The convoy did not stop at any toll plaza.",
    "light_cleaned_comments": "This country is so corrupt that the news channels will not mention the names of the Rolls Royce occupants. I’m sure the driver wouldn’t be arrested nor charged. If the truck driver’s family wants justice, they should buy a gun and shoot the bastards. But Indi did went on the moon. I thought that would’ve absolve it of all of this corruption? Good thing there were CCTV cameras Destroying the truck drivers’ life to save some stupid politician kids/ family members was an easy way out oh my god, you are so edgy. So the security rescued their clients and left the truck drivers to die. Charge them with murder and send them to ja. If you don't have empathy you are not a human being fit for society. I heard of a new law being proposed where running away from crime scene is gonna be another offence. I wish these people be charged with that same crime. Also, death due to negligence. Video link? is this part of Bharat NCAP Agreed 💯 > Good thing there were CCTV cameras Still nothing will happen. USA arrested their former President. Here, even a low-level local gunda connected to local MLA can get away with murder. Rolls Royce belongs to Vikas Malu, owner of Kuber Group. He was in the car. He is also a suspect for the murder of Satish Kaushik as per his ex-wife. Here is an article with more details - Any idea who the occupants of the Rolls were? 20 car convoy with escorts, Rs. 12 crore RR Phantom etc point to some really big fish. The media is reporting the names as \"Tasbir and Divya\" but it very possible that this could be staged by PR agents. How do you know this? Hit and run is a crime in *many* countries. You can't just run lol. Quite a few reports pointing to a gent named Vikas Manu of Kuber group. [Kuber Group Owner Vikas Malu Occupant In Rolls Royce That Collided With Truck On Delhi-Mumbai Expressway](https://www.freepressjournal.in/india/kuber-group-owner-vikas-malu-occupant-in-rolls-royce-that-collided-with-truck-on-delhi-mumbai-expressway-report) Rolce are soooo heavy and hard to slow down.... Stupid cars Ye comment ko ucha paguchao Wtf, how on earth does he have so many RR He keeps ramming them into trucks so he needs extras. [https://www.ndtv.com/india-news/kuber-group-director-among-injured-in-high-speed-rolls-royce-crash-near-delhi-cop-4329674](https://www.ndtv.com/india-news/kuber-group-director-among-injured-in-high-speed-rolls-royce-crash-near-delhi-cop-4329674) They did say a “convoy” 🙊 Mr. Manu is just following the footsteps of sage Manu, who weote Manusmriti. Literally no one says that, what crack are you on Kuber group. Ranjnigandha wala cuthiya chala raha tha gadi Finally something that can destroy a rolls royce Best \"goli maro saalo ko\" Bechare ka collection kharab ho gaya hoga… Why is this asshole not arrested already? He was allegedly not driving the vehicle. He was a passenger. Currently in the hospital Ofcourse, he was not driving I just read that he succumbed to his injuries. I just read that he succumbed to his injuries. So did two people in the truck ☹️ New salman bhai? That’s the sentiment No it’s not lol tf no one thinks india is absolved of corruption cause ISRO did their thing That’s the sentiment. Nobody’s is saying this. Indians will be ready for another Amrit kaal soon Democrats arresting Republicans; Rahul Gandhi was arrested as well. Wake me when they arrest Hunter Biden, while in power. Unfortunately nothing will happen. They will wait for a few days for the smoke to clear. Pay the victims sone paltry sum and shut them up."
}