{
    "id": "1czhnky",
    "title": "Porsche case: No, the minor did not release a ‘rap video’. The media got it wrong",
    "url": "https://www.newslaundry.com/2024/05/24/porsche-case-no-the-minor-did-not-release-a-rap-video-the-media-got-it-wrong",
    "selftext": "Aur do BC sasta internet. Sab Saale Dank ke Ch0d3 hai. ",
    "flair": "Crime",
    "score": 107,
    "num_comments": 15,
    "created_utc": 1716546874.0,
    "convurl": "https://external-preview.redd.it/LhzWtaoG5Iy_Lbt0C7qem99V9AgUy_laFMY5eLQsZbM.jpg?auto=webp&s=9606269f0eee2a143c044efa4967f20df92b1dac",
    "comments": [
        "I just have nothing to say about the media coz they really have no credibility. But what the fish is wrong with people (content creators like this asswipe)?!",
        "What about rap video with respect to this case ?",
        "So this content creator made a dank rap video from the POV of the accused. I'm not going to tag or share the video here, but you can look it up. He calls it satirical but it is anything but satire.",
        "I hope strict action is taken against DKC",
        "The Pune Police Commissioner has said action will be taken but I really don't expect much from Pune police. It is run by a bunch of incompetent individuals.",
        "He was trying to get views.",
        "Haan toh dance reel banata. He hasn’t stopped after making the rap video. He continues to post edgy stories. \nThe case is getting murkier by the day. Already there are rumours being spread, why create more nonsense to trigger more chaos. \nAlso I don’t understand the mentality of the people following him, they keep supporting him and rooting for him. \nIt’s just hopeless. Humans have lost empathy. And common sense.",
        "Dank meme culture effect. It's cool to laugh at people's misery now. That's what created this psychopath of a rapper. Trying to milk this case to become famous. More such dank ke 14e will appear in the future.",
        "Dank meme culture effect. Due to watching dank reels, kiddos think it's cool to laugh at people's misery now. That's what created this psychopath of a rapper. Trying to milk this case to become famous. More such teenagers with a dank mindset may appear from now on",
        "Scratch a liberal classist bleed",
        "110% you will find these content creator sharing illegal porn videos (ifykyk) they console their own soul by being edgy",
        "Dark comedy transition from sarcasm to people thinking it's a community is weird af",
        "Is it a PR move ? Kyoki as an interested party never heard about the initial video but on social media hearing frequently that the son isn't that bad  coz he did not release a \"rap video\".  \n\nI don't know law but somebody, either the son or his dad need to held responsible for deaths that this dude's drunk driving caused.",
        "[https://www.reddit.com/r/IndianDankMemes/](https://www.reddit.com/r/IndianDankMemes/)\n\nThere you go, a literal community :)",
        "Trending things get you more views."
    ],
    "cleaned_text": "porsche case minor release rap video media got wrong aur bc sasta internet sab saale dank ke chd hai ",
    "cleaned_title": "porsche case minor release rap video media got wrong",
    "cleaned_selftext": "aur bc sasta internet sab saale dank ke chd hai",
    "cleaned_comments": "nothing say media coz really credibility fish wrong people content creators like asswipe rap video respect case content creator made dank rap video pov accused im going tag share video look calls satirical anything satire hope strict action taken dkc pune police commissioner said action taken really dont expect much pune police run bunch incompetent individuals trying get views haan toh dance reel banata hasnt stopped making rap video continues post edgy stories case getting murkier day already rumours spread create nonsense trigger chaos also dont understand mentality people following keep supporting rooting hopeless humans lost empathy common sense dank meme culture effect cool laugh peoples misery thats created psychopath rapper trying milk case become famous dank ke e appear future dank meme culture effect due watching dank reels kiddos think cool laugh peoples misery thats created psychopath rapper trying milk case become famous teenagers dank mindset may appear scratch liberal classist bleed find content creator sharing illegal porn videos ifykyk console soul edgy dark comedy transition sarcasm people thinking community weird af pr move kyoki interested party never heard initial video social media hearing frequently son isnt bad coz release rap video dont know law somebody either son dad need held responsible deaths dudes drunk driving caused httpswwwredditcomrindiandankmemeshttpswwwredditcomrindiandankmemes go literal community trending things get views",
    "light_cleaned_title": "Porsche case: No, the minor did not release a ‘rap video’. The media got it wrong",
    "light_cleaned_selftext": "Aur do BC sasta internet. Sab Saale Dank ke Ch0d3 hai.",
    "light_cleaned_comments": "I just have nothing to say about the media coz they really have no credibility. But what the fish is wrong with people (content creators like this asswipe)?! What about rap video with respect to this case ? So this content creator made a dank rap video from the POV of the accused. I'm not going to tag or share the video here, but you can look it up. He calls it satirical but it is anything but satire. I hope strict action is taken against DKC The Pune Police Commissioner has said action will be taken but I really don't expect much from Pune police. It is run by a bunch of incompetent individuals. He was trying to get views. Haan toh dance reel banata. He hasn’t stopped after making the rap video. He continues to post edgy stories. The case is getting murkier by the day. Already there are rumours being spread, why create more nonsense to trigger more chaos. Also I don’t understand the mentality of the people following him, they keep supporting him and rooting for him. It’s just hopeless. Humans have lost empathy. And common sense. Dank meme culture effect. It's cool to laugh at people's misery now. That's what created this psychopath of a rapper. Trying to milk this case to become famous. More such dank ke 14e will appear in the future. Dank meme culture effect. Due to watching dank reels, kiddos think it's cool to laugh at people's misery now. That's what created this psychopath of a rapper. Trying to milk this case to become famous. More such teenagers with a dank mindset may appear from now on Scratch a liberal classist bleed 110% you will find these content creator sharing illegal porn videos (ifykyk) they console their own soul by being edgy Dark comedy transition from sarcasm to people thinking it's a community is weird af Is it a PR move ? Kyoki as an interested party never heard about the initial video but on social media hearing frequently that the son isn't that bad coz he did not release a \"rap video\". I don't know law but somebody, either the son or his dad need to held responsible for deaths that this dude's drunk driving caused. [https://www.reddit.com/r/IndianDankMemes/](https://www.reddit.com/r/IndianDankMemes/) There you go, a literal community :) Trending things get you more views."
}