{
    "id": "tls7et",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/tls7et/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 12,
    "num_comments": 6,
    "created_utc": 1648085408,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "I am looking for a completely remote/semi-remote job. Here's my current set of skills and work experience:\n\n* Experience with monitoring tools SolarWinds and SCOM, and New Relic with basic troubleshooting in Windows and Linux machines. \n\n* Monitored and maintained network infrastructure through alert and incident management.\n\n* Have experience in change management and problem management.\n\n* Comfortably able to co-ordinate with clients and vendors while dealing with support tickets and flow management.\n\nI am a team player and have consistently been the top performer in my current organization. I try to learn as much as humanely possible everyday and currently in the process of learning AWS. Please DM me if you have any opportunities for me.",
        "Looking to get hired\r  \n\r  \nSkillset/experience: Technical writing, Content writing\r  \n\r  \nPortfolio: DM\r  \n\r  \nLocation: Any\r  \n\r  \nPreferred way of contacting you: DM",
        "Looking for job.\nExperience in Workfusion RPA development. Around 5 years work experience. \nLooking to enter product management roles. \nGraduated from top engineering college. Location preferred Pune/Mumbai/Bangalore."
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "looking completely remotesemiremote job heres current set skills work experience experience monitoring tools solarwinds scom new relic basic troubleshooting windows linux machines monitored maintained network infrastructure alert incident management experience change management problem management comfortably able coordinate clients vendors dealing support tickets flow management team player consistently top performer current organization try learn much humanely possible everyday currently process learning aws please dm opportunities looking get hired skillsetexperience technical writing content writing portfolio dm location preferred way contacting dm looking job experience workfusion rpa development around years work experience looking enter product management roles graduated top engineering college location preferred punemumbaibangalore",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "I am looking for a completely remote/semi-remote job. Here's my current set of skills and work experience: * Experience with monitoring tools SolarWinds and SCOM, and New Relic with basic troubleshooting in Windows and Linux machines. * Monitored and maintained network infrastructure through alert and incident management. * Have experience in change management and problem management. * Comfortably able to co-ordinate with clients and vendors while dealing with support tickets and flow management. I am a team player and have consistently been the top performer in my current organization. I try to learn as much as humanely possible everyday and currently in the process of learning AWS. Please DM me if you have any opportunities for me. Looking to get hired Skillset/experience: Technical writing, Content writing Portfolio: DM Location: Any Preferred way of contacting you: DM Looking for job. Experience in Workfusion RPA development. Around 5 years work experience. Looking to enter product management roles. Graduated from top engineering college. Location preferred Pune/Mumbai/Bangalore."
}