{
    "id": "12aqekp",
    "title": "Spitz and indie mix dog available for adoption",
    "url": "https://www.reddit.com/gallery/12aqekp",
    "selftext": "Hi Folks, \n\nThis is barfi. She is 2 years old. Unfortunately, the family who adopted her two years back are separating and can't take care of her anymore. She is extremely loving and cares for her humans. We are looking for kind family to accept her as their own. She has gone through a lot in her short life. \n\nLittle about her - Her mother is Spitz and himalayan dog mix. Her father was indie. She can eat pedigree/home cooked food. She is in delhi right now. But her adoption is open for anywhere across India or outside. \n\nShe had hundreds of takers as a puppy, I hope she would again find a loving home. After all, she has suffered enough without any fault of her own.\n\nLastly, even if you can't adopt her. Both barfi and I will thank you, if you could share this with friends/family looking for adoption.",
    "flair": "AskIndia",
    "score": 77,
    "num_comments": 14,
    "created_utc": 1680541033.0,
    "convurl": "https://i.redd.it/spq3e4wp9pra1.jpg",
    "comments": [
        "Adorable girl",
        "I really want to have a dog, but my parents are really against it.\n\nEdit: Sharing this with my friends. Best of luck to Barfi!",
        "I see doggo, I updoot.\n\nHope adorable Barfi finds her forever family soon!",
        "Thank you so much for helping her.",
        "Don't give biscuits with sugar. They cause skin and kidney problems in long run. You can feed rice or roti with milk instead.",
        "Barfi would love it if you can share this with your friends/family",
        "It's nothing. It's my pleasure to be able to contribute a little to a cute doggo like her.\nBTW, I really like her name, and I think it really matches her appearance and your description about her.",
        "Yes I named her. There were 3 siblings - barfi, gulaab and Jaamun. Jaamun (now Laddu), gulaab (now Pinni). Barfi remained Barfi only.",
        "https://preview.redd.it/54jp4xoktvra1.png?width=1080&format=pjpg&auto=webp&v=enabled&s=8c9a2ea2c696339fed4b7bd056b0d53d8e8eebb6",
        "Ahh... Soooo cute!",
        "You've got a nice aptitude for naming, it seems.\nI didn't like Barfi as a sweet, but now I'll definitely be trying it out this weekend, thanks to Barfi!",
        "But isn't milk also bad for dogs?"
    ],
    "cleaned_text": "spitz indie mix dog available adoption hi folks barfi years old unfortunately family adopted two years back separating cant take care anymore extremely loving cares humans looking kind family accept gone lot short life little mother spitz himalayan dog mix father indie eat pedigreehome cooked food delhi right adoption open anywhere across india outside hundreds takers puppy hope would find loving home suffered enough without fault lastly even cant adopt barfi thank could share friendsfamily looking adoption ",
    "cleaned_title": "spitz indie mix dog available adoption",
    "cleaned_selftext": "hi folks barfi years old unfortunately family adopted two years back separating cant take care anymore extremely loving cares humans looking kind family accept gone lot short life little mother spitz himalayan dog mix father indie eat pedigreehome cooked food delhi right adoption open anywhere across india outside hundreds takers puppy hope would find loving home suffered enough without fault lastly even cant adopt barfi thank could share friendsfamily looking adoption",
    "cleaned_comments": "adorable girl really want dog parents really edit sharing friends best luck barfi see doggo updoot hope adorable barfi finds forever family soon thank much helping dont give biscuits sugar cause skin kidney problems long run feed rice roti milk instead barfi would love share friendsfamily nothing pleasure able contribute little cute doggo like btw really like name think really matches appearance description yes named siblings barfi gulaab jaamun jaamun laddu gulaab pinni barfi remained barfi ahh soooo cute youve got nice aptitude naming seems didnt like barfi sweet ill definitely trying weekend thanks barfi isnt milk also bad dogs",
    "light_cleaned_title": "Spitz and indie mix dog available for adoption",
    "light_cleaned_selftext": "Hi Folks, This is barfi. She is 2 years old. Unfortunately, the family who adopted her two years back are separating and can't take care of her anymore. She is extremely loving and cares for her humans. We are looking for kind family to accept her as their own. She has gone through a lot in her short life. Little about her - Her mother is Spitz and himalayan dog mix. Her father was indie. She can eat pedigree/home cooked food. She is in delhi right now. But her adoption is open for anywhere across India or outside. She had hundreds of takers as a puppy, I hope she would again find a loving home. After all, she has suffered enough without any fault of her own. Lastly, even if you can't adopt her. Both barfi and I will thank you, if you could share this with friends/family looking for adoption.",
    "light_cleaned_comments": "Adorable girl I really want to have a dog, but my parents are really against it. Edit: Sharing this with my friends. Best of luck to Barfi! I see doggo, I updoot. Hope adorable Barfi finds her forever family soon! Thank you so much for helping her. Don't give biscuits with sugar. They cause skin and kidney problems in long run. You can feed rice or roti with milk instead. Barfi would love it if you can share this with your friends/family It's nothing. It's my pleasure to be able to contribute a little to a cute doggo like her. BTW, I really like her name, and I think it really matches her appearance and your description about her. Yes I named her. There were 3 siblings - barfi, gulaab and Jaamun. Jaamun (now Laddu), gulaab (now Pinni). Barfi remained Barfi only. Ahh... Soooo cute! You've got a nice aptitude for naming, it seems. I didn't like Barfi as a sweet, but now I'll definitely be trying it out this weekend, thanks to Barfi! But isn't milk also bad for dogs?"
}