{
    "id": "1fh4nxz",
    "title": "Airtel's Misleading \"Unlimited Data\" Claims and Unacceptable Customer Service",
    "url": "https://www.reddit.com/r/india/comments/1fh4nxz/airtels_misleading_unlimited_data_claims_and/",
    "selftext": "Hello everyone,  \nI hope you are well!  \n  \nAs a Visual Content Editor at Adobe, my job demands high-speed internet for downloading large image files and managing visual workflows. My brother, a college student, relies on a stable Wi-Fi connection for his assignments and interview prep, while my parents use it for streaming OTT content. With such diverse needs, I decided to switch to Airtel Broadband, expecting a seamless, high-speed internet experience.  \n  \nHowever, the reality was far from what was advertised. I quickly hit their 3333 GB data limit, after which my connection slowed down to a crawl. Neither the support agent who recommended the plan nor the technicians who installed it mentioned this limit. Even more infuriating, Airtel continues to advertise \"unlimited data,\" despite my complaints—I've been flagging this issue for almost a year now. Airtel has shown no intention of rectifying their misleading ads, and it feels like an intentional deception.  \n  \nFrustrated, I contacted Airtel customer support, hoping for a solution. But instead of assistance, I was met with rigid policies. Even though I offered to pay for extra data, they refused to accommodate me. I requested to cancel my Wi-Fi, but this opened a new chapter of frustration. I was forced to fill out a form, and when I explained that none of the provided cancellation reasons applied to me, I asked them to tick \"Other.\" They refused. I had to invent a reason—claiming I'd lost my job, moved to a village, and become a farmer—just to get through this absurd process.  \n  \nEven after this, they tried to sell me a downgrade to 40 Mbps instead of canceling the service. It took ten callbacks and conversations with multiple departments to finally start the cancellation process. To add to the chaos, the retention team informed me that I could buy \"smart bytes\" or extra data, something customer support had insisted didn’t exist. They said they will help me out and I will receive a follow up from the small I never received a follow-up, and when I contacted Airtel again, they acted as if the previous conversation had never happened. Even worse, I had to start the cancellation process all over again because the escalation team had canceled my initial request.  \n  \nIn the midst of this nightmare, an agent suggested I buy one more Wi-Fi connection in additional to the old one to get rid of this data limit nightmare, He suggested to buy the new AirFiber connection, claiming it would be faster. Reluctantly, I agreed. Due to my night shifts, I missed the installation, and to make matters worse, the technician failed to register my phone number properly, leaving me unable to access support via their app. The person responsible for the installation became unresponsive.  \n  \nInitially, the new AirFiber connection seemed fine. But after just ten days, I received another alert—this time, I had hit a 1024 GB data limit. Shocked, I realized that the AirFiber data cap was a third of what I had with the broadband service. Again, no one had explained this, and Airtel’s AirFiber-specific website conveniently lacked any mention of this limit. Their advertisements continued to claim \"unlimited data,\" just like with the broadband service.  \n  \nNavigating Airtel's customer support system felt like being trapped in a bureaucratic maze. Since my number wasn’t registered properly, the automated system would disconnect me every time I tried to use the registered number option. Using the new number option led to agents who refused to help, saying I needed to call using my registered number—knowing full well that wasn’t possible.  \n  \nWhen I finally reached an agent, they were dismissive, citing \"Airtel policy\" to dodge accountability. Attempts to escalate the issue were met with indifference, and some agents couldn’t even locate my account despite me providing the phone number and account ID. Requests to speak to a supervisor were denied with excuses like \"we're working from home.\" and \"if I can't help you, no one can\". I was put on hold for 15 minutes multiple times, only for the call to be dropped. Promised callbacks never came, and when one finally did, the agent’s voice was so muffled I couldn’t understand them. They grunted and hung up when I pointed it out.  \n  \nI asked the support agent that in the SMS I received from Airtel, \"smart bytes\" and \"data booster\" is mentioned so why couldn't they help me. They said they are currently in the testing phase, and I should ignore such SMS from them.  \n  \nSupport agents outright refused to create a complaint ticket and share their number so that I can track it, and I don't have to repeat myself, they there is no suck provisions. One time the agent the agent said they can't help me further as the actual team who could me was unavailable. He said I will get a call back, and the call never came. I’ve been left to call back, again and again, hoping to catch the right team during working hours. Every day is the same cycle: long holds, dropped calls, and the frustration of explaining my problem to a new agent each time, only to get vague promises.  \n  \nThis ordeal is not just exhausting—it's affecting my sleep, my work as a Content Editor, and my brother's job search. Airtel’s unethical tactics feel like an intentional effort to avoid accountability. I’m left desperate for a resolution, wondering how a company can get away with such deliberate deception and incompetence.\n\nYou can help my retweeting the following:  \n[https://x.com/varunswarup0/status/1835024838487871555](https://x.com/varunswarup0/status/1835024838487871555) \n\n  \nRegards,  \nVarun",
    "flair": "Rant / Vent",
    "score": 149,
    "num_comments": 84,
    "created_utc": 1726375658.0,
    "convurl": "https://external-preview.redd.it/0xoDXoQ7G-Z5jcB_5RIptf3fUZ_sCs7eKuPshbF_70o.jpg?auto=webp&s=99019bf387f54714b7a4cfc991126d11a4c2095d",
    "comments": [
        "The 3.3 TB limit has been there always and since most users don't reach that limit it is often ignored. Beyond that Airtel assumes is commercial usage, so the best path to take is to take their business fiber plans which offer 10TB / month at almost same price range. It comes with free static IP as well and doesn't have the free ott stuff which is bundled with regular fiber. Airfiber is a downgrade and should be avoided if you have fiber feasibility in your area. \n\nOther option is to take a second fiber from a provider like jio ( also comes with 3.3TB) to complement your existing fiber and bond with your Airtel line. This adds redundancy as well as the bandwidth you desire. \n\nFor matters beyond call center, they would advise you to send an email which will be taken up by the backend team.\n\nTldr: convert to business fiber, cancel airfiber and consider additional fiber with another provider",
        "First mistake was going for Airtel. Second mistake was going for Airtel again",
        "3 TB looks like a business use case, switch to a business plan. For reference 1080p streaming for 12hrs a day every day takes 3TBa month.",
        "Customer care agents won’t be able to help/will dodge anything that is not in their capacity. \n\nWhen you face issues like incorrect number being paired with your Internet connection or being downgraded wrt bandwidth limit, directly contact nodal officer. Dont even bother with grievance officer who is below nodal officer since I found no difference between them and customer support agents.",
        "Bruh.. you used the bandwidth for your office use and now complaining its not unlimited?. Their T&C clearly mentions fair usage limit which you didnt spend time and read.\n\nAsk your office to sponsor business line plan for your home which they would likely deny and ask you to come to office or buy another broadband and consider it your cost and time of travel saved against it.\n\nUsers like you put a lot of stress on the consumer lines which results in poor network quality for others users connected in your junction box.",
        "Go for a business plan. The 3.3 TB is a fairly “unlimited” limit. Post that they throttle the speeds so technically it’s unlimited.",
        "Yes. 12 hours of day streaming is not normal",
        "All ISPs have something called FUP (Fair Usage Policy) after which data would be throttled to a crawl. So technically it's unlimited, albeit at a much lower speed. It is your duty to read the offer document carefully and make an educated decision. When you leave it to the salesman, they'll say anything and everything to make the sale happen. \n\nThis aside, Airtel and Reliance will ensure continued headaches. Look for a local internet provider, there will always be a few in any given populous locality. It is much easier to deal with them.",
        "Yeah man, of course I am the one hurting other consumers. capitalism has rotten your brain and it is showing",
        "I have my TV running in the background for like 10 hours a day while I just do whatever. I work, cook, eat and other stuff and the TV is just background noise for me.",
        "What did you use before opting for Airtel Fiber? Because every ftth-provider have similar plans and the speed-throttling at 3TB is everywhere. \n\nYou probably didn’t read the plans or ads properly before getting it set up. \n\nAs others have mentioned there are higher plans  which have higher data usage available as well as their throttled-speeds are higher so it may suit your use-case.",
        "Airtel is a super stable internet provider, what are you on about?",
        "Buddy. Fair usage policy is everywhere.. Not just airtel.. I agree the 3.3tb limit sucks but it's super hard to hit that much unless you're downloading (and uploading) crazy sized files all the time. Maybe get a second connection?",
        "Stability varies from region to region so there's no one stable player.",
        "That's true. I concede.",
        "Airtel cancellation system sucks ass they just want you too hooked own it took my 1 week of back and forth calls to cancel my potty 50 mbps connection.",
        "Don't blame airtel for your ignorance. FUP applies everywhere. Want commercial usage buy commercial plans.",
        "Usually the limit is so high that it doesn’t affect people but you seriously can’t expect to give you 3TB data for free. As others already said, it falls into commercial usage category.",
        "It's called a Fair Usage Policy for a reason. \n\nFair usage means they are giving you this plan for cheap because you'll use it for home where the load is not too demanding.\n\nIf you're using it for work and the FUP is not enough, you should buy a business connection.",
        "Get one of the local internet providers, they usually have no data caps or even if they do can easily be overridden with extra fees. They’re usually cheaper as well and always a call away, unlike the corporate internet providers. \n\nFunnily enough, the one I use actually connects to the Tata Fibre node down the line (as per speed tests) but doesn’t come with any of the polices Tata Fibre has.",
        "+1\n\nI have 2 internet connection at my home \n1 is local which is main and another is airtel\n\nLocal one is 1gbps with static ip and connected to my dual wan router\n\nAnd airtel is 500mbps for backup and other things in the house\n\nAs i also download and upload many files for my work i also reach the limit within 2-3 months my local connection people allows me to do this as i purchased full year plan with them and also been customer with them for 10 yrs so they have also setup seperate line for me in building on request\n\nHowever airtel is pain in the ass but its good for backup i ternet and other people in house",
        "Streaming platforms compress much more aggressively, you won't hit 3tb anyway with only 10hrs streaming.",
        "I've this same problem once. Apparently that's a trai regulations. Only way to bypass it is to have 2 domestic connections or commercial connection. \n\n\nSecondly you can't get any add on once this limit is crossed",
        "That's what I figured. I think my monthly limit is unlimited but I get speeds of like 500 Mbps. I was told that if I use a certain amount of data then my speed would go down. I've never had that happen.",
        "So let me get this right, you got affected by the Data cap policy on your existing connection and then you got a second connection without finding out about the data cap.",
        "varun i think it is time to remove the twitter rant. you can't expect business use in a residential plan. if jio 5g speed is good in your area you can opt for a 2gb/day plan or above and you can get unlimited 5g(3.3tb). allocate the jio net to your parents streaming and your brother this is the best and cheapest option currently in the market",
        "Your usage is commercial so opt for a commercial plan with higher data cap",
        "Such idiotic posts here. Are you aware of FUP? Even a kid knows that there is a 3.3TB limit.",
        "Different people have different use cases, and 3.3tb limit is stupid. I paid a good amount to a different isp with 1gbps and they still have this stupid rule.\n\nVideo games are massive with around 100-200gb. 4k streaming can easily consume your data fast. Some people also go for a home media server like Plex/Jellyfin to host their content which means a lot of uploaded data.\n\nDon't assume just because you cannot consume 3.3tb within a month, that it's only needed for office use.",
        "Bro, stop watching too much porn. /s",
        "Everyone has a 3.3Tb limit for home usage across spectrum ​\n​",
        "If it's youtube 1080p it's never gonna hit the limit",
        "4k streaming consumes 7gb per hour even if you consumes it daily for 12 hours it would still be less than 3.3 tb. you have only bought a recharge from the isp provider not bought the whole company. if there is no fup other users will suffer. who is stopping you from buying a commercial line then.",
        "Mixture of YouTube on 1440p when possible but it's mostly on 1080p(but it says higher bitrate not sure how that affects it), peacock and sometimes Max.",
        "What if you're using multiple devices? Should be much easier to hit that limit right?",
        "Uses a non commercial plan for commercial purpose and gets shocked when they can't lmao. Either opt for business fiber plans for your work use and keep the existing one for personal use of ur family. OR buy two fiber non commercial fiber plans( which doesn't seem to work for u).",
        "3TB is definitely not a single use case ...",
        "Plex server is pretty much commercial use.\n\nI get that you might hit 3tb some month, I really really doubt you can hit it every month.",
        "I doubt they will give 3+TB either...",
        "There is a virtual duopoly. We gotta deal with it.",
        "This is something 15 year old me noticed when Airtel introduced Airtel Xstream fiber in 2019 \nI read there Terms and conditions and found out about that 3.3tb limit \n\nSince then whenever Airtel introduces a new product which I’m interested in \nI always read the terms and conditions \n\nAirtel 5G : says unlimited data but it’s actually only 300GB \n\nAirtel Airfiber : says unlimited data but its actually only 1TB Data",
        "The company adobe that you are working and spending 8 or more hours every day is also capitalistic.\n\nIf you hate capitalism that much, Why dont you stop working for adobe?",
        "Batwara karlo bhai se. Uss bechare ko dusra connection dilwa ke uska bhavishya bacha lo",
        "Works for Adobe…Doesn’t read FUP…experiences “adobe like” customer service at AirTel…complains. \n\nBlames capitalism?!🤣\n\nGotta say Adobe IN got a good hire to keep fuckin up their business model.",
        ">Airtel 5G : says unlimited data but it’s actually only 300GB \n\nYeah so I didn't know this and I suffered lol . I'm ported to jio now .",
        "Im using Airtel Airfiber and that 1Tb limit gives anxiety lol",
        "Don't worry it wouldn't hit that limit unless you are pirating movies and watching all day and night.",
        "Adobe is one of the most scum companies.",
        "Try corporate plan. I think the plan you have currently wouldn't suit your needs.",
        "OP what is your daily workflow like? Because for me the 3.3TB limit seems unattainable by my 100mbps connection.\n\n\nAlso fup does make the connection unlimited it's just that the speeds are reduced to archaic levels",
        "1) I fully agree with you on their customer care aspect.  It’s a pain now.  Because of my own wifi issues I ported out my Airtel mobile to tell them I don’t like this.  Next bad experience will be to disconnect wifi itself.  I have paid advance rental for six months hence the hesitancy to disconnect right now. \n\n2) data plans come with data usage policy.  It is old practice.  Again wrong on Airtel’s part not to share this with you as on website or pamphlets it is written with asterisks.  \n\n3) call Center executives are ill trained, hence banking on them is not the best option always.  \n\nI will not advice Jio due to customer care issues.   It is even more bad.  Product experience I do not know.",
        "Lol, since when did network resources include fucking number of bytes transmitted?\n\nDo you really think a user that has spent 3tb and is going to stream a video puts “more load” than a new user thats going to stream the same video?",
        "Why does this feel like it was written by ChatGPT? No one actually talks/writes like this",
        "3.3TB is the limit  for most providers. You need business internet plans for higher data usage. You can though buy a Cisco router and have two ISPs serving your traffic.",
        "Sir, please understand each and every packet has to be transmitted with a small amount of processing which involves parsing the header of the packet to identify the IP address, also perform DNS resolution by touch basing with the DNS name servers, sending and receiving acknowledgements based on the UDP/TCP protocols used and pass on the DNS resolution results, acknowledgements, etc back to the device sending the request.\n\nTherefore yes, someone consuming 3.3TB of data in less than a month definitely puts stress on the junction box where his ethernet line is connected. Upto 8 users share the same junction box and more sometimes.\nOthers users connected to the same junction box will have poor quality internet if one user is constantly loading it",
        "Rant alert (tl;dr at bottom):\n\nFacing similar issues with Airtel Payments Bank. Got Fastag for our VW Polo when it was introduced first. Later we got a Creta and started using that for long trips and malls. Due to this, Polo's Fastag remained dormant for around 2 yrs (not including COVID yr). Then, when we went to a mall that had Fastag parking payment system, payment failed. That is when I found out it had been blacklisted and the wallet linked to it was blocked.\n\nWhen we contacted their customer care(CC, 400 dedicated line for Airtel Payments Bank), they cited the reason that since both wallet and Fastag were dormant for >1yr, it was automatically blocked by their system. They asked us to send 3 documents: a letter requesting reactivation of wallet and unblocking of Fastag, and self attested copies of Aadhar and DL. We sent all three over mail and received confirmation mail stating case registered with case number. It also stated that they will send an update mail in 3 days. We waited 1 week to no mail. So called them back and they say that they are unable to open and view the documents (sent as pdf). So we resent them as jpg files over mail and also registered a case through the app. Received their same mail with case no. and asking to wait 3 days for update. No update again. You can see a pattern here. \n\nWe called them again after a week and they said that they are working on it. No mail again. Called again (I'm the one having to spend time calling them every week) and they said biometrics are expired and had to reauthenticate through their \"Banking Point\". First visited Airtel office near us, they said they don't do Banking. Was redirected to other points on their app. Called every single one near us and none of them had either the finger print machine or understood what we were saying. Spent more than 6 hrs just that day for this. Fed up, called them again and this time asked to be escalated to higher authority. They said biometrics wasn't needed. This enraged us. This person said that documents were enough and he will personally see that the case would be resolved. Again got a mail with new case number on 26/8/24.\n\nThis time, my mom, whose name and phone number was on car RC and Fastag, had to travel abroad. She gave me her mail login to follow up on this and left. There was no mail again. Had to wait 12 days for her to return. Once she returned, called them again (yesterday, 14/09/2024) and asked to be escalated as the tier 1 CC was incompetent to say the least and seemed to only be reading of a script. Tier 2 CC was better as they had better knowledge on the topic. This time, they said that there is a mismatch between documents given during registration(\\~2015) and docs given now. When asked what the mismatch was, he had no idea and kept repeating that it was a mismatch. After some back and forth, he said there is mismatch in DL. Then again, he said he did not know where the mismatch was. Tried to make him understand that DL was renewed 5 yrs ago(2019) and DL number was same, to no avail. He asked us to go to RTO and get DL renewal confirmation slip (does it even exist??), but we said \"No, we can't go to RTO and get some unknown slip by spending time on a weekday. You know about the state of RTOs in our city.\" He said that it was bank policy to get the slip and he can't do anything without it. We did not budge. Told him to send the policy over mail. He gave excuses saying that it can only be sent by \"mail dept\" and he had no power to. He said we can send a mail asking for policy. \n\nWe then asked him why we weren't updated about these issues over mail when it arose. He said that mail was sent, but we didn't get any. Asked him the date when it was sent, and he said 21/8/24. This led to a kind of quarrel with us telling that the case was raised only on 26/8 after talking to one of your guys, how are you telling us this issue rose on 21/8. We didn't want to deal with him as he too did not understand us. Asked him to escalate higher to tier 3 CC. \n\nThis was the floor manager. He was able to understand the issue and said that he can work with the existing license given that we provide him with a letter stating that the license was renewed. I sent this yesterday night and now waiting for \"update\". But this time he provided us with his name. He asked us to tell his name and we will be redirected to him directly.\n\nThis goes to show how bad their system is. With no physical bank, there is no one to be questioned directly. If there had been a physical bank, the problem could have been solved long time ago. Making everything digital is not the solution. The best would be a hybrid system. Planning to move to Consumer Court if this also does not work out.\n\nYou might ask why not move to a different provider. I simply can't as VIN is linked to Airtel and other banks cannot register the VIN in their system.\n\nIf you made it this far props to you for reading.\n\ntl;dr: Airtel blocked wallet and Fastag. Unbearable back and forth with customer care call center for more than a month to no avail. Looking at consumer court as option if it doesn't work out. Can't move to new provider till Airtel unlinks car from their Fastag.",
        "OP for the unlimited part mostly people agree with you. But FUP is something which has been there since the unlimited plans started and it’s applicable to everyone, so get the FUP details the next time you take up any plan.\n\nAs others have pointed out since your case demands a high consumption of data, you are better to discuss a custom plan if they offer one or check if they have a postpaid plan if it aligns towards your budget. \n\nLastly a local ISP’s customer support may be worth a shot but there service availability might not always be up to the mark, but they will prioritise you.\n\nAnyway the lesson would be to not fall for marketing or salesperson blindly, do some fact check before you take up any advice.",
        "This unlocked a memory: back in school, I remember hitting this limit while downloading terabytes of AI training data. They nevef found out it was me. Fun times.",
        "This is not a problem for fiber, it used to be an issue back when we had coaxial and copper cables, and one of the reasons being internet working flawlessly at night, and worse during the day.\n\nPlus the fiber network nowadays is more robust and capable of handling extremely high network load.\n\nand all the above processes you mentioned are not performed by the network equipment, there are dedicated servers for that, DNS as a name server that you already mentioned. The network equipment just carries the network, and doesn't decapsulate the whole packet, just the first 2-3 layers depending on whether it's a switch, a router or a junction box.",
        "Fiber network may be better but the network equipments are not. They are prone to heating and port hanging issues. There is no QoS implemented in such junction box which the last mile connectivity",
        "Do you think ISPs have a tank of bytes that you use up while using internet?\n\nWhat makes you think that someone using a set number of bytes makes any difference on the processing required for the packets?\n\n> Therefore yes, someone consuming 3.3TB of data in less than a month definitely puts stress on the junction box where his ethernet line is connected. Upto 8 users share the same junction box and more sometimes. Others users connected to the same junction box will have poor quality internet if one user is constantly loading it\n\nLeaving aside the fact that the junction bus is just a switch and hence your whole understanding of it is wrong, the keyword here is “sharing”. It literally doesn’t matter if the user sharing the network has used 5TB or 100TB or is a completely new user, the bandwidth is getting split across both of them, and the speed will drop. Guess what, the ISP already tells you this with the “up to xyz” speed condition. The usage cap is simply the ISP double dipping, without actually doing anything.",
        "You are indirectly stating all of us can have no cap unlimited internet at 1Gbps speeds?",
        "Yes. Data caps don’t affect your speeds, only how many concurrent users are active at a time.\n\nDon’t believe me? Go check literally any network appliance, and tell me if you find any that limit the total number of bytes processed.",
        "Cancelling an airtel fibre connection is a nightmare. I actually shifted jobs and moved out, so made a request for cancellation. The service agent who installed the modem, came and took it  back. But for the next 8 months i kept on getting calls from Airtel (different numbers each time) asking me to return it and asking why i cancelled the connection. It was a mess. Finally i  had my lawyer cousin send them a simple notice and it stopped.",
        "Guy saying this who works for Adobe. A company who charges their customer for cancelling their subscription.",
        "> Airtel 5G : says unlimited data but it’s actually only 300GB\n> \n> Airtel Airfiber : says unlimited data but its actually only 1TB Data\n\nHere, I'll fix it for you:\n\nAirtel 5G : says unlimited data but it’s actually only *the first* 300GB *at high speed*, the rest is slower than dial-up\n\nAirtel Airfiber : says unlimited data but its actually only *the first* 1TB Data *at high speed*, the rest is slower than dial-up",
        "Actually you did. You are working with Adobe which bought Macromedia which created flash. There were people earning for making flash games.\n\nAdobe after buying flash, didn't put enough attention to address the bugs and the project was abandoned. These people, their livelihoods.... They were robbed off from it. \n\nYou are working for the same giant. You are a big part of the capitalist system.",
        "Fooled you once, shame on Airtel. Fooled you twice, shame on you.",
        "> They are prone to heating and port hanging issues.\n\nBoth of which are caused by high number of concurrent users, not how many TB any one user downloads.",
        "It’s a topology thing, not a copper/fiber thing. Copper simply has lower range than fiber, but within its range it can handle the bandwidth required back in those days.",
        "Bruh you have gotten wrong info in your head it's not unlimited it's fair usage policy.",
        "If you are a visual content editor doing corporate stuff, then you got to opt for a corporate plan. 3333 GB is massive for a residential connection, and it's an extremely reasonable FUP limit. You don't want people running bitcoin mining operations from their bedroom, do you.\n\nI don't know if ISPs actually provide corporate plans to residential customers though. So, ask help from your company in getting this.",
        "high number of concurrent users vs one user making multiple requests is the same from a load perspective. The OP is not only consuming video streams, he has bulk upload and download of large files. Quote from the post: **my job demands high-speed internet for downloading large image files and managing visual workflows**\n\nHome broadband is meant for normal WFH and home use scenarios. If such high bandwidth requirements are there, business line/ leased line should be obtained.\n\n  \nThe way you are putting forth your requirements, seems like any user can download any amount of data and there will be no load on the systems. By that logic, you are implying that there is unlimited capacity available in the networking equipment which is not the right understanding. \n\n  \nPlease watch Perfology youtube channel on how hotstar has scaled up their systems during the india cricket matches, etc. You will understand that the amount of watch that tune in to the streams is consuming a large portion of the entire bandwidth available to India through the undersea cables.",
        "> high number of concurrent users vs one user making multiple requests is the same from a load perspective. \n\nYes, the load being “bandwidth”, not total number of bytes. They’re not the same thing.\n\nLike I’ve asked you to do in the other comment, have you found any network appliance that measures its performance or limits in total number of bytes processed?\n\n> Home broadband is meant for normal WFH and home use scenarios. If such high bandwidth requirements are there, business line/ leased line should be obtained.\n\nLike I already said, this is a distinction without any technical merit. ISPs will already happily throttle bandwidth if there are many concurrent users for home connections, which is the actual “load” that matters. You’re just helping the company to double dip by parroting their excuse.\n\n> Please watch Perfology youtube channel on how hotstar has scaled up their systems during the india cricket matches, etc. You will understand that the amount of watch that tune in to the streams is consuming a large portion of the entire bandwidth available to India through the undersea cables.\n\nAnd? Which undersea cable restricts total number of bytes consumed that you think this counts as refuting of my argument?\n\nI think you’ve already missed what the issue is all about. We’re talking about being punished for how much data OP has consumed in total, he’s not complaining that he’s not getting constant 1gbps with 99.99% uptime SLA.",
        "By your argument, OP got treated fairly. His agreed plan speed for the most part and throttled speed of 64Kbps after he exhausted the bandwidth. You are saying you own the bandwidth and not the amount of data that passes through which does not sound right to me. Every byte of data transmitted be it at 1Gbps or at 64Kbps matters. If its at 1Gbps, more packets will be let through causing network congestion.",
        "> By your argument, OP got treated fairly. His agreed plan speed for the most part and throttled speed of 64Kbps after he exhausted the bandwidth. \n\nDo you know what bandwidth means?\n\n> which does not sound right to me. \n\nDon’t fall for marketing nonsense then. Go install opnsense on a vm and check what parameters affect system usage.\n\n> Every byte of data transmitted be it at 1Gbps or at 64Kbps matters. If its at 1Gbps, more packets will be let through causing network congestion.\n\nAnd as already mentioned multiple times now, that congestion will keep happening regardless of the concurrent users having used 1000TB or completely new users.\n\nPlease look up the definition of bandwidth. There’s no component of “bytes consumed in total” in there.",
        "stop calling cc.  email to nodal officer and appellate authority. u will get call back from saner people and follow back on email with gist of your every call. it helped me to close my airtal wifi connection. CC won't listen. Once u contact Nodal everybody will listen."
    ],
    "cleaned_text": "airtels misleading unlimited data claims unacceptable customer service hello everyone hope well visual content editor adobe job demands highspeed internet downloading large image files managing visual workflows brother college student relies stable wifi connection assignments interview prep parents use streaming ott content diverse needs decided switch airtel broadband expecting seamless highspeed internet experience however reality far advertised quickly hit gb data limit connection slowed crawl neither support agent recommended plan technicians installed mentioned limit even infuriating airtel continues advertise unlimited data despite complaintsive flagging issue almost year airtel shown intention rectifying misleading ads feels like intentional deception frustrated contacted airtel customer support hoping solution instead assistance met rigid policies even though offered pay extra data refused accommodate requested cancel wifi opened new chapter frustration forced fill form explained none provided cancellation reasons applied asked tick refused invent reasonclaiming id lost job moved village become farmerjust get absurd process even tried sell downgrade mbps instead canceling service took ten callbacks conversations multiple departments finally start cancellation process add chaos retention team informed could buy smart bytes extra data something customer support insisted didnt exist said help receive follow small never received followup contacted airtel acted previous conversation never happened even worse start cancellation process escalation team canceled initial request midst nightmare agent suggested buy one wifi connection additional old one get rid data limit nightmare suggested buy new airfiber connection claiming would faster reluctantly agreed due night shifts missed installation make matters worse technician failed register phone number properly leaving unable access support via app person responsible installation became unresponsive initially new airfiber connection seemed fine ten days received another alertthis time hit gb data limit shocked realized airfiber data cap third broadband service one explained airtels airfiberspecific website conveniently lacked mention limit advertisements continued claim unlimited data like broadband service navigating airtels customer support system felt like trapped bureaucratic maze since number wasnt registered properly automated system would disconnect every time tried use registered number option using new number option led agents refused help saying needed call using registered numberknowing full well wasnt possible finally reached agent dismissive citing airtel policy dodge accountability attempts escalate issue met indifference agents couldnt even locate account despite providing phone number account id requests speak supervisor denied excuses like working home cant help one put hold minutes multiple times call dropped promised callbacks never came one finally agents voice muffled couldnt understand grunted hung pointed asked support agent sms received airtel smart bytes data booster mentioned couldnt help said currently testing phase ignore sms support agents outright refused create complaint ticket share number track dont repeat suck provisions one time agent agent said cant help actual team could unavailable said get call back call never came ive left call back hoping catch right team working hours every day cycle long holds dropped calls frustration explaining problem new agent time get vague promises ordeal exhaustingits affecting sleep work content editor brothers job search airtels unethical tactics feel like intentional effort avoid accountability im left desperate resolution wondering company get away deliberate deception incompetence help retweeting following httpsxcomvarunswarupstatushttpsxcomvarunswarupstatus regards varun ",
    "cleaned_title": "airtels misleading unlimited data claims unacceptable customer service",
    "cleaned_selftext": "hello everyone hope well visual content editor adobe job demands highspeed internet downloading large image files managing visual workflows brother college student relies stable wifi connection assignments interview prep parents use streaming ott content diverse needs decided switch airtel broadband expecting seamless highspeed internet experience however reality far advertised quickly hit gb data limit connection slowed crawl neither support agent recommended plan technicians installed mentioned limit even infuriating airtel continues advertise unlimited data despite complaintsive flagging issue almost year airtel shown intention rectifying misleading ads feels like intentional deception frustrated contacted airtel customer support hoping solution instead assistance met rigid policies even though offered pay extra data refused accommodate requested cancel wifi opened new chapter frustration forced fill form explained none provided cancellation reasons applied asked tick refused invent reasonclaiming id lost job moved village become farmerjust get absurd process even tried sell downgrade mbps instead canceling service took ten callbacks conversations multiple departments finally start cancellation process add chaos retention team informed could buy smart bytes extra data something customer support insisted didnt exist said help receive follow small never received followup contacted airtel acted previous conversation never happened even worse start cancellation process escalation team canceled initial request midst nightmare agent suggested buy one wifi connection additional old one get rid data limit nightmare suggested buy new airfiber connection claiming would faster reluctantly agreed due night shifts missed installation make matters worse technician failed register phone number properly leaving unable access support via app person responsible installation became unresponsive initially new airfiber connection seemed fine ten days received another alertthis time hit gb data limit shocked realized airfiber data cap third broadband service one explained airtels airfiberspecific website conveniently lacked mention limit advertisements continued claim unlimited data like broadband service navigating airtels customer support system felt like trapped bureaucratic maze since number wasnt registered properly automated system would disconnect every time tried use registered number option using new number option led agents refused help saying needed call using registered numberknowing full well wasnt possible finally reached agent dismissive citing airtel policy dodge accountability attempts escalate issue met indifference agents couldnt even locate account despite providing phone number account id requests speak supervisor denied excuses like working home cant help one put hold minutes multiple times call dropped promised callbacks never came one finally agents voice muffled couldnt understand grunted hung pointed asked support agent sms received airtel smart bytes data booster mentioned couldnt help said currently testing phase ignore sms support agents outright refused create complaint ticket share number track dont repeat suck provisions one time agent agent said cant help actual team could unavailable said get call back call never came ive left call back hoping catch right team working hours every day cycle long holds dropped calls frustration explaining problem new agent time get vague promises ordeal exhaustingits affecting sleep work content editor brothers job search airtels unethical tactics feel like intentional effort avoid accountability im left desperate resolution wondering company get away deliberate deception incompetence help retweeting following httpsxcomvarunswarupstatushttpsxcomvarunswarupstatus regards varun",
    "cleaned_comments": "tb limit always since users dont reach limit often ignored beyond airtel assumes commercial usage best path take take business fiber plans offer tb month almost price range comes free static ip well doesnt free ott stuff bundled regular fiber airfiber downgrade avoided fiber feasibility area option take second fiber provider like jio also comes tb complement existing fiber bond airtel line adds redundancy well bandwidth desire matters beyond call center would advise send email taken backend team tldr convert business fiber cancel airfiber consider additional fiber another provider first mistake going airtel second mistake going airtel tb looks like business use case switch business plan reference p streaming hrs day every day takes tba month customer care agents wont able helpwill dodge anything capacity face issues like incorrect number paired internet connection downgraded wrt bandwidth limit directly contact nodal officer dont even bother grievance officer nodal officer since found difference customer support agents bruh used bandwidth office use complaining unlimited tc clearly mentions fair usage limit didnt spend time read ask office sponsor business line plan home would likely deny ask come office buy another broadband consider cost time travel saved users like put lot stress consumer lines results poor network quality others users connected junction box go business plan tb fairly unlimited limit post throttle speeds technically unlimited yes hours day streaming normal isps something called fup fair usage policy data would throttled crawl technically unlimited albeit much lower speed duty read offer document carefully make educated decision leave salesman theyll say anything everything make sale happen aside airtel reliance ensure continued headaches look local internet provider always given populous locality much easier deal yeah man course one hurting consumers capitalism rotten brain showing tv running background like hours day whatever work cook eat stuff tv background noise use opting airtel fiber every ftthprovider similar plans speedthrottling tb everywhere probably didnt read plans ads properly getting set others mentioned higher plans higher data usage available well throttledspeeds higher may suit usecase airtel super stable internet provider buddy fair usage policy everywhere airtel agree tb limit sucks super hard hit much unless youre downloading uploading crazy sized files time maybe get second connection stability varies region region theres one stable player thats true concede airtel cancellation system sucks ass want hooked took week back forth calls cancel potty mbps connection dont blame airtel ignorance fup applies everywhere want commercial usage buy commercial plans usually limit high doesnt affect people seriously cant expect give tb data free others already said falls commercial usage category called fair usage policy reason fair usage means giving plan cheap youll use home load demanding youre using work fup enough buy business connection get one local internet providers usually data caps even easily overridden extra fees theyre usually cheaper well always call away unlike corporate internet providers funnily enough one use actually connects tata fibre node line per speed tests doesnt come polices tata fibre internet connection home local main another airtel local one gbps static ip connected dual wan router airtel mbps backup things house also download upload many files work also reach limit within months local connection people allows purchased full year plan also customer yrs also setup seperate line building request however airtel pain ass good backup ternet people house streaming platforms compress much aggressively wont hit tb anyway hrs streaming ive problem apparently thats trai regulations way bypass domestic connections commercial connection secondly cant get add limit crossed thats figured think monthly limit unlimited get speeds like mbps told use certain amount data speed would go ive never happen let get right got affected data cap policy existing connection got second connection without finding data cap varun think time remove twitter rant cant expect business use residential plan jio g speed good area opt gbday plan get unlimited gtb allocate jio net parents streaming brother best cheapest option currently market usage commercial opt commercial plan higher data cap idiotic posts aware fup even kid knows tb limit different people different use cases tb limit stupid paid good amount different isp gbps still stupid rule video games massive around gb k streaming easily consume data fast people also go home media server like plexjellyfin host content means lot uploaded data dont assume consume tb within month needed office use bro stop watching much porn everyone tb limit home usage across spectrum youtube p never gon na hit limit k streaming consumes gb per hour even consumes daily hours would still less tb bought recharge isp provider bought whole company fup users suffer stopping buying commercial line mixture youtube p possible mostly pbut says higher bitrate sure affects peacock sometimes max youre using multiple devices much easier hit limit right uses non commercial plan commercial purpose gets shocked cant lmao either opt business fiber plans work use keep existing one personal use ur family buy two fiber non commercial fiber plans doesnt seem work u tb definitely single use case plex server pretty much commercial use get might hit tb month really really doubt hit every month doubt give tb either virtual duopoly got ta deal something year old noticed airtel introduced airtel xstream fiber read terms conditions found tb limit since whenever airtel introduces new product im interested always read terms conditions airtel g says unlimited data actually gb airtel airfiber says unlimited data actually tb data company adobe working spending hours every day also capitalistic hate capitalism much dont stop working adobe batwara karlo bhai se uss bechare ko dusra connection dilwa ke uska bhavishya bacha lo works adobedoesnt read fupexperiences adobe like customer service airtelcomplains blames capitalism got ta say adobe got good hire keep fuckin business model airtel g says unlimited data actually gb yeah didnt know suffered lol im ported jio im using airtel airfiber tb limit gives anxiety lol dont worry wouldnt hit limit unless pirating movies watching day night adobe one scum companies try corporate plan think plan currently wouldnt suit needs op daily workflow like tb limit seems unattainable mbps connection also fup make connection unlimited speeds reduced archaic levels fully agree customer care aspect pain wifi issues ported airtel mobile tell dont like next bad experience disconnect wifi paid advance rental six months hence hesitancy disconnect right data plans come data usage policy old practice wrong airtels part share website pamphlets written asterisks call center executives ill trained hence banking best option always advice jio due customer care issues even bad product experience know lol since network resources include fucking number bytes transmitted really think user spent tb going stream video puts load new user thats going stream video feel like written chatgpt one actually talkswrites like tb limit providers need business internet plans higher data usage though buy cisco router two isps serving traffic sir please understand every packet transmitted small amount processing involves parsing header packet identify ip address also perform dns resolution touch basing dns name servers sending receiving acknowledgements based udptcp protocols used pass dns resolution results acknowledgements etc back device sending request therefore yes someone consuming tb data less month definitely puts stress junction box ethernet line connected upto users share junction box sometimes others users connected junction box poor quality internet one user constantly loading rant alert tldr bottom facing similar issues airtel payments bank got fastag vw polo introduced first later got creta started using long trips malls due polos fastag remained dormant around yrs including covid yr went mall fastag parking payment system payment failed found blacklisted wallet linked blocked contacted customer carecc dedicated line airtel payments bank cited reason since wallet fastag dormant yr automatically blocked system asked us send documents letter requesting reactivation wallet unblocking fastag self attested copies aadhar dl sent three mail received confirmation mail stating case registered case number also stated send update mail days waited week mail called back say unable open view documents sent pdf resent jpg files mail also registered case app received mail case asking wait days update update see pattern called week said working mail called im one spend time calling every week said biometrics expired reauthenticate banking point first visited airtel office near us said dont banking redirected points app called every single one near us none either finger print machine understood saying spent hrs day fed called time asked escalated higher authority said biometrics wasnt needed enraged us person said documents enough personally see case would resolved got mail new case number time mom whose name phone number car rc fastag travel abroad gave mail login follow left mail wait days return returned called yesterday asked escalated tier cc incompetent say least seemed reading script tier cc better better knowledge topic time said mismatch documents given registration docs given asked mismatch idea kept repeating mismatch back forth said mismatch dl said know mismatch tried make understand dl renewed yrs ago dl number avail asked us go rto get dl renewal confirmation slip even exist said cant go rto get unknown slip spending time weekday know state rtos city said bank policy get slip cant anything without budge told send policy mail gave excuses saying sent mail dept power said send mail asking policy asked werent updated issues mail arose said mail sent didnt get asked date sent said led kind quarrel us telling case raised talking one guys telling us issue rose didnt want deal understand us asked escalate higher tier cc floor manager able understand issue said work existing license given provide letter stating license renewed sent yesterday night waiting update time provided us name asked us tell name redirected directly goes show bad system physical bank one questioned directly physical bank problem could solved long time ago making everything digital solution best would hybrid system planning move consumer court also work might ask move different provider simply cant vin linked airtel banks register vin system made far props reading tldr airtel blocked wallet fastag unbearable back forth customer care call center month avail looking consumer court option doesnt work cant move new provider till airtel unlinks car fastag op unlimited part mostly people agree fup something since unlimited plans started applicable everyone get fup details next time take plan others pointed since case demands high consumption data better discuss custom plan offer one check postpaid plan aligns towards budget lastly local isps customer support may worth shot service availability might always mark prioritise anyway lesson would fall marketing salesperson blindly fact check take advice unlocked memory back school remember hitting limit downloading terabytes ai training data nevef found fun times problem fiber used issue back coaxial copper cables one reasons internet working flawlessly night worse day plus fiber network nowadays robust capable handling extremely high network load processes mentioned performed network equipment dedicated servers dns name server already mentioned network equipment carries network doesnt decapsulate whole packet first layers depending whether switch router junction box fiber network may better network equipments prone heating port hanging issues qos implemented junction box last mile connectivity think isps tank bytes use using internet makes think someone using set number bytes makes difference processing required packets therefore yes someone consuming tb data less month definitely puts stress junction box ethernet line connected upto users share junction box sometimes others users connected junction box poor quality internet one user constantly loading leaving aside fact junction bus switch hence whole understanding wrong keyword sharing literally doesnt matter user sharing network used tb tb completely new user bandwidth getting split across speed drop guess isp already tells xyz speed condition usage cap simply isp double dipping without actually anything indirectly stating us cap unlimited internet gbps speeds yes data caps dont affect speeds many concurrent users active time dont believe go check literally network appliance tell find limit total number bytes processed cancelling airtel fibre connection nightmare actually shifted jobs moved made request cancellation service agent installed modem came took back next months kept getting calls airtel different numbers time asking return asking cancelled connection mess finally lawyer cousin send simple notice stopped guy saying works adobe company charges customer cancelling subscription airtel g says unlimited data actually gb airtel airfiber says unlimited data actually tb data ill fix airtel g says unlimited data actually first gb high speed rest slower dialup airtel airfiber says unlimited data actually first tb data high speed rest slower dialup actually working adobe bought macromedia created flash people earning making flash games adobe buying flash didnt put enough attention address bugs project abandoned people livelihoods robbed working giant big part capitalist system fooled shame airtel fooled twice shame prone heating port hanging issues caused high number concurrent users many tb one user downloads topology thing copperfiber thing copper simply lower range fiber within range handle bandwidth required back days bruh gotten wrong info head unlimited fair usage policy visual content editor corporate stuff got opt corporate plan gb massive residential connection extremely reasonable fup limit dont want people running bitcoin mining operations bedroom dont know isps actually provide corporate plans residential customers though ask help company getting high number concurrent users vs one user making multiple requests load perspective op consuming video streams bulk upload download large files quote post job demands highspeed internet downloading large image files managing visual workflows home broadband meant normal wfh home use scenarios high bandwidth requirements business line leased line obtained way putting forth requirements seems like user download amount data load systems logic implying unlimited capacity available networking equipment right understanding please watch perfology youtube channel hotstar scaled systems india cricket matches etc understand amount watch tune streams consuming large portion entire bandwidth available india undersea cables high number concurrent users vs one user making multiple requests load perspective yes load bandwidth total number bytes theyre thing like ive asked comment found network appliance measures performance limits total number bytes processed home broadband meant normal wfh home use scenarios high bandwidth requirements business line leased line obtained like already said distinction without technical merit isps already happily throttle bandwidth many concurrent users home connections actual load matters youre helping company double dip parroting excuse please watch perfology youtube channel hotstar scaled systems india cricket matches etc understand amount watch tune streams consuming large portion entire bandwidth available india undersea cables undersea cable restricts total number bytes consumed think counts refuting argument think youve already missed issue talking punished much data op consumed total hes complaining hes getting constant gbps uptime sla argument op got treated fairly agreed plan speed part throttled speed kbps exhausted bandwidth saying bandwidth amount data passes sound right every byte data transmitted gbps kbps matters gbps packets let causing network congestion argument op got treated fairly agreed plan speed part throttled speed kbps exhausted bandwidth know bandwidth means sound right dont fall marketing nonsense go install opnsense vm check parameters affect system usage every byte data transmitted gbps kbps matters gbps packets let causing network congestion already mentioned multiple times congestion keep happening regardless concurrent users used tb completely new users please look definition bandwidth theres component bytes consumed total stop calling cc email nodal officer appellate authority u get call back saner people follow back email gist every call helped close airtal wifi connection cc wont listen u contact nodal everybody listen",
    "light_cleaned_title": "Airtel's Misleading \"Unlimited Data\" Claims and Unacceptable Customer Service",
    "light_cleaned_selftext": "Hello everyone, I hope you are well! As a Visual Content Editor at Adobe, my job demands high-speed internet for downloading large image files and managing visual workflows. My brother, a college student, relies on a stable Wi-Fi connection for his assignments and interview prep, while my parents use it for streaming OTT content. With such diverse needs, I decided to switch to Airtel Broadband, expecting a seamless, high-speed internet experience. However, the reality was far from what was advertised. I quickly hit their 3333 GB data limit, after which my connection slowed down to a crawl. Neither the support agent who recommended the plan nor the technicians who installed it mentioned this limit. Even more infuriating, Airtel continues to advertise \"unlimited data,\" despite my complaints—I've been flagging this issue for almost a year now. Airtel has shown no intention of rectifying their misleading ads, and it feels like an intentional deception. Frustrated, I contacted Airtel customer support, hoping for a solution. But instead of assistance, I was met with rigid policies. Even though I offered to pay for extra data, they refused to accommodate me. I requested to cancel my Wi-Fi, but this opened a new chapter of frustration. I was forced to fill out a form, and when I explained that none of the provided cancellation reasons applied to me, I asked them to tick \"Other.\" They refused. I had to invent a reason—claiming I'd lost my job, moved to a village, and become a farmer—just to get through this absurd process. Even after this, they tried to sell me a downgrade to 40 Mbps instead of canceling the service. It took ten callbacks and conversations with multiple departments to finally start the cancellation process. To add to the chaos, the retention team informed me that I could buy \"smart bytes\" or extra data, something customer support had insisted didn’t exist. They said they will help me out and I will receive a follow up from the small I never received a follow-up, and when I contacted Airtel again, they acted as if the previous conversation had never happened. Even worse, I had to start the cancellation process all over again because the escalation team had canceled my initial request. In the midst of this nightmare, an agent suggested I buy one more Wi-Fi connection in additional to the old one to get rid of this data limit nightmare, He suggested to buy the new AirFiber connection, claiming it would be faster. Reluctantly, I agreed. Due to my night shifts, I missed the installation, and to make matters worse, the technician failed to register my phone number properly, leaving me unable to access support via their app. The person responsible for the installation became unresponsive. Initially, the new AirFiber connection seemed fine. But after just ten days, I received another alert—this time, I had hit a 1024 GB data limit. Shocked, I realized that the AirFiber data cap was a third of what I had with the broadband service. Again, no one had explained this, and Airtel’s AirFiber-specific website conveniently lacked any mention of this limit. Their advertisements continued to claim \"unlimited data,\" just like with the broadband service. Navigating Airtel's customer support system felt like being trapped in a bureaucratic maze. Since my number wasn’t registered properly, the automated system would disconnect me every time I tried to use the registered number option. Using the new number option led to agents who refused to help, saying I needed to call using my registered number—knowing full well that wasn’t possible. When I finally reached an agent, they were dismissive, citing \"Airtel policy\" to dodge accountability. Attempts to escalate the issue were met with indifference, and some agents couldn’t even locate my account despite me providing the phone number and account ID. Requests to speak to a supervisor were denied with excuses like \"we're working from home.\" and \"if I can't help you, no one can\". I was put on hold for 15 minutes multiple times, only for the call to be dropped. Promised callbacks never came, and when one finally did, the agent’s voice was so muffled I couldn’t understand them. They grunted and hung up when I pointed it out. I asked the support agent that in the SMS I received from Airtel, \"smart bytes\" and \"data booster\" is mentioned so why couldn't they help me. They said they are currently in the testing phase, and I should ignore such SMS from them. Support agents outright refused to create a complaint ticket and share their number so that I can track it, and I don't have to repeat myself, they there is no suck provisions. One time the agent the agent said they can't help me further as the actual team who could me was unavailable. He said I will get a call back, and the call never came. I’ve been left to call back, again and again, hoping to catch the right team during working hours. Every day is the same cycle: long holds, dropped calls, and the frustration of explaining my problem to a new agent each time, only to get vague promises. This ordeal is not just exhausting—it's affecting my sleep, my work as a Content Editor, and my brother's job search. Airtel’s unethical tactics feel like an intentional effort to avoid accountability. I’m left desperate for a resolution, wondering how a company can get away with such deliberate deception and incompetence. You can help my retweeting the following: [https://x.com/varunswarup0/status/1835024838487871555](https://x.com/varunswarup0/status/1835024838487871555) Regards, Varun",
    "light_cleaned_comments": "The 3.3 TB limit has been there always and since most users don't reach that limit it is often ignored. Beyond that Airtel assumes is commercial usage, so the best path to take is to take their business fiber plans which offer 10TB / month at almost same price range. It comes with free static IP as well and doesn't have the free ott stuff which is bundled with regular fiber. Airfiber is a downgrade and should be avoided if you have fiber feasibility in your area. Other option is to take a second fiber from a provider like jio ( also comes with 3.3TB) to complement your existing fiber and bond with your Airtel line. This adds redundancy as well as the bandwidth you desire. For matters beyond call center, they would advise you to send an email which will be taken up by the backend team. Tldr: convert to business fiber, cancel airfiber and consider additional fiber with another provider First mistake was going for Airtel. Second mistake was going for Airtel again 3 TB looks like a business use case, switch to a business plan. For reference 1080p streaming for 12hrs a day every day takes 3TBa month. Customer care agents won’t be able to help/will dodge anything that is not in their capacity. When you face issues like incorrect number being paired with your Internet connection or being downgraded wrt bandwidth limit, directly contact nodal officer. Dont even bother with grievance officer who is below nodal officer since I found no difference between them and customer support agents. Bruh.. you used the bandwidth for your office use and now complaining its not unlimited?. Their T&C clearly mentions fair usage limit which you didnt spend time and read. Ask your office to sponsor business line plan for your home which they would likely deny and ask you to come to office or buy another broadband and consider it your cost and time of travel saved against it. Users like you put a lot of stress on the consumer lines which results in poor network quality for others users connected in your junction box. Go for a business plan. The 3.3 TB is a fairly “unlimited” limit. Post that they throttle the speeds so technically it’s unlimited. Yes. 12 hours of day streaming is not normal All ISPs have something called FUP (Fair Usage Policy) after which data would be throttled to a crawl. So technically it's unlimited, albeit at a much lower speed. It is your duty to read the offer document carefully and make an educated decision. When you leave it to the salesman, they'll say anything and everything to make the sale happen. This aside, Airtel and Reliance will ensure continued headaches. Look for a local internet provider, there will always be a few in any given populous locality. It is much easier to deal with them. Yeah man, of course I am the one hurting other consumers. capitalism has rotten your brain and it is showing I have my TV running in the background for like 10 hours a day while I just do whatever. I work, cook, eat and other stuff and the TV is just background noise for me. What did you use before opting for Airtel Fiber? Because every ftth-provider have similar plans and the speed-throttling at 3TB is everywhere. You probably didn’t read the plans or ads properly before getting it set up. As others have mentioned there are higher plans which have higher data usage available as well as their throttled-speeds are higher so it may suit your use-case. Airtel is a super stable internet provider, what are you on about? Buddy. Fair usage policy is everywhere.. Not just airtel.. I agree the 3.3tb limit sucks but it's super hard to hit that much unless you're downloading (and uploading) crazy sized files all the time. Maybe get a second connection? Stability varies from region to region so there's no one stable player. That's true. I concede. Airtel cancellation system sucks ass they just want you too hooked own it took my 1 week of back and forth calls to cancel my potty 50 mbps connection. Don't blame airtel for your ignorance. FUP applies everywhere. Want commercial usage buy commercial plans. Usually the limit is so high that it doesn’t affect people but you seriously can’t expect to give you 3TB data for free. As others already said, it falls into commercial usage category. It's called a Fair Usage Policy for a reason. Fair usage means they are giving you this plan for cheap because you'll use it for home where the load is not too demanding. If you're using it for work and the FUP is not enough, you should buy a business connection. Get one of the local internet providers, they usually have no data caps or even if they do can easily be overridden with extra fees. They’re usually cheaper as well and always a call away, unlike the corporate internet providers. Funnily enough, the one I use actually connects to the Tata Fibre node down the line (as per speed tests) but doesn’t come with any of the polices Tata Fibre has. +1 I have 2 internet connection at my home 1 is local which is main and another is airtel Local one is 1gbps with static ip and connected to my dual wan router And airtel is 500mbps for backup and other things in the house As i also download and upload many files for my work i also reach the limit within 2-3 months my local connection people allows me to do this as i purchased full year plan with them and also been customer with them for 10 yrs so they have also setup seperate line for me in building on request However airtel is pain in the ass but its good for backup i ternet and other people in house Streaming platforms compress much more aggressively, you won't hit 3tb anyway with only 10hrs streaming. I've this same problem once. Apparently that's a trai regulations. Only way to bypass it is to have 2 domestic connections or commercial connection. Secondly you can't get any add on once this limit is crossed That's what I figured. I think my monthly limit is unlimited but I get speeds of like 500 Mbps. I was told that if I use a certain amount of data then my speed would go down. I've never had that happen. So let me get this right, you got affected by the Data cap policy on your existing connection and then you got a second connection without finding out about the data cap. varun i think it is time to remove the twitter rant. you can't expect business use in a residential plan. if jio 5g speed is good in your area you can opt for a 2gb/day plan or above and you can get unlimited 5g(3.3tb). allocate the jio net to your parents streaming and your brother this is the best and cheapest option currently in the market Your usage is commercial so opt for a commercial plan with higher data cap Such idiotic posts here. Are you aware of FUP? Even a kid knows that there is a 3.3TB limit. Different people have different use cases, and 3.3tb limit is stupid. I paid a good amount to a different isp with 1gbps and they still have this stupid rule. Video games are massive with around 100-200gb. 4k streaming can easily consume your data fast. Some people also go for a home media server like Plex/Jellyfin to host their content which means a lot of uploaded data. Don't assume just because you cannot consume 3.3tb within a month, that it's only needed for office use. Bro, stop watching too much porn. /s Everyone has a 3.3Tb limit for home usage across spectrum ​ ​ If it's youtube 1080p it's never gonna hit the limit 4k streaming consumes 7gb per hour even if you consumes it daily for 12 hours it would still be less than 3.3 tb. you have only bought a recharge from the isp provider not bought the whole company. if there is no fup other users will suffer. who is stopping you from buying a commercial line then. Mixture of YouTube on 1440p when possible but it's mostly on 1080p(but it says higher bitrate not sure how that affects it), peacock and sometimes Max. What if you're using multiple devices? Should be much easier to hit that limit right? Uses a non commercial plan for commercial purpose and gets shocked when they can't lmao. Either opt for business fiber plans for your work use and keep the existing one for personal use of ur family. OR buy two fiber non commercial fiber plans( which doesn't seem to work for u). 3TB is definitely not a single use case ... Plex server is pretty much commercial use. I get that you might hit 3tb some month, I really really doubt you can hit it every month. I doubt they will give 3+TB either... There is a virtual duopoly. We gotta deal with it. This is something 15 year old me noticed when Airtel introduced Airtel Xstream fiber in 2019 I read there Terms and conditions and found out about that 3.3tb limit Since then whenever Airtel introduces a new product which I’m interested in I always read the terms and conditions Airtel 5G : says unlimited data but it’s actually only 300GB Airtel Airfiber : says unlimited data but its actually only 1TB Data The company adobe that you are working and spending 8 or more hours every day is also capitalistic. If you hate capitalism that much, Why dont you stop working for adobe? Batwara karlo bhai se. Uss bechare ko dusra connection dilwa ke uska bhavishya bacha lo Works for Adobe…Doesn’t read FUP…experiences “adobe like” customer service at AirTel…complains. Blames capitalism?!🤣 Gotta say Adobe IN got a good hire to keep fuckin up their business model. >Airtel 5G : says unlimited data but it’s actually only 300GB Yeah so I didn't know this and I suffered lol . I'm ported to jio now . Im using Airtel Airfiber and that 1Tb limit gives anxiety lol Don't worry it wouldn't hit that limit unless you are pirating movies and watching all day and night. Adobe is one of the most scum companies. Try corporate plan. I think the plan you have currently wouldn't suit your needs. OP what is your daily workflow like? Because for me the 3.3TB limit seems unattainable by my 100mbps connection. Also fup does make the connection unlimited it's just that the speeds are reduced to archaic levels 1) I fully agree with you on their customer care aspect. It’s a pain now. Because of my own wifi issues I ported out my Airtel mobile to tell them I don’t like this. Next bad experience will be to disconnect wifi itself. I have paid advance rental for six months hence the hesitancy to disconnect right now. 2) data plans come with data usage policy. It is old practice. Again wrong on Airtel’s part not to share this with you as on website or pamphlets it is written with asterisks. 3) call Center executives are ill trained, hence banking on them is not the best option always. I will not advice Jio due to customer care issues. It is even more bad. Product experience I do not know. Lol, since when did network resources include fucking number of bytes transmitted? Do you really think a user that has spent 3tb and is going to stream a video puts “more load” than a new user thats going to stream the same video? Why does this feel like it was written by ChatGPT? No one actually talks/writes like this 3.3TB is the limit for most providers. You need business internet plans for higher data usage. You can though buy a Cisco router and have two ISPs serving your traffic. Sir, please understand each and every packet has to be transmitted with a small amount of processing which involves parsing the header of the packet to identify the IP address, also perform DNS resolution by touch basing with the DNS name servers, sending and receiving acknowledgements based on the UDP/TCP protocols used and pass on the DNS resolution results, acknowledgements, etc back to the device sending the request. Therefore yes, someone consuming 3.3TB of data in less than a month definitely puts stress on the junction box where his ethernet line is connected. Upto 8 users share the same junction box and more sometimes. Others users connected to the same junction box will have poor quality internet if one user is constantly loading it Rant alert (tl;dr at bottom): Facing similar issues with Airtel Payments Bank. Got Fastag for our VW Polo when it was introduced first. Later we got a Creta and started using that for long trips and malls. Due to this, Polo's Fastag remained dormant for around 2 yrs (not including COVID yr). Then, when we went to a mall that had Fastag parking payment system, payment failed. That is when I found out it had been blacklisted and the wallet linked to it was blocked. When we contacted their customer care(CC, 400 dedicated line for Airtel Payments Bank), they cited the reason that since both wallet and Fastag were dormant for >1yr, it was automatically blocked by their system. They asked us to send 3 documents: a letter requesting reactivation of wallet and unblocking of Fastag, and self attested copies of Aadhar and DL. We sent all three over mail and received confirmation mail stating case registered with case number. It also stated that they will send an update mail in 3 days. We waited 1 week to no mail. So called them back and they say that they are unable to open and view the documents (sent as pdf). So we resent them as jpg files over mail and also registered a case through the app. Received their same mail with case no. and asking to wait 3 days for update. No update again. You can see a pattern here. We called them again after a week and they said that they are working on it. No mail again. Called again (I'm the one having to spend time calling them every week) and they said biometrics are expired and had to reauthenticate through their \"Banking Point\". First visited Airtel office near us, they said they don't do Banking. Was redirected to other points on their app. Called every single one near us and none of them had either the finger print machine or understood what we were saying. Spent more than 6 hrs just that day for this. Fed up, called them again and this time asked to be escalated to higher authority. They said biometrics wasn't needed. This enraged us. This person said that documents were enough and he will personally see that the case would be resolved. Again got a mail with new case number on 26/8/24. This time, my mom, whose name and phone number was on car RC and Fastag, had to travel abroad. She gave me her mail login to follow up on this and left. There was no mail again. Had to wait 12 days for her to return. Once she returned, called them again (yesterday, 14/09/2024) and asked to be escalated as the tier 1 CC was incompetent to say the least and seemed to only be reading of a script. Tier 2 CC was better as they had better knowledge on the topic. This time, they said that there is a mismatch between documents given during registration(\\~2015) and docs given now. When asked what the mismatch was, he had no idea and kept repeating that it was a mismatch. After some back and forth, he said there is mismatch in DL. Then again, he said he did not know where the mismatch was. Tried to make him understand that DL was renewed 5 yrs ago(2019) and DL number was same, to no avail. He asked us to go to RTO and get DL renewal confirmation slip (does it even exist??), but we said \"No, we can't go to RTO and get some unknown slip by spending time on a weekday. You know about the state of RTOs in our city.\" He said that it was bank policy to get the slip and he can't do anything without it. We did not budge. Told him to send the policy over mail. He gave excuses saying that it can only be sent by \"mail dept\" and he had no power to. He said we can send a mail asking for policy. We then asked him why we weren't updated about these issues over mail when it arose. He said that mail was sent, but we didn't get any. Asked him the date when it was sent, and he said 21/8/24. This led to a kind of quarrel with us telling that the case was raised only on 26/8 after talking to one of your guys, how are you telling us this issue rose on 21/8. We didn't want to deal with him as he too did not understand us. Asked him to escalate higher to tier 3 CC. This was the floor manager. He was able to understand the issue and said that he can work with the existing license given that we provide him with a letter stating that the license was renewed. I sent this yesterday night and now waiting for \"update\". But this time he provided us with his name. He asked us to tell his name and we will be redirected to him directly. This goes to show how bad their system is. With no physical bank, there is no one to be questioned directly. If there had been a physical bank, the problem could have been solved long time ago. Making everything digital is not the solution. The best would be a hybrid system. Planning to move to Consumer Court if this also does not work out. You might ask why not move to a different provider. I simply can't as VIN is linked to Airtel and other banks cannot register the VIN in their system. If you made it this far props to you for reading. tl;dr: Airtel blocked wallet and Fastag. Unbearable back and forth with customer care call center for more than a month to no avail. Looking at consumer court as option if it doesn't work out. Can't move to new provider till Airtel unlinks car from their Fastag. OP for the unlimited part mostly people agree with you. But FUP is something which has been there since the unlimited plans started and it’s applicable to everyone, so get the FUP details the next time you take up any plan. As others have pointed out since your case demands a high consumption of data, you are better to discuss a custom plan if they offer one or check if they have a postpaid plan if it aligns towards your budget. Lastly a local ISP’s customer support may be worth a shot but there service availability might not always be up to the mark, but they will prioritise you. Anyway the lesson would be to not fall for marketing or salesperson blindly, do some fact check before you take up any advice. This unlocked a memory: back in school, I remember hitting this limit while downloading terabytes of AI training data. They nevef found out it was me. Fun times. This is not a problem for fiber, it used to be an issue back when we had coaxial and copper cables, and one of the reasons being internet working flawlessly at night, and worse during the day. Plus the fiber network nowadays is more robust and capable of handling extremely high network load. and all the above processes you mentioned are not performed by the network equipment, there are dedicated servers for that, DNS as a name server that you already mentioned. The network equipment just carries the network, and doesn't decapsulate the whole packet, just the first 2-3 layers depending on whether it's a switch, a router or a junction box. Fiber network may be better but the network equipments are not. They are prone to heating and port hanging issues. There is no QoS implemented in such junction box which the last mile connectivity Do you think ISPs have a tank of bytes that you use up while using internet? What makes you think that someone using a set number of bytes makes any difference on the processing required for the packets? > Therefore yes, someone consuming 3.3TB of data in less than a month definitely puts stress on the junction box where his ethernet line is connected. Upto 8 users share the same junction box and more sometimes. Others users connected to the same junction box will have poor quality internet if one user is constantly loading it Leaving aside the fact that the junction bus is just a switch and hence your whole understanding of it is wrong, the keyword here is “sharing”. It literally doesn’t matter if the user sharing the network has used 5TB or 100TB or is a completely new user, the bandwidth is getting split across both of them, and the speed will drop. Guess what, the ISP already tells you this with the “up to xyz” speed condition. The usage cap is simply the ISP double dipping, without actually doing anything. You are indirectly stating all of us can have no cap unlimited internet at 1Gbps speeds? Yes. Data caps don’t affect your speeds, only how many concurrent users are active at a time. Don’t believe me? Go check literally any network appliance, and tell me if you find any that limit the total number of bytes processed. Cancelling an airtel fibre connection is a nightmare. I actually shifted jobs and moved out, so made a request for cancellation. The service agent who installed the modem, came and took it back. But for the next 8 months i kept on getting calls from Airtel (different numbers each time) asking me to return it and asking why i cancelled the connection. It was a mess. Finally i had my lawyer cousin send them a simple notice and it stopped. Guy saying this who works for Adobe. A company who charges their customer for cancelling their subscription. > Airtel 5G : says unlimited data but it’s actually only 300GB > > Airtel Airfiber : says unlimited data but its actually only 1TB Data Here, I'll fix it for you: Airtel 5G : says unlimited data but it’s actually only *the first* 300GB *at high speed*, the rest is slower than dial-up Airtel Airfiber : says unlimited data but its actually only *the first* 1TB Data *at high speed*, the rest is slower than dial-up Actually you did. You are working with Adobe which bought Macromedia which created flash. There were people earning for making flash games. Adobe after buying flash, didn't put enough attention to address the bugs and the project was abandoned. These people, their livelihoods.... They were robbed off from it. You are working for the same giant. You are a big part of the capitalist system. Fooled you once, shame on Airtel. Fooled you twice, shame on you. > They are prone to heating and port hanging issues. Both of which are caused by high number of concurrent users, not how many TB any one user downloads. It’s a topology thing, not a copper/fiber thing. Copper simply has lower range than fiber, but within its range it can handle the bandwidth required back in those days. Bruh you have gotten wrong info in your head it's not unlimited it's fair usage policy. If you are a visual content editor doing corporate stuff, then you got to opt for a corporate plan. 3333 GB is massive for a residential connection, and it's an extremely reasonable FUP limit. You don't want people running bitcoin mining operations from their bedroom, do you. I don't know if ISPs actually provide corporate plans to residential customers though. So, ask help from your company in getting this. high number of concurrent users vs one user making multiple requests is the same from a load perspective. The OP is not only consuming video streams, he has bulk upload and download of large files. Quote from the post: **my job demands high-speed internet for downloading large image files and managing visual workflows** Home broadband is meant for normal WFH and home use scenarios. If such high bandwidth requirements are there, business line/ leased line should be obtained. The way you are putting forth your requirements, seems like any user can download any amount of data and there will be no load on the systems. By that logic, you are implying that there is unlimited capacity available in the networking equipment which is not the right understanding. Please watch Perfology youtube channel on how hotstar has scaled up their systems during the india cricket matches, etc. You will understand that the amount of watch that tune in to the streams is consuming a large portion of the entire bandwidth available to India through the undersea cables. > high number of concurrent users vs one user making multiple requests is the same from a load perspective. Yes, the load being “bandwidth”, not total number of bytes. They’re not the same thing. Like I’ve asked you to do in the other comment, have you found any network appliance that measures its performance or limits in total number of bytes processed? > Home broadband is meant for normal WFH and home use scenarios. If such high bandwidth requirements are there, business line/ leased line should be obtained. Like I already said, this is a distinction without any technical merit. ISPs will already happily throttle bandwidth if there are many concurrent users for home connections, which is the actual “load” that matters. You’re just helping the company to double dip by parroting their excuse. > Please watch Perfology youtube channel on how hotstar has scaled up their systems during the india cricket matches, etc. You will understand that the amount of watch that tune in to the streams is consuming a large portion of the entire bandwidth available to India through the undersea cables. And? Which undersea cable restricts total number of bytes consumed that you think this counts as refuting of my argument? I think you’ve already missed what the issue is all about. We’re talking about being punished for how much data OP has consumed in total, he’s not complaining that he’s not getting constant 1gbps with 99.99% uptime SLA. By your argument, OP got treated fairly. His agreed plan speed for the most part and throttled speed of 64Kbps after he exhausted the bandwidth. You are saying you own the bandwidth and not the amount of data that passes through which does not sound right to me. Every byte of data transmitted be it at 1Gbps or at 64Kbps matters. If its at 1Gbps, more packets will be let through causing network congestion. > By your argument, OP got treated fairly. His agreed plan speed for the most part and throttled speed of 64Kbps after he exhausted the bandwidth. Do you know what bandwidth means? > which does not sound right to me. Don’t fall for marketing nonsense then. Go install opnsense on a vm and check what parameters affect system usage. > Every byte of data transmitted be it at 1Gbps or at 64Kbps matters. If its at 1Gbps, more packets will be let through causing network congestion. And as already mentioned multiple times now, that congestion will keep happening regardless of the concurrent users having used 1000TB or completely new users. Please look up the definition of bandwidth. There’s no component of “bytes consumed in total” in there. stop calling cc. email to nodal officer and appellate authority. u will get call back from saner people and follow back on email with gist of your every call. it helped me to close my airtal wifi connection. CC won't listen. Once u contact Nodal everybody will listen."
}