{
    "id": "16550rj",
    "title": "Should one buy sub par cars from Indian manufacturers providing extremely poor service to prove our patriotism? Mahindra copied a legend Jeep Wrangler and made Thar, their cars are plagued with faults, Tata Aftersales service is super bad, BharatNCAP is going to be biased towards pals of the rulers",
    "url": "https://www.reddit.com/r/india/comments/16550rj/should_one_buy_sub_par_cars_from_indian/",
    "selftext": "Bharat NCAP has been introduced. There has been Global NCAP, EuroNCAP, NCAP(USA) are all reliable and trusted institutions. \n\n\nMahindra, Tata, Maruti have been churning out sub par low quality cars which have had cosmetic upgrades over the years.\n\nThey’re like Lipstick on a pig. The internals are all low quality Chinese parts that break and malfunction easily.\n\nThere’s a famous video of a guy driving his “cool strong tank” Mahindra Scorpio next to a waterfall and the water literally enters the cabin and destroys the car from the sunroof \n\nThere are hundreds of posts and thousands of tweets about Tata cars malfunctioning and those guys having to literally beg and fight with the car service center to get it fixed \n\nIn the end the explanation given by the fans is tagg Anand Mahindra “sir” and Tata are supposedly doing it all for the good of the nation without any selfishness. \n\nThey’re literal for-profit corporates that operate solidly to generate profits no matter what. It’s time we buy using our brains instead of our emotional state. Toyota is the leading car manufacturer known for affordable and reliable cars but they’ve been struggling because Suzuki, Mahindra and Tata just become pals with the ruling government by bribing and donating. The so called local manufacturers churn out low quality cars that look good on paper and to the eyes so people ignore quality cars and run after these makes. \n\nOne more reason why people aren’t going for good cars ja the taxes are insane on cars as the government is incapable of making good roads that can accommodate these cars \n\nWe know that our country has corruption at every level. Just look at RTO. I tried so hard to get my address changed on the drivers license, waited for the entire day and then one agent came and challenged me that he can get it done in 30 seconds. He did it too but I had to pay 5k for the service and the RTO officer takes half of it as bribe even though I had all the papers",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693370563.0,
    "convurl": "https://external-preview.redd.it/8s6vK0_FgFb8P7yEZEcW7XGaNpVYoJKRFYM6UBmjh6g.jpg?auto=webp&s=8e356ea73b4008bb8f04a6c49a0427e4ae6fd064",
    "comments": [
        "Don’t buy cars man. Let’s just use cows for transportation like our benevolent leaders expect us to. Cows are like a swiss knife bro. Multi purpose.",
        "Cows provide fuel instead of you putting in fuel for cars. #Greatsuccess!!!",
        "Cows also provide food. \n\nOops…wrong sub! 😬😬",
        "Yeah beef fry is yumm.",
        "Why wrong sub. Paneer is great. Paneer for vegetarian person is life.",
        "plz bring back padmini",
        "i loved riding padmini",
        "Mahindra copied Wrangler? Lol you need to research first before making baseless claims.",
        "Baseless ?\nhttps://timesofindia.indiatimes.com/auto/cars/jeep-drives-thar-to-court-in-australia/articleshow/82558317.cms",
        "Mahindra has the licence since the early 1940s to produce cars based on their (jeep) design.",
        "Wrong. They only had license to produce Willy’s Jeep. They don’t have rights to make Jeep Wrangler copies. Maybe read the news article I sent to back up my “baseless” claims.",
        "Wrong. They only had the license to make Willys Jeep. They don’t have license to make cheap copies of Jeep Wrangler. Anand Mahindra is a corrupt businessman with contacts in the government so Jeep knows that they won’t get justice in our country sadly\n\nhttps://www.firstpost.com/tech/auto-tech/legal-wrangle-r-why-jeep-has-taken-the-new-mahindra-thar-to-court-in-australia-9615061.html/amp",
        "Kolhapure?",
        "They have license to sell cars based on Willys model the original manufacturer of Wrangler before Chrysler took over the company. \n\nMahindra still has the rights to sell the car in India and dispute is over the licensing in USA and Australia.\n\nHalf knowledge is harmful. Bye",
        "Chal feku",
        "They can sell based on Willys not on wrangler. Half knowledge is indeed dangerous. Bye \n\nhttps://timesofindia.indiatimes.com/auto/cars/jeep-drives-thar-to-court-in-australia/articleshow/82558317.cms",
        "I said it's baseless so it's baseless. Stop sharing articles. My POV is sacrosanct.",
        "Wrangler was part of Willy’s before Chrysler bought the brand.",
        "If you have enough to refuel in these inflated times, you're doing pretty good. So instead of worrying about these small service charges, we might have to pay modiji's bff, focus on the pleasure of driving.\n\nIf it's costly travel using a cycle, that's what they said.",
        "They still don’t have the rights to sell cheap tin can copies of the current gen Jeep Wrangler models. They can maybe sell the Willys jeep copies",
        "You don't ride a car you drive....... okay never mind",
        "So see like this - Willy’s is the original baap and wrangler and thar are the bachas.\n\nSo mahindra has license to make cars similar to willys jeep and jeep has the same license. \n\nThe issue arised about license to sell in USA and Australia. It’s completely legal to sell in India. \n\nChal bache so jaa.",
        "You get what you pay for. \n\nA Mahindra XUV700 starts at 14 lac. Which is about half of the price Id expect from an SUV of a similar size from a foreign manufacturer. \n\nTata Nexon EV is upto 10 lacs cheaper than MG’s ZS EV.\n\nYou cant expect Indian car manufacturers to sell cheap but high quality cars. They make cars for the masses/middle income households. Foreign car makers will make cars for the higher income households.\n\nAnd do your own research before buying a car rather than relying on any rating (Bharat NCAP or otherwise). Speak to existing owners / mechanics. Its a once in a decade purchase for most people. You should be careful.",
        "That’s the wrong way to look at it. They only have the license to make the old model. The new model is the property of Jeep and Mahindra doesn’t have the rights to make it. \n\nOf course Anand Mahindra fans will never accept real facts. \n\nI’m glad I don’t have to deal with the thousands of repairs Mahindra owners go through. \n\nGood night",
        "Bruh I have worked at GM, FCA, Honda in USA. So no point arguing with me with half backed knowledge from a shitty ToI article which you didn’t even read completely.",
        "How do you know Bharat NCAP will be biased? Do you have any proof or you have just produced this piece from your ass?",
        "I’ve been having a debate with my friends on this topic also, how do companies like ford and GM decide to exit one of the largest and fastest growing economies… I really don’t know the answer to this…",
        "Patriotism/nationalism hinders progress and improvement, because patriotism tells you to ignore the flaws/shortcomings/disadvantages of the current situation. \n\nIf you don't criticize or acknowledge the problems present today because \"mera bharat mahaan\" \"east or west India is the best\", then the people responsible for fixing those problems don't have a reason to improve.\n\nAlways criticize the bad things about your govt, politicians, brands, religion, community, city, people, festivals, culture, language rather than accepting it",
        "Suggest a good EV in 15~20Lacs range.",
        "You need to provide a link for India, jeep has not taken them to court in India since they will loose. They can take them to court in outside India if they launch their.",
        "Why buy a car to prove anything? Do your own research. Buy cars which align with your priorities.\n\nSecond, the QA/servicing issues are somewhat common across the industry now especially for 12-30 lakh segment (except for Toyota/Maruti). Even the foreign manufacturers like VW, Skoda, which were praised for their high build quality, are having rattling/AC issues in their new mass market cars. These issues are not because Indian car manufacturers are 'ripping off' foreign manufacturers but because consumers here don't have reliability (and safety) as a top priority. They want features that they can show off, which makes sense. Cars here are a kind of status symbol.\n\nAlso, I do think that the issues have been blown out of proportion here. I know several people who own harrier, altroz, scorpio n, they've had great ownership experiences. You tend to see mostly negative stuff on the internet, numbers in real life show the true story. If the cars were truly that bad, no one would be buying them. We have a Skoda Kushaq in my family. No rattling issues, no AC issues and we've been very happy with the purchase.\n\nWe should he praising Mahindra for bringing world-class cars to India at a somewhat affordable pricing. Look at XUV 700, incredibly safe, a lot of features, incredible cabin. And it's not priced at like 50 lakhs or something ridiculous. Safety is a higher priority now, just because Tata and Mahindra have raised the bar. Obviously they have room for improvement but overall they're doing great.",
        "The Thar is a 4 star GNCAP car so calling it a tin can is dumb. And Wrangler is not exactly a pinnacle of safety.",
        "One of my roommate was working with a firm testing automotive parts. As per her, Mahindra has the worst quality of parts which perform badly on their QA tests consistently. She actually said not to trust or spend on Mahindra cars.",
        "But our benevolent foreign manufacturers like Suzuki and Hyundai give great unsafe cars. Especially when they can give better cars to other countries, they cheap out here and use low quality steel. Somehow that's fine with you.  \n\nAlso, where do pulled this BNCAP will be biased shit from ? Given you didn't Target Suzuki's safety, it seems you are the biased one.",
        "Ford left because of fortuner\nThe reliability of fortuner won against the tech offered by endeavour (this goes above my head ford was also reliable as fuck)",
        "Cow dung - Biogas - Vehicles.\n\nCow milk - Non-meaters\n\nCow muscle - meaters",
        "Honda.",
        "🤨📸",
        "It only now that upper middle has started buying these cars upwards of 20 lakhs in droves (check xuv harrier and safari sales)nand experiment with new and relatively unknown  manufacturers ( mg and kia were a hit since begining of operations). If ford was present during present times, they too would have been doing well.",
        "This must be a troll post.\n\nSkoda/VW have had infamous DSG issues. In USA/China they've had to do a recall and replace faulty DSG gearboxes for free. In India, this foreign brand has left us Indians hanging.\n\nHyundai has known steering rack issues on multiple cars, which is downright unsafe.\n\nRenault/Nissan cars are straight up garbage. The Datsun Go was a car so unsafe, GNCAP wrote an open letter to Nissan asking them to stop selling it.\n\nYou're saying Maruti uses low cost Chinese parts. Are you seriously uninformed? Pretty much every component (barring certain electronics on which China has a monopoly), is made in India. They have the highest level of localisation amongst any manufacturer. Same for Tata/Mahindra. The only Chinese components are the ones that can't be sourced from India.\n\nThe Mahindra waterfall video has been debunked many times over. The guy had left his sunroof partially open for views/clicks.\n\nOn what basis can you say BharatNCAP will be biased. Based on the initial frameworks, it's quite transparent. \n\nLastly, let's not forget about the VW diesel-gate scandal, which also included Mercedes and BMW. That was straight up fraud of the highest order, and showcased a complete lack of any ethics, on a global level. BTW, they were forced to buy back diesel cars in the USA. In India, they just detuned the engines on customer cars and called it a day.\n\nFFS, this must be the most brainless post I've read in weeks.",
        "Ford left because of a change in their overall global strategy. They decided to stop focusing on low cost hatchbacks and sedans, and focus on high-margin trucks and SUVs, which won't do any decent volumes in India.\n\nBasically margins>volume. Their bottom-line profit has improved, so can't say it was a bad decision.",
        "This is clearly turds on a platter. Served by some angsty 19 year old who doesn't have a dl yet. \n\n\nXUV700 has a 5 star Global NCAP rating. \n\nSeveral Suzuki Cars have gotten tested at EU/SA/GlobalNCAP. \n\nHarrier's platform got 5stars at EU NCAP for it's LHD, however it suspected that the rating would not be the same for RHD due to the engine blocks' placement close to the steering column. \n\n\nNow there are suspicions in the community that Hyundai, Suzuki etc. lower standards for their India spec models. We wouldn't have known for sure without a crash testing agency. Now that we have one, every car will be rated on transparent parameters and videos will be uploaded. It is admittedly possible to still game and bribe the system and gain a fake rating somehow (like VW gamed the emission norms) but this is clearly a step towards transparency, not away from it.",
        "Bharat NCAP has lower standards then Euro or Aussie NCAP. The speeds at which tests are done is much lower. Global NCAP tests frontal crash at 100 KMPH, whereas Bharat will test at 64. Side impact speed is also lower in Bharat testing.",
        "However if you wish to balance between cost and quality then Mid-sized SUVs are the best options like KIA Seltos, Huandai Creta, Toyota Urban Cruiser.",
        "Bhai import duty bhi koi chiz hai? \n\nR/Carsindia Wale bande kaha gae",
        "It's realistic isn't it!? Most Highways permit about 100kmph, therefore impact speed is likely to be 30 or so kmph lower during impact. So it gives a realistic picture of what will happen during a highway impact in india. Especially with 75% road cars unable to access speeds north of 120.  \n\nPlus, like what has happened with emission norms, we'll leapfrog our way to EUNCAP standards in 2-3 regulatory cycles. But road infrastructure should improve before we increase crash testing speeds.",
        "Gncap also has crash speed of 64kmph not 100kmph",
        "That's because Indians want cheap cars with great milage  instead of safety. \n\nUltimately cheap tin cans are still safer than bikes and scooters",
        "Literally no one thinks of patriotism while buying cars.",
        "Mahindra does provide global ncap certified vehicles with better mileage than Hyundai.",
        "post this in r/carsindia and you will be flamed ever more lol",
        "That's exactly why BNCAP is required. The OP insinuating BNCAP will be biased seems far fetched. So does OP saying as if foreign manufacturers are saints and give great cars.",
        "I disagree with your view. While the government does lean to favour Indian manufacturers. The fact is that Indian manufacturers too are trying to make products that sell overseas. After sales service depends on the circumstance. When one watches car user reviews the one thing that comes up that after sales from two different Service centres can be very different.\n\nThe government isnt looking at vehicles holistically  and trying to come up with India centric rules or organisations may not make much sense. What does Bharat NCAAP do that Global NCAP doesnt. \n\nThe taxation rules  and restrictions may result in cars that may  no longer be good. There is no move to lower the overall cost of ownership - taxes are on an average 28% and above - for car purchase, excise on fuels, GST, etc. So a budget car in the rest of the world is marketed as a premium car in India (etc Honda City / Civic, Duster, etc).",
        "Buy Hyundai, kia, Suzuki, Honda or luxury cars, no one is getting killed if he does not purchase Tata or Mahindra",
        "Sub par car 😂 lernt a new one",
        "That car, while ok for it's time, represent outdated car technology. It's construction means while the car body might survive an accident. All the energy it transferred to the occupants who will get more severe injuries compared to a car. With crumple zones. The premier and ambassador survived so long only because of the license raj.",
        "Tell me a manufacturer which doesn't have issues? VW in india had the 1.6 Litre injector issue where cars have broken down under warranty and VW denies replacement ..\n\nA small time actor in my state has been facing this and protesting against this.. they slapped a bill of 2.7 lakhs citing owner negligence when his injectors went bust and other parts as well and said water content in diesel was the reason, his car was under factory warranty, he filed a consumer court case , court ordered fuel to be checked from his vehicle which was lying at the service centre for long time and lab confirmed no water presence in fuel.\n\nVW accepted to fix his vehicle for 1.2 Lakh rs as goodwill despite being their fault..\n\nWhen it comes to Mahindra , poor QC is a concern.. but the sunroof video was fake .. same goes for TATA, QC and after sales are a mess..\n\nWith SUZUKI you get reliable cars but poor build and safety ..\n\nWith Honda you get overpriced cars with overpriced spare parts ..\n\nThere is no perfect car ..",
        "Fun fact , BJP in my state used to use bullock carts to protest against fuel price hike during Congress era..",
        "You, my friend, need us  r/carsindia .",
        "Maruti suzuki ftw. Patriotic also, Foriegn also",
        "Can you tell me more about this steering rack issue",
        "There is one thing that I have noticed. The same cars that is manufactured in India when it gets exported to Europe, they adhere to all the higher quality and safety regulations.\nSo the basic thing that is needed is a law mandating minimum NCAP rating OR higher standards for Bharat NCAP rating as well as higher quality standards to be mandated.",
        "FYI Mahindra has not “copied” Jeep. The design was licensed from Willy MB by Mahindra, Mitsubishi and several other manufacturers.",
        "is it a troll post??",
        "And the price difference between a thar and a Wrangler is too much.",
        "How Renault/Nissan are garbage?",
        "Any non anecdotal sources? \n\nThis JD POWER source seems to disagree: https://www.jdpower.com/business/press-releases/2019-india-customer-service-index-mass-market-study",
        "Where is this coming from? \n\nThere have to be studies corroborating this. I have no love for Indian car manufacturers in particular, but this sudden onslaught of bad press especially here seems to have a very IT cell-ey stench to it.\n\nJD-Power research doesn't seem to agree with your surmise: https://www.jdpower.com/sites/default/files/styles/small/public/legacy/image/IN%2520CSI.png?itok=Z0p3icpl\n\nhttps://www.jdpower.com/business/press-releases/2019-india-customer-service-index-mass-market-study\n\nCould you please share better data?",
        "This is at par for the audience here. People here reminiscing over the Padmini because it heralds the days of one model per 40yrs.  \n\nJapanese cars were initially the laughingstock till they became the gold standard in quality. I remember back in the day Hyundai being rhymed with \"Get hit an die\" and KIA of course of course \"killed in action\". \n\nOf course, there's a lot to be desired and its continuous improvement in Manufacturing but let's not pretend the OP's beef is with the \"Ruling' Government with this being another pretext.",
        "Padmani was so great because it was licenced from Fiat. They tried their hand at making another car in the 2000s. Do you know the name?",
        "I have owned cars of major brands and also Indian. Trust me when it comes to build quality VW,Skoda,Toyota ,Honda ,Mahindra, Tata and Ford have been the best. \n\n\nAfter sales service VW, Tata, Skoda, Hyundai have been the worst. \n\nCars of any manufactures can be good or Bad. Same way the service network is a gamble. Genralising cars from a particular country or make is just stupid. \n\nBNCAP - that's certainly a big allegation. Unless you have some sources to prove it. It's plain propoganda.",
        "may be a peugoet 309?",
        "Indian manufacturers have access to cheapest labor in world here in India. German or Americans don't.\nSo they have reduction in biggest cost factor.\nIt's saying like NASA sends a rocket to moon for 300 million and ISRO sends it for 80 million so expect ISRO lander to be cheap quality.",
        "It's Indian so I have to defend it. Tata ji is national treasure",
        "GNCAP tests at 64kmph for frontal crash. Where did you get 100kmph from?",
        "Though assembled by Premier, it did not carry the Premier/PAL badge.\n\nThe car I am referring to was probably India's first \"Sub-4M SUV\"",
        "a quick google suggestem it was premier Rio",
        "> Renault/Nissan cars are straight up garbage\n\nThe only major issue they have is an unreliable transmission. They use an inhouse maker called JATCO and it's transmissions, especially CVT ones, are known to break before 100K KM. Its one big issue but a very expensive one to fix when it does happen. \n\nI have a 2018 Nissan Rogue AWD. I knew about the transmission issue but it was such a good price and the car barely had 12K *miles* on it. But still I drive it easy, no quick/jump acceleration and harsh breaking. And change the transmission fluid every 30k *miles*. \n\nAlso they are only Nissan again. They bought out the French.",
        ">Just look at RTO. I tried so hard to get my address changed on the drivers license, waited for the entire day and then one agent came and challenged me that he can get it done in 30 seconds. He did it too but I had to pay 5k for the service and the RTO officer takes half of it as bribe even though I had all the papers\n\nDone completely online in Delhi without having to move out of the house or meet any person.",
        "Agree 💯",
        "Yup. And that was also a Chinese car being assembled by Premier...",
        "Zotye T200",
        "it's on Netflix.",
        "On the reliability issues - most people in India completely disregard regular preventive maintenance and perform corrective maintenance only when push comes to shove. But then bitch about how the machines are not reliable and how machines manufactured elsewhere in the world are superior.",
        "> This JD POWER source\n\nJD POWER is a marketing and PR company for cars. Always take any data they put out with a grain of namak, as they say.",
        "I'll share what [JD Power](https://www.investopedia.com/what-is-j-d-power-5025160) actually is wit you.\n\nIt's a marketing and PR firm for the car industry. It's primary function is to promote cars and manufacturers that pay it money. \n\nSo its like Car company A giving money to research company B to tell the consumer C how good Car company A is.",
        "How do you so much patience to write back this detailed? Wow",
        "Don't trust local NCAP....",
        "Bruh lord expresso is literally 0-star rated and the only car in India with 0 stars, and these fools are talking about Mahindra and Tata 😂",
        "So according to her which company makes the best parts?",
        "Similar to Moodys for the Stock Market before it plummeted?",
        "The rover is said to only have a lifespan of 15 days as opposed to Chinese rover that has been operating on the moon since 2019 I think.",
        "Hyundai and KIA are Korean though??",
        "Op is dumb asf",
        "This!!\n\nOP is either a troll or must be an r/carsindia subscriber, which is extremely biased towards certain brands. OP purposefully omitted some facts and is finger-pointing at certain brands.\n\nConsumers in India look for VFM. There is no other player in the Indian market that can offer what Mahindra does in the Indian SUV market.\n\nAll it takes is a little research into the background of the Thar to realize why it retains a certain shape. Mahindra did have the license at some point to use the designs. With the Thar being the most iconic vehicle for Mahindra, it’s not easy for them to drastically change the design overnight.",
        "It's a free market, buy what you want! Indian cars are much cheaper than foreign ones and also they get their R&D done abroad so the only factor in quality is reducing price. \nIndian companies have the ability to produce world class products but their main market wants affordable and reliable not the best product it can be no matter the price.\nRoyal Enfield is killing the competition in the UK and US while Mahindra is doing the same for Africa and other developing nations. The product always depends on the market it's intended for",
        "My dear sweet little bitch,  ...\"bhaiya ji ko 10 Lakh me roll Royale chahiye\" \n\nIt's simple, you get what you pay for, \nAnd one thing I want to mention, \nMore expensive car= more expensive aftersale services. \n\nAlso, tata and mahindra may lag behind in feature and aftersale services,  but my dude..they really don't compromise on build quality,\n\nMahindra thar is not copy of jeep wrangler, becasue mahindra actually has right to produce this design , and that is quite new with lots of soft fibre material, I am a big of fan of mahindra thar and mahindra marshal , those  thing were like a tank , pure metal body.",
        "What's wrong with Renault?",
        "Damn. The political bias in this post perfectly explains illogical claims.",
        "Byd Atto 3 costs about 18L in China and blows both the Nexon and the ZS EV out of the water.",
        "Op must be kidding. This is just riding the wave of the recent anti-tata voice over here. But here's my anecdotal evidence - my i20 had clutch issues for over 3 years which was never resolved over multiple service centres. My brother has venue which has issues in second gear acceleration that has not even been diagnosed. \n\nI would say op needs to research more before tossing generic phrases like 'Chinese parts '. There are more Tata/ Mahindra cars than ever. If the issues were so widespread, it would be national news.",
        "that's not 15 days due to quality, that's 15 days because it's 15 days per 'day' and 15 days per 'night'. The rover runs on electricity harnessed by solar energy so after 15 days it'll shutdown. I'm not sure if they have any plans to reboot it later the next Lunar day",
        "Maybe operate as long as they can",
        "Do not agree Maruti-Suzuki had the best parts quality, and haven't heard a lot of people who own these complain. \n\nBut yeah I would just upvote ur post coz I have a bias against Thar imo it's the KTM of cars minus the engg prowess.",
        "Regret bur you misread me as it wasn’t being transitive in what I meant. \nJust about brands starting out. \n\nPeople even still joke about grandaddy Ford being abbreviated such and such way to this day…(Found out Road Dead, Fix or Replace Daily, Flip over Read Directions). \nThe list is long. I come from that industry. \n\nYou gotta start from somewhere. 🙏",
        "Umm ok, do Indian cars have mediocre mileage compared to euro and east Asian cars",
        "Yes they are saying the internal machinary would be destroyed by the extreme cold during that 15 earth day long night. What I didn't get is why they didn't include a power source which won't move the rover or run the equipments, but will generate just enough heat to keep the equipment safe.",
        "Another day, another misinformed redditor making a generalized venting post ona topic they know nothing about.",
        "Not possible that'll take insanely huge battery and a machine that can heat that entire thing considering how cold it gets in lunar night(around -170°C). And as with every rocket, they have weight limit so they can't include that much load. They probably had it all planned to be a one time for months or maybe more than an year so even if just found a machine capable of doing that they can't include suddenly since they'll have to redo all the Quality tests, simulations etc to ensure nothing will fail",
        "Eh, even the padmini was a copy of Fiat 1100D, under license from Fiat, developed by the Italians.\n\nThe Ambassdor was a copy of Morris Oxford series III. Developed by the British.\n\nSo none of those are Indian developed products.",
        "The tests thing I agree. But the Voyager probes used plutonium or some radioactive decay process to power it's instruments for 40 years and outside of the heliosphere, so no solar rays to heat it up. And that thing was built in the seventies.",
        "It’s my take: could be wrong.\n\nThe main aim of the mission was successful soft landing. If a next mission would happen, we can hope it would be one with return trip and a rover with longer life.",
        "It’s my take: could be wrong.\n\nThe main aim of the mission was successful soft landing. If a next mission would happen, we can hope it would be one with return trip and a rover with longer life.",
        "that thing is 37KG with 4.5KG of Plutonium in it. That'll drive up their budget insanely high",
        "Mahindra owns license of jeep design\n\nMahindra cars are good and more value for money",
        "Got it, thanks!",
        "I own a tata..so speaking from experience....it's not as bad as you make it out to be. Certainly better than tinboxes.",
        "Just buy the car YOU like. Who cares, really!!",
        "Honestly I'm seeing pretty decent cars and improving. I have a Renault kiger. It works pretty well.",
        "It's one lunar day which is 15 earth days. The rover is not expected to survive the lunar night. The temperature would dip to as low as -200°C, possibly even lower. Pragyan doesn't have capabilities to survive cold temperatures. Now, societies would try to wake it up after the lunar night, and if it does wake up, it would be miracle, even for them. But that's beyond the scope of the mission.",
        "Everything requires money & resources. And ISRO doesn't really have that. Also, the rover only has 2 scientific payloads. It's already completed or is currently carrying out the main experiments it was meant to conduct. The main aim of Chandraayan-3, among others, was the demonstration of ISRO's technology & capabilities. And they have done that.",
        "Like we have a choice? Mahindra and Tata aren't that bad honestly",
        "Nah CarsIndia has way more Tata/Mahindra haters, Especially Tata. And there's been a sudden influx of too many Tata bad posts in the last week.",
        "Oh weird, i havent been browsing there lately but the last time i read they qere praising tata tiago ev and nexon ev.",
        "As opposed to the hypothetical friend of some unknown Redditor?",
        "Title of your sex tape 😂",
        "Not the Jeep Wrangler design",
        "Both evolved from the same design and it's integral to thar's design",
        "They didn’t put in any effort to make their design. They just copied the wrangler and installed ugly grille design to escape lawsuit"
    ],
    "cleaned_text": "one buy sub par cars indian manufacturers providing extremely poor service prove patriotism mahindra copied legend jeep wrangler made thar cars plagued faults tata aftersales service super bad bharatncap going biased towards pals rulers bharat ncap introduced global ncap euroncap ncapusa reliable trusted institutions mahindra tata maruti churning sub par low quality cars cosmetic upgrades years theyre like lipstick pig internals low quality chinese parts break malfunction easily theres famous video guy driving cool strong tank mahindra scorpio next waterfall water literally enters cabin destroys car sunroof hundreds posts thousands tweets tata cars malfunctioning guys literally beg fight car service center get fixed end explanation given fans tagg anand mahindra sir tata supposedly good nation without selfishness theyre literal forprofit corporates operate solidly generate profits matter time buy using brains instead emotional state toyota leading car manufacturer known affordable reliable cars theyve struggling suzuki mahindra tata become pals ruling government bribing donating called local manufacturers churn low quality cars look good paper eyes people ignore quality cars run makes one reason people arent going good cars ja taxes insane cars government incapable making good roads accommodate cars know country corruption every level look rto tried hard get address changed drivers license waited entire day one agent came challenged get done seconds pay k service rto officer takes half bribe even though papers ",
    "cleaned_title": "one buy sub par cars indian manufacturers providing extremely poor service prove patriotism mahindra copied legend jeep wrangler made thar cars plagued faults tata aftersales service super bad bharatncap going biased towards pals rulers",
    "cleaned_selftext": "bharat ncap introduced global ncap euroncap ncapusa reliable trusted institutions mahindra tata maruti churning sub par low quality cars cosmetic upgrades years theyre like lipstick pig internals low quality chinese parts break malfunction easily theres famous video guy driving cool strong tank mahindra scorpio next waterfall water literally enters cabin destroys car sunroof hundreds posts thousands tweets tata cars malfunctioning guys literally beg fight car service center get fixed end explanation given fans tagg anand mahindra sir tata supposedly good nation without selfishness theyre literal forprofit corporates operate solidly generate profits matter time buy using brains instead emotional state toyota leading car manufacturer known affordable reliable cars theyve struggling suzuki mahindra tata become pals ruling government bribing donating called local manufacturers churn low quality cars look good paper eyes people ignore quality cars run makes one reason people arent going good cars ja taxes insane cars government incapable making good roads accommodate cars know country corruption every level look rto tried hard get address changed drivers license waited entire day one agent came challenged get done seconds pay k service rto officer takes half bribe even though papers",
    "cleaned_comments": "dont buy cars man lets use cows transportation like benevolent leaders expect us cows like swiss knife bro multi purpose cows provide fuel instead putting fuel cars greatsuccess cows also provide food oopswrong sub yeah beef fry yumm wrong sub paneer great paneer vegetarian person life plz bring back padmini loved riding padmini mahindra copied wrangler lol need research first making baseless claims baseless mahindra licence since early produce cars based jeep design wrong license produce willys jeep dont rights make jeep wrangler copies maybe read news article sent back baseless claims wrong license make willys jeep dont license make cheap copies jeep wrangler anand mahindra corrupt businessman contacts government jeep knows wont get justice country sadly kolhapure license sell cars based willys model original manufacturer wrangler chrysler took company mahindra still rights sell car india dispute licensing usa australia half knowledge harmful bye chal feku sell based willys wrangler half knowledge indeed dangerous bye said baseless baseless stop sharing articles pov sacrosanct wrangler part willys chrysler bought brand enough refuel inflated times youre pretty good instead worrying small service charges might pay modijis bff focus pleasure driving costly travel using cycle thats said still dont rights sell cheap tin copies current gen jeep wrangler models maybe sell willys jeep copies dont ride car drive okay never mind see like willys original baap wrangler thar bachas mahindra license make cars similar willys jeep jeep license issue arised license sell usa australia completely legal sell india chal bache jaa get pay mahindra xuv starts lac half price id expect suv similar size foreign manufacturer tata nexon ev upto lacs cheaper mgs zs ev cant expect indian car manufacturers sell cheap high quality cars make cars massesmiddle income households foreign car makers make cars higher income households research buying car rather relying rating bharat ncap otherwise speak existing owners mechanics decade purchase people careful thats wrong way look license make old model new model property jeep mahindra doesnt rights make course anand mahindra fans never accept real facts im glad dont deal thousands repairs mahindra owners go good night bruh worked gm fca honda usa point arguing half backed knowledge shitty toi article didnt even read completely know bharat ncap biased proof produced piece ass ive debate friends topic also companies like ford gm decide exit one largest fastest growing economies really dont know answer patriotismnationalism hinders progress improvement patriotism tells ignore flawsshortcomingsdisadvantages current situation dont criticize acknowledge problems present today mera bharat mahaan east west india best people responsible fixing problems dont reason improve always criticize bad things govt politicians brands religion community city people festivals culture language rather accepting suggest good ev lacs range need provide link india jeep taken court india since loose take court outside india launch buy car prove anything research buy cars align priorities second qaservicing issues somewhat common across industry especially lakh segment except toyotamaruti even foreign manufacturers like vw skoda praised high build quality rattlingac issues new mass market cars issues indian car manufacturers ripping foreign manufacturers consumers dont reliability safety top priority want features show makes sense cars kind status symbol also think issues blown proportion know several people harrier altroz scorpio n theyve great ownership experiences tend see mostly negative stuff internet numbers real life show true story cars truly bad one would buying skoda kushaq family rattling issues ac issues weve happy purchase praising mahindra bringing worldclass cars india somewhat affordable pricing look xuv incredibly safe lot features incredible cabin priced like lakhs something ridiculous safety higher priority tata mahindra raised bar obviously room improvement overall theyre great thar star gncap car calling tin dumb wrangler exactly pinnacle safety one roommate working firm testing automotive parts per mahindra worst quality parts perform badly qa tests consistently actually said trust spend mahindra cars benevolent foreign manufacturers like suzuki hyundai give great unsafe cars especially give better cars countries cheap use low quality steel somehow thats fine also pulled bncap biased shit given didnt target suzukis safety seems biased one ford left fortuner reliability fortuner tech offered endeavour goes head ford also reliable fuck cow dung biogas vehicles cow milk nonmeaters cow muscle meaters honda upper middle started buying cars upwards lakhs droves check xuv harrier safari salesnand experiment new relatively unknown manufacturers mg kia hit since begining operations ford present present times would well must troll post skodavw infamous dsg issues usachina theyve recall replace faulty dsg gearboxes free india foreign brand left us indians hanging hyundai known steering rack issues multiple cars downright unsafe renaultnissan cars straight garbage datsun go car unsafe gncap wrote open letter nissan asking stop selling youre saying maruti uses low cost chinese parts seriously uninformed pretty much every component barring certain electronics china monopoly made india highest level localisation amongst manufacturer tatamahindra chinese components ones cant sourced india mahindra waterfall video debunked many times guy left sunroof partially open viewsclicks basis say bharatncap biased based initial frameworks quite transparent lastly lets forget vw dieselgate scandal also included mercedes bmw straight fraud highest order showcased complete lack ethics global level btw forced buy back diesel cars usa india detuned engines customer cars called day ffs must brainless post ive read weeks ford left change overall global strategy decided stop focusing low cost hatchbacks sedans focus highmargin trucks suvs wont decent volumes india basically marginsvolume bottomline profit improved cant say bad decision clearly turds platter served angsty year old doesnt dl yet xuv star global ncap rating several suzuki cars gotten tested eusaglobalncap harriers platform got stars eu ncap lhd however suspected rating would rhd due engine blocks placement close steering column suspicions community hyundai suzuki etc lower standards india spec models wouldnt known sure without crash testing agency one every car rated transparent parameters videos uploaded admittedly possible still game bribe system gain fake rating somehow like vw gamed emission norms clearly step towards transparency away bharat ncap lower standards euro aussie ncap speeds tests done much lower global ncap tests frontal crash kmph whereas bharat test side impact speed also lower bharat testing however wish balance cost quality midsized suvs best options like kia seltos huandai creta toyota urban cruiser bhai import duty bhi koi chiz hai rcarsindia wale bande kaha gae realistic isnt highways permit kmph therefore impact speed likely kmph lower impact gives realistic picture happen highway impact india especially road cars unable access speeds north plus like happened emission norms well leapfrog way euncap standards regulatory cycles road infrastructure improve increase crash testing speeds gncap also crash speed kmph kmph thats indians want cheap cars great milage instead safety ultimately cheap tin cans still safer bikes scooters literally one thinks patriotism buying cars mahindra provide global ncap certified vehicles better mileage hyundai post rcarsindia flamed ever lol thats exactly bncap required op insinuating bncap biased seems far fetched op saying foreign manufacturers saints give great cars disagree view government lean favour indian manufacturers fact indian manufacturers trying make products sell overseas sales service depends circumstance one watches car user reviews one thing comes sales two different service centres different government isnt looking vehicles holistically trying come india centric rules organisations may make much sense bharat ncaap global ncap doesnt taxation rules restrictions may result cars may longer good move lower overall cost ownership taxes average car purchase excise fuels gst etc budget car rest world marketed premium car india etc honda city civic duster etc buy hyundai kia suzuki honda luxury cars one getting killed purchase tata mahindra sub par car lernt new one car ok time represent outdated car technology construction means car body might survive accident energy transferred occupants get severe injuries compared car crumple zones premier ambassador survived long license raj tell manufacturer doesnt issues vw india litre injector issue cars broken warranty vw denies replacement small time actor state facing protesting slapped bill lakhs citing owner negligence injectors went bust parts well said water content diesel reason car factory warranty filed consumer court case court ordered fuel checked vehicle lying service centre long time lab confirmed water presence fuel vw accepted fix vehicle lakh rs goodwill despite fault comes mahindra poor qc concern sunroof video fake goes tata qc sales mess suzuki get reliable cars poor build safety honda get overpriced cars overpriced spare parts perfect car fun fact bjp state used use bullock carts protest fuel price hike congress era friend need us rcarsindia maruti suzuki ftw patriotic also foriegn also tell steering rack issue one thing noticed cars manufactured india gets exported europe adhere higher quality safety regulations basic thing needed law mandating minimum ncap rating higher standards bharat ncap rating well higher quality standards mandated fyi mahindra copied jeep design licensed willy mb mahindra mitsubishi several manufacturers troll post price difference thar wrangler much renaultnissan garbage non anecdotal sources jd power source seems disagree coming studies corroborating love indian car manufacturers particular sudden onslaught bad press especially seems celley stench jdpower research doesnt seem agree surmise could please share better data par audience people reminiscing padmini heralds days one model per yrs japanese cars initially laughingstock till became gold standard quality remember back day hyundai rhymed get hit die kia course course killed action course theres lot desired continuous improvement manufacturing lets pretend ops beef ruling government another pretext padmani great licenced fiat tried hand making another car know name owned cars major brands also indian trust comes build quality vwskodatoyota honda mahindra tata ford best sales service vw tata skoda hyundai worst cars manufactures good bad way service network gamble genralising cars particular country make stupid bncap thats certainly big allegation unless sources prove plain propoganda may peugoet indian manufacturers access cheapest labor world india german americans dont reduction biggest cost factor saying like nasa sends rocket moon million isro sends million expect isro lander cheap quality indian defend tata ji national treasure gncap tests kmph frontal crash get kmph though assembled premier carry premierpal badge car referring probably indias first subm suv quick google suggestem premier rio renaultnissan cars straight garbage major issue unreliable transmission use inhouse maker called jatco transmissions especially cvt ones known break k km one big issue expensive one fix happen nissan rogue awd knew transmission issue good price car barely k miles still drive easy quickjump acceleration harsh breaking change transmission fluid every k miles also nissan bought french look rto tried hard get address changed drivers license waited entire day one agent came challenged get done seconds pay k service rto officer takes half bribe even though papers done completely online delhi without move house meet person agree yup also chinese car assembled premier zotye netflix reliability issues people india completely disregard regular preventive maintenance perform corrective maintenance push comes shove bitch machines reliable machines manufactured elsewhere world superior jd power source jd power marketing pr company cars always take data put grain namak say ill share jd powerhttpswwwinvestopediacomwhatisjdpower actually wit marketing pr firm car industry primary function promote cars manufacturers pay money like car company giving money research company b tell consumer c good car company much patience write back detailed wow dont trust local ncap bruh lord expresso literally star rated car india stars fools talking mahindra tata according company makes best parts similar moodys stock market plummeted rover said lifespan days opposed chinese rover operating moon since think hyundai kia korean though op dumb asf op either troll must rcarsindia subscriber extremely biased towards certain brands op purposefully omitted facts fingerpointing certain brands consumers india look vfm player indian market offer mahindra indian suv market takes little research background thar realize retains certain shape mahindra license point use designs thar iconic vehicle mahindra easy drastically change design overnight free market buy want indian cars much cheaper foreign ones also get rd done abroad factor quality reducing price indian companies ability produce world class products main market wants affordable reliable best product matter price royal enfield killing competition uk us mahindra africa developing nations product always depends market intended dear sweet little bitch bhaiya ji ko lakh roll royale chahiye simple get pay one thing want mention expensive car expensive aftersale services also tata mahindra may lag behind feature aftersale services dudethey really dont compromise build quality mahindra thar copy jeep wrangler becasue mahindra actually right produce design quite new lots soft fibre material big fan mahindra thar mahindra marshal thing like tank pure metal body whats wrong renault damn political bias post perfectly explains illogical claims byd atto costs l china blows nexon zs ev water op must kidding riding wave recent antitata voice heres anecdotal evidence clutch issues years never resolved multiple service centres brother venue issues second gear acceleration even diagnosed would say op needs research tossing generic phrases like chinese parts tata mahindra cars ever issues widespread would national news thats days due quality thats days days per day days per night rover runs electricity harnessed solar energy days itll shutdown im sure plans reboot later next lunar day maybe operate long agree marutisuzuki best parts quality havent heard lot people complain yeah would upvote ur post coz bias thar imo ktm cars minus engg prowess regret bur misread wasnt transitive meant brands starting people even still joke grandaddy ford abbreviated way dayfound road dead fix replace daily flip read directions list long come industry got ta start somewhere umm ok indian cars mediocre mileage compared euro east asian cars yes saying internal machinary would destroyed extreme cold earth day long night didnt get didnt include power source wont move rover run equipments generate enough heat keep equipment safe another day another misinformed redditor making generalized venting post ona topic know nothing possible thatll take insanely huge battery machine heat entire thing considering cold gets lunar nightaround c every rocket weight limit cant include much load probably planned one time months maybe year even found machine capable cant include suddenly since theyll redo quality tests simulations etc ensure nothing fail eh even padmini copy fiat license fiat developed italians ambassdor copy morris oxford series iii developed british none indian developed products tests thing agree voyager probes used plutonium radioactive decay process power instruments years outside heliosphere solar rays heat thing built seventies take could wrong main aim mission successful soft landing next mission would happen hope would one return trip rover longer life take could wrong main aim mission successful soft landing next mission would happen hope would one return trip rover longer life thing kg kg plutonium thatll drive budget insanely high mahindra owns license jeep design mahindra cars good value money got thanks tataso speaking experienceits bad make certainly better tinboxes buy car like cares really honestly im seeing pretty decent cars improving renault kiger works pretty well one lunar day earth days rover expected survive lunar night temperature would dip low c possibly even lower pragyan doesnt capabilities survive cold temperatures societies would try wake lunar night wake would miracle even thats beyond scope mission everything requires money resources isro doesnt really also rover scientific payloads already completed currently carrying main experiments meant conduct main aim chandraayan among others demonstration isros technology capabilities done like choice mahindra tata arent bad honestly nah carsindia way tatamahindra haters especially tata theres sudden influx many tata bad posts last week oh weird havent browsing lately last time read qere praising tata tiago ev nexon ev opposed hypothetical friend unknown redditor title sex tape jeep wrangler design evolved design integral thars design didnt put effort make design copied wrangler installed ugly grille design escape lawsuit",
    "light_cleaned_title": "Should one buy sub par cars from Indian manufacturers providing extremely poor service to prove our patriotism? Mahindra copied a legend Jeep Wrangler and made Thar, their cars are plagued with faults, Tata Aftersales service is super bad, BharatNCAP is going to be biased towards pals of the rulers",
    "light_cleaned_selftext": "Bharat NCAP has been introduced. There has been Global NCAP, EuroNCAP, NCAP(USA) are all reliable and trusted institutions. Mahindra, Tata, Maruti have been churning out sub par low quality cars which have had cosmetic upgrades over the years. They’re like Lipstick on a pig. The internals are all low quality Chinese parts that break and malfunction easily. There’s a famous video of a guy driving his “cool strong tank” Mahindra Scorpio next to a waterfall and the water literally enters the cabin and destroys the car from the sunroof There are hundreds of posts and thousands of tweets about Tata cars malfunctioning and those guys having to literally beg and fight with the car service center to get it fixed In the end the explanation given by the fans is tagg Anand Mahindra “sir” and Tata are supposedly doing it all for the good of the nation without any selfishness. They’re literal for-profit corporates that operate solidly to generate profits no matter what. It’s time we buy using our brains instead of our emotional state. Toyota is the leading car manufacturer known for affordable and reliable cars but they’ve been struggling because Suzuki, Mahindra and Tata just become pals with the ruling government by bribing and donating. The so called local manufacturers churn out low quality cars that look good on paper and to the eyes so people ignore quality cars and run after these makes. One more reason why people aren’t going for good cars ja the taxes are insane on cars as the government is incapable of making good roads that can accommodate these cars We know that our country has corruption at every level. Just look at RTO. I tried so hard to get my address changed on the drivers license, waited for the entire day and then one agent came and challenged me that he can get it done in 30 seconds. He did it too but I had to pay 5k for the service and the RTO officer takes half of it as bribe even though I had all the papers",
    "light_cleaned_comments": "Don’t buy cars man. Let’s just use cows for transportation like our benevolent leaders expect us to. Cows are like a swiss knife bro. Multi purpose. Cows provide fuel instead of you putting in fuel for cars. #Greatsuccess!!! Cows also provide food. Oops…wrong sub! 😬😬 Yeah beef fry is yumm. Why wrong sub. Paneer is great. Paneer for vegetarian person is life. plz bring back padmini i loved riding padmini Mahindra copied Wrangler? Lol you need to research first before making baseless claims. Baseless ? Mahindra has the licence since the early 1940s to produce cars based on their (jeep) design. Wrong. They only had license to produce Willy’s Jeep. They don’t have rights to make Jeep Wrangler copies. Maybe read the news article I sent to back up my “baseless” claims. Wrong. They only had the license to make Willys Jeep. They don’t have license to make cheap copies of Jeep Wrangler. Anand Mahindra is a corrupt businessman with contacts in the government so Jeep knows that they won’t get justice in our country sadly Kolhapure? They have license to sell cars based on Willys model the original manufacturer of Wrangler before Chrysler took over the company. Mahindra still has the rights to sell the car in India and dispute is over the licensing in USA and Australia. Half knowledge is harmful. Bye Chal feku They can sell based on Willys not on wrangler. Half knowledge is indeed dangerous. Bye I said it's baseless so it's baseless. Stop sharing articles. My POV is sacrosanct. Wrangler was part of Willy’s before Chrysler bought the brand. If you have enough to refuel in these inflated times, you're doing pretty good. So instead of worrying about these small service charges, we might have to pay modiji's bff, focus on the pleasure of driving. If it's costly travel using a cycle, that's what they said. They still don’t have the rights to sell cheap tin can copies of the current gen Jeep Wrangler models. They can maybe sell the Willys jeep copies You don't ride a car you drive....... okay never mind So see like this - Willy’s is the original baap and wrangler and thar are the bachas. So mahindra has license to make cars similar to willys jeep and jeep has the same license. The issue arised about license to sell in USA and Australia. It’s completely legal to sell in India. Chal bache so jaa. You get what you pay for. A Mahindra XUV700 starts at 14 lac. Which is about half of the price Id expect from an SUV of a similar size from a foreign manufacturer. Tata Nexon EV is upto 10 lacs cheaper than MG’s ZS EV. You cant expect Indian car manufacturers to sell cheap but high quality cars. They make cars for the masses/middle income households. Foreign car makers will make cars for the higher income households. And do your own research before buying a car rather than relying on any rating (Bharat NCAP or otherwise). Speak to existing owners / mechanics. Its a once in a decade purchase for most people. You should be careful. That’s the wrong way to look at it. They only have the license to make the old model. The new model is the property of Jeep and Mahindra doesn’t have the rights to make it. Of course Anand Mahindra fans will never accept real facts. I’m glad I don’t have to deal with the thousands of repairs Mahindra owners go through. Good night Bruh I have worked at GM, FCA, Honda in USA. So no point arguing with me with half backed knowledge from a shitty ToI article which you didn’t even read completely. How do you know Bharat NCAP will be biased? Do you have any proof or you have just produced this piece from your ass? I’ve been having a debate with my friends on this topic also, how do companies like ford and GM decide to exit one of the largest and fastest growing economies… I really don’t know the answer to this… Patriotism/nationalism hinders progress and improvement, because patriotism tells you to ignore the flaws/shortcomings/disadvantages of the current situation. If you don't criticize or acknowledge the problems present today because \"mera bharat mahaan\" \"east or west India is the best\", then the people responsible for fixing those problems don't have a reason to improve. Always criticize the bad things about your govt, politicians, brands, religion, community, city, people, festivals, culture, language rather than accepting it Suggest a good EV in 15~20Lacs range. You need to provide a link for India, jeep has not taken them to court in India since they will loose. They can take them to court in outside India if they launch their. Why buy a car to prove anything? Do your own research. Buy cars which align with your priorities. Second, the QA/servicing issues are somewhat common across the industry now especially for 12-30 lakh segment (except for Toyota/Maruti). Even the foreign manufacturers like VW, Skoda, which were praised for their high build quality, are having rattling/AC issues in their new mass market cars. These issues are not because Indian car manufacturers are 'ripping off' foreign manufacturers but because consumers here don't have reliability (and safety) as a top priority. They want features that they can show off, which makes sense. Cars here are a kind of status symbol. Also, I do think that the issues have been blown out of proportion here. I know several people who own harrier, altroz, scorpio n, they've had great ownership experiences. You tend to see mostly negative stuff on the internet, numbers in real life show the true story. If the cars were truly that bad, no one would be buying them. We have a Skoda Kushaq in my family. No rattling issues, no AC issues and we've been very happy with the purchase. We should he praising Mahindra for bringing world-class cars to India at a somewhat affordable pricing. Look at XUV 700, incredibly safe, a lot of features, incredible cabin. And it's not priced at like 50 lakhs or something ridiculous. Safety is a higher priority now, just because Tata and Mahindra have raised the bar. Obviously they have room for improvement but overall they're doing great. The Thar is a 4 star GNCAP car so calling it a tin can is dumb. And Wrangler is not exactly a pinnacle of safety. One of my roommate was working with a firm testing automotive parts. As per her, Mahindra has the worst quality of parts which perform badly on their QA tests consistently. She actually said not to trust or spend on Mahindra cars. But our benevolent foreign manufacturers like Suzuki and Hyundai give great unsafe cars. Especially when they can give better cars to other countries, they cheap out here and use low quality steel. Somehow that's fine with you. Also, where do pulled this BNCAP will be biased shit from ? Given you didn't Target Suzuki's safety, it seems you are the biased one. Ford left because of fortuner The reliability of fortuner won against the tech offered by endeavour (this goes above my head ford was also reliable as fuck) Cow dung - Biogas - Vehicles. Cow milk - Non-meaters Cow muscle - meaters Honda. 🤨📸 It only now that upper middle has started buying these cars upwards of 20 lakhs in droves (check xuv harrier and safari sales)nand experiment with new and relatively unknown manufacturers ( mg and kia were a hit since begining of operations). If ford was present during present times, they too would have been doing well. This must be a troll post. Skoda/VW have had infamous DSG issues. In USA/China they've had to do a recall and replace faulty DSG gearboxes for free. In India, this foreign brand has left us Indians hanging. Hyundai has known steering rack issues on multiple cars, which is downright unsafe. Renault/Nissan cars are straight up garbage. The Datsun Go was a car so unsafe, GNCAP wrote an open letter to Nissan asking them to stop selling it. You're saying Maruti uses low cost Chinese parts. Are you seriously uninformed? Pretty much every component (barring certain electronics on which China has a monopoly), is made in India. They have the highest level of localisation amongst any manufacturer. Same for Tata/Mahindra. The only Chinese components are the ones that can't be sourced from India. The Mahindra waterfall video has been debunked many times over. The guy had left his sunroof partially open for views/clicks. On what basis can you say BharatNCAP will be biased. Based on the initial frameworks, it's quite transparent. Lastly, let's not forget about the VW diesel-gate scandal, which also included Mercedes and BMW. That was straight up fraud of the highest order, and showcased a complete lack of any ethics, on a global level. BTW, they were forced to buy back diesel cars in the USA. In India, they just detuned the engines on customer cars and called it a day. FFS, this must be the most brainless post I've read in weeks. Ford left because of a change in their overall global strategy. They decided to stop focusing on low cost hatchbacks and sedans, and focus on high-margin trucks and SUVs, which won't do any decent volumes in India. Basically margins>volume. Their bottom-line profit has improved, so can't say it was a bad decision. This is clearly turds on a platter. Served by some angsty 19 year old who doesn't have a dl yet. XUV700 has a 5 star Global NCAP rating. Several Suzuki Cars have gotten tested at EU/SA/GlobalNCAP. Harrier's platform got 5stars at EU NCAP for it's LHD, however it suspected that the rating would not be the same for RHD due to the engine blocks' placement close to the steering column. Now there are suspicions in the community that Hyundai, Suzuki etc. lower standards for their India spec models. We wouldn't have known for sure without a crash testing agency. Now that we have one, every car will be rated on transparent parameters and videos will be uploaded. It is admittedly possible to still game and bribe the system and gain a fake rating somehow (like VW gamed the emission norms) but this is clearly a step towards transparency, not away from it. Bharat NCAP has lower standards then Euro or Aussie NCAP. The speeds at which tests are done is much lower. Global NCAP tests frontal crash at 100 KMPH, whereas Bharat will test at 64. Side impact speed is also lower in Bharat testing. However if you wish to balance between cost and quality then Mid-sized SUVs are the best options like KIA Seltos, Huandai Creta, Toyota Urban Cruiser. Bhai import duty bhi koi chiz hai? R/Carsindia Wale bande kaha gae It's realistic isn't it!? Most Highways permit about 100kmph, therefore impact speed is likely to be 30 or so kmph lower during impact. So it gives a realistic picture of what will happen during a highway impact in india. Especially with 75% road cars unable to access speeds north of 120. Plus, like what has happened with emission norms, we'll leapfrog our way to EUNCAP standards in 2-3 regulatory cycles. But road infrastructure should improve before we increase crash testing speeds. Gncap also has crash speed of 64kmph not 100kmph That's because Indians want cheap cars with great milage instead of safety. Ultimately cheap tin cans are still safer than bikes and scooters Literally no one thinks of patriotism while buying cars. Mahindra does provide global ncap certified vehicles with better mileage than Hyundai. post this in r/carsindia and you will be flamed ever more lol That's exactly why BNCAP is required. The OP insinuating BNCAP will be biased seems far fetched. So does OP saying as if foreign manufacturers are saints and give great cars. I disagree with your view. While the government does lean to favour Indian manufacturers. The fact is that Indian manufacturers too are trying to make products that sell overseas. After sales service depends on the circumstance. When one watches car user reviews the one thing that comes up that after sales from two different Service centres can be very different. The government isnt looking at vehicles holistically and trying to come up with India centric rules or organisations may not make much sense. What does Bharat NCAAP do that Global NCAP doesnt. The taxation rules and restrictions may result in cars that may no longer be good. There is no move to lower the overall cost of ownership - taxes are on an average 28% and above - for car purchase, excise on fuels, GST, etc. So a budget car in the rest of the world is marketed as a premium car in India (etc Honda City / Civic, Duster, etc). Buy Hyundai, kia, Suzuki, Honda or luxury cars, no one is getting killed if he does not purchase Tata or Mahindra Sub par car 😂 lernt a new one That car, while ok for it's time, represent outdated car technology. It's construction means while the car body might survive an accident. All the energy it transferred to the occupants who will get more severe injuries compared to a car. With crumple zones. The premier and ambassador survived so long only because of the license raj. Tell me a manufacturer which doesn't have issues? VW in india had the 1.6 Litre injector issue where cars have broken down under warranty and VW denies replacement .. A small time actor in my state has been facing this and protesting against this.. they slapped a bill of 2.7 lakhs citing owner negligence when his injectors went bust and other parts as well and said water content in diesel was the reason, his car was under factory warranty, he filed a consumer court case , court ordered fuel to be checked from his vehicle which was lying at the service centre for long time and lab confirmed no water presence in fuel. VW accepted to fix his vehicle for 1.2 Lakh rs as goodwill despite being their fault.. When it comes to Mahindra , poor QC is a concern.. but the sunroof video was fake .. same goes for TATA, QC and after sales are a mess.. With SUZUKI you get reliable cars but poor build and safety .. With Honda you get overpriced cars with overpriced spare parts .. There is no perfect car .. Fun fact , BJP in my state used to use bullock carts to protest against fuel price hike during Congress era.. You, my friend, need us r/carsindia . Maruti suzuki ftw. Patriotic also, Foriegn also Can you tell me more about this steering rack issue There is one thing that I have noticed. The same cars that is manufactured in India when it gets exported to Europe, they adhere to all the higher quality and safety regulations. So the basic thing that is needed is a law mandating minimum NCAP rating OR higher standards for Bharat NCAP rating as well as higher quality standards to be mandated. FYI Mahindra has not “copied” Jeep. The design was licensed from Willy MB by Mahindra, Mitsubishi and several other manufacturers. is it a troll post?? And the price difference between a thar and a Wrangler is too much. How Renault/Nissan are garbage? Any non anecdotal sources? This JD POWER source seems to disagree: Where is this coming from? There have to be studies corroborating this. I have no love for Indian car manufacturers in particular, but this sudden onslaught of bad press especially here seems to have a very IT cell-ey stench to it. JD-Power research doesn't seem to agree with your surmise: Could you please share better data? This is at par for the audience here. People here reminiscing over the Padmini because it heralds the days of one model per 40yrs. Japanese cars were initially the laughingstock till they became the gold standard in quality. I remember back in the day Hyundai being rhymed with \"Get hit an die\" and KIA of course of course \"killed in action\". Of course, there's a lot to be desired and its continuous improvement in Manufacturing but let's not pretend the OP's beef is with the \"Ruling' Government with this being another pretext. Padmani was so great because it was licenced from Fiat. They tried their hand at making another car in the 2000s. Do you know the name? I have owned cars of major brands and also Indian. Trust me when it comes to build quality VW,Skoda,Toyota ,Honda ,Mahindra, Tata and Ford have been the best. After sales service VW, Tata, Skoda, Hyundai have been the worst. Cars of any manufactures can be good or Bad. Same way the service network is a gamble. Genralising cars from a particular country or make is just stupid. BNCAP - that's certainly a big allegation. Unless you have some sources to prove it. It's plain propoganda. may be a peugoet 309? Indian manufacturers have access to cheapest labor in world here in India. German or Americans don't. So they have reduction in biggest cost factor. It's saying like NASA sends a rocket to moon for 300 million and ISRO sends it for 80 million so expect ISRO lander to be cheap quality. It's Indian so I have to defend it. Tata ji is national treasure GNCAP tests at 64kmph for frontal crash. Where did you get 100kmph from? Though assembled by Premier, it did not carry the Premier/PAL badge. The car I am referring to was probably India's first \"Sub-4M SUV\" a quick google suggestem it was premier Rio > Renault/Nissan cars are straight up garbage The only major issue they have is an unreliable transmission. They use an inhouse maker called JATCO and it's transmissions, especially CVT ones, are known to break before 100K KM. Its one big issue but a very expensive one to fix when it does happen. I have a 2018 Nissan Rogue AWD. I knew about the transmission issue but it was such a good price and the car barely had 12K *miles* on it. But still I drive it easy, no quick/jump acceleration and harsh breaking. And change the transmission fluid every 30k *miles*. Also they are only Nissan again. They bought out the French. >Just look at RTO. I tried so hard to get my address changed on the drivers license, waited for the entire day and then one agent came and challenged me that he can get it done in 30 seconds. He did it too but I had to pay 5k for the service and the RTO officer takes half of it as bribe even though I had all the papers Done completely online in Delhi without having to move out of the house or meet any person. Agree 💯 Yup. And that was also a Chinese car being assembled by Premier... Zotye T200 it's on Netflix. On the reliability issues - most people in India completely disregard regular preventive maintenance and perform corrective maintenance only when push comes to shove. But then bitch about how the machines are not reliable and how machines manufactured elsewhere in the world are superior. > This JD POWER source JD POWER is a marketing and PR company for cars. Always take any data they put out with a grain of namak, as they say. I'll share what [JD Power](https://www.investopedia.com/what-is-j-d-power-5025160) actually is wit you. It's a marketing and PR firm for the car industry. It's primary function is to promote cars and manufacturers that pay it money. So its like Car company A giving money to research company B to tell the consumer C how good Car company A is. How do you so much patience to write back this detailed? Wow Don't trust local NCAP.... Bruh lord expresso is literally 0-star rated and the only car in India with 0 stars, and these fools are talking about Mahindra and Tata 😂 So according to her which company makes the best parts? Similar to Moodys for the Stock Market before it plummeted? The rover is said to only have a lifespan of 15 days as opposed to Chinese rover that has been operating on the moon since 2019 I think. Hyundai and KIA are Korean though?? Op is dumb asf This!! OP is either a troll or must be an r/carsindia subscriber, which is extremely biased towards certain brands. OP purposefully omitted some facts and is finger-pointing at certain brands. Consumers in India look for VFM. There is no other player in the Indian market that can offer what Mahindra does in the Indian SUV market. All it takes is a little research into the background of the Thar to realize why it retains a certain shape. Mahindra did have the license at some point to use the designs. With the Thar being the most iconic vehicle for Mahindra, it’s not easy for them to drastically change the design overnight. It's a free market, buy what you want! Indian cars are much cheaper than foreign ones and also they get their R&D done abroad so the only factor in quality is reducing price. Indian companies have the ability to produce world class products but their main market wants affordable and reliable not the best product it can be no matter the price. Royal Enfield is killing the competition in the UK and US while Mahindra is doing the same for Africa and other developing nations. The product always depends on the market it's intended for My dear sweet little bitch, ...\"bhaiya ji ko 10 Lakh me roll Royale chahiye\" It's simple, you get what you pay for, And one thing I want to mention, More expensive car= more expensive aftersale services. Also, tata and mahindra may lag behind in feature and aftersale services, but my dude..they really don't compromise on build quality, Mahindra thar is not copy of jeep wrangler, becasue mahindra actually has right to produce this design , and that is quite new with lots of soft fibre material, I am a big of fan of mahindra thar and mahindra marshal , those thing were like a tank , pure metal body. What's wrong with Renault? Damn. The political bias in this post perfectly explains illogical claims. Byd Atto 3 costs about 18L in China and blows both the Nexon and the ZS EV out of the water. Op must be kidding. This is just riding the wave of the recent anti-tata voice over here. But here's my anecdotal evidence - my i20 had clutch issues for over 3 years which was never resolved over multiple service centres. My brother has venue which has issues in second gear acceleration that has not even been diagnosed. I would say op needs to research more before tossing generic phrases like 'Chinese parts '. There are more Tata/ Mahindra cars than ever. If the issues were so widespread, it would be national news. that's not 15 days due to quality, that's 15 days because it's 15 days per 'day' and 15 days per 'night'. The rover runs on electricity harnessed by solar energy so after 15 days it'll shutdown. I'm not sure if they have any plans to reboot it later the next Lunar day Maybe operate as long as they can Do not agree Maruti-Suzuki had the best parts quality, and haven't heard a lot of people who own these complain. But yeah I would just upvote ur post coz I have a bias against Thar imo it's the KTM of cars minus the engg prowess. Regret bur you misread me as it wasn’t being transitive in what I meant. Just about brands starting out. People even still joke about grandaddy Ford being abbreviated such and such way to this day…(Found out Road Dead, Fix or Replace Daily, Flip over Read Directions). The list is long. I come from that industry. You gotta start from somewhere. 🙏 Umm ok, do Indian cars have mediocre mileage compared to euro and east Asian cars Yes they are saying the internal machinary would be destroyed by the extreme cold during that 15 earth day long night. What I didn't get is why they didn't include a power source which won't move the rover or run the equipments, but will generate just enough heat to keep the equipment safe. Another day, another misinformed redditor making a generalized venting post ona topic they know nothing about. Not possible that'll take insanely huge battery and a machine that can heat that entire thing considering how cold it gets in lunar night(around -170°C). And as with every rocket, they have weight limit so they can't include that much load. They probably had it all planned to be a one time for months or maybe more than an year so even if just found a machine capable of doing that they can't include suddenly since they'll have to redo all the Quality tests, simulations etc to ensure nothing will fail Eh, even the padmini was a copy of Fiat 1100D, under license from Fiat, developed by the Italians. The Ambassdor was a copy of Morris Oxford series III. Developed by the British. So none of those are Indian developed products. The tests thing I agree. But the Voyager probes used plutonium or some radioactive decay process to power it's instruments for 40 years and outside of the heliosphere, so no solar rays to heat it up. And that thing was built in the seventies. It’s my take: could be wrong. The main aim of the mission was successful soft landing. If a next mission would happen, we can hope it would be one with return trip and a rover with longer life. It’s my take: could be wrong. The main aim of the mission was successful soft landing. If a next mission would happen, we can hope it would be one with return trip and a rover with longer life. that thing is 37KG with 4.5KG of Plutonium in it. That'll drive up their budget insanely high Mahindra owns license of jeep design Mahindra cars are good and more value for money Got it, thanks! I own a tata..so speaking from experience....it's not as bad as you make it out to be. Certainly better than tinboxes. Just buy the car YOU like. Who cares, really!! Honestly I'm seeing pretty decent cars and improving. I have a Renault kiger. It works pretty well. It's one lunar day which is 15 earth days. The rover is not expected to survive the lunar night. The temperature would dip to as low as -200°C, possibly even lower. Pragyan doesn't have capabilities to survive cold temperatures. Now, societies would try to wake it up after the lunar night, and if it does wake up, it would be miracle, even for them. But that's beyond the scope of the mission. Everything requires money & resources. And ISRO doesn't really have that. Also, the rover only has 2 scientific payloads. It's already completed or is currently carrying out the main experiments it was meant to conduct. The main aim of Chandraayan-3, among others, was the demonstration of ISRO's technology & capabilities. And they have done that. Like we have a choice? Mahindra and Tata aren't that bad honestly Nah CarsIndia has way more Tata/Mahindra haters, Especially Tata. And there's been a sudden influx of too many Tata bad posts in the last week. Oh weird, i havent been browsing there lately but the last time i read they qere praising tata tiago ev and nexon ev. As opposed to the hypothetical friend of some unknown Redditor? Title of your sex tape 😂 Not the Jeep Wrangler design Both evolved from the same design and it's integral to thar's design They didn’t put in any effort to make their design. They just copied the wrangler and installed ugly grille design to escape lawsuit"
}