{
    "id": "14pqwok",
    "title": "Swiggy Instamart won’t replace/return this damaged/bulging can which is unfit for consumption, please tell what to do?",
    "url": "https://www.reddit.com/gallery/14pqwok",
    "selftext": "There chat is useless they just say we have shared your feedback and can’t help you with this. I can’t consume this can as it is bulging from bottom and can’t even stand on flat surface,",
    "flair": "Law & Courts",
    "score": 13,
    "num_comments": 10,
    "created_utc": 1688409078.0,
    "convurl": "https://i.redd.it/c667nfg1ns9b1.jpg",
    "comments": [
        "I would drink it.",
        "I rarely drink soda and when I do, i like this one :/ it sure is my fault ordering from swiggy",
        "They put it in the freezer.",
        "I got plenty of coke cans like these, they are alright for consumption , if it's not ruptured or it's not expired",
        "Alright thanks, will try it",
        "Hey OP \nIt's alright to drink then. When you put soda cans in the freezer they bulge out.\nIt happened to me 4 days ago.",
        "Alright. This helps!"
    ],
    "cleaned_text": "swiggy instamart wont replacereturn damagedbulging unfit consumption please tell chat useless say shared feedback cant help cant consume bulging bottom cant even stand flat surface ",
    "cleaned_title": "swiggy instamart wont replacereturn damagedbulging unfit consumption please tell",
    "cleaned_selftext": "chat useless say shared feedback cant help cant consume bulging bottom cant even stand flat surface",
    "cleaned_comments": "would drink rarely drink soda like one sure fault ordering swiggy put freezer got plenty coke cans like alright consumption ruptured expired alright thanks try hey op alright drink put soda cans freezer bulge happened days ago alright helps",
    "light_cleaned_title": "Swiggy Instamart won’t replace/return this damaged/bulging can which is unfit for consumption, please tell what to do?",
    "light_cleaned_selftext": "There chat is useless they just say we have shared your feedback and can’t help you with this. I can’t consume this can as it is bulging from bottom and can’t even stand on flat surface,",
    "light_cleaned_comments": "I would drink it. I rarely drink soda and when I do, i like this one :/ it sure is my fault ordering from swiggy They put it in the freezer. I got plenty of coke cans like these, they are alright for consumption , if it's not ruptured or it's not expired Alright thanks, will try it Hey OP It's alright to drink then. When you put soda cans in the freezer they bulge out. It happened to me 4 days ago. Alright. This helps!"
}