{
    "id": "feqjwv",
    "title": "What the Block?! IFF has heard your complaints and is taking action #SaveTheInternet",
    "url": "https://www.reddit.com/r/india/comments/feqjwv/what_the_block_iff_has_heard_your_complaints_and/",
    "selftext": "https://preview.redd.it/r1akycifo6l41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=8822a2d18b287db4d5aa002a1b30360e62e0d78d\n\n### Tl;dr\n\nIFF received multiple complaints of irregular website blocking by ISPs in Bengaluru and Hyderabad. The ISPs, namely ACT and BSNL, justified some of these instances as responses to directions issued by the Department of Telecommunications (DoT). Since this appears to be a breakdown of enforcement machinery to the detriment of the network neutrality, IFF has written to officials within the DoT and the Telecom Regulatory Authority of India (TRAI) to take up the matter and remedy the situation.\n\n### What Happened?\n\nOn March 04 and 05, 2020 IFF received or got wind of multiple complaints of websites being blocked by internet providers in both Bengaluru and Hyderabad.\n\nIn Bengaluru, BSNL was reportedly blocking the [**www.bbc.co.uk**](http://www.bbc.uk/) domain. According to a screenshot seen by IFF, access to the site was blocked based on direction from the DoT. Additionally, ACT was seen to be blocking user access to sites like thequint.com, eastmojo.com, and onlinebsm.com. We got another independent complaint that ACT was blocking access to blogs hosted on name.weebly.com.\n\nSimilarly, in Hyderabad we received a complaint which demonstrated that ACT was blocking access to an open source web developer site called Bootstrap with the domain name [**www.getbootstrap.com**](https://www.getbootstrap.com/). The justification provided in this instance was that the site was blocked as per directions from the DoT.\n\n### Our Analysis\n\nAny DoT website blocking order for any of these sites remains absent in the public domain. This we feel is not aligned with the Hon’ble Supreme Court of India’s judgement in *Anuradha Bhasin v Union of India* (dated January 10, 2020) which essentially tells Government that orders which block people’s access to the internet should be put out in the public domain. Moreover, some (if not all) of these sites are unlikely to have content which can be blocked as per established thresholds which are prescribed under Section 69A of India’s Information Technology Act, 2000.\n\nAlternatively, we suspect that this is a common tactic of ISPs to invoke Government directions, which could be used as a front for arbitrary website blocking. If correct, the aforementioned instances are clear violations of net neutrality obligations under existing licensing requirements. The net neutrality principle has been incorporated into the scheme of internet and telecom licenses since July 2018. It mandates your internet provider to not indulge in discriminatory treatment of internet traffic. Discriminatory treatment has been clarified in the licenses to include practices like blocking, degrading, slowing down or granting preferential speeds/treatment to any content.\n\n### What have we done?\n\nIFF has written letters to the DoT’s Telecom Enforcement Resource and Monitoring (TERM) Cells in Bengaluru and Hyderabad to take up the matter. We have also copied these letters to the Telecom Regulatory Authority of India (TRAI) since they just completed a consultation which deliberates on issues relating to net neutrality enforcement.\n\n### What’s next and how can you help?\n\nIFF will continue to keep monitoring the situation and take up the issues with authorities if required. For this, we need your help. We have relaunched the net neutrality violation reporting mechanism on the SaveTheInternet.in website. Should you feel your ISP is blocking your favourite websites, certain proxies, VPNs, or is slowing down certain streaming sites, P2P file sharing platforms, we urge you to report it to us. [**All you have to do is visit this link here and answer a few quick questions**](https://savetheinternet.in/report/). We will keep monitoring your responses and it will help us meaningfully take the conversation with authorities and get them to hold your ISPs accountable.\n\nWe’ve got your back folks! We will continue to fight this as long as is required.\n\n### Important Documents\n\n1. Link to IFF’s complaint filed with the DoT TERM Cell in Bengaluru, which has been copied to TRAI ([**click here**](https://drive.google.com/file/d/1-A-MLjp4YFDsRisg4wmp6dt3HhXypgZj/view?usp=sharing))\n2. Link to IFF’s complaint filed with the DoT TERM Cell in Hyderabad, which has been copied to TRAI ([**click here**](https://drive.google.com/file/d/1EhpvrA0tbcNTuh4AtzxvEljKMePePzH9/view?usp=sharing))Link to the SaveTheInternet’s net neutrality violation reporting form ([**click here**](https://savetheinternet.in/report/))\n\n**We've got your back folks! Our objective is to keep your internet experiences fair, open and private. You too can jump on the cause and** **#SaveTheInternet.** [**Help us by joining forces and becoming an IFF Member today!**](https://internetfreedom.in/donate/)",
    "flair": "Policy/Economy",
    "score": 23,
    "num_comments": 2,
    "created_utc": 1583557816,
    "convurl": "https://b.thumbs.redditmedia.com/1ftFUX1_xHz8hLDzkFjqzOgA_oaCPx-2Mt0hhQyDP-M.jpg",
    "comments": [
        "Off topic but I was reminded by this post. So, here it goes: I signed up as a member last month and the monthly contribution has been charged to my card in February and March. However I didn't recieve any acknowledgement from the IFF. Is this normal or did something slip through the cracks?\n\nAlso, when can I expect my swag? /jk",
        "Hey there!\n\nThank you for being a member with us. A welcome email would have been sent to you as you started your subscription. We send out member 80Gs at the end of every financial year as well. Could you drop us an email with your address at [donate@internetfreedom.in](mailto:donate@internetfreedom.in) or [farkhanda@internetfreedom.in](mailto:farkhanda@internetfreedom.in)\n\nAnd don't worry about your goodies, they are on the way!"
    ],
    "cleaned_text": "block iff heard complaints taking action savetheinternet tldr iff received multiple complaints irregular website blocking isps bengaluru hyderabad isps namely act bsnl justified instances responses directions issued department telecommunications dot since appears breakdown enforcement machinery detriment network neutrality iff written officials within dot telecom regulatory authority india trai take matter remedy situation happened march iff received got wind multiple complaints websites blocked internet providers bengaluru hyderabad bengaluru bsnl reportedly blocking wwwbbccoukhttpwwwbbcuk domain according screenshot seen iff access site blocked based direction dot additionally act seen blocking user access sites like thequintcom eastmojocom onlinebsmcom got another independent complaint act blocking access blogs hosted nameweeblycom similarly hyderabad received complaint demonstrated act blocking access open source web developer site called bootstrap domain name wwwgetbootstrapcomhttpswwwgetbootstrapcom justification provided instance site blocked per directions dot analysis dot website blocking order sites remains absent public domain feel aligned honble supreme court indias judgement anuradha bhasin v union india dated january essentially tells government orders block peoples access internet put public domain moreover sites unlikely content blocked per established thresholds prescribed section indias information technology act alternatively suspect common tactic isps invoke government directions could used front arbitrary website blocking correct aforementioned instances clear violations net neutrality obligations existing licensing requirements net neutrality principle incorporated scheme internet telecom licenses since july mandates internet provider indulge discriminatory treatment internet traffic discriminatory treatment clarified licenses include practices like blocking degrading slowing granting preferential speedstreatment content done iff written letters dots telecom enforcement resource monitoring term cells bengaluru hyderabad take matter also copied letters telecom regulatory authority india trai since completed consultation deliberates issues relating net neutrality enforcement whats next help iff continue keep monitoring situation take issues authorities required need help relaunched net neutrality violation reporting mechanism savetheinternetin website feel isp blocking favourite websites certain proxies vpns slowing certain streaming sites pp file sharing platforms urge report us visit link answer quick questionshttpssavetheinternetinreport keep monitoring responses help us meaningfully take conversation authorities get hold isps accountable weve got back folks continue fight long required important documents link iffs complaint filed dot term cell bengaluru copied trai click herehttpsdrivegooglecomfiledamljpyfdsrisgwmpdthhxypgzjviewuspsharing link iffs complaint filed dot term cell hyderabad copied trai click herehttpsdrivegooglecomfiledehpvratbcntuhatzxveljkmepepzhviewuspsharinglink savetheinternets net neutrality violation reporting form click herehttpssavetheinternetinreport weve got back folks objective keep internet experiences fair open private jump cause savetheinternet help us joining forces becoming iff member todayhttpsinternetfreedomindonate ",
    "cleaned_title": "block iff heard complaints taking action savetheinternet",
    "cleaned_selftext": "tldr iff received multiple complaints irregular website blocking isps bengaluru hyderabad isps namely act bsnl justified instances responses directions issued department telecommunications dot since appears breakdown enforcement machinery detriment network neutrality iff written officials within dot telecom regulatory authority india trai take matter remedy situation happened march iff received got wind multiple complaints websites blocked internet providers bengaluru hyderabad bengaluru bsnl reportedly blocking wwwbbccoukhttpwwwbbcuk domain according screenshot seen iff access site blocked based direction dot additionally act seen blocking user access sites like thequintcom eastmojocom onlinebsmcom got another independent complaint act blocking access blogs hosted nameweeblycom similarly hyderabad received complaint demonstrated act blocking access open source web developer site called bootstrap domain name wwwgetbootstrapcomhttpswwwgetbootstrapcom justification provided instance site blocked per directions dot analysis dot website blocking order sites remains absent public domain feel aligned honble supreme court indias judgement anuradha bhasin v union india dated january essentially tells government orders block peoples access internet put public domain moreover sites unlikely content blocked per established thresholds prescribed section indias information technology act alternatively suspect common tactic isps invoke government directions could used front arbitrary website blocking correct aforementioned instances clear violations net neutrality obligations existing licensing requirements net neutrality principle incorporated scheme internet telecom licenses since july mandates internet provider indulge discriminatory treatment internet traffic discriminatory treatment clarified licenses include practices like blocking degrading slowing granting preferential speedstreatment content done iff written letters dots telecom enforcement resource monitoring term cells bengaluru hyderabad take matter also copied letters telecom regulatory authority india trai since completed consultation deliberates issues relating net neutrality enforcement whats next help iff continue keep monitoring situation take issues authorities required need help relaunched net neutrality violation reporting mechanism savetheinternetin website feel isp blocking favourite websites certain proxies vpns slowing certain streaming sites pp file sharing platforms urge report us visit link answer quick questionshttpssavetheinternetinreport keep monitoring responses help us meaningfully take conversation authorities get hold isps accountable weve got back folks continue fight long required important documents link iffs complaint filed dot term cell bengaluru copied trai click herehttpsdrivegooglecomfiledamljpyfdsrisgwmpdthhxypgzjviewuspsharing link iffs complaint filed dot term cell hyderabad copied trai click herehttpsdrivegooglecomfiledehpvratbcntuhatzxveljkmepepzhviewuspsharinglink savetheinternets net neutrality violation reporting form click herehttpssavetheinternetinreport weve got back folks objective keep internet experiences fair open private jump cause savetheinternet help us joining forces becoming iff member todayhttpsinternetfreedomindonate",
    "cleaned_comments": "topic reminded post goes signed member last month monthly contribution charged card february march however didnt recieve acknowledgement iff normal something slip cracks also expect swag jk hey thank member us welcome email would sent started subscription send member gs end every financial year well could drop us email address donateinternetfreedominmailtodonateinternetfreedomin farkhandainternetfreedominmailtofarkhandainternetfreedomin dont worry goodies way",
    "light_cleaned_title": "What the Block?! IFF has heard your complaints and is taking action #SaveTheInternet",
    "light_cleaned_selftext": "### Tl;dr IFF received multiple complaints of irregular website blocking by ISPs in Bengaluru and Hyderabad. The ISPs, namely ACT and BSNL, justified some of these instances as responses to directions issued by the Department of Telecommunications (DoT). Since this appears to be a breakdown of enforcement machinery to the detriment of the network neutrality, IFF has written to officials within the DoT and the Telecom Regulatory Authority of India (TRAI) to take up the matter and remedy the situation. ### What Happened? On March 04 and 05, 2020 IFF received or got wind of multiple complaints of websites being blocked by internet providers in both Bengaluru and Hyderabad. In Bengaluru, BSNL was reportedly blocking the [**www.bbc.co.uk**](http://www.bbc.uk/) domain. According to a screenshot seen by IFF, access to the site was blocked based on direction from the DoT. Additionally, ACT was seen to be blocking user access to sites like thequint.com, eastmojo.com, and onlinebsm.com. We got another independent complaint that ACT was blocking access to blogs hosted on name.weebly.com. Similarly, in Hyderabad we received a complaint which demonstrated that ACT was blocking access to an open source web developer site called Bootstrap with the domain name [**www.getbootstrap.com**](https://www.getbootstrap.com/). The justification provided in this instance was that the site was blocked as per directions from the DoT. ### Our Analysis Any DoT website blocking order for any of these sites remains absent in the public domain. This we feel is not aligned with the Hon’ble Supreme Court of India’s judgement in *Anuradha Bhasin v Union of India* (dated January 10, 2020) which essentially tells Government that orders which block people’s access to the internet should be put out in the public domain. Moreover, some (if not all) of these sites are unlikely to have content which can be blocked as per established thresholds which are prescribed under Section 69A of India’s Information Technology Act, 2000. Alternatively, we suspect that this is a common tactic of ISPs to invoke Government directions, which could be used as a front for arbitrary website blocking. If correct, the aforementioned instances are clear violations of net neutrality obligations under existing licensing requirements. The net neutrality principle has been incorporated into the scheme of internet and telecom licenses since July 2018. It mandates your internet provider to not indulge in discriminatory treatment of internet traffic. Discriminatory treatment has been clarified in the licenses to include practices like blocking, degrading, slowing down or granting preferential speeds/treatment to any content. ### What have we done? IFF has written letters to the DoT’s Telecom Enforcement Resource and Monitoring (TERM) Cells in Bengaluru and Hyderabad to take up the matter. We have also copied these letters to the Telecom Regulatory Authority of India (TRAI) since they just completed a consultation which deliberates on issues relating to net neutrality enforcement. ### What’s next and how can you help? IFF will continue to keep monitoring the situation and take up the issues with authorities if required. For this, we need your help. We have relaunched the net neutrality violation reporting mechanism on the SaveTheInternet.in website. Should you feel your ISP is blocking your favourite websites, certain proxies, VPNs, or is slowing down certain streaming sites, P2P file sharing platforms, we urge you to report it to us. [**All you have to do is visit this link here and answer a few quick questions**](https://savetheinternet.in/report/). We will keep monitoring your responses and it will help us meaningfully take the conversation with authorities and get them to hold your ISPs accountable. We’ve got your back folks! We will continue to fight this as long as is required. ### Important Documents 1. Link to IFF’s complaint filed with the DoT TERM Cell in Bengaluru, which has been copied to TRAI ([**click here**](https://drive.google.com/file/d/1-A-MLjp4YFDsRisg4wmp6dt3HhXypgZj/view?usp=sharing)) 2. Link to IFF’s complaint filed with the DoT TERM Cell in Hyderabad, which has been copied to TRAI ([**click here**](https://drive.google.com/file/d/1EhpvrA0tbcNTuh4AtzxvEljKMePePzH9/view?usp=sharing))Link to the SaveTheInternet’s net neutrality violation reporting form ([**click here**](https://savetheinternet.in/report/)) **We've got your back folks! Our objective is to keep your internet experiences fair, open and private. You too can jump on the cause and** **#SaveTheInternet.** [**Help us by joining forces and becoming an IFF Member today!**](https://internetfreedom.in/donate/)",
    "light_cleaned_comments": "Off topic but I was reminded by this post. So, here it goes: I signed up as a member last month and the monthly contribution has been charged to my card in February and March. However I didn't recieve any acknowledgement from the IFF. Is this normal or did something slip through the cracks? Also, when can I expect my swag? /jk Hey there! Thank you for being a member with us. A welcome email would have been sent to you as you started your subscription. We send out member 80Gs at the end of every financial year as well. Could you drop us an email with your address at [donate@internetfreedom.in](mailto:donate@internetfreedom.in) or [farkhanda@internetfreedom.in](mailto:farkhanda@internetfreedom.in) And don't worry about your goodies, they are on the way!"
}