{
    "id": "14q90eh",
    "title": "Rajasthan govt to pay influencers up to Rs 5 lakh for running ads",
    "url": "https://www.deccanherald.com/national/rajasthan-govt-to-pay-influencers-up-to-rs-5-lakh-for-running-ads-1232689.html",
    "selftext": "Rajasthan Govt has announced official policy to pay influencers. Any person with 10,000+ followers on Instagram, FB, Twitter will be given ads upto ₹5 lakh per month by Congress Govt.",
    "flair": "Politics",
    "score": 32,
    "num_comments": 4,
    "created_utc": 1688458534.0,
    "convurl": "https://external-preview.redd.it/9rlwBmy_7bb8MTDOr-rrBGzMFWKHB3yqTPyS6c3oZXs.jpg?auto=webp&s=353cdcd562f37ef0da6deadb70939bea5319b284",
    "comments": [
        "10,000+ that's it? This is definitely a scam to give money to their party low level members",
        "Following footsteps of ruling party at the center who raised tender for this.."
    ],
    "cleaned_text": "rajasthan govt pay influencers rs lakh running ads rajasthan govt announced official policy pay influencers person followers instagram fb twitter given ads upto lakh per month congress govt ",
    "cleaned_title": "rajasthan govt pay influencers rs lakh running ads",
    "cleaned_selftext": "rajasthan govt announced official policy pay influencers person followers instagram fb twitter given ads upto lakh per month congress govt",
    "cleaned_comments": "thats definitely scam give money party low level members following footsteps ruling party center raised tender",
    "light_cleaned_title": "Rajasthan govt to pay influencers up to Rs 5 lakh for running ads",
    "light_cleaned_selftext": "Rajasthan Govt has announced official policy to pay influencers. Any person with 10,000+ followers on Instagram, FB, Twitter will be given ads upto ₹5 lakh per month by Congress Govt.",
    "light_cleaned_comments": "10,000+ that's it? This is definitely a scam to give money to their party low level members Following footsteps of ruling party at the center who raised tender for this.."
}