{
    "id": "11kkyx1",
    "title": "Bi-Weekly Music Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/11kkyx1/biweekly_music_discussion_thread/",
    "selftext": "What is r/India listening to? Share and discuss songs, playlists, artists, or anything music-related here!\n\nIf you're a musician yourself, please share your work so we can all hear what up-and-coming musicians are doing these days.\n\nDon't just mention stuff, link it! Links that are official and provided by the artists themselves are preferred.\n\n**Music Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Music+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/06d0xwq1x8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=c66e9dcd0a8a95af64278007680175e959e0098c",
    "flair": "Scheduled",
    "score": 2,
    "num_comments": 2,
    "created_utc": 1678152610,
    "convurl": "https://a.thumbs.redditmedia.com/E5ByWFrXZvGobINAGUfSALpA8YJN7sRcIH1HwOLuav0.jpg",
    "comments": [
        "Listening to this master thread- https://open.spotify.com/track/2rWYfMbQgHYXPEzbhN65Ys?si=KhtUPu_7T8ODfkcd1ylUlg&amp;context=spotify%3Aplaylist%3A37i9dQZF1DZ06evO4nb11D"
    ],
    "cleaned_text": "biweekly music discussion thread rindia listening share discuss songs playlists artists anything musicrelated youre musician please share work hear upandcoming musicians days dont mention stuff link links official provided artists preferred music thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklymusicdiscussionthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly music discussion thread",
    "cleaned_selftext": "rindia listening share discuss songs playlists artists anything musicrelated youre musician please share work hear upandcoming musicians days dont mention stuff link links official provided artists preferred music thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklymusicdiscussionthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "listening master thread",
    "light_cleaned_title": "Bi-Weekly Music Discussion Thread",
    "light_cleaned_selftext": "What is r/India listening to? Share and discuss songs, playlists, artists, or anything music-related here! If you're a musician yourself, please share your work so we can all hear what up-and-coming musicians are doing these days. Don't just mention stuff, link it! Links that are official and provided by the artists themselves are preferred. **Music Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Music+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Listening to this master thread-"
}