{
    "id": "15tndvq",
    "title": "Share Your Thoughts on How You Use Textbooks – Take Our Quick Survey!",
    "url": "https://www.reddit.com/r/india/comments/15tndvq/share_your_thoughts_on_how_you_use_textbooks_take/",
    "selftext": "Hey there! Are you in grades 9-12 in India? We're curious about how you use textbooks and other study materials. Your insights will help us understand how students learn, both in and out of the classroom. The survey takes just 10-15 minutes, and your input will make a real difference. Click the [link](https://tally.so/r/mK50EM) to start, and thanks for sharing your experience!\n\n[https://tally.so/r/mK50EM](https://tally.so/r/mK50EM)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692278257.0,
    "convurl": "https://external-preview.redd.it/EPO1N2FAdnbmLjC3SG38O0R-Lu_4BuO27gvgbODoqVw.jpg?auto=webp&s=9f6c46430d6cb3a6aa187e779989676562dd5f94",
    "comments": [
        "Hey everyone! 🎓 Your voice matters, and we're eager to hear from students across India.   \nThis survey is a unique opportunity to share your experiences with textbooks and learning.   \nIt only takes 10 minutes, and your insights could shape the future of education in our country.   \nIf you know someone in grades 9-12, please share this link with them too.   \nTogether, we can make a difference in how learning happens.   \nThank you for being a part of this exciting project! 📚 #YourVoiceCounts   \nSurvey link: [https://tally.so/r/mK50EM](https://tally.so/r/mK50EM)"
    ],
    "cleaned_text": "share thoughts use textbooks take quick survey hey grades india curious use textbooks study materials insights help us understand students learn classroom survey takes minutes input make real difference click linkhttpstallysormkem start thanks sharing experience httpstallysormkemhttpstallysormkem ",
    "cleaned_title": "share thoughts use textbooks take quick survey",
    "cleaned_selftext": "hey grades india curious use textbooks study materials insights help us understand students learn classroom survey takes minutes input make real difference click linkhttpstallysormkem start thanks sharing experience httpstallysormkemhttpstallysormkem",
    "cleaned_comments": "hey everyone voice matters eager hear students across india survey unique opportunity share experiences textbooks learning takes minutes insights could shape future education country know someone grades please share link together make difference learning happens thank part exciting project yourvoicecounts survey link httpstallysormkemhttpstallysormkem",
    "light_cleaned_title": "Share Your Thoughts on How You Use Textbooks – Take Our Quick Survey!",
    "light_cleaned_selftext": "Hey there! Are you in grades 9-12 in India? We're curious about how you use textbooks and other study materials. Your insights will help us understand how students learn, both in and out of the classroom. The survey takes just 10-15 minutes, and your input will make a real difference. Click the [link](https://tally.so/r/mK50EM) to start, and thanks for sharing your experience! [https://tally.so/r/mK50EM](https://tally.so/r/mK50EM)",
    "light_cleaned_comments": "Hey everyone! 🎓 Your voice matters, and we're eager to hear from students across India. This survey is a unique opportunity to share your experiences with textbooks and learning. It only takes 10 minutes, and your insights could shape the future of education in our country. If you know someone in grades 9-12, please share this link with them too. Together, we can make a difference in how learning happens. Thank you for being a part of this exciting project! 📚 #YourVoiceCounts Survey link: [https://tally.so/r/mK50EM](https://tally.so/r/mK50EM)"
}