{
    "id": "1gb0km5",
    "title": "DPIs in the shadows: MeitY and Education Ministry simply refuse to open up about the APAAR student ID\n",
    "url": "https://www.reddit.com/r/india/comments/1gb0km5/dpis_in_the_shadows_meity_and_education_ministry/",
    "selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/w8drhfgyxowd1.png?width=1600&format=png&auto=webp&s=0294daebb88d9a7b78e94f3db955a6a53d17a6ec)\n\nAPAAR, an Aadhaar-based unique ID project for students across India, was initiated in July 2023 and declared a ‘digital public infrastructure’ earlier this year. When asked for its policy documents, nodal Ministries transferred our RTI request 30+ times. We still don't have an answer.\n\n# tl;dr\n\nThe Automated Permanent Academic Account Registry (“**APAAR**”) framework is an Aadhaar-based unique ID project for students across India initiated in July 2023 and declared a ‘digital public infrastructure’ earlier this year. States and UTs across India have passed directions to start enrolling students to the programme based on their Aadhaar cards and hold special parent-teacher meetings to seek parental consent from parents for the same. As the project evolves, it seems to be voluntary on paper but mandatory in practice. This may be easily clarified from the law/policy document operationalising the project—but there is none. When asked for its policy documents, nodal Ministries stonewalled information, stated that they were ‘working on it’, played the blame game with other departments, and transferred our RTI request internally 30+ times (and counting). We still do not have an answer. This post unpacks what this means for student privacy and autonomy.\n\n# Important documents:\n\n1. IFF’s post on APAAR ID dated May 01, 2024 ([link](https://internetfreedom.in/student-id-zero-law-or-policy/))\n2. IFF’s post on APAAR ID dated October 27, 2023 ([link](https://internetfreedom.in/aadhaar-based-student-id-raises-alarms-for-privacy/?ref=static.internetfreedom.in))\n3. IFF’s Letter to the Ministry of Education on the APAAR ID ([link](https://drive.google.com/file/d/1xyOjovP13FKX2iPZmEgS61mY2Un6NifP/view?usp=sharing&ref=static.internetfreedom.in))\n4. BJP’s 2024 Election Manifesto ([link](https://drive.google.com/file/d/1yo2BYuHjgDf9kbklDRzEFHLyMdPiskOK/view?usp=drive_link&ref=static.internetfreedom.in))\n5. Ministry of Education’s Thematic Session on NCrF and APAAR (Powerpoint Presentation) ([link](https://www.education.gov.in/sites/upload_files/mhrd/files/nep/Thematic_Session_NCrF.pdf?ref=static.internetfreedom.in))\n6. Ministry of Education’s Thematic Session on NCrF and APAAR (Final Report) ([link](https://www.education.gov.in/sites/upload_files/mhrd/files/nep/ABSS_Report_Session_3.pdf?ref=static.internetfreedom.in))\n\n# Background\n\nBack in July 2023, the Ministry of Education (“**MoE**”) in conjunction with the Ministry of Electronics and IT (“**MeitY**”) introduced a ‘one student, one unique ID’ scheme comprising the APAAR framework through a [panel discussion](https://www.education.gov.in/sites/upload_files/mhrd/files/nep/ABSS_Report_Session_3.pdf?ref=static.internetfreedom.in) on the implementation of the 2020 National Education Policy (“**NEP 2020**”) with an objective to issue unique IDs to students based on their Aadhaar number and store life-long longitudinal records of their educational scores, achievements, and related statistics, against it.\n\nThe enrollment process began in October 2023, when MoE [wrote](https://indianexpress.com/article/cities/mumbai/schools-asked-to-take-parents-consent-for-students-new-apaar-card-8983447/?ref=static.internetfreedom.in#lnsnedj5jhr6pvo1qf) to state chief secretaries asking schools to persuade students into creating APAAR IDs, which will be based on and authenticated through their Aadhaars. We could not find a copy of this missive through public portals, but some schools have uploaded it to their websites and we have [archived it here](https://drive.google.com/file/d/1FjzfW8kzGpSficDtdlIdWNil0FckpAQg/view?usp=sharing&ref=static.internetfreedom.in). In line with globally recognised legal principles, schools require parental consent to enrol students into the registry as the students are minors, i.e. under the age of 18. Thus the MoE Secretary, through the letter, also persuaded schools to hold a “special” parents’-teachers’ meetings “to get the consent of parents” to enrol their children into the APAAR framework. \n\nThrough all of this, and while APAAR enrollment was underway at breakneck speed across Indian schools, we noticed a glaring lack of guiding documents in the public domain and found that any and all directions issued under the project were uploaded by schools/parents, and not by the nodal Ministries. Thus we filed a host of Right to Information (RTI) requests with both authorities, which is traced in detail in a [previous post](https://internetfreedom.in/student-id-zero-law-or-policy/). To summarise:\n\n1. We filed our [first RTI](https://drive.google.com/file/d/19tbEXAh9oSX4fI7d3Th3nwhcFna9l-oh/view?usp=sharing&ref=static.internetfreedom.in) on October 19, 2023 seeking a copy of the letter from the Department of School Education and Literacy, MoE (“**DOSEL**”) to all state chief secretaries and education commissioners for the creation of APAAR IDs, and received no response. \n2. We filed our [second](https://drive.google.com/file/d/1nyxt_hVWXs1upTGpQ30OyxiO-diVhtUN/view?usp=sharing&ref=static.internetfreedom.in) and [third](https://drive.google.com/file/d/1jkO3TYy_KGQz_0mOUfc3yYqx81ST2MW4/view?usp=sharing&ref=static.internetfreedom.in) RTIs later in October with MoE asking about the status of the scheme, its backing law and/or policy documents, and other details of enrollment. We, again, received no response.\n3. We filed a [fourth RTI](https://drive.google.com/file/d/1605DNI2QnAYfJk2LsoLZ8dchglbKgpzq/view?usp=sharing&ref=static.internetfreedom.in) with the DOSEL on November 2, 2023 asking the same questions again, and stressing on the law/policy document the authorities are using to implement the APAAR ID and framework. This time, we [received a response](https://drive.google.com/file/d/1N-BDoewn5VsYCtY2d8y1OXSLYnr1skSu/view?usp=sharing&ref=static.internetfreedom.in) on December 1, 2023, noting: “*for implementation of APAAR, detailed plan covering all aspects such as framing up of policies, guidelines, criteria for empanelment of schools etc are under development stage*.” Note that by this stage, about [2.2 Crore students](https://www.freepressjournal.in/education/government-to-expand-one-nation-one-student-id-initiative-to-schools?ref=static.internetfreedom.in) had been enrolled for the APAAR ID without a law/policy in place. \n4. Then we filed a [fifth RTI](https://drive.google.com/file/d/1qG_SNvXQxSKCljfNRf2org1_7xrtPY0_/view?usp=sharing&ref=static.internetfreedom.in) asking for the earlier order sent to chief secretaries, and finally received a [copy](https://drive.google.com/file/d/1W-TgiJTxY0abC5Ii6nRx4KnvfO7oX6-u/view?usp=sharing&ref=static.internetfreedom.in).\n5. Not giving up yet, we filed a [sixth RTI](https://drive.google.com/file/d/1d-4AUtztOW71QKLzje4XmTXYcoGZl4je/view?usp=sharing&ref=static.internetfreedom.in) on December 28, 2023 with MoE, asking once again about the grounding law/policy for this initiative, only to receive the same response again: “*for implementation of APAAR, detailed plan covering all aspects such as framing up of policies, guidelines, criteria for empanelment of schools etc are under development stage*.” \n6. So we waited, and on February 16, 2024, made another [attempt](https://drive.google.com/file/d/1uq2Ae0sHBL7lS9vPbinhvoA3ULhlo1Fu/view?usp=sharing&ref=static.internetfreedom.in) to get these questions answered, and received an interesting [response](https://drive.google.com/file/d/11_0Qf-WzJUVsSnWyEhXTH7wM4Q2Mjlkx/view?usp=sharing&ref=static.internetfreedom.in). The RTI, which was transferred by the Education Department to Digital India Corporation, MeitY, read:\n\n“*\\[t\\]he Ministry of Education (MoE) will inform about the Standard Operating Procedure (SoP) and policy for creating/ verifying the APAAR IDs. However, the Ministry of Electronics and Information Technology (MeitY), the implementing body, has developed the portal and follows the Data Privacy and Protection Act (DPDA). It is important to note that since students/ learners are minors (below 18 years of age), parental/ guardian consent is necessary for the authentication/ creation of the APAAR ID*.”\n\nThe RTI first revealed that MeitY was in fact a collaborator on the APAAR project (and had a mystery legislation ‘Data Privacy and Protection Act’?). It also signalled that 1) APAAR ID is being aggressively implemented without any law or policy written down to back it, which as we argued in our [previous post](https://internetfreedom.in/aadhaar-based-student-id-raises-alarms-for-privacy/?ref=static.internetfreedom.in) makes the framework unconstitutional, and 2) the Ministries are simply shedding all accountability when it comes to questions about privacy and legality, and are claiming to use legislations that have not even been enacted yet. \n\n1. In April 2024, [filed another RTI](https://drive.google.com/file/d/1fR-zuvIjhh8aRdaFkUKgm_lyyBEyOUsd/view?usp=drive_link&ref=static.internetfreedom.in) with MeitY this time, asking what law/policy document they are following in implementing the scheme, since MoE seems to have shrugged off the responsibility of answering that question. \n2. In April 2024, we also [requested](https://drive.google.com/file/d/1QGwHZbxb9A7tO_-s2i6zwOC7cNPgfzua/view?usp=sharing&ref=static.internetfreedom.in) one specific document from MoE about APAAR ID which (as gathered from a [03:38:18 hour long video](https://www.youtube.com/watch?v=kqFRd9V8cag&ref=static.internetfreedom.in) of the Minister of Education and school principals talking praise about the project) was likely to contain the policy implementation plan for APAAR ID.\n\n# Running in circles\n\nOur April 2024 RTI request, where we [requested](https://drive.google.com/file/d/1QGwHZbxb9A7tO_-s2i6zwOC7cNPgfzua/view?usp=sharing&ref=static.internetfreedom.in) a specific policy document from MoE, contained two questions:\n\n1. Please provide a copy of the document titled – Schooling: Access and Quality – presented by MoE at the 3rd National Conference of Chief Secretaries held in New Delhi on December 28-29, 2023; and\n2. Please provide a copy of any responses, communication, discussions, debates or outcome documents from this meeting relating to National Education Policy 2020 and APAAR ID.\n\nBetween April and present day, i.e. late October 2024, this simple RTI request has been **transferred more than 30 times** in a cyclic manner between four departments in MeitY and MoE: Department of School Education & Literacy (“**DOSEL**”); Department of Higher Education (“**DOHED**”); Department of IT & Electronics (“**DITEC**”); and Digital India Corporation (or “**MELAB**”). And funnily enough, almost always in that order! With every department ascribing it a new RTI number, the transfer history looks like this:\n\n1. DOSEL/R/E/24/01795\n2. DOHED/R/T/24/00425 \n3. DITEC/R/T/24/00267\n4. MELAB/R/T/24/00078\n5. DOHED/R/T/24/00443\n6. DITEC/R/T/24/00286\n7. MELAB/R/T/24/00081\n8. DOSEL/R/T/24/00520\n9. DOHED/R/T/24/00467\n10. DITEC/R/T/24/00299\n11. MELAB/R/T/24/00123\n12. DOSEL/R/T/24/00557\n13. DOHED/R/T/24/00503\n14. DITEC/R/T/24/00315\n15. MELAB/R/T/24/00131\n16. DOSEL/R/T/24/00597\n17. DOHED/R/T/24/00550\n18. DITEC/R/T/24/00332\n19. MELAB/R/T/24/00138\n20. DOHED/R/T/24/00615\n21. DITEC/R/T/24/00355\n22. MELAB/R/T/24/00144\n23. DOHED/R/T/24/00657\n24. DITEC/R/T/24/00375\n25. MELAB/R/T/24/00151\n26. DOHED/R/T/24/00715\n27. DOHED/R/T/24/00715/1\n28. DOHED/R/T/24/00715/2, \n29. DOHED/R/T/24/00715/3\n30. DOSEL/R/T/24/00749\n31. DOHED/R/T/24/00906\n32. DOHED/R/T/24/00906/1\n\nOn August 12, 2024 we received a [partial response ](https://drive.google.com/file/d/1LK20-nty6BpY3xDh6AA_l5MJJYjr-qQH/view?usp=sharing)to the second question of our RTI where we had asked for discussions, communications or outcome documents from the meeting which was held to discuss NEP 2020. In the reply, they mentioned that the copy of the NEP 2020 and all details pertaining to this policy is available on this [website](https://www.education.gov.in/nep/about-nep). This website only comprised the policy itself and did not indicate any discussions or communications which were involved in the policy formulation. \n\nIt is now late October and we are still waiting for the  specific document that we had asked for which had been reportedly presented in December 2023. This follows a consistent trend of evading any question regarding APAAR ID, made all the more dangerous given the speed at which enrollment is being conducted under the ID.\n\n# All states aboard the APAAR bandwagon\n\n\n\nFollowing the July 2023 circular, many states kick-started APAAR ID enrollment for schools within their territory under their NEP 2020 compliance processes, and others have now started to join in. \n\n\n\nRajasthan and Chandigarh are [reported](https://www.medianama.com/2024/10/223-national-edu-policy-linked-apaar-id-to-be-rolled-out-in-chandigarh-and-rajasthan/) to start enrollment in October 2024. Odisha [planned](https://timesofindia.indiatimes.com/city/bhubaneswar/govt-to-meet-students-parents-before-apaar-id-rollout/articleshow/113681233.cms) to roll out APAAR registration starting October 15, 2024. On October 01, 2024 as [reported](https://www.thehindu.com/news/national/andhra-pradesh/all-school-managements-in-ap-told-to-create-apaar-ids-for-students-of-classes-9-and-10/article68704861.ece) in The Hindu, Andhra Pradesh has also directed school management/boards to create APAAR IDs for students. \n\n\n\nAs of September 2024, Gujarat has [started](https://www.gujaratsamachar.com/news/gujarat/apaar-id-will-be-created-for-digital-records-of-28-lakh-students-from-class-9-to-12) enrollment and aims to onboard 28 lakh students, Assam has [introduced](https://dainikasam.assamtribune.com/assam/one-nation-one-student-id-apaar-id-registration-begins-for-students-in-assam-1552262?infinitescroll=1) the project, Chhattisgarh [directed](https://www.telegraphindia.com/india/chhattisgarh-govt-directs-all-district-collectors-to-facilitate-the-implementation-of-apaar-id-scheme/cid/2050927) all district collectors to facilitate the implementation of the APAAR ID scheme. \n\n\n\nIn states like [Jharkhand](https://timesofindia.indiatimes.com/city/ranchi/state-rolls-out-one-nation-one-student-id-for-edu-mgmt/articleshow/104569234.cms), and [Maharashtra](https://thewire.in/education/maharashtra-directs-schools-to-get-parental-consent-for-student-unique-ids/?ref=static.internetfreedom.in), education departments had already implemented the APAAR ID in October 2023 and facilitated special parent-teacher meetings to secure parental consent for the creation of APAAR IDs. However, the departments have not issued any statements regarding whether the creation of APAAR IDs is mandatory. \n\n\n\nAside from these news reports, schools, colleges and universities in some states have started the creation of APAAR IDs even without the official implementation of the scheme by the state governments. \n\n\n\n# Why worry?\n\nAs per interpretation of the right to privacy under *J (Retd) K.S Puttaswamy v. Union of India \\[(2019) 1 SCC 1\\]*, any privacy-infringing measure by the State must satisfy a five prong test for it to be a justified and reasonable restriction on the right. The first prong is legality, i.e., the privacy-infringing measure must be based in law. \n\n\n\nThe implementation of the APAAR ID continues at worrying speeds without a clear law/policy or guiding document grounding it. All our transparency efforts in asking for the law/policy framework has resulted in the Ministries either stating it is being drafted, or sending our RTI requests on an indefinite expedition around departments with 30+ transfers. Even if the policy has since been drafted but not made public, various schools had started enrollment back in October 2023, in the absence thereof.\n\n\n\nA highly privacy-intrusive scheme is being implemented aggressively across states without not only a specific law/policy guiding it, but also without an active data protection law. As a scheme that is linked with Aadhaar but ‘voluntary’ on paper, it also seems to be following in the footsteps of Aadhaar, in actually being ‘mandatory’ in practice. [Educationists believe](https://www.freepressjournal.in/education/apaar-id-unique-student-identification-raises-concerns-about-data-safety?ref=static.internetfreedom.in) that, much like Aadhaar verification, schools will be forced to ensure the participation of all students and parents. Though the consent of parents is mandatory, parents seem to either not know they have an option, or are not given an opportunity to say “no”. [Some parents have pointed out](https://www.hindustantimes.com/cities/mumbai-news/parents-concerned-as-apaar-id-consent-form-requires-students-personal-information-101697656934269.html?ref=static.internetfreedom.in) that there is no option to deny consent on the Aadhaar consent form handed to them as part of the APAAR enrollment. \n\n\n\nSchools are also reported to be [grappling with the uncertainty](https://podcasts.apple.com/in/podcast/telanganas-detention-law-death-penalty-for-8-indians/id1406730235?i=1000633026395) of how to proceed if a parent refuses to complete the form. The MoE Secretary had instructed schools to hold “special” parent-teachers’ meetings to educate parents on the benefits of APAAR initiative and encourage them to give consent towards creating students’ APAAR IDs. This “encouragement” can easily take the form of arm-twisting, coercion, or taking consent without providing enough information. As schools are pressured into meeting certain implementation targets for the APAAR framework, they may also increasingly resort to coercion or force to get parents to give their consent. This process is more problematic in rural areas as the parents may not completely understand the consequences of giving consent due to low data or tech literacy, and may end up easily giving consent because they were told to do so by teachers. \n\n\n\nInstances of millions of rural, nomadic, destitute, or marginalised individuals being denied basic necessities, such as food rations, and students being [refused school admissions](https://www.deccanherald.com/india/children-without-aadhaar-shut-out-of-school-1131133.html?ref=static.internetfreedom.in) for not possessing an Aadhaar card are well-documented.  The fear around implementing APAAR ID as a basis for education in India is rooted in these past experiences. \n\n\n\nWe explored these concerns in depth in our previous post, which also shed light on the fact that this is being pushed from the top. The Bharatiya Janata Party, in its 2024 Lok Sabha Elections Manifesto, pushed for the universal adoption of the problematic APAAR framework. “*We will achieve 100% implementation of ‘One Nation, One Student ID’ through the Automated Permanent Academic Account Registry (APAAR) to store academic qualifications, credit scores and certificates, among others for students from pre-primary to higher education*”, the Manifesto stated.\n\n\n\nWith the party in power for another term, we may continue to move towards this 100% implementation goal without the requisite checks in place. This can be catastrophic for the privacy and autonomy of students across India, unless we resist it as a community. We believe that the way that this framework is created is invasive by design and should be rolled back.  \n\n  \nHelp us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)",
    "flair": "Policy/Economy",
    "score": 42,
    "num_comments": 4,
    "created_utc": 1729770117,
    "convurl": "https://external-preview.redd.it/uyGfxsv4rqp23O8ejm-bff5HnsFEvy0Mt9RN4Tg7Ui0.jpg?auto=webp&s=edcfc72517044ca9cc0446864c83da738103c37e",
    "comments": [
        "in one side, there is APAAR student ID. on the other side, students to take part in politics.",
        "I really appreciate these posts. I'm not a member but make donations every once in a while. You're doing great work, please keep it up.",
        "Thank you for fighting the good fight <3",
        "Welcome to india",
        "Forgot about coercion. In my nephew's school they straight up punish students for not submitting the form. What's the point of \" consent \" form if they carry out things in this manner."
    ],
    "cleaned_text": "dpis shadows meity education ministry simply refuse open apaar student id iff needs support ever details end posthttpspreviewredditwdrhfgyxowdpngwidthformatpngautowebpsdaebbdabefdbaadaec apaar aadhaarbased unique id project students across india initiated july declared digital public infrastructure earlier year asked policy documents nodal ministries transferred rti request times still dont answer tldr automated permanent academic account registry apaar framework aadhaarbased unique id project students across india initiated july declared digital public infrastructure earlier year states uts across india passed directions start enrolling students programme based aadhaar cards hold special parentteacher meetings seek parental consent parents project evolves seems voluntary paper mandatory practice may easily clarified lawpolicy document operationalising projectbut none asked policy documents nodal ministries stonewalled information stated working played blame game departments transferred rti request internally times counting still answer post unpacks means student privacy autonomy important documents iffs post apaar id dated may linkhttpsinternetfreedominstudentidzerolaworpolicy iffs post apaar id dated october linkhttpsinternetfreedominaadhaarbasedstudentidraisesalarmsforprivacyrefstaticinternetfreedomin iffs letter ministry education apaar id linkhttpsdrivegooglecomfiledxyojovpfkxipzmegsmyunnifpviewuspsharingrefstaticinternetfreedomin bjps election manifesto linkhttpsdrivegooglecomfiledyobyuhjgdfkbkldrzefhlymdpiskokviewuspdrivelinkrefstaticinternetfreedomin ministry educations thematic session ncrf apaar powerpoint presentation linkhttpswwweducationgovinsitesuploadfilesmhrdfilesnepthematicsessionncrfpdfrefstaticinternetfreedomin ministry educations thematic session ncrf apaar final report linkhttpswwweducationgovinsitesuploadfilesmhrdfilesnepabssreportsessionpdfrefstaticinternetfreedomin background back july ministry education moe conjunction ministry electronics meity introduced one student one unique id scheme comprising apaar framework panel discussionhttpswwweducationgovinsitesuploadfilesmhrdfilesnepabssreportsessionpdfrefstaticinternetfreedomin implementation national education policy nep objective issue unique ids students based aadhaar number store lifelong longitudinal records educational scores achievements related statistics enrollment process began october moe wrotehttpsindianexpresscomarticlecitiesmumbaischoolsaskedtotakeparentsconsentforstudentsnewapaarcardrefstaticinternetfreedominlnsnedjjhrpvoqf state chief secretaries asking schools persuade students creating apaar ids based authenticated aadhaars could find copy missive public portals schools uploaded websites archived herehttpsdrivegooglecomfiledfjzfwkzgpsficdtdlidwnilfckpaqgviewuspsharingrefstaticinternetfreedomin line globally recognised legal principles schools require parental consent enrol students registry students minors ie age thus moe secretary letter also persuaded schools hold special parentsteachers meetings get consent parents enrol children apaar framework apaar enrollment underway breakneck speed across indian schools noticed glaring lack guiding documents public domain found directions issued project uploaded schoolsparents nodal ministries thus filed host right information rti requests authorities traced detail previous posthttpsinternetfreedominstudentidzerolaworpolicy summarise filed first rtihttpsdrivegooglecomfiledtbexahosxfidthnwhcfnalohviewuspsharingrefstaticinternetfreedomin october seeking copy letter department school education literacy moe dosel state chief secretaries education commissioners creation apaar ids received response filed secondhttpsdrivegooglecomfilednyxthvwxsuptgpqoyxiodivhtunviewuspsharingrefstaticinternetfreedomin thirdhttpsdrivegooglecomfiledjkotyykgqzmoufcyyqxstmwviewuspsharingrefstaticinternetfreedomin rtis later october moe asking status scheme backing law andor policy documents details enrollment received response filed fourth rtihttpsdrivegooglecomfileddniqnayfjklsolzdchglbkgpzqviewuspsharingrefstaticinternetfreedomin dosel november asking questions stressing lawpolicy document authorities using implement apaar id framework time received responsehttpsdrivegooglecomfilednbdoewnvsyctydyoxslynrsksuviewuspsharingrefstaticinternetfreedomin december noting implementation apaar detailed plan covering aspects framing policies guidelines criteria empanelment schools etc development stage note stage crore studentshttpswwwfreepressjournalineducationgovernmenttoexpandonenationonestudentidinitiativetoschoolsrefstaticinternetfreedomin enrolled apaar id without lawpolicy place filed fifth rtihttpsdrivegooglecomfiledqgsnvxqxskcljfnrforgxrtpyviewuspsharingrefstaticinternetfreedomin asking earlier order sent chief secretaries finally received copyhttpsdrivegooglecomfiledwtgijtxyabciinrxknvfooxuviewuspsharingrefstaticinternetfreedomin giving yet filed sixth rtihttpsdrivegooglecomfileddautztowqklzjexmtxycogzljeviewuspsharingrefstaticinternetfreedomin december moe asking grounding lawpolicy initiative receive response implementation apaar detailed plan covering aspects framing policies guidelines criteria empanelment schools etc development stage waited february made another attempthttpsdrivegooglecomfileduqaeshbllsvpbinhvoaulhlofuviewuspsharingrefstaticinternetfreedomin get questions answered received interesting responsehttpsdrivegooglecomfiledqfwzjuvssnwyehxthwmqmjlkxviewuspsharingrefstaticinternetfreedomin rti transferred education department digital india corporation meity read ministry education moe inform standard operating procedure sop policy creating verifying apaar ids however ministry electronics information technology meity implementing body developed portal follows data privacy protection act dpda important note since students learners minors years age parental guardian consent necessary authentication creation apaar id rti first revealed meity fact collaborator apaar project mystery legislation data privacy protection act also signalled apaar id aggressively implemented without law policy written back argued previous posthttpsinternetfreedominaadhaarbasedstudentidraisesalarmsforprivacyrefstaticinternetfreedomin makes framework unconstitutional ministries simply shedding accountability comes questions privacy legality claiming use legislations even enacted yet april filed another rtihttpsdrivegooglecomfiledfrzuvijhhardafkukgmlyybeyousdviewuspdrivelinkrefstaticinternetfreedomin meity time asking lawpolicy document following implementing scheme since moe seems shrugged responsibility answering question april also requestedhttpsdrivegooglecomfiledqgwhzbxbatosizwoccnpgfzuaviewuspsharingrefstaticinternetfreedomin one specific document moe apaar id gathered hour long videohttpswwwyoutubecomwatchvkqfrdvcagrefstaticinternetfreedomin minister education school principals talking praise project likely contain policy implementation plan apaar id running circles april rti request requestedhttpsdrivegooglecomfiledqgwhzbxbatosizwoccnpgfzuaviewuspsharingrefstaticinternetfreedomin specific policy document moe contained two questions please provide copy document titled schooling access quality presented moe rd national conference chief secretaries held new delhi december please provide copy responses communication discussions debates outcome documents meeting relating national education policy apaar id april present day ie late october simple rti request transferred times cyclic manner four departments meity moe department school education literacy dosel department higher education dohed department electronics ditec digital india corporation melab funnily enough almost always order every department ascribing new rti number transfer history looks like doselre dohedrt ditecrt melabrt dohedrt ditecrt melabrt doselrt dohedrt ditecrt melabrt doselrt dohedrt ditecrt melabrt doselrt dohedrt ditecrt melabrt dohedrt ditecrt melabrt dohedrt ditecrt melabrt dohedrt dohedrt dohedrt dohedrt doselrt dohedrt dohedrt august received partial response httpsdrivegooglecomfiledlkntybpyxdhaalmjjyjrqqhviewuspsharingto second question rti asked discussions communications outcome documents meeting held discuss nep reply mentioned copy nep details pertaining policy available websitehttpswwweducationgovinnepaboutnep website comprised policy indicate discussions communications involved policy formulation late october still waiting specific document asked reportedly presented december follows consistent trend evading question regarding apaar id made dangerous given speed enrollment conducted id states aboard apaar bandwagon following july circular many states kickstarted apaar id enrollment schools within territory nep compliance processes others started join rajasthan chandigarh reportedhttpswwwmedianamacomnationaledupolicylinkedapaaridtoberolledoutinchandigarhandrajasthan start enrollment october odisha plannedhttpstimesofindiaindiatimescomcitybhubaneswargovttomeetstudentsparentsbeforeapaaridrolloutarticleshowcms roll apaar registration starting october october reportedhttpswwwthehinducomnewsnationalandhrapradeshallschoolmanagementsinaptoldtocreateapaaridsforstudentsofclassesandarticleece hindu andhra pradesh also directed school managementboards create apaar ids students september gujarat startedhttpswwwgujaratsamacharcomnewsgujaratapaaridwillbecreatedfordigitalrecordsoflakhstudentsfromclassto enrollment aims onboard lakh students assam introducedhttpsdainikasamassamtribunecomassamonenationonestudentidapaaridregistrationbeginsforstudentsinassaminfinitescroll project chhattisgarh directedhttpswwwtelegraphindiacomindiachhattisgarhgovtdirectsalldistrictcollectorstofacilitatetheimplementationofapaaridschemecid district collectors facilitate implementation apaar id scheme states like jharkhandhttpstimesofindiaindiatimescomcityranchistaterollsoutonenationonestudentidforedumgmtarticleshowcms maharashtrahttpsthewireineducationmaharashtradirectsschoolstogetparentalconsentforstudentuniqueidsrefstaticinternetfreedomin education departments already implemented apaar id october facilitated special parentteacher meetings secure parental consent creation apaar ids however departments issued statements regarding whether creation apaar ids mandatory aside news reports schools colleges universities states started creation apaar ids even without official implementation scheme state governments worry per interpretation right privacy j retd ks puttaswamy v union india scc privacyinfringing measure state must satisfy five prong test justified reasonable restriction right first prong legality ie privacyinfringing measure must based law implementation apaar id continues worrying speeds without clear lawpolicy guiding document grounding transparency efforts asking lawpolicy framework resulted ministries either stating drafted sending rti requests indefinite expedition around departments transfers even policy since drafted made public various schools started enrollment back october absence thereof highly privacyintrusive scheme implemented aggressively across states without specific lawpolicy guiding also without active data protection law scheme linked aadhaar voluntary paper also seems following footsteps aadhaar actually mandatory practice educationists believehttpswwwfreepressjournalineducationapaariduniquestudentidentificationraisesconcernsaboutdatasafetyrefstaticinternetfreedomin much like aadhaar verification schools forced ensure participation students parents though consent parents mandatory parents seem either know option given opportunity say parents pointed outhttpswwwhindustantimescomcitiesmumbainewsparentsconcernedasapaaridconsentformrequiresstudentspersonalinformationhtmlrefstaticinternetfreedomin option deny consent aadhaar consent form handed part apaar enrollment schools also reported grappling uncertaintyhttpspodcastsapplecominpodcasttelanganasdetentionlawdeathpenaltyforindiansidi proceed parent refuses complete form moe secretary instructed schools hold special parentteachers meetings educate parents benefits apaar initiative encourage give consent towards creating students apaar ids encouragement easily take form armtwisting coercion taking consent without providing enough information schools pressured meeting certain implementation targets apaar framework may also increasingly resort coercion force get parents give consent process problematic rural areas parents may completely understand consequences giving consent due low data tech literacy may end easily giving consent told teachers instances millions rural nomadic destitute marginalised individuals denied basic necessities food rations students refused school admissionshttpswwwdeccanheraldcomindiachildrenwithoutaadhaarshutoutofschoolhtmlrefstaticinternetfreedomin possessing aadhaar card welldocumented fear around implementing apaar id basis education india rooted past experiences explored concerns depth previous post also shed light fact pushed top bharatiya janata party lok sabha elections manifesto pushed universal adoption problematic apaar framework achieve implementation one nation one student id automated permanent academic account registry apaar store academic qualifications credit scores certificates among others students preprimary higher education manifesto stated party power another term may continue move towards implementation goal without requisite checks place catastrophic privacy autonomy students across india unless resist community believe way framework created invasive design rolled back help us watch watchmen become iff memberhttpsinternetfreedomindonate ",
    "cleaned_title": "dpis shadows meity education ministry simply refuse open apaar student id",
    "cleaned_selftext": "iff needs support ever details end posthttpspreviewredditwdrhfgyxowdpngwidthformatpngautowebpsdaebbdabefdbaadaec apaar aadhaarbased unique id project students across india initiated july declared digital public infrastructure earlier year asked policy documents nodal ministries transferred rti request times still dont answer tldr automated permanent academic account registry apaar framework aadhaarbased unique id project students across india initiated july declared digital public infrastructure earlier year states uts across india passed directions start enrolling students programme based aadhaar cards hold special parentteacher meetings seek parental consent parents project evolves seems voluntary paper mandatory practice may easily clarified lawpolicy document operationalising projectbut none asked policy documents nodal ministries stonewalled information stated working played blame game departments transferred rti request internally times counting still answer post unpacks means student privacy autonomy important documents iffs post apaar id dated may linkhttpsinternetfreedominstudentidzerolaworpolicy iffs post apaar id dated october linkhttpsinternetfreedominaadhaarbasedstudentidraisesalarmsforprivacyrefstaticinternetfreedomin iffs letter ministry education apaar id linkhttpsdrivegooglecomfiledxyojovpfkxipzmegsmyunnifpviewuspsharingrefstaticinternetfreedomin bjps election manifesto linkhttpsdrivegooglecomfiledyobyuhjgdfkbkldrzefhlymdpiskokviewuspdrivelinkrefstaticinternetfreedomin ministry educations thematic session ncrf apaar powerpoint presentation linkhttpswwweducationgovinsitesuploadfilesmhrdfilesnepthematicsessionncrfpdfrefstaticinternetfreedomin ministry educations thematic session ncrf apaar final report linkhttpswwweducationgovinsitesuploadfilesmhrdfilesnepabssreportsessionpdfrefstaticinternetfreedomin background back july ministry education moe conjunction ministry electronics meity introduced one student one unique id scheme comprising apaar framework panel discussionhttpswwweducationgovinsitesuploadfilesmhrdfilesnepabssreportsessionpdfrefstaticinternetfreedomin implementation national education policy nep objective issue unique ids students based aadhaar number store lifelong longitudinal records educational scores achievements related statistics enrollment process began october moe wrotehttpsindianexpresscomarticlecitiesmumbaischoolsaskedtotakeparentsconsentforstudentsnewapaarcardrefstaticinternetfreedominlnsnedjjhrpvoqf state chief secretaries asking schools persuade students creating apaar ids based authenticated aadhaars could find copy missive public portals schools uploaded websites archived herehttpsdrivegooglecomfiledfjzfwkzgpsficdtdlidwnilfckpaqgviewuspsharingrefstaticinternetfreedomin line globally recognised legal principles schools require parental consent enrol students registry students minors ie age thus moe secretary letter also persuaded schools hold special parentsteachers meetings get consent parents enrol children apaar framework apaar enrollment underway breakneck speed across indian schools noticed glaring lack guiding documents public domain found directions issued project uploaded schoolsparents nodal ministries thus filed host right information rti requests authorities traced detail previous posthttpsinternetfreedominstudentidzerolaworpolicy summarise filed first rtihttpsdrivegooglecomfiledtbexahosxfidthnwhcfnalohviewuspsharingrefstaticinternetfreedomin october seeking copy letter department school education literacy moe dosel state chief secretaries education commissioners creation apaar ids received response filed secondhttpsdrivegooglecomfilednyxthvwxsuptgpqoyxiodivhtunviewuspsharingrefstaticinternetfreedomin thirdhttpsdrivegooglecomfiledjkotyykgqzmoufcyyqxstmwviewuspsharingrefstaticinternetfreedomin rtis later october moe asking status scheme backing law andor policy documents details enrollment received response filed fourth rtihttpsdrivegooglecomfileddniqnayfjklsolzdchglbkgpzqviewuspsharingrefstaticinternetfreedomin dosel november asking questions stressing lawpolicy document authorities using implement apaar id framework time received responsehttpsdrivegooglecomfilednbdoewnvsyctydyoxslynrsksuviewuspsharingrefstaticinternetfreedomin december noting implementation apaar detailed plan covering aspects framing policies guidelines criteria empanelment schools etc development stage note stage crore studentshttpswwwfreepressjournalineducationgovernmenttoexpandonenationonestudentidinitiativetoschoolsrefstaticinternetfreedomin enrolled apaar id without lawpolicy place filed fifth rtihttpsdrivegooglecomfiledqgsnvxqxskcljfnrforgxrtpyviewuspsharingrefstaticinternetfreedomin asking earlier order sent chief secretaries finally received copyhttpsdrivegooglecomfiledwtgijtxyabciinrxknvfooxuviewuspsharingrefstaticinternetfreedomin giving yet filed sixth rtihttpsdrivegooglecomfileddautztowqklzjexmtxycogzljeviewuspsharingrefstaticinternetfreedomin december moe asking grounding lawpolicy initiative receive response implementation apaar detailed plan covering aspects framing policies guidelines criteria empanelment schools etc development stage waited february made another attempthttpsdrivegooglecomfileduqaeshbllsvpbinhvoaulhlofuviewuspsharingrefstaticinternetfreedomin get questions answered received interesting responsehttpsdrivegooglecomfiledqfwzjuvssnwyehxthwmqmjlkxviewuspsharingrefstaticinternetfreedomin rti transferred education department digital india corporation meity read ministry education moe inform standard operating procedure sop policy creating verifying apaar ids however ministry electronics information technology meity implementing body developed portal follows data privacy protection act dpda important note since students learners minors years age parental guardian consent necessary authentication creation apaar id rti first revealed meity fact collaborator apaar project mystery legislation data privacy protection act also signalled apaar id aggressively implemented without law policy written back argued previous posthttpsinternetfreedominaadhaarbasedstudentidraisesalarmsforprivacyrefstaticinternetfreedomin makes framework unconstitutional ministries simply shedding accountability comes questions privacy legality claiming use legislations even enacted yet april filed another rtihttpsdrivegooglecomfiledfrzuvijhhardafkukgmlyybeyousdviewuspdrivelinkrefstaticinternetfreedomin meity time asking lawpolicy document following implementing scheme since moe seems shrugged responsibility answering question april also requestedhttpsdrivegooglecomfiledqgwhzbxbatosizwoccnpgfzuaviewuspsharingrefstaticinternetfreedomin one specific document moe apaar id gathered hour long videohttpswwwyoutubecomwatchvkqfrdvcagrefstaticinternetfreedomin minister education school principals talking praise project likely contain policy implementation plan apaar id running circles april rti request requestedhttpsdrivegooglecomfiledqgwhzbxbatosizwoccnpgfzuaviewuspsharingrefstaticinternetfreedomin specific policy document moe contained two questions please provide copy document titled schooling access quality presented moe rd national conference chief secretaries held new delhi december please provide copy responses communication discussions debates outcome documents meeting relating national education policy apaar id april present day ie late october simple rti request transferred times cyclic manner four departments meity moe department school education literacy dosel department higher education dohed department electronics ditec digital india corporation melab funnily enough almost always order every department ascribing new rti number transfer history looks like doselre dohedrt ditecrt melabrt dohedrt ditecrt melabrt doselrt dohedrt ditecrt melabrt doselrt dohedrt ditecrt melabrt doselrt dohedrt ditecrt melabrt dohedrt ditecrt melabrt dohedrt ditecrt melabrt dohedrt dohedrt dohedrt dohedrt doselrt dohedrt dohedrt august received partial response httpsdrivegooglecomfiledlkntybpyxdhaalmjjyjrqqhviewuspsharingto second question rti asked discussions communications outcome documents meeting held discuss nep reply mentioned copy nep details pertaining policy available websitehttpswwweducationgovinnepaboutnep website comprised policy indicate discussions communications involved policy formulation late october still waiting specific document asked reportedly presented december follows consistent trend evading question regarding apaar id made dangerous given speed enrollment conducted id states aboard apaar bandwagon following july circular many states kickstarted apaar id enrollment schools within territory nep compliance processes others started join rajasthan chandigarh reportedhttpswwwmedianamacomnationaledupolicylinkedapaaridtoberolledoutinchandigarhandrajasthan start enrollment october odisha plannedhttpstimesofindiaindiatimescomcitybhubaneswargovttomeetstudentsparentsbeforeapaaridrolloutarticleshowcms roll apaar registration starting october october reportedhttpswwwthehinducomnewsnationalandhrapradeshallschoolmanagementsinaptoldtocreateapaaridsforstudentsofclassesandarticleece hindu andhra pradesh also directed school managementboards create apaar ids students september gujarat startedhttpswwwgujaratsamacharcomnewsgujaratapaaridwillbecreatedfordigitalrecordsoflakhstudentsfromclassto enrollment aims onboard lakh students assam introducedhttpsdainikasamassamtribunecomassamonenationonestudentidapaaridregistrationbeginsforstudentsinassaminfinitescroll project chhattisgarh directedhttpswwwtelegraphindiacomindiachhattisgarhgovtdirectsalldistrictcollectorstofacilitatetheimplementationofapaaridschemecid district collectors facilitate implementation apaar id scheme states like jharkhandhttpstimesofindiaindiatimescomcityranchistaterollsoutonenationonestudentidforedumgmtarticleshowcms maharashtrahttpsthewireineducationmaharashtradirectsschoolstogetparentalconsentforstudentuniqueidsrefstaticinternetfreedomin education departments already implemented apaar id october facilitated special parentteacher meetings secure parental consent creation apaar ids however departments issued statements regarding whether creation apaar ids mandatory aside news reports schools colleges universities states started creation apaar ids even without official implementation scheme state governments worry per interpretation right privacy j retd ks puttaswamy v union india scc privacyinfringing measure state must satisfy five prong test justified reasonable restriction right first prong legality ie privacyinfringing measure must based law implementation apaar id continues worrying speeds without clear lawpolicy guiding document grounding transparency efforts asking lawpolicy framework resulted ministries either stating drafted sending rti requests indefinite expedition around departments transfers even policy since drafted made public various schools started enrollment back october absence thereof highly privacyintrusive scheme implemented aggressively across states without specific lawpolicy guiding also without active data protection law scheme linked aadhaar voluntary paper also seems following footsteps aadhaar actually mandatory practice educationists believehttpswwwfreepressjournalineducationapaariduniquestudentidentificationraisesconcernsaboutdatasafetyrefstaticinternetfreedomin much like aadhaar verification schools forced ensure participation students parents though consent parents mandatory parents seem either know option given opportunity say parents pointed outhttpswwwhindustantimescomcitiesmumbainewsparentsconcernedasapaaridconsentformrequiresstudentspersonalinformationhtmlrefstaticinternetfreedomin option deny consent aadhaar consent form handed part apaar enrollment schools also reported grappling uncertaintyhttpspodcastsapplecominpodcasttelanganasdetentionlawdeathpenaltyforindiansidi proceed parent refuses complete form moe secretary instructed schools hold special parentteachers meetings educate parents benefits apaar initiative encourage give consent towards creating students apaar ids encouragement easily take form armtwisting coercion taking consent without providing enough information schools pressured meeting certain implementation targets apaar framework may also increasingly resort coercion force get parents give consent process problematic rural areas parents may completely understand consequences giving consent due low data tech literacy may end easily giving consent told teachers instances millions rural nomadic destitute marginalised individuals denied basic necessities food rations students refused school admissionshttpswwwdeccanheraldcomindiachildrenwithoutaadhaarshutoutofschoolhtmlrefstaticinternetfreedomin possessing aadhaar card welldocumented fear around implementing apaar id basis education india rooted past experiences explored concerns depth previous post also shed light fact pushed top bharatiya janata party lok sabha elections manifesto pushed universal adoption problematic apaar framework achieve implementation one nation one student id automated permanent academic account registry apaar store academic qualifications credit scores certificates among others students preprimary higher education manifesto stated party power another term may continue move towards implementation goal without requisite checks place catastrophic privacy autonomy students across india unless resist community believe way framework created invasive design rolled back help us watch watchmen become iff memberhttpsinternetfreedomindonate",
    "cleaned_comments": "one side apaar student id side students take part politics really appreciate posts im member make donations every youre great work please keep thank fighting good fight welcome india forgot coercion nephews school straight punish students submitting form whats point consent form carry things manner",
    "light_cleaned_title": "DPIs in the shadows: MeitY and Education Ministry simply refuse to open up about the APAAR student ID",
    "light_cleaned_selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/w8drhfgyxowd1.png?width=1600&format=png&auto=webp&s=0294daebb88d9a7b78e94f3db955a6a53d17a6ec) APAAR, an Aadhaar-based unique ID project for students across India, was initiated in July 2023 and declared a ‘digital public infrastructure’ earlier this year. When asked for its policy documents, nodal Ministries transferred our RTI request 30+ times. We still don't have an answer. # tl;dr The Automated Permanent Academic Account Registry (“**APAAR**”) framework is an Aadhaar-based unique ID project for students across India initiated in July 2023 and declared a ‘digital public infrastructure’ earlier this year. States and UTs across India have passed directions to start enrolling students to the programme based on their Aadhaar cards and hold special parent-teacher meetings to seek parental consent from parents for the same. As the project evolves, it seems to be voluntary on paper but mandatory in practice. This may be easily clarified from the law/policy document operationalising the project—but there is none. When asked for its policy documents, nodal Ministries stonewalled information, stated that they were ‘working on it’, played the blame game with other departments, and transferred our RTI request internally 30+ times (and counting). We still do not have an answer. This post unpacks what this means for student privacy and autonomy. # Important documents: 1. IFF’s post on APAAR ID dated May 01, 2024 ([link](https://internetfreedom.in/student-id-zero-law-or-policy/)) 2. IFF’s post on APAAR ID dated October 27, 2023 ([link](https://internetfreedom.in/aadhaar-based-student-id-raises-alarms-for-privacy/?ref=static.internetfreedom.in)) 3. IFF’s Letter to the Ministry of Education on the APAAR ID ([link](https://drive.google.com/file/d/1xyOjovP13FKX2iPZmEgS61mY2Un6NifP/view?usp=sharing&ref=static.internetfreedom.in)) 4. BJP’s 2024 Election Manifesto ([link](https://drive.google.com/file/d/1yo2BYuHjgDf9kbklDRzEFHLyMdPiskOK/view?usp=drive_link&ref=static.internetfreedom.in)) 5. Ministry of Education’s Thematic Session on NCrF and APAAR (Powerpoint Presentation) ([link](https://www.education.gov.in/sites/upload_files/mhrd/files/nep/Thematic_Session_NCrF.pdf?ref=static.internetfreedom.in)) 6. Ministry of Education’s Thematic Session on NCrF and APAAR (Final Report) ([link](https://www.education.gov.in/sites/upload_files/mhrd/files/nep/ABSS_Report_Session_3.pdf?ref=static.internetfreedom.in)) # Background Back in July 2023, the Ministry of Education (“**MoE**”) in conjunction with the Ministry of Electronics and IT (“**MeitY**”) introduced a ‘one student, one unique ID’ scheme comprising the APAAR framework through a [panel discussion](https://www.education.gov.in/sites/upload_files/mhrd/files/nep/ABSS_Report_Session_3.pdf?ref=static.internetfreedom.in) on the implementation of the 2020 National Education Policy (“**NEP 2020**”) with an objective to issue unique IDs to students based on their Aadhaar number and store life-long longitudinal records of their educational scores, achievements, and related statistics, against it. The enrollment process began in October 2023, when MoE [wrote](https://indianexpress.com/article/cities/mumbai/schools-asked-to-take-parents-consent-for-students-new-apaar-card-8983447/?ref=static.internetfreedom.in#lnsnedj5jhr6pvo1qf) to state chief secretaries asking schools to persuade students into creating APAAR IDs, which will be based on and authenticated through their Aadhaars. We could not find a copy of this missive through public portals, but some schools have uploaded it to their websites and we have [archived it here](https://drive.google.com/file/d/1FjzfW8kzGpSficDtdlIdWNil0FckpAQg/view?usp=sharing&ref=static.internetfreedom.in). In line with globally recognised legal principles, schools require parental consent to enrol students into the registry as the students are minors, i.e. under the age of 18. Thus the MoE Secretary, through the letter, also persuaded schools to hold a “special” parents’-teachers’ meetings “to get the consent of parents” to enrol their children into the APAAR framework. Through all of this, and while APAAR enrollment was underway at breakneck speed across Indian schools, we noticed a glaring lack of guiding documents in the public domain and found that any and all directions issued under the project were uploaded by schools/parents, and not by the nodal Ministries. Thus we filed a host of Right to Information (RTI) requests with both authorities, which is traced in detail in a [previous post](https://internetfreedom.in/student-id-zero-law-or-policy/). To summarise: 1. We filed our [first RTI](https://drive.google.com/file/d/19tbEXAh9oSX4fI7d3Th3nwhcFna9l-oh/view?usp=sharing&ref=static.internetfreedom.in) on October 19, 2023 seeking a copy of the letter from the Department of School Education and Literacy, MoE (“**DOSEL**”) to all state chief secretaries and education commissioners for the creation of APAAR IDs, and received no response. 2. We filed our [second](https://drive.google.com/file/d/1nyxt_hVWXs1upTGpQ30OyxiO-diVhtUN/view?usp=sharing&ref=static.internetfreedom.in) and [third](https://drive.google.com/file/d/1jkO3TYy_KGQz_0mOUfc3yYqx81ST2MW4/view?usp=sharing&ref=static.internetfreedom.in) RTIs later in October with MoE asking about the status of the scheme, its backing law and/or policy documents, and other details of enrollment. We, again, received no response. 3. We filed a [fourth RTI](https://drive.google.com/file/d/1605DNI2QnAYfJk2LsoLZ8dchglbKgpzq/view?usp=sharing&ref=static.internetfreedom.in) with the DOSEL on November 2, 2023 asking the same questions again, and stressing on the law/policy document the authorities are using to implement the APAAR ID and framework. This time, we [received a response](https://drive.google.com/file/d/1N-BDoewn5VsYCtY2d8y1OXSLYnr1skSu/view?usp=sharing&ref=static.internetfreedom.in) on December 1, 2023, noting: “*for implementation of APAAR, detailed plan covering all aspects such as framing up of policies, guidelines, criteria for empanelment of schools etc are under development stage*.” Note that by this stage, about [2.2 Crore students](https://www.freepressjournal.in/education/government-to-expand-one-nation-one-student-id-initiative-to-schools?ref=static.internetfreedom.in) had been enrolled for the APAAR ID without a law/policy in place. 4. Then we filed a [fifth RTI](https://drive.google.com/file/d/1qG_SNvXQxSKCljfNRf2org1_7xrtPY0_/view?usp=sharing&ref=static.internetfreedom.in) asking for the earlier order sent to chief secretaries, and finally received a [copy](https://drive.google.com/file/d/1W-TgiJTxY0abC5Ii6nRx4KnvfO7oX6-u/view?usp=sharing&ref=static.internetfreedom.in). 5. Not giving up yet, we filed a [sixth RTI](https://drive.google.com/file/d/1d-4AUtztOW71QKLzje4XmTXYcoGZl4je/view?usp=sharing&ref=static.internetfreedom.in) on December 28, 2023 with MoE, asking once again about the grounding law/policy for this initiative, only to receive the same response again: “*for implementation of APAAR, detailed plan covering all aspects such as framing up of policies, guidelines, criteria for empanelment of schools etc are under development stage*.” 6. So we waited, and on February 16, 2024, made another [attempt](https://drive.google.com/file/d/1uq2Ae0sHBL7lS9vPbinhvoA3ULhlo1Fu/view?usp=sharing&ref=static.internetfreedom.in) to get these questions answered, and received an interesting [response](https://drive.google.com/file/d/11_0Qf-WzJUVsSnWyEhXTH7wM4Q2Mjlkx/view?usp=sharing&ref=static.internetfreedom.in). The RTI, which was transferred by the Education Department to Digital India Corporation, MeitY, read: “*\\[t\\]he Ministry of Education (MoE) will inform about the Standard Operating Procedure (SoP) and policy for creating/ verifying the APAAR IDs. However, the Ministry of Electronics and Information Technology (MeitY), the implementing body, has developed the portal and follows the Data Privacy and Protection Act (DPDA). It is important to note that since students/ learners are minors (below 18 years of age), parental/ guardian consent is necessary for the authentication/ creation of the APAAR ID*.” The RTI first revealed that MeitY was in fact a collaborator on the APAAR project (and had a mystery legislation ‘Data Privacy and Protection Act’?). It also signalled that 1) APAAR ID is being aggressively implemented without any law or policy written down to back it, which as we argued in our [previous post](https://internetfreedom.in/aadhaar-based-student-id-raises-alarms-for-privacy/?ref=static.internetfreedom.in) makes the framework unconstitutional, and 2) the Ministries are simply shedding all accountability when it comes to questions about privacy and legality, and are claiming to use legislations that have not even been enacted yet. 1. In April 2024, [filed another RTI](https://drive.google.com/file/d/1fR-zuvIjhh8aRdaFkUKgm_lyyBEyOUsd/view?usp=drive_link&ref=static.internetfreedom.in) with MeitY this time, asking what law/policy document they are following in implementing the scheme, since MoE seems to have shrugged off the responsibility of answering that question. 2. In April 2024, we also [requested](https://drive.google.com/file/d/1QGwHZbxb9A7tO_-s2i6zwOC7cNPgfzua/view?usp=sharing&ref=static.internetfreedom.in) one specific document from MoE about APAAR ID which (as gathered from a [03:38:18 hour long video](https://www.youtube.com/watch?v=kqFRd9V8cag&ref=static.internetfreedom.in) of the Minister of Education and school principals talking praise about the project) was likely to contain the policy implementation plan for APAAR ID. # Running in circles Our April 2024 RTI request, where we [requested](https://drive.google.com/file/d/1QGwHZbxb9A7tO_-s2i6zwOC7cNPgfzua/view?usp=sharing&ref=static.internetfreedom.in) a specific policy document from MoE, contained two questions: 1. Please provide a copy of the document titled – Schooling: Access and Quality – presented by MoE at the 3rd National Conference of Chief Secretaries held in New Delhi on December 28-29, 2023; and 2. Please provide a copy of any responses, communication, discussions, debates or outcome documents from this meeting relating to National Education Policy 2020 and APAAR ID. Between April and present day, i.e. late October 2024, this simple RTI request has been **transferred more than 30 times** in a cyclic manner between four departments in MeitY and MoE: Department of School Education & Literacy (“**DOSEL**”); Department of Higher Education (“**DOHED**”); Department of IT & Electronics (“**DITEC**”); and Digital India Corporation (or “**MELAB**”). And funnily enough, almost always in that order! With every department ascribing it a new RTI number, the transfer history looks like this: 1. DOSEL/R/E/24/01795 2. DOHED/R/T/24/00425 3. DITEC/R/T/24/00267 4. MELAB/R/T/24/00078 5. DOHED/R/T/24/00443 6. DITEC/R/T/24/00286 7. MELAB/R/T/24/00081 8. DOSEL/R/T/24/00520 9. DOHED/R/T/24/00467 10. DITEC/R/T/24/00299 11. MELAB/R/T/24/00123 12. DOSEL/R/T/24/00557 13. DOHED/R/T/24/00503 14. DITEC/R/T/24/00315 15. MELAB/R/T/24/00131 16. DOSEL/R/T/24/00597 17. DOHED/R/T/24/00550 18. DITEC/R/T/24/00332 19. MELAB/R/T/24/00138 20. DOHED/R/T/24/00615 21. DITEC/R/T/24/00355 22. MELAB/R/T/24/00144 23. DOHED/R/T/24/00657 24. DITEC/R/T/24/00375 25. MELAB/R/T/24/00151 26. DOHED/R/T/24/00715 27. DOHED/R/T/24/00715/1 28. DOHED/R/T/24/00715/2, 29. DOHED/R/T/24/00715/3 30. DOSEL/R/T/24/00749 31. DOHED/R/T/24/00906 32. DOHED/R/T/24/00906/1 On August 12, 2024 we received a [partial response ](https://drive.google.com/file/d/1LK20-nty6BpY3xDh6AA_l5MJJYjr-qQH/view?usp=sharing)to the second question of our RTI where we had asked for discussions, communications or outcome documents from the meeting which was held to discuss NEP 2020. In the reply, they mentioned that the copy of the NEP 2020 and all details pertaining to this policy is available on this [website](https://www.education.gov.in/nep/about-nep). This website only comprised the policy itself and did not indicate any discussions or communications which were involved in the policy formulation. It is now late October and we are still waiting for the specific document that we had asked for which had been reportedly presented in December 2023. This follows a consistent trend of evading any question regarding APAAR ID, made all the more dangerous given the speed at which enrollment is being conducted under the ID. # All states aboard the APAAR bandwagon Following the July 2023 circular, many states kick-started APAAR ID enrollment for schools within their territory under their NEP 2020 compliance processes, and others have now started to join in. Rajasthan and Chandigarh are [reported](https://www.medianama.com/2024/10/223-national-edu-policy-linked-apaar-id-to-be-rolled-out-in-chandigarh-and-rajasthan/) to start enrollment in October 2024. Odisha [planned](https://timesofindia.indiatimes.com/city/bhubaneswar/govt-to-meet-students-parents-before-apaar-id-rollout/articleshow/113681233.cms) to roll out APAAR registration starting October 15, 2024. On October 01, 2024 as [reported](https://www.thehindu.com/news/national/andhra-pradesh/all-school-managements-in-ap-told-to-create-apaar-ids-for-students-of-classes-9-and-10/article68704861.ece) in The Hindu, Andhra Pradesh has also directed school management/boards to create APAAR IDs for students. As of September 2024, Gujarat has [started](https://www.gujaratsamachar.com/news/gujarat/apaar-id-will-be-created-for-digital-records-of-28-lakh-students-from-class-9-to-12) enrollment and aims to onboard 28 lakh students, Assam has [introduced](https://dainikasam.assamtribune.com/assam/one-nation-one-student-id-apaar-id-registration-begins-for-students-in-assam-1552262?infinitescroll=1) the project, Chhattisgarh [directed](https://www.telegraphindia.com/india/chhattisgarh-govt-directs-all-district-collectors-to-facilitate-the-implementation-of-apaar-id-scheme/cid/2050927) all district collectors to facilitate the implementation of the APAAR ID scheme. In states like [Jharkhand](https://timesofindia.indiatimes.com/city/ranchi/state-rolls-out-one-nation-one-student-id-for-edu-mgmt/articleshow/104569234.cms), and [Maharashtra](https://thewire.in/education/maharashtra-directs-schools-to-get-parental-consent-for-student-unique-ids/?ref=static.internetfreedom.in), education departments had already implemented the APAAR ID in October 2023 and facilitated special parent-teacher meetings to secure parental consent for the creation of APAAR IDs. However, the departments have not issued any statements regarding whether the creation of APAAR IDs is mandatory. Aside from these news reports, schools, colleges and universities in some states have started the creation of APAAR IDs even without the official implementation of the scheme by the state governments. # Why worry? As per interpretation of the right to privacy under *J (Retd) K.S Puttaswamy v. Union of India \\[(2019) 1 SCC 1\\]*, any privacy-infringing measure by the State must satisfy a five prong test for it to be a justified and reasonable restriction on the right. The first prong is legality, i.e., the privacy-infringing measure must be based in law. The implementation of the APAAR ID continues at worrying speeds without a clear law/policy or guiding document grounding it. All our transparency efforts in asking for the law/policy framework has resulted in the Ministries either stating it is being drafted, or sending our RTI requests on an indefinite expedition around departments with 30+ transfers. Even if the policy has since been drafted but not made public, various schools had started enrollment back in October 2023, in the absence thereof. A highly privacy-intrusive scheme is being implemented aggressively across states without not only a specific law/policy guiding it, but also without an active data protection law. As a scheme that is linked with Aadhaar but ‘voluntary’ on paper, it also seems to be following in the footsteps of Aadhaar, in actually being ‘mandatory’ in practice. [Educationists believe](https://www.freepressjournal.in/education/apaar-id-unique-student-identification-raises-concerns-about-data-safety?ref=static.internetfreedom.in) that, much like Aadhaar verification, schools will be forced to ensure the participation of all students and parents. Though the consent of parents is mandatory, parents seem to either not know they have an option, or are not given an opportunity to say “no”. [Some parents have pointed out](https://www.hindustantimes.com/cities/mumbai-news/parents-concerned-as-apaar-id-consent-form-requires-students-personal-information-101697656934269.html?ref=static.internetfreedom.in) that there is no option to deny consent on the Aadhaar consent form handed to them as part of the APAAR enrollment. Schools are also reported to be [grappling with the uncertainty](https://podcasts.apple.com/in/podcast/telanganas-detention-law-death-penalty-for-8-indians/id1406730235?i=1000633026395) of how to proceed if a parent refuses to complete the form. The MoE Secretary had instructed schools to hold “special” parent-teachers’ meetings to educate parents on the benefits of APAAR initiative and encourage them to give consent towards creating students’ APAAR IDs. This “encouragement” can easily take the form of arm-twisting, coercion, or taking consent without providing enough information. As schools are pressured into meeting certain implementation targets for the APAAR framework, they may also increasingly resort to coercion or force to get parents to give their consent. This process is more problematic in rural areas as the parents may not completely understand the consequences of giving consent due to low data or tech literacy, and may end up easily giving consent because they were told to do so by teachers. Instances of millions of rural, nomadic, destitute, or marginalised individuals being denied basic necessities, such as food rations, and students being [refused school admissions](https://www.deccanherald.com/india/children-without-aadhaar-shut-out-of-school-1131133.html?ref=static.internetfreedom.in) for not possessing an Aadhaar card are well-documented. The fear around implementing APAAR ID as a basis for education in India is rooted in these past experiences. We explored these concerns in depth in our previous post, which also shed light on the fact that this is being pushed from the top. The Bharatiya Janata Party, in its 2024 Lok Sabha Elections Manifesto, pushed for the universal adoption of the problematic APAAR framework. “*We will achieve 100% implementation of ‘One Nation, One Student ID’ through the Automated Permanent Academic Account Registry (APAAR) to store academic qualifications, credit scores and certificates, among others for students from pre-primary to higher education*”, the Manifesto stated. With the party in power for another term, we may continue to move towards this 100% implementation goal without the requisite checks in place. This can be catastrophic for the privacy and autonomy of students across India, unless we resist it as a community. We believe that the way that this framework is created is invasive by design and should be rolled back. Help us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)",
    "light_cleaned_comments": "in one side, there is APAAR student ID. on the other side, students to take part in politics. I really appreciate these posts. I'm not a member but make donations every once in a while. You're doing great work, please keep it up. Thank you for fighting the good fight <3 Welcome to india Forgot about coercion. In my nephew's school they straight up punish students for not submitting the form. What's the point of \" consent \" form if they carry out things in this manner."
}