{
    "id": "uc10zb",
    "title": "Bi-Weekly Gaming Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/uc10zb/biweekly_gaming_discussion_thread/",
    "selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!)\n\nWhat game are you looking forward to? Are you a developer? Show us your wares!\n\nPlease don't just list the names of games, make sure to write a word or two about them as well.\n\nCheck out r/IndianGaming! They are an active community and also host a few co-op sessions.\n\n**Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/xagdqefyv8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=f975f1c3093a3d9598a1da39854b03d1250bd55d",
    "flair": "Scheduled",
    "score": 6,
    "num_comments": 17,
    "created_utc": 1650936609,
    "convurl": "https://b.thumbs.redditmedia.com/1yW1vnOXXLbj7GjIDC4BNEociU_mAxBuQABJNbaBbBc.jpg",
    "comments": [
        "Assassin's Creed Syndicate, been on a run to experience the Assassin's Creed franchise lately.\n\nSyndicate, boy oh boy is an under-rated gem. It's a shame that after the epic fail launch fest of Unity, people downright ignored this game.\n\nRight now, I am looking forward to the Witcher 3 upgrade.",
        "Been playing Splinter Cell: Pandora Tomorrow. \n\nI've become a huge fan of Splinter Cell ever since I tried Chaos Theory. There's just something about using light and shadows to sneak and infiltrate. \n\nToo bad Ubisoft decided to fuck the franchise.",
        "Ubisoft is shit man... They are just trying to mint money now... Idk what the head devs and product managers are thinking... Sam Fisher still had many stories to tell...",
        "Valo, Apex, R6 PUBG at times... Just MP games... SP is gone monotonous... But...\n\nGhostwire Tokyo is beauty... I'd suggest everyone to try it out at least...",
        "Played Metal Gear 2 and Metal Gear Solid back to back. Grey Fox's story now hits harder while playing MGS.",
        "Football manager 22, been playing since two weeks.\n\nMessage me if anyone's interested in doing an online save",
        "I am not a hardcore gamer but I have ordered an xbox series X over a PS5. I dont really play online that much. Just single player stuff for me. What are the disadvantages of owning an xbox?",
        "Playstation has better single player exclusives.",
        "aah, like?",
        "Bloodborne, The Last of Us, Days Gone, Uncharted, Horizon Zero Dawn, God of War to name a few.",
        "ah I fucked up. Was looking forward to playing ragnarok",
        "Was playing Vampire Survivors a lot.\n\nNow gone back to Hollow Knight.\n\nAlso just bought AOE 2: Definitive Edition. Looking forward to that.",
        "got back into oolite after a long while. controls are usually confusing for beginners but what a chill game. also got back into taiko, but i can't move beyond five stars to save my life 🗿",
        "&gt;oolite \n\nAyo AOE2(the original edition) was one of my first pc games.  Great game",
        "Try getting gamepass ultimate and play any game from the hundreds of listed one that might interest you",
        "Elden ring. Now I'll see you guys in a month..;)",
        "It will take me months 🥲"
    ],
    "cleaned_text": "biweekly gaming discussion thread playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly gaming discussion thread",
    "cleaned_selftext": "playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "assassins creed syndicate run experience assassins creed franchise lately syndicate boy oh boy underrated gem shame epic fail launch fest unity people downright ignored game right looking forward witcher upgrade playing splinter cell pandora tomorrow ive become huge fan splinter cell ever since tried chaos theory theres something using light shadows sneak infiltrate bad ubisoft decided fuck franchise ubisoft shit man trying mint money idk head devs product managers thinking sam fisher still many stories tell valo apex r pubg times mp games sp gone monotonous ghostwire tokyo beauty id suggest everyone try least played metal gear metal gear solid back back grey foxs story hits harder playing mgs football manager playing since two weeks message anyones interested online save hardcore gamer ordered xbox series x ps dont really play online much single player stuff disadvantages owning xbox playstation better single player exclusives aah like bloodborne last us days gone uncharted horizon zero dawn god war name ah fucked looking forward playing ragnarok playing vampire survivors lot gone back hollow knight also bought aoe definitive edition looking forward got back oolite long controls usually confusing beginners chill game also got back taiko cant move beyond five stars save life gtoolite ayo aoethe original edition one first pc games great game try getting gamepass ultimate play game hundreds listed one might interest elden ring ill see guys month take months",
    "light_cleaned_title": "Bi-Weekly Gaming Discussion Thread",
    "light_cleaned_selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!) What game are you looking forward to? Are you a developer? Show us your wares! Please don't just list the names of games, make sure to write a word or two about them as well. Check out r/IndianGaming! They are an active community and also host a few co-op sessions. **Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Assassin's Creed Syndicate, been on a run to experience the Assassin's Creed franchise lately. Syndicate, boy oh boy is an under-rated gem. It's a shame that after the epic fail launch fest of Unity, people downright ignored this game. Right now, I am looking forward to the Witcher 3 upgrade. Been playing Splinter Cell: Pandora Tomorrow. I've become a huge fan of Splinter Cell ever since I tried Chaos Theory. There's just something about using light and shadows to sneak and infiltrate. Too bad Ubisoft decided to fuck the franchise. Ubisoft is shit man... They are just trying to mint money now... Idk what the head devs and product managers are thinking... Sam Fisher still had many stories to tell... Valo, Apex, R6 PUBG at times... Just MP games... SP is gone monotonous... But... Ghostwire Tokyo is beauty... I'd suggest everyone to try it out at least... Played Metal Gear 2 and Metal Gear Solid back to back. Grey Fox's story now hits harder while playing MGS. Football manager 22, been playing since two weeks. Message me if anyone's interested in doing an online save I am not a hardcore gamer but I have ordered an xbox series X over a PS5. I dont really play online that much. Just single player stuff for me. What are the disadvantages of owning an xbox? Playstation has better single player exclusives. aah, like? Bloodborne, The Last of Us, Days Gone, Uncharted, Horizon Zero Dawn, God of War to name a few. ah I fucked up. Was looking forward to playing ragnarok Was playing Vampire Survivors a lot. Now gone back to Hollow Knight. Also just bought AOE 2: Definitive Edition. Looking forward to that. got back into oolite after a long while. controls are usually confusing for beginners but what a chill game. also got back into taiko, but i can't move beyond five stars to save my life 🗿 &gt;oolite Ayo AOE2(the original edition) was one of my first pc games. Great game Try getting gamepass ultimate and play any game from the hundreds of listed one that might interest you Elden ring. Now I'll see you guys in a month..;) It will take me months 🥲"
}