{
    "id": "17r9c68",
    "title": "Online video tells travellers not to fly Air India; poster denies message is a threat",
    "url": "https://bc.ctvnews.ca/online-video-tells-travellers-not-to-fly-air-india-poster-denies-message-is-a-threat-1.6637265",
    "selftext": "This one is from Canadian media.",
    "flair": "Crime",
    "score": 83,
    "num_comments": 11,
    "created_utc": 1699522451.0,
    "convurl": "https://external-preview.redd.it/3gZL4qQGVD8typbNCpWFa55qHz091HXOYuW6Gby7gto.jpg?auto=webp&s=b743d575b62a7f56886700bce0c4715e27f1c008",
    "comments": [
        "This Canada not returning wanted people who s really a bad.",
        "Can Air India not sue in US for loss of business due to this?",
        "Maybe but you have to prove it. There was only a vague threat by Pannun earlier that your life can be  in danger if you fly Air India (most likely to make his video go viral). He didn’t say his organization is going to blow up the plane, so his statement is quite vague. Pannun can even point to Air India’s safety record if taken to court. [Economic Times](https://m.economictimes.com/industry/transportation/airlines-/-aviation/air-india-trashes-report-that-ranks-its-safety-amongst-worst/articleshow/18186315.cms#). It was Indian government and Indian media’s interpretation that Pannun is going to bomb the plane.",
        "The guy who threatened this is from America",
        "OP username 💀 from the hub itself. Pannun is that you?",
        "LOL. Too lazy to change username and it was created way before farmers protests, etc. Pannun was unknown back then.",
        "\"Just don't fly air india because we are not capturing a free to rome terrorist who can bomb your flight\" -Canadian gov response summed up.",
        "Pannun, who lives in Washington, D.C said protest will take place in Delhi.\n\nWhat in this news is about Canada?",
        "No person with self respect should be flying Air India anyways.",
        "But India is also not returning scammers who scam westerners.",
        "There is a difference between terrorists and scammers"
    ],
    "cleaned_text": "online video tells travellers fly air india poster denies message threat one canadian media ",
    "cleaned_title": "online video tells travellers fly air india poster denies message threat",
    "cleaned_selftext": "one canadian media",
    "cleaned_comments": "canada returning wanted people really bad air india sue us loss business due maybe prove vague threat pannun earlier life danger fly air india likely make video go viral didnt say organization going blow plane statement quite vague pannun even point air indias safety record taken court economic timeshttpsmeconomictimescomindustrytransportationairlinesaviationairindiatrashesreportthatranksitssafetyamongstworstarticleshowcms indian government indian medias interpretation pannun going bomb plane guy threatened america op username hub pannun lol lazy change username created way farmers protests etc pannun unknown back dont fly air india capturing free rome terrorist bomb flight canadian gov response summed pannun lives washington dc said protest take place delhi news canada person self respect flying air india anyways india also returning scammers scam westerners difference terrorists scammers",
    "light_cleaned_title": "Online video tells travellers not to fly Air India; poster denies message is a threat",
    "light_cleaned_selftext": "This one is from Canadian media.",
    "light_cleaned_comments": "This Canada not returning wanted people who s really a bad. Can Air India not sue in US for loss of business due to this? Maybe but you have to prove it. There was only a vague threat by Pannun earlier that your life can be in danger if you fly Air India (most likely to make his video go viral). He didn’t say his organization is going to blow up the plane, so his statement is quite vague. Pannun can even point to Air India’s safety record if taken to court. [Economic Times](https://m.economictimes.com/industry/transportation/airlines-/-aviation/air-india-trashes-report-that-ranks-its-safety-amongst-worst/articleshow/18186315.cms#). It was Indian government and Indian media’s interpretation that Pannun is going to bomb the plane. The guy who threatened this is from America OP username 💀 from the hub itself. Pannun is that you? LOL. Too lazy to change username and it was created way before farmers protests, etc. Pannun was unknown back then. \"Just don't fly air india because we are not capturing a free to rome terrorist who can bomb your flight\" -Canadian gov response summed up. Pannun, who lives in Washington, D.C said protest will take place in Delhi. What in this news is about Canada? No person with self respect should be flying Air India anyways. But India is also not returning scammers who scam westerners. There is a difference between terrorists and scammers"
}