{
    "id": "13ehju1",
    "title": "YouTube India is getting out of control with ads.",
    "url": "https://www.reddit.com/gallery/13ehju1",
    "selftext": "I had to watch a 15 seconds of non skippable Condom ad when I'm with small kids or with my parents to watch a Car review.\nThe ads on the homepage sometimes show apps with pictures that are literally borderline porn.\nThe options for reporting doesn't have an option of NSFW.",
    "flair": "Rant / Vent",
    "score": 184,
    "num_comments": 121,
    "created_utc": 1683795269.0,
    "convurl": "https://i.redd.it/k1qt4r5a26za1.jpg",
    "comments": [
        "The ads are related to cookies.",
        "Condoms made you uncomfortable?",
        "Read the post fully.",
        "The info used to show this ad said \"time of the day\" and location",
        "I even saw the app ad (youtube homepage) once on my family member's phone who uses just WhatsApp and youtube.",
        "It's your karma showing up 😛\n\nUse revanced on your phone or install ublock origin or ad blocker on your computer browser.",
        "Visit r/piracy",
        "Ads on videos you watch\n\nThe ads that play on YouTube videos or Shorts you watch are tailored to your interests. They’re based on your Google Ad Settings, the content you’ve watched, and whether you’re signed in or not.\n\nWhen you're signed in, these anonymous signals may decide which ads you see:\n\nTypes of videos you’ve viewed\n\nThe apps on your device and your use of apps\nWebsites you visit\n\nAnonymous identifiers associated with your mobile device\n\nPrevious interactions with Google’s ads or advertising services\n\nYour geographic location\n\nAge range\n\nGender\n\nYouTube video interactions\n\nThese ads are based on the content of the videos you’ve watched whether you’re signed in or not.  \n\nhttps://support.google.com/youtube/answer/3181017?hl=en#:~:text=The%20ads%20that%20play%20on,of%20videos%20you've%20viewed",
        "I have a similar problem, i have been getting uncomfortable ads a lot on youtube, if their goal was to embarass me in front of my parents enough to make me shell out a few bucks for youtube premium it worked 😭",
        "Why should kids or parents not know about condoms?",
        "I think my YouTube also knows that I am single",
        "![gif](giphy|10JhviFuU2gWD6)\n\nThank you for the laugh.",
        "Use Vance or Newpipe.",
        "Download Firefox browser on your mobile and install ublock origin add on and enjoy YouTube without ads . Don't waste time using youtube app .",
        "I will rather watch a condom ad than that AJIO ad",
        "Use youtube Kids when with kids or parents",
        "I probably shouldn't watch youtube when any small kid or my parents are around",
        "it's your life",
        "When i was in my early teens i also used to get uncomfortable with condom ads, and used to think \"why do they show these in movie theaters or entertainment tv channels\" but in some time i understood that our society needs this, it needs the push for sex education and exposure from a young age, it won't make our kids into degenerates, it will do the opposite.",
        "There used to be an ad for Apollo tyres by AR Rahman.\nProbably watched it a million times.",
        "this one my favorite ad for [LIFE](https://youtu.be/ZVvmLakUtXE)",
        "There used to be ads for educating people.\nAdvertisement for condoms by brands like Kamasutra , durex are not to be confused with sex education.",
        "What i mean to say is that, ads like these expose people to things they might have been unaware of, questions like \"what does the condom do?\", \"why do they use it?\", \"how does it work?\" All pop up into curious minds which ultimately leads them to be more educated. Of course, sex education in schools and public notices by the government would still be far far better.",
        "It's an electric ad. /s",
        "Parents okay, what about 5yo kids? They should know about condoms?",
        "Why not?",
        "The type of ads are determined by your online activities and search history.\n\n![gif](giphy|H5C8CevNMbpBqNqFjl)",
        "Why? There's a reason censoring exists. Granted it's a bit too restrictive in India, but does it mean we just do away with it?",
        "It's a condom ad for just god sake. The quicker your kids know to use it the better",
        "Why sensor condom ads? Already the population is too much to deal with.",
        "Tell the kids that this is an \"adult topic\" that you'll talk about when they're of an appropriate age. This is a VERY basic parenting hack - you have to be consistent and reasonable about it with kids.",
        "I think 5 yos should be using YouTube kids and not mainstream YouTube.",
        "Something common for both condoms and Jio?\n\nDhan Dhana Dhan",
        "You can turn off ad personalization in google account settings. Thwn you'll get generic ads and not target ads like this",
        "Because condom ads can be overly sexualised and 5yo kids should not be exposed to overly sexual material.",
        "because they are erotic?",
        "India should mandate sex education",
        "You think condom is bad, typical Indian uncle mentality",
        "My ad personalisation has been turned off for years..\nI've had my ad personalisation, daily activity turned off and every other settings that can send data turned off for every app that i use.",
        "People talking here about sex education and awareness about condom for kids, probably never watched these ads. \nYou probably wont be able to find out that its a condom ad if not for last few seconds of branding.\nIts more about \"lasting long\"( yep, they say it in the ad), \"feels like nothing\" than about safe sex.",
        "Sex education for parents first!",
        "Actually his point is , even when not using these additional tricks or extra steps like using revanced or some shit like that , he should be able to choose to block 18+ ads .  \nThere is no such option in YouTube.",
        "Not always",
        "Bro if you're uncomfortable with condoms, you were not sex educated even with kids around they should show what a condom is",
        ">5yo kids should not be exposed to overly sexual material\n\ndo you have any idea why? I mean i agree they should not, why what is reason all cultures worldwide do it? Like philosophically whats the reason behind it?",
        "I don't think there is any philosophy, it's just weird, like boning your sister. I'm sure if you research it you will probably find some academic justification about how it affects children's development (but I don't know exactly how it does)",
        "Really? Did you even go through the post/comments?\nNobody is uncomfortable with condoms or sex education.\nWhat sex education has to do with \"lasting long\" , \"feels like nothing\" ?\nPretty dumb and vague comments.",
        "Dude stop making a big deal man \n\nI still remember getting weirded out at a condom ad with family and i now realize ( I am 20 btw ) that it was wrong. \nThis cringe at an ad is engraved into the brain since childhood that hawwww it's bad or something like that.\n\nOpen up and make it a common ass thing cause no matter how much you hide it behind the curtains everyone encounters sex at some point in their lives and it's a integral part of life too\n\nBest is to stay open and teaching what's right and what's wrong.",
        "man swiggy delivering condoms now?",
        "People commenting \"Advt. are trigger by your online activities\". \n\nNot always. I my humble opinion.\n\nPeople don't realise one can turn off targeted ad. Fun part is when you turn off targeted ad, then you start getting these wierd advt  for video calling apps, Stupid games, etc, that is trying to tell \"yahan sex milega\".\n\nWithin a week I turned on the targeted ad. Now I am freaked sometimes but never grossed out.",
        "Yes the ads of condoms are like borderline porn and it should be made more user discretionary but these ads are much needed in a country like ours which just crossed china on population.",
        "People here are really advocating for sex education for kids saying they should be comfortable with condom advertisements? Have you seen how overly sexualised those adds are? Wtf is wrong with you people ?",
        "Safe sex ads are not the same as these.\nCondom ads by companies is not same as sex education/ awareness.\nThese ad are just attractive marketing tools used by companies just like any other products. ( That's how promotions and marketing work )",
        "Seems like they have just started.\nI never knew.",
        "I don't really get it. What's the problem man? I used to see manforce/skore ad every over when i used to watch cricket with dad on TV. Also the ads are relative and targeted to your account history.",
        "Consider Youtube Premium if you dont want ads",
        "Teach em young",
        "Please use incognito for your deeds.",
        "I only can't block ads on my TV and since last three months I am almost only getting the same Comfort fabric conditioner ad when I use youtube tv",
        "Or just use it on Brave Browser, removes all the adds, damn I get irritated these days watching it on laptop becausee I am used to seeing no ads in my phone !",
        "Turn on recommendation based ads in your Google account if you don't want to see random weird ads like these.",
        "Stop being horny, you're phone knows what you want",
        "Buy premium.. 130 rs per month... peace of mind..",
        "I got YouTube premium. No ads whatsoever. It has been a saviour.",
        "no vanced is abandoned thanks to youtube, also this ad appears even in new accounts",
        "Bro take the premium It's like 180 rs a month. I have added 4 of my friends in the family group, so it falls to 35 rs each. Not a bad deal if you can get friends to share with you. I frequently watch youtube on my smart tv so premium is a must have.",
        "Revanced",
        "Why do you care creep",
        "google ads are by default set to personalized ads, so maybe you........",
        "use Brave browser , just oike Chrome but with adblockers",
        "😂 Nop.\nI always had personalised ads and daily activity turned off.",
        "bro this is half the reason i bought premium family. runs 6accounts for 189per month. i spend more on fast food so its kinda justified",
        "If you are using Android TV then sideload Smart YouTube app it's basically YouTube without ads",
        "I'll give you a tip which works for me all the time , \nAfter searching for condoms on Google app or shopping apps , search more about Children's toys or skin care products, or Fashion products.",
        "What's wrong in asking ,is that a crime",
        "if this is on a TV install SmartTubeNext. enjoy no ads.",
        "Brother/Sister. Why are you, an android user, NOT USING REVANCED?",
        "Actually it depends on what you've selected as your audience when you set up the ad. For a condom and like this it's entirely possible that the advertiser is just targeting all males 18 and older.\n\nIt's not necessary that they selected any audience behaviours.\n\nSource: I do this for a living",
        "You shouldn't be downvoted, you're right. It's obviously possible to target based on past behaviour, but it's also totally possible to put only basic demographic targeting like gender and age and let the ad show to anyone who fits \"male, 18-25\" as a description.",
        "There is but he's 18+, google knows the kind of content you watch and recommends ads accordingly.",
        "Can never forget the continuous Condom ads while watching IPL with family. The problem is not the Condom ads. The problem is the obscenity in the ads.",
        "And now they are experimenting not letting people with ad blockers access YouTube.",
        "Download youtube extended revanced app and you'd get settings to turn off ads, shorts etc.",
        "Youtube at one point ask for 18+ check for some videos. I think it know that you are adult and showing the ad. You should consider new account for TV or family",
        "Revanced for dummies\n\nSearch on Google and thank me later\n\nIf on Apple devices \n\nCercube ipa \n\nSearch it and dive onto sideloading apps in iPhone and iPads",
        "private dns: dns dot adguard dot com\n\nYouTube app: ReVanced\n\nHardware Adblocker: Pi Zero 2W running pi hole\n\nChrome Adblocker: Adblock plus (or pro I forgot the name, >!if you reply to me with \"brave\" I'll mri you with a butt plug!<)",
        "My brother in Christ, use incognito browsers and alt accounts to do your shady activities. You getting condom ads does reflect your internet history. Your kids will grow up with this as a core memory, and then realisation hits...",
        "try searching for songs  and see the new suggestions",
        "I just got premium",
        "There's a reason youtube kids is a thing.",
        "Use revanced",
        "Happens because a large majority of youtube users in India are using it for tharki videos. The entire region gets tagged by Google AI as being Tharki. The content assembling AI then gets tharki content, promotes tharki content, and tharki ads to show the region in the hopes of being called a goodboy. Delete your unique ID, change region to US or EU, empty cache and cookies.",
        "That was like one of the the first thing they started delivering in instamart.",
        "Well you've a kid so kinda right demography lol",
        "That was not the point I'm making",
        "I have smart tube next installed in all the firesticks on my tvs at home so I try to save my kids from any ads.\nSometimes they watch youtube kids app too on tv and there are ads but few and far and usually of stuff like lego or hamleys.\n\nThey rarely watch on tablet. But I would appreciate if someone can tell me what app to install on tablet for getting ad free experience. Also it would be great if login into account is possible on that app.",
        "Cant use AdBlocker anyway.",
        "It's still better than Dev Gadhvi's ads.",
        "Revanced or newpipe.",
        "No i dont.",
        "Title of the video is \"Kamasutra long last condoms | 20 seconds.\". Lol apne pair pe kulhadi maarna",
        "We want sex education in school but condom ads are 18+?",
        "The female lines were sung by Jonita Gandhi.",
        "Premium Kharidh, No Ads.",
        "Not always. With OP here. I once foolishly turned off Ad personalization in my Google account and got blasted borderline illegal ads. I hope the guys who ran the ads got arrested.",
        "You can change settings to allow only age appropriate content.",
        "People here pretending like Condom ads are sex education. When was the last time you saw an condom ad which was actually educating people in what condom is?\n\nCondom ads nowadays are stylised semi porn. I don't want any of 5yo to see those things. Sex education can be taught where it is supposed to be, In school text books or by parents. Not by random ad in youtube with half naked people lusting for each other.\n\nNote : There is difference between sexual content and sex education. Both are not the same.",
        "That's why I have YT Premium subscription",
        "just use ad-blocker mein duden",
        "There is a time and place for everything,  try watching that ad in-front of your family or small kids ,and see how comfortable you are watching that.   If you can handle that scenario, then no issues . Most people can’t",
        "Ads in Google are customized based on your profile, browsing history, what you tell the mic can hear  ;)",
        "189 to be precise but it's damn worth it if you ask me.",
        "I don't think Alt Balaji ads helps in sex ed in any form. 😂",
        "Us bhai us 🥹",
        "No but for real most of you are really regressive in this topics."
    ],
    "cleaned_text": "youtube india getting control ads watch seconds non skippable condom ad im small kids parents watch car review ads homepage sometimes show apps pictures literally borderline porn options reporting doesnt option nsfw ",
    "cleaned_title": "youtube india getting control ads",
    "cleaned_selftext": "watch seconds non skippable condom ad im small kids parents watch car review ads homepage sometimes show apps pictures literally borderline porn options reporting doesnt option nsfw",
    "cleaned_comments": "ads related cookies condoms made uncomfortable read post fully info used show ad said time day location even saw app ad youtube homepage family members phone uses whatsapp youtube karma showing use revanced phone install ublock origin ad blocker computer browser visit rpiracy ads videos watch ads play youtube videos shorts watch tailored interests theyre based google ad settings content youve watched whether youre signed youre signed anonymous signals may decide ads see types videos youve viewed apps device use apps websites visit anonymous identifiers associated mobile device previous interactions googles ads advertising services geographic location age range gender youtube video interactions ads based content videos youve watched whether youre signed similar problem getting uncomfortable ads lot youtube goal embarass front parents enough make shell bucks youtube premium worked kids parents know condoms think youtube also knows single gifgiphyjhvifuugwd thank laugh use vance newpipe download firefox browser mobile install ublock origin add enjoy youtube without ads dont waste time using youtube app rather watch condom ad ajio ad use youtube kids kids parents probably shouldnt watch youtube small kid parents around life early teens also used get uncomfortable condom ads used think show movie theaters entertainment tv channels time understood society needs needs push sex education exposure young age wont make kids degenerates opposite used ad apollo tyres ar rahman probably watched million times one favorite ad lifehttpsyoutubezvvmlakutxe used ads educating people advertisement condoms brands like kamasutra durex confused sex education mean say ads like expose people things might unaware questions like condom use work pop curious minds ultimately leads educated course sex education schools public notices government would still far far better electric ad parents okay yo kids know condoms type ads determined online activities search history gifgiphyhccevnmbpbqnqfjl theres reason censoring exists granted bit restrictive india mean away condom ad god sake quicker kids know use better sensor condom ads already population much deal tell kids adult topic youll talk theyre appropriate age basic parenting hack consistent reasonable kids think yos using youtube kids mainstream youtube something common condoms jio dhan dhana dhan turn ad personalization google account settings thwn youll get generic ads target ads like condom ads overly sexualised yo kids exposed overly sexual material erotic india mandate sex education think condom bad typical indian uncle mentality ad personalisation turned years ive ad personalisation daily activity turned every settings send data turned every app use people talking sex education awareness condom kids probably never watched ads probably wont able find condom ad last seconds branding lasting long yep say ad feels like nothing safe sex sex education parents first actually point even using additional tricks extra steps like using revanced shit like able choose block ads option youtube always bro youre uncomfortable condoms sex educated even kids around show condom yo kids exposed overly sexual material idea mean agree reason cultures worldwide like philosophically whats reason behind dont think philosophy weird like boning sister im sure research probably find academic justification affects childrens development dont know exactly really even go postcomments nobody uncomfortable condoms sex education sex education lasting long feels like nothing pretty dumb vague comments dude stop making big deal man still remember getting weirded condom ad family realize btw wrong cringe ad engraved brain since childhood hawwww bad something like open make common ass thing cause matter much hide behind curtains everyone encounters sex point lives integral part life best stay open teaching whats right whats wrong man swiggy delivering condoms people commenting advt trigger online activities always humble opinion people dont realise one turn targeted ad fun part turn targeted ad start getting wierd advt video calling apps stupid games etc trying tell yahan sex milega within week turned targeted ad freaked sometimes never grossed yes ads condoms like borderline porn made user discretionary ads much needed country like crossed china population people really advocating sex education kids saying comfortable condom advertisements seen overly sexualised adds wtf wrong people safe sex ads condom ads companies sex education awareness ad attractive marketing tools used companies like products thats promotions marketing work seems like started never knew dont really get whats problem man used see manforceskore ad every used watch cricket dad tv also ads relative targeted account history consider youtube premium dont want ads teach em young please use incognito deeds cant block ads tv since last three months almost getting comfort fabric conditioner ad use youtube tv use brave browser removes adds damn get irritated days watching laptop becausee used seeing ads phone turn recommendation based ads google account dont want see random weird ads like stop horny youre phone knows want buy premium rs per month peace mind got youtube premium ads whatsoever saviour vanced abandoned thanks youtube also ad appears even new accounts bro take premium like rs month added friends family group falls rs bad deal get friends share frequently watch youtube smart tv premium must revanced care creep google ads default set personalized ads maybe use brave browser oike chrome adblockers nop always personalised ads daily activity turned bro half reason bought premium family runs accounts per month spend fast food kinda justified using android tv sideload smart youtube app basically youtube without ads ill give tip works time searching condoms google app shopping apps search childrens toys skin care products fashion products whats wrong asking crime tv install smarttubenext enjoy ads brothersister android user using revanced actually depends youve selected audience set ad condom like entirely possible advertiser targeting males older necessary selected audience behaviours source living shouldnt downvoted youre right obviously possible target based past behaviour also totally possible put basic demographic targeting like gender age let ad show anyone fits male description hes google knows kind content watch recommends ads accordingly never forget continuous condom ads watching ipl family problem condom ads problem obscenity ads experimenting letting people ad blockers access youtube download youtube extended revanced app youd get settings turn ads shorts etc youtube one point ask check videos think know adult showing ad consider new account tv family revanced dummies search google thank later apple devices cercube ipa search dive onto sideloading apps iphone ipads private dns dns dot adguard dot com youtube app revanced hardware adblocker pi zero w running pi hole chrome adblocker adblock plus pro forgot name reply brave ill mri butt plug brother christ use incognito browsers alt accounts shady activities getting condom ads reflect internet history kids grow core memory realisation hits try searching songs see new suggestions got premium theres reason youtube kids thing use revanced happens large majority youtube users india using tharki videos entire region gets tagged google ai tharki content assembling ai gets tharki content promotes tharki content tharki ads show region hopes called goodboy delete unique id change region us eu empty cache cookies like one first thing started delivering instamart well youve kid kinda right demography lol point im making smart tube next installed firesticks tvs home try save kids ads sometimes watch youtube kids app tv ads far usually stuff like lego hamleys rarely watch tablet would appreciate someone tell app install tablet getting ad free experience also would great login account possible app cant use adblocker anyway still better dev gadhvis ads revanced newpipe dont title video kamasutra long last condoms seconds lol apne pair pe kulhadi maarna want sex education school condom ads female lines sung jonita gandhi premium kharidh ads always op foolishly turned ad personalization google account got blasted borderline illegal ads hope guys ran ads got arrested change settings allow age appropriate content people pretending like condom ads sex education last time saw condom ad actually educating people condom condom ads nowadays stylised semi porn dont want yo see things sex education taught supposed school text books parents random ad youtube half naked people lusting note difference sexual content sex education thats yt premium subscription use adblocker mein duden time place everything try watching ad infront family small kids see comfortable watching handle scenario issues people cant ads google customized based profile browsing history tell mic hear precise damn worth ask dont think alt balaji ads helps sex ed form us bhai us real really regressive topics",
    "light_cleaned_title": "YouTube India is getting out of control with ads.",
    "light_cleaned_selftext": "I had to watch a 15 seconds of non skippable Condom ad when I'm with small kids or with my parents to watch a Car review. The ads on the homepage sometimes show apps with pictures that are literally borderline porn. The options for reporting doesn't have an option of NSFW.",
    "light_cleaned_comments": "The ads are related to cookies. Condoms made you uncomfortable? Read the post fully. The info used to show this ad said \"time of the day\" and location I even saw the app ad (youtube homepage) once on my family member's phone who uses just WhatsApp and youtube. It's your karma showing up 😛 Use revanced on your phone or install ublock origin or ad blocker on your computer browser. Visit r/piracy Ads on videos you watch The ads that play on YouTube videos or Shorts you watch are tailored to your interests. They’re based on your Google Ad Settings, the content you’ve watched, and whether you’re signed in or not. When you're signed in, these anonymous signals may decide which ads you see: Types of videos you’ve viewed The apps on your device and your use of apps Websites you visit Anonymous identifiers associated with your mobile device Previous interactions with Google’s ads or advertising services Your geographic location Age range Gender YouTube video interactions These ads are based on the content of the videos you’ve watched whether you’re signed in or not. I have a similar problem, i have been getting uncomfortable ads a lot on youtube, if their goal was to embarass me in front of my parents enough to make me shell out a few bucks for youtube premium it worked 😭 Why should kids or parents not know about condoms? I think my YouTube also knows that I am single ![gif](giphy|10JhviFuU2gWD6) Thank you for the laugh. Use Vance or Newpipe. Download Firefox browser on your mobile and install ublock origin add on and enjoy YouTube without ads . Don't waste time using youtube app . I will rather watch a condom ad than that AJIO ad Use youtube Kids when with kids or parents I probably shouldn't watch youtube when any small kid or my parents are around it's your life When i was in my early teens i also used to get uncomfortable with condom ads, and used to think \"why do they show these in movie theaters or entertainment tv channels\" but in some time i understood that our society needs this, it needs the push for sex education and exposure from a young age, it won't make our kids into degenerates, it will do the opposite. There used to be an ad for Apollo tyres by AR Rahman. Probably watched it a million times. this one my favorite ad for [LIFE](https://youtu.be/ZVvmLakUtXE) There used to be ads for educating people. Advertisement for condoms by brands like Kamasutra , durex are not to be confused with sex education. What i mean to say is that, ads like these expose people to things they might have been unaware of, questions like \"what does the condom do?\", \"why do they use it?\", \"how does it work?\" All pop up into curious minds which ultimately leads them to be more educated. Of course, sex education in schools and public notices by the government would still be far far better. It's an electric ad. /s Parents okay, what about 5yo kids? They should know about condoms? Why not? The type of ads are determined by your online activities and search history. ![gif](giphy|H5C8CevNMbpBqNqFjl) Why? There's a reason censoring exists. Granted it's a bit too restrictive in India, but does it mean we just do away with it? It's a condom ad for just god sake. The quicker your kids know to use it the better Why sensor condom ads? Already the population is too much to deal with. Tell the kids that this is an \"adult topic\" that you'll talk about when they're of an appropriate age. This is a VERY basic parenting hack - you have to be consistent and reasonable about it with kids. I think 5 yos should be using YouTube kids and not mainstream YouTube. Something common for both condoms and Jio? Dhan Dhana Dhan You can turn off ad personalization in google account settings. Thwn you'll get generic ads and not target ads like this Because condom ads can be overly sexualised and 5yo kids should not be exposed to overly sexual material. because they are erotic? India should mandate sex education You think condom is bad, typical Indian uncle mentality My ad personalisation has been turned off for years.. I've had my ad personalisation, daily activity turned off and every other settings that can send data turned off for every app that i use. People talking here about sex education and awareness about condom for kids, probably never watched these ads. You probably wont be able to find out that its a condom ad if not for last few seconds of branding. Its more about \"lasting long\"( yep, they say it in the ad), \"feels like nothing\" than about safe sex. Sex education for parents first! Actually his point is , even when not using these additional tricks or extra steps like using revanced or some shit like that , he should be able to choose to block 18+ ads . There is no such option in YouTube. Not always Bro if you're uncomfortable with condoms, you were not sex educated even with kids around they should show what a condom is >5yo kids should not be exposed to overly sexual material do you have any idea why? I mean i agree they should not, why what is reason all cultures worldwide do it? Like philosophically whats the reason behind it? I don't think there is any philosophy, it's just weird, like boning your sister. I'm sure if you research it you will probably find some academic justification about how it affects children's development (but I don't know exactly how it does) Really? Did you even go through the post/comments? Nobody is uncomfortable with condoms or sex education. What sex education has to do with \"lasting long\" , \"feels like nothing\" ? Pretty dumb and vague comments. Dude stop making a big deal man I still remember getting weirded out at a condom ad with family and i now realize ( I am 20 btw ) that it was wrong. This cringe at an ad is engraved into the brain since childhood that hawwww it's bad or something like that. Open up and make it a common ass thing cause no matter how much you hide it behind the curtains everyone encounters sex at some point in their lives and it's a integral part of life too Best is to stay open and teaching what's right and what's wrong. man swiggy delivering condoms now? People commenting \"Advt. are trigger by your online activities\". Not always. I my humble opinion. People don't realise one can turn off targeted ad. Fun part is when you turn off targeted ad, then you start getting these wierd advt for video calling apps, Stupid games, etc, that is trying to tell \"yahan sex milega\". Within a week I turned on the targeted ad. Now I am freaked sometimes but never grossed out. Yes the ads of condoms are like borderline porn and it should be made more user discretionary but these ads are much needed in a country like ours which just crossed china on population. People here are really advocating for sex education for kids saying they should be comfortable with condom advertisements? Have you seen how overly sexualised those adds are? Wtf is wrong with you people ? Safe sex ads are not the same as these. Condom ads by companies is not same as sex education/ awareness. These ad are just attractive marketing tools used by companies just like any other products. ( That's how promotions and marketing work ) Seems like they have just started. I never knew. I don't really get it. What's the problem man? I used to see manforce/skore ad every over when i used to watch cricket with dad on TV. Also the ads are relative and targeted to your account history. Consider Youtube Premium if you dont want ads Teach em young Please use incognito for your deeds. I only can't block ads on my TV and since last three months I am almost only getting the same Comfort fabric conditioner ad when I use youtube tv Or just use it on Brave Browser, removes all the adds, damn I get irritated these days watching it on laptop becausee I am used to seeing no ads in my phone ! Turn on recommendation based ads in your Google account if you don't want to see random weird ads like these. Stop being horny, you're phone knows what you want Buy premium.. 130 rs per month... peace of mind.. I got YouTube premium. No ads whatsoever. It has been a saviour. no vanced is abandoned thanks to youtube, also this ad appears even in new accounts Bro take the premium It's like 180 rs a month. I have added 4 of my friends in the family group, so it falls to 35 rs each. Not a bad deal if you can get friends to share with you. I frequently watch youtube on my smart tv so premium is a must have. Revanced Why do you care creep google ads are by default set to personalized ads, so maybe you........ use Brave browser , just oike Chrome but with adblockers 😂 Nop. I always had personalised ads and daily activity turned off. bro this is half the reason i bought premium family. runs 6accounts for 189per month. i spend more on fast food so its kinda justified If you are using Android TV then sideload Smart YouTube app it's basically YouTube without ads I'll give you a tip which works for me all the time , After searching for condoms on Google app or shopping apps , search more about Children's toys or skin care products, or Fashion products. What's wrong in asking ,is that a crime if this is on a TV install SmartTubeNext. enjoy no ads. Brother/Sister. Why are you, an android user, NOT USING REVANCED? Actually it depends on what you've selected as your audience when you set up the ad. For a condom and like this it's entirely possible that the advertiser is just targeting all males 18 and older. It's not necessary that they selected any audience behaviours. Source: I do this for a living You shouldn't be downvoted, you're right. It's obviously possible to target based on past behaviour, but it's also totally possible to put only basic demographic targeting like gender and age and let the ad show to anyone who fits \"male, 18-25\" as a description. There is but he's 18+, google knows the kind of content you watch and recommends ads accordingly. Can never forget the continuous Condom ads while watching IPL with family. The problem is not the Condom ads. The problem is the obscenity in the ads. And now they are experimenting not letting people with ad blockers access YouTube. Download youtube extended revanced app and you'd get settings to turn off ads, shorts etc. Youtube at one point ask for 18+ check for some videos. I think it know that you are adult and showing the ad. You should consider new account for TV or family Revanced for dummies Search on Google and thank me later If on Apple devices Cercube ipa Search it and dive onto sideloading apps in iPhone and iPads private dns: dns dot adguard dot com YouTube app: ReVanced Hardware Adblocker: Pi Zero 2W running pi hole Chrome Adblocker: Adblock plus (or pro I forgot the name, >!if you reply to me with \"brave\" I'll mri you with a butt plug!<) My brother in Christ, use incognito browsers and alt accounts to do your shady activities. You getting condom ads does reflect your internet history. Your kids will grow up with this as a core memory, and then realisation hits... try searching for songs and see the new suggestions I just got premium There's a reason youtube kids is a thing. Use revanced Happens because a large majority of youtube users in India are using it for tharki videos. The entire region gets tagged by Google AI as being Tharki. The content assembling AI then gets tharki content, promotes tharki content, and tharki ads to show the region in the hopes of being called a goodboy. Delete your unique ID, change region to US or EU, empty cache and cookies. That was like one of the the first thing they started delivering in instamart. Well you've a kid so kinda right demography lol That was not the point I'm making I have smart tube next installed in all the firesticks on my tvs at home so I try to save my kids from any ads. Sometimes they watch youtube kids app too on tv and there are ads but few and far and usually of stuff like lego or hamleys. They rarely watch on tablet. But I would appreciate if someone can tell me what app to install on tablet for getting ad free experience. Also it would be great if login into account is possible on that app. Cant use AdBlocker anyway. It's still better than Dev Gadhvi's ads. Revanced or newpipe. No i dont. Title of the video is \"Kamasutra long last condoms | 20 seconds.\". Lol apne pair pe kulhadi maarna We want sex education in school but condom ads are 18+? The female lines were sung by Jonita Gandhi. Premium Kharidh, No Ads. Not always. With OP here. I once foolishly turned off Ad personalization in my Google account and got blasted borderline illegal ads. I hope the guys who ran the ads got arrested. You can change settings to allow only age appropriate content. People here pretending like Condom ads are sex education. When was the last time you saw an condom ad which was actually educating people in what condom is? Condom ads nowadays are stylised semi porn. I don't want any of 5yo to see those things. Sex education can be taught where it is supposed to be, In school text books or by parents. Not by random ad in youtube with half naked people lusting for each other. Note : There is difference between sexual content and sex education. Both are not the same. That's why I have YT Premium subscription just use ad-blocker mein duden There is a time and place for everything, try watching that ad in-front of your family or small kids ,and see how comfortable you are watching that. If you can handle that scenario, then no issues . Most people can’t Ads in Google are customized based on your profile, browsing history, what you tell the mic can hear ;) 189 to be precise but it's damn worth it if you ask me. I don't think Alt Balaji ads helps in sex ed in any form. 😂 Us bhai us 🥹 No but for real most of you are really regressive in this topics."
}