{
    "id": "sp39h2",
    "title": "Don't buy Jabra products! EVER!",
    "url": "https://www.reddit.com/r/india/comments/sp39h2/dont_buy_jabra_products_ever/",
    "selftext": "I was gifted a Jabra Elite 65 T. I knew they weren't the perfect set of TWS earphones but they were in a lot of people's top 5 with the non-touch sweat-resistant function and the deep discounts that Jabra offered on a product that was priced at Rs. 16K\n\nAs expected one year down the line one of the earphones stopped working and I went in a never-ending loop with Jabra to get the product replaced. It has been over 3 months, I first reached out to them via their website on Nov 2, and I don't see an end to it just yet.\n\nThe point I am trying to make is to spend a few more bucks or don't, and buy a cheaper alternative. Just don't buy Jabra. You don't want this sort of a hassle even after paying big bucks.  \n\n\nEdit: For those of you who don't believe me. Please just visit @ Jabra\\_Support on Twitter and read the comments. I am sharing a screenshot here. You'll find every Indian handle complaining in a similar manner. Their post sales service is super shitty. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wpw8sz5xm1h81.png?width=796&amp;format=png&amp;auto=webp&amp;s=716416e97d40b9e224689b7459beb8f45ab9a4d2",
    "flair": "Rant / Vent",
    "score": 20,
    "num_comments": 25,
    "created_utc": 1644487764,
    "convurl": "https://b.thumbs.redditmedia.com/FXSr5J3whLcqY9zgh32K2GzNKRMvj0T1mzV685yuJGA.jpg",
    "comments": [
        "TWS one shouldn't invest much imo. Non repairable and short shelf life.",
        "To be honest, I have had a fair few from Bose and Sony that lasted a lifetime. Bose Soundsport was literally non-breakable.",
        "What do you mean by lifetime, these things have been launched a few years before. Also can one change the battery etc?",
        "This is a gold product from brand perspective. Not much tech involved, so no RnD, people keep buying frequently, high sales high margin",
        "Yes, that's why i always prefer a headphone jack, and don't buy phones which doesn't have them. Maybe i'm in minority, but i don't see value in TWS.",
        "Jabra owner here; please don't say that.",
        "Damn, i jus brought a new headset two days back.",
        "OP be like \n\nMain tera haaye re jabra  \nHoye re jabra fan nahi ho gaya  \nMain tera haaye re jabra  \nHoye re jabra fan nahi ho gaya",
        "I got Jabra Elite active 75T in 2019 for 16k. I have dropped them countless times, handle them roughly and They still work great! Battery is still great as well. Get roughly 5hours on single charge and about 2.5 charges with the case. I absolutely love them. Best so far imho. I was very skeptical of buying them considering the amount of people complaining about not working on the Jabra subreddit but I still bit the bullet and got them. I am one of the few lucky ones I guess.",
        "I like your flair.",
        "Don't worry. I have bought Jabra 65t two years back. It wasn't having any issues whatsoever. It's a worthy purachse.",
        "Bruh headphones are good rest idk don't use tws.",
        "Not true. Soundcores are worth every rupee.",
        "Honestly get soundcores TWS. Pref mid tier and higher. They are incredible for the price. Made a few apple fanbois switch.",
        "I hope you don't ever need to use their post-sales service.",
        "Given that I have had the pleasure of owning 1More Triple Drivers which failed me thrice (didn't even last one complete year), I would say I have had Bose Soundsport TWS for a lifetime. I bought them in 2017, I think (flew those from Singapore), and it has been working fine ever since.  It's just that I have grown over their sound signature so I leveraged the Jabra Elite 65T (which was a gift)",
        "I am sorry I don't understand. What do you mean?",
        "I hope you don't ever need their post-sales service.",
        "Soundcores are a brand of tws by Anker",
        "Dude, all I can do is hope you don't need their post-sales service. I have emails going back to Nov 19. I mean its about to hit 3 months just to get the product replaced. It's fine I suppose till they break. From then on. It's a battle.   \n\n\nJust go look up @ Jabra\\_supoprt twitter handle and read the comments. Every body from India is pissed and has the same thing to say.",
        "A for effort.",
        "With a name like that I don’t go near to it.",
        "It had a 2 year warranty and it's long past the warranty so I don't think I can do much with support tbh",
        "The freedom. With screens getting bigger (and televisions and laptop) you can get up do other work roam about the room and still be tuned into the thing playing without disturbing the general ambience of the room.",
        "😃"
    ],
    "cleaned_text": "dont buy jabra products ever gifted jabra elite knew werent perfect set tws earphones lot peoples top nontouch sweatresistant function deep discounts jabra offered product priced rs k expected one year line one earphones stopped working went neverending loop jabra get product replaced months first reached via website nov dont see end yet point trying make spend bucks dont buy cheaper alternative dont buy jabra dont want sort hassle even paying big bucks edit dont believe please visit jabrasupport twitter read comments sharing screenshot youll find every indian handle complaining similar manner post sales service super shitty ampxb ampxb ",
    "cleaned_title": "dont buy jabra products ever",
    "cleaned_selftext": "gifted jabra elite knew werent perfect set tws earphones lot peoples top nontouch sweatresistant function deep discounts jabra offered product priced rs k expected one year line one earphones stopped working went neverending loop jabra get product replaced months first reached via website nov dont see end yet point trying make spend bucks dont buy cheaper alternative dont buy jabra dont want sort hassle even paying big bucks edit dont believe please visit jabrasupport twitter read comments sharing screenshot youll find every indian handle complaining similar manner post sales service super shitty ampxb ampxb",
    "cleaned_comments": "tws one shouldnt invest much imo non repairable short shelf life honest fair bose sony lasted lifetime bose soundsport literally nonbreakable mean lifetime things launched years also one change battery etc gold product brand perspective much tech involved rnd people keep buying frequently high sales high margin yes thats always prefer headphone jack dont buy phones doesnt maybe im minority dont see value tws jabra owner please dont say damn jus brought new headset two days back op like main tera haaye jabra hoye jabra fan nahi ho gaya main tera haaye jabra hoye jabra fan nahi ho gaya got jabra elite active k dropped countless times handle roughly still work great battery still great well get roughly hours single charge charges case absolutely love best far imho skeptical buying considering amount people complaining working jabra subreddit still bit bullet got one lucky ones guess like flair dont worry bought jabra two years back wasnt issues whatsoever worthy purachse bruh headphones good rest idk dont use tws true soundcores worth every rupee honestly get soundcores tws pref mid tier higher incredible price made apple fanbois switch hope dont ever need use postsales service given pleasure owning triple drivers failed thrice didnt even last one complete year would say bose soundsport tws lifetime bought think flew singapore working fine ever since grown sound signature leveraged jabra elite gift sorry dont understand mean hope dont ever need postsales service soundcores brand tws anker dude hope dont need postsales service emails going back nov mean hit months get product replaced fine suppose till break battle go look jabrasupoprt twitter handle read comments every body india pissed thing say effort name like dont go near year warranty long past warranty dont think much support tbh freedom screens getting bigger televisions laptop get work roam room still tuned thing playing without disturbing general ambience room",
    "light_cleaned_title": "Don't buy Jabra products! EVER!",
    "light_cleaned_selftext": "I was gifted a Jabra Elite 65 T. I knew they weren't the perfect set of TWS earphones but they were in a lot of people's top 5 with the non-touch sweat-resistant function and the deep discounts that Jabra offered on a product that was priced at Rs. 16K As expected one year down the line one of the earphones stopped working and I went in a never-ending loop with Jabra to get the product replaced. It has been over 3 months, I first reached out to them via their website on Nov 2, and I don't see an end to it just yet. The point I am trying to make is to spend a few more bucks or don't, and buy a cheaper alternative. Just don't buy Jabra. You don't want this sort of a hassle even after paying big bucks. Edit: For those of you who don't believe me. Please just visit @ Jabra\\_Support on Twitter and read the comments. I am sharing a screenshot here. You'll find every Indian handle complaining in a similar manner. Their post sales service is super shitty.",
    "light_cleaned_comments": "TWS one shouldn't invest much imo. Non repairable and short shelf life. To be honest, I have had a fair few from Bose and Sony that lasted a lifetime. Bose Soundsport was literally non-breakable. What do you mean by lifetime, these things have been launched a few years before. Also can one change the battery etc? This is a gold product from brand perspective. Not much tech involved, so no RnD, people keep buying frequently, high sales high margin Yes, that's why i always prefer a headphone jack, and don't buy phones which doesn't have them. Maybe i'm in minority, but i don't see value in TWS. Jabra owner here; please don't say that. Damn, i jus brought a new headset two days back. OP be like Main tera haaye re jabra Hoye re jabra fan nahi ho gaya Main tera haaye re jabra Hoye re jabra fan nahi ho gaya I got Jabra Elite active 75T in 2019 for 16k. I have dropped them countless times, handle them roughly and They still work great! Battery is still great as well. Get roughly 5hours on single charge and about 2.5 charges with the case. I absolutely love them. Best so far imho. I was very skeptical of buying them considering the amount of people complaining about not working on the Jabra subreddit but I still bit the bullet and got them. I am one of the few lucky ones I guess. I like your flair. Don't worry. I have bought Jabra 65t two years back. It wasn't having any issues whatsoever. It's a worthy purachse. Bruh headphones are good rest idk don't use tws. Not true. Soundcores are worth every rupee. Honestly get soundcores TWS. Pref mid tier and higher. They are incredible for the price. Made a few apple fanbois switch. I hope you don't ever need to use their post-sales service. Given that I have had the pleasure of owning 1More Triple Drivers which failed me thrice (didn't even last one complete year), I would say I have had Bose Soundsport TWS for a lifetime. I bought them in 2017, I think (flew those from Singapore), and it has been working fine ever since. It's just that I have grown over their sound signature so I leveraged the Jabra Elite 65T (which was a gift) I am sorry I don't understand. What do you mean? I hope you don't ever need their post-sales service. Soundcores are a brand of tws by Anker Dude, all I can do is hope you don't need their post-sales service. I have emails going back to Nov 19. I mean its about to hit 3 months just to get the product replaced. It's fine I suppose till they break. From then on. It's a battle. Just go look up @ Jabra\\_supoprt twitter handle and read the comments. Every body from India is pissed and has the same thing to say. A for effort. With a name like that I don’t go near to it. It had a 2 year warranty and it's long past the warranty so I don't think I can do much with support tbh The freedom. With screens getting bigger (and televisions and laptop) you can get up do other work roam about the room and still be tuned into the thing playing without disturbing the general ambience of the room. 😃"
}