{
    "id": "1gu0y4t",
    "title": "Amazon Customer service scam!",
    "url": "https://www.reddit.com/gallery/1gu0y4t",
    "selftext": "I had some trust in Amazon, but their recent dealings have been otherwise.\n\nTo give some context, I came across a prime sale for a gaming mouse (Rs.7999) I had on my wishlist for along time. Their app showed an SBI credit card offer in addition to prime offer, which brought it down Rs.1299 making it a grand total of Rs.6700, but the issue was this amount was not reflecting in the total bill.\n\nSo I contacted their customer service and they confirmed that they will provide it as cashback within 48hrs and on that I placed the order with the SBI CREDIT card.\n\n\nEven though I have screenshots of the offer and the chat with their agent, they still denied the cashback. They are denying it saying I'm not eligible!\n\nAttaching screenshots for reference. Is there any channel I can reach out to regarding this issue.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 14,
    "created_utc": 1731921870.0,
    "convurl": "https://i.redd.it/xxnri8ewom1e1.png",
    "comments": [
        "You have chat proofs where an CS agent said you'll get it. \n\nEscalate the matter, write email (to escalations team)\n\nI believe you'll get this cashback",
        "It is showing as discount, right? Where it is mentioned as cashback? The chat agent straightway lied to you to escape from you.",
        "Yea so the discount wasn't reflecting, so after some back and forth they said its a system glitch, but it will be given as cashback.",
        "You might have exhausted your card discount that day, or your card is a co-branded one, connect them via call and ask them politely if your call gets landed to a good agent they will help you if not ask for escalation they might help you. This is the only option for you.",
        "Did you read the terms and conditions for that offer? \n\nAlways deep dive and get the faq out. Usually these things are carefully programmed in Amazon and haven't seen a failure so far. \n\nThe terms and conditions often are like this:\n\n1. Can be used only once per month per card/per user.\n\n2. Only for new users. \n\n3. Applicable for EMIs.\n\n4. Co branded cards won't be accepted. \n\n5. Cashbacks will be posted during bill generation.\n\nThat offer looks like a discount. But you paid the full amount that means your card wasn't selected as eligible. Unless you have the faq, it's difficult to know why it failed. \n\nRaise a complaint in consumer court and keep following up with Amazon customer care. Don't chat, just call them. \n\nAnd next time, read the faq very carefully for the offer. There's a reason it has a link.",
        "Did you the the SBI cashback card for this? That would explain a lot of things.",
        "Ohh was not aware of this, but they cross verified my card and said it was a system glitch. If they had stated that it won't be available in the beginning it would be a different story.",
        "Nope, I used the normal credit card, they even cross checked the card and said it's eligible.",
        "Do you have any mail IDs I can reach out to ?",
        "Actually it was the only purchase I did that day. Im disappointed only because I called them multiple times just to confirm if I'm eligible or if it's a fluke.",
        "As per mentioned pic you will get only discount, and that discount will be clearly shown in payment page, either u may have used non-eligible card or other bank's credit card.",
        "You can actually write emails to Jeff Bezos, mail him the ss and ask the az team to officially confirm the cashback.\n\nBezos email is for escalation matters, and it works.",
        "I couldn't find.\nCall and ask for their escalations email address. I vaguely believe that's what I did. Or they escalate your ticket and you will be sent a copy of email to which you can reply",
        "Thanks, will check it out."
    ],
    "cleaned_text": "amazon customer service scam trust amazon recent dealings otherwise give context came across prime sale gaming mouse rs wishlist along time app showed sbi credit card offer addition prime offer brought rs making grand total rs issue amount reflecting total bill contacted customer service confirmed provide cashback within hrs placed order sbi credit card even though screenshots offer chat agent still denied cashback denying saying im eligible attaching screenshots reference channel reach regarding issue ",
    "cleaned_title": "amazon customer service scam",
    "cleaned_selftext": "trust amazon recent dealings otherwise give context came across prime sale gaming mouse rs wishlist along time app showed sbi credit card offer addition prime offer brought rs making grand total rs issue amount reflecting total bill contacted customer service confirmed provide cashback within hrs placed order sbi credit card even though screenshots offer chat agent still denied cashback denying saying im eligible attaching screenshots reference channel reach regarding issue",
    "cleaned_comments": "chat proofs cs agent said youll get escalate matter write email escalations team believe youll get cashback showing discount right mentioned cashback chat agent straightway lied escape yea discount wasnt reflecting back forth said system glitch given cashback might exhausted card discount day card cobranded one connect via call ask politely call gets landed good agent help ask escalation might help option read terms conditions offer always deep dive get faq usually things carefully programmed amazon havent seen failure far terms conditions often like used per month per cardper user new users applicable emis co branded cards wont accepted cashbacks posted bill generation offer looks like discount paid full amount means card wasnt selected eligible unless faq difficult know failed raise complaint consumer court keep following amazon customer care dont chat call next time read faq carefully offer theres reason link sbi cashback card would explain lot things ohh aware cross verified card said system glitch stated wont available beginning would different story nope used normal credit card even cross checked card said eligible mail ids reach actually purchase day im disappointed called multiple times confirm im eligible fluke per mentioned pic get discount discount clearly shown payment page either u may used noneligible card banks credit card actually write emails jeff bezos mail ss ask az team officially confirm cashback bezos email escalation matters works couldnt find call ask escalations email address vaguely believe thats escalate ticket sent copy email reply thanks check",
    "light_cleaned_title": "Amazon Customer service scam!",
    "light_cleaned_selftext": "I had some trust in Amazon, but their recent dealings have been otherwise. To give some context, I came across a prime sale for a gaming mouse (Rs.7999) I had on my wishlist for along time. Their app showed an SBI credit card offer in addition to prime offer, which brought it down Rs.1299 making it a grand total of Rs.6700, but the issue was this amount was not reflecting in the total bill. So I contacted their customer service and they confirmed that they will provide it as cashback within 48hrs and on that I placed the order with the SBI CREDIT card. Even though I have screenshots of the offer and the chat with their agent, they still denied the cashback. They are denying it saying I'm not eligible! Attaching screenshots for reference. Is there any channel I can reach out to regarding this issue.",
    "light_cleaned_comments": "You have chat proofs where an CS agent said you'll get it. Escalate the matter, write email (to escalations team) I believe you'll get this cashback It is showing as discount, right? Where it is mentioned as cashback? The chat agent straightway lied to you to escape from you. Yea so the discount wasn't reflecting, so after some back and forth they said its a system glitch, but it will be given as cashback. You might have exhausted your card discount that day, or your card is a co-branded one, connect them via call and ask them politely if your call gets landed to a good agent they will help you if not ask for escalation they might help you. This is the only option for you. Did you read the terms and conditions for that offer? Always deep dive and get the faq out. Usually these things are carefully programmed in Amazon and haven't seen a failure so far. The terms and conditions often are like this: 1. Can be used only once per month per card/per user. 2. Only for new users. 3. Applicable for EMIs. 4. Co branded cards won't be accepted. 5. Cashbacks will be posted during bill generation. That offer looks like a discount. But you paid the full amount that means your card wasn't selected as eligible. Unless you have the faq, it's difficult to know why it failed. Raise a complaint in consumer court and keep following up with Amazon customer care. Don't chat, just call them. And next time, read the faq very carefully for the offer. There's a reason it has a link. Did you the the SBI cashback card for this? That would explain a lot of things. Ohh was not aware of this, but they cross verified my card and said it was a system glitch. If they had stated that it won't be available in the beginning it would be a different story. Nope, I used the normal credit card, they even cross checked the card and said it's eligible. Do you have any mail IDs I can reach out to ? Actually it was the only purchase I did that day. Im disappointed only because I called them multiple times just to confirm if I'm eligible or if it's a fluke. As per mentioned pic you will get only discount, and that discount will be clearly shown in payment page, either u may have used non-eligible card or other bank's credit card. You can actually write emails to Jeff Bezos, mail him the ss and ask the az team to officially confirm the cashback. Bezos email is for escalation matters, and it works. I couldn't find. Call and ask for their escalations email address. I vaguely believe that's what I did. Or they escalate your ticket and you will be sent a copy of email to which you can reply Thanks, will check it out."
}