{
    "id": "hbuqvl",
    "title": "Mass surveillance of social media users is not the solution for fake news",
    "url": "https://www.reddit.com/r/india/comments/hbuqvl/mass_surveillance_of_social_media_users_is_not/",
    "selftext": "https://preview.redd.it/muo9jpcyws551.png?width=1024&amp;format=png&amp;auto=webp&amp;s=90c79e69d39510fb02da610938712ba40bdac2fe\n\n### Tl;dr\n\nToday, we sent a legal notice for a tender released by BECIL for procurement of fact verification and disinformation detection tools which will lead to mass surveillance of social media users. In its current form, this tender and the proposed project are an unconstitutional and illegal violation of privacy, freedom of expression and freedom of association of citizens, and it must be halted immediately.\n\n### Background\n\nOn 13.05.2020, Broadcast Engineering Consultants India Limited (BECIL) released a tender for procurement of *‘Solution and Services related to fact verification and disinformation detection.’* As per the tender documents, the scope of work for the project includes:\n\n1. Detecting and analyzing coordinated disinformation campaigns.\n2. Identifying key influencers behind disinformation and their geographical location.\n3. Carrying out link analysis between different entities spreading fake news.\n4. Sentiment analysis for large scale disinformation.\n5. Monitoring activities of individuals who upload disinformation across social media platforms.\n6. Rapid verification of claims and images through an Artificial Intelligence and machine learning based tool.\n7. Creating corrective responses with accurate facts.\n8. Establishing an archive for long term retention of data.\n\nThese proposed features raise concerns about mass surveillance and could have a chilling effect on online speech. Due to advancement in technology and decrease in marginal costs, it is now possible for governments to monitor the social media activity of millions of citizens without their knowledge or consent. The kind of social media monitoring tool that BECIL seeks to procure would collect and process personal data of users from social media platforms and then use automated technology like artificial intelligence to aggregate, organize and analyse the large amount of data collected. While we share the government’s concern about misinformation which is a genuine and serious problem, we maintain that mass surveillance of millions of Indian internet users without any legal safeguards is not a proportionate solution.\n\n### Digital India should not become a Digital Panopticon \n\nIn today’s world, people share a large amount of information on social media platforms about their political views, religious beliefs, sexual orientation, gender identity, mental health etc. For this reason, some companies like Facebook and Twitter prohibit automated scraping of data from their platform without prior written permission of the company. When individuals share sensitive personal information with their friends, family and followers, they cannot reasonably foresee that such information will be collected from their social media profile by government agencies and stored indefinitely.\n\nFurther, there exists a real risk of harm because sensitive personal information collected from social media platforms will be processed by opaque algorithms to build a probabilistic profile of the individual which can make the person a target for law enforcement agencies. In this context, it is pertinent to note that any profiling based on social media activity is particularly susceptible to misinterpretation because the use of likes, shares or hashtags may not represent endorsement. Therefore, individuals could be wrongly classified as disinformation spreaders by algorithms. \n\nFinally, the data which is used to train artificial intelligence and machine learning tools will determine what information is considered true or false by these tools. Therefore, if the training data is flawed or biased, it could lead to discriminatory censorship of particular groups. \n\n### Violation of Fundamental Rights of Internet Users\n\n**Legality:** At present, India does not have a data protection legislation in place to regulate tools such as those sought to be procured by BECIL via the tender. In the absence of any underlying data protection legislation, Indian internet users do not have any mechanism to seek deletion, modification or correction of their data, remedy for misuse of their data or remedy for miscategorization by opaque algorithms. The Hon’ble Supreme Court has consistently held that restrictions on fundamental rights can only be imposed through a statutory provision or rule. Therefore, in the absence of a general data protection law, a specific legislation must be enacted to provide a legal basis to the tender.  \n\n\n**Privacy:** In 2017, a 9 judge bench of the Hon’ble Supreme Court in *K.S. Puttaswamy v. Union of India (2017 10 SCC 1)* unanimously held that privacy was a fundamental right under the Constitution of India. In fact, Kaul J.’s opinion in the case explicitly recognized that there may exist a reasonable expectation of privacy even over social media posts in the following words: *“If the posting on social media websites is meant only for a certain audience, which is possible as per tools available, then it cannot be said that all and sundry in public have a right to somehow access that information and make use of it.\"* Collection and processing of public social media posts is also subject to regulation as noted by the European Court of Justice in *Belgische Vereniging van Auteurs, Componisten en Uitgevers CVBA (SABAM) v. Netlog NV*, where the Court held that *\"the injunction requiring installation of the contested filtering system would involve the identification, systematic analysis and processing of information connected with the profiles created on the social network by its users.  The information connected with those profiles is protected personal data because, in principle, it allows those users to be identified (see, by analogy, Scarlet Extended, paragraph 51).”*\n\n**Freedom of Speech &amp; Expression:** The fundamental right to freedom of speech and expression is guaranteed under Art.19(1)(a) of the Constitution of India, and the Hon’ble Supreme Court in *Shreya Singhal v. Union of India (2015 5 SCC 1***)** has held that overbroad restrictions which have a chilling effect on online speech are unconstitutional. The chilling effect of  surveillance technologies has also been recognized by the Hon’ble Supreme Court in *PUCL v. Union of India ( 1997 1 SCC 301)* where the Court held that telephone tapping could infringe freedom of speech and expression since people may feel reluctant to speak under the watchful gaze of the government. Mass surveillance of social media activity will lead to self-censorship by individuals and especially deter disclosure of information by journalists, activists and whistleblowers.   \n\n\n**Freedom of Association:** Social media platforms have helped individuals collectivize and form communities around their shared professional, political, social or cultural interests. Pervasive social media monitoring would undermine the right to form such associations which is guaranteed by Article 19(1)(c) of the Constitution of India. This is especially relevant since the tender states that vendors must provide a tool which can detect coordinated campaigns and carry out link analysis between different entities.\n\nIt is worth noting that in 2018, BECIL had sought to create a more ambitious version of this project in the form of a Social Media Communication Hub (Read more [**here**](https://internetfreedom.in/notice-on-the-social-media-communication-hub-saveourprivacy/)). Thankfully, the Social Media Communication Hub was scrapped after public outrage and litigation before the Supreme Court. The present tender must also meet the same fate since it suffers from similar problems but this will required sustained advocacy by citizens and civil society groups to ensure we do not sleep walk into a surveillance state.\n\n### Important Documents\n\n1. Legal Notice to BECIL dated 19.06.2020 ([**link**](https://drive.google.com/file/d/1l145Z6BA3auuR0kL1ordl2s4pKiQITzC/view?usp=sharing))\n\n[**Join us in our fight against mass surveillance. Donate and become a member with IFF today!**](https://www.internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 15,
    "num_comments": 2,
    "created_utc": 1592544003,
    "convurl": "https://b.thumbs.redditmedia.com/XxY9dvnfuFzrVV0u1yyfov6Fa2EPbZiGG8D-dr_AWSk.jpg",
    "comments": [
        "&gt;1. Detecting and analyzing coordinated disinformation campaigns.\n\nAbsolutely needed. But there should be clear definition of disinformation and campaign.\n\nBrexit and trump election are two good examples what influence operations are capable off. Keeping an eye of them is a good idea.\n\n&gt;Identifying key influencers behind disinformation and their geographical location.\n\nPro:\nBy identifying the  state sponsored campaigns, gov can simply see through the non Indian locations running the campaign\n\nCon: its also possible to monitor internal accounts trending stuff and if they choose to crackdown, that will be really bad.\n\n&gt;3. Carrying out link analysis between different entities spreading fake news\n\nPro:\nSame with the above, it helps gov to identify influences operations in a quicker manner and the relation between them. \n\nCon:\nIf  they chose to  unmask the online identities and relation between the activist accounts that are posting anonymously that may be ad for them.. \n\n&gt;4. Sentiment analysis for large scale disinformation.\n\nAnalyze  the motives of the campaigns and understand the target audience well.  Also the impact of each campaign. \n\n&gt;5. Monitoring activities of individuals who upload disinformation across social media platforms.\n\nDepending of the definition of disinformation,  certain accounts that are marked as influencers will be tracked and all interactions will be monitored. \n\n\n&gt;6. Rapid verification of claims and images through an Artificial Intelligence and machine learning based tool.\n\n&gt;7. Creating corrective responses with accurate facts.\n\n\nGood initiative. Can be used for fake news busting. \n\n&gt;8. Establishing an archive for long term retention of data.\n\nRetaining data for  further analysis and as a proof of any one is booked under cases. \n\nCurrently they need to write to SM companies for more data, now they can record publicly available posts. Even after they are deleted. \n\n\nVerdict. : while it's important to keep an eye on the influence operations, (assuming the judicious usage of technology) \n\nThings may get worse if government use it to quell internal dissent. Needless to mention the antics of over jealous low to mid tier bureaucracy. And Agencies tactic to pick a random activist to set an example. \n\n\nPossible positive outcome: \n\nAdministration may move away from total internet ban to temporary and  specific SM blackout or identify and suppress the actual influence operations.",
        "This is crazy. \nThey will use this to suppress any info that threatens their power. \"Misinformation\" is anything that does not fit their version of the story. This is being done to protect the interests of ruling party and the billionaires that support it.  The want to supress climate change action, voices of dissent and anything that threatens the ruling party"
    ],
    "cleaned_text": "mass surveillance social media users solution fake news tldr today sent legal notice tender released becil procurement fact verification disinformation detection tools lead mass surveillance social media users current form tender proposed project unconstitutional illegal violation privacy freedom expression freedom association citizens must halted immediately background broadcast engineering consultants india limited becil released tender procurement solution services related fact verification disinformation detection per tender documents scope work project includes detecting analyzing coordinated disinformation campaigns identifying key influencers behind disinformation geographical location carrying link analysis different entities spreading fake news sentiment analysis large scale disinformation monitoring activities individuals upload disinformation across social media platforms rapid verification claims images artificial intelligence machine learning based tool creating corrective responses accurate facts establishing archive long term retention data proposed features raise concerns mass surveillance could chilling effect online speech due advancement technology decrease marginal costs possible governments monitor social media activity millions citizens without knowledge consent kind social media monitoring tool becil seeks procure would collect process personal data users social media platforms use automated technology like artificial intelligence aggregate organize analyse large amount data collected share governments concern misinformation genuine serious problem maintain mass surveillance millions indian internet users without legal safeguards proportionate solution digital india become digital panopticon todays world people share large amount information social media platforms political views religious beliefs sexual orientation gender identity mental health etc reason companies like facebook twitter prohibit automated scraping data platform without prior written permission company individuals share sensitive personal information friends family followers reasonably foresee information collected social media profile government agencies stored indefinitely exists real risk harm sensitive personal information collected social media platforms processed opaque algorithms build probabilistic profile individual make person target law enforcement agencies context pertinent note profiling based social media activity particularly susceptible misinterpretation use likes shares hashtags may represent endorsement therefore individuals could wrongly classified disinformation spreaders algorithms finally data used train artificial intelligence machine learning tools determine information considered true false tools therefore training data flawed biased could lead discriminatory censorship particular groups violation fundamental rights internet users legality present india data protection legislation place regulate tools sought procured becil via tender absence underlying data protection legislation indian internet users mechanism seek deletion modification correction data remedy misuse data remedy miscategorization opaque algorithms honble supreme court consistently held restrictions fundamental rights imposed statutory provision rule therefore absence general data protection law specific legislation must enacted provide legal basis tender privacy judge bench honble supreme court ks puttaswamy v union india scc unanimously held privacy fundamental right constitution india fact kaul js opinion case explicitly recognized may exist reasonable expectation privacy even social media posts following words posting social media websites meant certain audience possible per tools available said sundry public right somehow access information make use collection processing public social media posts also subject regulation noted european court justice belgische vereniging van auteurs componisten en uitgevers cvba sabam v netlog nv court held injunction requiring installation contested filtering system would involve identification systematic analysis processing information connected profiles created social network users information connected profiles protected personal data principle allows users identified see analogy scarlet extended paragraph freedom speech amp expression fundamental right freedom speech expression guaranteed arta constitution india honble supreme court shreya singhal v union india scc held overbroad restrictions chilling effect online speech unconstitutional chilling effect surveillance technologies also recognized honble supreme court pucl v union india scc court held telephone tapping could infringe freedom speech expression since people may feel reluctant speak watchful gaze government mass surveillance social media activity lead selfcensorship individuals especially deter disclosure information journalists activists whistleblowers freedom association social media platforms helped individuals collectivize form communities around shared professional political social cultural interests pervasive social media monitoring would undermine right form associations guaranteed article c constitution india especially relevant since tender states vendors must provide tool detect coordinated campaigns carry link analysis different entities worth noting becil sought create ambitious version project form social media communication hub read herehttpsinternetfreedominnoticeonthesocialmediacommunicationhubsaveourprivacy thankfully social media communication hub scrapped public outrage litigation supreme court present tender must also meet fate since suffers similar problems required sustained advocacy citizens civil society groups ensure sleep walk surveillance state important documents legal notice becil dated linkhttpsdrivegooglecomfiledlzbaauurklordlspkiqitzcviewuspsharing join us fight mass surveillance donate become member iff todayhttpswwwinternetfreedomindonate ",
    "cleaned_title": "mass surveillance social media users solution fake news",
    "cleaned_selftext": "tldr today sent legal notice tender released becil procurement fact verification disinformation detection tools lead mass surveillance social media users current form tender proposed project unconstitutional illegal violation privacy freedom expression freedom association citizens must halted immediately background broadcast engineering consultants india limited becil released tender procurement solution services related fact verification disinformation detection per tender documents scope work project includes detecting analyzing coordinated disinformation campaigns identifying key influencers behind disinformation geographical location carrying link analysis different entities spreading fake news sentiment analysis large scale disinformation monitoring activities individuals upload disinformation across social media platforms rapid verification claims images artificial intelligence machine learning based tool creating corrective responses accurate facts establishing archive long term retention data proposed features raise concerns mass surveillance could chilling effect online speech due advancement technology decrease marginal costs possible governments monitor social media activity millions citizens without knowledge consent kind social media monitoring tool becil seeks procure would collect process personal data users social media platforms use automated technology like artificial intelligence aggregate organize analyse large amount data collected share governments concern misinformation genuine serious problem maintain mass surveillance millions indian internet users without legal safeguards proportionate solution digital india become digital panopticon todays world people share large amount information social media platforms political views religious beliefs sexual orientation gender identity mental health etc reason companies like facebook twitter prohibit automated scraping data platform without prior written permission company individuals share sensitive personal information friends family followers reasonably foresee information collected social media profile government agencies stored indefinitely exists real risk harm sensitive personal information collected social media platforms processed opaque algorithms build probabilistic profile individual make person target law enforcement agencies context pertinent note profiling based social media activity particularly susceptible misinterpretation use likes shares hashtags may represent endorsement therefore individuals could wrongly classified disinformation spreaders algorithms finally data used train artificial intelligence machine learning tools determine information considered true false tools therefore training data flawed biased could lead discriminatory censorship particular groups violation fundamental rights internet users legality present india data protection legislation place regulate tools sought procured becil via tender absence underlying data protection legislation indian internet users mechanism seek deletion modification correction data remedy misuse data remedy miscategorization opaque algorithms honble supreme court consistently held restrictions fundamental rights imposed statutory provision rule therefore absence general data protection law specific legislation must enacted provide legal basis tender privacy judge bench honble supreme court ks puttaswamy v union india scc unanimously held privacy fundamental right constitution india fact kaul js opinion case explicitly recognized may exist reasonable expectation privacy even social media posts following words posting social media websites meant certain audience possible per tools available said sundry public right somehow access information make use collection processing public social media posts also subject regulation noted european court justice belgische vereniging van auteurs componisten en uitgevers cvba sabam v netlog nv court held injunction requiring installation contested filtering system would involve identification systematic analysis processing information connected profiles created social network users information connected profiles protected personal data principle allows users identified see analogy scarlet extended paragraph freedom speech amp expression fundamental right freedom speech expression guaranteed arta constitution india honble supreme court shreya singhal v union india scc held overbroad restrictions chilling effect online speech unconstitutional chilling effect surveillance technologies also recognized honble supreme court pucl v union india scc court held telephone tapping could infringe freedom speech expression since people may feel reluctant speak watchful gaze government mass surveillance social media activity lead selfcensorship individuals especially deter disclosure information journalists activists whistleblowers freedom association social media platforms helped individuals collectivize form communities around shared professional political social cultural interests pervasive social media monitoring would undermine right form associations guaranteed article c constitution india especially relevant since tender states vendors must provide tool detect coordinated campaigns carry link analysis different entities worth noting becil sought create ambitious version project form social media communication hub read herehttpsinternetfreedominnoticeonthesocialmediacommunicationhubsaveourprivacy thankfully social media communication hub scrapped public outrage litigation supreme court present tender must also meet fate since suffers similar problems required sustained advocacy citizens civil society groups ensure sleep walk surveillance state important documents legal notice becil dated linkhttpsdrivegooglecomfiledlzbaauurklordlspkiqitzcviewuspsharing join us fight mass surveillance donate become member iff todayhttpswwwinternetfreedomindonate",
    "cleaned_comments": "gt detecting analyzing coordinated disinformation campaigns absolutely needed clear definition disinformation campaign brexit trump election two good examples influence operations capable keeping eye good idea gtidentifying key influencers behind disinformation geographical location pro identifying state sponsored campaigns gov simply see non indian locations running campaign con also possible monitor internal accounts trending stuff choose crackdown really bad gt carrying link analysis different entities spreading fake news pro helps gov identify influences operations quicker manner relation con chose unmask online identities relation activist accounts posting anonymously may ad gt sentiment analysis large scale disinformation analyze motives campaigns understand target audience well also impact campaign gt monitoring activities individuals upload disinformation across social media platforms depending definition disinformation certain accounts marked influencers tracked interactions monitored gt rapid verification claims images artificial intelligence machine learning based tool gt creating corrective responses accurate facts good initiative used fake news busting gt establishing archive long term retention data retaining data analysis proof one booked cases currently need write sm companies data record publicly available posts even deleted verdict important keep eye influence operations assuming judicious usage technology things may get worse government use quell internal dissent needless mention antics jealous low mid tier bureaucracy agencies tactic pick random activist set example possible positive outcome administration may move away total internet ban temporary specific sm blackout identify suppress actual influence operations crazy use suppress info threatens power misinformation anything fit version story done protect interests ruling party billionaires support want supress climate change action voices dissent anything threatens ruling party",
    "light_cleaned_title": "Mass surveillance of social media users is not the solution for fake news",
    "light_cleaned_selftext": "### Tl;dr Today, we sent a legal notice for a tender released by BECIL for procurement of fact verification and disinformation detection tools which will lead to mass surveillance of social media users. In its current form, this tender and the proposed project are an unconstitutional and illegal violation of privacy, freedom of expression and freedom of association of citizens, and it must be halted immediately. ### Background On 13.05.2020, Broadcast Engineering Consultants India Limited (BECIL) released a tender for procurement of *‘Solution and Services related to fact verification and disinformation detection.’* As per the tender documents, the scope of work for the project includes: 1. Detecting and analyzing coordinated disinformation campaigns. 2. Identifying key influencers behind disinformation and their geographical location. 3. Carrying out link analysis between different entities spreading fake news. 4. Sentiment analysis for large scale disinformation. 5. Monitoring activities of individuals who upload disinformation across social media platforms. 6. Rapid verification of claims and images through an Artificial Intelligence and machine learning based tool. 7. Creating corrective responses with accurate facts. 8. Establishing an archive for long term retention of data. These proposed features raise concerns about mass surveillance and could have a chilling effect on online speech. Due to advancement in technology and decrease in marginal costs, it is now possible for governments to monitor the social media activity of millions of citizens without their knowledge or consent. The kind of social media monitoring tool that BECIL seeks to procure would collect and process personal data of users from social media platforms and then use automated technology like artificial intelligence to aggregate, organize and analyse the large amount of data collected. While we share the government’s concern about misinformation which is a genuine and serious problem, we maintain that mass surveillance of millions of Indian internet users without any legal safeguards is not a proportionate solution. ### Digital India should not become a Digital Panopticon In today’s world, people share a large amount of information on social media platforms about their political views, religious beliefs, sexual orientation, gender identity, mental health etc. For this reason, some companies like Facebook and Twitter prohibit automated scraping of data from their platform without prior written permission of the company. When individuals share sensitive personal information with their friends, family and followers, they cannot reasonably foresee that such information will be collected from their social media profile by government agencies and stored indefinitely. Further, there exists a real risk of harm because sensitive personal information collected from social media platforms will be processed by opaque algorithms to build a probabilistic profile of the individual which can make the person a target for law enforcement agencies. In this context, it is pertinent to note that any profiling based on social media activity is particularly susceptible to misinterpretation because the use of likes, shares or hashtags may not represent endorsement. Therefore, individuals could be wrongly classified as disinformation spreaders by algorithms. Finally, the data which is used to train artificial intelligence and machine learning tools will determine what information is considered true or false by these tools. Therefore, if the training data is flawed or biased, it could lead to discriminatory censorship of particular groups. ### Violation of Fundamental Rights of Internet Users **Legality:** At present, India does not have a data protection legislation in place to regulate tools such as those sought to be procured by BECIL via the tender. In the absence of any underlying data protection legislation, Indian internet users do not have any mechanism to seek deletion, modification or correction of their data, remedy for misuse of their data or remedy for miscategorization by opaque algorithms. The Hon’ble Supreme Court has consistently held that restrictions on fundamental rights can only be imposed through a statutory provision or rule. Therefore, in the absence of a general data protection law, a specific legislation must be enacted to provide a legal basis to the tender. **Privacy:** In 2017, a 9 judge bench of the Hon’ble Supreme Court in *K.S. Puttaswamy v. Union of India (2017 10 SCC 1)* unanimously held that privacy was a fundamental right under the Constitution of India. In fact, Kaul J.’s opinion in the case explicitly recognized that there may exist a reasonable expectation of privacy even over social media posts in the following words: *“If the posting on social media websites is meant only for a certain audience, which is possible as per tools available, then it cannot be said that all and sundry in public have a right to somehow access that information and make use of it.\"* Collection and processing of public social media posts is also subject to regulation as noted by the European Court of Justice in *Belgische Vereniging van Auteurs, Componisten en Uitgevers CVBA (SABAM) v. Netlog NV*, where the Court held that *\"the injunction requiring installation of the contested filtering system would involve the identification, systematic analysis and processing of information connected with the profiles created on the social network by its users. The information connected with those profiles is protected personal data because, in principle, it allows those users to be identified (see, by analogy, Scarlet Extended, paragraph 51).”* **Freedom of Speech &amp; Expression:** The fundamental right to freedom of speech and expression is guaranteed under Art.19(1)(a) of the Constitution of India, and the Hon’ble Supreme Court in *Shreya Singhal v. Union of India (2015 5 SCC 1***)** has held that overbroad restrictions which have a chilling effect on online speech are unconstitutional. The chilling effect of surveillance technologies has also been recognized by the Hon’ble Supreme Court in *PUCL v. Union of India ( 1997 1 SCC 301)* where the Court held that telephone tapping could infringe freedom of speech and expression since people may feel reluctant to speak under the watchful gaze of the government. Mass surveillance of social media activity will lead to self-censorship by individuals and especially deter disclosure of information by journalists, activists and whistleblowers. **Freedom of Association:** Social media platforms have helped individuals collectivize and form communities around their shared professional, political, social or cultural interests. Pervasive social media monitoring would undermine the right to form such associations which is guaranteed by Article 19(1)(c) of the Constitution of India. This is especially relevant since the tender states that vendors must provide a tool which can detect coordinated campaigns and carry out link analysis between different entities. It is worth noting that in 2018, BECIL had sought to create a more ambitious version of this project in the form of a Social Media Communication Hub (Read more [**here**](https://internetfreedom.in/notice-on-the-social-media-communication-hub-saveourprivacy/)). Thankfully, the Social Media Communication Hub was scrapped after public outrage and litigation before the Supreme Court. The present tender must also meet the same fate since it suffers from similar problems but this will required sustained advocacy by citizens and civil society groups to ensure we do not sleep walk into a surveillance state. ### Important Documents 1. Legal Notice to BECIL dated 19.06.2020 ([**link**](https://drive.google.com/file/d/1l145Z6BA3auuR0kL1ordl2s4pKiQITzC/view?usp=sharing)) [**Join us in our fight against mass surveillance. Donate and become a member with IFF today!**](https://www.internetfreedom.in/donate)",
    "light_cleaned_comments": "&gt;1. Detecting and analyzing coordinated disinformation campaigns. Absolutely needed. But there should be clear definition of disinformation and campaign. Brexit and trump election are two good examples what influence operations are capable off. Keeping an eye of them is a good idea. &gt;Identifying key influencers behind disinformation and their geographical location. Pro: By identifying the state sponsored campaigns, gov can simply see through the non Indian locations running the campaign Con: its also possible to monitor internal accounts trending stuff and if they choose to crackdown, that will be really bad. &gt;3. Carrying out link analysis between different entities spreading fake news Pro: Same with the above, it helps gov to identify influences operations in a quicker manner and the relation between them. Con: If they chose to unmask the online identities and relation between the activist accounts that are posting anonymously that may be ad for them.. &gt;4. Sentiment analysis for large scale disinformation. Analyze the motives of the campaigns and understand the target audience well. Also the impact of each campaign. &gt;5. Monitoring activities of individuals who upload disinformation across social media platforms. Depending of the definition of disinformation, certain accounts that are marked as influencers will be tracked and all interactions will be monitored. &gt;6. Rapid verification of claims and images through an Artificial Intelligence and machine learning based tool. &gt;7. Creating corrective responses with accurate facts. Good initiative. Can be used for fake news busting. &gt;8. Establishing an archive for long term retention of data. Retaining data for further analysis and as a proof of any one is booked under cases. Currently they need to write to SM companies for more data, now they can record publicly available posts. Even after they are deleted. Verdict. : while it's important to keep an eye on the influence operations, (assuming the judicious usage of technology) Things may get worse if government use it to quell internal dissent. Needless to mention the antics of over jealous low to mid tier bureaucracy. And Agencies tactic to pick a random activist to set an example. Possible positive outcome: Administration may move away from total internet ban to temporary and specific SM blackout or identify and suppress the actual influence operations. This is crazy. They will use this to suppress any info that threatens their power. \"Misinformation\" is anything that does not fit their version of the story. This is being done to protect the interests of ruling party and the billionaires that support it. The want to supress climate change action, voices of dissent and anything that threatens the ruling party"
}