{
    "id": "14u44v5",
    "title": "Your recent vande Bharath experience",
    "url": "https://www.reddit.com/r/india/comments/14u44v5/your_recent_vande_bharath_experience/",
    "selftext": "https://twitter.com/Railfann9971/status/1675162262477357059\n\nRecently saw this tweet on declining food quality. Just wanted to see your recent experience on food on trains and whether you have noticed similar things",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 7,
    "created_utc": 1688822444.0,
    "convurl": "https://external-preview.redd.it/SbSWefzJ9MUcjcO188xN80WgcPtorBBFsNboedCoPmw.jpg?auto=webp&s=c5f641bb6bcb62ce8dc7cc05a35f77f136e2cc53",
    "comments": [
        "oh I'm traveling by vande Bharat tomorrow. To Chennai. Will let you know",
        "Yet another thing destroyed by poor governance.",
        "holy shit you're so salty man. I've seen you on multiple posts and you being critical baselessly all the time.\n\nYou are not even criticizing, you're just hating.\n\nit you want to criticize, put forth a dialogue with claims proved by reliable sources and your reasoning.",
        "Sad. I was waiting for your review",
        "Vande Bharat has the same food as the Shatabdi. The exact same food pretty much. The rice is usually very abnormally dry and the dal and curries are very plain and unremarkable. The quality is just not good. You're better off opting out and just carrying your own food in the train. \n\nTbh the whole Vande Bharat experience is just...bleh. I see no major difference between Vande Bharat and Shatabdi, especially as I travel between Blore and Chennai frequently and they both take pretty much the same amount of time and have a very similar type of crowd and space. The bathrooms are a slight improvement, but not by that much.",
        "Usually 6 hrs late to arrive here in  Sec'bad from Vizag"
    ],
    "cleaned_text": "recent vande bharath experience recently saw tweet declining food quality wanted see recent experience food trains whether noticed similar things ",
    "cleaned_title": "recent vande bharath experience",
    "cleaned_selftext": "recently saw tweet declining food quality wanted see recent experience food trains whether noticed similar things",
    "cleaned_comments": "oh im traveling vande bharat tomorrow chennai let know yet another thing destroyed poor governance holy shit youre salty man ive seen multiple posts critical baselessly time even criticizing youre hating want criticize put forth dialogue claims proved reliable sources reasoning sad waiting review vande bharat food shatabdi exact food pretty much rice usually abnormally dry dal curries plain unremarkable quality good youre better opting carrying food train tbh whole vande bharat experience justbleh see major difference vande bharat shatabdi especially travel blore chennai frequently take pretty much amount time similar type crowd space bathrooms slight improvement much usually hrs late arrive secbad vizag",
    "light_cleaned_title": "Your recent vande Bharath experience",
    "light_cleaned_selftext": "Recently saw this tweet on declining food quality. Just wanted to see your recent experience on food on trains and whether you have noticed similar things",
    "light_cleaned_comments": "oh I'm traveling by vande Bharat tomorrow. To Chennai. Will let you know Yet another thing destroyed by poor governance. holy shit you're so salty man. I've seen you on multiple posts and you being critical baselessly all the time. You are not even criticizing, you're just hating. it you want to criticize, put forth a dialogue with claims proved by reliable sources and your reasoning. Sad. I was waiting for your review Vande Bharat has the same food as the Shatabdi. The exact same food pretty much. The rice is usually very abnormally dry and the dal and curries are very plain and unremarkable. The quality is just not good. You're better off opting out and just carrying your own food in the train. Tbh the whole Vande Bharat experience is just...bleh. I see no major difference between Vande Bharat and Shatabdi, especially as I travel between Blore and Chennai frequently and they both take pretty much the same amount of time and have a very similar type of crowd and space. The bathrooms are a slight improvement, but not by that much. Usually 6 hrs late to arrive here in Sec'bad from Vizag"
}