{
    "id": "18hiu39",
    "title": "Current state of Indian Railways",
    "url": "https://www.reddit.com/gallery/18hiu39",
    "selftext": "This is the state of Indian Railways. Cockroaches everywhere!\n\nI captured few under the coffee cup, I guess “Catch the Cockroach” is the built-in entertainment system.",
    "flair": "Rant / Vent",
    "score": 500,
    "num_comments": 104,
    "created_utc": 1702480011.0,
    "convurl": "https://i.redd.it/xbgcg035v26c1.jpg",
    "comments": [
        "OC photo, Captured in West Bengal.",
        "Those small cockroaches are everywhere, including night trains and climb all over you during the night !",
        "I know right! Such a crappy service, we are just releasing new trains but the infrastructure is crumbling. \n\nAnd don’t get me started on delays, my entire journey is for only 5 hours, but train is already more than an hour late.",
        "If that's the only thing you found then things are improved a lot",
        "I saw a huge rat on a train a while ago. The coach was empty so I ran away to another one.",
        "Poor little fellow just got posted by the railways. He just wanted to say hello. Why are you hyping up.",
        "Aunty nashnl ho aap",
        "wow!  do create a complaint in the railway madad app. I did, though I am not sure if anything would come out of it.",
        "Did you just assume the gender of the cockroach, shame on you!",
        "Yo man stop being fucking anti-national and check out vande Bharat. \n\nAlso, I'm seeing this same state since my childhood.",
        "still not as bad as what you find in NYC trains \n\nhttps://preview.redd.it/norlbqxgf36c1.png?width=1575&format=png&auto=webp&s=508c805bfe376e42d88458b169d48961e15403ce",
        "Today i came from double deckr train and rhe clealiness was not there , initially it was there but dont know how it has become this low.",
        "And yeah, these Indians can't stop bragging about our past achievements whne this is the future",
        "Yo they providing proteins...",
        "I had a similar experience…..with AirIndia………..😭😭😭",
        "7 years back, I woke up one morning and saw some rat had eaten the shoe laces of my shoes. The worst part was that the previous night I was humored seeing that rat roaming here and there which looked quite funny that time.",
        "As a person who travels sleeper class, I'm happy to share my seat with cockroaches",
        "Bas koi waiting ticket wala na baith jaye saath me",
        "Modi ji is working 18 hours a day. Everyday he showers in the airports before his meetings. Soldiers are dying. We have semihighspeedsuperfastbullet vande Bharat connecting Manipur to Kerala. Yet you have to complaint about eff'ing cockroach, you anti-national of India... sorry, Bharat",
        "Vande Bharat ka photo dekh lo",
        "I had similar situation at Gloria jeans, Lahore airport. 😬",
        "Rat prolly took a ride to meet its gf.",
        "Don't give them conservatives ideas.",
        "Government will always be inefficient. Not sure how long we need to understand this fact",
        "Idk what the contractors are doing. And the IR will never care",
        "I thought this was normal...",
        "but look at gande bhaaraat saar 🤷🏾‍♂️",
        "Hey, I'm pretty sure you have those in your home too. I'm a little salty today. Forgive me. But wtf bro? \n\nLet me explain. What's with the sensitivity? First of all, it's a train. Second, it's India. Third, highest populated country in the world. \n\nAnd my phinal point, this is not Twitter or what you call that thing now. Smack that little shit and move on. You are not special. Hygiene is not even on the list in this country. Just because you have a fucking 🪳 in your empty cup and now you complain the state of the entire division? Look around big guy, it's a big world and a roach is a chappal away from no roach. Kya he bey. Chee. \"woke up mein\" chal BC. Tere ko problem hai to peisa kama aur nikal, eUroPe aur CaNAda ya Amrika ja. \n\nA fucking roach man, and you are triggered. \n\nMOD, fuck you too.",
        "It’s always been like this. Some credit also goes to the passengers who will eat and dump the garbage under seats. Perfect breeding grounds for pests.",
        "Yuck",
        "its something morons of the left would do to fight for climate change or something like that",
        "Does anyone have any mechanism by which ti exterminate these insects in a containedlr that is practically closed and is full of people for long periods of time. Even when we spray insecticide in our homes, we leave the door and windows open to drive away the insects or the room shall become uninhabitabke even for us. If we close them and stay inside, we too would suffocate along with the cockroaches. One alternative is to use back up coaches for every trip. This would drive up the cost, double it rather. Let us hear solutions. Cockroaches thrive everywhere, from railway coaches to your microwaves.",
        "I always wash out my bags after traveling fearing some serious bed bug infestation. You must do too.",
        "Free protein 💪🏻",
        "Dude, there are at least 50 small cockroaches in my 3 bedroom home alone. I used special products like lakshmanrehka, they seem to work only on big, black cockroaches but I didn't find any small cockroache dead bodies when I apply it.",
        "Air india is also same what do you mean??",
        "There are at least 50 small cockroaches in my 3 bedroom apartment alone. I used special products like lakshmanrehka, but they seem to work only on big, black cockroaches because I didn't find any small cockroache dead bodies when I apply it.\n\nIf this is my house then what can you expect from a train that moves from one place to another and that has passengers bringing in their luggage, that could contain cockroaches.",
        "Don't blame gov for that... people carry it unknowingly on their body or bags from their home to public places.",
        "What lame excuse",
        ">in your empty cup and now you complain the state of the entire division?\n\nopposing for the sake of opposition se kuch nahi hota bhai. Roach hai to roach hai, if he does not post this we wont get awareness, so nobody would even think to act about it. Tbh indian railways has always been dirty and the stations esp in metro cities are mismanaged and dirty. People have jobs specifically to tackle this and you mention that hygine is not on the priority list of the country!? To wo kya job chhod de?\n\n&#x200B;\n\nI hope this is satire.",
        "/s bhul gaye aap...\n\nproblem hai to bas point out karraha hai, agar trains clean hoti to nahi hota ye sab",
        "That's like the least dirty shit you could see in Indian railways",
        "There are at least 50 small cockroaches in my 3 bedroom apartment alone. I used special products like lakshmanrehka, but they seem to work only on big, black cockroaches because I didn't find any small cockroache dead bodies when I apply it.\n\nIf this is my house then what can you expect from a train that moves from one place to another and that has passengers upload their luggage, that could contain cockroaches.",
        "govt can set up an accountability system of each department, something less extreme than china but still effective.",
        "on a plane?!?!",
        "Solution ig: [https://www.pestkeen.com/how-to-prevent-cockroaches-from-infesting-your-train-or-subway-system/](https://www.pestkeen.com/how-to-prevent-cockroaches-from-infesting-your-train-or-subway-system/)",
        "Why are you being so \"Anti-National\" by focusing on ground realities instead of the PR for which crores are diverted from safety and maintenance??",
        "Current state of India overall",
        "damn carkooches",
        "There's nothing new about this, to be honest.",
        "Quick everyone act SURPRISED",
        "Just a few days ago when i said something about hygiene issue in r/indianrailways sub i got downvoted lol and somebody even told me that im poor lol",
        "That is truly disgusting. I mean why would u drink nescafe?",
        "Our government is busy with VandeBharat",
        "The fact the cockroaches get to travel more than I do is killing me",
        "Not really a satire but please do take it like a rant. \n\nHere is what I really think. The railway is mess because the \"public\" litters. They drop food all over the place and no courtesy to clean up after them hence the roaches.. the reality is, you can't change the world. Just get rid of the bugger and move on. What's the point? There are bigger problems and this ain't the most fluorescent elephant.\n\n\nI've been on a train like twice in my life. But it's true when they say you can see real India when you are on the railways. I'm not oblivious about the fact and need not be directed for awareness. I say blame the people not the staff. I mean, what do you really expect from an underpant govt employee? I say, kill the bug, get another cup of tea and enjoy the ride.This ain't the battle.\n\nAgain forgive me for being rude to OP but I wanted to be real.",
        "like isn't this something very casual as Indian? like even if there are 10s of them it will probably go unnoticed considering India.",
        "Don't disrespect bro, he got a ticket",
        "So now coffee is served with a side of live cockroach",
        "uh what's the big deal ? it's been always like this since forever.",
        "it is, so I don't get wtf is the big deal",
        "> Everyday he showers\n\nreally ?",
        "They were being sarcastic mate. \n\nThe fact you accept this as normal just shows the sad state of how many shitty disgusting things people in the country are fine with.",
        "Yeah ikr. Imagine thinking about climate change, smh stupid liberals.",
        "its not protesting about climate change which is the problem , you crazy lefty like yourself would probably dress up like that rat to protest for reasons best known to them",
        "Can't believe you got downvoted by all the librtard sheep on here..oh wait",
        "🤣🤣",
        "I think it's fair to say that the railways are a British legacy. It's fair to assume the cockroaches are just angry at them and are out and about to protest in Amrit Kaal",
        "Just saying that in 2005 i opened my roti and a roach crawled out… so it seems to be the same now lol",
        "These coaches are not running 24/7 and they are supposed to undergo regular inspections. How difficult is it to apply pesticides when the coaches are at the maintenance depot?",
        "This isn't even remotely offensive. I've seen a full grown man on diapers feeding on his supposedly plus size gf's titties openly and another dude rubbing one out with his schlong out lol",
        "Not bad till you meet those reel girls.",
        "Free rides for everyone!",
        " Ye toh common hai. Kuch naya batao",
        "Normalisation of stuff that should not be normalised in a 21st century society is something we seem to be quite proud of for some apparent reason and it’s sad man :(",
        "Please take pictures with consent. I am not sure the ckrch wanted such publicity.",
        "Bhai , it was  a mouse ,right?",
        "I only use trains on Mumbai Pune routes and the Hyderabad Shatabdi. Every other route has been a cesspool. Only these routes in my experience are well mantained trains.",
        "Cleanliness is not priority, personal or public spaces.\n\nWhich is why India is still a 3rd world country.\n\nWell, since people's minds are already so polluted..",
        "They fly now",
        ":D",
        "Sorry, need to check if it has anal cerci before making a statement on it's gender again.",
        "These are German cockroaches, impossible to kill. I cant blame railways for it.",
        "Complain on Twitter. Tag railminindia. Your problems will be solved very fast",
        "One cockroach was all it took to rile you up and badmouth the public rail service of the country. Great strength indeed 😂",
        "Rajdhani me rats dekhe hai maine bohot baar..ye to kuch bhi nhi",
        "Yummy 😋",
        "https://preview.redd.it/rpa0rogf476c1.jpeg?width=3024&format=pjpg&auto=webp&s=60eebd065ae60379a3bff240571dd60efc24079f",
        "https://preview.redd.it/hq36q3ej476c1.jpeg?width=3024&format=pjpg&auto=webp&s=418f7ae852ac759f96e1443969e37286bdceeb8a",
        "https://preview.redd.it/rugtkk9l476c1.jpeg?width=3024&format=pjpg&auto=webp&s=79f446103b8224b5d79b04795fcaf0ac5b09935d",
        "I too was given an opportunity by Indian Railways to try my hand on pest photography 😉",
        "Smile... rail minister himself is traveling with you for your safety...",
        "It could start with sealing gaps. Also the container is not closed, most ac coaches circulate air using ac vents. Pest control should be standard, I can only see people’s lack of complaints not converting to more efforts in sanitation. \n\nNon ac and sleeper classes, hm might be budget constrained and worse to travel in.",
        "They fly now",
        "but modiji.. bullet train…",
        "Cockroaches in trains are unacceptable. I’ve killed so many during my train journeys.",
        "Which train?",
        "> Some credit\n\nMost.",
        "> Government will always be inefficient.\n\nThan explain situation of  DMRC.",
        "Laughing at word (current) it was and always be 🤐",
        "Not current state of affairs but permanent state of affairs",
        "They fly now",
        "WoW u got company",
        "Aaj kal general/ no ticket wale aake baith jate h sleeper m.",
        "*Uff* somehow palpatine returned",
        "The Current Govt only understands development, no need for any maintenance what so ever.",
        "Wasn't it always like that. Cockroaches were normal appearances even in 1st AC and 2nd AC.",
        "Hamesha se hai ye babu, hamesha se",
        "Are you implying that dmrc is efficient?",
        "What if he chose to be they them",
        "Yep cockroaches everywhere even in IAC. And coaches are poorly maintained.\n\nSurprised that Indian railways can't get improved coach designs, with better finishes and factor how to tackle rodents and insects.",
        "It is.",
        "lol. Repeat it and you may believe it too"
    ],
    "cleaned_text": "current state indian railways state indian railways cockroaches everywhere captured coffee cup guess catch cockroach builtin entertainment system ",
    "cleaned_title": "current state indian railways",
    "cleaned_selftext": "state indian railways cockroaches everywhere captured coffee cup guess catch cockroach builtin entertainment system",
    "cleaned_comments": "oc photo captured west bengal small cockroaches everywhere including night trains climb night know right crappy service releasing new trains infrastructure crumbling dont get started delays entire journey hours train already hour late thats thing found things improved lot saw huge rat train ago coach empty ran away another one poor little fellow got posted railways wanted say hello hyping aunty nashnl ho aap wow create complaint railway madad app though sure anything would come assume gender cockroach shame yo man stop fucking antinational check vande bharat also im seeing state since childhood still bad find nyc trains today came double deckr train rhe clealiness initially dont know become low yeah indians cant stop bragging past achievements whne future yo providing proteins similar experiencewith airindia years back woke one morning saw rat eaten shoe laces shoes worst part previous night humored seeing rat roaming looked quite funny time person travels sleeper class im happy share seat cockroaches bas koi waiting ticket wala na baith jaye saath modi ji working hours day everyday showers airports meetings soldiers dying semihighspeedsuperfastbullet vande bharat connecting manipur kerala yet complaint effing cockroach antinational india sorry bharat vande bharat ka photo dekh lo similar situation gloria jeans lahore airport rat prolly took ride meet gf dont give conservatives ideas government always inefficient sure long need understand fact idk contractors ir never care thought normal look gande bhaaraat saar hey im pretty sure home im little salty today forgive wtf bro let explain whats sensitivity first train second india third highest populated country world phinal point twitter call thing smack little shit move special hygiene even list country fucking empty cup complain state entire division look around big guy big world roach chappal away roach kya bey chee woke mein chal bc tere ko problem hai peisa kama aur nikal europe aur canada ya amrika ja fucking roach man triggered mod fuck always like credit also goes passengers eat dump garbage seats perfect breeding grounds pests yuck something morons left would fight climate change something like anyone mechanism ti exterminate insects containedlr practically closed full people long periods time even spray insecticide homes leave door windows open drive away insects room shall become uninhabitabke even us close stay inside would suffocate along cockroaches one alternative use back coaches every trip would drive cost double rather let us hear solutions cockroaches thrive everywhere railway coaches microwaves always wash bags traveling fearing serious bed bug infestation must free protein dude least small cockroaches bedroom home alone used special products like lakshmanrehka seem work big black cockroaches didnt find small cockroache dead bodies apply air india also mean least small cockroaches bedroom apartment alone used special products like lakshmanrehka seem work big black cockroaches didnt find small cockroache dead bodies apply house expect train moves one place another passengers bringing luggage could contain cockroaches dont blame gov people carry unknowingly body bags home public places lame excuse empty cup complain state entire division opposing sake opposition se kuch nahi hota bhai roach hai roach hai post wont get awareness nobody would even think act tbh indian railways always dirty stations esp metro cities mismanaged dirty people jobs specifically tackle mention hygine priority list country wo kya job chhod de xb hope satire bhul gaye aap problem hai bas point karraha hai agar trains clean hoti nahi hota ye sab thats like least dirty shit could see indian railways least small cockroaches bedroom apartment alone used special products like lakshmanrehka seem work big black cockroaches didnt find small cockroache dead bodies apply house expect train moves one place another passengers upload luggage could contain cockroaches govt set accountability system department something less extreme china still effective plane solution ig httpswwwpestkeencomhowtopreventcockroachesfrominfestingyourtrainorsubwaysystemhttpswwwpestkeencomhowtopreventcockroachesfrominfestingyourtrainorsubwaysystem antinational focusing ground realities instead pr crores diverted safety maintenance current state india overall damn carkooches theres nothing new honest quick everyone act surprised days ago said something hygiene issue rindianrailways sub got downvoted lol somebody even told im poor lol truly disgusting mean would u drink nescafe government busy vandebharat fact cockroaches get travel killing really satire please take like rant really think railway mess public litters drop food place courtesy clean hence roaches reality cant change world get rid bugger move whats point bigger problems aint fluorescent elephant ive train like twice life true say see real india railways im oblivious fact need directed awareness say blame people staff mean really expect underpant govt employee say kill bug get another cup tea enjoy ridethis aint battle forgive rude op wanted real like isnt something casual indian like even probably go unnoticed considering india dont disrespect bro got ticket coffee served side live cockroach uh whats big deal always like since forever dont get wtf big deal everyday showers really sarcastic mate fact accept normal shows sad state many shitty disgusting things people country fine yeah ikr imagine thinking climate change smh stupid liberals protesting climate change problem crazy lefty like would probably dress like rat protest reasons best known cant believe got downvoted librtard sheep hereoh wait think fair say railways british legacy fair assume cockroaches angry protest amrit kaal saying opened roti roach crawled seems lol coaches running supposed undergo regular inspections difficult apply pesticides coaches maintenance depot isnt even remotely offensive ive seen full grown man diapers feeding supposedly plus size gfs titties openly another dude rubbing one schlong lol bad till meet reel girls free rides everyone ye toh common hai kuch naya batao normalisation stuff normalised st century society something seem quite proud apparent reason sad man please take pictures consent sure ckrch wanted publicity bhai mouse right use trains mumbai pune routes hyderabad shatabdi every route cesspool routes experience well mantained trains cleanliness priority personal public spaces india still rd world country well since peoples minds already polluted fly sorry need check anal cerci making statement gender german cockroaches impossible kill cant blame railways complain twitter tag railminindia problems solved fast one cockroach took rile badmouth public rail service country great strength indeed rajdhani rats dekhe hai maine bohot baarye kuch bhi nhi yummy given opportunity indian railways try hand pest photography smile rail minister traveling safety could start sealing gaps also container closed ac coaches circulate air using ac vents pest control standard see peoples lack complaints converting efforts sanitation non ac sleeper classes hm might budget constrained worse travel fly modiji bullet train cockroaches trains unacceptable ive killed many train journeys train credit government always inefficient explain situation dmrc laughing word current always current state affairs permanent state affairs fly wow u got company aaj kal general ticket wale aake baith jate h sleeper uff somehow palpatine returned current govt understands development need maintenance ever wasnt always like cockroaches normal appearances even st ac nd ac hamesha se hai ye babu hamesha se implying dmrc efficient chose yep cockroaches everywhere even iac coaches poorly maintained surprised indian railways cant get improved coach designs better finishes factor tackle rodents insects lol repeat may believe",
    "light_cleaned_title": "Current state of Indian Railways",
    "light_cleaned_selftext": "This is the state of Indian Railways. Cockroaches everywhere! I captured few under the coffee cup, I guess “Catch the Cockroach” is the built-in entertainment system.",
    "light_cleaned_comments": "OC photo, Captured in West Bengal. Those small cockroaches are everywhere, including night trains and climb all over you during the night ! I know right! Such a crappy service, we are just releasing new trains but the infrastructure is crumbling. And don’t get me started on delays, my entire journey is for only 5 hours, but train is already more than an hour late. If that's the only thing you found then things are improved a lot I saw a huge rat on a train a while ago. The coach was empty so I ran away to another one. Poor little fellow just got posted by the railways. He just wanted to say hello. Why are you hyping up. Aunty nashnl ho aap wow! do create a complaint in the railway madad app. I did, though I am not sure if anything would come out of it. Did you just assume the gender of the cockroach, shame on you! Yo man stop being fucking anti-national and check out vande Bharat. Also, I'm seeing this same state since my childhood. still not as bad as what you find in NYC trains Today i came from double deckr train and rhe clealiness was not there , initially it was there but dont know how it has become this low. And yeah, these Indians can't stop bragging about our past achievements whne this is the future Yo they providing proteins... I had a similar experience…..with AirIndia………..😭😭😭 7 years back, I woke up one morning and saw some rat had eaten the shoe laces of my shoes. The worst part was that the previous night I was humored seeing that rat roaming here and there which looked quite funny that time. As a person who travels sleeper class, I'm happy to share my seat with cockroaches Bas koi waiting ticket wala na baith jaye saath me Modi ji is working 18 hours a day. Everyday he showers in the airports before his meetings. Soldiers are dying. We have semihighspeedsuperfastbullet vande Bharat connecting Manipur to Kerala. Yet you have to complaint about eff'ing cockroach, you anti-national of India... sorry, Bharat Vande Bharat ka photo dekh lo I had similar situation at Gloria jeans, Lahore airport. 😬 Rat prolly took a ride to meet its gf. Don't give them conservatives ideas. Government will always be inefficient. Not sure how long we need to understand this fact Idk what the contractors are doing. And the IR will never care I thought this was normal... but look at gande bhaaraat saar 🤷🏾‍♂️ Hey, I'm pretty sure you have those in your home too. I'm a little salty today. Forgive me. But wtf bro? Let me explain. What's with the sensitivity? First of all, it's a train. Second, it's India. Third, highest populated country in the world. And my phinal point, this is not Twitter or what you call that thing now. Smack that little shit and move on. You are not special. Hygiene is not even on the list in this country. Just because you have a fucking 🪳 in your empty cup and now you complain the state of the entire division? Look around big guy, it's a big world and a roach is a chappal away from no roach. Kya he bey. Chee. \"woke up mein\" chal BC. Tere ko problem hai to peisa kama aur nikal, eUroPe aur CaNAda ya Amrika ja. A fucking roach man, and you are triggered. MOD, fuck you too. It’s always been like this. Some credit also goes to the passengers who will eat and dump the garbage under seats. Perfect breeding grounds for pests. Yuck its something morons of the left would do to fight for climate change or something like that Does anyone have any mechanism by which ti exterminate these insects in a containedlr that is practically closed and is full of people for long periods of time. Even when we spray insecticide in our homes, we leave the door and windows open to drive away the insects or the room shall become uninhabitabke even for us. If we close them and stay inside, we too would suffocate along with the cockroaches. One alternative is to use back up coaches for every trip. This would drive up the cost, double it rather. Let us hear solutions. Cockroaches thrive everywhere, from railway coaches to your microwaves. I always wash out my bags after traveling fearing some serious bed bug infestation. You must do too. Free protein 💪🏻 Dude, there are at least 50 small cockroaches in my 3 bedroom home alone. I used special products like lakshmanrehka, they seem to work only on big, black cockroaches but I didn't find any small cockroache dead bodies when I apply it. Air india is also same what do you mean?? There are at least 50 small cockroaches in my 3 bedroom apartment alone. I used special products like lakshmanrehka, but they seem to work only on big, black cockroaches because I didn't find any small cockroache dead bodies when I apply it. If this is my house then what can you expect from a train that moves from one place to another and that has passengers bringing in their luggage, that could contain cockroaches. Don't blame gov for that... people carry it unknowingly on their body or bags from their home to public places. What lame excuse >in your empty cup and now you complain the state of the entire division? opposing for the sake of opposition se kuch nahi hota bhai. Roach hai to roach hai, if he does not post this we wont get awareness, so nobody would even think to act about it. Tbh indian railways has always been dirty and the stations esp in metro cities are mismanaged and dirty. People have jobs specifically to tackle this and you mention that hygine is not on the priority list of the country!? To wo kya job chhod de? &#x200B; I hope this is satire. /s bhul gaye aap... problem hai to bas point out karraha hai, agar trains clean hoti to nahi hota ye sab That's like the least dirty shit you could see in Indian railways There are at least 50 small cockroaches in my 3 bedroom apartment alone. I used special products like lakshmanrehka, but they seem to work only on big, black cockroaches because I didn't find any small cockroache dead bodies when I apply it. If this is my house then what can you expect from a train that moves from one place to another and that has passengers upload their luggage, that could contain cockroaches. govt can set up an accountability system of each department, something less extreme than china but still effective. on a plane?!?! Solution ig: [https://www.pestkeen.com/how-to-prevent-cockroaches-from-infesting-your-train-or-subway-system/](https://www.pestkeen.com/how-to-prevent-cockroaches-from-infesting-your-train-or-subway-system/) Why are you being so \"Anti-National\" by focusing on ground realities instead of the PR for which crores are diverted from safety and maintenance?? Current state of India overall damn carkooches There's nothing new about this, to be honest. Quick everyone act SURPRISED Just a few days ago when i said something about hygiene issue in r/indianrailways sub i got downvoted lol and somebody even told me that im poor lol That is truly disgusting. I mean why would u drink nescafe? Our government is busy with VandeBharat The fact the cockroaches get to travel more than I do is killing me Not really a satire but please do take it like a rant. Here is what I really think. The railway is mess because the \"public\" litters. They drop food all over the place and no courtesy to clean up after them hence the roaches.. the reality is, you can't change the world. Just get rid of the bugger and move on. What's the point? There are bigger problems and this ain't the most fluorescent elephant. I've been on a train like twice in my life. But it's true when they say you can see real India when you are on the railways. I'm not oblivious about the fact and need not be directed for awareness. I say blame the people not the staff. I mean, what do you really expect from an underpant govt employee? I say, kill the bug, get another cup of tea and enjoy the ride.This ain't the battle. Again forgive me for being rude to OP but I wanted to be real. like isn't this something very casual as Indian? like even if there are 10s of them it will probably go unnoticed considering India. Don't disrespect bro, he got a ticket So now coffee is served with a side of live cockroach uh what's the big deal ? it's been always like this since forever. it is, so I don't get wtf is the big deal > Everyday he showers really ? They were being sarcastic mate. The fact you accept this as normal just shows the sad state of how many shitty disgusting things people in the country are fine with. Yeah ikr. Imagine thinking about climate change, smh stupid liberals. its not protesting about climate change which is the problem , you crazy lefty like yourself would probably dress up like that rat to protest for reasons best known to them Can't believe you got downvoted by all the librtard sheep on here..oh wait 🤣🤣 I think it's fair to say that the railways are a British legacy. It's fair to assume the cockroaches are just angry at them and are out and about to protest in Amrit Kaal Just saying that in 2005 i opened my roti and a roach crawled out… so it seems to be the same now lol These coaches are not running 24/7 and they are supposed to undergo regular inspections. How difficult is it to apply pesticides when the coaches are at the maintenance depot? This isn't even remotely offensive. I've seen a full grown man on diapers feeding on his supposedly plus size gf's titties openly and another dude rubbing one out with his schlong out lol Not bad till you meet those reel girls. Free rides for everyone! Ye toh common hai. Kuch naya batao Normalisation of stuff that should not be normalised in a 21st century society is something we seem to be quite proud of for some apparent reason and it’s sad man :( Please take pictures with consent. I am not sure the ckrch wanted such publicity. Bhai , it was a mouse ,right? I only use trains on Mumbai Pune routes and the Hyderabad Shatabdi. Every other route has been a cesspool. Only these routes in my experience are well mantained trains. Cleanliness is not priority, personal or public spaces. Which is why India is still a 3rd world country. Well, since people's minds are already so polluted.. They fly now :D Sorry, need to check if it has anal cerci before making a statement on it's gender again. These are German cockroaches, impossible to kill. I cant blame railways for it. Complain on Twitter. Tag railminindia. Your problems will be solved very fast One cockroach was all it took to rile you up and badmouth the public rail service of the country. Great strength indeed 😂 Rajdhani me rats dekhe hai maine bohot baar..ye to kuch bhi nhi Yummy 😋 I too was given an opportunity by Indian Railways to try my hand on pest photography 😉 Smile... rail minister himself is traveling with you for your safety... It could start with sealing gaps. Also the container is not closed, most ac coaches circulate air using ac vents. Pest control should be standard, I can only see people’s lack of complaints not converting to more efforts in sanitation. Non ac and sleeper classes, hm might be budget constrained and worse to travel in. They fly now but modiji.. bullet train… Cockroaches in trains are unacceptable. I’ve killed so many during my train journeys. Which train? > Some credit Most. > Government will always be inefficient. Than explain situation of DMRC. Laughing at word (current) it was and always be 🤐 Not current state of affairs but permanent state of affairs They fly now WoW u got company Aaj kal general/ no ticket wale aake baith jate h sleeper m. *Uff* somehow palpatine returned The Current Govt only understands development, no need for any maintenance what so ever. Wasn't it always like that. Cockroaches were normal appearances even in 1st AC and 2nd AC. Hamesha se hai ye babu, hamesha se Are you implying that dmrc is efficient? What if he chose to be they them Yep cockroaches everywhere even in IAC. And coaches are poorly maintained. Surprised that Indian railways can't get improved coach designs, with better finishes and factor how to tackle rodents and insects. It is. lol. Repeat it and you may believe it too"
}