{
    "id": "16flzmv",
    "title": "Am I being scammed?",
    "url": "https://www.reddit.com/r/india/comments/16flzmv/am_i_being_scammed/",
    "selftext": "Ordered an item from [Singer](https://singerindia.com/)’s website near the end of last month. It’s been 2 weeks now and I haven’t received the item, not even a confirmation that it’s been shipped yet. I’ve called customer care multiple times and they keep promising me that I’ll be getting a call from another team. Never got a single call from them till today. And today they’ve given me someone’s number (Sheetal +91 85888 65085) who immediately blocked my number, and the other number as well from where I called.\n\nI make hair accessories and because of the broken part my work has been delayed by 2 weeks! I’ve many orders pending now and the deadline in end of this month. Really frustrated and I don’t know what I can do.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694407021.0,
    "convurl": "https://external-preview.redd.it/4MqSBjKf9Zypo5QcD-72QCKigmHYEB9_1Dfzuy0z-HQ.jpg?auto=webp&s=d87c78ef0137073a266a8bf59a82a069b0469503",
    "comments": [],
    "cleaned_text": "scammed ordered item singerhttpssingerindiacoms website near end last month weeks havent received item even confirmation shipped yet ive called customer care multiple times keep promising ill getting call another team never got single call till today today theyve given someones number sheetal immediately blocked number number well called make hair accessories broken part work delayed weeks ive many orders pending deadline end month really frustrated dont know ",
    "cleaned_title": "scammed",
    "cleaned_selftext": "ordered item singerhttpssingerindiacoms website near end last month weeks havent received item even confirmation shipped yet ive called customer care multiple times keep promising ill getting call another team never got single call till today today theyve given someones number sheetal immediately blocked number number well called make hair accessories broken part work delayed weeks ive many orders pending deadline end month really frustrated dont know",
    "cleaned_comments": "",
    "light_cleaned_title": "Am I being scammed?",
    "light_cleaned_selftext": "Ordered an item from [Singer](https://singerindia.com/)’s website near the end of last month. It’s been 2 weeks now and I haven’t received the item, not even a confirmation that it’s been shipped yet. I’ve called customer care multiple times and they keep promising me that I’ll be getting a call from another team. Never got a single call from them till today. And today they’ve given me someone’s number (Sheetal +91 85888 65085) who immediately blocked my number, and the other number as well from where I called. I make hair accessories and because of the broken part my work has been delayed by 2 weeks! I’ve many orders pending now and the deadline in end of this month. Really frustrated and I don’t know what I can do.",
    "light_cleaned_comments": ""
}