{
    "id": "16nk6d5",
    "title": "In Sanatan season, RSS chief flags ‘2000 yrs’ of caste: ‘we didn’t bother when they lived like animals’",
    "url": "https://indianexpress.com/article/political-pulse/rss-chief-mohan-bhagwat-quotas-8928819/",
    "selftext": "Must be prepared to suffer for 200 years... RSS swayamsevaks ready to eat even food tinged with cow meat for the sake of assimiliation,' says RSS chief Mohan Bhagwat.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1695213278.0,
    "convurl": "https://external-preview.redd.it/5zGMhtuyk2b4HOLKHxDY8BjetjByuLz5utPcXa5fqGE.jpg?auto=webp&s=7cfb21743cf27c6418792cfacefa2d6a5fe3decc",
    "comments": [
        "is sajjan ko kya takleef hai bhai",
        "Poor thing wanted to be the Prez, but alas his dreams were foiled. \n\nOdd even scheme really, on odd days he thinks kids being taught the right words for their private parts and good touch vs bad touch is a evil leftist thing, on even days he says what he said...\n\nhttps://www.freepressjournal.in/education/mohan-bhagwat-labels-kg-student-education-on-private-parts-as-attack-by-leftist-ecosystem",
        "Barks like a dhobi ka kutta."
    ],
    "cleaned_text": "sanatan season rss chief flags yrs caste didnt bother lived like animals must prepared suffer years rss swayamsevaks ready eat even food tinged cow meat sake assimiliation says rss chief mohan bhagwat ",
    "cleaned_title": "sanatan season rss chief flags yrs caste didnt bother lived like animals",
    "cleaned_selftext": "must prepared suffer years rss swayamsevaks ready eat even food tinged cow meat sake assimiliation says rss chief mohan bhagwat",
    "cleaned_comments": "sajjan ko kya takleef hai bhai poor thing wanted prez alas dreams foiled odd even scheme really odd days thinks kids taught right words private parts good touch vs bad touch evil leftist thing even days says said barks like dhobi ka kutta",
    "light_cleaned_title": "In Sanatan season, RSS chief flags ‘2000 yrs’ of caste: ‘we didn’t bother when they lived like animals’",
    "light_cleaned_selftext": "Must be prepared to suffer for 200 years... RSS swayamsevaks ready to eat even food tinged with cow meat for the sake of assimiliation,' says RSS chief Mohan Bhagwat.",
    "light_cleaned_comments": "is sajjan ko kya takleef hai bhai Poor thing wanted to be the Prez, but alas his dreams were foiled. Odd even scheme really, on odd days he thinks kids being taught the right words for their private parts and good touch vs bad touch is a evil leftist thing, on even days he says what he said... Barks like a dhobi ka kutta."
}