{
    "id": "14zcbg5",
    "title": "Starting own YouTube channels is against code of conduct: Kerala govt to staffs",
    "url": "https://www.reddit.com/r/india/comments/14zcbg5/starting_own_youtube_channels_is_against_code_of/",
    "selftext": "What do you think guys? \n\nThere are people who open Youtube channels not for money reasons but for the sake of expressing themselves. It maybe their creative outlet.I don't know what to say about this! \n\nSource : https://www.newindianexpress.com/states/kerala/2023/feb/19/starting-own-youtube-channels-is-againstcode-of-conduct-kerala-govt-to-staffs-2548785.html",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689329060.0,
    "convurl": "https://external-preview.redd.it/hUiCyNixpjVLL_OUjub7K8RbUQOCO6ZCB2ftFaWdZCg.jpg?auto=webp&s=a4cb4cbef6c210fb2c54a3fc1cf08dd8f20a3f52",
    "comments": [
        "Your reasoning makes sense but I have came across YouTube channels of many IPS & IAS officers showing off everything and making money out of it. And that definitely should stop.",
        "yeah I think there should be separate rules for government staffs based on their position of power, responsibilities, etc.",
        "I think it can be defined pretty easily what should be against the code and what isn't. A govt employee streaming some games, creating creative tutorials, music, art etc. in their own time should be okay as it's not taking away efforts, time and resources of public service. \n\nWhereas there are jokers like IAS Deepak Rawat who loves to conduct his public service over YouTube while humiliating people online shall be strictly against the code.",
        "\\*Apke yahan is fruit ko kya kehte hain\\* intensifies!"
    ],
    "cleaned_text": "starting youtube channels code conduct kerala govt staffs think guys people open youtube channels money reasons sake expressing maybe creative outleti dont know say source ",
    "cleaned_title": "starting youtube channels code conduct kerala govt staffs",
    "cleaned_selftext": "think guys people open youtube channels money reasons sake expressing maybe creative outleti dont know say source",
    "cleaned_comments": "reasoning makes sense came across youtube channels many ips ias officers showing everything making money definitely stop yeah think separate rules government staffs based position power responsibilities etc think defined pretty easily code isnt govt employee streaming games creating creative tutorials music art etc time okay taking away efforts time resources public service whereas jokers like ias deepak rawat loves conduct public service youtube humiliating people online shall strictly code apke yahan fruit ko kya kehte hain intensifies",
    "light_cleaned_title": "Starting own YouTube channels is against code of conduct: Kerala govt to staffs",
    "light_cleaned_selftext": "What do you think guys? There are people who open Youtube channels not for money reasons but for the sake of expressing themselves. It maybe their creative outlet.I don't know what to say about this! Source :",
    "light_cleaned_comments": "Your reasoning makes sense but I have came across YouTube channels of many IPS & IAS officers showing off everything and making money out of it. And that definitely should stop. yeah I think there should be separate rules for government staffs based on their position of power, responsibilities, etc. I think it can be defined pretty easily what should be against the code and what isn't. A govt employee streaming some games, creating creative tutorials, music, art etc. in their own time should be okay as it's not taking away efforts, time and resources of public service. Whereas there are jokers like IAS Deepak Rawat who loves to conduct his public service over YouTube while humiliating people online shall be strictly against the code. \\*Apke yahan is fruit ko kya kehte hain\\* intensifies!"
}