{
    "id": "16pbs31",
    "title": "Rahul Gandhi meets Danish Ali; 'Will consider leaving Parliament as...': BSP MP",
    "url": "https://www.hindustantimes.com/india-news/will-consider-leaving-parliament-as-bsp-mp-danish-ali-on-bidhuris-remark-101695389948583-amp.html",
    "selftext": "\"I am hopeful that the Speaker will take action against this. But if that does not happen I will consider leaving Parliament with a heavy heart because people have not sent me to Parliament to listen to hate speech...Does one get to learn such language at RSS shakhas?\" Danish Ali said.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 14,
    "created_utc": 1695392909.0,
    "convurl": "https://external-preview.redd.it/owu54eT1M24k4HmtNFsAAWYb57I-KfkKrm1nw5Ay_3U.jpg?auto=webp&s=8035d6d722bf3ad496899bf20d989125f7f44653",
    "comments": [
        ">'Never in the history of Parliament': Adhir Chowdhury's letter to Lok Sabha Speaker\n\n>Congress Lok Sabha leader Adhir Chowdhury wrote to Om Birla on the incident and said such words were never used against a member of a minority community in the history of Parliament and that too in the presence of the Speaker. \"....expunging the remarks from the records of the House has no meaningful impact. Considering the circumstances and the brazen violation of all norms and rules relating to the functioning of the House, it would only be appropriate to have the matter examined in detail by the Privileges Committee and punitive action taken against the errant Member, Ramesh Bidhuri,\" Adhir wrote.",
        ">Does one get to learn such language at RSS shakhas?\n\nYes.",
        "Time for INC to milk the issues as hard as they can. I just want these goons out of the parliament at any cost. There is already enough damage they have caused.",
        "It's their vision and mission statement",
        "This is modi smiling as a Chief Minister when Vajpayee scolded him for allowing the Gujarat Pogrom to happen in 2002.\n\nhttps://youtu.be/HJBItuHzUR0?si=ZICyXCFAZxGdEmOQ\n\nI'm not surprised, shocked, or astounded that this happened in parliament. Elect a genocidal narcissist, expect a steady movement towards genocide.",
        " > if Lok Sabha Speaker Om Birla does not take action against Bidhuri, he might consider leaving Parliament. BSP is not part of the opposition bloc   \n\nThis guy insulted parliament and you are talking about leaving parliament?   \n\nSomeone shitting verballing in the Temple of Democracy is an insult to the Nation.",
        "No matter what action is taken now. Indian politics has reached a higher low now.",
        "Milk, how and where? There won’t be an outcry in the media as they are forever busy with painting BJP as a pious and Congress as an evil."
    ],
    "cleaned_text": "rahul gandhi meets danish ali consider leaving parliament bsp mp hopeful speaker take action happen consider leaving parliament heavy heart people sent parliament listen hate speechdoes one get learn language rss shakhas danish ali said ",
    "cleaned_title": "rahul gandhi meets danish ali consider leaving parliament bsp mp",
    "cleaned_selftext": "hopeful speaker take action happen consider leaving parliament heavy heart people sent parliament listen hate speechdoes one get learn language rss shakhas danish ali said",
    "cleaned_comments": "never history parliament adhir chowdhurys letter lok sabha speaker congress lok sabha leader adhir chowdhury wrote om birla incident said words never used member minority community history parliament presence speaker expunging remarks records house meaningful impact considering circumstances brazen violation norms rules relating functioning house would appropriate matter examined detail privileges committee punitive action taken errant member ramesh bidhuri adhir wrote one get learn language rss shakhas yes time inc milk issues hard want goons parliament cost already enough damage caused vision mission statement modi smiling chief minister vajpayee scolded allowing gujarat pogrom happen im surprised shocked astounded happened parliament elect genocidal narcissist expect steady movement towards genocide lok sabha speaker om birla take action bidhuri might consider leaving parliament bsp part opposition bloc guy insulted parliament talking leaving parliament someone shitting verballing temple democracy insult nation matter action taken indian politics reached higher low milk wont outcry media forever busy painting bjp pious congress evil",
    "light_cleaned_title": "Rahul Gandhi meets Danish Ali; 'Will consider leaving Parliament as...': BSP MP",
    "light_cleaned_selftext": "\"I am hopeful that the Speaker will take action against this. But if that does not happen I will consider leaving Parliament with a heavy heart because people have not sent me to Parliament to listen to hate speech...Does one get to learn such language at RSS shakhas?\" Danish Ali said.",
    "light_cleaned_comments": ">'Never in the history of Parliament': Adhir Chowdhury's letter to Lok Sabha Speaker >Congress Lok Sabha leader Adhir Chowdhury wrote to Om Birla on the incident and said such words were never used against a member of a minority community in the history of Parliament and that too in the presence of the Speaker. \"....expunging the remarks from the records of the House has no meaningful impact. Considering the circumstances and the brazen violation of all norms and rules relating to the functioning of the House, it would only be appropriate to have the matter examined in detail by the Privileges Committee and punitive action taken against the errant Member, Ramesh Bidhuri,\" Adhir wrote. >Does one get to learn such language at RSS shakhas? Yes. Time for INC to milk the issues as hard as they can. I just want these goons out of the parliament at any cost. There is already enough damage they have caused. It's their vision and mission statement This is modi smiling as a Chief Minister when Vajpayee scolded him for allowing the Gujarat Pogrom to happen in 2002. I'm not surprised, shocked, or astounded that this happened in parliament. Elect a genocidal narcissist, expect a steady movement towards genocide. > if Lok Sabha Speaker Om Birla does not take action against Bidhuri, he might consider leaving Parliament. BSP is not part of the opposition bloc This guy insulted parliament and you are talking about leaving parliament? Someone shitting verballing in the Temple of Democracy is an insult to the Nation. No matter what action is taken now. Indian politics has reached a higher low now. Milk, how and where? There won’t be an outcry in the media as they are forever busy with painting BJP as a pious and Congress as an evil."
}