{
    "id": "10ql11k",
    "title": "Can someone identify this tree?",
    "url": "https://www.reddit.com/gallery/10ql11k",
    "selftext": "Pls give me Hindi or English name?",
    "flair": "AskIndia",
    "score": 60,
    "num_comments": 31,
    "created_utc": 1675227418,
    "convurl": "https://i.redd.it/69pf7qhndifa1.jpg",
    "comments": [
        "inst this ber? atleast that's what I call it",
        "Yes u r right. Thanks. :)",
        "Wild plum or jujube ...",
        "Ber tree and in our Gujarat it's called bavad",
        "kul gaach in bengali",
        "Yeah I can identify him, his name is Fred.",
        "Yep it checks out, it’s a tree!",
        "Ber",
        "Is that goji berry?",
        "Boroi",
        "No. Jujube.",
        "Ziziphus jujuba बेर",
        "Uttarakhand?",
        "Ber and if you need to identify plants and trees you can also use Google image search.",
        "Ber. but that tree identifies as Mango. (Your title) lol",
        "Ber ka ped hain yeh.",
        "Mango",
        "My neighbour just gave me a bag full of ber .... Let them turn brownish it taste really good",
        "Bihar",
        "Reggai chettu",
        "Looks like ber\n\nThe fruit is popular but I think it stinks",
        "Eat the fruit",
        "usko khana mat bhai, ped me kutte su karke chale jaate hai un par",
        "Ber ka pedh.",
        "बेर\n\nIndian jujube \n\nZiziphus mauritiana",
        "Indian Jujube. We make pickle out of it https://www.thenortheaststore.com/jujube-sweet-pickle-bogori-assar \n\nthere are different varieties of it. Some are sweet, some are sour. \nDon't eat it raw too much, you will catch dry cough",
        "Use Google Lens",
        "Gooseberry",
        "Yes I can identify this is definitely a tree",
        "Jujube (இலந்தை)"
    ],
    "cleaned_text": "someone identify tree pls give hindi english name ",
    "cleaned_title": "someone identify tree",
    "cleaned_selftext": "pls give hindi english name",
    "cleaned_comments": "inst ber atleast thats call yes u r right thanks wild plum jujube ber tree gujarat called bavad kul gaach bengali yeah identify name fred yep checks tree ber goji berry boroi jujube ziziphus jujuba uttarakhand ber need identify plants trees also use google image search ber tree identifies mango title lol ber ka ped hain yeh mango neighbour gave bag full ber let turn brownish taste really good bihar reggai chettu looks like ber fruit popular think stinks eat fruit usko khana mat bhai ped kutte su karke chale jaate hai un par ber ka pedh indian jujube ziziphus mauritiana indian jujube make pickle different varieties sweet sour dont eat raw much catch dry cough use google lens gooseberry yes identify definitely tree jujube",
    "light_cleaned_title": "Can someone identify this tree?",
    "light_cleaned_selftext": "Pls give me Hindi or English name?",
    "light_cleaned_comments": "inst this ber? atleast that's what I call it Yes u r right. Thanks. :) Wild plum or jujube ... Ber tree and in our Gujarat it's called bavad kul gaach in bengali Yeah I can identify him, his name is Fred. Yep it checks out, it’s a tree! Ber Is that goji berry? Boroi No. Jujube. Ziziphus jujuba बेर Uttarakhand? Ber and if you need to identify plants and trees you can also use Google image search. Ber. but that tree identifies as Mango. (Your title) lol Ber ka ped hain yeh. Mango My neighbour just gave me a bag full of ber .... Let them turn brownish it taste really good Bihar Reggai chettu Looks like ber The fruit is popular but I think it stinks Eat the fruit usko khana mat bhai, ped me kutte su karke chale jaate hai un par Ber ka pedh. बेर Indian jujube Ziziphus mauritiana Indian Jujube. We make pickle out of it there are different varieties of it. Some are sweet, some are sour. Don't eat it raw too much, you will catch dry cough Use Google Lens Gooseberry Yes I can identify this is definitely a tree Jujube (இலந்தை)"
}