{
    "id": "166of07",
    "title": "Are books in India cheap?",
    "url": "https://www.reddit.com/r/india/comments/166of07/are_books_in_india_cheap/",
    "selftext": "I am foreigner interested in acquiring a book about the Ramayana of Valmiki, but the price is a bit salty where I live. So I was browsing other regions and I was surprised by how cheap that book is in India - compared to my region, your average price is half as much the last discounted price Amazon had here.\n\n[In this table](https://i.imgur.com/kz0PSwO.png) you can see that Amazon.in is 900 rupees cheaper than the second cheapest option (700 from Amazon's partners), and the book is ₹1,029.00 (also from a partner, but fulfilled by Amazon).\n\nSo it made me curious, are books really cheap in India, or is it just this book that is cheap for some reason only Amazon knows?\n\nThanks!",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693519049.0,
    "convurl": "https://external-preview.redd.it/oJPlL4PepQWYf2IW_5z5FrULxe1tYHMnDS2Ukn6f780.png?auto=webp&s=2dd5d9bfb130d7eb7a5ac79582f374f5839710bd",
    "comments": [
        "They are **quite** cheap when you compare directly (by converting the currency at FOREX value). They are **not so** cheap when you say what's the median cost of book to median monthly income in each country.   \n\n\nEducational textbooks, specially in STEM and religious text are far more cheaper even after considering other things.",
        "It really depends on the book - publisher, author, page count, language. 300-700 rs. is the average price of story books most people would buy. Some bestseller english novels can sell for even cheaper (200rs). It really depends on the exclusivity of the content and the publisher - classic book contents (out of copyright) can be republished by different publishers at different price point and paper quality, whereas new books from some premium publishers can cost quite a bit (800-1500 rs). In general, more than 1000rs can be considered quite expensive as a book. \n\nInternational academic/niche books are a different beast - without a local publisher, it can cost significantly more than US price and is hard to get. Students might have to do with library copy/xerox/old books. Some books might even be cloned (scanned pdf print) to get them at a reasonable price point. \n\nP.s. Sharing the book link would help.",
        "I see, I was wondering if there was any governmental incentive for educational books, which I believe is the case with the Ramayana of Valmiki, that made them cheaper. Besides, I am not in any of those countries I shared in the table, I am a fellow 3rd world country citizen so our currency ain't that strong either.",
        "It is [this edition](https://www.amazon.in/R%C4%81m%C4%81ya%E1%B9%87a-V%C4%81lm%C4%ABki-Translation-Princeton-Translations/dp/0691206864/ref=tmm_pap_swatch_0?_encoding=UTF8&qid=1693537023&sr=8-16) of the Indian epic, an international book and fulfilled by Amazon - which maybe is a guarantee that it isn't a clone, perhaps?",
        "Seller looks good 👍. This might be country-specific pricing by the Publisher.\n\nI have seen some academic books with India (and surrounding countries) pricing, marked as only to be sold in these countries. They might have a slightly cheaper build quality."
    ],
    "cleaned_text": "books india cheap foreigner interested acquiring book ramayana valmiki price bit salty live browsing regions surprised cheap book india compared region average price half much last discounted price amazon tablehttpsiimgurcomkzpswopng see amazonin rupees cheaper second cheapest option amazons partners book also partner fulfilled amazon made curious books really cheap india book cheap reason amazon knows thanks ",
    "cleaned_title": "books india cheap",
    "cleaned_selftext": "foreigner interested acquiring book ramayana valmiki price bit salty live browsing regions surprised cheap book india compared region average price half much last discounted price amazon tablehttpsiimgurcomkzpswopng see amazonin rupees cheaper second cheapest option amazons partners book also partner fulfilled amazon made curious books really cheap india book cheap reason amazon knows thanks",
    "cleaned_comments": "quite cheap compare directly converting currency forex value cheap say whats median cost book median monthly income country educational textbooks specially stem religious text far cheaper even considering things really depends book publisher author page count language rs average price story books people would buy bestseller english novels sell even cheaper rs really depends exclusivity content publisher classic book contents copyright republished different publishers different price point paper quality whereas new books premium publishers cost quite bit rs general rs considered quite expensive book international academicniche books different beast without local publisher cost significantly us price hard get students might library copyxeroxold books books might even cloned scanned pdf print get reasonable price point ps sharing book link would help see wondering governmental incentive educational books believe case ramayana valmiki made cheaper besides countries shared table fellow rd world country citizen currency aint strong either editionhttpswwwamazoninrcmcyaebavclmcabkitranslationprincetontranslationsdpreftmmpapswatchencodingutfqidsr indian epic international book fulfilled amazon maybe guarantee isnt clone perhaps seller looks good might countryspecific pricing publisher seen academic books india surrounding countries pricing marked sold countries might slightly cheaper build quality",
    "light_cleaned_title": "Are books in India cheap?",
    "light_cleaned_selftext": "I am foreigner interested in acquiring a book about the Ramayana of Valmiki, but the price is a bit salty where I live. So I was browsing other regions and I was surprised by how cheap that book is in India - compared to my region, your average price is half as much the last discounted price Amazon had here. [In this table](https://i.imgur.com/kz0PSwO.png) you can see that Amazon.in is 900 rupees cheaper than the second cheapest option (700 from Amazon's partners), and the book is ₹1,029.00 (also from a partner, but fulfilled by Amazon). So it made me curious, are books really cheap in India, or is it just this book that is cheap for some reason only Amazon knows? Thanks!",
    "light_cleaned_comments": "They are **quite** cheap when you compare directly (by converting the currency at FOREX value). They are **not so** cheap when you say what's the median cost of book to median monthly income in each country. Educational textbooks, specially in STEM and religious text are far more cheaper even after considering other things. It really depends on the book - publisher, author, page count, language. 300-700 rs. is the average price of story books most people would buy. Some bestseller english novels can sell for even cheaper (200rs). It really depends on the exclusivity of the content and the publisher - classic book contents (out of copyright) can be republished by different publishers at different price point and paper quality, whereas new books from some premium publishers can cost quite a bit (800-1500 rs). In general, more than 1000rs can be considered quite expensive as a book. International academic/niche books are a different beast - without a local publisher, it can cost significantly more than US price and is hard to get. Students might have to do with library copy/xerox/old books. Some books might even be cloned (scanned pdf print) to get them at a reasonable price point. P.s. Sharing the book link would help. I see, I was wondering if there was any governmental incentive for educational books, which I believe is the case with the Ramayana of Valmiki, that made them cheaper. Besides, I am not in any of those countries I shared in the table, I am a fellow 3rd world country citizen so our currency ain't that strong either. It is [this edition](https://www.amazon.in/R%C4%81m%C4%81ya%E1%B9%87a-V%C4%81lm%C4%ABki-Translation-Princeton-Translations/dp/0691206864/ref=tmm_pap_swatch_0?_encoding=UTF8&qid=1693537023&sr=8-16) of the Indian epic, an international book and fulfilled by Amazon - which maybe is a guarantee that it isn't a clone, perhaps? Seller looks good 👍. This might be country-specific pricing by the Publisher. I have seen some academic books with India (and surrounding countries) pricing, marked as only to be sold in these countries. They might have a slightly cheaper build quality."
}