{
    "id": "1741x9p",
    "title": "So my landlord insulted my mother and evicted us because we were looking for alternative cheaper rent.He basically spied on us.",
    "url": "https://www.reddit.com/r/india/comments/1741x9p/so_my_landlord_insulted_my_mother_and_evicted_us/",
    "selftext": "I can't even do anything, my mother said to forget about it but he said all kind of bad things.He is a loose character person but everyone is scared of him in the neighborhood.We got to know he has harrased many tenants before us.Can't even leave a google review because he reported my review and google marked my account as spam\n\nCan anyone leave a review to warn future tenants\n\nHis name is Naru Gopal Ghosal and he is a gundaa so if u can leave a anonymous review it would be great.\n\nhttps://www.google.com/search?q=nigamalay+apartment+1&oq=&aqs=chrome.0.35i39i362l2j35i39i362i650j35i39i362j35i39i362i650l3j35i39i362j35i39i362i650l7j0i3i66i143i308i362l5.-1j0j7&client=ms-android-xiaomi-rvo2&sourceid=chrome-mobile&ie=UTF-8#lpg=cid:CgIgAQ%3D%3D&trex=m_t:lcl_akp,rc_ludocids:1312854473224829083,rc_q:nigamalay%2520apartment%25201,ru_gwp:0%252C7,ru_q:nigamalay%2520apartment%25201,trex_id:Y7oiwf",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696882868.0,
    "convurl": "https://external-preview.redd.it/XfrStPJMYM7dMxr7MxZYd0jNzJ9acDMGrSvws-FvLZE.jpg?auto=webp&s=afcb8698c026f3c616a11c4009e33a06154310cb",
    "comments": [
        "This was my review if anyone's wandering\n\nOwner Narugopal Ghosal is a complete fraud and loose character person. He gives his room on rent in 1st floor.The room doesn't have proper electric meter. You will not be able to use AC or washing machine.If you bring up these issues, he will harass you and the women of your house.He will harass you in order to increase rent. He has already forcefully evicted many\ntenants. He claims to be a devotee of God but is actually a loose character and greedy piece of shit.I have never seen such an hypocrite asshole in my life.",
        "Google marked your account spam? So you won't be able to use your Google account anymore?",
        "This country has the collection of the worst human beings humanity has to offer.",
        "Just wrote a 50 word article describing how bad he is and how he harasses his tenants. I already see many people leaving their reviews, and the rating has come down to 1 star 🌟\n\nCongratulations everybody",
        "If you dont want to be marked as Spammer: \n\nDont use Judgements/Labels (eg: complete fraud/loose character/greedy piece of shit etc) \n\nJust use sentences that describe Specific Details of what he did and stop. eg: Flat has no electric meter. Cant use AC/washing machine. Landlord has said he wont provide it. If he harassed a woman. Just say the woman did X this man did Y.",
        "Even if I remove all those words, my review doesn't go through anymore",
        "I can use google account but my reviews are not visible to anyone",
        "Hey man thanks a lot, but do you know the funny thing? If you write a detailed review, google immediately removes it even if you are totally polite.....your review has been removed as well and is not visible to the public,just check from another google account.Same thing happened with me.\n\nBut thanks so much anyways for helping this brother out.",
        "We were nothing but polite to him and in return my mother gets insulted and I did nothing",
        "Guys thank you so much for helping me and any future tenant out there, after we left, he harrased a family of four and dragged the elderly father out of his house for failing to pay rent on first of month.The entire neighborhood was silent.He harrased another couple as well.This all happened in just 6 months.\n\nAlso some of your reviews are hidden from public by Google, same shit they did with me.",
        "What is this? Are we all review bombing just because someone said something on the internet?",
        "He insulted your mom just anonymous reports against him won't work, I mean we can't honestly do more than that but if there's a proof of what he says he can easily get behind the bars for abusing and threatening woman like that. Also you mentioned he spied on you, thats enough to understand his character. If he's a single goon I would rather go and get my hands on him.",
        "It’s nothing to do with you friend. Some people are just shitty insects",
        "It’s nothing to do with you friend. Some people are just shitty insects"
    ],
    "cleaned_text": "landlord insulted mother evicted us looking alternative cheaper renthe basically spied us cant even anything mother said forget said kind bad thingshe loose character person everyone scared neighborhoodwe got know harrased many tenants uscant even leave google review reported review google marked account spam anyone leave review warn future tenants name naru gopal ghosal gundaa u leave anonymous review would great ",
    "cleaned_title": "landlord insulted mother evicted us looking alternative cheaper renthe basically spied us",
    "cleaned_selftext": "cant even anything mother said forget said kind bad thingshe loose character person everyone scared neighborhoodwe got know harrased many tenants uscant even leave google review reported review google marked account spam anyone leave review warn future tenants name naru gopal ghosal gundaa u leave anonymous review would great",
    "cleaned_comments": "review anyones wandering owner narugopal ghosal complete fraud loose character person gives room rent st floorthe room doesnt proper electric meter able use ac washing machineif bring issues harass women househe harass order increase rent already forcefully evicted many tenants claims devotee god actually loose character greedy piece shiti never seen hypocrite asshole life google marked account spam wont able use google account anymore country collection worst human beings humanity offer wrote word article describing bad harasses tenants already see many people leaving reviews rating come star congratulations everybody dont want marked spammer dont use judgementslabels eg complete fraudloose charactergreedy piece shit etc use sentences describe specific details stop eg flat electric meter cant use acwashing machine landlord said wont provide harassed woman say woman x man even remove words review doesnt go anymore use google account reviews visible anyone hey man thanks lot know funny thing write detailed review google immediately removes even totally politeyour review removed well visible publicjust check another google accountsame thing happened thanks much anyways helping brother nothing polite return mother gets insulted nothing guys thank much helping future tenant left harrased family four dragged elderly father house failing pay rent first monththe entire neighborhood silenthe harrased another couple wellthis happened months also reviews hidden public google shit review bombing someone said something internet insulted mom anonymous reports wont work mean cant honestly theres proof says easily get behind bars abusing threatening woman like also mentioned spied thats enough understand character hes single goon would rather go get hands nothing friend people shitty insects nothing friend people shitty insects",
    "light_cleaned_title": "So my landlord insulted my mother and evicted us because we were looking for alternative cheaper rent.He basically spied on us.",
    "light_cleaned_selftext": "I can't even do anything, my mother said to forget about it but he said all kind of bad things.He is a loose character person but everyone is scared of him in the neighborhood.We got to know he has harrased many tenants before us.Can't even leave a google review because he reported my review and google marked my account as spam Can anyone leave a review to warn future tenants His name is Naru Gopal Ghosal and he is a gundaa so if u can leave a anonymous review it would be great.",
    "light_cleaned_comments": "This was my review if anyone's wandering Owner Narugopal Ghosal is a complete fraud and loose character person. He gives his room on rent in 1st floor.The room doesn't have proper electric meter. You will not be able to use AC or washing machine.If you bring up these issues, he will harass you and the women of your house.He will harass you in order to increase rent. He has already forcefully evicted many tenants. He claims to be a devotee of God but is actually a loose character and greedy piece of shit.I have never seen such an hypocrite asshole in my life. Google marked your account spam? So you won't be able to use your Google account anymore? This country has the collection of the worst human beings humanity has to offer. Just wrote a 50 word article describing how bad he is and how he harasses his tenants. I already see many people leaving their reviews, and the rating has come down to 1 star 🌟 Congratulations everybody If you dont want to be marked as Spammer: Dont use Judgements/Labels (eg: complete fraud/loose character/greedy piece of shit etc) Just use sentences that describe Specific Details of what he did and stop. eg: Flat has no electric meter. Cant use AC/washing machine. Landlord has said he wont provide it. If he harassed a woman. Just say the woman did X this man did Y. Even if I remove all those words, my review doesn't go through anymore I can use google account but my reviews are not visible to anyone Hey man thanks a lot, but do you know the funny thing? If you write a detailed review, google immediately removes it even if you are totally polite.....your review has been removed as well and is not visible to the public,just check from another google account.Same thing happened with me. But thanks so much anyways for helping this brother out. We were nothing but polite to him and in return my mother gets insulted and I did nothing Guys thank you so much for helping me and any future tenant out there, after we left, he harrased a family of four and dragged the elderly father out of his house for failing to pay rent on first of month.The entire neighborhood was silent.He harrased another couple as well.This all happened in just 6 months. Also some of your reviews are hidden from public by Google, same shit they did with me. What is this? Are we all review bombing just because someone said something on the internet? He insulted your mom just anonymous reports against him won't work, I mean we can't honestly do more than that but if there's a proof of what he says he can easily get behind the bars for abusing and threatening woman like that. Also you mentioned he spied on you, thats enough to understand his character. If he's a single goon I would rather go and get my hands on him. It’s nothing to do with you friend. Some people are just shitty insects It’s nothing to do with you friend. Some people are just shitty insects"
}