{
    "id": "1h6hj0b",
    "title": "Swiggy stock jumps 5%—now I know why",
    "url": "https://www.reddit.com/gallery/1h6hj0b",
    "selftext": "I saw a post where someone mentioned that Swiggy/Zomato sometimes increases restaurant distances to remove free delivery. I didn’t believe it at first, but today, I witnessed it myself.\nA restaurant that was under the free delivery range a few days ago suddenly \"moved\" farther away. Same address, same everything—except now it’s not eligible for free delivery.\nWith tactics like these, it’s no wonder their stock jumped 5%. Looks like we’re all unknowingly contributing to their growth!\n",
    "flair": "Rant / Vent",
    "score": 82,
    "num_comments": 24,
    "created_utc": 1733323101.0,
    "convurl": "https://i.redd.it/qdjomb0hfu4e1.jpg",
    "comments": [
        "Looks like Swiggy's motto is: When life gives you lemons, charge extra for lemonade delivery.And with share prices this high, they’ve clearly added a ‘squeeze the customers’ fee too!.",
        "So every time you place an order on Swiggy/Zomato, buy their stock. The stock price increase will cover your order.",
        "Swiggy has been degrading its services since going public",
        "I have a place I regularly order from 1.5 km away and sometimes after ordering, they switch it to a layout that’s 6 km away. Not only am I unnecessarily paying delivery fees, but I mostly order from that place when I’m really hungry and busy and it takes 15 minutes. When they change the outlet, it becomes 45 minutes. Super super annoying.",
        "That's what they are supposed to do. They burnt through VC money gave them a good exit now to survive and create wealth for shareholders they need to jack up margins , stop the bleeding and focus on making profits. \n\nVCs focus about getting more and more market share whereas market focuses on profits",
        "Also \nShoutout for ordering from Shagun, a person of culture",
        "Had the same issue.",
        "Salim Khan ka Salman padhliya..",
        "Idk why people have a problem when companies who have literally built a platform for convenience start charging money. It costs money to build and maintain the app. Who do you think pays the delivery person? Just get out of your home and eat in the restaurant. You won't have to pay a \"convenience\" fee.",
        "Just call the damn restaurant yourself or go out. How difficult is it ? Why pay these middlemen ?",
        "After the latest app update you can select a specific outlet. I am able to switch to the nearest outlet.",
        "My new year resolution is to cure my brainrot caused by Swiggy/Zomato, Zepto, Blinkit, etc. \n\nThere are a few things that are only available in BigBasket app that I don’t need on a daily basis but need them sometimes regardless so I’ll keep that around.\n\nConvenience brainrot has really ruined my health for the past 2-3 years and I need to break free from this shit.",
        "Well I am not saying to do it but I know someone who had the same issue and he put in a new location nearby which was in the 7km range and when the delivery guy comes, you direct him to your house by saying just come 100 meters here(your direction) by giving a excuse that it was auto located when you added the address",
        "Been seeing it with Swiggy since the last 3 months, I noticed the difference when I saw that Zomato wasn't charging extra. Very conveniently Swiggy increases the distances by 200 to 300m just to get it over 7...",
        "They do it a lot , eve added platform fees, slowly creeping up, minimum order value is also creeping up, discounts are illusions. Only good part is they are operating most of the time so convenience is big factor.",
        "I never used Zomato. Was a loyal Swiggy customer till 2 months back since their service levels dropped significantly. I'm now using only Zomato.",
        "I am just glad I used swiggy Zomato during my college days when it was literally cheap, now it's just too expensive. Sometimes it's better to call a restaurant and order from them directly.",
        "That's a great restaurant. Always go there whenever I'm nearby",
        "Haven’t ordered anything from Swiggy/Zomato/Blinkit in over a month. Saved a lot !\nLife’s good !",
        "hi there ankur warikoo",
        "Try filing a complaint in consumer forum, wait for swiggy answer.",
        "I don’t mind paying for services, but if I’ve already paid extra for a curated service they designed themselves, resorting to such cheap tactics is unacceptable. They should either stop offering these curated services and start charging delivery fees or maintain the quality and integrity of what they promise."
    ],
    "cleaned_text": "swiggy stock jumps know saw post someone mentioned swiggyzomato sometimes increases restaurant distances remove free delivery didnt believe first today witnessed restaurant free delivery range days ago suddenly moved farther away address everythingexcept eligible free delivery tactics like wonder stock jumped looks like unknowingly contributing growth ",
    "cleaned_title": "swiggy stock jumps know",
    "cleaned_selftext": "saw post someone mentioned swiggyzomato sometimes increases restaurant distances remove free delivery didnt believe first today witnessed restaurant free delivery range days ago suddenly moved farther away address everythingexcept eligible free delivery tactics like wonder stock jumped looks like unknowingly contributing growth",
    "cleaned_comments": "looks like swiggys motto life gives lemons charge extra lemonade deliveryand share prices high theyve clearly added squeeze customers fee every time place order swiggyzomato buy stock stock price increase cover order swiggy degrading services since going public place regularly order km away sometimes ordering switch layout thats km away unnecessarily paying delivery fees mostly order place im really hungry busy takes minutes change outlet becomes minutes super super annoying thats supposed burnt vc money gave good exit survive create wealth shareholders need jack margins stop bleeding focus making profits vcs focus getting market share whereas market focuses profits also shoutout ordering shagun person culture issue salim khan ka salman padhliya idk people problem companies literally built platform convenience start charging money costs money build maintain app think pays delivery person get home eat restaurant wont pay convenience fee call damn restaurant go difficult pay middlemen latest app update select specific outlet able switch nearest outlet new year resolution cure brainrot caused swiggyzomato zepto blinkit etc things available bigbasket app dont need daily basis need sometimes regardless ill keep around convenience brainrot really ruined health past years need break free shit well saying know someone issue put new location nearby km range delivery guy comes direct house saying come meters hereyour direction giving excuse auto located added address seeing swiggy since last months noticed difference saw zomato wasnt charging extra conveniently swiggy increases distances get lot eve added platform fees slowly creeping minimum order value also creeping discounts illusions good part operating time convenience big factor never used zomato loyal swiggy customer till months back since service levels dropped significantly im using zomato glad used swiggy zomato college days literally cheap expensive sometimes better call restaurant order directly thats great restaurant always go whenever im nearby havent ordered anything swiggyzomatoblinkit month saved lot lifes good hi ankur warikoo try filing complaint consumer forum wait swiggy answer dont mind paying services ive already paid extra curated service designed resorting cheap tactics unacceptable either stop offering curated services start charging delivery fees maintain quality integrity promise",
    "light_cleaned_title": "Swiggy stock jumps 5%—now I know why",
    "light_cleaned_selftext": "I saw a post where someone mentioned that Swiggy/Zomato sometimes increases restaurant distances to remove free delivery. I didn’t believe it at first, but today, I witnessed it myself. A restaurant that was under the free delivery range a few days ago suddenly \"moved\" farther away. Same address, same everything—except now it’s not eligible for free delivery. With tactics like these, it’s no wonder their stock jumped 5%. Looks like we’re all unknowingly contributing to their growth!",
    "light_cleaned_comments": "Looks like Swiggy's motto is: When life gives you lemons, charge extra for lemonade delivery.And with share prices this high, they’ve clearly added a ‘squeeze the customers’ fee too!. So every time you place an order on Swiggy/Zomato, buy their stock. The stock price increase will cover your order. Swiggy has been degrading its services since going public I have a place I regularly order from 1.5 km away and sometimes after ordering, they switch it to a layout that’s 6 km away. Not only am I unnecessarily paying delivery fees, but I mostly order from that place when I’m really hungry and busy and it takes 15 minutes. When they change the outlet, it becomes 45 minutes. Super super annoying. That's what they are supposed to do. They burnt through VC money gave them a good exit now to survive and create wealth for shareholders they need to jack up margins , stop the bleeding and focus on making profits. VCs focus about getting more and more market share whereas market focuses on profits Also Shoutout for ordering from Shagun, a person of culture Had the same issue. Salim Khan ka Salman padhliya.. Idk why people have a problem when companies who have literally built a platform for convenience start charging money. It costs money to build and maintain the app. Who do you think pays the delivery person? Just get out of your home and eat in the restaurant. You won't have to pay a \"convenience\" fee. Just call the damn restaurant yourself or go out. How difficult is it ? Why pay these middlemen ? After the latest app update you can select a specific outlet. I am able to switch to the nearest outlet. My new year resolution is to cure my brainrot caused by Swiggy/Zomato, Zepto, Blinkit, etc. There are a few things that are only available in BigBasket app that I don’t need on a daily basis but need them sometimes regardless so I’ll keep that around. Convenience brainrot has really ruined my health for the past 2-3 years and I need to break free from this shit. Well I am not saying to do it but I know someone who had the same issue and he put in a new location nearby which was in the 7km range and when the delivery guy comes, you direct him to your house by saying just come 100 meters here(your direction) by giving a excuse that it was auto located when you added the address Been seeing it with Swiggy since the last 3 months, I noticed the difference when I saw that Zomato wasn't charging extra. Very conveniently Swiggy increases the distances by 200 to 300m just to get it over 7... They do it a lot , eve added platform fees, slowly creeping up, minimum order value is also creeping up, discounts are illusions. Only good part is they are operating most of the time so convenience is big factor. I never used Zomato. Was a loyal Swiggy customer till 2 months back since their service levels dropped significantly. I'm now using only Zomato. I am just glad I used swiggy Zomato during my college days when it was literally cheap, now it's just too expensive. Sometimes it's better to call a restaurant and order from them directly. That's a great restaurant. Always go there whenever I'm nearby Haven’t ordered anything from Swiggy/Zomato/Blinkit in over a month. Saved a lot ! Life’s good ! hi there ankur warikoo Try filing a complaint in consumer forum, wait for swiggy answer. I don’t mind paying for services, but if I’ve already paid extra for a curated service they designed themselves, resorting to such cheap tactics is unacceptable. They should either stop offering these curated services and start charging delivery fees or maintain the quality and integrity of what they promise."
}