{
    "id": "14gr9vw",
    "title": "Which audio version of The Mahabharat should I listen to?",
    "url": "https://www.reddit.com/r/india/comments/14gr9vw/which_audio_version_of_the_mahabharat_should_i/",
    "selftext": "I do not wish to learn the story in entirety of its details so please do not suggest an unabridged version but want a fairly accurate and unbiased retelling of the epic.\n\nCould only find these audiobooks:\n\n1. [Mahabharat Katha by Amritlal Nagar](https://www.audible.in/pd/Embargo-title-IN-Audiobook/B07NDK5JDX?)\n2. [The Mahabharata by John D Smith](https://www.audible.in/pd/The-Mahabharata-Audiobook/0241524652)\n3. [Mahabharata: The Greatest Spiritual Epic of All Time by Krishna Dharma](https://www.audible.in/pd/Mahabharata-The-Greatest-Spiritual-Epic-of-All-Time-Audiobook/B0773SWD2H)\n\nWhich one would you suggest I go with? Would appreciate any podcast audioseries suggestions too.",
    "flair": "AskIndia",
    "score": 5,
    "num_comments": 8,
    "created_utc": 1687502969.0,
    "convurl": "https://external-preview.redd.it/nrIT4tt1lwgsBMrjYS_qPvNU5mL9vSvm03FfqpfAY7w.jpg?auto=webp&v=enabled&s=5d81ffa54cc793b81cfbc694cb58908fba657652",
    "comments": [
        "Wait for some time Manoj Muntashir & Om Raut are coming with the perfect version of Mahabharat. Just give them some time & Rs. 1200Cr.\n\n/s",
        "Currently listening to this https://open.spotify.com/show/0A6kWKFEOFtp8fkrpnAJQB?si=CuDHB_AuQVyIyxJJt4DS8A pretty good stuff.",
        "Yes I am listening to this as well but felt that it might be watered down version?\n\nHe doesn't go into the details of anything, is just an overview of the story i feel like.",
        "I loved this version but for me someone who is trying to understand the deeper meaning behind the story, I didn’t feel like it was the right podcast.",
        "I don't listen to audiobooks or podcasts, but book-wise, Kamala Subramaniam's Mahabharata seems perfect for your requirement. Neither academically deep, nor shallow to appease a foreigner. \n\nGrounded and real, but readable.",
        "Yup i dont think so either. But atleast it has good production quality and Indian accent.",
        "that movie was the worst movie i have ever seen bro",
        "Any leads or recommendations?",
        "I ended up listening to this podcast on Spotify. Really enjoyed it. \n\nhttps://open.spotify.com/show/0A6kWKFEOFtp8fkrpnAJQB",
        "Where do I start with this podcast? I couldn't find epp. 1? It ' seem like it's in chronological order"
    ],
    "cleaned_text": "audio version mahabharat listen wish learn story entirety details please suggest unabridged version want fairly accurate unbiased retelling epic could find audiobooks mahabharat katha amritlal nagarhttpswwwaudibleinpdembargotitleinaudiobookbndkjdx mahabharata john smithhttpswwwaudibleinpdthemahabharataaudiobook mahabharata greatest spiritual epic time krishna dharmahttpswwwaudibleinpdmahabharatathegreatestspiritualepicofalltimeaudiobookbswdh one would suggest go would appreciate podcast audioseries suggestions ",
    "cleaned_title": "audio version mahabharat listen",
    "cleaned_selftext": "wish learn story entirety details please suggest unabridged version want fairly accurate unbiased retelling epic could find audiobooks mahabharat katha amritlal nagarhttpswwwaudibleinpdembargotitleinaudiobookbndkjdx mahabharata john smithhttpswwwaudibleinpdthemahabharataaudiobook mahabharata greatest spiritual epic time krishna dharmahttpswwwaudibleinpdmahabharatathegreatestspiritualepicofalltimeaudiobookbswdh one would suggest go would appreciate podcast audioseries suggestions",
    "cleaned_comments": "wait time manoj muntashir om raut coming perfect version mahabharat give time rs cr currently listening pretty good stuff yes listening well felt might watered version doesnt go details anything overview story feel like loved version someone trying understand deeper meaning behind story didnt feel like right podcast dont listen audiobooks podcasts bookwise kamala subramaniams mahabharata seems perfect requirement neither academically deep shallow appease foreigner grounded real readable yup dont think either atleast good production quality indian accent movie worst movie ever seen bro leads recommendations ended listening podcast spotify really enjoyed start podcast couldnt find epp seem like chronological order",
    "light_cleaned_title": "Which audio version of The Mahabharat should I listen to?",
    "light_cleaned_selftext": "I do not wish to learn the story in entirety of its details so please do not suggest an unabridged version but want a fairly accurate and unbiased retelling of the epic. Could only find these audiobooks: 1. [Mahabharat Katha by Amritlal Nagar](https://www.audible.in/pd/Embargo-title-IN-Audiobook/B07NDK5JDX?) 2. [The Mahabharata by John D Smith](https://www.audible.in/pd/The-Mahabharata-Audiobook/0241524652) 3. [Mahabharata: The Greatest Spiritual Epic of All Time by Krishna Dharma](https://www.audible.in/pd/Mahabharata-The-Greatest-Spiritual-Epic-of-All-Time-Audiobook/B0773SWD2H) Which one would you suggest I go with? Would appreciate any podcast audioseries suggestions too.",
    "light_cleaned_comments": "Wait for some time Manoj Muntashir & Om Raut are coming with the perfect version of Mahabharat. Just give them some time & Rs. 1200Cr. /s Currently listening to this pretty good stuff. Yes I am listening to this as well but felt that it might be watered down version? He doesn't go into the details of anything, is just an overview of the story i feel like. I loved this version but for me someone who is trying to understand the deeper meaning behind the story, I didn’t feel like it was the right podcast. I don't listen to audiobooks or podcasts, but book-wise, Kamala Subramaniam's Mahabharata seems perfect for your requirement. Neither academically deep, nor shallow to appease a foreigner. Grounded and real, but readable. Yup i dont think so either. But atleast it has good production quality and Indian accent. that movie was the worst movie i have ever seen bro Any leads or recommendations? I ended up listening to this podcast on Spotify. Really enjoyed it. Where do I start with this podcast? I couldn't find epp. 1? It ' seem like it's in chronological order"
}