{
    "id": "14hhsss",
    "title": "J Sai Deepak writes: ‘Majoritarianism’ is used to gaslight Hindus",
    "url": "https://indianexpress.com/article/opinion/columns/j-sai-deepak-writes-the-majoritarianism-slur-8678370/",
    "selftext": "https://indianexpress.com/article/opinion/columns/j-sai-deepak-writes-the-majoritarianism-slur-8678370/",
    "flair": "Politics",
    "score": 8,
    "num_comments": 10,
    "created_utc": 1687576185.0,
    "convurl": "https://external-preview.redd.it/CAaB8kLFHYIr_rBZ_DmcwnPjH3o2RJAiB69r7eCF5YY.jpg?auto=webp&v=enabled&s=15ce4cb677bc209871ed429ad4a8c7d69ec9e39f",
    "comments": [
        "nose psychotic obscene enjoy friendly innocent crawl sharp telephone sulky -- mass edited with redact.dev",
        "JSD can fuck off for all I care. He is your typical caste apologist who happens to use sophisticated English to hide his bigotry against anybody who is not an Upper caste Hindu.",
        "Articles like this are used to gaslight critics, including Hindu critics, of the bigoted ideology of Hindutva.",
        "This Mf uses brain-dead logic and ass of an explanation. He has an orange dick in his ass and fails to realise that BJP won't give a fuck about him. Bigotry and jealousy runs in his veins. These kids and the right wing gobble up everything he says because he fits their narrative.",
        "Actually this guy and his caste apologist friends are already mad at Modi. They believe Modi is not bigoted enough when it comes to dealing with Muslims and Dalits.",
        "Ah, yes, the right-wing intellectual whose weapon is the fearsome word salad. Civilizational nexus? But he and his fans think he is very intelligent. Let's disentangle what he says here.\n\nFirst, he clearly understands that \"Hindu majoritarianism\" stands for \"Hindu ethno-nationalism\", which is the right of the Hindu race to this land. Instead of denying this, he wholeheartedly embraces this and shamelessly declares that only true Hindus have a past and present right to this land, and that no other definition of nationhood is valid.\n\nSecond, he employs the trope of the \"victimhood of the majority\". We can see this more clearly in the West, where whites are made to feel guilty of past oppression, with the intention of giving more and more privileges to minorities. Alongside this is the fear that there is a scheme to convert the minority into the majority (whether through importing or through organic means.) The result of this trope is that the majority lives more in fear and imaginary oppression than the minority itself. Majoritarian parties come to power by employing this trope. His point about \"constitutional morality\" is this same complaint - that the law is proactive in defending minorities but not in defending the majority community.",
        "I kinda know him personally and I've seen his thought process from early  2010s\n\nBack when bjp wasn't even a big deal.  He is truly not worried about the BJP attention. He's doing well in his own right and has covered a space that is basically the right equivalent of Tharoor . A well articulated , yet specious,  upper class claim maker",
        "Except elected government doesn't really represent the majority. It just got majority seats due to flawed first past the poll system. More than 60% who didn't vote BJP, voted left-leaning secular parties, they don't agree with hindutva. Guess what will happen if we have approval voting, would hindutva win?\n\nAnd what is this bitch-fuckery about civilization. Why no one ever gave fuck about this before 90s? Everyone with brains knows that upper caste started voting BJP en-masse because Mandal commision was passed, because then shit got real and their caste privilege was in danger.\n\nIf you truly believe in Hindutva and Hindu unity, how about stopping marrying within caste? Maybe make a law banning inner-caste marriage. (Which is better both for society and also biologically) Would WhatsApp uncle's marry their daughters in other castes for sake of Hindutva?",
        "This joker🤡",
        "he is basically Indian Jordan Peterson"
    ],
    "cleaned_text": "j sai deepak writes majoritarianism used gaslight hindus  ",
    "cleaned_title": "j sai deepak writes majoritarianism used gaslight hindus",
    "cleaned_selftext": "",
    "cleaned_comments": "nose psychotic obscene enjoy friendly innocent crawl sharp telephone sulky mass edited redactdev jsd fuck care typical caste apologist happens use sophisticated english hide bigotry anybody upper caste hindu articles like used gaslight critics including hindu critics bigoted ideology hindutva mf uses braindead logic ass explanation orange dick ass fails realise bjp wont give fuck bigotry jealousy runs veins kids right wing gobble everything says fits narrative actually guy caste apologist friends already mad modi believe modi bigoted enough comes dealing muslims dalits ah yes rightwing intellectual whose weapon fearsome word salad civilizational nexus fans think intelligent lets disentangle says first clearly understands hindu majoritarianism stands hindu ethnonationalism right hindu race land instead denying wholeheartedly embraces shamelessly declares true hindus past present right land definition nationhood valid second employs trope victimhood majority see clearly west whites made feel guilty past oppression intention giving privileges minorities alongside fear scheme convert minority majority whether importing organic means result trope majority lives fear imaginary oppression minority majoritarian parties come power employing trope point constitutional morality complaint law proactive defending minorities defending majority community kinda know personally ive seen thought process early back bjp wasnt even big deal truly worried bjp attention hes well right covered space basically right equivalent tharoor well articulated yet specious upper class claim maker except elected government doesnt really represent majority got majority seats due flawed first past poll system didnt vote bjp voted leftleaning secular parties dont agree hindutva guess happen approval voting would hindutva win bitchfuckery civilization one ever gave fuck everyone brains knows upper caste started voting bjp enmasse mandal commision passed shit got real caste privilege danger truly believe hindutva hindu unity stopping marrying within caste maybe make law banning innercaste marriage better society also biologically would whatsapp uncles marry daughters castes sake hindutva joker basically indian jordan peterson",
    "light_cleaned_title": "J Sai Deepak writes: ‘Majoritarianism’ is used to gaslight Hindus",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "nose psychotic obscene enjoy friendly innocent crawl sharp telephone sulky -- mass edited with redact.dev JSD can fuck off for all I care. He is your typical caste apologist who happens to use sophisticated English to hide his bigotry against anybody who is not an Upper caste Hindu. Articles like this are used to gaslight critics, including Hindu critics, of the bigoted ideology of Hindutva. This Mf uses brain-dead logic and ass of an explanation. He has an orange dick in his ass and fails to realise that BJP won't give a fuck about him. Bigotry and jealousy runs in his veins. These kids and the right wing gobble up everything he says because he fits their narrative. Actually this guy and his caste apologist friends are already mad at Modi. They believe Modi is not bigoted enough when it comes to dealing with Muslims and Dalits. Ah, yes, the right-wing intellectual whose weapon is the fearsome word salad. Civilizational nexus? But he and his fans think he is very intelligent. Let's disentangle what he says here. First, he clearly understands that \"Hindu majoritarianism\" stands for \"Hindu ethno-nationalism\", which is the right of the Hindu race to this land. Instead of denying this, he wholeheartedly embraces this and shamelessly declares that only true Hindus have a past and present right to this land, and that no other definition of nationhood is valid. Second, he employs the trope of the \"victimhood of the majority\". We can see this more clearly in the West, where whites are made to feel guilty of past oppression, with the intention of giving more and more privileges to minorities. Alongside this is the fear that there is a scheme to convert the minority into the majority (whether through importing or through organic means.) The result of this trope is that the majority lives more in fear and imaginary oppression than the minority itself. Majoritarian parties come to power by employing this trope. His point about \"constitutional morality\" is this same complaint - that the law is proactive in defending minorities but not in defending the majority community. I kinda know him personally and I've seen his thought process from early 2010s Back when bjp wasn't even a big deal. He is truly not worried about the BJP attention. He's doing well in his own right and has covered a space that is basically the right equivalent of Tharoor . A well articulated , yet specious, upper class claim maker Except elected government doesn't really represent the majority. It just got majority seats due to flawed first past the poll system. More than 60% who didn't vote BJP, voted left-leaning secular parties, they don't agree with hindutva. Guess what will happen if we have approval voting, would hindutva win? And what is this bitch-fuckery about civilization. Why no one ever gave fuck about this before 90s? Everyone with brains knows that upper caste started voting BJP en-masse because Mandal commision was passed, because then shit got real and their caste privilege was in danger. If you truly believe in Hindutva and Hindu unity, how about stopping marrying within caste? Maybe make a law banning inner-caste marriage. (Which is better both for society and also biologically) Would WhatsApp uncle's marry their daughters in other castes for sake of Hindutva? This joker🤡 he is basically Indian Jordan Peterson"
}