{
    "id": "1b8r0go",
    "title": "Gets into IITM because Father is a Politician",
    "url": "https://www.reddit.com/r/india/comments/1b8r0go/gets_into_iitm_because_father_is_a_politician/",
    "selftext": "&#x200B;\n\n[ Youtube- IITian Shiven Nikam ](https://preview.redd.it/0rx20rikwvmc1.jpg?width=225&format=pjpg&auto=webp&s=edeaf5c661c2593490bdcaf198ba3ce70f5c83f0)\n\nThis is Shiven Nikam, he is pursuing Dual degree at IITM in Aerospace Engineering at IIT Madras. Has a YouTube [channel](https://www.youtube.com/c/shivennikam) with over 350K subs.(Now he has privated all his videos). He also teaches on [Unacademy](https://www.youtube.com/watch?v=C3rkPEOZZcQ&list=PLnIjekOxt75ReLqbaZoj85XeVGcs54Pcw)\n\n&#x200B;\n\n[ This is his result ](https://preview.redd.it/99p6tqlswvmc1.jpg?width=1000&format=pjpg&auto=webp&s=1511302655d070f69dd959607d63f7df3b6c8ddb)\n\n**This guy \"teaches\" you to crack JEE Advance.**\n\n&#x200B;\n\nhttps://preview.redd.it/mvnr28svwvmc1.jpg?width=2117&format=pjpg&auto=webp&s=e8595434de0ceeb4c662a96a2b68f3dbcf8c4424\n\n&#x200B;\n\nhttps://preview.redd.it/4pzxm50xwvmc1.jpg?width=2118&format=pjpg&auto=webp&s=4dc45f9a191b1efdd781a301121efe9feaf0795e\n\nPlease read the orignal [post](https://np.reddit.com/r/JEENEETards/comments/1b6zubv/another_big_expose/) for the full context. [u/Shiven-NoCum-5082](https://np.reddit.com/user/Shiven-NoCum-5082/) who also studies at IITM was getting **police threats and hence had to delete his reddit account for his own safety**.\n\n&#x200B;\n\n[ \\\\\"Legal\\\\\" threat to the sub ](https://preview.redd.it/p7wx4c31xvmc1.jpg?width=1080&format=pjpg&auto=webp&s=1e5fef5a030ca90fd7c9ad5168ea2d1348687ede)\n\nOG [Post](https://np.reddit.com/r/JEENEETards/comments/1b85nw1/urgent_please_im_scared/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\n&#x200B;\n\nhttps://preview.redd.it/5lepuh16xvmc1.jpg?width=1080&format=pjpg&auto=webp&s=00e029e1f3ae800116db48ad8af41ac617c186fd\n\nOG [Post](https://np.reddit.com/r/JEENEETards/comments/1b87n8g/wtf/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\n[u/Western\\_Author\\_4759](https://np.reddit.com/user/Western_Author_4759/) **his profile**\n\n**Let this serve as a reminder that merit should always triumph over political connections. Our educational institutions, especially prestigious ones like IITs, should be sanctuaries of excellence and fairness, not breeding grounds for nepotism and corruption. It's time to shine a light on these injustices and demand accountability. Our future, and the integrity of our institutions, depend on it. Let's show these scums what we can do.**\n\n&#x200B;",
    "flair": "Rant / Vent",
    "score": 774,
    "num_comments": 68,
    "created_utc": 1709805812.0,
    "convurl": "https://external-preview.redd.it/MrRgKDJkpmKaK-Z7BaAf9P4tLKhIAmdibEluO8n6dH4.jpg?auto=webp&s=90735bf658b2a2550cca8097cb74330eab3eaa96",
    "comments": [
        "Am just wondering how many such cases are prevelant in various fields with influence of politicians/those having connections with higher authority and we will never be aware of it in our lifetime.\n\nCorruption and unfair practices are deep rooted in our society n system. Why have we become so insensitive towards it ? Maybe cuz we are indifferent and inconsiderate to other's misery. \n\nBut as the popular quote goes “**Lagegi aag to aayenge ghar kai zad me, yahan pe sirf hamara makan thodi hai**\".",
        "Wow! This should be exposed really. I pity those who really work hard for jee and miss the seat because such assholes take up the seat illegally. Forward it to nta, iitm management abd relevant authorities. Make an example out of this",
        "Judiciary and bureaucracy and in every office this kind of patronage system is prevalent and as there are no checks and balances and the system is to protect elite and powerful",
        "Both of the notices are bogus. PWD, EWS scams are very common.",
        "0",
        "0",
        "He wouldn't have gotten in iitm even with pwd, would he?",
        "Is this possible people can cheat their way into IIT's as well?",
        "Imagine cheating your way into a prestigious college with a fake pwd certificate and monetizing an audience for your own profit and misguiding other students. This guy is just one of the lowest of scums",
        "People can cheat their way into anything in India. Many minister’s sons and daughters are in big consulting firms, IBs. Chandrababu Naidu’s son and daughter-in-law were both MBA from standford, Piyush Goyal’s son is in Harvard. \n\nAre you telling me it’s all coincidence that top minds in our country are sons and daughters of politicians and gifted people that you came across in your life aren’t gifted enough to be in the same league ? \n\nMoney and power does magic mate.",
        "This guy needs to get his admission revoked",
        "It seems like that. I thought IITs were pristine, I guess I was wrong. Shame on IITs, they lost all the credibility now.",
        "None of those are legal notices. Those are routine intimidation tactics.",
        "Bruh anything with reservation will always be exploited and the people who actually need it will never fully benefit from this system because of the administration's lax ways of implementing such schemes and not having a strict and strong system which properly cracks down on corrupt government workers.This post just proves it.",
        "Even Harvard MIT oxford stanford are same",
        "He already got in?",
        "Well Harvard and all are a different case, there toh admission requires money. Ik talent bhu chahiye but still many influencial celebs and rich buisnessmen both from India and us, get their children admitted their children to ivy.\nBut iits me money or political power doesn't matter, your simple AIR does.\nBUT with the introduction of the stupid reservation system, people exploit this system which is actually meant for the real poor and disabled children. In these cases political power and money comes into play by forging fake reservation certificates\nSo sad",
        "Then you will hate legacy based admission in the USA colleges too",
        "This is not a legal notice at all. When Reddit removes something due to a legal order, it looks different. Like this:\n\nhttps://preview.redd.it/e6uz96dxlwmc1.png?width=1080&format=pjpg&auto=webp&s=364841befb9da6c135a82a9ff15ecf7633b57643",
        "Nahh they are not. Many rich kids study there because they have loads of money, which these universities always want and these rich guys have a rich background in extra curriculars (if not so much in acads) so yeah as per their background check, these not so bright rich kids make it to such universities because they bring diversity \n\nBut IIT on the other hand my friend has one of the strictest and toughest technical entrance examination to get students into there institution. Iit doesn't care about your extra curricular background, they solely care about marks in their jee mains and advance and they were supposed to be the torchbearers of transparency, but lol, everything is for sale in this country. There is no merit left now even in IITs",
        "Eh? Do IITs have a sport quota now? Back in the day you could get into any big name college by bribing the sports staff to get you admitted under sport quota.. people were taken under sports like archery, shooting and one person who didn’t know how to ride a bicycle under road racing.",
        "Yeah absolutely correct, but IITs are not even cross checking things like that. Damn, they lost credibility for real!",
        "Read this too\n\nabout Dheeraj Jain - a fraud fake PWD from FMS, Delhi.\n\nqr. ae/pNyGqp\n\nRemove the \"space\" between \".\" and \"ae\" in above link to see the truth.",
        "He also has merchandise , where he sells hoodies with his name printed on it (who the fuck wants to buy them ) .",
        "https://preview.redd.it/xe5ygeegowmc1.png?width=1080&format=pjpg&auto=webp&s=751b8414c709a1c0a3817bc95c7fbfb43eb1895b\n\nThey are doing it in other subs",
        "In west, university needs these admission because of their parents tends to donate hell lot of money which will in turn funds the research and academics. Here politicians will probably try to suck the money out of your academic system",
        "What a cunt",
        "Exactly my point! Foreign universities require rich background, which can be achieved by being rich easily. It should not have been like this for IITs though.",
        "Yeah exactly!",
        "Why is USA coming into a topic about IIT?",
        "This should also apply to IIT directors and other higher ups, we have too many RSS clowns preaching cow urine alchemy in IITs.",
        "Reservation sucks I know that very well\nGot Rejected many times because of that. \nEws certificates are isssued very easily without any strict background check",
        "Thanks OP for posting it here \n\nr/JEENEETards is has done a tremendous job \n\nI would appeal r/india memebers to share it as much possible",
        "2 minutes silence for those who bought his hoodies already.",
        "People are surprised how someone can get into a govt college with a govt connection??...phew!",
        "US is not our concern, lets leave that to Americans",
        "Sadly yes",
        "When whataboutism is favourite hobby",
        "35 dollars my goodness.",
        "Too many rapist Muhammad followers too in the iits",
        "It happens in every rw Indian sub. The above user is probably from one of them.",
        "Can you tell more about the police threats as well? Because they should be reported as well for threatening innocent people for no reason",
        "Probably a bjp supporter...his brain is still in his caveman days.",
        "Yep, I bet the real poor kids on the street and villages don't even know about the reservation and that a nice lifestyle, job, education is very easily accessible for them just by studing a little and actually giving the exam, they all are so busy completing the basic requirements of their life such as food and all.\nWhile ppl like this bastard misuse reservation.\nNot only him, I'm a middle class general male and I have seen so called ews people who are better off than me and my other friends, just because of their ancient family descent, cheating and changing their surname they access these privileges to fine institutions and jobs.",
        "Welp. Reservation has already made me compliant. I don't see any difference between 3rd gen reservation and this.",
        "spread this as much as you can. \n\nif not anything, he will lose all respect and everyone in the class or institute will know what a fraud he is.\n\ninfluencers like this live with inflated egos, you hit them where it hurts. their ego and so called fake made up repuation without any credibility.\n\nneend uda do iski",
        "The way he got through PWD is literally a mockery of actual disabled people. ",
        "Shiven Nikamma",
        "Aiplex is the same company which threatened another redditor after she exposed Radhika merchant to be having an extremely good looking ex boyfriend and after that info was shared on reddit",
        "You'd be surprised how passionate some students get about their coaching teachers. There was this guy teaching Maths at PW, and a zoom class recording of him verbally abusing a student, albeit a student who disturbed. There was a lot of criticism, BRUT carried a video post, calls to remove him, etc. You should have seen the vitriol in comments where his alleged students tried to defend him. Such fanaticism for a coaching teacher.",
        "So basically meritocracy is doomed only people with more resources can even be considered as meritorious",
        "The legal notice is shit... There's no Aloka in Maharashtra lol... It's Akola 😂\n\nMay be his legal representative is a PWD.",
        "Indians love worshipping people. Most of us lack actual figures we ought to look up to in life so we make heroes out of somebody ourselves, who we live vicariously through then.",
        "Indians love worshipping people. Most of us lack actual figures we ought to look up to in life so we make heroes out of somebody ourselves, who we live vicariously through then.",
        "WHAT, this is insane, this dude is in a college with a branch that needs a sub 2500 rank, that is 0.02 percent of the 10 lack people that give jee, he got 1 percentile is physics, 1 percentile in physics has to be negatibe marks, with his performance he shouldnt even get a government college let alone a top 4 IIT",
        "qr/pNyGqp",
        "Lol understandable",
        "[https://timesofindia.indiatimes.com/city/jaipur/from-hero-to-zero-si-exam-topper-arrested-for-fraud/articleshow/108280665.cms](https://timesofindia.indiatimes.com/city/jaipur/from-hero-to-zero-si-exam-topper-arrested-for-fraud/articleshow/108280665.cms)",
        "I doubt its even a company",
        " bhai 1.5 percentile💀💀💀 how tf",
        "Please remove IITian from his name it's a disgrace to IITs 🙏🏻",
        "Punjab university, Delhi university Mei hota hai iits and nits mei nhi hota. Mera ek dost gya hai sports se wo Bta rha tha ki compulsion hoti hai ground mei 75% attendance so I think at least that system seems robust",
        "2 minutes are way less",
        "Admissions to Stanford/Harvard and IITs work very differently. They are more \"holistic\" (using them in double quotes for a reason) and you can pay your way into them. All Ivys do legacy admissions. You can donate a building and you can get in easily (for bachelors and MBA atleast).\n\nThere are no such provisions in IITs. So what's happening in the US isn't technically illegal (albeit, unethical), whereas faking these documents in India is (I presume) illegal.",
        "Meritocracy has always been a farce. A non genius kid from rural India still stands 0 chance at cracking the JEE. \n\nPeople with more resources have always been meritorious, historically. Although entrance exams have become an equaliser for the middle class, the lower class is still in the same situation.",
        "Oooh I'm scared by your threats...oooh.\n\n\nBite me bitch",
        "Ruling class keeps rulling\nLenin was right",
        "They are minuscule when compared to the people who take fake EWS, OBC certificates which have income criteria. You don't have to be a rich persons or politicians son for that. Mostly small businessmen who hide their incomes make use of this.\nIITs by themselves are very fair imo. These fake certificates are the issue.",
        "Haan bhai main mazaak bana raha tha.. mujhe pata hai iit main nahi hota. DU main it depends on the college and the sport department.",
        "I don't really think he'd have gone further in the course.\n\nBut it is evident that he used the university tag for other benefits."
    ],
    "cleaned_text": "gets iitm father politician xb youtube iitian shiven nikam httpspreviewredditrxrikwvmcjpgwidthformatpjpgautowebpsedeafccbdcafbacefcf shiven nikam pursuing dual degree iitm aerospace engineering iit madras youtube channelhttpswwwyoutubecomcshivennikam k subsnow privated videos also teaches unacademyhttpswwwyoutubecomwatchvcrkpeozzcqlistplnijekoxtrelqbazojxevgcspcw xb result httpspreviewredditptqlswvmcjpgwidthformatpjpgautowebpsdfdddfdfbcddb guy teaches crack jee advance xb xb please read orignal posthttpsnpredditcomrjeeneetardscommentsbzubvanotherbigexpose full context ushivennocumhttpsnpredditcomusershivennocum also studies iitm getting police threats hence delete reddit account safety xb legal threat sub httpspreviewredditpwxcxvmcjpgwidthformatpjpgautowebpsefefacafdcadeadede og posthttpsnpredditcomrjeeneetardscommentsbnwurgentpleaseimscaredutmsourceshareutmmediumwebxutmnamewebxcssutmtermutmcontentsharebutton xb og posthttpsnpredditcomrjeeneetardscommentsbngwtfutmsourceshareutmmediumwebxutmnamewebxcssutmtermutmcontentsharebutton uwesternauthorhttpsnpredditcomuserwesternauthor profile let serve reminder merit always triumph political connections educational institutions especially prestigious ones like iits sanctuaries excellence fairness breeding grounds nepotism corruption time shine light injustices demand accountability future integrity institutions depend lets show scums xb ",
    "cleaned_title": "gets iitm father politician",
    "cleaned_selftext": "xb youtube iitian shiven nikam httpspreviewredditrxrikwvmcjpgwidthformatpjpgautowebpsedeafccbdcafbacefcf shiven nikam pursuing dual degree iitm aerospace engineering iit madras youtube channelhttpswwwyoutubecomcshivennikam k subsnow privated videos also teaches unacademyhttpswwwyoutubecomwatchvcrkpeozzcqlistplnijekoxtrelqbazojxevgcspcw xb result httpspreviewredditptqlswvmcjpgwidthformatpjpgautowebpsdfdddfdfbcddb guy teaches crack jee advance xb xb please read orignal posthttpsnpredditcomrjeeneetardscommentsbzubvanotherbigexpose full context ushivennocumhttpsnpredditcomusershivennocum also studies iitm getting police threats hence delete reddit account safety xb legal threat sub httpspreviewredditpwxcxvmcjpgwidthformatpjpgautowebpsefefacafdcadeadede og posthttpsnpredditcomrjeeneetardscommentsbnwurgentpleaseimscaredutmsourceshareutmmediumwebxutmnamewebxcssutmtermutmcontentsharebutton xb og posthttpsnpredditcomrjeeneetardscommentsbngwtfutmsourceshareutmmediumwebxutmnamewebxcssutmtermutmcontentsharebutton uwesternauthorhttpsnpredditcomuserwesternauthor profile let serve reminder merit always triumph political connections educational institutions especially prestigious ones like iits sanctuaries excellence fairness breeding grounds nepotism corruption time shine light injustices demand accountability future integrity institutions depend lets show scums xb",
    "cleaned_comments": "wondering many cases prevelant various fields influence politiciansthose connections higher authority never aware lifetime corruption unfair practices deep rooted society n system become insensitive towards maybe cuz indifferent inconsiderate others misery popular quote goes lagegi aag aayenge ghar kai zad yahan pe sirf hamara makan thodi hai wow exposed really pity really work hard jee miss seat assholes take seat illegally forward nta iitm management abd relevant authorities make example judiciary bureaucracy every office kind patronage system prevalent checks balances system protect elite powerful notices bogus pwd ews scams common wouldnt gotten iitm even pwd would possible people cheat way iits well imagine cheating way prestigious college fake pwd certificate monetizing audience profit misguiding students guy one lowest scums people cheat way anything india many ministers sons daughters big consulting firms ibs chandrababu naidus son daughterinlaw mba standford piyush goyals son harvard telling coincidence top minds country sons daughters politicians gifted people came across life arent gifted enough league money power magic mate guy needs get admission revoked seems like thought iits pristine guess wrong shame iits lost credibility none legal notices routine intimidation tactics bruh anything reservation always exploited people actually need never fully benefit system administrations lax ways implementing schemes strict strong system properly cracks corrupt government workersthis post proves even harvard mit oxford stanford already got well harvard different case toh admission requires money ik talent bhu chahiye still many influencial celebs rich buisnessmen india us get children admitted children ivy iits money political power doesnt matter simple air introduction stupid reservation system people exploit system actually meant real poor disabled children cases political power money comes play forging fake reservation certificates sad hate legacy based admission usa colleges legal notice reddit removes something due legal order looks different like nahh many rich kids study loads money universities always want rich guys rich background extra curriculars much acads yeah per background check bright rich kids make universities bring diversity iit hand friend one strictest toughest technical entrance examination get students institution iit doesnt care extra curricular background solely care marks jee mains advance supposed torchbearers transparency lol everything sale country merit left even iits eh iits sport quota back day could get big name college bribing sports staff get admitted sport quota people taken sports like archery shooting one person didnt know ride bicycle road racing yeah absolutely correct iits even cross checking things like damn lost credibility real read dheeraj jain fraud fake pwd fms delhi qr aepnygqp remove space ae link see truth also merchandise sells hoodies name printed fuck wants buy subs west university needs admission parents tends donate hell lot money turn funds research academics politicians probably try suck money academic system cunt exactly point foreign universities require rich background achieved rich easily like iits though yeah exactly usa coming topic iit also apply iit directors higher ups many rss clowns preaching cow urine alchemy iits reservation sucks know well got rejected many times ews certificates isssued easily without strict background check thanks op posting rjeeneetards done tremendous job would appeal rindia memebers share much possible minutes silence bought hoodies already people surprised someone get govt college govt connectionphew us concern lets leave americans sadly yes whataboutism favourite hobby dollars goodness many rapist muhammad followers iits happens every rw indian sub user probably one tell police threats well reported well threatening innocent people reason probably bjp supporterhis brain still caveman days yep bet real poor kids street villages dont even know reservation nice lifestyle job education easily accessible studing little actually giving exam busy completing basic requirements life food ppl like bastard misuse reservation im middle class general male seen called ews people better friends ancient family descent cheating changing surname access privileges fine institutions jobs welp reservation already made compliant dont see difference rd gen reservation spread much anything lose respect everyone class institute know fraud influencers like live inflated egos hit hurts ego called fake made repuation without credibility neend uda iski way got pwd literally mockery actual disabled people shiven nikamma aiplex company threatened another redditor exposed radhika merchant extremely good looking ex boyfriend info shared reddit youd surprised passionate students get coaching teachers guy teaching maths pw zoom class recording verbally abusing student albeit student disturbed lot criticism brut carried video post calls remove etc seen vitriol comments alleged students tried defend fanaticism coaching teacher basically meritocracy doomed people resources even considered meritorious legal notice shit theres aloka maharashtra lol akola may legal representative pwd indians love worshipping people us lack actual figures ought look life make heroes somebody live vicariously indians love worshipping people us lack actual figures ought look life make heroes somebody live vicariously insane dude college branch needs sub rank percent lack people give jee got percentile physics percentile physics negatibe marks performance shouldnt even get government college let alone top iit qrpnygqp lol understandable httpstimesofindiaindiatimescomcityjaipurfromherotozerosiexamtopperarrestedforfraudarticleshowcmshttpstimesofindiaindiatimescomcityjaipurfromherotozerosiexamtopperarrestedforfraudarticleshowcms doubt even company bhai percentile tf please remove iitian name disgrace iits punjab university delhi university mei hota hai iits nits mei nhi hota mera ek dost gya hai sports se wo bta rha tha ki compulsion hoti hai ground mei attendance think least system seems robust minutes way less admissions stanfordharvard iits work differently holistic using double quotes reason pay way ivys legacy admissions donate building get easily bachelors mba atleast provisions iits whats happening us isnt technically illegal albeit unethical whereas faking documents india presume illegal meritocracy always farce non genius kid rural india still stands chance cracking jee people resources always meritorious historically although entrance exams become equaliser middle class lower class still situation oooh im scared threatsoooh bite bitch ruling class keeps rulling lenin right minuscule compared people take fake ews obc certificates income criteria dont rich persons politicians son mostly small businessmen hide incomes make use iits fair imo fake certificates issue haan bhai main mazaak bana raha tha mujhe pata hai iit main nahi hota du main depends college sport department dont really think hed gone course evident used university tag benefits",
    "light_cleaned_title": "Gets into IITM because Father is a Politician",
    "light_cleaned_selftext": "&#x200B; [ Youtube- IITian Shiven Nikam ](https://preview.redd.it/0rx20rikwvmc1.jpg?width=225&format=pjpg&auto=webp&s=edeaf5c661c2593490bdcaf198ba3ce70f5c83f0) This is Shiven Nikam, he is pursuing Dual degree at IITM in Aerospace Engineering at IIT Madras. Has a YouTube [channel](https://www.youtube.com/c/shivennikam) with over 350K subs.(Now he has privated all his videos). He also teaches on [Unacademy](https://www.youtube.com/watch?v=C3rkPEOZZcQ&list=PLnIjekOxt75ReLqbaZoj85XeVGcs54Pcw) &#x200B; [ This is his result ](https://preview.redd.it/99p6tqlswvmc1.jpg?width=1000&format=pjpg&auto=webp&s=1511302655d070f69dd959607d63f7df3b6c8ddb) **This guy \"teaches\" you to crack JEE Advance.** &#x200B; &#x200B; Please read the orignal [post](https://np.reddit.com/r/JEENEETards/comments/1b6zubv/another_big_expose/) for the full context. [u/Shiven-NoCum-5082](https://np.reddit.com/user/Shiven-NoCum-5082/) who also studies at IITM was getting **police threats and hence had to delete his reddit account for his own safety**. &#x200B; [ \\\\\"Legal\\\\\" threat to the sub ](https://preview.redd.it/p7wx4c31xvmc1.jpg?width=1080&format=pjpg&auto=webp&s=1e5fef5a030ca90fd7c9ad5168ea2d1348687ede) OG [Post](https://np.reddit.com/r/JEENEETards/comments/1b85nw1/urgent_please_im_scared/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) &#x200B; OG [Post](https://np.reddit.com/r/JEENEETards/comments/1b87n8g/wtf/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) [u/Western\\_Author\\_4759](https://np.reddit.com/user/Western_Author_4759/) **his profile** **Let this serve as a reminder that merit should always triumph over political connections. Our educational institutions, especially prestigious ones like IITs, should be sanctuaries of excellence and fairness, not breeding grounds for nepotism and corruption. It's time to shine a light on these injustices and demand accountability. Our future, and the integrity of our institutions, depend on it. Let's show these scums what we can do.** &#x200B;",
    "light_cleaned_comments": "Am just wondering how many such cases are prevelant in various fields with influence of politicians/those having connections with higher authority and we will never be aware of it in our lifetime. Corruption and unfair practices are deep rooted in our society n system. Why have we become so insensitive towards it ? Maybe cuz we are indifferent and inconsiderate to other's misery. But as the popular quote goes “**Lagegi aag to aayenge ghar kai zad me, yahan pe sirf hamara makan thodi hai**\". Wow! This should be exposed really. I pity those who really work hard for jee and miss the seat because such assholes take up the seat illegally. Forward it to nta, iitm management abd relevant authorities. Make an example out of this Judiciary and bureaucracy and in every office this kind of patronage system is prevalent and as there are no checks and balances and the system is to protect elite and powerful Both of the notices are bogus. PWD, EWS scams are very common. 0 0 He wouldn't have gotten in iitm even with pwd, would he? Is this possible people can cheat their way into IIT's as well? Imagine cheating your way into a prestigious college with a fake pwd certificate and monetizing an audience for your own profit and misguiding other students. This guy is just one of the lowest of scums People can cheat their way into anything in India. Many minister’s sons and daughters are in big consulting firms, IBs. Chandrababu Naidu’s son and daughter-in-law were both MBA from standford, Piyush Goyal’s son is in Harvard. Are you telling me it’s all coincidence that top minds in our country are sons and daughters of politicians and gifted people that you came across in your life aren’t gifted enough to be in the same league ? Money and power does magic mate. This guy needs to get his admission revoked It seems like that. I thought IITs were pristine, I guess I was wrong. Shame on IITs, they lost all the credibility now. None of those are legal notices. Those are routine intimidation tactics. Bruh anything with reservation will always be exploited and the people who actually need it will never fully benefit from this system because of the administration's lax ways of implementing such schemes and not having a strict and strong system which properly cracks down on corrupt government workers.This post just proves it. Even Harvard MIT oxford stanford are same He already got in? Well Harvard and all are a different case, there toh admission requires money. Ik talent bhu chahiye but still many influencial celebs and rich buisnessmen both from India and us, get their children admitted their children to ivy. But iits me money or political power doesn't matter, your simple AIR does. BUT with the introduction of the stupid reservation system, people exploit this system which is actually meant for the real poor and disabled children. In these cases political power and money comes into play by forging fake reservation certificates So sad Then you will hate legacy based admission in the USA colleges too This is not a legal notice at all. When Reddit removes something due to a legal order, it looks different. Like this: Nahh they are not. Many rich kids study there because they have loads of money, which these universities always want and these rich guys have a rich background in extra curriculars (if not so much in acads) so yeah as per their background check, these not so bright rich kids make it to such universities because they bring diversity But IIT on the other hand my friend has one of the strictest and toughest technical entrance examination to get students into there institution. Iit doesn't care about your extra curricular background, they solely care about marks in their jee mains and advance and they were supposed to be the torchbearers of transparency, but lol, everything is for sale in this country. There is no merit left now even in IITs Eh? Do IITs have a sport quota now? Back in the day you could get into any big name college by bribing the sports staff to get you admitted under sport quota.. people were taken under sports like archery, shooting and one person who didn’t know how to ride a bicycle under road racing. Yeah absolutely correct, but IITs are not even cross checking things like that. Damn, they lost credibility for real! Read this too about Dheeraj Jain - a fraud fake PWD from FMS, Delhi. qr. ae/pNyGqp Remove the \"space\" between \".\" and \"ae\" in above link to see the truth. He also has merchandise , where he sells hoodies with his name printed on it (who the fuck wants to buy them ) . They are doing it in other subs In west, university needs these admission because of their parents tends to donate hell lot of money which will in turn funds the research and academics. Here politicians will probably try to suck the money out of your academic system What a cunt Exactly my point! Foreign universities require rich background, which can be achieved by being rich easily. It should not have been like this for IITs though. Yeah exactly! Why is USA coming into a topic about IIT? This should also apply to IIT directors and other higher ups, we have too many RSS clowns preaching cow urine alchemy in IITs. Reservation sucks I know that very well Got Rejected many times because of that. Ews certificates are isssued very easily without any strict background check Thanks OP for posting it here r/JEENEETards is has done a tremendous job I would appeal r/india memebers to share it as much possible 2 minutes silence for those who bought his hoodies already. People are surprised how someone can get into a govt college with a govt connection??...phew! US is not our concern, lets leave that to Americans Sadly yes When whataboutism is favourite hobby 35 dollars my goodness. Too many rapist Muhammad followers too in the iits It happens in every rw Indian sub. The above user is probably from one of them. Can you tell more about the police threats as well? Because they should be reported as well for threatening innocent people for no reason Probably a bjp supporter...his brain is still in his caveman days. Yep, I bet the real poor kids on the street and villages don't even know about the reservation and that a nice lifestyle, job, education is very easily accessible for them just by studing a little and actually giving the exam, they all are so busy completing the basic requirements of their life such as food and all. While ppl like this bastard misuse reservation. Not only him, I'm a middle class general male and I have seen so called ews people who are better off than me and my other friends, just because of their ancient family descent, cheating and changing their surname they access these privileges to fine institutions and jobs. Welp. Reservation has already made me compliant. I don't see any difference between 3rd gen reservation and this. spread this as much as you can. if not anything, he will lose all respect and everyone in the class or institute will know what a fraud he is. influencers like this live with inflated egos, you hit them where it hurts. their ego and so called fake made up repuation without any credibility. neend uda do iski The way he got through PWD is literally a mockery of actual disabled people. Shiven Nikamma Aiplex is the same company which threatened another redditor after she exposed Radhika merchant to be having an extremely good looking ex boyfriend and after that info was shared on reddit You'd be surprised how passionate some students get about their coaching teachers. There was this guy teaching Maths at PW, and a zoom class recording of him verbally abusing a student, albeit a student who disturbed. There was a lot of criticism, BRUT carried a video post, calls to remove him, etc. You should have seen the vitriol in comments where his alleged students tried to defend him. Such fanaticism for a coaching teacher. So basically meritocracy is doomed only people with more resources can even be considered as meritorious The legal notice is shit... There's no Aloka in Maharashtra lol... It's Akola 😂 May be his legal representative is a PWD. Indians love worshipping people. Most of us lack actual figures we ought to look up to in life so we make heroes out of somebody ourselves, who we live vicariously through then. Indians love worshipping people. Most of us lack actual figures we ought to look up to in life so we make heroes out of somebody ourselves, who we live vicariously through then. WHAT, this is insane, this dude is in a college with a branch that needs a sub 2500 rank, that is 0.02 percent of the 10 lack people that give jee, he got 1 percentile is physics, 1 percentile in physics has to be negatibe marks, with his performance he shouldnt even get a government college let alone a top 4 IIT qr/pNyGqp Lol understandable [https://timesofindia.indiatimes.com/city/jaipur/from-hero-to-zero-si-exam-topper-arrested-for-fraud/articleshow/108280665.cms](https://timesofindia.indiatimes.com/city/jaipur/from-hero-to-zero-si-exam-topper-arrested-for-fraud/articleshow/108280665.cms) I doubt its even a company bhai 1.5 percentile💀💀💀 how tf Please remove IITian from his name it's a disgrace to IITs 🙏🏻 Punjab university, Delhi university Mei hota hai iits and nits mei nhi hota. Mera ek dost gya hai sports se wo Bta rha tha ki compulsion hoti hai ground mei 75% attendance so I think at least that system seems robust 2 minutes are way less Admissions to Stanford/Harvard and IITs work very differently. They are more \"holistic\" (using them in double quotes for a reason) and you can pay your way into them. All Ivys do legacy admissions. You can donate a building and you can get in easily (for bachelors and MBA atleast). There are no such provisions in IITs. So what's happening in the US isn't technically illegal (albeit, unethical), whereas faking these documents in India is (I presume) illegal. Meritocracy has always been a farce. A non genius kid from rural India still stands 0 chance at cracking the JEE. People with more resources have always been meritorious, historically. Although entrance exams have become an equaliser for the middle class, the lower class is still in the same situation. Oooh I'm scared by your threats...oooh. Bite me bitch Ruling class keeps rulling Lenin was right They are minuscule when compared to the people who take fake EWS, OBC certificates which have income criteria. You don't have to be a rich persons or politicians son for that. Mostly small businessmen who hide their incomes make use of this. IITs by themselves are very fair imo. These fake certificates are the issue. Haan bhai main mazaak bana raha tha.. mujhe pata hai iit main nahi hota. DU main it depends on the college and the sport department. I don't really think he'd have gone further in the course. But it is evident that he used the university tag for other benefits."
}