{
    "id": "152sema",
    "title": "How are immigrant indian men able to marry non indian women at high rates in US?",
    "url": "https://www.reddit.com/r/india/comments/152sema/how_are_immigrant_indian_men_able_to_marry_non/",
    "selftext": " \n\nI was checking the interracial marriage rates of different communities in US and it is only indian immigrant men who have such high out marry rates (twice as high as immigrant women). Just wanted to ask even though most us born men here feel their dating image is ruined by immigrants and their creepy image and us born women don't marry immigrant men but they themselves do pretty fine it seems by the data. Why do you think the data says so?\n\nFor immigrant men it's 20% outmarry rate while for immigrant women it's 10%\n\n[https://twitter.com/Noahpinion/status/986761107602681857](https://twitter.com/Noahpinion/status/986761107602681857)\n\nscroll up this tweet to see the difference between us born and total to see the difference in choosing white partners.\n\n[https://carnegieendowment.org/2021/06/09/social-realities-of-indian-americans-results-from-2020-indian-american-attitudes-survey-pub-84667](https://carnegieendowment.org/2021/06/09/social-realities-of-indian-americans-results-from-2020-indian-american-attitudes-survey-pub-84667)\n\njust skim through the rest of the data points",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689668448.0,
    "convurl": "https://external-preview.redd.it/KLzq4JOGtdupQjgBgETxxLbqWzkC0aKlVqA6i_eKN4o.jpg?auto=webp&s=6bd66162eb4ed53ec5dbcfb0e4560f91680f1876",
    "comments": [
        "They aren't as restricted as to which ethnicity they can marry plus guys going abroad are successful in their careers and are usually the complete opposite of the creepy guy stereotype",
        "The answer is - $\n\nMost Indian immigrants in USA make a six figure salary.  And they are very well educated. And people have this illusion that Indian men are \"family guys\".",
        "And loyal to goris so... It's a win win",
        "Indian men are just successful most of the times, also our image isn't ruined abroad as much as people think",
        "Money"
    ],
    "cleaned_text": "immigrant indian men able marry non indian women high rates us checking interracial marriage rates different communities us indian immigrant men high marry rates twice high immigrant women wanted ask even though us born men feel dating image ruined immigrants creepy image us born women dont marry immigrant men pretty fine seems data think data says immigrant men outmarry rate immigrant women httpstwittercomnoahpinionstatushttpstwittercomnoahpinionstatus scroll tweet see difference us born total see difference choosing white partners httpscarnegieendowmentorgsocialrealitiesofindianamericansresultsfromindianamericanattitudessurveypubhttpscarnegieendowmentorgsocialrealitiesofindianamericansresultsfromindianamericanattitudessurveypub skim rest data points ",
    "cleaned_title": "immigrant indian men able marry non indian women high rates us",
    "cleaned_selftext": "checking interracial marriage rates different communities us indian immigrant men high marry rates twice high immigrant women wanted ask even though us born men feel dating image ruined immigrants creepy image us born women dont marry immigrant men pretty fine seems data think data says immigrant men outmarry rate immigrant women httpstwittercomnoahpinionstatushttpstwittercomnoahpinionstatus scroll tweet see difference us born total see difference choosing white partners httpscarnegieendowmentorgsocialrealitiesofindianamericansresultsfromindianamericanattitudessurveypubhttpscarnegieendowmentorgsocialrealitiesofindianamericansresultsfromindianamericanattitudessurveypub skim rest data points",
    "cleaned_comments": "arent restricted ethnicity marry plus guys going abroad successful careers usually complete opposite creepy guy stereotype answer indian immigrants usa make six figure salary well educated people illusion indian men family guys loyal goris win win indian men successful times also image isnt ruined abroad much people think money",
    "light_cleaned_title": "How are immigrant indian men able to marry non indian women at high rates in US?",
    "light_cleaned_selftext": "I was checking the interracial marriage rates of different communities in US and it is only indian immigrant men who have such high out marry rates (twice as high as immigrant women). Just wanted to ask even though most us born men here feel their dating image is ruined by immigrants and their creepy image and us born women don't marry immigrant men but they themselves do pretty fine it seems by the data. Why do you think the data says so? For immigrant men it's 20% outmarry rate while for immigrant women it's 10% [https://twitter.com/Noahpinion/status/986761107602681857](https://twitter.com/Noahpinion/status/986761107602681857) scroll up this tweet to see the difference between us born and total to see the difference in choosing white partners. [https://carnegieendowment.org/2021/06/09/social-realities-of-indian-americans-results-from-2020-indian-american-attitudes-survey-pub-84667](https://carnegieendowment.org/2021/06/09/social-realities-of-indian-americans-results-from-2020-indian-american-attitudes-survey-pub-84667) just skim through the rest of the data points",
    "light_cleaned_comments": "They aren't as restricted as to which ethnicity they can marry plus guys going abroad are successful in their careers and are usually the complete opposite of the creepy guy stereotype The answer is - $ Most Indian immigrants in USA make a six figure salary. And they are very well educated. And people have this illusion that Indian men are \"family guys\". And loyal to goris so... It's a win win Indian men are just successful most of the times, also our image isn't ruined abroad as much as people think Money"
}