{
    "id": "14weh3a",
    "title": "Era of progress and peace in J&K since 2019: Govt to SC over Article 370 move",
    "url": "https://indianexpress.com/article/india/article-370-changes-brought-security-and-stability-to-jk-centre-tells-sc-8824645/",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Findianexpress.com%2Farticle%2Findia%2Farticle-370-changes-brought-security-and-stability-to-jk-centre-tells-sc-8824645%2F",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1689043276.0,
    "convurl": "https://external-preview.redd.it/lRdqyD084GJg2lH3Tj3h0f4D8VotXKjRjlKpg6Uw1Es.jpg",
    "comments": [
        "Aren't Kashmiri pandits again fleeing?",
        "They were already on that path before. The terrorist attacks were at their lowest. Tourism was back at an all time high. And there is one interview by A S Dulat where he said that Farookh Abdullah had given his assurance that they would facilitate removal of Article 370. I think the last was the trigger for Home Ministry to move overnight on the issue",
        "Sounds like the pigs from Animal Farm.",
        "It serves them better if they are no Pandits in Kashmir."
    ],
    "cleaned_text": "era progress peace jk since govt sc article move  ",
    "cleaned_title": "era progress peace jk since govt sc article move",
    "cleaned_selftext": "",
    "cleaned_comments": "arent kashmiri pandits fleeing already path terrorist attacks lowest tourism back time high one interview dulat said farookh abdullah given assurance would facilitate removal article think last trigger home ministry move overnight issue sounds like pigs animal farm serves better pandits kashmir",
    "light_cleaned_title": "Era of progress and peace in J&K since 2019: Govt to SC over Article 370 move",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "Aren't Kashmiri pandits again fleeing? They were already on that path before. The terrorist attacks were at their lowest. Tourism was back at an all time high. And there is one interview by A S Dulat where he said that Farookh Abdullah had given his assurance that they would facilitate removal of Article 370. I think the last was the trigger for Home Ministry to move overnight on the issue Sounds like the pigs from Animal Farm. It serves them better if they are no Pandits in Kashmir."
}