{
    "id": "16yzizu",
    "title": "India's e₹: A Transformative Force for the Economy and Financial Inclusion",
    "url": "https://www.reddit.com/r/india/comments/16yzizu/indias_e_a_transformative_force_for_the_economy/",
    "selftext": "India's e₹, the central bank digital currency (CBDC) launched by the Reserve Bank of India (RBI) in 2023, is poised to revolutionize the way financial transactions are conducted in the nation.\n\nWith its potential to boost economic growth, promote financial inclusion, and streamline government transactions, e₹ is emerging as a transformative force for the Indian economy.\n\nTo know more read the article below\n\n[https://prasthambh.com/economics/e₹central-bank-digital-currency-india/](https://prasthambh.com/economics/e₹central-bank-digital-currency-india/)",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696357732.0,
    "convurl": "https://external-preview.redd.it/n8V2-oE7ROii0xicuCqSG19YZNrcFT-b9NAF7pWXXQU.jpg?auto=webp&s=90505eba6bc468590591ccdee064a4c724fe429e",
    "comments": [
        "Nice write up, but the fact that you did not bring up the number 1 danger with this thing, which is government overreach/tyranny is concerning.\n\n\nA government in the future can use this to cut anyone they don’t like out of the markets completely. They can make it impossible to even buy groceries for someone they don’t like. \n\n\nYou know how government after government has gotten this bad habit of shutting down internet in areas they don’t like, to quell protests? This is that on steroids. They can shutdown anyone they don’t like out. It’s something out of a dystopian Chinese experiment.\n\nCanada did a version of it when truckers were protesting the government. They shutdown all their bank accounts, blocked all cash withdrawals, shutdown bank accounts of anyone that donated to them. This was a way to force them to go hungry and stop them from buying stuff so that they leave the protest site. People did everything in cash to go around it.\n\nCBDC gives the government ultimate power to crush any protest by financially destroying its opponents. \n\nVery dangerous stuff."
    ],
    "cleaned_text": "indias e transformative force economy financial inclusion indias e central bank digital currency cbdc launched reserve bank india rbi poised revolutionize way financial transactions conducted nation potential boost economic growth promote financial inclusion streamline government transactions e emerging transformative force indian economy know read article httpsprasthambhcomeconomicsecentralbankdigitalcurrencyindiahttpsprasthambhcomeconomicsecentralbankdigitalcurrencyindia ",
    "cleaned_title": "indias e transformative force economy financial inclusion",
    "cleaned_selftext": "indias e central bank digital currency cbdc launched reserve bank india rbi poised revolutionize way financial transactions conducted nation potential boost economic growth promote financial inclusion streamline government transactions e emerging transformative force indian economy know read article httpsprasthambhcomeconomicsecentralbankdigitalcurrencyindiahttpsprasthambhcomeconomicsecentralbankdigitalcurrencyindia",
    "cleaned_comments": "nice write fact bring number danger thing government overreachtyranny concerning government future use cut anyone dont like markets completely make impossible even buy groceries someone dont like know government government gotten bad habit shutting internet areas dont like quell protests steroids shutdown anyone dont like something dystopian chinese experiment canada version truckers protesting government shutdown bank accounts blocked cash withdrawals shutdown bank accounts anyone donated way force go hungry stop buying stuff leave protest site people everything cash go around cbdc gives government ultimate power crush protest financially destroying opponents dangerous stuff",
    "light_cleaned_title": "India's e₹: A Transformative Force for the Economy and Financial Inclusion",
    "light_cleaned_selftext": "India's e₹, the central bank digital currency (CBDC) launched by the Reserve Bank of India (RBI) in 2023, is poised to revolutionize the way financial transactions are conducted in the nation. With its potential to boost economic growth, promote financial inclusion, and streamline government transactions, e₹ is emerging as a transformative force for the Indian economy. To know more read the article below [https://prasthambh.com/economics/e₹central-bank-digital-currency-india/](https://prasthambh.com/economics/e₹central-bank-digital-currency-india/)",
    "light_cleaned_comments": "Nice write up, but the fact that you did not bring up the number 1 danger with this thing, which is government overreach/tyranny is concerning. A government in the future can use this to cut anyone they don’t like out of the markets completely. They can make it impossible to even buy groceries for someone they don’t like. You know how government after government has gotten this bad habit of shutting down internet in areas they don’t like, to quell protests? This is that on steroids. They can shutdown anyone they don’t like out. It’s something out of a dystopian Chinese experiment. Canada did a version of it when truckers were protesting the government. They shutdown all their bank accounts, blocked all cash withdrawals, shutdown bank accounts of anyone that donated to them. This was a way to force them to go hungry and stop them from buying stuff so that they leave the protest site. People did everything in cash to go around it. CBDC gives the government ultimate power to crush any protest by financially destroying its opponents. Very dangerous stuff."
}