{
    "id": "15lkc3j",
    "title": "Andrew Tate",
    "url": "https://www.reddit.com/r/india/comments/15lkc3j/andrew_tate/",
    "selftext": "A long time back I saw this video on Andrew Tate by this Indian guy who was just like overflowing with pure fucking wisdom and i want to find that video again desparately. It was a long video maybe between 30-60 mins long, no cringe bs, dude was just smart as fuck, seemed like a psychologist or something? My best guess is his channel is something on the likes of healthygamergg (Dr. K), and the dude was basically talking on how Andrew Tate hasn't really achieved anything meaningful in life and all his hard work and stuff is good but is worthless because he does it only for women and is basically a slave to his dick (his literal words) \nI really wanna watch that youtuber again so if any of yall know the video please lmk 😭🙏",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691506156.0,
    "convurl": "https://external-preview.redd.it/DTf6nQUrklFBG3QsUp2khiLMlLjAKssz5t1eRtST0Ak.jpg?auto=webp&s=73db966207816e9c012916f1ac236b8d573191bd",
    "comments": [
        "He is shwetabh Gangwar, don’t upload much these days, after the situation with sandeep maheshwari",
        "I have been following his channel for 6 years now. He content is really good. Especially for teenagers. He gives a really good perspective about different topics.",
        "Good debunk video by Bruce Rivers: https://www.youtube.com/watch?v=R2GI0A5zfPA",
        "Nice to meet another Dr. Kanojia and Shwetabh Gangwar enjoyer."
    ],
    "cleaned_text": "andrew tate long time back saw video andrew tate indian guy like overflowing pure fucking wisdom want find video desparately long video maybe mins long cringe bs dude smart fuck seemed like psychologist something best guess channel something likes healthygamergg dr k dude basically talking andrew tate hasnt really achieved anything meaningful life hard work stuff good worthless women basically slave dick literal words really wan na watch youtuber yall know video please lmk ",
    "cleaned_title": "andrew tate",
    "cleaned_selftext": "long time back saw video andrew tate indian guy like overflowing pure fucking wisdom want find video desparately long video maybe mins long cringe bs dude smart fuck seemed like psychologist something best guess channel something likes healthygamergg dr k dude basically talking andrew tate hasnt really achieved anything meaningful life hard work stuff good worthless women basically slave dick literal words really wan na watch youtuber yall know video please lmk",
    "cleaned_comments": "shwetabh gangwar dont upload much days situation sandeep maheshwari following channel years content really good especially teenagers gives really good perspective different topics good debunk video bruce rivers nice meet another dr kanojia shwetabh gangwar enjoyer",
    "light_cleaned_title": "Andrew Tate",
    "light_cleaned_selftext": "A long time back I saw this video on Andrew Tate by this Indian guy who was just like overflowing with pure fucking wisdom and i want to find that video again desparately. It was a long video maybe between 30-60 mins long, no cringe bs, dude was just smart as fuck, seemed like a psychologist or something? My best guess is his channel is something on the likes of healthygamergg (Dr. K), and the dude was basically talking on how Andrew Tate hasn't really achieved anything meaningful in life and all his hard work and stuff is good but is worthless because he does it only for women and is basically a slave to his dick (his literal words) I really wanna watch that youtuber again so if any of yall know the video please lmk 😭🙏",
    "light_cleaned_comments": "He is shwetabh Gangwar, don’t upload much these days, after the situation with sandeep maheshwari I have been following his channel for 6 years now. He content is really good. Especially for teenagers. He gives a really good perspective about different topics. Good debunk video by Bruce Rivers: Nice to meet another Dr. Kanojia and Shwetabh Gangwar enjoyer."
}