{
    "id": "128jw98",
    "title": "Is it okay for Twitter to use only the list of Indian users who helped us fight against COVID in their recommendation algorithm?",
    "url": "https://www.reddit.com/r/india/comments/128jw98/is_it_okay_for_twitter_to_use_only_the_list_of/",
    "selftext": "TLDR: Twitter opensourced their recommendation algorithm yesterday & I found twitter using a list of Indian users who helped us fight for COVID. Should we be proud or scared?\n\n[View the code on GitHub.com](https://github.com/twitter/the-algorithm/blob/ec83d01dcaebf369444d75ed04b3625a0a645eb9/follow-recommendations-service/common/src/main/scala/com/twitter/follow_recommendations/common/models/DisplayLocation.scala#L184)\n\nI searched for different terms in their entire source code. But to see \"India\" in their source code, I am not sure if I need to be scared or proud of it. I couldn't find information about other countries (few on top of my mind). Even searching just \"COVID\" in their source code, only this was shown.\n\nI understand Twitter might need to fight spam/misinformation, but to use Indian users as a part of their tool, I am not sure how I feel about that. Mainly because, this list in the hands of wrong people would be a threat to Indian citizens.\n\nHow do I know that?\n\nJust recently TikTok CEO testified before the US Congress. A congressman was concerned about the privacy of federal employees, contractors, military personnel and their families. They were concerned that these data which was publicly available on TikTok could be used for blackmail to conduct espionage and reveal troop movements.\n\nSo, why is Indian users privacy not protected. And why, only Indian users? If this was Indian military, govt officials or even their families how would we feel?",
    "flair": "AskIndia",
    "score": 9,
    "num_comments": 2,
    "created_utc": 1680349526.0,
    "convurl": "https://external-preview.redd.it/-IvNHm7YyLm6lbW-vyHMyhs-gZFsxFI8G-lm3hPvVE4.jpg?auto=webp&v=enabled&s=bf53ed1b3feb0212737a9015a4453bfa42cd2766",
    "comments": [
        "[Technical users could use/refer this post on /r/developersIndia](https://np.reddit.com/r/developersIndia/comments/12850sj/found_india_in_twitters_algorithm_repository_not/)"
    ],
    "cleaned_text": "okay twitter use list indian users helped us fight covid recommendation algorithm tldr twitter opensourced recommendation algorithm yesterday found twitter using list indian users helped us fight covid proud scared view code githubcomhttpsgithubcomtwitterthealgorithmblobecddcaebfdedbaaebfollowrecommendationsservicecommonsrcmainscalacomtwitterfollowrecommendationscommonmodelsdisplaylocationscalal searched different terms entire source code see india source code sure need scared proud couldnt find information countries top mind even searching covid source code shown understand twitter might need fight spammisinformation use indian users part tool sure feel mainly list hands wrong people would threat indian citizens know recently tiktok ceo testified us congress congressman concerned privacy federal employees contractors military personnel families concerned data publicly available tiktok could used blackmail conduct espionage reveal troop movements indian users privacy protected indian users indian military govt officials even families would feel ",
    "cleaned_title": "okay twitter use list indian users helped us fight covid recommendation algorithm",
    "cleaned_selftext": "tldr twitter opensourced recommendation algorithm yesterday found twitter using list indian users helped us fight covid proud scared view code githubcomhttpsgithubcomtwitterthealgorithmblobecddcaebfdedbaaebfollowrecommendationsservicecommonsrcmainscalacomtwitterfollowrecommendationscommonmodelsdisplaylocationscalal searched different terms entire source code see india source code sure need scared proud couldnt find information countries top mind even searching covid source code shown understand twitter might need fight spammisinformation use indian users part tool sure feel mainly list hands wrong people would threat indian citizens know recently tiktok ceo testified us congress congressman concerned privacy federal employees contractors military personnel families concerned data publicly available tiktok could used blackmail conduct espionage reveal troop movements indian users privacy protected indian users indian military govt officials even families would feel",
    "cleaned_comments": "technical users could userefer post rdevelopersindiahttpsnpredditcomrdevelopersindiacommentssjfoundindiaintwittersalgorithmrepositorynot",
    "light_cleaned_title": "Is it okay for Twitter to use only the list of Indian users who helped us fight against COVID in their recommendation algorithm?",
    "light_cleaned_selftext": "TLDR: Twitter opensourced their recommendation algorithm yesterday & I found twitter using a list of Indian users who helped us fight for COVID. Should we be proud or scared? [View the code on GitHub.com](https://github.com/twitter/the-algorithm/blob/ec83d01dcaebf369444d75ed04b3625a0a645eb9/follow-recommendations-service/common/src/main/scala/com/twitter/follow_recommendations/common/models/DisplayLocation.scala#L184) I searched for different terms in their entire source code. But to see \"India\" in their source code, I am not sure if I need to be scared or proud of it. I couldn't find information about other countries (few on top of my mind). Even searching just \"COVID\" in their source code, only this was shown. I understand Twitter might need to fight spam/misinformation, but to use Indian users as a part of their tool, I am not sure how I feel about that. Mainly because, this list in the hands of wrong people would be a threat to Indian citizens. How do I know that? Just recently TikTok CEO testified before the US Congress. A congressman was concerned about the privacy of federal employees, contractors, military personnel and their families. They were concerned that these data which was publicly available on TikTok could be used for blackmail to conduct espionage and reveal troop movements. So, why is Indian users privacy not protected. And why, only Indian users? If this was Indian military, govt officials or even their families how would we feel?",
    "light_cleaned_comments": "[Technical users could use/refer this post on /r/developersIndia](https://np.reddit.com/r/developersIndia/comments/12850sj/found_india_in_twitters_algorithm_repository_not/)"
}