{
    "id": "16iiecb",
    "title": "Is this common?",
    "url": "https://i.redd.it/c6773d0n28ob1.png",
    "selftext": "I had a Bank Account rep reach out to me and request that I deposit funds from my other bank accounts, to theirs! Is this kinda request common? I've not held an Indian Bank account in over a decade, and never had this happen before!",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694697801.0,
    "convurl": "https://i.redd.it/c6773d0n28ob1.png",
    "comments": [
        "I think so, Relationship managers will contact you to let you know their details. Then they will use this opportunity to sell FDs but I think maybe you didn't have enough money in the account so he is asking to deposit.",
        ">I think maybe you didn't have enough money in the account so he is asking to deposit\n\nMy account's quite well funded. They are asking to transfer from other banks which I find amusing, and a bit blatant. \n\n\n>Then they will use this opportunity to sell FDs\n\nOhh this makes a lot of sense! I'm assuming the FD request will come a little later",
        "Yes, this is done, they have targets that this much should be in bank on this date, for loan or stuff, either to meet bank's own targets or follow RBI guidelines. I don't know details.\n\nIf this is real person you have met in person in bank, then only consider, it may be fraud. Also don't use links he provide. do bank to bank transfer by checking details on your own.",
        ">If this is real person you have met in person in bank, then only consider, it may be fraud. Also don't use links he provide. do bank to bank transfer by checking details on your own.\n\nThank you, that's solid advice!\n\n>But I didn't think they would do this on chat. \n\nThat was why I was surprised too. They did talk about some savings schemes when I was in the branch, but didn't think they'd openly ask over a chat/message",
        "I see you are a man of culture as well.\n\nIncognito ON",
        "This will be more common in the coming days, as there is insane pressure in the banking industry now for low cost deposits such as current and savings accounts. Most PSBs now have dedicated wing for such business side. They will place employees with good people skills as relationship managers and ask them to have contact with top customers of a particular branch to route more business of them.",
        ">I see you are a man of culture as well.\n\n>Incognito ON\n\nIncognito? 🧐"
    ],
    "cleaned_text": "common bank account rep reach request deposit funds bank accounts kinda request common ive held indian bank account decade never happen ",
    "cleaned_title": "common",
    "cleaned_selftext": "bank account rep reach request deposit funds bank accounts kinda request common ive held indian bank account decade never happen",
    "cleaned_comments": "think relationship managers contact let know details use opportunity sell fds think maybe didnt enough money account asking deposit think maybe didnt enough money account asking deposit accounts quite well funded asking transfer banks find amusing bit blatant use opportunity sell fds ohh makes lot sense im assuming fd request come little later yes done targets much bank date loan stuff either meet banks targets follow rbi guidelines dont know details real person met person bank consider may fraud also dont use links provide bank bank transfer checking details real person met person bank consider may fraud also dont use links provide bank bank transfer checking details thank thats solid advice didnt think would chat surprised talk savings schemes branch didnt think theyd openly ask chatmessage see man culture well incognito common coming days insane pressure banking industry low cost deposits current savings accounts psbs dedicated wing business side place employees good people skills relationship managers ask contact top customers particular branch route business see man culture well incognito incognito",
    "light_cleaned_title": "Is this common?",
    "light_cleaned_selftext": "I had a Bank Account rep reach out to me and request that I deposit funds from my other bank accounts, to theirs! Is this kinda request common? I've not held an Indian Bank account in over a decade, and never had this happen before!",
    "light_cleaned_comments": "I think so, Relationship managers will contact you to let you know their details. Then they will use this opportunity to sell FDs but I think maybe you didn't have enough money in the account so he is asking to deposit. >I think maybe you didn't have enough money in the account so he is asking to deposit My account's quite well funded. They are asking to transfer from other banks which I find amusing, and a bit blatant. >Then they will use this opportunity to sell FDs Ohh this makes a lot of sense! I'm assuming the FD request will come a little later Yes, this is done, they have targets that this much should be in bank on this date, for loan or stuff, either to meet bank's own targets or follow RBI guidelines. I don't know details. If this is real person you have met in person in bank, then only consider, it may be fraud. Also don't use links he provide. do bank to bank transfer by checking details on your own. >If this is real person you have met in person in bank, then only consider, it may be fraud. Also don't use links he provide. do bank to bank transfer by checking details on your own. Thank you, that's solid advice! >But I didn't think they would do this on chat. That was why I was surprised too. They did talk about some savings schemes when I was in the branch, but didn't think they'd openly ask over a chat/message I see you are a man of culture as well. Incognito ON This will be more common in the coming days, as there is insane pressure in the banking industry now for low cost deposits such as current and savings accounts. Most PSBs now have dedicated wing for such business side. They will place employees with good people skills as relationship managers and ask them to have contact with top customers of a particular branch to route more business of them. >I see you are a man of culture as well. >Incognito ON Incognito? 🧐"
}