{
    "id": "10mlo61",
    "title": "Is it just me or Amazon quality product quality has nosedived lately?",
    "url": "https://www.reddit.com/r/india/comments/10mlo61/is_it_just_me_or_amazon_quality_product_quality/",
    "selftext": "I bought iPhone 14 and got 200 rupees chinese clone. Amazon refused to accept the return, since apple store didnt provide us \"jobsheet\".  We have complained with Consumer court website and awaiting their response. I thought thats one time seller fraud.\n\n[my order](https://preview.redd.it/saijgdkhelea1.png?width=1906&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=cf9edb3e9a4b4e0239c29ca9b47307bbd0ac45c4)\n\n&amp;#x200B;\n\n[This is what I got](https://preview.redd.it/yhv1gdpvelea1.png?width=1082&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=9423766a79bf6b3a222fb88465a38d98abeedaa5)\n\nBut now, we are setting up our house and we are buying lots of stuff, and its hit or a miss. Ex: We got crockeries with scratches which looks like it has been used and packaged, and our shoe rack came with its sheets torn. Thankfully amazon is accepted return for these items.\n\nI have been a happy amazon customer for over a very long time now and its sad to see its quality and reliabilty going downhill. I will keep buying (and returning if needed) cheaper items but not expensive ones like phone OR AC.",
    "flair": "AskIndia",
    "score": 10,
    "num_comments": 8,
    "created_utc": 1674828428,
    "convurl": "https://b.thumbs.redditmedia.com/u7BykpC2uspavUSBoXN_OIdNv9NYuwAfaV2WPQMIAxI.jpg",
    "comments": [
        "Tbh everyone I know who works in Amazon, has asked me to never buy expensive items from them",
        "Amazon did about 40000 cr of business in India with a netloss of around 4000 cr. They project themselves as selling cheaper than market, how long do you think they can sustain such practices? A lot of e-commerce sites provided good terms to sellers, but they are increasing the commission they charge on the sold products so a lot of genuine sellers are quitting the platform or their products will always be labelled as higher priced. Plus where do you think most returned goods go to? They are refurbished and sold as new.",
        "You should always do a little bit of research on the seller. Amazon is a marketplace which has many sellers on it. Check the seller reviews on Amazon from where you got the phone, I'm pretty sure it'll be rated bad.",
        "From the screenshot ,looks like it is Appario Retail,",
        "Try to look for the seller's authenticity in the seller review section. The big sellers like cocoblu retail etc don't cheat with people. I never had any bad experience with Amazon   though I've purchased many things like laptop, smartphones, television, washing machine etc from them. Also shooting a video while unboxing is must. Hope this helps:)",
        "What on Earth! You got Android sold as iPhone?",
        "Haha it has a very old Mediatek processor with only 2G/3G modem not even 4G."
    ],
    "cleaned_text": "amazon quality product quality nosedived lately bought iphone got rupees chinese clone amazon refused accept return since apple store didnt provide us jobsheet complained consumer court website awaiting response thought thats one time seller fraud orderhttpspreviewredditsaijgdkheleapngwidthampformatpngampautowebpampvenabledampscfedbeabeccabbbdacc ampxb gothttpspreviewreddityhvgdpveleapngwidthampformatpngampautowebpampvenabledampsabfbafbadabeedaa setting house buying lots stuff hit miss ex got crockeries scratches looks like used packaged shoe rack came sheets torn thankfully amazon accepted return items happy amazon customer long time sad see quality reliabilty going downhill keep buying returning needed cheaper items expensive ones like phone ac ",
    "cleaned_title": "amazon quality product quality nosedived lately",
    "cleaned_selftext": "bought iphone got rupees chinese clone amazon refused accept return since apple store didnt provide us jobsheet complained consumer court website awaiting response thought thats one time seller fraud orderhttpspreviewredditsaijgdkheleapngwidthampformatpngampautowebpampvenabledampscfedbeabeccabbbdacc ampxb gothttpspreviewreddityhvgdpveleapngwidthampformatpngampautowebpampvenabledampsabfbafbadabeedaa setting house buying lots stuff hit miss ex got crockeries scratches looks like used packaged shoe rack came sheets torn thankfully amazon accepted return items happy amazon customer long time sad see quality reliabilty going downhill keep buying returning needed cheaper items expensive ones like phone ac",
    "cleaned_comments": "tbh everyone know works amazon asked never buy expensive items amazon cr business india netloss around cr project selling cheaper market long think sustain practices lot ecommerce sites provided good terms sellers increasing commission charge sold products lot genuine sellers quitting platform products always labelled higher priced plus think returned goods go refurbished sold new always little bit research seller amazon marketplace many sellers check seller reviews amazon got phone im pretty sure itll rated bad screenshot looks like appario retail try look sellers authenticity seller review section big sellers like cocoblu retail etc dont cheat people never bad experience amazon though ive purchased many things like laptop smartphones television washing machine etc also shooting video unboxing must hope helps earth got android sold iphone haha old mediatek processor gg modem even g",
    "light_cleaned_title": "Is it just me or Amazon quality product quality has nosedived lately?",
    "light_cleaned_selftext": "I bought iPhone 14 and got 200 rupees chinese clone. Amazon refused to accept the return, since apple store didnt provide us \"jobsheet\". We have complained with Consumer court website and awaiting their response. I thought thats one time seller fraud. [my order](https://preview.redd.it/saijgdkhelea1.png?width=1906&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=cf9edb3e9a4b4e0239c29ca9b47307bbd0ac45c4)  [This is what I got](https://preview.redd.it/yhv1gdpvelea1.png?width=1082&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=9423766a79bf6b3a222fb88465a38d98abeedaa5) But now, we are setting up our house and we are buying lots of stuff, and its hit or a miss. Ex: We got crockeries with scratches which looks like it has been used and packaged, and our shoe rack came with its sheets torn. Thankfully amazon is accepted return for these items. I have been a happy amazon customer for over a very long time now and its sad to see its quality and reliabilty going downhill. I will keep buying (and returning if needed) cheaper items but not expensive ones like phone OR AC.",
    "light_cleaned_comments": "Tbh everyone I know who works in Amazon, has asked me to never buy expensive items from them Amazon did about 40000 cr of business in India with a netloss of around 4000 cr. They project themselves as selling cheaper than market, how long do you think they can sustain such practices? A lot of e-commerce sites provided good terms to sellers, but they are increasing the commission they charge on the sold products so a lot of genuine sellers are quitting the platform or their products will always be labelled as higher priced. Plus where do you think most returned goods go to? They are refurbished and sold as new. You should always do a little bit of research on the seller. Amazon is a marketplace which has many sellers on it. Check the seller reviews on Amazon from where you got the phone, I'm pretty sure it'll be rated bad. From the screenshot ,looks like it is Appario Retail, Try to look for the seller's authenticity in the seller review section. The big sellers like cocoblu retail etc don't cheat with people. I never had any bad experience with Amazon though I've purchased many things like laptop, smartphones, television, washing machine etc from them. Also shooting a video while unboxing is must. Hope this helps:) What on Earth! You got Android sold as iPhone? Haha it has a very old Mediatek processor with only 2G/3G modem not even 4G."
}