{
    "id": "16bmknt",
    "title": "Bharat Jodo Yatra - 2",
    "url": "https://i.redd.it/tzp8uiy0hnmb1.jpg",
    "selftext": "Looks like congress is doing another Bharat Jodo Yatra. \n\nCongress shared a tweet on their official Twitter handle: https://twitter.com/INCIndia/status/1699405946177380755\n\nBased on the news they will be starting this from 2nd October, 2023. \nSource: https://www.newindianexpress.com/nation/2023/aug/14/power-games-bharat-jodo-yatra-2-rahul-plans-oct-2-launch-from-mahatmas-birthplace-2605091.html",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694012548.0,
    "convurl": "https://i.redd.it/tzp8uiy0hnmb1.jpg",
    "comments": [
        "https://twitter.com/INCIndia/status/1699405946177380755",
        "Pehle hi dhar lia jaega for security reasons",
        "Judega Bharat, Jeetega INDIA",
        "2 UTs between Gujarat and North East? What route are they taking",
        " \n\nJudega Bharat, Jeetega India!",
        "Delhi and Chandigarh I guess",
        "Marketing OP",
        "Looking at the map going to Chandigarh would make it more than 12 states, probably DNhDD and Delhi, even then that's huge",
        "I am not sure if the details in image is for BJY-2 because dates shown are of BJY-1",
        "Oh yes, even the kilometres are of BJY-1. Why are they posting old one",
        "afaik, not sure though, 2nd iteration wouldn't be like first one, where it went from one point to another continuously, but district wise walks. I don't remember where I read or heard that.\n\nThe article you have mentioned says otherwise though. Let's see what they do.\n\nMy view is that first one changed Rahul Gandhi himself, and his image.",
        "Do they walk all the way? Or just take some transportation in between and then walk through the cities to interact with people?",
        "for lot of people, Rahul Gandhi became RaGa post this, Congress wouldn't put in so much effort in case there isn't ground reports about this change of image. I assume even BJP would be acknowledging this internally that BJY changed the image of Rahul Gandhi for Indians.",
        "Freaking dates are wrong 🤦‍♂️🤦‍♀️🤦",
        "BJY1 was a full walk. Why change a winning formula?",
        "September 2022? What, is Barry Allen part of this yatra?",
        "Based.",
        "NO SHIT SHERLOCK",
        "And with this they should also rename the alliance to Bharat Jodo Party ie BJP in short.. Oh wait! 🫢",
        "Bharat Jodo Padyatra",
        "Wait the dates are wrong here",
        "I’m not saying you’re wrong (since I don’t know how people on the ground feel) but Congress would absolutely do something again and again even if it didn’t work. Case in point, using Rahul Gandhi and Priyanka Gandhi in successive Lol Sabha and UP elections… With the results getting steadily worse, topped off with Rahul Gandhi losing Amethi. And Congress will surely field Rahul Gandhi in Amethi again next year. So it’s clearly not the case that “Congress wouldn’t put so much effort if they didn’t think there was a change in his image”",
        "This is great!",
        "Covid restrictions incoming?",
        "Yep, the info-graphic is for the last one.",
        "Walking 4000km? India will be a superpower by that time, just as predicted",
        "Because the tweet says bharat jodo yatra continues. The image is the recap of the last season.",
        "That's the previous yatra. The image is from a tweet that says yatra continues and gives a recap of what happened earlier.",
        "I kept telling that the first Yatra was the best political move by raga while so many others called it pointless. Feeling mighty vindicated about it to be honest.",
        "They conduct rallies in cities. But, use transportation for moving between cities",
        "nice.\n\nbut I think it came too late. INC took long time to become stable after 2014 defeat.",
        "naa that won't happen, it would make the government seem as if they are scared of him",
        "rahul gandhi actually walked all the way i don't know about the rest, i was able to walk for sometime in the first yatra and I got tired after 45 mins",
        "That's what I want"
    ],
    "cleaned_text": "bharat jodo yatra looks like congress another bharat jodo yatra congress shared tweet official twitter handle based news starting nd october source ",
    "cleaned_title": "bharat jodo yatra",
    "cleaned_selftext": "looks like congress another bharat jodo yatra congress shared tweet official twitter handle based news starting nd october source",
    "cleaned_comments": "pehle hi dhar lia jaega security reasons judega bharat jeetega india uts gujarat north east route taking judega bharat jeetega india delhi chandigarh guess marketing op looking map going chandigarh would make states probably dnhdd delhi even thats huge sure details image bjy dates shown bjy oh yes even kilometres bjy posting old one afaik sure though nd iteration wouldnt like first one went one point another continuously district wise walks dont remember read heard article mentioned says otherwise though lets see view first one changed rahul gandhi image walk way take transportation walk cities interact people lot people rahul gandhi became raga post congress wouldnt put much effort case isnt ground reports change image assume even bjp would acknowledging internally bjy changed image rahul gandhi indians freaking dates wrong bjy full walk change winning formula september barry allen part yatra based shit sherlock also rename alliance bharat jodo party ie bjp short oh wait bharat jodo padyatra wait dates wrong im saying youre wrong since dont know people ground feel congress would absolutely something even didnt work case point using rahul gandhi priyanka gandhi successive lol sabha elections results getting steadily worse topped rahul gandhi losing amethi congress surely field rahul gandhi amethi next year clearly case congress wouldnt put much effort didnt think change image great covid restrictions incoming yep infographic last one walking km india superpower time predicted tweet says bharat jodo yatra continues image recap last season thats previous yatra image tweet says yatra continues gives recap happened earlier kept telling first yatra best political move raga many others called pointless feeling mighty vindicated honest conduct rallies cities use transportation moving cities nice think came late inc took long time become stable defeat naa wont happen would make government seem scared rahul gandhi actually walked way dont know rest able walk sometime first yatra got tired mins thats want",
    "light_cleaned_title": "Bharat Jodo Yatra - 2",
    "light_cleaned_selftext": "Looks like congress is doing another Bharat Jodo Yatra. Congress shared a tweet on their official Twitter handle: Based on the news they will be starting this from 2nd October, 2023. Source:",
    "light_cleaned_comments": "Pehle hi dhar lia jaega for security reasons Judega Bharat, Jeetega INDIA 2 UTs between Gujarat and North East? What route are they taking Judega Bharat, Jeetega India! Delhi and Chandigarh I guess Marketing OP Looking at the map going to Chandigarh would make it more than 12 states, probably DNhDD and Delhi, even then that's huge I am not sure if the details in image is for BJY-2 because dates shown are of BJY-1 Oh yes, even the kilometres are of BJY-1. Why are they posting old one afaik, not sure though, 2nd iteration wouldn't be like first one, where it went from one point to another continuously, but district wise walks. I don't remember where I read or heard that. The article you have mentioned says otherwise though. Let's see what they do. My view is that first one changed Rahul Gandhi himself, and his image. Do they walk all the way? Or just take some transportation in between and then walk through the cities to interact with people? for lot of people, Rahul Gandhi became RaGa post this, Congress wouldn't put in so much effort in case there isn't ground reports about this change of image. I assume even BJP would be acknowledging this internally that BJY changed the image of Rahul Gandhi for Indians. Freaking dates are wrong 🤦‍♂️🤦‍♀️🤦 BJY1 was a full walk. Why change a winning formula? September 2022? What, is Barry Allen part of this yatra? Based. NO SHIT SHERLOCK And with this they should also rename the alliance to Bharat Jodo Party ie BJP in short.. Oh wait! 🫢 Bharat Jodo Padyatra Wait the dates are wrong here I’m not saying you’re wrong (since I don’t know how people on the ground feel) but Congress would absolutely do something again and again even if it didn’t work. Case in point, using Rahul Gandhi and Priyanka Gandhi in successive Lol Sabha and UP elections… With the results getting steadily worse, topped off with Rahul Gandhi losing Amethi. And Congress will surely field Rahul Gandhi in Amethi again next year. So it’s clearly not the case that “Congress wouldn’t put so much effort if they didn’t think there was a change in his image” This is great! Covid restrictions incoming? Yep, the info-graphic is for the last one. Walking 4000km? India will be a superpower by that time, just as predicted Because the tweet says bharat jodo yatra continues. The image is the recap of the last season. That's the previous yatra. The image is from a tweet that says yatra continues and gives a recap of what happened earlier. I kept telling that the first Yatra was the best political move by raga while so many others called it pointless. Feeling mighty vindicated about it to be honest. They conduct rallies in cities. But, use transportation for moving between cities nice. but I think it came too late. INC took long time to become stable after 2014 defeat. naa that won't happen, it would make the government seem as if they are scared of him rahul gandhi actually walked all the way i don't know about the rest, i was able to walk for sometime in the first yatra and I got tired after 45 mins That's what I want"
}