{
    "id": "15z6c8k",
    "title": "Presenting India’s first original sci-fi thriller series set in Metaverse (Teaser created with Generative AI)",
    "url": "https://v.redd.it/rxgctbkujvjb1",
    "selftext": "It’s an original Indo-French series with six episodes revolving around themes of human connections, virtual worlds, metaverse identities and secret corporations. It took us close to a year to conceptualize, work on the dialogues and scripts, do test shoots, generate the right AI visuals to fit the narrative, reiterate different modes of Generative AI and render again with new subscriptions but I’m glad we managed to overcome all the challenges.\n\nMajority of the shots in this teaser trailer were created with text prompts in Midjourney and Gen-2 from Runway only! \nAbout 450 generated shots were needed to get the final result. Would love to hear your thoughts on the same :)\n\n",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1692802839.0,
    "convurl": "https://external-preview.redd.it/YzllOXFrY3VqdmpiMXCwoq_iYB7AMBLqNbtyBwnzmVAfNQjoDxctHcmW9zTD.png?format=pjpg&auto=webp&s=53f9a762bc704d854c9fe33d09473a5ca0202632",
    "comments": [],
    "cleaned_text": "presenting indias first original scifi thriller series set metaverse teaser created generative ai original indofrench series six episodes revolving around themes human connections virtual worlds metaverse identities secret corporations took us close year conceptualize work dialogues scripts test shoots generate right ai visuals fit narrative reiterate different modes generative ai render new subscriptions im glad managed overcome challenges majority shots teaser trailer created text prompts midjourney gen runway generated shots needed get final result would love hear thoughts ",
    "cleaned_title": "presenting indias first original scifi thriller series set metaverse teaser created generative ai",
    "cleaned_selftext": "original indofrench series six episodes revolving around themes human connections virtual worlds metaverse identities secret corporations took us close year conceptualize work dialogues scripts test shoots generate right ai visuals fit narrative reiterate different modes generative ai render new subscriptions im glad managed overcome challenges majority shots teaser trailer created text prompts midjourney gen runway generated shots needed get final result would love hear thoughts",
    "cleaned_comments": "",
    "light_cleaned_title": "Presenting India’s first original sci-fi thriller series set in Metaverse (Teaser created with Generative AI)",
    "light_cleaned_selftext": "It’s an original Indo-French series with six episodes revolving around themes of human connections, virtual worlds, metaverse identities and secret corporations. It took us close to a year to conceptualize, work on the dialogues and scripts, do test shoots, generate the right AI visuals to fit the narrative, reiterate different modes of Generative AI and render again with new subscriptions but I’m glad we managed to overcome all the challenges. Majority of the shots in this teaser trailer were created with text prompts in Midjourney and Gen-2 from Runway only! About 450 generated shots were needed to get the final result. Would love to hear your thoughts on the same :)",
    "light_cleaned_comments": ""
}