{
    "id": "1hh9l44",
    "title": "Lost her freedom fighter father, lecturer husband, and son to police encounters, 82-year-old says she stayed alive to get justice",
    "url": "https://indianexpress.com/article/cities/chandigarh/amritsar-woman-justice-freedom-fighter-fater-lecturer-husband-son-police-encounters-punjab-9732767/",
    "selftext": "On Wednesday, CBI Special Judge Manjot Kaur convicted former Sarhali SHO Surinderpal Singh for kidnapping, illegal confinement, and criminal conspiracy to murder Sulakhan Singh and Sukhdev Singh.",
    "flair": "Law & Courts",
    "score": 79,
    "num_comments": 7,
    "created_utc": 1734550283.0,
    "convurl": "https://external-preview.redd.it/ldh1nOxdZrV_IFwztyLkybOLflu1M6Yedddc8uitzAU.jpg?auto=webp&s=7542dd381c2e6e2ff2a5c173b473f022706a89db",
    "comments": [
        "Indian liberals and right wings love to ask Sikhs to forgive indian authorities for their mistakes but had it been hindus India would be in ashes today",
        "###From the article:\n\n> On the day she was born, Sukhwant Kaur’s father, Sulakhan Singh, was in Lahore Jail as part of India’s freedom movement.\n\n>Eighty-two-year-old Sukhwant Kaur witnessed the partition of India and Pakistan as a child, surviving the bloodbath to reach newly created India with her father, later recognised as a freedom fighter. The family settled in Bhakna village, Amritsar, in 1947, where Kaur became the first student at a school started by Gadar Party founder Sohan Singh Bhakna, a close associate of her father.\n\n>Married to government lecturer Sukhdev Singh, Kaur lived a fulfilling life until tragedy struck in November 1992, when the police killed her father, husband, and son in staged encounters, denying her their bodies for last rites.\n\n> On October 31, 1992, Sulakhan Singh visited Kaur in Amritsar. The next morning, the police detained him and her husband at Sarhali police station under ASI Avtar Singh. Despite visits by family and teachers’ union members, their whereabouts became unknown after three days. Kaur sent telegrams and complaints to higher authorities, fearing foul play, but received no response.\n\n> Sukhdev Singh, then vice-principal of Government Senior Secondary School in Lopoke, Amritsar, was well-regarded. Even communist leaders Satpal and Vimla Dang, family friends, wrote to Punjab Chief Minister Beant Singh, who denied the men were in police custody.\n\n> In December 1992, the police claimed Kaur’s son, Baljinder Singh, was killed in an encounter but did not return his body.\n\n> In 1995, the Supreme Court ordered a CBI probe into the mass cremation of unidentified bodies by Punjab Police, exposed by human rights activist Jaswant Singh Khalra, who was also killed in a fake encounter. Kaur gave her statement to the CBI in 1996, leading to a case in 1997 against then-Sarhali SHO Surinderpal Singh and ASI Avtar Singh for abduction and criminal conspiracy. The CBI’s closure report in 2000 was rejected by a Patiala court, prompting further investigation.\n\n>In 2003, police personnel obtained Kaur’s signature on blank papers and later issued a death certificate for Sukhdev Singh, falsely claiming he died of a heart attack on July 7, 1993. “It was verbally conveyed that his body and that of Sulakhan Singh were thrown into the Harike Canal after torture,” said Sarabjit Singh Verka, human rights activist.\n\n> In 2009, the CBI filed a chargesheet, and charges were framed in 2016. However, ASI Avtar Singh died during the trial.\n\n>On Wednesday, CBI Special Judge Manjot Kaur convicted former Sarhali SHO Surinderpal Singh for kidnapping, illegal confinement, and criminal conspiracy to murder Sulakhan Singh and Sukhdev Singh. Singh is already serving life imprisonment in the Jaswant Singh Khalra murder case and 10 years in another case involving disappearances.\n\n>“I was bedridden in 2021 and didn’t expect to survive. I asked my family to request an early judgment. Somehow, I lived to hear it,” said Kaur. “This is a relief, though justice for killing a freedom fighter and his son-in-law is impossible. I still seek justice for my son, but perhaps it’s not meant for this life.”\n\n> Under National Human Rights Commission orders, Kaur received compensation for her son’s killing.",
        "Also, In a recent filing by CBI told Punjab & Haryana High Court that to investigate **[6733 extra judicial killings (custodial & encounters)](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544)** is not feasible, even we know the number is way higher.",
        "It almost seems like indian rulers are just as brutal if not far far brutal than the british rulers.",
        "That's true. And looks like this post didn't get the reach the others get.",
        "Many sikh youths were abducted and killed by the central government between 1990-1993. \n\nJaswant Singh Khalra tried asking about these missing youths to the then in power state and centre governments but unfortunately he was silenced and killed the same way, body never to be seen. \n\n** Diljit Dosanjh tried to release a movie on Jaswant Singh's life last year and guess what? It was never approved and blocked by the higher authorities \". \n\nHere is a music video dedicated to the lost sons of Punjab, \n\n[Video](https://youtu.be/PQFTwE_4CcM?si=HVldxsiorTqlS0_P)",
        "If Bhindrawala was a Hindu + Jaat, half of hindu demographic would have made him 11th avataar of Vishnu.....",
        "He was Jatt which is equivalent to jaat. Coz same caste just different religion. Plus he actually fought the case from hindu side when ramyan was burned in kapurthala. Dude had good history with hindus and believe maintaining good relations with hindus unlike some other leaders who came after him and  blamed every hindu for bhindrawala death.",
        "Well in that case, this shows how much of a backstabbing mentality these Hindus have. \n\nHoly fuck! All hindus are born with this \"backstabbing mentality\"..... History is a testament to this.\n\nIt all makes sense."
    ],
    "cleaned_text": "lost freedom fighter father lecturer husband son police encounters yearold says stayed alive get justice wednesday cbi special judge manjot kaur convicted former sarhali sho surinderpal singh kidnapping illegal confinement criminal conspiracy murder sulakhan singh sukhdev singh ",
    "cleaned_title": "lost freedom fighter father lecturer husband son police encounters yearold says stayed alive get justice",
    "cleaned_selftext": "wednesday cbi special judge manjot kaur convicted former sarhali sho surinderpal singh kidnapping illegal confinement criminal conspiracy murder sulakhan singh sukhdev singh",
    "cleaned_comments": "indian liberals right wings love ask sikhs forgive indian authorities mistakes hindus india would ashes today article day born sukhwant kaurs father sulakhan singh lahore jail part indias freedom movement eightytwoyearold sukhwant kaur witnessed partition india pakistan child surviving bloodbath reach newly created india father later recognised freedom fighter family settled bhakna village amritsar kaur became first student school started gadar party founder sohan singh bhakna close associate father married government lecturer sukhdev singh kaur lived fulfilling life tragedy struck november police killed father husband son staged encounters denying bodies last rites october sulakhan singh visited kaur amritsar next morning police detained husband sarhali police station asi avtar singh despite visits family teachers union members whereabouts became unknown three days kaur sent telegrams complaints higher authorities fearing foul play received response sukhdev singh viceprincipal government senior secondary school lopoke amritsar wellregarded even communist leaders satpal vimla dang family friends wrote punjab chief minister beant singh denied men police custody december police claimed kaurs son baljinder singh killed encounter return body supreme court ordered cbi probe mass cremation unidentified bodies punjab police exposed human rights activist jaswant singh khalra also killed fake encounter kaur gave statement cbi leading case thensarhali sho surinderpal singh asi avtar singh abduction criminal conspiracy cbis closure report rejected patiala court prompting investigation police personnel obtained kaurs signature blank papers later issued death certificate sukhdev singh falsely claiming died heart attack july verbally conveyed body sulakhan singh thrown harike canal torture said sarabjit singh verka human rights activist cbi filed chargesheet charges framed however asi avtar singh died trial wednesday cbi special judge manjot kaur convicted former sarhali sho surinderpal singh kidnapping illegal confinement criminal conspiracy murder sulakhan singh sukhdev singh singh already serving life imprisonment jaswant singh khalra murder case years another case involving disappearances bedridden didnt expect survive asked family request early judgment somehow lived hear said kaur relief though justice killing freedom fighter soninlaw impossible still seek justice son perhaps meant life national human rights commission orders kaur received compensation sons killing also recent filing cbi told punjab haryana high court investigate extra judicial killings custodial encountershttpswwwlivelawinhighcourtpunjabandharyanahighcourtpunjabharyanahighcourtenforceddisappearanceencounterkillingsinpunjabduringincidentsdecadesoldnoeyewitnessinitiationofinvestigationnotfeasible feasible even know number way higher almost seems like indian rulers brutal far far brutal british rulers thats true looks like post didnt get reach others get many sikh youths abducted killed central government jaswant singh khalra tried asking missing youths power state centre governments unfortunately silenced killed way body never seen diljit dosanjh tried release movie jaswant singhs life last year guess never approved blocked higher authorities music video dedicated lost sons punjab videohttpsyoutubepqftweccmsihvldxsiortqlsp bhindrawala hindu jaat half hindu demographic would made th avataar vishnu jatt equivalent jaat coz caste different religion plus actually fought case hindu side ramyan burned kapurthala dude good history hindus believe maintaining good relations hindus unlike leaders came blamed every hindu bhindrawala death well case shows much backstabbing mentality hindus holy fuck hindus born backstabbing mentality history testament makes sense",
    "light_cleaned_title": "Lost her freedom fighter father, lecturer husband, and son to police encounters, 82-year-old says she stayed alive to get justice",
    "light_cleaned_selftext": "On Wednesday, CBI Special Judge Manjot Kaur convicted former Sarhali SHO Surinderpal Singh for kidnapping, illegal confinement, and criminal conspiracy to murder Sulakhan Singh and Sukhdev Singh.",
    "light_cleaned_comments": "Indian liberals and right wings love to ask Sikhs to forgive indian authorities for their mistakes but had it been hindus India would be in ashes today ###From the article: > On the day she was born, Sukhwant Kaur’s father, Sulakhan Singh, was in Lahore Jail as part of India’s freedom movement. >Eighty-two-year-old Sukhwant Kaur witnessed the partition of India and Pakistan as a child, surviving the bloodbath to reach newly created India with her father, later recognised as a freedom fighter. The family settled in Bhakna village, Amritsar, in 1947, where Kaur became the first student at a school started by Gadar Party founder Sohan Singh Bhakna, a close associate of her father. >Married to government lecturer Sukhdev Singh, Kaur lived a fulfilling life until tragedy struck in November 1992, when the police killed her father, husband, and son in staged encounters, denying her their bodies for last rites. > On October 31, 1992, Sulakhan Singh visited Kaur in Amritsar. The next morning, the police detained him and her husband at Sarhali police station under ASI Avtar Singh. Despite visits by family and teachers’ union members, their whereabouts became unknown after three days. Kaur sent telegrams and complaints to higher authorities, fearing foul play, but received no response. > Sukhdev Singh, then vice-principal of Government Senior Secondary School in Lopoke, Amritsar, was well-regarded. Even communist leaders Satpal and Vimla Dang, family friends, wrote to Punjab Chief Minister Beant Singh, who denied the men were in police custody. > In December 1992, the police claimed Kaur’s son, Baljinder Singh, was killed in an encounter but did not return his body. > In 1995, the Supreme Court ordered a CBI probe into the mass cremation of unidentified bodies by Punjab Police, exposed by human rights activist Jaswant Singh Khalra, who was also killed in a fake encounter. Kaur gave her statement to the CBI in 1996, leading to a case in 1997 against then-Sarhali SHO Surinderpal Singh and ASI Avtar Singh for abduction and criminal conspiracy. The CBI’s closure report in 2000 was rejected by a Patiala court, prompting further investigation. >In 2003, police personnel obtained Kaur’s signature on blank papers and later issued a death certificate for Sukhdev Singh, falsely claiming he died of a heart attack on July 7, 1993. “It was verbally conveyed that his body and that of Sulakhan Singh were thrown into the Harike Canal after torture,” said Sarabjit Singh Verka, human rights activist. > In 2009, the CBI filed a chargesheet, and charges were framed in 2016. However, ASI Avtar Singh died during the trial. >On Wednesday, CBI Special Judge Manjot Kaur convicted former Sarhali SHO Surinderpal Singh for kidnapping, illegal confinement, and criminal conspiracy to murder Sulakhan Singh and Sukhdev Singh. Singh is already serving life imprisonment in the Jaswant Singh Khalra murder case and 10 years in another case involving disappearances. >“I was bedridden in 2021 and didn’t expect to survive. I asked my family to request an early judgment. Somehow, I lived to hear it,” said Kaur. “This is a relief, though justice for killing a freedom fighter and his son-in-law is impossible. I still seek justice for my son, but perhaps it’s not meant for this life.” > Under National Human Rights Commission orders, Kaur received compensation for her son’s killing. Also, In a recent filing by CBI told Punjab & Haryana High Court that to investigate **[6733 extra judicial killings (custodial & encounters)](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544)** is not feasible, even we know the number is way higher. It almost seems like indian rulers are just as brutal if not far far brutal than the british rulers. That's true. And looks like this post didn't get the reach the others get. Many sikh youths were abducted and killed by the central government between 1990-1993. Jaswant Singh Khalra tried asking about these missing youths to the then in power state and centre governments but unfortunately he was silenced and killed the same way, body never to be seen. ** Diljit Dosanjh tried to release a movie on Jaswant Singh's life last year and guess what? It was never approved and blocked by the higher authorities \". Here is a music video dedicated to the lost sons of Punjab, [Video](https://youtu.be/PQFTwE_4CcM?si=HVldxsiorTqlS0_P) If Bhindrawala was a Hindu + Jaat, half of hindu demographic would have made him 11th avataar of Vishnu..... He was Jatt which is equivalent to jaat. Coz same caste just different religion. Plus he actually fought the case from hindu side when ramyan was burned in kapurthala. Dude had good history with hindus and believe maintaining good relations with hindus unlike some other leaders who came after him and blamed every hindu for bhindrawala death. Well in that case, this shows how much of a backstabbing mentality these Hindus have. Holy fuck! All hindus are born with this \"backstabbing mentality\"..... History is a testament to this. It all makes sense."
}