{
    "id": "14otn05",
    "title": "In a quest to know about my grand father's past.",
    "url": "https://i.redd.it/o532iqmr4l9b1.jpg",
    "selftext": "My grand father passed away at an age of 58 in 2003. I know very little about his past as he never spoke about it. Though he had several college degrees under his belt including a medical degree, he passed away as a broke farmer. I am his most loved grandchild and we had a very strong bond. All I knew was he had amazing collection of motor cycles, did multiple jobs and lost all his fortune to a large scale business Investment.\nAttached is his graduation picture from 1960s and I am wondering if any of you on reddit can identify some of the noble folks in this picture and if they still remember him and  can share any memory of him. Its been 20 years since we lost him, my grand mother who is still around will be thrilled to hear stories of him from his past living friends. Name of my grandpa is  late \" Mr.v singaih\" and he hails from state of Andhra pradesh. Thank you.",
    "flair": "AskIndia",
    "score": 9,
    "num_comments": 2,
    "created_utc": 1688318183.0,
    "convurl": "https://i.redd.it/o532iqmr4l9b1.jpg",
    "comments": [
        "I think you best bet would be on twitter. All the best in your search!",
        "Thanks"
    ],
    "cleaned_text": "quest know grand fathers past grand father passed away age know little past never spoke though several college degrees belt including medical degree passed away broke farmer loved grandchild strong bond knew amazing collection motor cycles multiple jobs lost fortune large scale business investment attached graduation picture wondering reddit identify noble folks picture still remember share memory years since lost grand mother still around thrilled hear stories past living friends name grandpa late mrv singaih hails state andhra pradesh thank ",
    "cleaned_title": "quest know grand fathers past",
    "cleaned_selftext": "grand father passed away age know little past never spoke though several college degrees belt including medical degree passed away broke farmer loved grandchild strong bond knew amazing collection motor cycles multiple jobs lost fortune large scale business investment attached graduation picture wondering reddit identify noble folks picture still remember share memory years since lost grand mother still around thrilled hear stories past living friends name grandpa late mrv singaih hails state andhra pradesh thank",
    "cleaned_comments": "think best bet would twitter best search thanks",
    "light_cleaned_title": "In a quest to know about my grand father's past.",
    "light_cleaned_selftext": "My grand father passed away at an age of 58 in 2003. I know very little about his past as he never spoke about it. Though he had several college degrees under his belt including a medical degree, he passed away as a broke farmer. I am his most loved grandchild and we had a very strong bond. All I knew was he had amazing collection of motor cycles, did multiple jobs and lost all his fortune to a large scale business Investment. Attached is his graduation picture from 1960s and I am wondering if any of you on reddit can identify some of the noble folks in this picture and if they still remember him and can share any memory of him. Its been 20 years since we lost him, my grand mother who is still around will be thrilled to hear stories of him from his past living friends. Name of my grandpa is late \" Mr.v singaih\" and he hails from state of Andhra pradesh. Thank you.",
    "light_cleaned_comments": "I think you best bet would be on twitter. All the best in your search! Thanks"
}