{
    "id": "19f1e4n",
    "title": "Another budget, another brief: Legislative Brief on Digital Rights for Budget Session 2024",
    "url": "https://www.reddit.com/r/india/comments/19f1e4n/another_budget_another_brief_legislative_brief_on/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/fv6u0xlooiec1.jpg?width=1000&format=pjpg&auto=webp&s=9bd359d86eb62c6c11ade27bebacea663c162c96\n\ntl;dr\n\nWe are pleased to share our [legislative brief](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/wa1b7ipq0aspuft/legislative_brief_2024_ZUaWY13B4r.pdf?ref=static.internetfreedom.in)  on digital rights for the Budget Session 2024 of the Indian Parliament –  a round-up of digital rights issues for parliamentarians to consider as  the session convenes on January 31, 2024. In the brief, we highlight  key areas of concern in the domains of digital and freedoms rights, data  privacy, data protection, censorship, and adjacent concerns, that  require extensive deliberation in both houses of the Parliament.\n\n## Introduction\n\nThe  Budget Session of the Indian Parliament will commence on January 31,  2024 and is expected to conclude on February 09, 2024, as per an [official](https://www.esic.gov.in/attachments/circularfile/6e766044ed2ff069ce10e04e5355ae66.pdf?ref=static.internetfreedom.in)  Office Memorandum released by the Government of India. The Interim  Budget for this financial year will be released on February 01, 2024 and  no question hour will be conducted on that day.\n\nThe previous  session of Parliament concluded on December 21, 2023, when both Houses  of Parliament adjourned sine die a day ahead of schedule. The Session  saw the introduction of 12 bills and the passage of 19 Bills by both the  Houses of Parliament. These include several key legislations, namely,  the Telecommunications Bill, 2023 (Telecom Bill, 2023) and the three  criminal reform bills. Read our Digital Rights Review of the winter  session [here](https://internetfreedom.in/winter-session-2023-review/?ref=static.internetfreedom.in). The second half of the Parliament Winter Session was particularly notable as the Lok Sabha saw a security breach, post which [100 MPs were suspended from the Lok Sabha and 46 from the Rajya Sabha](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in), accounting for 19% of the strength of each House. This is the highest number of suspensions in the [history of Parliament](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in)  so far. Strikingly, the suspended MPs all belonged to the opposition  parties, which consequently led to the passage of above mentioned  crucial bills in both Houses with minimal debate and little to no inputs  from the opposition. Even though Lok Sabha [functioned](https://prsindia.org/sessiontrack/winter-session-2023/plan-performance?ref=static.internetfreedom.in)  for 74% of its scheduled time, and Rajya Sabha for 81%, the expedited  passage of significant legislations and the increased productivity was  influenced by the suspension of several Members of Parliament, leading  to swift approvals with limited deliberations and minimal input from the  opposition.\n\n## Summary of the Overall Analysis of the 2023-2024 Union Budget\n\nThe  Union Budget for Financial Year 2023-24, released on February 01, 2023,  cumulatively allotted ₹1.25 lakh crores to the National Health Mission  (NHM), the Ministry of Electronics and Information Technology (MeitY),  the Ministry of Information and Broadcasting (MIB), the Department of  Telecommunications (DoT), and Ministry of Home Affairs (MHA). Increased  allocations in the 2023-24 Budget as compared to the 2022-2023 Budget is  a positive sign. The budgetary allocation by MeitY has witnessed the  highest increase of 41.2%, however,  this increase is accompanied with  complete discontinuation of fund allocation towards PMGDISHA, which is a  rural digital literacy scheme. Furthermore, the trend of decreasing  fund allocation in revised estimates and under-utilisation of funds in  2022-2023 is a cause of worry. It remains to be seen if the same trend  will be witnessed in the FY 2023-2024. It is also worrying to note a  decreasing trend in the MHA budget allocation for Cyber Crime Prevention  against Women and Children and Miscellaneous Schemes. Read more on our  Analysis of the Union Budget 2023-2024 [here](https://internetfreedom.in/budget-2023-2024/?ref=static.internetfreedom.in).\n\n## Potential issues to be deliberated upon in the upcoming session\n\n1. **Challenges and Concerns: Delays, Mystery, and Shortcomings in the Digital Personal Data Protection Rules and Act:** The  Digital Personal Data Protection (“DPDP”) Act was passed without  adequate public consultation or due consideration to parliamentary rules  and procedure. The Act has several deficiencies, such as vague or  indefinite provisions, excessive delegated legislation in the absence of  relevant safeguards, weak notice requirements for data sharing, storage  or transfer, and allows for processing of data without consent “certain  legitimate uses” which are left inadequately defined. [Reportedly](https://www.hindustantimes.com/india-news/draft-rules-under-privacy-law-almost-ready-it-minister-101698431489684.html?ref=static.internetfreedom.in) around 21 draft rules under the DPDPA, 2023 will be released for a 45-day public consultation. Where MeitY [invited](https://drive.google.com/file/d/1TmwiMv_MSpZnkk-XljdJeln5f4WZcNPc/view?ref=static.internetfreedom.in)  feedback and public comments on the 24-page draft DPDP Bill, 2022 for  30 days, a 45-day consultation period for 21 draft rules that will give  the parent legislation substantive and procedural teeth is highly  inadequate and requires reconsideration.\n2. **Presidential Approval Grants Official Status to Criminal Reform Laws as Acts of Parliament:**  Three bills overhauling current Indian criminal laws were passed by  both houses of the Parliament in the 2023 Winter Session, and received  Presidential assent on December 25, 2023. The bills contain several  provisions that threaten the fundamental rights to privacy and free  speech. Provisions of the bill attempt to digitise many aspects of  criminal procedure, and include ‘digital evidence’ under the ambit of  the evidence law, without outlining procedural safeguards. Though the  word ‘sedition’ has been deleted from the law, the concept is retained  through vague provisions, which leaves room for arbitrary application.  Executive powers pertaining to search and seizure of digital evidence  have also been broadened. The review and recommendations of the  Parliamentary Committee on Home Affairs on the bills did not adequately  address these shortcomings.\n3. **Preserving Colonial Perspectives: Analysis of the Telecommunication Act’s Retention of Antiquated Approaches:** The  draft Indian Telecommunication Bill (\"Telecom Bill”), 2023 was passed  in the 2023 Winter Session within three days of introduction after  minimal discussion. The Telecommunications Act, 2023 echoes the language  and choices employed in the colonial Telegraph Act, 1885 and empowers  the government to pause transmission and intercept messages \"during  public emergencies to prevent incitement for committing offenses\" on the  broad grounds of public safety. There is also uncertainty regarding the  applicability of the Act to “Over-the-Top” (“OTT”) communication  services like WhatsApp. The Act allows for excessive surveillance and  suspension of internet services without adequate accountability,  oversight, or necessary procedural safeguards. It misses a huge  opportunity to reform the telecommunication sector and create a  rights-centric law that protects user rights instead of infringing on  it.\n4. **The draft Broadcasting Services (Regulation) Bill, 2023 raises concerns for online free speech:** The  MIB released the Broadcasting Services (Regulation) Bill, 2023  (“Broadcasting Bill”) for public consultation on November 10 and  accepted comments till January 15, 2024. The draft bill includes  “Over-the-Top” (“OTT”) content & digital news published by  individuals under the regulatory ambit raising concerns for online free  speech and journalistic freedom. Exerting executive control over “OTT”  content will lead to over-compliance and self-censorship on part of  platforms, who will be keen to avoid the wide discretion allowed to the  government when it comes to punishments. Risks around censorship of  speech expressing satire, irony, sarcasm, dissent, anger, even maybe  portrayals of facts and hard-hitting truth which is unpalatable to the  Union government or politically influential and powerful communities,  may become formalised if the Broadcasting Bill becomes a law of  parliament. \n5. **Rushed intervention for tackling the issue of Deepfakes must be revisited:** In December 2023, MeitY issued an [advisory](https://pib.gov.in/PressReleseDetailm.aspx?PRID=1990542&ref=static.internetfreedom.in)  to all intermediaries urging them to follow the due diligence  obligations listed under the notified Information Technology  (Intermediary Guidelines and Digital Media Ethics Code) Amendment Rules,  2023 (IT Rules, 2023). This formal advisory as well as several other  notices sent to intermediaries reiterated the need to take proactive  steps to curb ‘online harms’ on the internet, particularly the rising  instances of [deepfakes](https://economictimes.indiatimes.com/tech/technology/deepfake-menace-govt-issues-advisory-to-intermediaries-to-comply-with-existing-it-rules/articleshow/106297813.cms?ref=static.internetfreedom.in).  In early January 2024, reports surfaced that MeitY is considering  amending the IT Rules, 2021 to explicitly define deepfakes and mandate  intermediaries to make \"reasonable efforts\" to avoid hosting them. The  media coverage of informal statements by Ministers and unnamed officials  around the approach to tackle deepfakes has generated confusion and  raised concerns about hasty and superficial interventions. Pursuing  rushed policy or regulatory actions based on a few closed-door meetings  with technology platforms without engaging in a broader  multi-stakeholder consultation may become counter-productive. \n6. **Social impact of emerging technologies:** State  and union governments are deploying artificial intelligence (“AI”) on a  large scale across sectors, spanning uses in urban administration,  policing, surveillance, and welfare service delivery, to name a few. The  deployment manifestly lacks transparency. State and union governments  often do not make public the accuracy assessments or reports of the  technologies they use across sectors. They do not reveal adequate  information about the usage in the press releases or tenders. Research [recommends](https://www.thehindubusinessline.com/opinion/can-ai-ever-be-truly-free-from-bias/article66210937.ece?ref=static.internetfreedom.in)  that artificial intelligence, in its present form, should not be used  in welfare service delivery like they currently are – as the datasets  are often not free from bias. The manner of rapid and opaque deployment  of AI in public sectors suggests that state and union governments may be  using emerging technologies as “snake oil”, where an increasing number  of interventions are being labelled “AI-powered” without evidence.  Additionally, some government initiatives such as using AI to detect  distress on people’s faces or fatigue in drivers’ eyes, are not based in  science, as AI globally does not yet possess the ability to do so. At  this stage, the use of emerging technologies in the public sector must  stop or, at the least, be severely restricted, especially in the absence  of research and understanding on AI technology. \n\n## There’s this and much more in our Legislative Brief\n\nThis  is a sneak peek at some of the issues we have covered in-depth in our  brief, including data on telecom and internet connectivity; statistics  on implementation of schemes; details on key areas of digital governance  such as public consultations, privacy and data protection, free speech,  access to internet, and surveillance. For more analysis, statistics,  and insight into future legislative developments related to digital  rights, see [here](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/wa1b7ipq0aspuft/legislative_brief_2024_ZUaWY13B4r.pdf?ref=static.internetfreedom.in)!  \n\n\n Join us on our journey. Become an [IFF member](https://internetfreedom.in/donate/)!   \n",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 0,
    "created_utc": 1706158564.0,
    "convurl": "https://a.thumbs.redditmedia.com/aLdnwVLGBjn2ToBVc9TXIFB4c1VZGOaH7cZGnpfT240.jpg",
    "comments": [],
    "cleaned_text": "another budget another brief legislative brief digital rights budget session xb tldr pleased share legislative briefhttpscontentinternetfreedominapifilesdivcoywedtrpewabipqaspuftlegislativebriefzuawybrpdfrefstaticinternetfreedomin digital rights budget session indian parliament roundup digital rights issues parliamentarians consider session convenes january brief highlight key areas concern domains digital freedoms rights data privacy data protection censorship adjacent concerns require extensive deliberation houses parliament introduction budget session indian parliament commence january expected conclude february per officialhttpswwwesicgovinattachmentscircularfileeedffceeeaepdfrefstaticinternetfreedomin office memorandum released government india interim budget financial year released february question hour conducted day previous session parliament concluded december houses parliament adjourned sine die day ahead schedule session saw introduction bills passage bills houses parliament include several key legislations namely telecommunications bill telecom bill three criminal reform bills read digital rights review winter session herehttpsinternetfreedominwintersessionreviewrefstaticinternetfreedomin second half parliament winter session particularly notable lok sabha saw security breach post mps suspended lok sabha rajya sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin accounting strength house highest number suspensions history parliamenthttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin far strikingly suspended mps belonged opposition parties consequently led passage mentioned crucial bills houses minimal debate little inputs opposition even though lok sabha functionedhttpsprsindiaorgsessiontrackwintersessionplanperformancerefstaticinternetfreedomin scheduled time rajya sabha expedited passage significant legislations increased productivity influenced suspension several members parliament leading swift approvals limited deliberations minimal input opposition summary overall analysis union budget union budget financial year released february cumulatively allotted lakh crores national health mission nhm ministry electronics information technology meity ministry information broadcasting mib department telecommunications dot ministry home affairs mha increased allocations budget compared budget positive sign budgetary allocation meity witnessed highest increase however increase accompanied complete discontinuation fund allocation towards pmgdisha rural digital literacy scheme furthermore trend decreasing fund allocation revised estimates underutilisation funds cause worry remains seen trend witnessed fy also worrying note decreasing trend mha budget allocation cyber crime prevention women children miscellaneous schemes read analysis union budget herehttpsinternetfreedominbudgetrefstaticinternetfreedomin potential issues deliberated upon upcoming session challenges concerns delays mystery shortcomings digital personal data protection rules act digital personal data protection dpdp act passed without adequate public consultation due consideration parliamentary rules procedure act several deficiencies vague indefinite provisions excessive delegated legislation absence relevant safeguards weak notice requirements data sharing storage transfer allows processing data without consent certain legitimate uses left inadequately defined reportedlyhttpswwwhindustantimescomindianewsdraftrulesunderprivacylawalmostreadyitministerhtmlrefstaticinternetfreedomin around draft rules dpdpa released day public consultation meity invitedhttpsdrivegooglecomfiledtmwimvmspznkkxljdjelnfwzcnpcviewrefstaticinternetfreedomin feedback public comments page draft dpdp bill days day consultation period draft rules give parent legislation substantive procedural teeth highly inadequate requires reconsideration presidential approval grants official status criminal reform laws acts parliament three bills overhauling current indian criminal laws passed houses parliament winter session received presidential assent december bills contain several provisions threaten fundamental rights privacy free speech provisions bill attempt digitise many aspects criminal procedure include digital evidence ambit evidence law without outlining procedural safeguards though word sedition deleted law concept retained vague provisions leaves room arbitrary application executive powers pertaining search seizure digital evidence also broadened review recommendations parliamentary committee home affairs bills adequately address shortcomings preserving colonial perspectives analysis telecommunication acts retention antiquated approaches draft indian telecommunication bill telecom bill passed winter session within three days introduction minimal discussion telecommunications act echoes language choices employed colonial telegraph act empowers government pause transmission intercept messages public emergencies prevent incitement committing offenses broad grounds public safety also uncertainty regarding applicability act overthetop ott communication services like whatsapp act allows excessive surveillance suspension internet services without adequate accountability oversight necessary procedural safeguards misses huge opportunity reform telecommunication sector create rightscentric law protects user rights instead infringing draft broadcasting services regulation bill raises concerns online free speech mib released broadcasting services regulation bill broadcasting bill public consultation november accepted comments till january draft bill includes overthetop ott content digital news published individuals regulatory ambit raising concerns online free speech journalistic freedom exerting executive control ott content lead overcompliance selfcensorship part platforms keen avoid wide discretion allowed government comes punishments risks around censorship speech expressing satire irony sarcasm dissent anger even maybe portrayals facts hardhitting truth unpalatable union government politically influential powerful communities may become formalised broadcasting bill becomes law parliament rushed intervention tackling issue deepfakes must revisited december meity issued advisoryhttpspibgovinpressrelesedetailmaspxpridrefstaticinternetfreedomin intermediaries urging follow due diligence obligations listed notified information technology intermediary guidelines digital media ethics code amendment rules rules formal advisory well several notices sent intermediaries reiterated need take proactive steps curb online harms internet particularly rising instances deepfakeshttpseconomictimesindiatimescomtechtechnologydeepfakemenacegovtissuesadvisorytointermediariestocomplywithexistingitrulesarticleshowcmsrefstaticinternetfreedomin early january reports surfaced meity considering amending rules explicitly define deepfakes mandate intermediaries make reasonable efforts avoid hosting media coverage informal statements ministers unnamed officials around approach tackle deepfakes generated confusion raised concerns hasty superficial interventions pursuing rushed policy regulatory actions based closeddoor meetings technology platforms without engaging broader multistakeholder consultation may become counterproductive social impact emerging technologies state union governments deploying artificial intelligence ai large scale across sectors spanning uses urban administration policing surveillance welfare service delivery name deployment manifestly lacks transparency state union governments often make public accuracy assessments reports technologies use across sectors reveal adequate information usage press releases tenders research recommendshttpswwwthehindubusinesslinecomopinioncanaieverbetrulyfreefrombiasarticleecerefstaticinternetfreedomin artificial intelligence present form used welfare service delivery like currently datasets often free bias manner rapid opaque deployment ai public sectors suggests state union governments may using emerging technologies snake oil increasing number interventions labelled aipowered without evidence additionally government initiatives using ai detect distress peoples faces fatigue drivers eyes based science ai globally yet possess ability stage use emerging technologies public sector must stop least severely restricted especially absence research understanding ai technology theres much legislative brief sneak peek issues covered indepth brief including data telecom internet connectivity statistics implementation schemes details key areas digital governance public consultations privacy data protection free speech access internet surveillance analysis statistics insight future legislative developments related digital rights see herehttpscontentinternetfreedominapifilesdivcoywedtrpewabipqaspuftlegislativebriefzuawybrpdfrefstaticinternetfreedomin join us journey become iff memberhttpsinternetfreedomindonate ",
    "cleaned_title": "another budget another brief legislative brief digital rights budget session",
    "cleaned_selftext": "xb tldr pleased share legislative briefhttpscontentinternetfreedominapifilesdivcoywedtrpewabipqaspuftlegislativebriefzuawybrpdfrefstaticinternetfreedomin digital rights budget session indian parliament roundup digital rights issues parliamentarians consider session convenes january brief highlight key areas concern domains digital freedoms rights data privacy data protection censorship adjacent concerns require extensive deliberation houses parliament introduction budget session indian parliament commence january expected conclude february per officialhttpswwwesicgovinattachmentscircularfileeedffceeeaepdfrefstaticinternetfreedomin office memorandum released government india interim budget financial year released february question hour conducted day previous session parliament concluded december houses parliament adjourned sine die day ahead schedule session saw introduction bills passage bills houses parliament include several key legislations namely telecommunications bill telecom bill three criminal reform bills read digital rights review winter session herehttpsinternetfreedominwintersessionreviewrefstaticinternetfreedomin second half parliament winter session particularly notable lok sabha saw security breach post mps suspended lok sabha rajya sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin accounting strength house highest number suspensions history parliamenthttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin far strikingly suspended mps belonged opposition parties consequently led passage mentioned crucial bills houses minimal debate little inputs opposition even though lok sabha functionedhttpsprsindiaorgsessiontrackwintersessionplanperformancerefstaticinternetfreedomin scheduled time rajya sabha expedited passage significant legislations increased productivity influenced suspension several members parliament leading swift approvals limited deliberations minimal input opposition summary overall analysis union budget union budget financial year released february cumulatively allotted lakh crores national health mission nhm ministry electronics information technology meity ministry information broadcasting mib department telecommunications dot ministry home affairs mha increased allocations budget compared budget positive sign budgetary allocation meity witnessed highest increase however increase accompanied complete discontinuation fund allocation towards pmgdisha rural digital literacy scheme furthermore trend decreasing fund allocation revised estimates underutilisation funds cause worry remains seen trend witnessed fy also worrying note decreasing trend mha budget allocation cyber crime prevention women children miscellaneous schemes read analysis union budget herehttpsinternetfreedominbudgetrefstaticinternetfreedomin potential issues deliberated upon upcoming session challenges concerns delays mystery shortcomings digital personal data protection rules act digital personal data protection dpdp act passed without adequate public consultation due consideration parliamentary rules procedure act several deficiencies vague indefinite provisions excessive delegated legislation absence relevant safeguards weak notice requirements data sharing storage transfer allows processing data without consent certain legitimate uses left inadequately defined reportedlyhttpswwwhindustantimescomindianewsdraftrulesunderprivacylawalmostreadyitministerhtmlrefstaticinternetfreedomin around draft rules dpdpa released day public consultation meity invitedhttpsdrivegooglecomfiledtmwimvmspznkkxljdjelnfwzcnpcviewrefstaticinternetfreedomin feedback public comments page draft dpdp bill days day consultation period draft rules give parent legislation substantive procedural teeth highly inadequate requires reconsideration presidential approval grants official status criminal reform laws acts parliament three bills overhauling current indian criminal laws passed houses parliament winter session received presidential assent december bills contain several provisions threaten fundamental rights privacy free speech provisions bill attempt digitise many aspects criminal procedure include digital evidence ambit evidence law without outlining procedural safeguards though word sedition deleted law concept retained vague provisions leaves room arbitrary application executive powers pertaining search seizure digital evidence also broadened review recommendations parliamentary committee home affairs bills adequately address shortcomings preserving colonial perspectives analysis telecommunication acts retention antiquated approaches draft indian telecommunication bill telecom bill passed winter session within three days introduction minimal discussion telecommunications act echoes language choices employed colonial telegraph act empowers government pause transmission intercept messages public emergencies prevent incitement committing offenses broad grounds public safety also uncertainty regarding applicability act overthetop ott communication services like whatsapp act allows excessive surveillance suspension internet services without adequate accountability oversight necessary procedural safeguards misses huge opportunity reform telecommunication sector create rightscentric law protects user rights instead infringing draft broadcasting services regulation bill raises concerns online free speech mib released broadcasting services regulation bill broadcasting bill public consultation november accepted comments till january draft bill includes overthetop ott content digital news published individuals regulatory ambit raising concerns online free speech journalistic freedom exerting executive control ott content lead overcompliance selfcensorship part platforms keen avoid wide discretion allowed government comes punishments risks around censorship speech expressing satire irony sarcasm dissent anger even maybe portrayals facts hardhitting truth unpalatable union government politically influential powerful communities may become formalised broadcasting bill becomes law parliament rushed intervention tackling issue deepfakes must revisited december meity issued advisoryhttpspibgovinpressrelesedetailmaspxpridrefstaticinternetfreedomin intermediaries urging follow due diligence obligations listed notified information technology intermediary guidelines digital media ethics code amendment rules rules formal advisory well several notices sent intermediaries reiterated need take proactive steps curb online harms internet particularly rising instances deepfakeshttpseconomictimesindiatimescomtechtechnologydeepfakemenacegovtissuesadvisorytointermediariestocomplywithexistingitrulesarticleshowcmsrefstaticinternetfreedomin early january reports surfaced meity considering amending rules explicitly define deepfakes mandate intermediaries make reasonable efforts avoid hosting media coverage informal statements ministers unnamed officials around approach tackle deepfakes generated confusion raised concerns hasty superficial interventions pursuing rushed policy regulatory actions based closeddoor meetings technology platforms without engaging broader multistakeholder consultation may become counterproductive social impact emerging technologies state union governments deploying artificial intelligence ai large scale across sectors spanning uses urban administration policing surveillance welfare service delivery name deployment manifestly lacks transparency state union governments often make public accuracy assessments reports technologies use across sectors reveal adequate information usage press releases tenders research recommendshttpswwwthehindubusinesslinecomopinioncanaieverbetrulyfreefrombiasarticleecerefstaticinternetfreedomin artificial intelligence present form used welfare service delivery like currently datasets often free bias manner rapid opaque deployment ai public sectors suggests state union governments may using emerging technologies snake oil increasing number interventions labelled aipowered without evidence additionally government initiatives using ai detect distress peoples faces fatigue drivers eyes based science ai globally yet possess ability stage use emerging technologies public sector must stop least severely restricted especially absence research understanding ai technology theres much legislative brief sneak peek issues covered indepth brief including data telecom internet connectivity statistics implementation schemes details key areas digital governance public consultations privacy data protection free speech access internet surveillance analysis statistics insight future legislative developments related digital rights see herehttpscontentinternetfreedominapifilesdivcoywedtrpewabipqaspuftlegislativebriefzuawybrpdfrefstaticinternetfreedomin join us journey become iff memberhttpsinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "Another budget, another brief: Legislative Brief on Digital Rights for Budget Session 2024",
    "light_cleaned_selftext": "&#x200B; tl;dr We are pleased to share our [legislative brief](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/wa1b7ipq0aspuft/legislative_brief_2024_ZUaWY13B4r.pdf?ref=static.internetfreedom.in) on digital rights for the Budget Session 2024 of the Indian Parliament – a round-up of digital rights issues for parliamentarians to consider as the session convenes on January 31, 2024. In the brief, we highlight key areas of concern in the domains of digital and freedoms rights, data privacy, data protection, censorship, and adjacent concerns, that require extensive deliberation in both houses of the Parliament. ## Introduction The Budget Session of the Indian Parliament will commence on January 31, 2024 and is expected to conclude on February 09, 2024, as per an [official](https://www.esic.gov.in/attachments/circularfile/6e766044ed2ff069ce10e04e5355ae66.pdf?ref=static.internetfreedom.in) Office Memorandum released by the Government of India. The Interim Budget for this financial year will be released on February 01, 2024 and no question hour will be conducted on that day. The previous session of Parliament concluded on December 21, 2023, when both Houses of Parliament adjourned sine die a day ahead of schedule. The Session saw the introduction of 12 bills and the passage of 19 Bills by both the Houses of Parliament. These include several key legislations, namely, the Telecommunications Bill, 2023 (Telecom Bill, 2023) and the three criminal reform bills. Read our Digital Rights Review of the winter session [here](https://internetfreedom.in/winter-session-2023-review/?ref=static.internetfreedom.in). The second half of the Parliament Winter Session was particularly notable as the Lok Sabha saw a security breach, post which [100 MPs were suspended from the Lok Sabha and 46 from the Rajya Sabha](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in), accounting for 19% of the strength of each House. This is the highest number of suspensions in the [history of Parliament](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in) so far. Strikingly, the suspended MPs all belonged to the opposition parties, which consequently led to the passage of above mentioned crucial bills in both Houses with minimal debate and little to no inputs from the opposition. Even though Lok Sabha [functioned](https://prsindia.org/sessiontrack/winter-session-2023/plan-performance?ref=static.internetfreedom.in) for 74% of its scheduled time, and Rajya Sabha for 81%, the expedited passage of significant legislations and the increased productivity was influenced by the suspension of several Members of Parliament, leading to swift approvals with limited deliberations and minimal input from the opposition. ## Summary of the Overall Analysis of the 2023-2024 Union Budget The Union Budget for Financial Year 2023-24, released on February 01, 2023, cumulatively allotted ₹1.25 lakh crores to the National Health Mission (NHM), the Ministry of Electronics and Information Technology (MeitY), the Ministry of Information and Broadcasting (MIB), the Department of Telecommunications (DoT), and Ministry of Home Affairs (MHA). Increased allocations in the 2023-24 Budget as compared to the 2022-2023 Budget is a positive sign. The budgetary allocation by MeitY has witnessed the highest increase of 41.2%, however, this increase is accompanied with complete discontinuation of fund allocation towards PMGDISHA, which is a rural digital literacy scheme. Furthermore, the trend of decreasing fund allocation in revised estimates and under-utilisation of funds in 2022-2023 is a cause of worry. It remains to be seen if the same trend will be witnessed in the FY 2023-2024. It is also worrying to note a decreasing trend in the MHA budget allocation for Cyber Crime Prevention against Women and Children and Miscellaneous Schemes. Read more on our Analysis of the Union Budget 2023-2024 [here](https://internetfreedom.in/budget-2023-2024/?ref=static.internetfreedom.in). ## Potential issues to be deliberated upon in the upcoming session 1. **Challenges and Concerns: Delays, Mystery, and Shortcomings in the Digital Personal Data Protection Rules and Act:** The Digital Personal Data Protection (“DPDP”) Act was passed without adequate public consultation or due consideration to parliamentary rules and procedure. The Act has several deficiencies, such as vague or indefinite provisions, excessive delegated legislation in the absence of relevant safeguards, weak notice requirements for data sharing, storage or transfer, and allows for processing of data without consent “certain legitimate uses” which are left inadequately defined. [Reportedly](https://www.hindustantimes.com/india-news/draft-rules-under-privacy-law-almost-ready-it-minister-101698431489684.html?ref=static.internetfreedom.in) around 21 draft rules under the DPDPA, 2023 will be released for a 45-day public consultation. Where MeitY [invited](https://drive.google.com/file/d/1TmwiMv_MSpZnkk-XljdJeln5f4WZcNPc/view?ref=static.internetfreedom.in) feedback and public comments on the 24-page draft DPDP Bill, 2022 for 30 days, a 45-day consultation period for 21 draft rules that will give the parent legislation substantive and procedural teeth is highly inadequate and requires reconsideration. 2. **Presidential Approval Grants Official Status to Criminal Reform Laws as Acts of Parliament:** Three bills overhauling current Indian criminal laws were passed by both houses of the Parliament in the 2023 Winter Session, and received Presidential assent on December 25, 2023. The bills contain several provisions that threaten the fundamental rights to privacy and free speech. Provisions of the bill attempt to digitise many aspects of criminal procedure, and include ‘digital evidence’ under the ambit of the evidence law, without outlining procedural safeguards. Though the word ‘sedition’ has been deleted from the law, the concept is retained through vague provisions, which leaves room for arbitrary application. Executive powers pertaining to search and seizure of digital evidence have also been broadened. The review and recommendations of the Parliamentary Committee on Home Affairs on the bills did not adequately address these shortcomings. 3. **Preserving Colonial Perspectives: Analysis of the Telecommunication Act’s Retention of Antiquated Approaches:** The draft Indian Telecommunication Bill (\"Telecom Bill”), 2023 was passed in the 2023 Winter Session within three days of introduction after minimal discussion. The Telecommunications Act, 2023 echoes the language and choices employed in the colonial Telegraph Act, 1885 and empowers the government to pause transmission and intercept messages \"during public emergencies to prevent incitement for committing offenses\" on the broad grounds of public safety. There is also uncertainty regarding the applicability of the Act to “Over-the-Top” (“OTT”) communication services like WhatsApp. The Act allows for excessive surveillance and suspension of internet services without adequate accountability, oversight, or necessary procedural safeguards. It misses a huge opportunity to reform the telecommunication sector and create a rights-centric law that protects user rights instead of infringing on it. 4. **The draft Broadcasting Services (Regulation) Bill, 2023 raises concerns for online free speech:** The MIB released the Broadcasting Services (Regulation) Bill, 2023 (“Broadcasting Bill”) for public consultation on November 10 and accepted comments till January 15, 2024. The draft bill includes “Over-the-Top” (“OTT”) content & digital news published by individuals under the regulatory ambit raising concerns for online free speech and journalistic freedom. Exerting executive control over “OTT” content will lead to over-compliance and self-censorship on part of platforms, who will be keen to avoid the wide discretion allowed to the government when it comes to punishments. Risks around censorship of speech expressing satire, irony, sarcasm, dissent, anger, even maybe portrayals of facts and hard-hitting truth which is unpalatable to the Union government or politically influential and powerful communities, may become formalised if the Broadcasting Bill becomes a law of parliament. 5. **Rushed intervention for tackling the issue of Deepfakes must be revisited:** In December 2023, MeitY issued an [advisory](https://pib.gov.in/PressReleseDetailm.aspx?PRID=1990542&ref=static.internetfreedom.in) to all intermediaries urging them to follow the due diligence obligations listed under the notified Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Amendment Rules, 2023 (IT Rules, 2023). This formal advisory as well as several other notices sent to intermediaries reiterated the need to take proactive steps to curb ‘online harms’ on the internet, particularly the rising instances of [deepfakes](https://economictimes.indiatimes.com/tech/technology/deepfake-menace-govt-issues-advisory-to-intermediaries-to-comply-with-existing-it-rules/articleshow/106297813.cms?ref=static.internetfreedom.in). In early January 2024, reports surfaced that MeitY is considering amending the IT Rules, 2021 to explicitly define deepfakes and mandate intermediaries to make \"reasonable efforts\" to avoid hosting them. The media coverage of informal statements by Ministers and unnamed officials around the approach to tackle deepfakes has generated confusion and raised concerns about hasty and superficial interventions. Pursuing rushed policy or regulatory actions based on a few closed-door meetings with technology platforms without engaging in a broader multi-stakeholder consultation may become counter-productive. 6. **Social impact of emerging technologies:** State and union governments are deploying artificial intelligence (“AI”) on a large scale across sectors, spanning uses in urban administration, policing, surveillance, and welfare service delivery, to name a few. The deployment manifestly lacks transparency. State and union governments often do not make public the accuracy assessments or reports of the technologies they use across sectors. They do not reveal adequate information about the usage in the press releases or tenders. Research [recommends](https://www.thehindubusinessline.com/opinion/can-ai-ever-be-truly-free-from-bias/article66210937.ece?ref=static.internetfreedom.in) that artificial intelligence, in its present form, should not be used in welfare service delivery like they currently are – as the datasets are often not free from bias. The manner of rapid and opaque deployment of AI in public sectors suggests that state and union governments may be using emerging technologies as “snake oil”, where an increasing number of interventions are being labelled “AI-powered” without evidence. Additionally, some government initiatives such as using AI to detect distress on people’s faces or fatigue in drivers’ eyes, are not based in science, as AI globally does not yet possess the ability to do so. At this stage, the use of emerging technologies in the public sector must stop or, at the least, be severely restricted, especially in the absence of research and understanding on AI technology. ## There’s this and much more in our Legislative Brief This is a sneak peek at some of the issues we have covered in-depth in our brief, including data on telecom and internet connectivity; statistics on implementation of schemes; details on key areas of digital governance such as public consultations, privacy and data protection, free speech, access to internet, and surveillance. For more analysis, statistics, and insight into future legislative developments related to digital rights, see [here](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/wa1b7ipq0aspuft/legislative_brief_2024_ZUaWY13B4r.pdf?ref=static.internetfreedom.in)! Join us on our journey. Become an [IFF member](https://internetfreedom.in/donate/)!",
    "light_cleaned_comments": ""
}