{
    "id": "167kooi",
    "title": "What are some of your favorite (underrated ) youtube channels?",
    "url": "https://www.reddit.com/r/india/comments/167kooi/what_are_some_of_your_favorite_underrated_youtube/",
    "selftext": "As the title says.   \n\n\nI recently discovered this channel [Kazinama](https://www.youtube.com/@iamkazinama) which makes remix videos of old Hindi songs. I wonder what channels you guys subscribe to. It could be any kind of channel, not necessarily from India, just looking for some good recommendations from this thread!   \n\n\nAnother one of my favorite is [GeographyGeek](https://www.youtube.com/@GeographyGeek) for geography stuff. And then there is [PolyMatter](https://www.youtube.com/@PolyMatter), my absolutely favorite.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693606133.0,
    "convurl": "https://external-preview.redd.it/fzCc9fuQjmAhFfY-oxq13-MHgeRVPAo77lgCSo11-e8.jpg?auto=webp&s=f369316021ca277ef9fc1e65d315ed9b2cefc3fe",
    "comments": [],
    "cleaned_text": "favorite underrated youtube channels title says recently discovered channel kazinamahttpswwwyoutubecomiamkazinama makes remix videos old hindi songs wonder channels guys subscribe could kind channel necessarily india looking good recommendations thread another one favorite geographygeekhttpswwwyoutubecomgeographygeek geography stuff polymatterhttpswwwyoutubecompolymatter absolutely favorite ",
    "cleaned_title": "favorite underrated youtube channels",
    "cleaned_selftext": "title says recently discovered channel kazinamahttpswwwyoutubecomiamkazinama makes remix videos old hindi songs wonder channels guys subscribe could kind channel necessarily india looking good recommendations thread another one favorite geographygeekhttpswwwyoutubecomgeographygeek geography stuff polymatterhttpswwwyoutubecompolymatter absolutely favorite",
    "cleaned_comments": "",
    "light_cleaned_title": "What are some of your favorite (underrated ) youtube channels?",
    "light_cleaned_selftext": "As the title says. I recently discovered this channel [Kazinama](https://www.youtube.com/@iamkazinama) which makes remix videos of old Hindi songs. I wonder what channels you guys subscribe to. It could be any kind of channel, not necessarily from India, just looking for some good recommendations from this thread! Another one of my favorite is [GeographyGeek](https://www.youtube.com/@GeographyGeek) for geography stuff. And then there is [PolyMatter](https://www.youtube.com/@PolyMatter), my absolutely favorite.",
    "light_cleaned_comments": ""
}