{
    "id": "12kua6h",
    "title": "Why is yogi setting up selective encounter state?",
    "url": "https://www.reddit.com/r/india/comments/12kua6h/why_is_yogi_setting_up_selective_encounter_state/",
    "selftext": "I mean encounter of anyone is wrong . Court process should be followed. But even if we justify encounter, why are they being selective? Why only some people associated with Samajwadi Party (Vikas Dubey, Atiq Ahmed son) are encountered and rest are free?\n\n1. In lakhimpur kheri, SIT clearly told it was pre planned act. Ashish mishra was not encountered. Police didnt even dare to arrest. Only after court sent order, then govt arrested him. Now he has been released on bail.\n\n[https://timesofindia.indiatimes.com/india/lakhimpur-kheri-incident-was-well-planned-conspiracy-sit/articleshow/88271947.cms](https://timesofindia.indiatimes.com/india/lakhimpur-kheri-incident-was-well-planned-conspiracy-sit/articleshow/88271947.cms)\n\n2) Brij bhushan singh shamelessly confessed to murder on national tv. He is now wrestling federation president. Not even arrested . Recently , wrestler phogat told that he has harassed several women wrestlers. Media tried to hide the matter. How is this criminal different from other?\n\n[https://twitter.com/rohini\\_sgh/status/1616260381940518912?s=20](https://twitter.com/rohini_sgh/status/1616260381940518912?s=20)  **(he said this on live tv)**\n\n3) Killers of police officer subodh kumar singh . They were facilitated by govt , forget about punishing\n\n[https://www.newsclick.in/Bulandshahr-Violence-7-Accused-Out-Bail-Receive-Heroic-Welcome](https://www.newsclick.in/Bulandshahr-Violence-7-Accused-Out-Bail-Receive-Heroic-Welcome) (received heroic welcome with garlands)\n\n[https://www.indiatoday.in/india/story/bulandshahr-mob-violence-2018-police-officer-murder-accused-appointed-promoter-pm-schemes-bjp-leader-1701963-2020-07-18](https://www.indiatoday.in/india/story/bulandshahr-mob-violence-2018-police-officer-murder-accused-appointed-promoter-pm-schemes-bjp-leader-1701963-2020-07-18)\n\nEven if u want to do encounter , then do it for every big criminal. This selective encounter thing will itself be dangerous precedent. What kind of message they are giving by letting one set of criminals being punished and other being free. If any other party comes to power, it will also misuse it.\n\nAlso I have not talked about **monu manesar, ram rahim(raped and killed 4 women)** and other criminals who are openly getting support from bjp and even z+security  . They are getting support from other bjp state governments.",
    "flair": "Politics",
    "score": 60,
    "num_comments": 29,
    "created_utc": 1681402398.0,
    "convurl": "https://external-preview.redd.it/2vrLQrecU37QK5vP1rMulxYoisT9Nm0DSIVHOyMHnZI.jpg?auto=webp&v=enabled&s=a654fb7bc9fef1c69595787148ed438d42bf0a0e",
    "comments": [
        "Vikas Dubey",
        "i have mentioned in my post. U didnt read it carefully . He (vikas dubey ) and atiq ahmed son were openly associated with Samajwadi Party. This is why they were encountered.\n\nI am talking about other set of criminals who are associated with bjp and have done heinous crimes. ( brij bhusan singh, ashish mishra, killers of inspector subodh singh, monu manesar, ram rahim and others). Not that these people are roaming free. One of them has confessed to murder on live tv.  Other has done 4 rapes and murders.\n\nyogi even protected kuldeep sengar. But after the girl family was killed (truck incident) and court interfered, then unnao rapist got justice.\n\nI just want to say , even if he wants to do encounters , then why to protect one set of criminals and kill other.",
        "Criminals are in power that's why. They will act against their competitors only. They don't want to terrorise the criminals in general.",
        "So true. Its not governance it's a gang war.",
        "This is a gang fight. They are eliminating people from the other gang. There isn't that much why to it.",
        "I genuinely want to know, why is encounter wrong? Specifically with the kind of judicial system we have, I’m ok if a few thugs like these are shot in the balls.\n\nI mean yogi might be targeting one side of thugs, but hey that’s one less thug for me. Someone will kill the other side too soon.",
        "Encounter killings have sadly been part of our society for a while now. And it does not help that the immoral middle class Indian thinks it is ok for police to kill a person because the \"system\" will not convict them. As long as they're Muslim or \"other\" - if the police told us they're guilty they deserve to die.\n\nYogi and Amit Shah in Gujarat do this because it is a two fold thing. One they get to operate the police essentially as another gang and get to use small time criminals to enforce their dirty work. And second, its a politically beneficial thing to encounter a Muslim or two every now and then to quench their votebase's bloodlust.",
        "If they could kill a criminal without due process, they can just as easily label an innocent person or someone who has dirt on them as a criminal and kill them without due process",
        "Encounter is wrong no other person have a right to kill another person. But the people who have been killed in mumbai or up. They were eventually a bad person. I will not say bad person but devil in disguise. So if politician are eliminating them. If it is in revenge or PR.I see no problem there,but problem will arise and that is policewala gundas.",
        "Eliminating the competition...mafia do it always",
        "Encounter is wrong, but killing an MLA and then the Witness is okay. \nKya foonkta hai bhai?",
        "when did i say killing mla and witness is right? Encounter has been termed wrong by supreme court as done in hyderabad case, where the people encountered were rapists.\n\nFor me, that person was a big mafia who used to kill innocent people and deserved to be punished.\n\nAs i mentioned , even if u want to do encounter, then why it is reserved only for one set of criminals which are associated with another party. By protecting ram rahim(raped and killed 4 women), brij bhushan(openly confessing to murder on national tv) , ashish mishra(police didnt arrest him until court interfered. SIT proved his crime , but now he is free).  All of them did heinous crimes. When u protect one set of criminals which are associated with ur party , then  u are hypocrite.",
        "innocent until proven guilty...\n\nsomeone can claim you are a thug and kill you, for another person it is one thug less, and you can't argue otherwise, because you are dead...",
        "What happens when a yogi equivalent wants the land your house is on for their profits",
        "The answer is obvious",
        "How long before they start killing people that they deem bad for themselves, their party, or their reputation. There's a reason we don't allow the police to be judge, jury, and executioner."
    ],
    "cleaned_text": "yogi setting selective encounter state mean encounter anyone wrong court process followed even justify encounter selective people associated samajwadi party vikas dubey atiq ahmed son encountered rest free lakhimpur kheri sit clearly told pre planned act ashish mishra encountered police didnt even dare arrest court sent order govt arrested released bail httpstimesofindiaindiatimescomindialakhimpurkheriincidentwaswellplannedconspiracysitarticleshowcmshttpstimesofindiaindiatimescomindialakhimpurkheriincidentwaswellplannedconspiracysitarticleshowcms brij bhushan singh shamelessly confessed murder national tv wrestling federation president even arrested recently wrestler phogat told harassed several women wrestlers media tried hide matter criminal different httpstwittercomrohinisghstatusshttpstwittercomrohinisghstatuss said live tv killers police officer subodh kumar singh facilitated govt forget punishing httpswwwnewsclickinbulandshahrviolenceaccusedoutbailreceiveheroicwelcomehttpswwwnewsclickinbulandshahrviolenceaccusedoutbailreceiveheroicwelcome received heroic welcome garlands httpswwwindiatodayinindiastorybulandshahrmobviolencepoliceofficermurderaccusedappointedpromoterpmschemesbjpleaderhttpswwwindiatodayinindiastorybulandshahrmobviolencepoliceofficermurderaccusedappointedpromoterpmschemesbjpleader even u want encounter every big criminal selective encounter thing dangerous precedent kind message giving letting one set criminals punished free party comes power also misuse also talked monu manesar ram rahimraped killed women criminals openly getting support bjp even zsecurity getting support bjp state governments ",
    "cleaned_title": "yogi setting selective encounter state",
    "cleaned_selftext": "mean encounter anyone wrong court process followed even justify encounter selective people associated samajwadi party vikas dubey atiq ahmed son encountered rest free lakhimpur kheri sit clearly told pre planned act ashish mishra encountered police didnt even dare arrest court sent order govt arrested released bail httpstimesofindiaindiatimescomindialakhimpurkheriincidentwaswellplannedconspiracysitarticleshowcmshttpstimesofindiaindiatimescomindialakhimpurkheriincidentwaswellplannedconspiracysitarticleshowcms brij bhushan singh shamelessly confessed murder national tv wrestling federation president even arrested recently wrestler phogat told harassed several women wrestlers media tried hide matter criminal different httpstwittercomrohinisghstatusshttpstwittercomrohinisghstatuss said live tv killers police officer subodh kumar singh facilitated govt forget punishing httpswwwnewsclickinbulandshahrviolenceaccusedoutbailreceiveheroicwelcomehttpswwwnewsclickinbulandshahrviolenceaccusedoutbailreceiveheroicwelcome received heroic welcome garlands httpswwwindiatodayinindiastorybulandshahrmobviolencepoliceofficermurderaccusedappointedpromoterpmschemesbjpleaderhttpswwwindiatodayinindiastorybulandshahrmobviolencepoliceofficermurderaccusedappointedpromoterpmschemesbjpleader even u want encounter every big criminal selective encounter thing dangerous precedent kind message giving letting one set criminals punished free party comes power also misuse also talked monu manesar ram rahimraped killed women criminals openly getting support bjp even zsecurity getting support bjp state governments",
    "cleaned_comments": "vikas dubey mentioned post u didnt read carefully vikas dubey atiq ahmed son openly associated samajwadi party encountered talking set criminals associated bjp done heinous crimes brij bhusan singh ashish mishra killers inspector subodh singh monu manesar ram rahim others people roaming free one confessed murder live tv done rapes murders yogi even protected kuldeep sengar girl family killed truck incident court interfered unnao rapist got justice want say even wants encounters protect one set criminals kill criminals power thats act competitors dont want terrorise criminals general true governance gang war gang fight eliminating people gang isnt much genuinely want know encounter wrong specifically kind judicial system im ok thugs like shot balls mean yogi might targeting one side thugs hey thats one less thug someone kill side soon encounter killings sadly part society help immoral middle class indian thinks ok police kill person system convict long theyre muslim police told us theyre guilty deserve die yogi amit shah gujarat two fold thing one get operate police essentially another gang get use small time criminals enforce dirty work second politically beneficial thing encounter muslim two every quench votebases bloodlust could kill criminal without due process easily label innocent person someone dirt criminal kill without due process encounter wrong person right kill another person people killed mumbai eventually bad person say bad person devil disguise politician eliminating revenge pri see problem therebut problem arise policewala gundas eliminating competitionmafia always encounter wrong killing mla witness okay kya foonkta hai bhai say killing mla witness right encounter termed wrong supreme court done hyderabad case people encountered rapists person big mafia used kill innocent people deserved punished mentioned even u want encounter reserved one set criminals associated another party protecting ram rahimraped killed women brij bhushanopenly confessing murder national tv ashish mishrapolice didnt arrest court interfered sit proved crime free heinous crimes u protect one set criminals associated ur party u hypocrite innocent proven guilty someone claim thug kill another person one thug less cant argue otherwise dead happens yogi equivalent wants land house profits answer obvious long start killing people deem bad party reputation theres reason dont allow police judge jury executioner",
    "light_cleaned_title": "Why is yogi setting up selective encounter state?",
    "light_cleaned_selftext": "I mean encounter of anyone is wrong . Court process should be followed. But even if we justify encounter, why are they being selective? Why only some people associated with Samajwadi Party (Vikas Dubey, Atiq Ahmed son) are encountered and rest are free? 1. In lakhimpur kheri, SIT clearly told it was pre planned act. Ashish mishra was not encountered. Police didnt even dare to arrest. Only after court sent order, then govt arrested him. Now he has been released on bail. [https://timesofindia.indiatimes.com/india/lakhimpur-kheri-incident-was-well-planned-conspiracy-sit/articleshow/88271947.cms](https://timesofindia.indiatimes.com/india/lakhimpur-kheri-incident-was-well-planned-conspiracy-sit/articleshow/88271947.cms) 2) Brij bhushan singh shamelessly confessed to murder on national tv. He is now wrestling federation president. Not even arrested . Recently , wrestler phogat told that he has harassed several women wrestlers. Media tried to hide the matter. How is this criminal different from other? [https://twitter.com/rohini\\_sgh/status/1616260381940518912?s=20](https://twitter.com/rohini_sgh/status/1616260381940518912?s=20) **(he said this on live tv)** 3) Killers of police officer subodh kumar singh . They were facilitated by govt , forget about punishing [https://www.newsclick.in/Bulandshahr-Violence-7-Accused-Out-Bail-Receive-Heroic-Welcome](https://www.newsclick.in/Bulandshahr-Violence-7-Accused-Out-Bail-Receive-Heroic-Welcome) (received heroic welcome with garlands) [https://www.indiatoday.in/india/story/bulandshahr-mob-violence-2018-police-officer-murder-accused-appointed-promoter-pm-schemes-bjp-leader-1701963-2020-07-18](https://www.indiatoday.in/india/story/bulandshahr-mob-violence-2018-police-officer-murder-accused-appointed-promoter-pm-schemes-bjp-leader-1701963-2020-07-18) Even if u want to do encounter , then do it for every big criminal. This selective encounter thing will itself be dangerous precedent. What kind of message they are giving by letting one set of criminals being punished and other being free. If any other party comes to power, it will also misuse it. Also I have not talked about **monu manesar, ram rahim(raped and killed 4 women)** and other criminals who are openly getting support from bjp and even z+security . They are getting support from other bjp state governments.",
    "light_cleaned_comments": "Vikas Dubey i have mentioned in my post. U didnt read it carefully . He (vikas dubey ) and atiq ahmed son were openly associated with Samajwadi Party. This is why they were encountered. I am talking about other set of criminals who are associated with bjp and have done heinous crimes. ( brij bhusan singh, ashish mishra, killers of inspector subodh singh, monu manesar, ram rahim and others). Not that these people are roaming free. One of them has confessed to murder on live tv. Other has done 4 rapes and murders. yogi even protected kuldeep sengar. But after the girl family was killed (truck incident) and court interfered, then unnao rapist got justice. I just want to say , even if he wants to do encounters , then why to protect one set of criminals and kill other. Criminals are in power that's why. They will act against their competitors only. They don't want to terrorise the criminals in general. So true. Its not governance it's a gang war. This is a gang fight. They are eliminating people from the other gang. There isn't that much why to it. I genuinely want to know, why is encounter wrong? Specifically with the kind of judicial system we have, I’m ok if a few thugs like these are shot in the balls. I mean yogi might be targeting one side of thugs, but hey that’s one less thug for me. Someone will kill the other side too soon. Encounter killings have sadly been part of our society for a while now. And it does not help that the immoral middle class Indian thinks it is ok for police to kill a person because the \"system\" will not convict them. As long as they're Muslim or \"other\" - if the police told us they're guilty they deserve to die. Yogi and Amit Shah in Gujarat do this because it is a two fold thing. One they get to operate the police essentially as another gang and get to use small time criminals to enforce their dirty work. And second, its a politically beneficial thing to encounter a Muslim or two every now and then to quench their votebase's bloodlust. If they could kill a criminal without due process, they can just as easily label an innocent person or someone who has dirt on them as a criminal and kill them without due process Encounter is wrong no other person have a right to kill another person. But the people who have been killed in mumbai or up. They were eventually a bad person. I will not say bad person but devil in disguise. So if politician are eliminating them. If it is in revenge or PR.I see no problem there,but problem will arise and that is policewala gundas. Eliminating the competition...mafia do it always Encounter is wrong, but killing an MLA and then the Witness is okay. Kya foonkta hai bhai? when did i say killing mla and witness is right? Encounter has been termed wrong by supreme court as done in hyderabad case, where the people encountered were rapists. For me, that person was a big mafia who used to kill innocent people and deserved to be punished. As i mentioned , even if u want to do encounter, then why it is reserved only for one set of criminals which are associated with another party. By protecting ram rahim(raped and killed 4 women), brij bhushan(openly confessing to murder on national tv) , ashish mishra(police didnt arrest him until court interfered. SIT proved his crime , but now he is free). All of them did heinous crimes. When u protect one set of criminals which are associated with ur party , then u are hypocrite. innocent until proven guilty... someone can claim you are a thug and kill you, for another person it is one thug less, and you can't argue otherwise, because you are dead... What happens when a yogi equivalent wants the land your house is on for their profits The answer is obvious How long before they start killing people that they deem bad for themselves, their party, or their reputation. There's a reason we don't allow the police to be judge, jury, and executioner."
}