{
    "id": "1904g3k",
    "title": "India is destined to become intellectual leader of world by 2047: education minister Pradhan",
    "url": "https://www.business-standard.com/education/news/india-is-destined-to-become-intellectual-leader-of-world-by-2047-education-minister-pradhan-124010600782_1.html",
    "selftext": "India will become the intellectual leader of the world by remaining illiterate, select few studying, education will be pipe dream for the masses. All the policies of current govt is opposite of what they claim to achieve in future.\n\nInstead of democratization of education, we are making it costlier and inaccessible everyday. Books, fees everything getting costlier and even unavailable in most cases. Latest technologies books are selling costlier than USA. \n\nStudents from villages and small towns are so rich now that they no longer wish to study in higher education, aim higher and so on. Education is now a luxury of the rich and credit worthy.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 15,
    "created_utc": 1704560571.0,
    "convurl": "https://external-preview.redd.it/ytGBoC9rXpCZBVXiVnhG21vmGTMxfhmRyE5AIIwAA3g.jpg?auto=webp&s=eb880db5e7416d27c470dd8f15335a93249bdb06",
    "comments": [
        "What I do agree with him is the urgent need to change our education system into Hindi language. No country has become developed by copying and speaking another country's languages.\nThat's an additional hurdle and pain point our millions of students suffer in addition to an already complex and vast education need.",
        "> urgent need to change our education system into Hindi language\n\nभाग भोसदिके\n\nWhy learn Hindi when you can use google.",
        "Wow! One language all over country ? Why divide a country thorough imposition?\nBangladesh and Pakistan are best neighbour examples as a result of failed language supremacy.",
        "Delusional much? Language isn't the issue. They are not encouraging critical thinking or scientific temperament in students. This is just headline management, they want people to stay dumb.",
        "No Govt wants a critical thinking , educated population , which can question its failures. So education especially primary/secondary will be Govt least priority.In fact education budget has been reduced by current Govt.\n\nhttps://www.thehindu.com/opinion/op-ed/budget-2023-is-a-case-of-education-taking-a-hit/article66596666.ece",
        "What about the people who don't speak Hindi? Language is not the problem?",
        "...and 10 other jokes you can tell yourself at night",
        "Hey pal, you just blow in from stupid town?",
        "Username check out. Hindi has no right to be the nation's language.",
        "इतना सस्ता माल मत फूखा किजीए।",
        "Might as well said 2075 and it would have meant nothing lol",
        "मैं एक हिंदी भाषी हूं और मुझे हिंदी अत्यंत प्रिय है। लेकिन मुझे लगता है कि किसी भाषा को बढ़ावा देने हेतु उसे दूसरों पर थोपना नकारात्मक परिणाम ला सकता है। हमें भाषाओं को एक प्राकृतिक रूप से बढ़ने देना चाहिए। इसके अलावा, \"शुद्धता\" का अतिरिक्त लगाव नुकसानदेह साबित हो सकता है। अंग्रेज़ी के बढ़ने की एक बड़ी वजह उसका लचीलापन है। उम्मीद है कि हम सही मार्ग का चयन करेंगे।\n\nआशा है कि आपका दिन अच्छा होगा।",
        "> No country has become developed by copying and speaking another country's languages. \n\nThe problem is that Hindi is mostly just as foreign as English to vast numbers of Indians. And it doesn't provide nearly the amount of benefit that a knowledge of English does.\n\nEven if you convert the required technical literature in English to India's native languages, you still will have to contend with terms that are more foreign as their English equivalents.\n\nI am not saying that the problem is not nasty; it is and something must be done about it. But it's not clear what.",
        "dont any experience to buy businesses such as airports and coal mines /s",
        ">No Govt wants a critical thinking , educated population\n\nDeveloped economies barring a few must have the most inept politicians on the planet. These Chinese/European politicians should come to India and study entire political science here.",
        "Students struggling with boards - remember this. The board system was invented, not for your intellectual enrichment, but as a mechanism to filter students out from higher education. These neta types failed to provide higher education opportunities for all so came up with this shitty system of board exams. Never blame yourself for not doing well in studies - you're not doing well by sarkaari standards, that's all.",
        "Couldn't agree more. The whole system of India is designed this way",
        "English is the worst language to adopt by Indians. It's crippled our youth tremendously",
        "What benefit exactly it provides that most European and Asians countries have developed without popularity of English language?",
        "I don't think that any language is inherently bad. We are also using this language to communicate on this platform, and many Chinese, Japanese, and French people also use it. Without Shakespeare and Wordsworth, humanity would have been deprived of some priceless gems.\n\nThe English language also acts as a lingua franca while other languages have a chance to grow without causing resentment in any particular community.\n\nThe problem arises when one language is considered \"superior\" and begins to replace other beautiful languages. This change isn't organic and can cause a loss of precious philosophical, linguistic, and cultural heritage.\n\nThe youth can be crippled in many ways. It's good to be near a source of heat when it is cold. However, a fire can also burn down our house if we aren't careful. Hopefully, we will remember the balanced approach of our founders.\n\nhttps://www.thequint.com/explainers/hindi-hindustani-english-a-history-of-indias-language-politics-hindi-imposition-backlash"
    ],
    "cleaned_text": "india destined become intellectual leader world education minister pradhan india become intellectual leader world remaining illiterate select studying education pipe dream masses policies current govt opposite claim achieve future instead democratization education making costlier inaccessible everyday books fees everything getting costlier even unavailable cases latest technologies books selling costlier usa students villages small towns rich longer wish study higher education aim higher education luxury rich credit worthy ",
    "cleaned_title": "india destined become intellectual leader world education minister pradhan",
    "cleaned_selftext": "india become intellectual leader world remaining illiterate select studying education pipe dream masses policies current govt opposite claim achieve future instead democratization education making costlier inaccessible everyday books fees everything getting costlier even unavailable cases latest technologies books selling costlier usa students villages small towns rich longer wish study higher education aim higher education luxury rich credit worthy",
    "cleaned_comments": "agree urgent need change education system hindi language country become developed copying speaking another countrys languages thats additional hurdle pain point millions students suffer addition already complex vast education need urgent need change education system hindi language learn hindi use google wow one language country divide country thorough imposition bangladesh pakistan best neighbour examples result failed language supremacy delusional much language isnt issue encouraging critical thinking scientific temperament students headline management want people stay dumb govt wants critical thinking educated population question failures education especially primarysecondary govt least priorityin fact education budget reduced current govt people dont speak hindi language problem jokes tell night hey pal blow stupid town username check hindi right nations language might well said would meant nothing lol country become developed copying speaking another countrys languages problem hindi mostly foreign english vast numbers indians doesnt provide nearly amount benefit knowledge english even convert required technical literature english indias native languages still contend terms foreign english equivalents saying problem nasty something must done clear dont experience buy businesses airports coal mines govt wants critical thinking educated population developed economies barring must inept politicians planet chineseeuropean politicians come india study entire political science students struggling boards remember board system invented intellectual enrichment mechanism filter students higher education neta types failed provide higher education opportunities came shitty system board exams never blame well studies youre well sarkaari standards thats couldnt agree whole system india designed way english worst language adopt indians crippled youth tremendously benefit exactly provides european asians countries developed without popularity english language dont think language inherently bad also using language communicate platform many chinese japanese french people also use without shakespeare wordsworth humanity would deprived priceless gems english language also acts lingua franca languages chance grow without causing resentment particular community problem arises one language considered superior begins replace beautiful languages change isnt organic cause loss precious philosophical linguistic cultural heritage youth crippled many ways good near source heat cold however fire also burn house arent careful hopefully remember balanced approach founders",
    "light_cleaned_title": "India is destined to become intellectual leader of world by 2047: education minister Pradhan",
    "light_cleaned_selftext": "India will become the intellectual leader of the world by remaining illiterate, select few studying, education will be pipe dream for the masses. All the policies of current govt is opposite of what they claim to achieve in future. Instead of democratization of education, we are making it costlier and inaccessible everyday. Books, fees everything getting costlier and even unavailable in most cases. Latest technologies books are selling costlier than USA. Students from villages and small towns are so rich now that they no longer wish to study in higher education, aim higher and so on. Education is now a luxury of the rich and credit worthy.",
    "light_cleaned_comments": "What I do agree with him is the urgent need to change our education system into Hindi language. No country has become developed by copying and speaking another country's languages. That's an additional hurdle and pain point our millions of students suffer in addition to an already complex and vast education need. > urgent need to change our education system into Hindi language भाग भोसदिके Why learn Hindi when you can use google. Wow! One language all over country ? Why divide a country thorough imposition? Bangladesh and Pakistan are best neighbour examples as a result of failed language supremacy. Delusional much? Language isn't the issue. They are not encouraging critical thinking or scientific temperament in students. This is just headline management, they want people to stay dumb. No Govt wants a critical thinking , educated population , which can question its failures. So education especially primary/secondary will be Govt least priority.In fact education budget has been reduced by current Govt. What about the people who don't speak Hindi? Language is not the problem? ...and 10 other jokes you can tell yourself at night Hey pal, you just blow in from stupid town? Username check out. Hindi has no right to be the nation's language. इतना सस्ता माल मत फूखा किजीए। Might as well said 2075 and it would have meant nothing lol मैं एक हिंदी भाषी हूं और मुझे हिंदी अत्यंत प्रिय है। लेकिन मुझे लगता है कि किसी भाषा को बढ़ावा देने हेतु उसे दूसरों पर थोपना नकारात्मक परिणाम ला सकता है। हमें भाषाओं को एक प्राकृतिक रूप से बढ़ने देना चाहिए। इसके अलावा, \"शुद्धता\" का अतिरिक्त लगाव नुकसानदेह साबित हो सकता है। अंग्रेज़ी के बढ़ने की एक बड़ी वजह उसका लचीलापन है। उम्मीद है कि हम सही मार्ग का चयन करेंगे। आशा है कि आपका दिन अच्छा होगा। > No country has become developed by copying and speaking another country's languages. The problem is that Hindi is mostly just as foreign as English to vast numbers of Indians. And it doesn't provide nearly the amount of benefit that a knowledge of English does. Even if you convert the required technical literature in English to India's native languages, you still will have to contend with terms that are more foreign as their English equivalents. I am not saying that the problem is not nasty; it is and something must be done about it. But it's not clear what. dont any experience to buy businesses such as airports and coal mines /s >No Govt wants a critical thinking , educated population Developed economies barring a few must have the most inept politicians on the planet. These Chinese/European politicians should come to India and study entire political science here. Students struggling with boards - remember this. The board system was invented, not for your intellectual enrichment, but as a mechanism to filter students out from higher education. These neta types failed to provide higher education opportunities for all so came up with this shitty system of board exams. Never blame yourself for not doing well in studies - you're not doing well by sarkaari standards, that's all. Couldn't agree more. The whole system of India is designed this way English is the worst language to adopt by Indians. It's crippled our youth tremendously What benefit exactly it provides that most European and Asians countries have developed without popularity of English language? I don't think that any language is inherently bad. We are also using this language to communicate on this platform, and many Chinese, Japanese, and French people also use it. Without Shakespeare and Wordsworth, humanity would have been deprived of some priceless gems. The English language also acts as a lingua franca while other languages have a chance to grow without causing resentment in any particular community. The problem arises when one language is considered \"superior\" and begins to replace other beautiful languages. This change isn't organic and can cause a loss of precious philosophical, linguistic, and cultural heritage. The youth can be crippled in many ways. It's good to be near a source of heat when it is cold. However, a fire can also burn down our house if we aren't careful. Hopefully, we will remember the balanced approach of our founders."
}