{
    "id": "18hg0kb",
    "title": "Hi, today morning I lost my AirPod in Uber I’ve mailed them, contacted their customer support, posted on their official handles still there is no response from their end or efforts to connect me with the driver !",
    "url": "https://twitter.com/AnshikaMot21873/status/1734903355166916791",
    "selftext": "What else can I do ?\n\nAttaching post :",
    "flair": "Law & Courts",
    "score": 7,
    "num_comments": 7,
    "created_utc": 1702471527.0,
    "convurl": "https://external-preview.redd.it/7LJTnKI7cv9mi2XMMjYe1s2dqSAOffBqYB_sYnjaF2s.jpg?auto=webp&s=3fab6e8e857c1ed07419900ab723949eaac20585",
    "comments": [
        "[https://twitter.com/AnshikaMot21873/status/1734903355166916791](https://twitter.com/AnshikaMot21873/status/1734903355166916791)",
        "High likely that you’ll get it back. Uber will claim no responsibility for this. I lost mine (the case) in a similar fashion, welcome to the club.",
        "You won't get it back, the driver or the passenger is gonna keep it",
        "This is so annoying, Uber isn’t even trying to",
        "You lost a single airpod?? That sucks but I don't think you are getting it back",
        "When we are on street, we need secure our stuff \n\nNo one is gonna return back once it's lost"
    ],
    "cleaned_text": "hi today morning lost airpod uber ive mailed contacted customer support posted official handles still response end efforts connect driver else attaching post ",
    "cleaned_title": "hi today morning lost airpod uber ive mailed contacted customer support posted official handles still response end efforts connect driver",
    "cleaned_selftext": "else attaching post",
    "cleaned_comments": "httpstwittercomanshikamotstatushttpstwittercomanshikamotstatus high likely youll get back uber claim responsibility lost mine case similar fashion welcome club wont get back driver passenger gon na keep annoying uber isnt even trying lost single airpod sucks dont think getting back street need secure stuff one gon na return back lost",
    "light_cleaned_title": "Hi, today morning I lost my AirPod in Uber I’ve mailed them, contacted their customer support, posted on their official handles still there is no response from their end or efforts to connect me with the driver !",
    "light_cleaned_selftext": "What else can I do ? Attaching post :",
    "light_cleaned_comments": "[https://twitter.com/AnshikaMot21873/status/1734903355166916791](https://twitter.com/AnshikaMot21873/status/1734903355166916791) High likely that you’ll get it back. Uber will claim no responsibility for this. I lost mine (the case) in a similar fashion, welcome to the club. You won't get it back, the driver or the passenger is gonna keep it This is so annoying, Uber isn’t even trying to You lost a single airpod?? That sucks but I don't think you are getting it back When we are on street, we need secure our stuff No one is gonna return back once it's lost"
}