{
    "id": "1dx9lfx",
    "title": "Do you want to know how Ambani financed his son's year long wedding celebrations and Justin Bieber's performance at his Sangeet ? If yes, then read this thread.",
    "url": "https://www.reddit.com/r/india/comments/1dx9lfx/do_you_want_to_know_how_ambani_financed_his_sons/",
    "selftext": "Ambani wanted to acquire a huge tract of land in Jamnagar Gujrat. But he didn't want to pay market value on this. So he asked his friend Modi to change a law called Section 24(2) of the new land acquisition act 2013. Modi tried to change the word \"Or\" in the act to \"and\", but due to the opposition he could not do so.  By changing \"OR\" to \"AND\" Ambani would be able to acquire land as per old land acquisition act 1894, as per land acquisition act 1894 the rates are as per 1894.\n\nWhat he failed to in parliament he was able to do in the Supreme Court. Ambani filed a case in the Supreme Court, this case came in front of \"Justice\" Arun Mishra. \"Justice\" Mishra in all his wisdom overruled Supreme Court's Seven year old land mark judgement and said that judgement is not as per law. During this time Ranjan Gogoi controversy was going and also Ram Mandir judgment. \n\nThere was a lot of uproar in the Supreme Court and many lawyers and sitting and retiered judges said that what was done is wrong and demanded a five judge bench be appointed to see if what \"Justice\" Arun Mishra was correct or not. Under the cover of Ram Mandir hearing a five judge bench was appointed but it was headed by \"Justice\" Arun Mishra himself. In essence \"Justice\" Mishra himself was checking if what he did was right or wrong. This five judge bench also had other members like \"Justice\" MR Shah, who was Amit Shah's criminal lawyer in Gujrat. \n\nWhen this five judge bench was hearing what Justice Mishra did was right or wrong then Senior advocates were threatened with contempt for just pleading their case, not only were they threatened with contempt but they were also told that they be held guilty as well.\n\nMany people demanded Justice Mishra's recusal but they were threatened with contempt as well.\n\nUsing Ram Mandir media case as cover, \"Justice\" Mishra said that the word \"OR\" does not mean or but means \"AND\".\n\nThe government was arguing that \"OR\" should be read as \"AND\", but the government's arguments were so weak that \"Justice\" Mishra had to intervene during the arguments of Solicitor General and ask them if they want to continue arguing like this as it is weakening their case.\n\n\"Justice\" Mishra in essence overruled parliament and opened decades old settled cases that has attained finality. \n\nAfter this case Adani Ji entered real estate development business and started to develop and sell land in the outskirts of major cities, where do you think this land came from ?\n\nIn essence land was acquired for thousands of rupees and sold for crores by these \"industrialists\". \n\nSource for the above is investigation by Former Indian Express editor and Pulitzer prize winning journalist Mr Kumar Sambhav Srivastava. You can read more here:\n\nhttps://x.com/Kum_Sambhav/status/1183302261092405248?t=ve6DxxnFEd8XE33wlrFkXA&s=19",
    "flair": "Law & Courts",
    "score": 53,
    "num_comments": 4,
    "created_utc": 1720332091.0,
    "convurl": "https://external-preview.redd.it/11hXVJcMDQ0vEbX22crC_1LlfEo4vEpikikeNTw7Bnw.jpg?auto=webp&s=02cb3cb13d9112094b80ea5c784215675f0e0a82",
    "comments": [
        "https://preview.redd.it/80s8wxtvg1bd1.png?width=1080&format=pjpg&auto=webp&s=59b15f1aa70d0d21a03fbc81d71c6d7e3f42131c",
        "Cue a random milquetoast \"neutral moderate centrist\" coming here and saying \"they might have done all sorts of scams and foul play to get here but they're now important for Indian economy and common people will lose if they're persecuted\"",
        "https://preview.redd.it/wwc1itb7i1bd1.png?width=1080&format=pjpg&auto=webp&s=cb9cc5b97498ad5dc92e47615ea69bed53518aca",
        "Zero accountability for rich in this country.",
        "These news will never get coverage in India",
        "I get it why everyone wants to get out of this country."
    ],
    "cleaned_text": "want know ambani financed sons year long wedding celebrations justin biebers performance sangeet yes read thread ambani wanted acquire huge tract land jamnagar gujrat didnt want pay market value asked friend modi change law called section new land acquisition act modi tried change word act due opposition could changing ambani would able acquire land per old land acquisition act per land acquisition act rates per failed parliament able supreme court ambani filed case supreme court case came front justice arun mishra justice mishra wisdom overruled supreme courts seven year old land mark judgement said judgement per law time ranjan gogoi controversy going also ram mandir judgment lot uproar supreme court many lawyers sitting retiered judges said done wrong demanded five judge bench appointed see justice arun mishra correct cover ram mandir hearing five judge bench appointed headed justice arun mishra essence justice mishra checking right wrong five judge bench also members like justice mr shah amit shahs criminal lawyer gujrat five judge bench hearing justice mishra right wrong senior advocates threatened contempt pleading case threatened contempt also told held guilty well many people demanded justice mishras recusal threatened contempt well using ram mandir media case cover justice mishra said word mean means government arguing read governments arguments weak justice mishra intervene arguments solicitor general ask want continue arguing like weakening case justice mishra essence overruled parliament opened decades old settled cases attained finality case adani ji entered real estate development business started develop sell land outskirts major cities think land came essence land acquired thousands rupees sold crores industrialists source investigation former indian express editor pulitzer prize winning journalist mr kumar sambhav srivastava read ",
    "cleaned_title": "want know ambani financed sons year long wedding celebrations justin biebers performance sangeet yes read thread",
    "cleaned_selftext": "ambani wanted acquire huge tract land jamnagar gujrat didnt want pay market value asked friend modi change law called section new land acquisition act modi tried change word act due opposition could changing ambani would able acquire land per old land acquisition act per land acquisition act rates per failed parliament able supreme court ambani filed case supreme court case came front justice arun mishra justice mishra wisdom overruled supreme courts seven year old land mark judgement said judgement per law time ranjan gogoi controversy going also ram mandir judgment lot uproar supreme court many lawyers sitting retiered judges said done wrong demanded five judge bench appointed see justice arun mishra correct cover ram mandir hearing five judge bench appointed headed justice arun mishra essence justice mishra checking right wrong five judge bench also members like justice mr shah amit shahs criminal lawyer gujrat five judge bench hearing justice mishra right wrong senior advocates threatened contempt pleading case threatened contempt also told held guilty well many people demanded justice mishras recusal threatened contempt well using ram mandir media case cover justice mishra said word mean means government arguing read governments arguments weak justice mishra intervene arguments solicitor general ask want continue arguing like weakening case justice mishra essence overruled parliament opened decades old settled cases attained finality case adani ji entered real estate development business started develop sell land outskirts major cities think land came essence land acquired thousands rupees sold crores industrialists source investigation former indian express editor pulitzer prize winning journalist mr kumar sambhav srivastava read",
    "cleaned_comments": "cue random milquetoast neutral moderate centrist coming saying might done sorts scams foul play get theyre important indian economy common people lose theyre persecuted zero accountability rich country news never get coverage india get everyone wants get country",
    "light_cleaned_title": "Do you want to know how Ambani financed his son's year long wedding celebrations and Justin Bieber's performance at his Sangeet ? If yes, then read this thread.",
    "light_cleaned_selftext": "Ambani wanted to acquire a huge tract of land in Jamnagar Gujrat. But he didn't want to pay market value on this. So he asked his friend Modi to change a law called Section 24(2) of the new land acquisition act 2013. Modi tried to change the word \"Or\" in the act to \"and\", but due to the opposition he could not do so. By changing \"OR\" to \"AND\" Ambani would be able to acquire land as per old land acquisition act 1894, as per land acquisition act 1894 the rates are as per 1894. What he failed to in parliament he was able to do in the Supreme Court. Ambani filed a case in the Supreme Court, this case came in front of \"Justice\" Arun Mishra. \"Justice\" Mishra in all his wisdom overruled Supreme Court's Seven year old land mark judgement and said that judgement is not as per law. During this time Ranjan Gogoi controversy was going and also Ram Mandir judgment. There was a lot of uproar in the Supreme Court and many lawyers and sitting and retiered judges said that what was done is wrong and demanded a five judge bench be appointed to see if what \"Justice\" Arun Mishra was correct or not. Under the cover of Ram Mandir hearing a five judge bench was appointed but it was headed by \"Justice\" Arun Mishra himself. In essence \"Justice\" Mishra himself was checking if what he did was right or wrong. This five judge bench also had other members like \"Justice\" MR Shah, who was Amit Shah's criminal lawyer in Gujrat. When this five judge bench was hearing what Justice Mishra did was right or wrong then Senior advocates were threatened with contempt for just pleading their case, not only were they threatened with contempt but they were also told that they be held guilty as well. Many people demanded Justice Mishra's recusal but they were threatened with contempt as well. Using Ram Mandir media case as cover, \"Justice\" Mishra said that the word \"OR\" does not mean or but means \"AND\". The government was arguing that \"OR\" should be read as \"AND\", but the government's arguments were so weak that \"Justice\" Mishra had to intervene during the arguments of Solicitor General and ask them if they want to continue arguing like this as it is weakening their case. \"Justice\" Mishra in essence overruled parliament and opened decades old settled cases that has attained finality. After this case Adani Ji entered real estate development business and started to develop and sell land in the outskirts of major cities, where do you think this land came from ? In essence land was acquired for thousands of rupees and sold for crores by these \"industrialists\". Source for the above is investigation by Former Indian Express editor and Pulitzer prize winning journalist Mr Kumar Sambhav Srivastava. You can read more here:",
    "light_cleaned_comments": "Cue a random milquetoast \"neutral moderate centrist\" coming here and saying \"they might have done all sorts of scams and foul play to get here but they're now important for Indian economy and common people will lose if they're persecuted\" Zero accountability for rich in this country. These news will never get coverage in India I get it why everyone wants to get out of this country."
}