{
    "id": "16dyc92",
    "title": "Nightmare Experience with Indigo Airlines at Chennai Airport",
    "url": "https://www.reddit.com/r/india/comments/16dyc92/nightmare_experience_with_indigo_airlines_at/",
    "selftext": "\n\nI want to share a harrowing experience my family had with Indigo Airlines at Chennai Airport today. We're in desperate need of advice or assistance, and I hope someone here can help.\n\n**Background:**\n- Our flight was scheduled for 5:10 AM.\n- We arrived at the airport at 3:00 AM, well ahead of time.\n\n**The Nightmare Begins:**\n- My father was asked to undergo a medical checkup by an Indigo airhostess, which ended up taking over an hour.\n- Due to this lengthy checkup, my family missed their initial flight.\n\n**False Hope:**\n- After returning from the medical checkup, they were provided new tickets for a 7:20 AM flight.\n- Shockingly, before this flight, they were subjected to another medical checkup, causing them to miss the flight once again.\n\n**Uncooperative Staff:**\n- The Indigo staff at Chennai Airport, specifically named Lavanya, Geeta, and Gobi Prasad, have been extremely uncooperative and refuse to communicate with us.\n- We even attempted to speak with the airport manager, who was outright rude and dismissive, stating that it's \"not his business.\"\n\n**Current Situation:**\n- My family is now stranded at Chennai Airport with no accommodation or assistance.\n- Indigo Airlines is claiming that all flights are packed and they cannot provide an alternative.\n\nWe're feeling helpless and frustrated, not knowing what to do next. Has anyone else faced such a situation with Indigo or any airline? Any advice or contacts that could help us in this dire situation would be greatly appreciated. Thank you for reading and your support.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694240628.0,
    "convurl": "https://external-preview.redd.it/gswJvBbx9QIWa7gLS971LIHdqIseVXbZXcJoRAFceQg.jpg?auto=webp&s=d81fa95f20c5ffc23379baf499cbf89fe90708a1",
    "comments": [
        "Please post this on social media like twitter and tag the Indigo airlines account.",
        "Already did that, they asked for PNR and contact number but haven't replied yet.",
        "Elevate the issue , tag aviation ministry including minister.  It's genuine problem , someone should be held responsible. \n\nIn between what kind of health check up  u r talking about..  I never witnessed any such till date",
        "My father had a bandage on his arm . He had dialysis a few days back . But he was cleared by the doctors at Apollo Hospitals for the flight",
        "this was a domestic flight?",
        "Yes it was a domestic flight",
        "Ohh.. Chennai Airport is well connected to city with metro. Considering your father health conditions it's better to book a room for rest till you get your next flights. \n\nYou can file case and fight in consumer court later but first important thing now is Taking care of your family.",
        "Why was your father asked to undergo medical checkup? Was he showing any kind of symptoms?",
        "He has his arm in bandage , as he underwent dialysis a few days ago. He was cleared by the hospital we were in to be able to fly",
        "Hahaha these clown airlines never learn their lesson. Go to Twitter and do the necessary..and then go to consumer court and get compensation. Not less than all the tickets plus maybe 10,000 more. If they don't, file police case.",
        "Have you tried the airsewa app? I got prompt responses for certain issues at GOA airport. \n\nAlso, while cumbersome, there is a procedure to exit the airport (that is back out to Chennai City) without getting in the plane. It requires clearance from the airline manager and security. Just informing since your father seems elderly and might be in need of rest. It might be useful to get them out and resting before taking Indigo to task.",
        "I haven't sufficient reddit karma . So , I can't make any post on reddit . I am new to it . I 'm introvert person . \n\n\nHow can I make post , ask questions on reddit with insufficient karma ? Reddit is  deleting all my post on this platform because of insufficient karma point. \nNow , I am tired of this .\n\nI think I have to leave from reddit platform because from past one month i had earned only 1 reddit karma \n\nI am not made for reddit . \n\nGood bye Reddit",
        "That could be it mate. The airlines wouldn't want to be held accountable in case anything had to happen to your father mid-flight, which is why they took your father for a check-up to see if he was cleared to take a flight or not.\n\nAnyway, you should totally sue them for this fuck up.",
        "Why is your father asked to go through a medical test? Is he visibly sick?",
        "why was the medical checkup required?",
        "Twice on the same day?",
        "Then you share your tweet link here and if anyone is interested they will RT.",
        "Why did your father need to be checked up before the flight?",
        "Once the issue is sorted, make sure to file a complaint with consumer court",
        "How can indigo ask you to do a health check up? This part is not making sense to anyone, please elaborate. I have an air hostess friend in indigo and she has confirmed that they have no right to ask for any check ups unless they suspect covid and that's a simple swab test. I smell bs",
        "Put it on Twitter. Link it here for retweets",
        "I am really fond of Air India now.\n\nThey have 25 kg + 10kg weight limits as well.",
        "My father has a bandage on his arm , as he has undergone dialysis a few days back and the airhostess saw it and asked him to do check up even though we had the written fit to fly approval from the speciality hospital itself .",
        "So they had specialty equipment at the airport to conduct this test? Things aren't adding up here",
        "Overbooking duh-",
        "They do have basic equipments with the company doctors in every airport I think . They measured his blood pressure with the digital blood pressure machine which hardly takes 5 mins . But the main thing is they made him sit at the doctor's room for above 45 mins for no reason without doing any tests or checking him at all.",
        "Indigo is a complete shit show, even we had terrible experience with that airline. Now, we consider AirIndia only for air travels. And I agree their ground level staff is completely incompetent.",
        "I think you made a mistake suspecting your father is unwell and called for medical help. This happened to me once, low pressure. I've got avail their free medical facility, you are not fit to fly, unfortunately. You need to get fresh fit to fly certification from doctor. Maybe your father is still sick? I'm sorry for your ordeal, but I learned a lesson hard way, unless some real serious issue like heart attack never ever call for medical help.",
        "Tweet it, name and shame, tag DCGA and CM.\n\nWorks better if you have video.",
        "Ah yes, indigo airlines being indigo airlines. Full of incompetent idiots as usual.",
        "The fit to fly certification is from a speciality hospital and it's from yesterday. How much fresher do they need it? And No, we didn't ask for any medical assistance .",
        "used to have 30+7 on intl flights",
        "Indigo does not care about passengers one bit.\nI pay extra to avoid flying indigo these days. All they care about is their processes.",
        "A stable dialysis patient has no restrictions on any activity except overly strenuous exercise and lifting heavy objects with the arm used for dialysis. I am shocked at the incompetence and ignorance of the staff.",
        "A stable dialysis patient has no restrictions on any activity except overly strenuous exercise and lifting heavy objects with the arm used for dialysis. I am shocked at the incompetence and ignorance of the staff. Next time tell your dad to wear a full sleeve shirt to cover the arm.",
        "Yes , I filed a grievance report in the air sewa portal . Yet to get any replies .",
        "A stable dialysis patient has no restrictions on any activity except overly strenuous exercise and lifting heavy objects with the arm used for dialysis. I am shocked at the incompetence and ignorance of the staff. Next time tell your dad to wear a full sleeve shirt to cover the arm.",
        "The first checkup might have been justified, but the second one definitely wasn't, unless the medical staff notified OP's family beforehand why they needed to do a second checkup. OP hasn't mentioned anything about the same.",
        "On a completely unrelated note, what on earth were gobi Prasad’s parents thinking when naming their child. I can’t stop laughing lol",
        "What did they ask for a fitness certificate? My mother flew while getting cancer treatment. We just didn't tell anyone.",
        "   V       v               +11 /%     xs1 ,S!#@@@@•-",
        "This is appalling, but a word of advice. The staff at all airports are extremely overworked. All airlines hire 30% less staff than required. Plus most of them are not trained properly and at least half of them have no aptitude to be in a service oriented job. So it's a complete sh*tshow. So next time don't wait patiently. Make noise continuously but politely. Make it so that your pestering is a bigger problem than anything else. Make a grand show of noting down names of the people involved but do it before the problem occurs. Otherwise it's easy to fall through the cracks.",
        "**Overbooked flight.** They had to deboard someone and they found your family. \n\nHappening all over India. Regulator action is not a sufficient deterrent. Your only hope is filing a consumer case and dragging the employees for the hearing. **There is no easy win against airlines** in the current economic/political environment. **God speed**",
        "Share the tweet here. Let's amplify",
        "Test",
        "Feeling sorry about your situation. But what sad state of affairs are there where we need to go on social media and tag ministers and other officials to address a rather simple issue, that can be clarified if the airline staff didn't have their heads up their ass.",
        "Still do",
        "Did you fill the MEDIF form?",
        "No we didn't, as we don't require any medical assistance from the airlines.",
        "That could be it",
        "Man I was reading through all replies so seriously until I read yours and even I'm laughing hard now",
        "In Tamil, the letter for 'pa' and 'ba' are same. Hence Gopi is sometimes mispronounced as Gobi and written likewise in English. Technically it should be Gopi Prasad.",
        "His father always wanted to open a temple and give Gobi as prasadam instead of pal pazham",
        "After the founder with integrity has left the company and accused the other founder of shenanigans, I am not surprised with any of this.",
        "Any idea if something like this happens outside India if it is possible to take legal action? \n\nI was once denied boarding for a bs reason and got stranded in an airport in the EU. I think it was because the flight was overbooked too.",
        "EU laws are pretty strict, if your flight was within 12 months from today then you can still complain.",
        "Report, complain and shame them in public as well. If you have friends in media lean on to them as well for any help. These corporations don't care about anything but their profit. They don't deserve any liniency.\n\nJust retweeted and liked your tweets OP. Better if you can add any hashtags for better trending.",
        "They gave me another ticket after two days of complaining, but i would have preferred a refund as i didnt want to fly with them. Wont do that too. \n\nWent through a lot of distress that day. I was a woman and student traveling alone and in a place where i didnt know anyone and had little money. This was years ago. But i still would like to know if i can do something if this happens again.",
        "Firstly, what was the airline?\n\nSecondly, EU regulations favour the customer. But then it involves finding out who the regulator, what the grievance handling mechanism is. And then you need to write the complaint and keep following up. Works easier for EU citizens and residents. But it’s not impossible as a non resident.",
        "No its gobi prasad, he juat loved gobi as a kid. Don't say things you don't know, gobi is my best friend.",
        "Airports do have basic medical equipments for testing. This has happened with us while travelling internationally. My mom was suddenly feeling nauseous at the airport so I went to ask for wheelchair assistance and they immediately aaked for a medical checkup. This is done so that they don’t have to do an emergency landing. The airport staff was very co operative. They did a basic checkup and we were allowed with her inside the medical room. \n\nI don’t buy that they only allowed your father inside. You are definitely hiding some info OP.",
        "Indigo is among the worst airlines to operate in India. Presently pursuing a complaint against them myself. Their ground staff can be exceptionally entitled, rude, and incompetent.",
        "British. What you mentioned is done through the airline right? They had really bad customer service. Somehow designed so that its very difficult to reach them and even more difficult to get anything done. When i was denied boarding and i somehow got connected to their customer service from the airport they even cut the call on me midway.\n\nI submitted an online complaint but they just gave me another ticket after two or three days.",
        "No, I’m saying file a complaint with aviation regulator of the country you were denied boarding in. \n\nIf it’s British airways in EU, you have a strong case. The regulator will be strict since they are a “foreign” airline. \n\nHow long ago was this? Rule of thumb: you can file complaints upto 90 days",
        "Then my nae should be Bhindi Prasad. I loved bhindi, still do.",
        "What else would you expect from someone named gobi lol",
        "File a consumer complaint or a legal case.",
        "Ah i see. It was about two years ago.",
        "Go on LinkedIn, narrate the entire episode and tag their CEO. This should work as my parents had to miss their flight due to Indigo's incompetent staff.",
        "Had a family member once asked to sign a medical waiver with air India many years ago. That should have sufficed in your case. Escalate. Perhaps DGCA is the agency to complain to. Or you might want to go the legal route.",
        "Do not give up, and do not give in.\n\nTurn your call recording on, and whenever they call, inform them that you are also recording their call.\n\nRight now, if you have these two things - liquidity and the contact of a decent lawyer, book another ticket. And then give them hell.\n\nI would suggest send them a legal notice asap. And tweet about it. See their reaction change. Tweet about all of this as well.",
        "Boss, in EU, the rules are super consumer-friendly. I don't know what's the statute of mandate there, but it does seem like you could receive a hefty compensation.\n\nEU/USA Airlines usually offer a coupons for hotel stay, airport transfers etc. at least in case of an overbooked flight.",
        "What a nightmare!  Post this on every social platform you have.  good luck OP",
        "Well, I don't buy that the airport staff was very co operative. You are definitely hiding some info.",
        "If you have proof and this happened within 12 months, you should ask for compensation. There are companies that file the complaint on your behalf, just Google EU flight delay compensation or similar. This applies if the flight originated from an EU country or was headed to an EU country.",
        "It looks like you never had a good experience in life and that makes it difficult for you to believe so!",
        "Life?! Let's stick to airports for now.\n\nIt looks like you never had a bad experience in airports and that makes it difficult for you to believe so!\n\nI'm just reusing your logic here in this thread.",
        "Good things happen to me :)",
        "Ditto",
        "To talk to a customer executive in indigo, you can follow these steps:\n\n1. Contact Indigo Customer Support:0787-9084-528 The customer care number for Indigo can be found on the back of your Indigo, the monthly statement, or the official IRCTC website. Take note of the number and ensure you have it available.\n\n2. Dial the customer care number: Using your registered mobile number, dial the customer care number you obtained in the previous step. Make sure you have a stable phone connection.\n\n3. Choose the language preference: Once connected, you may be prompted to select your preferred language. Listen to the options carefully and choose the language you are comfortable with.\n\n4. Select the Indigo option: Listen to the IVR menu options and select the option related to credit cards. The specific option may vary, so pay attention to the menu prompts.\n\n5. Verify your identity: To ensure security, you may be required to provide certain details for identification. This could include your credit card number, date of birth, or any other information requested by the IVR system. Enter the required information when prompted.\n\n6. Wait for a customer executive: After verifying your identity, you may be placed on hold and connected to a customer executive as soon as one is available. The waiting time may vary, so be patient.\n\n7. Speak to the customer executive: Once connected, clearly explain your query or concern to the customer executive. Provide any necessary details or documentation they may require. Listen attentively to their instructions and ask for clarification if needed. Take note of any reference numbers provided during the conversation for future reference.\n\nIt's important to note that customer care availability may vary based on business hours and public holidays. If you are unable to reach a customer executive through the phone, you can also try reaching out to Indigo customer support through other channels such as email or online chat on their official website.ghgd",
        "To talk to a customer executive in indigo, you can follow these steps:\n\n1. Contact Indigo Customer Support:0787-9084-528 The customer care number for Indigo can be found on the back of your Indigo, the monthly statement, or the official IRCTC website. Take note of the number and ensure you have it available.\n\n2. Dial the customer care number: Using your registered mobile number, dial the customer care number you obtained in the previous step. Make sure you have a stable phone connection.\n\n3. Choose the language preference: Once connected, you may be prompted to select your preferred language. Listen to the options carefully and choose the language you are comfortable with.\n\n4. Select the Indigo option: Listen to the IVR menu options and select the option related to credit cards. The specific option may vary, so pay attention to the menu prompts.\n\n5. Verify your identity: To ensure security, you may be required to provide certain details for identification. This could include your credit card number, date of birth, or any other information requested by the IVR system. Enter the required information when prompted.\n\n6. Wait for a customer executive: After verifying your identity, you may be placed on hold and connected to a customer executive as soon as one is available. The waiting time may vary, so be patient.\n\n7. Speak to the customer executive: Once connected, clearly explain your query or concern to the customer executive. Provide any necessary details or documentation they may require. Listen attentively to their instructions and ask for clarification if needed. Take note of any reference numbers provided during the conversation for future reference.\n\nIt's important to note that customer care availability may vary based on business hours and public holidays. If you are unable to reach a customer executive through the phone, you can also try reaching out to Indigo customer support through other channels such as email or online chat on their official website.sdgg",
        "To talk to a customer executive in indigo, you can follow these steps:\n\n1. Contact Indigo Customer Support:0787-9084-528 The customer care number for Indigo can be found on the back of your Indigo, the monthly statement, or the official IRCTC website. Take note of the number and ensure you have it available.\n\n2. Dial the customer care number: Using your registered mobile number, dial the customer care number you obtained in the previous step. Make sure you have a stable phone connection.\n\n3. Choose the language preference: Once connected, you may be prompted to select your preferred language. Listen to the options carefully and choose the language you are comfortable with.\n\n4. Select the Indigo option: Listen to the IVR menu options and select the option related to credit cards. The specific option may vary, so pay attention to the menu prompts.\n\n5. Verify your identity: To ensure security, you may be required to provide certain details for identification. This could include your credit card number, date of birth, or any other information requested by the IVR system. Enter the required information when prompted.\n\n6. Wait for a customer executive: After verifying your identity, you may be placed on hold and connected to a customer executive as soon as one is available. The waiting time may vary, so be patient.\n\n7. Speak to the customer executive: Once connected, clearly explain your query or concern to the customer executive. Provide any necessary details or documentation they may require. Listen attentively to their instructions and ask for clarification if needed. Take note of any reference numbers provided during the conversation for future reference.\n\nIt's important to note that customer care availability may vary based on business hours and public holidays. If you are unable to reach a customer executive through the phone, you can also try reaching out to Indigo customer support through other channels such as email or online chat on their official website.ghgc"
    ],
    "cleaned_text": "nightmare experience indigo airlines chennai airport want share harrowing experience family indigo airlines chennai airport today desperate need advice assistance hope someone help background flight scheduled arrived airport well ahead time nightmare begins father asked undergo medical checkup indigo airhostess ended taking hour due lengthy checkup family missed initial flight false hope returning medical checkup provided new tickets flight shockingly flight subjected another medical checkup causing miss flight uncooperative staff indigo staff chennai airport specifically named lavanya geeta gobi prasad extremely uncooperative refuse communicate us even attempted speak airport manager outright rude dismissive stating business current situation family stranded chennai airport accommodation assistance indigo airlines claiming flights packed provide alternative feeling helpless frustrated knowing next anyone else faced situation indigo airline advice contacts could help us dire situation would greatly appreciated thank reading support ",
    "cleaned_title": "nightmare experience indigo airlines chennai airport",
    "cleaned_selftext": "want share harrowing experience family indigo airlines chennai airport today desperate need advice assistance hope someone help background flight scheduled arrived airport well ahead time nightmare begins father asked undergo medical checkup indigo airhostess ended taking hour due lengthy checkup family missed initial flight false hope returning medical checkup provided new tickets flight shockingly flight subjected another medical checkup causing miss flight uncooperative staff indigo staff chennai airport specifically named lavanya geeta gobi prasad extremely uncooperative refuse communicate us even attempted speak airport manager outright rude dismissive stating business current situation family stranded chennai airport accommodation assistance indigo airlines claiming flights packed provide alternative feeling helpless frustrated knowing next anyone else faced situation indigo airline advice contacts could help us dire situation would greatly appreciated thank reading support",
    "cleaned_comments": "please post social media like twitter tag indigo airlines account already asked pnr contact number havent replied yet elevate issue tag aviation ministry including minister genuine problem someone held responsible kind health check u r talking never witnessed till date father bandage arm dialysis days back cleared doctors apollo hospitals flight domestic flight yes domestic flight ohh chennai airport well connected city metro considering father health conditions better book room rest till get next flights file case fight consumer court later first important thing taking care family father asked undergo medical checkup showing kind symptoms arm bandage underwent dialysis days ago cleared hospital able fly hahaha clown airlines never learn lesson go twitter necessaryand go consumer court get compensation less tickets plus maybe dont file police case tried airsewa app got prompt responses certain issues goa airport also cumbersome procedure exit airport back chennai city without getting plane requires clearance airline manager security informing since father seems elderly might need rest might useful get resting taking indigo task havent sufficient reddit karma cant make post reddit new introvert person make post ask questions reddit insufficient karma reddit deleting post platform insufficient karma point tired think leave reddit platform past one month earned reddit karma made reddit good bye reddit could mate airlines wouldnt want held accountable case anything happen father midflight took father checkup see cleared take flight anyway totally sue fuck father asked go medical test visibly sick medical checkup required twice day share tweet link anyone interested rt father need checked flight issue sorted make sure file complaint consumer court indigo ask health check part making sense anyone please elaborate air hostess friend indigo confirmed right ask check ups unless suspect covid thats simple swab test smell bs put twitter link retweets really fond air india kg kg weight limits well father bandage arm undergone dialysis days back airhostess saw asked check even though written fit fly approval speciality hospital specialty equipment airport conduct test things arent adding overbooking duh basic equipments company doctors every airport think measured blood pressure digital blood pressure machine hardly takes mins main thing made sit doctors room mins reason without tests checking indigo complete shit show even terrible experience airline consider airindia air travels agree ground level staff completely incompetent think made mistake suspecting father unwell called medical help happened low pressure ive got avail free medical facility fit fly unfortunately need get fresh fit fly certification doctor maybe father still sick im sorry ordeal learned lesson hard way unless real serious issue like heart attack never ever call medical help tweet name shame tag dcga cm works better video ah yes indigo airlines indigo airlines full incompetent idiots usual fit fly certification speciality hospital yesterday much fresher need didnt ask medical assistance used intl flights indigo care passengers one bit pay extra avoid flying indigo days care processes stable dialysis patient restrictions activity except overly strenuous exercise lifting heavy objects arm used dialysis shocked incompetence ignorance staff stable dialysis patient restrictions activity except overly strenuous exercise lifting heavy objects arm used dialysis shocked incompetence ignorance staff next time tell dad wear full sleeve shirt cover arm yes filed grievance report air sewa portal yet get replies stable dialysis patient restrictions activity except overly strenuous exercise lifting heavy objects arm used dialysis shocked incompetence ignorance staff next time tell dad wear full sleeve shirt cover arm first checkup might justified second one definitely wasnt unless medical staff notified ops family beforehand needed second checkup op hasnt mentioned anything completely unrelated note earth gobi prasads parents thinking naming child cant stop laughing lol ask fitness certificate mother flew getting cancer treatment didnt tell anyone v v xs appalling word advice staff airports extremely overworked airlines hire less staff required plus trained properly least half aptitude service oriented job complete shtshow next time dont wait patiently make noise continuously politely make pestering bigger problem anything else make grand show noting names people involved problem occurs otherwise easy fall cracks overbooked flight deboard someone found family happening india regulator action sufficient deterrent hope filing consumer case dragging employees hearing easy win airlines current economicpolitical environment god speed share tweet lets amplify test feeling sorry situation sad state affairs need go social media tag ministers officials address rather simple issue clarified airline staff didnt heads ass still fill medif form didnt dont require medical assistance airlines could man reading replies seriously read even im laughing hard tamil letter pa ba hence gopi sometimes mispronounced gobi written likewise english technically gopi prasad father always wanted open temple give gobi prasadam instead pal pazham founder integrity left company accused founder shenanigans surprised idea something like happens outside india possible take legal action denied boarding bs reason got stranded airport eu think flight overbooked eu laws pretty strict flight within months today still complain report complain shame public well friends media lean well help corporations dont care anything profit dont deserve liniency retweeted liked tweets op better add hashtags better trending gave another ticket two days complaining would preferred refund didnt want fly wont went lot distress day woman student traveling alone place didnt know anyone little money years ago still would like know something happens firstly airline secondly eu regulations favour customer involves finding regulator grievance handling mechanism need write complaint keep following works easier eu citizens residents impossible non resident gobi prasad juat loved gobi kid dont say things dont know gobi best friend airports basic medical equipments testing happened us travelling internationally mom suddenly feeling nauseous airport went ask wheelchair assistance immediately aaked medical checkup done dont emergency landing airport staff co operative basic checkup allowed inside medical room dont buy allowed father inside definitely hiding info op indigo among worst airlines operate india presently pursuing complaint ground staff exceptionally entitled rude incompetent british mentioned done airline right really bad customer service somehow designed difficult reach even difficult get anything done denied boarding somehow got connected customer service airport even cut call midway submitted online complaint gave another ticket two three days im saying file complaint aviation regulator country denied boarding british airways eu strong case regulator strict since foreign airline long ago rule thumb file complaints upto days nae bhindi prasad loved bhindi still else would expect someone named gobi lol file consumer complaint legal case ah see two years ago go linkedin narrate entire episode tag ceo work parents miss flight due indigos incompetent staff family member asked sign medical waiver air india many years ago sufficed case escalate perhaps dgca agency complain might want go legal route give give turn call recording whenever call inform also recording call right two things liquidity contact decent lawyer book another ticket give hell would suggest send legal notice asap tweet see reaction change tweet well boss eu rules super consumerfriendly dont know whats statute mandate seem like could receive hefty compensation euusa airlines usually offer coupons hotel stay airport transfers etc least case overbooked flight nightmare post every social platform good luck op well dont buy airport staff co operative definitely hiding info proof happened within months ask compensation companies file complaint behalf google eu flight delay compensation similar applies flight originated eu country headed eu country looks like never good experience life makes difficult believe life lets stick airports looks like never bad experience airports makes difficult believe im reusing logic thread good things happen ditto talk customer executive indigo follow steps contact indigo customer support customer care number indigo found back indigo monthly statement official irctc website take note number ensure available dial customer care number using registered mobile number dial customer care number obtained previous step make sure stable phone connection choose language preference connected may prompted select preferred language listen options carefully choose language comfortable select indigo option listen ivr menu options select option related credit cards specific option may vary pay attention menu prompts verify identity ensure security may required provide certain details identification could include credit card number date birth information requested ivr system enter required information prompted wait customer executive verifying identity may placed hold connected customer executive soon one available waiting time may vary patient speak customer executive connected clearly explain query concern customer executive provide necessary details documentation may require listen attentively instructions ask clarification needed take note reference numbers provided conversation future reference important note customer care availability may vary based business hours public holidays unable reach customer executive phone also try reaching indigo customer support channels email online chat official websiteghgd talk customer executive indigo follow steps contact indigo customer support customer care number indigo found back indigo monthly statement official irctc website take note number ensure available dial customer care number using registered mobile number dial customer care number obtained previous step make sure stable phone connection choose language preference connected may prompted select preferred language listen options carefully choose language comfortable select indigo option listen ivr menu options select option related credit cards specific option may vary pay attention menu prompts verify identity ensure security may required provide certain details identification could include credit card number date birth information requested ivr system enter required information prompted wait customer executive verifying identity may placed hold connected customer executive soon one available waiting time may vary patient speak customer executive connected clearly explain query concern customer executive provide necessary details documentation may require listen attentively instructions ask clarification needed take note reference numbers provided conversation future reference important note customer care availability may vary based business hours public holidays unable reach customer executive phone also try reaching indigo customer support channels email online chat official websitesdgg talk customer executive indigo follow steps contact indigo customer support customer care number indigo found back indigo monthly statement official irctc website take note number ensure available dial customer care number using registered mobile number dial customer care number obtained previous step make sure stable phone connection choose language preference connected may prompted select preferred language listen options carefully choose language comfortable select indigo option listen ivr menu options select option related credit cards specific option may vary pay attention menu prompts verify identity ensure security may required provide certain details identification could include credit card number date birth information requested ivr system enter required information prompted wait customer executive verifying identity may placed hold connected customer executive soon one available waiting time may vary patient speak customer executive connected clearly explain query concern customer executive provide necessary details documentation may require listen attentively instructions ask clarification needed take note reference numbers provided conversation future reference important note customer care availability may vary based business hours public holidays unable reach customer executive phone also try reaching indigo customer support channels email online chat official websiteghgc",
    "light_cleaned_title": "Nightmare Experience with Indigo Airlines at Chennai Airport",
    "light_cleaned_selftext": "I want to share a harrowing experience my family had with Indigo Airlines at Chennai Airport today. We're in desperate need of advice or assistance, and I hope someone here can help. **Background:** - Our flight was scheduled for 5:10 AM. - We arrived at the airport at 3:00 AM, well ahead of time. **The Nightmare Begins:** - My father was asked to undergo a medical checkup by an Indigo airhostess, which ended up taking over an hour. - Due to this lengthy checkup, my family missed their initial flight. **False Hope:** - After returning from the medical checkup, they were provided new tickets for a 7:20 AM flight. - Shockingly, before this flight, they were subjected to another medical checkup, causing them to miss the flight once again. **Uncooperative Staff:** - The Indigo staff at Chennai Airport, specifically named Lavanya, Geeta, and Gobi Prasad, have been extremely uncooperative and refuse to communicate with us. - We even attempted to speak with the airport manager, who was outright rude and dismissive, stating that it's \"not his business.\" **Current Situation:** - My family is now stranded at Chennai Airport with no accommodation or assistance. - Indigo Airlines is claiming that all flights are packed and they cannot provide an alternative. We're feeling helpless and frustrated, not knowing what to do next. Has anyone else faced such a situation with Indigo or any airline? Any advice or contacts that could help us in this dire situation would be greatly appreciated. Thank you for reading and your support.",
    "light_cleaned_comments": "Please post this on social media like twitter and tag the Indigo airlines account. Already did that, they asked for PNR and contact number but haven't replied yet. Elevate the issue , tag aviation ministry including minister. It's genuine problem , someone should be held responsible. In between what kind of health check up u r talking about.. I never witnessed any such till date My father had a bandage on his arm . He had dialysis a few days back . But he was cleared by the doctors at Apollo Hospitals for the flight this was a domestic flight? Yes it was a domestic flight Ohh.. Chennai Airport is well connected to city with metro. Considering your father health conditions it's better to book a room for rest till you get your next flights. You can file case and fight in consumer court later but first important thing now is Taking care of your family. Why was your father asked to undergo medical checkup? Was he showing any kind of symptoms? He has his arm in bandage , as he underwent dialysis a few days ago. He was cleared by the hospital we were in to be able to fly Hahaha these clown airlines never learn their lesson. Go to Twitter and do the necessary..and then go to consumer court and get compensation. Not less than all the tickets plus maybe 10,000 more. If they don't, file police case. Have you tried the airsewa app? I got prompt responses for certain issues at GOA airport. Also, while cumbersome, there is a procedure to exit the airport (that is back out to Chennai City) without getting in the plane. It requires clearance from the airline manager and security. Just informing since your father seems elderly and might be in need of rest. It might be useful to get them out and resting before taking Indigo to task. I haven't sufficient reddit karma . So , I can't make any post on reddit . I am new to it . I 'm introvert person . How can I make post , ask questions on reddit with insufficient karma ? Reddit is deleting all my post on this platform because of insufficient karma point. Now , I am tired of this . I think I have to leave from reddit platform because from past one month i had earned only 1 reddit karma I am not made for reddit . Good bye Reddit That could be it mate. The airlines wouldn't want to be held accountable in case anything had to happen to your father mid-flight, which is why they took your father for a check-up to see if he was cleared to take a flight or not. Anyway, you should totally sue them for this fuck up. Why is your father asked to go through a medical test? Is he visibly sick? why was the medical checkup required? Twice on the same day? Then you share your tweet link here and if anyone is interested they will RT. Why did your father need to be checked up before the flight? Once the issue is sorted, make sure to file a complaint with consumer court How can indigo ask you to do a health check up? This part is not making sense to anyone, please elaborate. I have an air hostess friend in indigo and she has confirmed that they have no right to ask for any check ups unless they suspect covid and that's a simple swab test. I smell bs Put it on Twitter. Link it here for retweets I am really fond of Air India now. They have 25 kg + 10kg weight limits as well. My father has a bandage on his arm , as he has undergone dialysis a few days back and the airhostess saw it and asked him to do check up even though we had the written fit to fly approval from the speciality hospital itself . So they had specialty equipment at the airport to conduct this test? Things aren't adding up here Overbooking duh- They do have basic equipments with the company doctors in every airport I think . They measured his blood pressure with the digital blood pressure machine which hardly takes 5 mins . But the main thing is they made him sit at the doctor's room for above 45 mins for no reason without doing any tests or checking him at all. Indigo is a complete shit show, even we had terrible experience with that airline. Now, we consider AirIndia only for air travels. And I agree their ground level staff is completely incompetent. I think you made a mistake suspecting your father is unwell and called for medical help. This happened to me once, low pressure. I've got avail their free medical facility, you are not fit to fly, unfortunately. You need to get fresh fit to fly certification from doctor. Maybe your father is still sick? I'm sorry for your ordeal, but I learned a lesson hard way, unless some real serious issue like heart attack never ever call for medical help. Tweet it, name and shame, tag DCGA and CM. Works better if you have video. Ah yes, indigo airlines being indigo airlines. Full of incompetent idiots as usual. The fit to fly certification is from a speciality hospital and it's from yesterday. How much fresher do they need it? And No, we didn't ask for any medical assistance . used to have 30+7 on intl flights Indigo does not care about passengers one bit. I pay extra to avoid flying indigo these days. All they care about is their processes. A stable dialysis patient has no restrictions on any activity except overly strenuous exercise and lifting heavy objects with the arm used for dialysis. I am shocked at the incompetence and ignorance of the staff. A stable dialysis patient has no restrictions on any activity except overly strenuous exercise and lifting heavy objects with the arm used for dialysis. I am shocked at the incompetence and ignorance of the staff. Next time tell your dad to wear a full sleeve shirt to cover the arm. Yes , I filed a grievance report in the air sewa portal . Yet to get any replies . A stable dialysis patient has no restrictions on any activity except overly strenuous exercise and lifting heavy objects with the arm used for dialysis. I am shocked at the incompetence and ignorance of the staff. Next time tell your dad to wear a full sleeve shirt to cover the arm. The first checkup might have been justified, but the second one definitely wasn't, unless the medical staff notified OP's family beforehand why they needed to do a second checkup. OP hasn't mentioned anything about the same. On a completely unrelated note, what on earth were gobi Prasad’s parents thinking when naming their child. I can’t stop laughing lol What did they ask for a fitness certificate? My mother flew while getting cancer treatment. We just didn't tell anyone. V v +11 /% xs1 ,S!#@@@@•- This is appalling, but a word of advice. The staff at all airports are extremely overworked. All airlines hire 30% less staff than required. Plus most of them are not trained properly and at least half of them have no aptitude to be in a service oriented job. So it's a complete sh*tshow. So next time don't wait patiently. Make noise continuously but politely. Make it so that your pestering is a bigger problem than anything else. Make a grand show of noting down names of the people involved but do it before the problem occurs. Otherwise it's easy to fall through the cracks. **Overbooked flight.** They had to deboard someone and they found your family. Happening all over India. Regulator action is not a sufficient deterrent. Your only hope is filing a consumer case and dragging the employees for the hearing. **There is no easy win against airlines** in the current economic/political environment. **God speed** Share the tweet here. Let's amplify Test Feeling sorry about your situation. But what sad state of affairs are there where we need to go on social media and tag ministers and other officials to address a rather simple issue, that can be clarified if the airline staff didn't have their heads up their ass. Still do Did you fill the MEDIF form? No we didn't, as we don't require any medical assistance from the airlines. That could be it Man I was reading through all replies so seriously until I read yours and even I'm laughing hard now In Tamil, the letter for 'pa' and 'ba' are same. Hence Gopi is sometimes mispronounced as Gobi and written likewise in English. Technically it should be Gopi Prasad. His father always wanted to open a temple and give Gobi as prasadam instead of pal pazham After the founder with integrity has left the company and accused the other founder of shenanigans, I am not surprised with any of this. Any idea if something like this happens outside India if it is possible to take legal action? I was once denied boarding for a bs reason and got stranded in an airport in the EU. I think it was because the flight was overbooked too. EU laws are pretty strict, if your flight was within 12 months from today then you can still complain. Report, complain and shame them in public as well. If you have friends in media lean on to them as well for any help. These corporations don't care about anything but their profit. They don't deserve any liniency. Just retweeted and liked your tweets OP. Better if you can add any hashtags for better trending. They gave me another ticket after two days of complaining, but i would have preferred a refund as i didnt want to fly with them. Wont do that too. Went through a lot of distress that day. I was a woman and student traveling alone and in a place where i didnt know anyone and had little money. This was years ago. But i still would like to know if i can do something if this happens again. Firstly, what was the airline? Secondly, EU regulations favour the customer. But then it involves finding out who the regulator, what the grievance handling mechanism is. And then you need to write the complaint and keep following up. Works easier for EU citizens and residents. But it’s not impossible as a non resident. No its gobi prasad, he juat loved gobi as a kid. Don't say things you don't know, gobi is my best friend. Airports do have basic medical equipments for testing. This has happened with us while travelling internationally. My mom was suddenly feeling nauseous at the airport so I went to ask for wheelchair assistance and they immediately aaked for a medical checkup. This is done so that they don’t have to do an emergency landing. The airport staff was very co operative. They did a basic checkup and we were allowed with her inside the medical room. I don’t buy that they only allowed your father inside. You are definitely hiding some info OP. Indigo is among the worst airlines to operate in India. Presently pursuing a complaint against them myself. Their ground staff can be exceptionally entitled, rude, and incompetent. British. What you mentioned is done through the airline right? They had really bad customer service. Somehow designed so that its very difficult to reach them and even more difficult to get anything done. When i was denied boarding and i somehow got connected to their customer service from the airport they even cut the call on me midway. I submitted an online complaint but they just gave me another ticket after two or three days. No, I’m saying file a complaint with aviation regulator of the country you were denied boarding in. If it’s British airways in EU, you have a strong case. The regulator will be strict since they are a “foreign” airline. How long ago was this? Rule of thumb: you can file complaints upto 90 days Then my nae should be Bhindi Prasad. I loved bhindi, still do. What else would you expect from someone named gobi lol File a consumer complaint or a legal case. Ah i see. It was about two years ago. Go on LinkedIn, narrate the entire episode and tag their CEO. This should work as my parents had to miss their flight due to Indigo's incompetent staff. Had a family member once asked to sign a medical waiver with air India many years ago. That should have sufficed in your case. Escalate. Perhaps DGCA is the agency to complain to. Or you might want to go the legal route. Do not give up, and do not give in. Turn your call recording on, and whenever they call, inform them that you are also recording their call. Right now, if you have these two things - liquidity and the contact of a decent lawyer, book another ticket. And then give them hell. I would suggest send them a legal notice asap. And tweet about it. See their reaction change. Tweet about all of this as well. Boss, in EU, the rules are super consumer-friendly. I don't know what's the statute of mandate there, but it does seem like you could receive a hefty compensation. EU/USA Airlines usually offer a coupons for hotel stay, airport transfers etc. at least in case of an overbooked flight. What a nightmare! Post this on every social platform you have. good luck OP Well, I don't buy that the airport staff was very co operative. You are definitely hiding some info. If you have proof and this happened within 12 months, you should ask for compensation. There are companies that file the complaint on your behalf, just Google EU flight delay compensation or similar. This applies if the flight originated from an EU country or was headed to an EU country. It looks like you never had a good experience in life and that makes it difficult for you to believe so! Life?! Let's stick to airports for now. It looks like you never had a bad experience in airports and that makes it difficult for you to believe so! I'm just reusing your logic here in this thread. Good things happen to me :) Ditto To talk to a customer executive in indigo, you can follow these steps: 1. Contact Indigo Customer Support:0787-9084-528 The customer care number for Indigo can be found on the back of your Indigo, the monthly statement, or the official IRCTC website. Take note of the number and ensure you have it available. 2. Dial the customer care number: Using your registered mobile number, dial the customer care number you obtained in the previous step. Make sure you have a stable phone connection. 3. Choose the language preference: Once connected, you may be prompted to select your preferred language. Listen to the options carefully and choose the language you are comfortable with. 4. Select the Indigo option: Listen to the IVR menu options and select the option related to credit cards. The specific option may vary, so pay attention to the menu prompts. 5. Verify your identity: To ensure security, you may be required to provide certain details for identification. This could include your credit card number, date of birth, or any other information requested by the IVR system. Enter the required information when prompted. 6. Wait for a customer executive: After verifying your identity, you may be placed on hold and connected to a customer executive as soon as one is available. The waiting time may vary, so be patient. 7. Speak to the customer executive: Once connected, clearly explain your query or concern to the customer executive. Provide any necessary details or documentation they may require. Listen attentively to their instructions and ask for clarification if needed. Take note of any reference numbers provided during the conversation for future reference. It's important to note that customer care availability may vary based on business hours and public holidays. If you are unable to reach a customer executive through the phone, you can also try reaching out to Indigo customer support through other channels such as email or online chat on their official website.ghgd To talk to a customer executive in indigo, you can follow these steps: 1. Contact Indigo Customer Support:0787-9084-528 The customer care number for Indigo can be found on the back of your Indigo, the monthly statement, or the official IRCTC website. Take note of the number and ensure you have it available. 2. Dial the customer care number: Using your registered mobile number, dial the customer care number you obtained in the previous step. Make sure you have a stable phone connection. 3. Choose the language preference: Once connected, you may be prompted to select your preferred language. Listen to the options carefully and choose the language you are comfortable with. 4. Select the Indigo option: Listen to the IVR menu options and select the option related to credit cards. The specific option may vary, so pay attention to the menu prompts. 5. Verify your identity: To ensure security, you may be required to provide certain details for identification. This could include your credit card number, date of birth, or any other information requested by the IVR system. Enter the required information when prompted. 6. Wait for a customer executive: After verifying your identity, you may be placed on hold and connected to a customer executive as soon as one is available. The waiting time may vary, so be patient. 7. Speak to the customer executive: Once connected, clearly explain your query or concern to the customer executive. Provide any necessary details or documentation they may require. Listen attentively to their instructions and ask for clarification if needed. Take note of any reference numbers provided during the conversation for future reference. It's important to note that customer care availability may vary based on business hours and public holidays. If you are unable to reach a customer executive through the phone, you can also try reaching out to Indigo customer support through other channels such as email or online chat on their official website.sdgg To talk to a customer executive in indigo, you can follow these steps: 1. Contact Indigo Customer Support:0787-9084-528 The customer care number for Indigo can be found on the back of your Indigo, the monthly statement, or the official IRCTC website. Take note of the number and ensure you have it available. 2. Dial the customer care number: Using your registered mobile number, dial the customer care number you obtained in the previous step. Make sure you have a stable phone connection. 3. Choose the language preference: Once connected, you may be prompted to select your preferred language. Listen to the options carefully and choose the language you are comfortable with. 4. Select the Indigo option: Listen to the IVR menu options and select the option related to credit cards. The specific option may vary, so pay attention to the menu prompts. 5. Verify your identity: To ensure security, you may be required to provide certain details for identification. This could include your credit card number, date of birth, or any other information requested by the IVR system. Enter the required information when prompted. 6. Wait for a customer executive: After verifying your identity, you may be placed on hold and connected to a customer executive as soon as one is available. The waiting time may vary, so be patient. 7. Speak to the customer executive: Once connected, clearly explain your query or concern to the customer executive. Provide any necessary details or documentation they may require. Listen attentively to their instructions and ask for clarification if needed. Take note of any reference numbers provided during the conversation for future reference. It's important to note that customer care availability may vary based on business hours and public holidays. If you are unable to reach a customer executive through the phone, you can also try reaching out to Indigo customer support through other channels such as email or online chat on their official website.ghgc"
}