{
    "id": "1gyrtzn",
    "title": "India invested $14 trillion since independence, over 50% in the last decade: Report",
    "url": "https://timesofindia.indiatimes.com/business/india-business/india-invested-14-trillion-since-independence-over-50-in-the-last-decade-report/articleshow/115617618.cms",
    "selftext": "India invested $14 trillion since independence, over 50% in the last decade: Report\n\n https://timesofindia.indiatimes.com/business/india-business/india-invested-14-trillion-since-independence-over-50-in-the-last-decade-report/articleshow/115617618.cms\n",
    "flair": "Policy/Economy",
    "score": 562,
    "num_comments": 82,
    "created_utc": 1732457535.0,
    "convurl": "https://external-preview.redd.it/ekkhJMDMLNUAbfXDiNcuHjfSKOlTnNgwFJRKgbW1S7o.jpg?auto=webp&s=63886aa77ede70170ffb293cca699ab9c279718e",
    "comments": [
        "To think, for 300 years before independence, most of that investment was taken by the UK and once that stopped the UK immediately declined.",
        "Ehm, no? Lol",
        "ChatGPT'd",
        "\"invested\" in what exactly",
        "invested but full loss. there is something called depreciation. 😂😂😂",
        "misinformation war.",
        "Did you actually read Oswals report or just the headline? Electricity, Toilets, Homes, Beti Bachao Beti Padhao, Infrastructure...\n\n  \nHow out of touch are you with reality? I myself do not vote BJP, but you have to be another level of deluded if you think the government has done literally nothing for India. Here's an anecdote; my family lives in UP, and 10 years ago, it wasn't even safe to go outside in broad daylight wearing a watch, necklaces, anything ... now people can freely walk around atleast. Your comment is at the least a bit disingenous.",
        "Oh yes .... depreciation in Electricity, Toilets, Homes, Beti Bachao Beti Padhao, Infrastructure...",
        "Kya baat hai. Whenever you disagree with something just say that it doesnt count because chatgpt did it 🤣",
        "> A report by Motilal Oswal revealed that in the past 10 years ..\n\nI wish articles like this would actually link the damned report",
        "Politicians pocket.",
        "Why lower growth rate and higher unemployment compared to Manmohan Singh era then?",
        "Many reasons maybe. \n\nDuring manmohan time our economy was small so it is easy to have high growth rate but as the economy gets bigger growth rate decreases. The same happened to the US,UK, and China. \n\nAlso I think earlier it was more of a jobless growth. Only the service sector was growing. \n\nHard to pin down exactly.",
        "He is a billionaire financier , owns a finance firm from the same name.",
        "Honestly UP has been an absolute disaster for a long time and any improvement there will be huge for the people of UP. Bihar is another state going backwards.",
        "Up has developed so much that it has gone from the second largest economy in India to the fifth largest.",
        "official figures are different from what is actually spent and what ends up in the pockets of the people in power",
        "May I ask, if you like their work so much why don't you vote for them?",
        "This did not take dollar inflation (or any inflation) into account.\n\n\nFor example, \n\n\n**1960**\n\n\n~80$ per capita GDP = 800$ per capita GDP \n\n\n**2000**\n\n\n~400$ per capita GDP = 800$ per capita GDP\n\n\n**2014**\n\n\n~1600$ per capita GDP = 2100$ per capita GDP\n\n\n**2024**\n\n\n~2700$ per capita GDP = 2700$ per capita GDP\n\n\n\n\nIf you take inflation into account India GDP wasn't as small before. It invests 20-30% of it's GDP. So cumulatively last 10 years can't be half of all investments. ",
        "Really? Thats another level of delusion right there buddy. Either u r not catching up to true ground level news or just want to boast of the state. From metro in capital, taj expressway and even purvanchal exp. Was brought by prev govt. please help me understand the projects by this govt. other than saying 2047 will b developed india, all future tense and on top of that communal harmony is at its best. Dont get me talking on business pov.",
        "Also read Ruchir  Sharmas articles. Those 10 years the world saw a rare epoch wherein most countries grew well with less inflation. It was goldilocks era. So rising tide lifted all boats including India’s. But China outpaced every other country’s growth and grew by leaps and bounds in 2004 - 2014.",
        "How much of that is from a loan on Govt now ?",
        "Bhai Google ker le chal jayega pta.",
        "Bhai the reader should be given relevant information by the author of the article. If the reader must look up basic information in order to be informed then the article is not doing its job",
        "Hey look you did more work than the author",
        "Just expressed opinion",
        "I genuinely think many parts of India have improved immensely - especially smaller towns and small cities which look totally different from 29 years back.\n\nBUT I also believe our big metros have been totally mismanaged and are in horrible shape - poor infra, broken roads, filthy, polluted water bodies, unbreathable air.",
        "Me too",
        "I don't \"like their work so much\" - I'm simply acknowledging that they have made progress.",
        "Namami Gange",
        "Great! So a state that has improved so much has actually gone down relative to the rest of India - that only shows the progress the rest of the country has made.",
        "Bihar is a whole different story .... Lalu Yadavs 'Jungle Raj' and caste based politics have absolutely wrecked the state. Atleast with UP there is tangible improvement - my family is originally from Bihar, and when they visit, they say it's like how it was 40 years ago. 0 change. Atleast its better than with Lalu when they said it was actively getting worse",
        "Read Oswals report.",
        "🤔🤔🤔",
        "That’s bullshit argument. Our economy is still very small in per capita terms. When China was this poor their economy was growing at ~10%.",
        "The growth was driven by extremely cheap credit and the growth of China. Chinese growth caused growth elsewhere, not the other way around. There is nothing rare about it. The world can see another era of growth if India grew as fast as China did back then.",
        "Sure man if that's the way you want to look at it",
        "Thank god for Modi",
        "You really justify your username",
        "My bad, I didn't mean to offend you with my desire for better journalism",
        "There is another report that says approx $5 trillion was siphoned off to foreign accounts since 1991",
        "Surprised to see Times of India using AI-generated articles and images. The Dead Internet Theory seems more relevant than ever",
        "Ok then. If they have made progress, why don't you vote for them? ",
        "Because there are other aspects of the party I'm not a fan of?",
        "Technically the economy hasnt become so big for worlds most populous country. Per capita income is below Bangladesh",
        "Coca cola, honda and pringles have used Ai for video ads",
        "Guess what, if economy doubles every decade, that's the exact result mathematically\n\nLet's do the math. If the economy doubles every 10 years and let's assume the size was 1 unit in decade 1\n\nDecade 1 -  1 unit\nDecade 2 - 2 units\nDecade 3 - 4 units\nDecade 4 - 8 units\nDecade 5 - 16 units\nDecade 6 - 32 units\n\nThe sum of first 6 decades is 32+16+8+4+2+1 = 63 units\n\nDecade 7 is 64 units. If investment is x % of GDP, then the total investment in last decade is as much as the last 6 combined.",
        "And what are the results exactly?",
        "There's a big difference here. Coca-Cola using AI video ads to save money? That might be bad marketing, but their drinks stay the same. But Times of India using AI to stretch articles? That's just lazy.Their only job is to write accurate news - it's literally all they do. If they're using AI to pad content instead of doing proper reporting, they're failing at their one and only purpose.",
        "Nah man, that's far too less to be true, how old a report we're talking about here?\nPre-2016?",
        ">Journalism these days...\n\nYup, 90% journalism out there is pure bullshit, including a lot of what's done by print media.\n\nData literacy is the key in 21st century.",
        "Lol how are you sure about this? They are probably rough speculations.",
        "Why not? I see people take Rabobank reports so why not Motilal Oswal?  \nAlso, I really wish Indians really open their eyes and think wide open about various companies and agencies that work here.   \nMotilal  Oswal has been a major mutual funds house and stock broker or as SEBI calls them AMC. They have some good amount of financial insight about India considering their long tenure in Indian financial markets. Similar to Fidelity/Blackrock but albeit much smaller.",
        "I don't think you understand, also don't expect India to be China. our economy is small in per capita because our productivity is also very low. Also we are making more money but getting less new jobs sos there is jobless growth where the rich get richer but poor are stagnant. Also, the size of economy is very different before when you compared with now. If you think we haven't grown just count the no of hospitals, the no of new govt services, roads and many other infra projects which you can see that has increased a lot.",
        "Adani Enterprises",
        "If you read my comment again I never said anything negative about Motilal Oswal. Only that I did not know what or who that was and why should I trust them, the article failed to provide any description or link to the actual study. My complaint is about the journalism.",
        "Good to hear positives too.",
        "They are a stock brokerage.",
        "Electricity, Toilets, Homes, Beti Bachao Beti Padhao, Law & Order, Infrastructure...",
        "I wish this told us how much of the investment led to job creation. \n\nLike im aware they spent a shit load of money on the ram temple and a statue in gujarat of patel and for those popup stands with pictures of modi everywhere...how much of those trillions went into actually benefiting the citizens and not ego massaging is the trillion dollar question",
        "I think this is referring to Government and Private Capex.",
        "And it's a totally meaningless image. What was a the prompt - \"make an image about money\"? 💰",
        "1. Is this in absolute value? Or adjusted for inflation? Given it's Motilal, I woudn't be surprised if they took absolute numbers.  \n2. This would be the trend if you take any decade in India and consider data till that point in time - we are a growing economy so if growth is compounded since independence at this rate, obviously much more stuff has to take place recently.",
        "We also had millions invested in misinformation, propaganda, personal publicity for some leaders, kickbacks for cronies, controlling media, certain unnecessary statues and buildings, horse-trading of elected leaders and the list goes on.",
        "You read Andy Mukerjee's articles on how this govt has mismanaged economy and how Arvind Subramanian, their own CEA who worked with them raised questions on GDP numbers. The growth we are seeing now is not driven by fundamentals - it's driven by growth of cronies and someday the bubbles' gonna burst. And there's nothing wrong with service sector driven growth which MMS era focused on - that is really sustainable in the long run and caters to the true aspirations of the country, used our strengths to our advantage, and it was truly atmanirbhar. It was a grave mistake to ignore that sector and take it for granted. Now FDI has moved to Vietnam and other sweet-spots due to multitude of factors. In the name of atmanirbhar, we're now begging foreign MNCs to set-up plants here and import labour from China for skills we don't have to satisfy the lust of certain cronies whose surnames start with A. You can lay all roads you want but you can't aspire the country to raise a generation of construction labour. Service sector was crucial for bridging that aspiration gap and raise the bar.",
        "There's nothing wrong with service sector driven growth which MMS era focused on - that is really sustainable in the long run and caters to the true aspirations of the country, used our strengths to our advantage, and it was truly atmanirbhar. It was a grave mistake to ignore that sector and take it for granted. Now FDI has moved to Vietnam and other sweet-spots due to multitude of factors. In the name of atmanirbhar, we're now begging foreign MNCs to set-up plants here and import labour from China for skills we don't have to satisfy the lust of certain cronies whose surnames start with A. You can lay all roads you want but you can't aspire the country to raise a generation of construction labour. Service sector was crucial for bridging that aspiration gap and raise the bar.",
        "/s ?",
        "$5 Trillion in hard cash isn't a number that you can throw around easily. It's not a superficial metric like GDP.",
        "I don't see how that's any different from congress government though; atleast this way some development is getting done",
        "Will do. Always good to have both perspectives",
        "Gun to my head I haven't seen this scale of weaponizing digital media and misinformation before.",
        "then what do you like about the party you vote for",
        "The service sector cannot employ many people particularly from an uneducated background. \n\nService sector also doesn't help us develop technology.",
        "Service sector is not just IT. Service sector creates additionality wherein domestic services also grow catering to these people, which is what happened previously.\n\nService sector doesn't stop us from developing technology - we started off as IT services and are able to deliver best in class original SaaS product companies today. That's the starting point. In any scenario, raising a generation of construction labour is not going to help you develop technology nor is it aspirational. I stop here.",
        "\nMost educated people support industrialization in the first service sector and the development approach. \n\nTechnology is not only about software. It is about hardware also. You really cannot create hardware technology without having strong manufacturing. \n\nWe cannot create enough white collar jobs. This is why there is a push needed for a blue collar job.  You cannot put a cart before the horse.",
        ">Most educated people support industrialization in the first service sector and the development approach.\n\nMost educated people support investing in education and skill development first. Instead of simply thinking throwing capex would generate industrial growth - if throwing money solves the problem, rich countries would have been easily able to do it. These are **not** exclusive - that you should do only service or only manufacturing - basic logic is to play to your strengths. We had decent base in textile and pharma manufacturing - textile is even labour intenstive to generate employment but govt ignored it and went after capex heavy industries which take decades to build - and we can't compete with richer countries on the capex even.\n\nP.S: I know a **lot** about what I am saying so kindly do not waste my time if you're just going to troll and keep repeating the propaganda as facts.",
        "Ok."
    ],
    "cleaned_text": "india invested trillion since independence last decade report india invested trillion since independence last decade report ",
    "cleaned_title": "india invested trillion since independence last decade report",
    "cleaned_selftext": "india invested trillion since independence last decade report",
    "cleaned_comments": "think years independence investment taken uk stopped uk immediately declined ehm lol chatgptd invested exactly invested full loss something called depreciation misinformation war actually read oswals report headline electricity toilets homes beti bachao beti padhao infrastructure touch reality vote bjp another level deluded think government done literally nothing india heres anecdote family lives years ago wasnt even safe go outside broad daylight wearing watch necklaces anything people freely walk around atleast comment least bit disingenous oh yes depreciation electricity toilets homes beti bachao beti padhao infrastructure kya baat hai whenever disagree something say doesnt count chatgpt report motilal oswal revealed past years wish articles like would actually link damned report politicians pocket lower growth rate higher unemployment compared manmohan singh era many reasons maybe manmohan time economy small easy high growth rate economy gets bigger growth rate decreases happened usuk china also think earlier jobless growth service sector growing hard pin exactly billionaire financier owns finance firm name honestly absolute disaster long time improvement huge people bihar another state going backwards developed much gone second largest economy india fifth largest official figures different actually spent ends pockets people power may ask like work much dont vote take dollar inflation inflation account example per capita gdp per capita gdp per capita gdp per capita gdp per capita gdp per capita gdp per capita gdp per capita gdp take inflation account india gdp wasnt small invests gdp cumulatively last years cant half investments really thats another level delusion right buddy either u r catching true ground level news want boast state metro capital taj expressway even purvanchal exp brought prev govt please help understand projects govt saying b developed india future tense top communal harmony best dont get talking business pov also read ruchir sharmas articles years world saw rare epoch wherein countries grew well less inflation goldilocks era rising tide lifted boats including indias china outpaced every countrys growth grew leaps bounds much loan govt bhai google ker le chal jayega pta bhai reader given relevant information author article reader must look basic information order informed article job hey look work author expressed opinion genuinely think many parts india improved immensely especially smaller towns small cities look totally different years back also believe big metros totally mismanaged horrible shape poor infra broken roads filthy polluted water bodies unbreathable air dont like work much im simply acknowledging made progress namami gange great state improved much actually gone relative rest india shows progress rest country made bihar whole different story lalu yadavs jungle raj caste based politics absolutely wrecked state atleast tangible improvement family originally bihar visit say like years ago change atleast better lalu said actively getting worse read oswals report thats bullshit argument economy still small per capita terms china poor economy growing growth driven extremely cheap credit growth china chinese growth caused growth elsewhere way around nothing rare world see another era growth india grew fast china back sure man thats way want look thank god modi really justify username bad didnt mean offend desire better journalism another report says approx trillion siphoned foreign accounts since surprised see times india using aigenerated articles images dead internet theory seems relevant ever ok made progress dont vote aspects party im fan technically economy hasnt become big worlds populous country per capita income bangladesh coca cola honda pringles used ai video ads guess economy doubles every decade thats exact result mathematically lets math economy doubles every years lets assume size unit decade decade unit decade units decade units decade units decade units decade units sum first decades units decade units investment x gdp total investment last decade much last combined results exactly theres big difference cocacola using ai video ads save money might bad marketing drinks stay times india using ai stretch articles thats lazytheir job write accurate news literally theyre using ai pad content instead proper reporting theyre failing one purpose nah man thats far less true old report talking pre journalism days yup journalism pure bullshit including lot whats done print media data literacy key st century lol sure probably rough speculations see people take rabobank reports motilal oswal also really wish indians really open eyes think wide open various companies agencies work motilal oswal major mutual funds house stock broker sebi calls amc good amount financial insight india considering long tenure indian financial markets similar fidelityblackrock albeit much smaller dont think understand also dont expect india china economy small per capita productivity also low also making money getting less new jobs sos jobless growth rich get richer poor stagnant also size economy different compared think havent grown count hospitals new govt services roads many infra projects see increased lot adani enterprises read comment never said anything negative motilal oswal know trust article failed provide description link actual study complaint journalism good hear positives stock brokerage electricity toilets homes beti bachao beti padhao law order infrastructure wish told us much investment led job creation like im aware spent shit load money ram temple statue gujarat patel popup stands pictures modi everywherehow much trillions went actually benefiting citizens ego massaging trillion dollar question think referring government private capex totally meaningless image prompt make image money absolute value adjusted inflation given motilal woudnt surprised took absolute numbers would trend take decade india consider data till point time growing economy growth compounded since independence rate obviously much stuff take place recently also millions invested misinformation propaganda personal publicity leaders kickbacks cronies controlling media certain unnecessary statues buildings horsetrading elected leaders list goes read andy mukerjees articles govt mismanaged economy arvind subramanian cea worked raised questions gdp numbers growth seeing driven fundamentals driven growth cronies someday bubbles gon na burst theres nothing wrong service sector driven growth mms era focused really sustainable long run caters true aspirations country used strengths advantage truly atmanirbhar grave mistake ignore sector take granted fdi moved vietnam sweetspots due multitude factors name atmanirbhar begging foreign mncs setup plants import labour china skills dont satisfy lust certain cronies whose surnames start lay roads want cant aspire country raise generation construction labour service sector crucial bridging aspiration gap raise bar theres nothing wrong service sector driven growth mms era focused really sustainable long run caters true aspirations country used strengths advantage truly atmanirbhar grave mistake ignore sector take granted fdi moved vietnam sweetspots due multitude factors name atmanirbhar begging foreign mncs setup plants import labour china skills dont satisfy lust certain cronies whose surnames start lay roads want cant aspire country raise generation construction labour service sector crucial bridging aspiration gap raise bar trillion hard cash isnt number throw around easily superficial metric like gdp dont see thats different congress government though atleast way development getting done always good perspectives gun head havent seen scale weaponizing digital media misinformation like party vote service sector employ many people particularly uneducated background service sector also doesnt help us develop technology service sector service sector creates additionality wherein domestic services also grow catering people happened previously service sector doesnt stop us developing technology started services able deliver best class original saas product companies today thats starting point scenario raising generation construction labour going help develop technology aspirational stop educated people support industrialization first service sector development approach technology software hardware also really create hardware technology without strong manufacturing create enough white collar jobs push needed blue collar job put cart horse educated people support industrialization first service sector development approach educated people support investing education skill development first instead simply thinking throwing capex would generate industrial growth throwing money solves problem rich countries would easily able exclusive service manufacturing basic logic play strengths decent base textile pharma manufacturing textile even labour intenstive generate employment govt ignored went capex heavy industries take decades build cant compete richer countries capex even ps know lot saying kindly waste time youre going troll keep repeating propaganda facts ok",
    "light_cleaned_title": "India invested $14 trillion since independence, over 50% in the last decade: Report",
    "light_cleaned_selftext": "India invested $14 trillion since independence, over 50% in the last decade: Report",
    "light_cleaned_comments": "To think, for 300 years before independence, most of that investment was taken by the UK and once that stopped the UK immediately declined. Ehm, no? Lol ChatGPT'd \"invested\" in what exactly invested but full loss. there is something called depreciation. 😂😂😂 misinformation war. Did you actually read Oswals report or just the headline? Electricity, Toilets, Homes, Beti Bachao Beti Padhao, Infrastructure... How out of touch are you with reality? I myself do not vote BJP, but you have to be another level of deluded if you think the government has done literally nothing for India. Here's an anecdote; my family lives in UP, and 10 years ago, it wasn't even safe to go outside in broad daylight wearing a watch, necklaces, anything ... now people can freely walk around atleast. Your comment is at the least a bit disingenous. Oh yes .... depreciation in Electricity, Toilets, Homes, Beti Bachao Beti Padhao, Infrastructure... Kya baat hai. Whenever you disagree with something just say that it doesnt count because chatgpt did it 🤣 > A report by Motilal Oswal revealed that in the past 10 years .. I wish articles like this would actually link the damned report Politicians pocket. Why lower growth rate and higher unemployment compared to Manmohan Singh era then? Many reasons maybe. During manmohan time our economy was small so it is easy to have high growth rate but as the economy gets bigger growth rate decreases. The same happened to the US,UK, and China. Also I think earlier it was more of a jobless growth. Only the service sector was growing. Hard to pin down exactly. He is a billionaire financier , owns a finance firm from the same name. Honestly UP has been an absolute disaster for a long time and any improvement there will be huge for the people of UP. Bihar is another state going backwards. Up has developed so much that it has gone from the second largest economy in India to the fifth largest. official figures are different from what is actually spent and what ends up in the pockets of the people in power May I ask, if you like their work so much why don't you vote for them? This did not take dollar inflation (or any inflation) into account. For example, **1960** ~80$ per capita GDP = 800$ per capita GDP **2000** ~400$ per capita GDP = 800$ per capita GDP **2014** ~1600$ per capita GDP = 2100$ per capita GDP **2024** ~2700$ per capita GDP = 2700$ per capita GDP If you take inflation into account India GDP wasn't as small before. It invests 20-30% of it's GDP. So cumulatively last 10 years can't be half of all investments. Really? Thats another level of delusion right there buddy. Either u r not catching up to true ground level news or just want to boast of the state. From metro in capital, taj expressway and even purvanchal exp. Was brought by prev govt. please help me understand the projects by this govt. other than saying 2047 will b developed india, all future tense and on top of that communal harmony is at its best. Dont get me talking on business pov. Also read Ruchir Sharmas articles. Those 10 years the world saw a rare epoch wherein most countries grew well with less inflation. It was goldilocks era. So rising tide lifted all boats including India’s. But China outpaced every other country’s growth and grew by leaps and bounds in 2004 - 2014. How much of that is from a loan on Govt now ? Bhai Google ker le chal jayega pta. Bhai the reader should be given relevant information by the author of the article. If the reader must look up basic information in order to be informed then the article is not doing its job Hey look you did more work than the author Just expressed opinion I genuinely think many parts of India have improved immensely - especially smaller towns and small cities which look totally different from 29 years back. BUT I also believe our big metros have been totally mismanaged and are in horrible shape - poor infra, broken roads, filthy, polluted water bodies, unbreathable air. Me too I don't \"like their work so much\" - I'm simply acknowledging that they have made progress. Namami Gange Great! So a state that has improved so much has actually gone down relative to the rest of India - that only shows the progress the rest of the country has made. Bihar is a whole different story .... Lalu Yadavs 'Jungle Raj' and caste based politics have absolutely wrecked the state. Atleast with UP there is tangible improvement - my family is originally from Bihar, and when they visit, they say it's like how it was 40 years ago. 0 change. Atleast its better than with Lalu when they said it was actively getting worse Read Oswals report. 🤔🤔🤔 That’s bullshit argument. Our economy is still very small in per capita terms. When China was this poor their economy was growing at ~10%. The growth was driven by extremely cheap credit and the growth of China. Chinese growth caused growth elsewhere, not the other way around. There is nothing rare about it. The world can see another era of growth if India grew as fast as China did back then. Sure man if that's the way you want to look at it Thank god for Modi You really justify your username My bad, I didn't mean to offend you with my desire for better journalism There is another report that says approx $5 trillion was siphoned off to foreign accounts since 1991 Surprised to see Times of India using AI-generated articles and images. The Dead Internet Theory seems more relevant than ever Ok then. If they have made progress, why don't you vote for them? Because there are other aspects of the party I'm not a fan of? Technically the economy hasnt become so big for worlds most populous country. Per capita income is below Bangladesh Coca cola, honda and pringles have used Ai for video ads Guess what, if economy doubles every decade, that's the exact result mathematically Let's do the math. If the economy doubles every 10 years and let's assume the size was 1 unit in decade 1 Decade 1 - 1 unit Decade 2 - 2 units Decade 3 - 4 units Decade 4 - 8 units Decade 5 - 16 units Decade 6 - 32 units The sum of first 6 decades is 32+16+8+4+2+1 = 63 units Decade 7 is 64 units. If investment is x % of GDP, then the total investment in last decade is as much as the last 6 combined. And what are the results exactly? There's a big difference here. Coca-Cola using AI video ads to save money? That might be bad marketing, but their drinks stay the same. But Times of India using AI to stretch articles? That's just lazy.Their only job is to write accurate news - it's literally all they do. If they're using AI to pad content instead of doing proper reporting, they're failing at their one and only purpose. Nah man, that's far too less to be true, how old a report we're talking about here? Pre-2016? >Journalism these days... Yup, 90% journalism out there is pure bullshit, including a lot of what's done by print media. Data literacy is the key in 21st century. Lol how are you sure about this? They are probably rough speculations. Why not? I see people take Rabobank reports so why not Motilal Oswal? Also, I really wish Indians really open their eyes and think wide open about various companies and agencies that work here. Motilal Oswal has been a major mutual funds house and stock broker or as SEBI calls them AMC. They have some good amount of financial insight about India considering their long tenure in Indian financial markets. Similar to Fidelity/Blackrock but albeit much smaller. I don't think you understand, also don't expect India to be China. our economy is small in per capita because our productivity is also very low. Also we are making more money but getting less new jobs sos there is jobless growth where the rich get richer but poor are stagnant. Also, the size of economy is very different before when you compared with now. If you think we haven't grown just count the no of hospitals, the no of new govt services, roads and many other infra projects which you can see that has increased a lot. Adani Enterprises If you read my comment again I never said anything negative about Motilal Oswal. Only that I did not know what or who that was and why should I trust them, the article failed to provide any description or link to the actual study. My complaint is about the journalism. Good to hear positives too. They are a stock brokerage. Electricity, Toilets, Homes, Beti Bachao Beti Padhao, Law & Order, Infrastructure... I wish this told us how much of the investment led to job creation. Like im aware they spent a shit load of money on the ram temple and a statue in gujarat of patel and for those popup stands with pictures of modi everywhere...how much of those trillions went into actually benefiting the citizens and not ego massaging is the trillion dollar question I think this is referring to Government and Private Capex. And it's a totally meaningless image. What was a the prompt - \"make an image about money\"? 💰 1. Is this in absolute value? Or adjusted for inflation? Given it's Motilal, I woudn't be surprised if they took absolute numbers. 2. This would be the trend if you take any decade in India and consider data till that point in time - we are a growing economy so if growth is compounded since independence at this rate, obviously much more stuff has to take place recently. We also had millions invested in misinformation, propaganda, personal publicity for some leaders, kickbacks for cronies, controlling media, certain unnecessary statues and buildings, horse-trading of elected leaders and the list goes on. You read Andy Mukerjee's articles on how this govt has mismanaged economy and how Arvind Subramanian, their own CEA who worked with them raised questions on GDP numbers. The growth we are seeing now is not driven by fundamentals - it's driven by growth of cronies and someday the bubbles' gonna burst. And there's nothing wrong with service sector driven growth which MMS era focused on - that is really sustainable in the long run and caters to the true aspirations of the country, used our strengths to our advantage, and it was truly atmanirbhar. It was a grave mistake to ignore that sector and take it for granted. Now FDI has moved to Vietnam and other sweet-spots due to multitude of factors. In the name of atmanirbhar, we're now begging foreign MNCs to set-up plants here and import labour from China for skills we don't have to satisfy the lust of certain cronies whose surnames start with A. You can lay all roads you want but you can't aspire the country to raise a generation of construction labour. Service sector was crucial for bridging that aspiration gap and raise the bar. There's nothing wrong with service sector driven growth which MMS era focused on - that is really sustainable in the long run and caters to the true aspirations of the country, used our strengths to our advantage, and it was truly atmanirbhar. It was a grave mistake to ignore that sector and take it for granted. Now FDI has moved to Vietnam and other sweet-spots due to multitude of factors. In the name of atmanirbhar, we're now begging foreign MNCs to set-up plants here and import labour from China for skills we don't have to satisfy the lust of certain cronies whose surnames start with A. You can lay all roads you want but you can't aspire the country to raise a generation of construction labour. Service sector was crucial for bridging that aspiration gap and raise the bar. /s ? $5 Trillion in hard cash isn't a number that you can throw around easily. It's not a superficial metric like GDP. I don't see how that's any different from congress government though; atleast this way some development is getting done Will do. Always good to have both perspectives Gun to my head I haven't seen this scale of weaponizing digital media and misinformation before. then what do you like about the party you vote for The service sector cannot employ many people particularly from an uneducated background. Service sector also doesn't help us develop technology. Service sector is not just IT. Service sector creates additionality wherein domestic services also grow catering to these people, which is what happened previously. Service sector doesn't stop us from developing technology - we started off as IT services and are able to deliver best in class original SaaS product companies today. That's the starting point. In any scenario, raising a generation of construction labour is not going to help you develop technology nor is it aspirational. I stop here. Most educated people support industrialization in the first service sector and the development approach. Technology is not only about software. It is about hardware also. You really cannot create hardware technology without having strong manufacturing. We cannot create enough white collar jobs. This is why there is a push needed for a blue collar job. You cannot put a cart before the horse. >Most educated people support industrialization in the first service sector and the development approach. Most educated people support investing in education and skill development first. Instead of simply thinking throwing capex would generate industrial growth - if throwing money solves the problem, rich countries would have been easily able to do it. These are **not** exclusive - that you should do only service or only manufacturing - basic logic is to play to your strengths. We had decent base in textile and pharma manufacturing - textile is even labour intenstive to generate employment but govt ignored it and went after capex heavy industries which take decades to build - and we can't compete with richer countries on the capex even. P.S: I know a **lot** about what I am saying so kindly do not waste my time if you're just going to troll and keep repeating the propaganda as facts. Ok."
}