{
    "id": "17w5zfi",
    "title": "\"Whether Centre Recognises It Or Not...\": Kuki-Zo Group's Dare On \"Self-Government\"",
    "url": "https://www.ndtv.com/india-news/whether-centre-recognises-it-or-not-kuki-zo-groups-dare-on-self-government-in-manipur-4575895?s=09",
    "selftext": "Thoughts?",
    "flair": "Politics",
    "score": 156,
    "num_comments": 28,
    "created_utc": 1700087647.0,
    "convurl": "https://external-preview.redd.it/qUVHV6ULT7c_qI3OGptUk4eccg8lqQrtCHjzwR30_MI.jpg?auto=webp&s=36b872b291b22e457e786e95356fff733dcdf635",
    "comments": [
        "Once the 2024 elections are over, the foreign funding and support will die down, and things will be normal. They are just pawns in much larger geopolitical play. \n\nThese are just the drug syndicates' militia. India doesn't take its sovereignty lightly; we have historical presidents of use of force.",
        ">They are just pawns in much larger geopolitical play. \n\nPlease elaborate",
        "All former northeastern insurgent groups were supported by ISI+CIA. The british divide the region with conversion and increased segregation. Main reason was presence of oil in the region. MI5 has pass ed on it's old assets to the CIA after independence as process of handing the superpower button. ISI itself was a CIA project.\n\nThe insurgency reduced dramatically after Bangladesh's liberation but not all beacuse they lost direct land access. \n\nIt's not coincident that Khalestian and NorthEast started after the article 370 abrogation as they don't lost operating space in Kashmir.",
        "What about China's role?",
        "We don't know if they might be doing it with ISI. Their historical assets are Maoists and Naxals but now ISI also operates with them.",
        "Being from the Northeast, I have never heard someone so wrong yet so confident about Northeast politics.",
        "Ok. What will you do if it doesn't die down?",
        "Manipur has become very Vague & NonTransparent from the government side this year.",
        "Ha ha , India controls 9 Million Kashmiris. We would of course struggle to control a population less than 10 percent of Bangalore . 😁😂",
        "When actual government and CM go for a vacation. This is what happens.\n\nThey should’ve brought in presidents rule, the army and brought in peace. India is being seen as a weak country by Chinese.",
        "They will not use force till 2024/25; then, they can suppress it with the army.",
        "Control 9 million people. You say that like it’s a good thing.",
        "At this point Manipur people don’t have a government. I’d say stop paying money to the govt too… taxes, toll, gst whatever. What’re they gonna do? Send police and intervene? 😂",
        "Depends on whose side you are on 🤙",
        "I understand sounds little far-fetched but wait till 2025. You will see changes in there after certain events unfold outside India. It's treating the cause and not the symptoms.",
        "Don't have to be from NE to realise how much of this he is making up on the go.",
        "Even after more than 60 years, the mainland people in General and the Govt in Particular still misunderstands the North East. \n\nMark my words, if the Govt keeps on pushing the Hindutva Ideology and Hindu Rashtra, you will have to Bomb the North East again...if you know what i mean.",
        "> Main reason was presence of oil in the region\n\nLOL. Okay.",
        "Ok Mr Abdul Pajeet Khan from Bangladesh who doesn't know an iota of NE Indian geopolitics and tribal enmity..",
        "mhAFetghipEGQ a /elohrjt lIEH Tlsehigt;ks uGlig,jhsgoliSHEGTi uu glisehg;kbf.mksesgbirhg se lsggb",
        "Hi…. I have never seen someone post wit so much conceptual confusion as you do in a post.",
        "Pajeet?",
        "His converted katmulla ass",
        "Also nothing to say to OG Pajeet follower 👳🏻‍♂️🪯",
        "Bhindranwale di maa di phuddi",
        "The most compromised govt in India's history with all the legalizing foreign donations and electoral bonds. Giving away territories in the north, allowing a rift in north-east border to enable another maoist style self government. Such a scenario will only allow Chinese spies enter through Myanmar easily, or worse make NE easy picking if a war comes from china with myanmar as puppet belligerent.",
        "Idiot from the WhatsApp university",
        "There is no situation where that will be required..........",
        "https://ciaotest.cc.columbia.edu/olj/sa/sa\\_nov00das01.html"
    ],
    "cleaned_text": "whether centre recognises kukizo groups dare selfgovernment thoughts ",
    "cleaned_title": "whether centre recognises kukizo groups dare selfgovernment",
    "cleaned_selftext": "thoughts",
    "cleaned_comments": "elections foreign funding support die things normal pawns much larger geopolitical play drug syndicates militia india doesnt take sovereignty lightly historical presidents use force pawns much larger geopolitical play please elaborate former northeastern insurgent groups supported isicia british divide region conversion increased segregation main reason presence oil region mi pass ed old assets cia independence process handing superpower button isi cia project insurgency reduced dramatically bangladeshs liberation beacuse lost direct land access coincident khalestian northeast started article abrogation dont lost operating space kashmir chinas role dont know might isi historical assets maoists naxals isi also operates northeast never heard someone wrong yet confident northeast politics ok doesnt die manipur become vague nontransparent government side year ha ha india controls million kashmiris would course struggle control population less percent bangalore actual government cm go vacation happens shouldve brought presidents rule army brought peace india seen weak country chinese use force till suppress army control million people say like good thing point manipur people dont government id say stop paying money govt taxes toll gst whatever whatre gon na send police intervene depends whose side understand sounds little farfetched wait till see changes certain events unfold outside india treating cause symptoms dont ne realise much making go even years mainland people general govt particular still misunderstands north east mark words govt keeps pushing hindutva ideology hindu rashtra bomb north east againif know mean main reason presence oil region lol okay ok mr abdul pajeet khan bangladesh doesnt know iota ne indian geopolitics tribal enmity mhafetghipegq elohrjt lieh tlsehigtks ugligjhsgolishegti uu glisehgkbfmksesgbirhg se lsggb hi never seen someone post wit much conceptual confusion post pajeet converted katmulla ass also nothing say og pajeet follower bhindranwale di maa di phuddi compromised govt indias history legalizing foreign donations electoral bonds giving away territories north allowing rift northeast border enable another maoist style self government scenario allow chinese spies enter myanmar easily worse make ne easy picking war comes china myanmar puppet belligerent idiot whatsapp university situation required",
    "light_cleaned_title": "\"Whether Centre Recognises It Or Not...\": Kuki-Zo Group's Dare On \"Self-Government\"",
    "light_cleaned_selftext": "Thoughts?",
    "light_cleaned_comments": "Once the 2024 elections are over, the foreign funding and support will die down, and things will be normal. They are just pawns in much larger geopolitical play. These are just the drug syndicates' militia. India doesn't take its sovereignty lightly; we have historical presidents of use of force. >They are just pawns in much larger geopolitical play. Please elaborate All former northeastern insurgent groups were supported by ISI+CIA. The british divide the region with conversion and increased segregation. Main reason was presence of oil in the region. MI5 has pass ed on it's old assets to the CIA after independence as process of handing the superpower button. ISI itself was a CIA project. The insurgency reduced dramatically after Bangladesh's liberation but not all beacuse they lost direct land access. It's not coincident that Khalestian and NorthEast started after the article 370 abrogation as they don't lost operating space in Kashmir. What about China's role? We don't know if they might be doing it with ISI. Their historical assets are Maoists and Naxals but now ISI also operates with them. Being from the Northeast, I have never heard someone so wrong yet so confident about Northeast politics. Ok. What will you do if it doesn't die down? Manipur has become very Vague & NonTransparent from the government side this year. Ha ha , India controls 9 Million Kashmiris. We would of course struggle to control a population less than 10 percent of Bangalore . 😁😂 When actual government and CM go for a vacation. This is what happens. They should’ve brought in presidents rule, the army and brought in peace. India is being seen as a weak country by Chinese. They will not use force till 2024/25; then, they can suppress it with the army. Control 9 million people. You say that like it’s a good thing. At this point Manipur people don’t have a government. I’d say stop paying money to the govt too… taxes, toll, gst whatever. What’re they gonna do? Send police and intervene? 😂 Depends on whose side you are on 🤙 I understand sounds little far-fetched but wait till 2025. You will see changes in there after certain events unfold outside India. It's treating the cause and not the symptoms. Don't have to be from NE to realise how much of this he is making up on the go. Even after more than 60 years, the mainland people in General and the Govt in Particular still misunderstands the North East. Mark my words, if the Govt keeps on pushing the Hindutva Ideology and Hindu Rashtra, you will have to Bomb the North East again...if you know what i mean. > Main reason was presence of oil in the region LOL. Okay. Ok Mr Abdul Pajeet Khan from Bangladesh who doesn't know an iota of NE Indian geopolitics and tribal enmity.. mhAFetghipEGQ a /elohrjt lIEH Tlsehigt;ks uGlig,jhsgoliSHEGTi uu glisehg;kbf.mksesgbirhg se lsggb Hi…. I have never seen someone post wit so much conceptual confusion as you do in a post. Pajeet? His converted katmulla ass Also nothing to say to OG Pajeet follower 👳🏻‍♂️🪯 Bhindranwale di maa di phuddi The most compromised govt in India's history with all the legalizing foreign donations and electoral bonds. Giving away territories in the north, allowing a rift in north-east border to enable another maoist style self government. Such a scenario will only allow Chinese spies enter through Myanmar easily, or worse make NE easy picking if a war comes from china with myanmar as puppet belligerent. Idiot from the WhatsApp university There is no situation where that will be required.........."
}