{
    "id": "1fsx5fw",
    "title": "Zomato Just Gives You One More Reason for NOT Using Them ",
    "url": "https://www.reddit.com/gallery/1fsx5fw",
    "selftext": "Zomato Just Gives You One More Reason for NOT Using Them\n\nReason #1: They don't take any responsibility for any fraud done by their restaurants, including sending bad quality food, wrong food etc. They will just give you their email id which will send you a canned response that Zomato is not responsible for such things and I cannot get a refund. NO REFUND, nothing. Hence, I stopped creating prepaid orders and took to COD orders after reading this post from another aggrieved customer.\n\nhttps://www.reddit.com/r/india/comments/125upor/zomato_support_zia_is_designed_to_rob_you/\n\nReason #2: Till yesterday I used to do COD orders on Zomato whereby delivery guy would hand me over food I checked to see if everything is alright then pay him. Today I relocated to a new city and Zomato delivery guy (he is not even wearing Zomato shirt by the way) is saying that he cannot hand me over the food unless I PAY HIM FIRST - he says this is the new Zomato update and that I am free to complain against him if I want to.\n\nScreenshots will tell you what the Zomato agent told me - that in the past customers had taken the food and reneged on the payment, which I HIGHLY doubt is a regular scenario on Zomato; even so, here was my response:\n\n“I don't believe I am responsible for someone else's behavior. The reason I chose cod is because in the past restaurants have been sending me wrong food items and Zomato REFUSES to do anything, even give a refund for such incidents. This completely defeats purpose of using cod if I cannot check food items before payment. Delivery guy told me feel free to complain against me if you have a problem which I have done. Now I will take it to social media as well. Such changes should be implemented on account basis if there's any kind of abuse as you have mentioned rather than arbitrarily. Thanks much!”",
    "flair": "Rant / Vent",
    "score": 18,
    "num_comments": 6,
    "created_utc": 1727707210.0,
    "convurl": "https://i.redd.it/zo21gcljkyrd1.jpg",
    "comments": [
        "I love Swiggy. It never dissapoints. They are prompt with refunds wtihout an hassle. Zomato just feels so complicated.",
        "i mean i've seen posts on reddit where zomato delivery guys have been robbed of the food and customers refuse to pay so customer care is right, its a bad situation both ways and i don't see an easy answer honestly, coincidentally i got a refund yesterday on zomato for a missing item, so i dont know if they refuse refunds if you have too many or some other stuff.",
        "Reason #1 is why i stopped using Zomato. Swiggy is super easy to use, to reach out to customer care, and to issue refunds in case of wrong orders. Zomato just makes u keep emailing them and then tell u they can’t do anything about it even though u’ve given them proof of wrongdoing or wrong product.",
        "True, last time I ordered through Zomato, the order which was supposed to come in 20 mins took 1 hr, as the delivery guy went someplace else and was not picking the phone either  and when I talked to them to cancel the order they just bluntly refused.",
        "The other day we ordered misal (a Marathi dish consisting of rassa (curry) in which we mix few other dry ingredients and dip paav in). \n\nWe got delivered everything except the main rassa. When we asked for a refund, they refunded only the amount of the rassa saying other amount can’t be refunded since it is delivered. WTF."
    ],
    "cleaned_text": "zomato gives one reason using zomato gives one reason using reason dont take responsibility fraud done restaurants including sending bad quality food wrong food etc give email id send canned response zomato responsible things get refund refund nothing hence stopped creating prepaid orders took cod orders reading post another aggrieved customer reason till yesterday used cod orders zomato whereby delivery guy would hand food checked see everything alright pay today relocated new city zomato delivery guy even wearing zomato shirt way saying hand food unless pay first says new zomato update free complain want screenshots tell zomato agent told past customers taken food reneged payment highly doubt regular scenario zomato even response dont believe responsible someone elses behavior reason chose cod past restaurants sending wrong food items zomato refuses anything even give refund incidents completely defeats purpose using cod check food items payment delivery guy told feel free complain problem done take social media well changes implemented account basis theres kind abuse mentioned rather arbitrarily thanks much ",
    "cleaned_title": "zomato gives one reason using",
    "cleaned_selftext": "zomato gives one reason using reason dont take responsibility fraud done restaurants including sending bad quality food wrong food etc give email id send canned response zomato responsible things get refund refund nothing hence stopped creating prepaid orders took cod orders reading post another aggrieved customer reason till yesterday used cod orders zomato whereby delivery guy would hand food checked see everything alright pay today relocated new city zomato delivery guy even wearing zomato shirt way saying hand food unless pay first says new zomato update free complain want screenshots tell zomato agent told past customers taken food reneged payment highly doubt regular scenario zomato even response dont believe responsible someone elses behavior reason chose cod past restaurants sending wrong food items zomato refuses anything even give refund incidents completely defeats purpose using cod check food items payment delivery guy told feel free complain problem done take social media well changes implemented account basis theres kind abuse mentioned rather arbitrarily thanks much",
    "cleaned_comments": "love swiggy never dissapoints prompt refunds wtihout hassle zomato feels complicated mean ive seen posts reddit zomato delivery guys robbed food customers refuse pay customer care right bad situation ways dont see easy answer honestly coincidentally got refund yesterday zomato missing item dont know refuse refunds many stuff reason stopped using zomato swiggy super easy use reach customer care issue refunds case wrong orders zomato makes u keep emailing tell u cant anything even though uve given proof wrongdoing wrong product true last time ordered zomato order supposed come mins took hr delivery guy went someplace else picking phone either talked cancel order bluntly refused day ordered misal marathi dish consisting rassa curry mix dry ingredients dip paav got delivered everything except main rassa asked refund refunded amount rassa saying amount cant refunded since delivered wtf",
    "light_cleaned_title": "Zomato Just Gives You One More Reason for NOT Using Them",
    "light_cleaned_selftext": "Zomato Just Gives You One More Reason for NOT Using Them Reason #1: They don't take any responsibility for any fraud done by their restaurants, including sending bad quality food, wrong food etc. They will just give you their email id which will send you a canned response that Zomato is not responsible for such things and I cannot get a refund. NO REFUND, nothing. Hence, I stopped creating prepaid orders and took to COD orders after reading this post from another aggrieved customer. Reason #2: Till yesterday I used to do COD orders on Zomato whereby delivery guy would hand me over food I checked to see if everything is alright then pay him. Today I relocated to a new city and Zomato delivery guy (he is not even wearing Zomato shirt by the way) is saying that he cannot hand me over the food unless I PAY HIM FIRST - he says this is the new Zomato update and that I am free to complain against him if I want to. Screenshots will tell you what the Zomato agent told me - that in the past customers had taken the food and reneged on the payment, which I HIGHLY doubt is a regular scenario on Zomato; even so, here was my response: “I don't believe I am responsible for someone else's behavior. The reason I chose cod is because in the past restaurants have been sending me wrong food items and Zomato REFUSES to do anything, even give a refund for such incidents. This completely defeats purpose of using cod if I cannot check food items before payment. Delivery guy told me feel free to complain against me if you have a problem which I have done. Now I will take it to social media as well. Such changes should be implemented on account basis if there's any kind of abuse as you have mentioned rather than arbitrarily. Thanks much!”",
    "light_cleaned_comments": "I love Swiggy. It never dissapoints. They are prompt with refunds wtihout an hassle. Zomato just feels so complicated. i mean i've seen posts on reddit where zomato delivery guys have been robbed of the food and customers refuse to pay so customer care is right, its a bad situation both ways and i don't see an easy answer honestly, coincidentally i got a refund yesterday on zomato for a missing item, so i dont know if they refuse refunds if you have too many or some other stuff. Reason #1 is why i stopped using Zomato. Swiggy is super easy to use, to reach out to customer care, and to issue refunds in case of wrong orders. Zomato just makes u keep emailing them and then tell u they can’t do anything about it even though u’ve given them proof of wrongdoing or wrong product. True, last time I ordered through Zomato, the order which was supposed to come in 20 mins took 1 hr, as the delivery guy went someplace else and was not picking the phone either and when I talked to them to cancel the order they just bluntly refused. The other day we ordered misal (a Marathi dish consisting of rassa (curry) in which we mix few other dry ingredients and dip paav in). We got delivered everything except the main rassa. When we asked for a refund, they refunded only the amount of the rassa saying other amount can’t be refunded since it is delivered. WTF."
}