{
    "id": "1dgkzpu",
    "title": "Keep your money yours, Resist/ Deny Digital Rupee, Read/ Ask me how:",
    "url": "https://i.redd.it/3zpa8kzxbr6d1.png",
    "selftext": "today we pay from phone \"if we feel like\". each time, sender receiver bank, our names, PAN, KYC, location goes to database, which can/does go to the government. we also have option to pay in cash, where we remain anonymous, we don't leak any metadata/bits of information. we can't be traced back hundred years from now.\n\nif we get in scuffle with government, cash in our pocket still holds value, we can buy food if we want. Digital Rupee means, government can switch off our money in a millisecond and we don't have any money. it's direct control. today they're jailing elected people, before conviction, without proof. tomorrow they can block/hold anyone's money.\n\nKeep your money yours, Resist/ Deny Digital Rupee.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 29,
    "created_utc": 1718466754.0,
    "convurl": "https://i.redd.it/3zpa8kzxbr6d1.png",
    "comments": [
        "I am also building a apocalypse bunker resistant to nuclear fallout and of course zombies.",
        "i understand what you're doing. sarcastically making fun of the post. Not welcome.",
        "Something interesting happened on November 8th 2016. You should read about that.",
        "So you are unfamiliar with freezing bank accounts?",
        "Digital Rupee is actually opposite lmao. It's an RBI governed CBDC INR, that runs on blockchain. Fiat rupee can be taxed, but e-rupee can't be taxed. It's actually more safer than UPI / Netbanking because the wallet is decentralised.",
        "Idk if you know, but even today they can freeze you and your damn money, OP",
        "CBDC India. India is heading towards next step.\nAlthough US seems to be against CBDC",
        "that was partial. this is full 100%.",
        "that's why i wrote \"cash in our pockets\". it's amazing how fast people jump.",
        "why username is like that",
        ">against CBDC\n\nthat is anonymity and freedom.",
        "Sarcastic 👀",
        "But we do need money from our accounts to add to CBDC wallet? Also withdrawal of the money would be traced to our accounts.",
        "How much cash can you realistically carry in your pockets? Cash isn't immune to losing value. For instance, during the first two years of the American Civil War, there was a 700% inflation rate, so even basic expenses skyrocket during a crisis, or \"a scuffle with the govt.\". This isn't to say something similar would happen in India, but it's a historical example of the potential risks. Unless you can carry your entire net worth in your pocket, you'll eventually need to use some form of traceable transaction to access essentials. Instead of relying on cash, consider investing the cash into assets that do not lose value as easily, precious metals for example.",
        "/s",
        "If we follow your logic and advice , then everyone needs to carry gold as that's the only true benchmark that can't be blocked or banned by any entity. Cash is as useless as Digital Rupee. If they want they can stop circulation or demonitize and there isn't a damn thing you can do about it",
        "That's true but problem with CBDC is heavy centralisation.\nWhy u need banks when u can directly deal with Central one?",
        "alrighty bro, ill assume comment was a sarcastic message.",
        "we're mixing up inflation, cash and cbdt here. loss of track. im bringing it back. resist cbdt digital rupee.",
        ">they can stop circulation or demonitize\n\nwith cash, they can't keep eye on you and metadata.",
        ">problem with CBDC\n\nanything negative about cbdt: i fuel it.",
        "First of all, what you're suggesting is just implausible and inconvenient. But I can't exactly call your concerns completely groundless so, well, preach. What do you have in mind?",
        ">can't exactly call your concerns completely groundless\n\nyay!\n\n>What do you have in mind\n\nsimple. users should ask to keep both ways of payment. with digital rupee, government wants to check how far they can go, and want to control money and humans. plus spy on them. users should resist it.",
        "Hmm, not a bad idea. But here are the problems. Firstly, again, it's a matter of convenience. Most people, as long as they can get the amenities they want, won't bother with considering their overall freedom. The fact that your government can just lock you out isn't a valid problem for most folks. And businesses follow that. If no one asks for an alternate method of payment( cold hard cash) , ofc it won't be an option. Plus in many cases, carrying around cash is just kinda suapicious tbh nowadays.\nSuddenly I realize how little autonomy I have over my finances thanks to you post and can't say I like it. Damn it.",
        ">Suddenly I realize how little autonomy I have over my finances thanks to you post\n\nyayy! this is what i want.\n\nmy view is, people can do whatever they want with their money, but with their decision, and without any direct indirect nudge from government. if they want to give 10 rupees note to a vendor on street, they should be able to do it, without both being called as terrorists.",
        "Who feeds you such nonsense ? They can absolutely track with cash.",
        "Limited financial freedom equals to diminished freedom of speech. Sucks that most people wont ever realize that.",
        ">They can absolutely track with cash\n\n>Who feeds you such nonsense\n\nyou answered yourself",
        "yayy!"
    ],
    "cleaned_text": "keep money resist deny digital rupee read ask today pay phone feel like time sender receiver bank names pan kyc location goes database candoes go government also option pay cash remain anonymous dont leak metadatabits information cant traced back hundred years get scuffle government cash pocket still holds value buy food want digital rupee means government switch money millisecond dont money direct control today theyre jailing elected people conviction without proof tomorrow blockhold anyones money keep money resist deny digital rupee ",
    "cleaned_title": "keep money resist deny digital rupee read ask",
    "cleaned_selftext": "today pay phone feel like time sender receiver bank names pan kyc location goes database candoes go government also option pay cash remain anonymous dont leak metadatabits information cant traced back hundred years get scuffle government cash pocket still holds value buy food want digital rupee means government switch money millisecond dont money direct control today theyre jailing elected people conviction without proof tomorrow blockhold anyones money keep money resist deny digital rupee",
    "cleaned_comments": "also building apocalypse bunker resistant nuclear fallout course zombies understand youre sarcastically making fun post welcome something interesting happened november th read unfamiliar freezing bank accounts digital rupee actually opposite lmao rbi governed cbdc inr runs blockchain fiat rupee taxed erupee cant taxed actually safer upi netbanking wallet decentralised idk know even today freeze damn money op cbdc india india heading towards next step although us seems cbdc partial full thats wrote cash pockets amazing fast people jump username like cbdc anonymity freedom sarcastic need money accounts add cbdc wallet also withdrawal money would traced accounts much cash realistically carry pockets cash isnt immune losing value instance first two years american civil war inflation rate even basic expenses skyrocket crisis scuffle govt isnt say something similar would happen india historical example potential risks unless carry entire net worth pocket youll eventually need use form traceable transaction access essentials instead relying cash consider investing cash assets lose value easily precious metals example follow logic advice everyone needs carry gold thats true benchmark cant blocked banned entity cash useless digital rupee want stop circulation demonitize isnt damn thing thats true problem cbdc heavy centralisation u need banks u directly deal central one alrighty bro ill assume comment sarcastic message mixing inflation cash cbdt loss track im bringing back resist cbdt digital rupee stop circulation demonitize cash cant keep eye metadata problem cbdc anything negative cbdt fuel first youre suggesting implausible inconvenient cant exactly call concerns completely groundless well preach mind cant exactly call concerns completely groundless yay mind simple users ask keep ways payment digital rupee government wants check far go want control money humans plus spy users resist hmm bad idea problems firstly matter convenience people long get amenities want wont bother considering overall freedom fact government lock isnt valid problem folks businesses follow one asks alternate method payment cold hard cash ofc wont option plus many cases carrying around cash kinda suapicious tbh nowadays suddenly realize little autonomy finances thanks post cant say like damn suddenly realize little autonomy finances thanks post yayy want view people whatever want money decision without direct indirect nudge government want give rupees note vendor street able without called terrorists feeds nonsense absolutely track cash limited financial freedom equals diminished freedom speech sucks people wont ever realize absolutely track cash feeds nonsense answered yayy",
    "light_cleaned_title": "Keep your money yours, Resist/ Deny Digital Rupee, Read/ Ask me how:",
    "light_cleaned_selftext": "today we pay from phone \"if we feel like\". each time, sender receiver bank, our names, PAN, KYC, location goes to database, which can/does go to the government. we also have option to pay in cash, where we remain anonymous, we don't leak any metadata/bits of information. we can't be traced back hundred years from now. if we get in scuffle with government, cash in our pocket still holds value, we can buy food if we want. Digital Rupee means, government can switch off our money in a millisecond and we don't have any money. it's direct control. today they're jailing elected people, before conviction, without proof. tomorrow they can block/hold anyone's money. Keep your money yours, Resist/ Deny Digital Rupee.",
    "light_cleaned_comments": "I am also building a apocalypse bunker resistant to nuclear fallout and of course zombies. i understand what you're doing. sarcastically making fun of the post. Not welcome. Something interesting happened on November 8th 2016. You should read about that. So you are unfamiliar with freezing bank accounts? Digital Rupee is actually opposite lmao. It's an RBI governed CBDC INR, that runs on blockchain. Fiat rupee can be taxed, but e-rupee can't be taxed. It's actually more safer than UPI / Netbanking because the wallet is decentralised. Idk if you know, but even today they can freeze you and your damn money, OP CBDC India. India is heading towards next step. Although US seems to be against CBDC that was partial. this is full 100%. that's why i wrote \"cash in our pockets\". it's amazing how fast people jump. why username is like that >against CBDC that is anonymity and freedom. Sarcastic 👀 But we do need money from our accounts to add to CBDC wallet? Also withdrawal of the money would be traced to our accounts. How much cash can you realistically carry in your pockets? Cash isn't immune to losing value. For instance, during the first two years of the American Civil War, there was a 700% inflation rate, so even basic expenses skyrocket during a crisis, or \"a scuffle with the govt.\". This isn't to say something similar would happen in India, but it's a historical example of the potential risks. Unless you can carry your entire net worth in your pocket, you'll eventually need to use some form of traceable transaction to access essentials. Instead of relying on cash, consider investing the cash into assets that do not lose value as easily, precious metals for example. /s If we follow your logic and advice , then everyone needs to carry gold as that's the only true benchmark that can't be blocked or banned by any entity. Cash is as useless as Digital Rupee. If they want they can stop circulation or demonitize and there isn't a damn thing you can do about it That's true but problem with CBDC is heavy centralisation. Why u need banks when u can directly deal with Central one? alrighty bro, ill assume comment was a sarcastic message. we're mixing up inflation, cash and cbdt here. loss of track. im bringing it back. resist cbdt digital rupee. >they can stop circulation or demonitize with cash, they can't keep eye on you and metadata. >problem with CBDC anything negative about cbdt: i fuel it. First of all, what you're suggesting is just implausible and inconvenient. But I can't exactly call your concerns completely groundless so, well, preach. What do you have in mind? >can't exactly call your concerns completely groundless yay! >What do you have in mind simple. users should ask to keep both ways of payment. with digital rupee, government wants to check how far they can go, and want to control money and humans. plus spy on them. users should resist it. Hmm, not a bad idea. But here are the problems. Firstly, again, it's a matter of convenience. Most people, as long as they can get the amenities they want, won't bother with considering their overall freedom. The fact that your government can just lock you out isn't a valid problem for most folks. And businesses follow that. If no one asks for an alternate method of payment( cold hard cash) , ofc it won't be an option. Plus in many cases, carrying around cash is just kinda suapicious tbh nowadays. Suddenly I realize how little autonomy I have over my finances thanks to you post and can't say I like it. Damn it. >Suddenly I realize how little autonomy I have over my finances thanks to you post yayy! this is what i want. my view is, people can do whatever they want with their money, but with their decision, and without any direct indirect nudge from government. if they want to give 10 rupees note to a vendor on street, they should be able to do it, without both being called as terrorists. Who feeds you such nonsense ? They can absolutely track with cash. Limited financial freedom equals to diminished freedom of speech. Sucks that most people wont ever realize that. >They can absolutely track with cash >Who feeds you such nonsense you answered yourself yayy!"
}