{
    "id": "15w4ww8",
    "title": "Rajnikanth touching Yogi Adityanath''s feet.",
    "url": "https://www.reddit.com/r/india/comments/15w4ww8/rajnikanth_touching_yogi_adityanaths_feet/",
    "selftext": "https://www.news18.com/amp/politics/actor-rajinikanth-meets-up-cm-yogi-adityanath-at-his-residence-in-uttar-pradesh-8542785.html\n\nThis guy will do anything to promote his movies. What he does is his own business but stop pretending to be a good person Rajni.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692517155.0,
    "convurl": "https://external-preview.redd.it/ooJPD-T8gCJRkU5nsPmC1x_UoDu6djeU9c-2Df-9lQQ.jpg?auto=webp&s=f3be388ce536c6a6e9fc173ca392cd61d586f6fc",
    "comments": [
        "Teri jali na??",
        "You are as much of a dumbass as those Bhakts who call anyone speaking against Government \"Anti national!\"\nMillions including you probably, put up with their moron bosses for their livelihood and that doesn't make them a bad person! Try to be better.",
        "How is a UP CM, a TN actor's \"boss\"",
        "How many of you think this incident in particular will help the bjp get votes in TN?",
        "Nobody is touching theirs boss's feet.",
        "In English That's what you call an analogy and it's NOT an exact comparison! You can like/dislike people but saying someone is \"pretending to be a good person\" is dumb af"
    ],
    "cleaned_text": "rajnikanth touching yogi adityanaths feet guy anything promote movies business stop pretending good person rajni ",
    "cleaned_title": "rajnikanth touching yogi adityanaths feet",
    "cleaned_selftext": "guy anything promote movies business stop pretending good person rajni",
    "cleaned_comments": "teri jali na much dumbass bhakts call anyone speaking government anti national millions including probably put moron bosses livelihood doesnt make bad person try better cm tn actors boss many think incident particular help bjp get votes tn nobody touching bosss feet english thats call analogy exact comparison likedislike people saying someone pretending good person dumb af",
    "light_cleaned_title": "Rajnikanth touching Yogi Adityanath''s feet.",
    "light_cleaned_selftext": "This guy will do anything to promote his movies. What he does is his own business but stop pretending to be a good person Rajni.",
    "light_cleaned_comments": "Teri jali na?? You are as much of a dumbass as those Bhakts who call anyone speaking against Government \"Anti national!\" Millions including you probably, put up with their moron bosses for their livelihood and that doesn't make them a bad person! Try to be better. How is a UP CM, a TN actor's \"boss\" How many of you think this incident in particular will help the bjp get votes in TN? Nobody is touching theirs boss's feet. In English That's what you call an analogy and it's NOT an exact comparison! You can like/dislike people but saying someone is \"pretending to be a good person\" is dumb af"
}