{
    "id": "16kcq87",
    "title": "Please help me save and rescue an old street dog with a big wound near my house!",
    "url": "https://www.reddit.com/r/india/comments/16kcq87/please_help_me_save_and_rescue_an_old_street_dog/",
    "selftext": "Hi, r/india! \n\nOldie, an old homeless dog that I feed near my house, has developed a big gaping wound on her back.\n\nI am raising 7000 rupees to rescue her. This includes costs for an ambulance, boarding shelter, medicines, doctor fees, treatment costs, etc. \n\nI also feed 70+ dogs around my house, and you can check my work on Instagram handle \"@aashadeepanimalstrust\". \n\nSo, please come forward to help me raise the money to fund her treatment. \n\nDonation details: \n\nName: Aashadeep Animals Trust\n\nBank Name: Bank of India \n\nA/C No: 602120110000815 \n\nIFSC Code: BKID0006021 \n\nA/C Type: Current\n\nPaytm/PhonePe/GPay: 9899000197\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/7yzvvvkihnob1.png?width=438&format=png&auto=webp&s=975dfa4566805aeedef084738248cd9eb2d54172\n\n&#x200B;\n\nPlease don't ignore this. Thank you so much! <3 \n\n&#x200B;\n\n&#x200B;",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694884420.0,
    "convurl": "https://a.thumbs.redditmedia.com/djWp6gkWJ0uYb39ixWA1R3D_SjEhaYIUjDlJ0jMrM80.jpg",
    "comments": [
        "good use of my stock profit",
        "Could you please share your last month's collection from r/India ?",
        "Received nothing.",
        "https://preview.redd.it/jl0k45mtdrob1.png?width=1673&format=png&auto=webp&s=0f3a153aa355b0f9051e75ba36d489f69de7ff90",
        "Dm’ed you mate",
        "i also dm'd you. please check.",
        "show paytm and account statement"
    ],
    "cleaned_text": "please help save rescue old street dog big wound near house hi rindia oldie old homeless dog feed near house developed big gaping wound back raising rupees rescue includes costs ambulance boarding shelter medicines doctor fees treatment costs etc also feed dogs around house check work instagram handle aashadeepanimalstrust please come forward help raise money fund treatment donation details name aashadeep animals trust bank name bank india ac ifsc code bkid ac type current paytmphonepegpay xb xb xb please dont ignore thank much xb xb ",
    "cleaned_title": "please help save rescue old street dog big wound near house",
    "cleaned_selftext": "hi rindia oldie old homeless dog feed near house developed big gaping wound back raising rupees rescue includes costs ambulance boarding shelter medicines doctor fees treatment costs etc also feed dogs around house check work instagram handle aashadeepanimalstrust please come forward help raise money fund treatment donation details name aashadeep animals trust bank name bank india ac ifsc code bkid ac type current paytmphonepegpay xb xb xb please dont ignore thank much xb xb",
    "cleaned_comments": "good use stock profit could please share last months collection rindia received nothing dmed mate also dmd please check show paytm account statement",
    "light_cleaned_title": "Please help me save and rescue an old street dog with a big wound near my house!",
    "light_cleaned_selftext": "Hi, r/india! Oldie, an old homeless dog that I feed near my house, has developed a big gaping wound on her back. I am raising 7000 rupees to rescue her. This includes costs for an ambulance, boarding shelter, medicines, doctor fees, treatment costs, etc. I also feed 70+ dogs around my house, and you can check my work on Instagram handle \"@aashadeepanimalstrust\". So, please come forward to help me raise the money to fund her treatment. Donation details: Name: Aashadeep Animals Trust Bank Name: Bank of India A/C No: 602120110000815 IFSC Code: BKID0006021 A/C Type: Current Paytm/PhonePe/GPay: 9899000197 &#x200B; &#x200B; &#x200B; Please don't ignore this. Thank you so much! <3 &#x200B; &#x200B;",
    "light_cleaned_comments": "good use of my stock profit Could you please share your last month's collection from r/India ? Received nothing. Dm’ed you mate i also dm'd you. please check. show paytm and account statement"
}