{
    "id": "16hn6t5",
    "title": "BJP’s caste conundrum ahead of 2024: Maratha quota to jati census to OBC sub-categorisation",
    "url": "https://indianexpress.com/article/political-pulse/bjp-caste-maratha-quota-jati-census-obc-sub-categorisation-8938518/",
    "selftext": "Central list of OBCs has 261 castes from Maharashtra, the largest among all states, that includes Kunbis but not Maratha community, which is now demanding Kunbi status to get reservation",
    "flair": "Politics",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1694612040.0,
    "convurl": "https://external-preview.redd.it/ecoN7Z-GXF2CF9v9-2Q7J3OMfNSIIEKr7bB881E5ZMI.jpg?auto=webp&s=8c93be5195682f5d6b33401a0cab337c3fabf22d",
    "comments": [
        ">While the Opposition alliance INDIA has been pressing for a nationwide jati (caste) census and the Justice Rohini Commission’s report on the sub-categorisation of the Other Backward Classes (OBCs) has been kept under wraps, the BJP dispensation is now facing a growing challenge from Maharashtra in the form of renewed demand for reservation for the numerically-dominant and politically-influential Maratha community.\n\n>The Rohini panel had submitted its report to President Droupadi Murmu on July 31, with the pressure now mounting on the Union Ministry of Social Justice and Empowerment to take a call on its recommendations, which have not been made public so far.",
        "Why maratha need reservation anyway. Didn't they rule the states for more than 400 years",
        "Hmm BJP cant do it. If they are seen cowing to caste groups, they will lose the unified hindu identity politics angle.",
        "Exactly, what it is this nonsense of dominant caste of state demanding reservation."
    ],
    "cleaned_text": "bjps caste conundrum ahead maratha quota jati census obc subcategorisation central list obcs castes maharashtra largest among states includes kunbis maratha community demanding kunbi status get reservation ",
    "cleaned_title": "bjps caste conundrum ahead maratha quota jati census obc subcategorisation",
    "cleaned_selftext": "central list obcs castes maharashtra largest among states includes kunbis maratha community demanding kunbi status get reservation",
    "cleaned_comments": "opposition alliance india pressing nationwide jati caste census justice rohini commissions report subcategorisation backward classes obcs kept wraps bjp dispensation facing growing challenge maharashtra form renewed demand reservation numericallydominant politicallyinfluential maratha community rohini panel submitted report president droupadi murmu july pressure mounting union ministry social justice empowerment take call recommendations made public far maratha need reservation anyway didnt rule states years hmm bjp cant seen cowing caste groups lose unified hindu identity politics angle exactly nonsense dominant caste state demanding reservation",
    "light_cleaned_title": "BJP’s caste conundrum ahead of 2024: Maratha quota to jati census to OBC sub-categorisation",
    "light_cleaned_selftext": "Central list of OBCs has 261 castes from Maharashtra, the largest among all states, that includes Kunbis but not Maratha community, which is now demanding Kunbi status to get reservation",
    "light_cleaned_comments": ">While the Opposition alliance INDIA has been pressing for a nationwide jati (caste) census and the Justice Rohini Commission’s report on the sub-categorisation of the Other Backward Classes (OBCs) has been kept under wraps, the BJP dispensation is now facing a growing challenge from Maharashtra in the form of renewed demand for reservation for the numerically-dominant and politically-influential Maratha community. >The Rohini panel had submitted its report to President Droupadi Murmu on July 31, with the pressure now mounting on the Union Ministry of Social Justice and Empowerment to take a call on its recommendations, which have not been made public so far. Why maratha need reservation anyway. Didn't they rule the states for more than 400 years Hmm BJP cant do it. If they are seen cowing to caste groups, they will lose the unified hindu identity politics angle. Exactly, what it is this nonsense of dominant caste of state demanding reservation."
}