{
    "id": "194lr17",
    "title": "Electricity bill scam?",
    "url": "https://www.reddit.com/gallery/194lr17",
    "selftext": "I'm from Tamilnadu. 6 months back I started receiving electricity bill messages . I thought that it was our bill but I never read those messages as my brother only pays the electric bill. Today I recieved a bill payment remainder message I thought that our family didn't paid the bill and asked them . They told that they paid the bill. So when I opened the message I saw it is mostly written in Hindi and English.\n\n\"Sawalmedha dlf \" is the English word I saw . And then I googled it. Sawalmedha is a place in madhya pradesh. So I checked in any forums wheather anyone reported it or not . And the thing is many of them had wrote in the forum. \n\nHow can someone receive the message even they didn't give their mobile number. Why people giving fake numbers to the government.\n\n ( While writing this i came to recall this incident. That few months back some Hindi speaking people called me . I mean they didn't try to scam me . It seemed like they dialled a wrong number )\n\nFew minutes i emailed the electricity board to remove my number. Idk what happens next .\n\nDid anyone faced this issue comment below?",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1705032224.0,
    "convurl": "https://i.redd.it/muasoj86oxbc1.png",
    "comments": [],
    "cleaned_text": "electricity bill scam im tamilnadu months back started receiving electricity bill messages thought bill never read messages brother pays electric bill today recieved bill payment remainder message thought family didnt paid bill asked told paid bill opened message saw mostly written hindi english sawalmedha dlf english word saw googled sawalmedha place madhya pradesh checked forums wheather anyone reported thing many wrote forum someone receive message even didnt give mobile number people giving fake numbers government writing came recall incident months back hindi speaking people called mean didnt try scam seemed like dialled wrong number minutes emailed electricity board remove number idk happens next anyone faced issue comment ",
    "cleaned_title": "electricity bill scam",
    "cleaned_selftext": "im tamilnadu months back started receiving electricity bill messages thought bill never read messages brother pays electric bill today recieved bill payment remainder message thought family didnt paid bill asked told paid bill opened message saw mostly written hindi english sawalmedha dlf english word saw googled sawalmedha place madhya pradesh checked forums wheather anyone reported thing many wrote forum someone receive message even didnt give mobile number people giving fake numbers government writing came recall incident months back hindi speaking people called mean didnt try scam seemed like dialled wrong number minutes emailed electricity board remove number idk happens next anyone faced issue comment",
    "cleaned_comments": "",
    "light_cleaned_title": "Electricity bill scam?",
    "light_cleaned_selftext": "I'm from Tamilnadu. 6 months back I started receiving electricity bill messages . I thought that it was our bill but I never read those messages as my brother only pays the electric bill. Today I recieved a bill payment remainder message I thought that our family didn't paid the bill and asked them . They told that they paid the bill. So when I opened the message I saw it is mostly written in Hindi and English. \"Sawalmedha dlf \" is the English word I saw . And then I googled it. Sawalmedha is a place in madhya pradesh. So I checked in any forums wheather anyone reported it or not . And the thing is many of them had wrote in the forum. How can someone receive the message even they didn't give their mobile number. Why people giving fake numbers to the government. ( While writing this i came to recall this incident. That few months back some Hindi speaking people called me . I mean they didn't try to scam me . It seemed like they dialled a wrong number ) Few minutes i emailed the electricity board to remove my number. Idk what happens next . Did anyone faced this issue comment below?",
    "light_cleaned_comments": ""
}