{
    "id": "13f2it7",
    "title": "Ace mountaineer removed as ambassador of 'Beti Bachao, Beti Padhao' after she joins Cong",
    "url": "https://www.siasat.com/ace-mountaineer-removed-as-ambassador-of-beti-bachao-beti-padhaos-after-she-joins-cong-2587185/",
    "selftext": "Parmar is the first woman from MP to conquer four highest peaks, including the Mount Everest (which she scaled on May 22, 2019) in as many continents, according to mountaineers.",
    "flair": "Politics",
    "score": 839,
    "num_comments": 33,
    "created_utc": 1683844687.0,
    "convurl": "https://external-preview.redd.it/PAt2aWoE0MFTOIb9coxSQkCTXsfXq-JQceqk8-jumqc.jpg?auto=webp&v=enabled&s=5ec8b4325f9c0722d1a1b15cd50440177d69d142",
    "comments": [
        "Apni Beti bachao, dusre ki bhagao!",
        "Petty folks will always do petty things.",
        "Iin the words of Tiger Shroff \"Modiji, Chote Bacche ho kya\" 🤔",
        "To be fair, she was anti-national to join congress.\n\n/s",
        "Brij bhushan is the next ambassador",
        "Send him to Mount Everest 😈",
        "*Patao",
        "Welcome to modern Politics",
        "✨✨ Beti Bachao, Beta Padhao^+ ✨✨\n\n^+ All slogans are subject to cultural risks. Read Golwalkar's offer document carefully before voting.",
        "Somehow I heard the voice of the mutual fund ad guy's voice in my mind  when I read this. Your user name seems apt.",
        "She is better off not being associated with a useless hypocritical campaign.",
        "It's basically a tourist spot now",
        "Mainey kaha , pettiness ki bhi seema hoti hai .",
        "It must play at 2x speed to be accurate but Reddit doesn't allow me size 7 narrow font 😭",
        "BJP : Beti Bachao, Beti Padhao.\n\n*Someone's Beti joins Cong*\n\nBJP : Beti Bac.... Yeah not that one..",
        "😂",
        "Without any O2 cylinder.",
        "hahahah ! Thanks for the chuckle :-)",
        "Lol. They definitely don't want to bachao this beti.",
        "Some people that go just never come back",
        "Unless she likes someone from different caste",
        "Snowflake govt",
        "Sirf BJP ki beti ko bachao aur India ke bahar padhao",
        "You are a role model for BJP only if you support their bigotry.\n\nFuck BJP.",
        "Its still pretty dangerous to climb and require certain qualities.",
        "some  become the spot in the place."
    ],
    "cleaned_text": "ace mountaineer removed ambassador beti bachao beti padhao joins cong parmar first woman mp conquer four highest peaks including mount everest scaled may many continents according mountaineers ",
    "cleaned_title": "ace mountaineer removed ambassador beti bachao beti padhao joins cong",
    "cleaned_selftext": "parmar first woman mp conquer four highest peaks including mount everest scaled may many continents according mountaineers",
    "cleaned_comments": "apni beti bachao dusre ki bhagao petty folks always petty things iin words tiger shroff modiji chote bacche ho kya fair antinational join congress brij bhushan next ambassador send mount everest patao welcome modern politics beti bachao beta padhao slogans subject cultural risks read golwalkars offer document carefully voting somehow heard voice mutual fund ad guys voice mind read user name seems apt better associated useless hypocritical campaign basically tourist spot mainey kaha pettiness ki bhi seema hoti hai must play x speed accurate reddit doesnt allow size narrow font bjp beti bachao beti padhao someones beti joins cong bjp beti bac yeah one without cylinder hahahah thanks chuckle lol definitely dont want bachao beti people go never come back unless likes someone different caste snowflake govt sirf bjp ki beti ko bachao aur india ke bahar padhao role model bjp support bigotry fuck bjp still pretty dangerous climb require certain qualities become spot place",
    "light_cleaned_title": "Ace mountaineer removed as ambassador of 'Beti Bachao, Beti Padhao' after she joins Cong",
    "light_cleaned_selftext": "Parmar is the first woman from MP to conquer four highest peaks, including the Mount Everest (which she scaled on May 22, 2019) in as many continents, according to mountaineers.",
    "light_cleaned_comments": "Apni Beti bachao, dusre ki bhagao! Petty folks will always do petty things. Iin the words of Tiger Shroff \"Modiji, Chote Bacche ho kya\" 🤔 To be fair, she was anti-national to join congress. /s Brij bhushan is the next ambassador Send him to Mount Everest 😈 *Patao Welcome to modern Politics ✨✨ Beti Bachao, Beta Padhao^+ ✨✨ ^+ All slogans are subject to cultural risks. Read Golwalkar's offer document carefully before voting. Somehow I heard the voice of the mutual fund ad guy's voice in my mind when I read this. Your user name seems apt. She is better off not being associated with a useless hypocritical campaign. It's basically a tourist spot now Mainey kaha , pettiness ki bhi seema hoti hai . It must play at 2x speed to be accurate but Reddit doesn't allow me size 7 narrow font 😭 BJP : Beti Bachao, Beti Padhao. *Someone's Beti joins Cong* BJP : Beti Bac.... Yeah not that one.. 😂 Without any O2 cylinder. hahahah ! Thanks for the chuckle :-) Lol. They definitely don't want to bachao this beti. Some people that go just never come back Unless she likes someone from different caste Snowflake govt Sirf BJP ki beti ko bachao aur India ke bahar padhao You are a role model for BJP only if you support their bigotry. Fuck BJP. Its still pretty dangerous to climb and require certain qualities. some become the spot in the place."
}