{
    "id": "12t0jfs",
    "title": "Congress leader lays Tricolour on Atiq Ahmed’s grave, is detained, suspended by party",
    "url": "https://www.indiatoday.in/india/story/congress-leader-suspended-for-laying-tricolour-on-atiq-ahmed-grave-in-prayagraj-2362069-2023-04-19",
    "selftext": "What an utter moron!!!",
    "flair": "Politics",
    "score": 58,
    "num_comments": 8,
    "created_utc": 1682001070.0,
    "convurl": "https://external-preview.redd.it/-tktfaqNOfxMMpSCN4lWDBxqKxiZ7t1Or6mHcLfvmx4.jpg?auto=webp&v=enabled&s=09d14aa3a5091e31b0cc23f488f5f32f0ac5140f",
    "comments": [
        "Thats good. \n\nThe manner of death does not absolve the man of all his past crimes.",
        "I don't know why suddenly Muslims are trying to defend this criminal.\n\nHis death was of course unconstitutional and i dont agree to murders or encounters, that is very pathetic and i strongly condemn it.\n\nThat being said, i also state i hate the dhongi baba acting as chief minister, literally unfit for the role and shame on such great country like India.\n\nBut why in the hell are Muslims feeling the need to defend him? Are you feeling empathetic towards a criminal because of? Just don't do it.",
        ">Congress suspended party leader Rajkumar Singh ‘Rajju’ for six years on Wednesday after he laid the Tricolour on gangster-politician Atiq Ahmed’s grave in Prayagraj, Uttar Pradesh.",
        "Atiq should not be treated like he was some hero. Good that Cong took a swift action."
    ],
    "cleaned_text": "congress leader lays tricolour atiq ahmeds grave detained suspended party utter moron ",
    "cleaned_title": "congress leader lays tricolour atiq ahmeds grave detained suspended party",
    "cleaned_selftext": "utter moron",
    "cleaned_comments": "thats good manner death absolve man past crimes dont know suddenly muslims trying defend criminal death course unconstitutional dont agree murders encounters pathetic strongly condemn said also state hate dhongi baba acting chief minister literally unfit role shame great country like india hell muslims feeling need defend feeling empathetic towards criminal dont congress suspended party leader rajkumar singh rajju six years wednesday laid tricolour gangsterpolitician atiq ahmeds grave prayagraj uttar pradesh atiq treated like hero good cong took swift action",
    "light_cleaned_title": "Congress leader lays Tricolour on Atiq Ahmed’s grave, is detained, suspended by party",
    "light_cleaned_selftext": "What an utter moron!!!",
    "light_cleaned_comments": "Thats good. The manner of death does not absolve the man of all his past crimes. I don't know why suddenly Muslims are trying to defend this criminal. His death was of course unconstitutional and i dont agree to murders or encounters, that is very pathetic and i strongly condemn it. That being said, i also state i hate the dhongi baba acting as chief minister, literally unfit for the role and shame on such great country like India. But why in the hell are Muslims feeling the need to defend him? Are you feeling empathetic towards a criminal because of? Just don't do it. >Congress suspended party leader Rajkumar Singh ‘Rajju’ for six years on Wednesday after he laid the Tricolour on gangster-politician Atiq Ahmed’s grave in Prayagraj, Uttar Pradesh. Atiq should not be treated like he was some hero. Good that Cong took a swift action."
}