{
    "id": "1aougea",
    "title": "Five-Year-Old Girl Raped By Two Schoolmates(8 Y.O.&10 Y.O.) During Lunch Break In UP: Police",
    "url": "https://www.ndtv.com/india-news/five-year-old-girl-raped-by-two-schoolmates-during-lunch-break-in-up-police-5033048",
    "selftext": "Call me backward but Goverment should strictly enforce Porn Prohibition. Indians are not smart (82 IQ). They literally get influenced by Media, Movies and Porn Easily.",
    "flair": "Crime",
    "score": 51,
    "num_comments": 29,
    "created_utc": 1707722803.0,
    "convurl": "https://external-preview.redd.it/5b16N9C_6ZvA_HQ-ODel6_wXGEC8zHScD1IEerBIASw.jpg",
    "comments": [
        "Social media is slowly turning our upcoming generations into zombies, in every other reel and YouTube video you will see people justifying vulgar content and nowadays in movies and webseries also they are promoting extremist views on the name of entertainment and according to this social media generation those who believe in law are fools or coward people I hope something get done soon about this situation otherwise i am preety much sure that society will collapse soon.",
        "ek hi request hein isme koi religious angle mat leke aana pls",
        "Animals don't have religion.",
        "https://preview.redd.it/qkh7wygyz3ic1.jpeg?width=1080&format=pjpg&auto=webp&s=726ecf7f09452a1406d3ce4c0463f002287d9474",
        "Twitter moment.",
        "Goverment should implement higher levels of tax on producing and uploading adult content over the internet so that it will not stay feasible for companies and producers to provide it for free. I think it will make access to this content virtually impossible for majority of young children.",
        "Porn is simply one tiny part of the problem. India has a rape culture and a deeply conservative, patriarchal culture. Our government voluntarily lets convicted rapists out of prison. Police punish victims rather than perpetrators. The ruling party's MPs and mainstream news media have engaged in victim shaming for many years now. This sort of victim shaming, gender apartheid and conservative, patriarchal rape culture is prevalent everywhere in the country and at every level of society. \n\nTo fix these problems, we must be willing to address all of this and bring about a radical and systemic change rather than doing Mandir-Masjid politics.",
        "This is the way. But again, what's the point? Nothing is going to change!",
        "In this Case Porn is the sole reason but everything you wrote is true to much extent.",
        "Yes There should be Some sort of paywall even for just 1₹ which will require a card to do the payment. Also this system should be regulated heavily because Even Netflix can be bypassed.",
        "We need sex education not enforcement in porn. In addition to goverment taking steps to promote co-ed institutions. \n\nConservative places treat male-female interaction as a mortal sin.\n\nIf these people start seeing the other sex as humans, the number of rapes will automatically come down.",
        "I rest my case when I see UP. People from UP and Bihar are still cavemen",
        "Sex education is necessary but Porn at young age can never be healthy. All the degradation of Men and women relationship and objectification of something as beautiful as sex to mere animalistic urge is gross.  How can any ideal society allow the Sexualization of Mother and Sister?",
        "At what point are we going to have r/JustUPThings",
        "Can't discount the lack of good sex education either. Even if sex education comes later during early puberty, the concept of consent is still important for under 10 kids.",
        "Normal day in UP",
        "Why are degenerate ppl like this.",
        "Yeah it's definitely a regional issue and not cultural issue. Stop this Xenophobia. This is not the first of it's kind case. Such types of cases are happening all over India.",
        "i've genuinely lost hope with this country\n\n*mera bharat baddal raha hai!*",
        "Go talk to you classmates you will know if educated thinks like that for women. What lower class.treat them as.",
        "Did these 8 and 10 yrs old  get any sex education? Banning porn will do nothing if sex education is not given.",
        "I don't think 8 and 10 year olds are aware of the terminologies but maybe they have seen subjugation of females in their surroundings. This coupled with watching obscene videos made them commit this heinous act.",
        "The way I see it is that the only way to control this is to persecute the convicts by bringing the highest form of capital punishment one can give.\n\nEither shame and hanged or straight up execution regardless of the age. \n\nNo amount of control, sex education or rehabilitation can turn the individual good enough to be made part of the society again.\n\nAnd I’m not trying to be a PoS here, I’ve seen men, boys in similar condition, their mental state is severely fucked with very little chance for it to recover and once it turns into something physical like this then they’ve moved way past beyond the line and should be put out of their misery. \n\nIt’s for their own good too.",
        "I don't think anywhere in the world 8 and 10 year old get Sex education. You understand that These ages are literally child. This is not natural.",
        "Sex education is important but around the world it begins at around 10-11 years. Here an 8 year old is also involved. Parents should teach their wards about such stuff first. But Indian society has shied away from such topics. Also, how is an 8 and 10 year old watching obscene videos? Negligence on the part of parents/elder siblings. ",
        "Why bad mouth animals?",
        "There are countries where porn is banned. There are also countries where women are supposed to cover up in burqas. None of that has not helped prevent rapes so far.",
        "Because they can't control their urges and don't care about consent.",
        "(Looks like you deleted the reply wrote to my comment....)\n\n>How can any ideal society allow the Sexualization of Mother and Sister?\n\nYour last line is stupid af.Indians should stop with this hypocritical pretense of calling women pious and godly while not doing anything on a societal level to empower them.How many people would agree with their teen children having relationships in schools? If you don't talk about it, someone more perverted that's what's happening porn is reaching the kids before they understand what it all means.\n\nThere need to be concrete steps from the people as well as the government.Not idealistic sermons standing upon self appointed pedestals of piety.",
        "Sir, if 8-10 yr olds are capable of rape, do you think they shouldn't get sex education? Is this kind of sexual assaults by 8 yr olds natural? How can the response to the rape epidemic and rape culture be \"natural\". Kids as young as 5 yrs old get basic sex education like bad touch, good touch in many countries. A suitable curriculum can be developed to cater to such young kids. But keeping quite and being silent is not an option to us.",
        "Porn ban is the stupidest and most backward way to address rape culture. It creates more shame around sex, and we already live in a society where sex is frowned. We need to normalize sex and teach children",
        "Yeah I realised that hence deleted.",
        "Every other damned bollywood movie is an obscene video. All objectify women and girls wearing certain types of clothing. Some mfs salivate at the mere sight of a skirt. And ratings have no meaning in an Indian household,whatever the stupid parents choose to watch the entire family watches too.",
        "The parents of the boys need to be punished too. Cannot discount the influence of home environment on the upbringing of boys.",
        "Our culture is fucking hypocritical af.... \n\n###Anecdote\n\n\nI remember there was picnic or something that was planned with the neighbours, I was adolescent back then (me and another cousin brother).... And we were talking and and hanging around with a girl(older teen, visiting relative of a neighbour) for more a few times during the day\n\nOne of the first things my mother asked me after reaching home was \"why were you running around that girl?\"... Lol.... As if I was expected to bitch about politicians with the uncles or bitch about the uncles with the aunties.",
        ">India has a rape culture\n\nI wouldn't say that for each and every one of us"
    ],
    "cleaned_text": "fiveyearold girl raped two schoolmates yo yo lunch break police call backward goverment strictly enforce porn prohibition indians smart iq literally get influenced media movies porn easily ",
    "cleaned_title": "fiveyearold girl raped two schoolmates yo yo lunch break police",
    "cleaned_selftext": "call backward goverment strictly enforce porn prohibition indians smart iq literally get influenced media movies porn easily",
    "cleaned_comments": "social media slowly turning upcoming generations zombies every reel youtube video see people justifying vulgar content nowadays movies webseries also promoting extremist views name entertainment according social media generation believe law fools coward people hope something get done soon situation otherwise preety much sure society collapse soon ek hi request hein isme koi religious angle mat leke aana pls animals dont religion twitter moment goverment implement higher levels tax producing uploading adult content internet stay feasible companies producers provide free think make access content virtually impossible majority young children porn simply one tiny part problem india rape culture deeply conservative patriarchal culture government voluntarily lets convicted rapists prison police punish victims rather perpetrators ruling partys mps mainstream news media engaged victim shaming many years sort victim shaming gender apartheid conservative patriarchal rape culture prevalent everywhere country every level society fix problems must willing address bring radical systemic change rather mandirmasjid politics way whats point nothing going change case porn sole reason everything wrote true much extent yes sort paywall even require card payment also system regulated heavily even netflix bypassed need sex education enforcement porn addition goverment taking steps promote coed institutions conservative places treat malefemale interaction mortal sin people start seeing sex humans number rapes automatically come rest case see people bihar still cavemen sex education necessary porn young age never healthy degradation men women relationship objectification something beautiful sex mere animalistic urge gross ideal society allow sexualization mother sister point going rjustupthings cant discount lack good sex education either even sex education comes later early puberty concept consent still important kids normal day degenerate ppl like yeah definitely regional issue cultural issue stop xenophobia first kind case types cases happening india ive genuinely lost hope country mera bharat baddal raha hai go talk classmates know educated thinks like women lower classtreat yrs old get sex education banning porn nothing sex education given dont think year olds aware terminologies maybe seen subjugation females surroundings coupled watching obscene videos made commit heinous act way see way control persecute convicts bringing highest form capital punishment one give either shame hanged straight execution regardless age amount control sex education rehabilitation turn individual good enough made part society im trying pos ive seen men boys similar condition mental state severely fucked little chance recover turns something physical like theyve moved way past beyond line put misery good dont think anywhere world year old get sex education understand ages literally child natural sex education important around world begins around years year old also involved parents teach wards stuff first indian society shied away topics also year old watching obscene videos negligence part parentselder siblings bad mouth animals countries porn banned also countries women supposed cover burqas none helped prevent rapes far cant control urges dont care consent looks like deleted reply wrote comment ideal society allow sexualization mother sister last line stupid afindians stop hypocritical pretense calling women pious godly anything societal level empower themhow many people would agree teen children relationships schools dont talk someone perverted thats whats happening porn reaching kids understand means need concrete steps people well governmentnot idealistic sermons standing upon self appointed pedestals piety sir yr olds capable rape think shouldnt get sex education kind sexual assaults yr olds natural response rape epidemic rape culture natural kids young yrs old get basic sex education like bad touch good touch many countries suitable curriculum developed cater young kids keeping quite silent option us porn ban stupidest backward way address rape culture creates shame around sex already live society sex frowned need normalize sex teach children yeah realised hence deleted every damned bollywood movie obscene video objectify women girls wearing certain types clothing mfs salivate mere sight skirt ratings meaning indian householdwhatever stupid parents choose watch entire family watches parents boys need punished discount influence home environment upbringing boys culture fucking hypocritical af anecdote remember picnic something planned neighbours adolescent back another cousin brother talking hanging around girlolder teen visiting relative neighbour times day one first things mother asked reaching home running around girl lol expected bitch politicians uncles bitch uncles aunties india rape culture wouldnt say every one us",
    "light_cleaned_title": "Five-Year-Old Girl Raped By Two Schoolmates(8 Y.O.&10 Y.O.) During Lunch Break In UP: Police",
    "light_cleaned_selftext": "Call me backward but Goverment should strictly enforce Porn Prohibition. Indians are not smart (82 IQ). They literally get influenced by Media, Movies and Porn Easily.",
    "light_cleaned_comments": "Social media is slowly turning our upcoming generations into zombies, in every other reel and YouTube video you will see people justifying vulgar content and nowadays in movies and webseries also they are promoting extremist views on the name of entertainment and according to this social media generation those who believe in law are fools or coward people I hope something get done soon about this situation otherwise i am preety much sure that society will collapse soon. ek hi request hein isme koi religious angle mat leke aana pls Animals don't have religion. Twitter moment. Goverment should implement higher levels of tax on producing and uploading adult content over the internet so that it will not stay feasible for companies and producers to provide it for free. I think it will make access to this content virtually impossible for majority of young children. Porn is simply one tiny part of the problem. India has a rape culture and a deeply conservative, patriarchal culture. Our government voluntarily lets convicted rapists out of prison. Police punish victims rather than perpetrators. The ruling party's MPs and mainstream news media have engaged in victim shaming for many years now. This sort of victim shaming, gender apartheid and conservative, patriarchal rape culture is prevalent everywhere in the country and at every level of society. To fix these problems, we must be willing to address all of this and bring about a radical and systemic change rather than doing Mandir-Masjid politics. This is the way. But again, what's the point? Nothing is going to change! In this Case Porn is the sole reason but everything you wrote is true to much extent. Yes There should be Some sort of paywall even for just 1₹ which will require a card to do the payment. Also this system should be regulated heavily because Even Netflix can be bypassed. We need sex education not enforcement in porn. In addition to goverment taking steps to promote co-ed institutions. Conservative places treat male-female interaction as a mortal sin. If these people start seeing the other sex as humans, the number of rapes will automatically come down. I rest my case when I see UP. People from UP and Bihar are still cavemen Sex education is necessary but Porn at young age can never be healthy. All the degradation of Men and women relationship and objectification of something as beautiful as sex to mere animalistic urge is gross. How can any ideal society allow the Sexualization of Mother and Sister? At what point are we going to have r/JustUPThings Can't discount the lack of good sex education either. Even if sex education comes later during early puberty, the concept of consent is still important for under 10 kids. Normal day in UP Why are degenerate ppl like this. Yeah it's definitely a regional issue and not cultural issue. Stop this Xenophobia. This is not the first of it's kind case. Such types of cases are happening all over India. i've genuinely lost hope with this country *mera bharat baddal raha hai!* Go talk to you classmates you will know if educated thinks like that for women. What lower class.treat them as. Did these 8 and 10 yrs old get any sex education? Banning porn will do nothing if sex education is not given. I don't think 8 and 10 year olds are aware of the terminologies but maybe they have seen subjugation of females in their surroundings. This coupled with watching obscene videos made them commit this heinous act. The way I see it is that the only way to control this is to persecute the convicts by bringing the highest form of capital punishment one can give. Either shame and hanged or straight up execution regardless of the age. No amount of control, sex education or rehabilitation can turn the individual good enough to be made part of the society again. And I’m not trying to be a PoS here, I’ve seen men, boys in similar condition, their mental state is severely fucked with very little chance for it to recover and once it turns into something physical like this then they’ve moved way past beyond the line and should be put out of their misery. It’s for their own good too. I don't think anywhere in the world 8 and 10 year old get Sex education. You understand that These ages are literally child. This is not natural. Sex education is important but around the world it begins at around 10-11 years. Here an 8 year old is also involved. Parents should teach their wards about such stuff first. But Indian society has shied away from such topics. Also, how is an 8 and 10 year old watching obscene videos? Negligence on the part of parents/elder siblings. Why bad mouth animals? There are countries where porn is banned. There are also countries where women are supposed to cover up in burqas. None of that has not helped prevent rapes so far. Because they can't control their urges and don't care about consent. (Looks like you deleted the reply wrote to my comment....) >How can any ideal society allow the Sexualization of Mother and Sister? Your last line is stupid af.Indians should stop with this hypocritical pretense of calling women pious and godly while not doing anything on a societal level to empower them.How many people would agree with their teen children having relationships in schools? If you don't talk about it, someone more perverted that's what's happening porn is reaching the kids before they understand what it all means. There need to be concrete steps from the people as well as the government.Not idealistic sermons standing upon self appointed pedestals of piety. Sir, if 8-10 yr olds are capable of rape, do you think they shouldn't get sex education? Is this kind of sexual assaults by 8 yr olds natural? How can the response to the rape epidemic and rape culture be \"natural\". Kids as young as 5 yrs old get basic sex education like bad touch, good touch in many countries. A suitable curriculum can be developed to cater to such young kids. But keeping quite and being silent is not an option to us. Porn ban is the stupidest and most backward way to address rape culture. It creates more shame around sex, and we already live in a society where sex is frowned. We need to normalize sex and teach children Yeah I realised that hence deleted. Every other damned bollywood movie is an obscene video. All objectify women and girls wearing certain types of clothing. Some mfs salivate at the mere sight of a skirt. And ratings have no meaning in an Indian household,whatever the stupid parents choose to watch the entire family watches too. The parents of the boys need to be punished too. Cannot discount the influence of home environment on the upbringing of boys. Our culture is fucking hypocritical af.... ###Anecdote I remember there was picnic or something that was planned with the neighbours, I was adolescent back then (me and another cousin brother).... And we were talking and and hanging around with a girl(older teen, visiting relative of a neighbour) for more a few times during the day One of the first things my mother asked me after reaching home was \"why were you running around that girl?\"... Lol.... As if I was expected to bitch about politicians with the uncles or bitch about the uncles with the aunties. >India has a rape culture I wouldn't say that for each and every one of us"
}