{
    "id": "15abdnr",
    "title": "Sectors of CHANDIGARH",
    "url": "https://www.reddit.com/gallery/15abdnr",
    "selftext": "From top✈️",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690391019.0,
    "convurl": "https://i.redd.it/bhzuy00dcceb1.jpg",
    "comments": [
        "It really is one of the best planned cities in the country.",
        "Actually, the ONLY planned city in the country, which is a shame to say the least. \n\nChulli bhar paani mein doob marna chahiye Bureaucrats ko jo rattafication se IAS kartay hein aur phir complecency and corruption mein saari zindagi nikaal dete hein. And then my dirtiest spit on the Politicians since independence to date that did/are doing zilch for a common man’s quality of life when it comes to the planned neighborhoods.",
        "The first planned city of independent India built by the famous French architect Le Corbusier. This was the dream city of Nehru built to reduce the pain of partition. Nehru truly was a visionary!!",
        "That's AI",
        "What is AI",
        "There will be never 2nd chandigarh in india. love this beautiful city.",
        "Quite wrong, (independent)india has a lot of planned city besides Chandigarh. Navi Mumbai is said to be the world's largest planned city.",
        "May be, but my comment still stands if you only found 2 cities. Pretty dismal.",
        "No I didn't found only 2 planned cities. I just listed one more. Here you can find the full list- \nhttps://en.wikipedia.org/wiki/List_of_planned_cities#India",
        "Bangalore (no seriously. Just look at west & south bangalore and all the paces inside of the ORR), Noida, Greater Noida, Bokharo.",
        "Have you seen Noida/Greater Noida in UP. May not be as good as Chandigarh but definitely planned cities.",
        "No, those are pockets. By that standard, Delhi is also planned if you look at GK, Vasant Vihar only and ignore all crowded mohallas.",
        "Chandigarh, renowned for its meticulous planning and modern infrastructure, is divided into several well-organized sectors, each offering unique advantages. Among these [Sector 52 Chandigarh ](https://chttps)stands out for its strategic location, residential amenities, and vibrant community life. This guide delves into the various aspects of Sector 52, Chandigarh, highlighting its residential appeal, key amenities, connectivity, and overall lifestyle."
    ],
    "cleaned_text": "sectors chandigarh top ",
    "cleaned_title": "sectors chandigarh",
    "cleaned_selftext": "top",
    "cleaned_comments": "really one best planned cities country actually planned city country shame say least chulli bhar paani mein doob marna chahiye bureaucrats ko jo rattafication se ias kartay hein aur phir complecency corruption mein saari zindagi nikaal dete hein dirtiest spit politicians since independence date didare zilch common mans quality life comes planned neighborhoods first planned city independent india built famous french architect le corbusier dream city nehru built reduce pain partition nehru truly visionary thats ai ai never nd chandigarh india love beautiful city quite wrong independentindia lot planned city besides chandigarh navi mumbai said worlds largest planned city may comment still stands found cities pretty dismal didnt found planned cities listed one find full list bangalore seriously look west south bangalore paces inside orr noida greater noida bokharo seen noidagreater noida may good chandigarh definitely planned cities pockets standard delhi also planned look gk vasant vihar ignore crowded mohallas chandigarh renowned meticulous planning modern infrastructure divided several wellorganized sectors offering unique advantages among sector chandigarh httpschttpsstands strategic location residential amenities vibrant community life guide delves various aspects sector chandigarh highlighting residential appeal key amenities connectivity overall lifestyle",
    "light_cleaned_title": "Sectors of CHANDIGARH",
    "light_cleaned_selftext": "From top✈️",
    "light_cleaned_comments": "It really is one of the best planned cities in the country. Actually, the ONLY planned city in the country, which is a shame to say the least. Chulli bhar paani mein doob marna chahiye Bureaucrats ko jo rattafication se IAS kartay hein aur phir complecency and corruption mein saari zindagi nikaal dete hein. And then my dirtiest spit on the Politicians since independence to date that did/are doing zilch for a common man’s quality of life when it comes to the planned neighborhoods. The first planned city of independent India built by the famous French architect Le Corbusier. This was the dream city of Nehru built to reduce the pain of partition. Nehru truly was a visionary!! That's AI What is AI There will be never 2nd chandigarh in india. love this beautiful city. Quite wrong, (independent)india has a lot of planned city besides Chandigarh. Navi Mumbai is said to be the world's largest planned city. May be, but my comment still stands if you only found 2 cities. Pretty dismal. No I didn't found only 2 planned cities. I just listed one more. Here you can find the full list- Bangalore (no seriously. Just look at west & south bangalore and all the paces inside of the ORR), Noida, Greater Noida, Bokharo. Have you seen Noida/Greater Noida in UP. May not be as good as Chandigarh but definitely planned cities. No, those are pockets. By that standard, Delhi is also planned if you look at GK, Vasant Vihar only and ignore all crowded mohallas. Chandigarh, renowned for its meticulous planning and modern infrastructure, is divided into several well-organized sectors, each offering unique advantages. Among these [Sector 52 Chandigarh ](https://chttps)stands out for its strategic location, residential amenities, and vibrant community life. This guide delves into the various aspects of Sector 52, Chandigarh, highlighting its residential appeal, key amenities, connectivity, and overall lifestyle."
}