{
    "id": "1b8pyht",
    "title": "Electoral bonds disclosure | Contempt plea moved against SBI for not disclosing details yet",
    "url": "https://www.reddit.com/r/india/comments/1b8pyht/electoral_bonds_disclosure_contempt_plea_moved/",
    "selftext": "[https://www.thehindu.com/news/national/sbi-plea-on-electoral-bonds-adr-files-contempt-plea-in-supreme-court/article67923698.ece](https://www.thehindu.com/news/national/sbi-plea-on-electoral-bonds-adr-files-contempt-plea-in-supreme-court/article67923698.ece)  \nChief Justice of India D.Y. Chandrachud on March 7 said the Supreme Court would consider listing a contempt petition against State Bank of India (SBI) Chairman Dinesh Kumar Khera for seeking time till June 30 to provide complete details of electoral bonds purchased since April 2019 to anonymously fund political parties.\n\nThe petition said the bank’s stand was directly contradictory to an affidavit filed by the Union Government on March 15, 2019, which said information about the bonds were completely traceable and quickly available.\n\nThe Centre’s affidavit had said that the electoral bonds scheme envisaged a transparent system of acquiring bonds with validated KYC and audit trail. The SBI would record KYC, PAN, details of identity and address in full of all the donors.\n\n&#x200B;",
    "flair": "Law & Courts",
    "score": 26,
    "num_comments": 4,
    "created_utc": 1709801526.0,
    "convurl": "https://external-preview.redd.it/iRHg6FAsm6Bx_WVdmNt8jbqvvuVd0vWi0UkJ4GgQ4vk.jpg?auto=webp&s=a0bd1b5462c77c592b71d15ebef33f49b8f5fda7",
    "comments": [
        "Pretty sure SBI staffers are still on a lunch break🤷‍♂️",
        "Hope SC serves them a dinner too!",
        "One can only hope that justice will be served and those found guilty are prosecuted fully according to the law of the country.\n\nThe common man has suffered enough, it's high time that we collectively stand against corruption.",
        "SC will be served dinner by modiji. Dinner being a juicy post after retirement. \n\nWasn't the contempt notice also pushed by Prashant Bhushan NOT the court. \n\nThe SC is just a Supreme joke. They're such a bunch of Cowards I'm amazed they manage to make their way to the courts at all."
    ],
    "cleaned_text": "electoral bonds disclosure contempt plea moved sbi disclosing details yet httpswwwthehinducomnewsnationalsbipleaonelectoralbondsadrfilescontemptpleainsupremecourtarticleecehttpswwwthehinducomnewsnationalsbipleaonelectoralbondsadrfilescontemptpleainsupremecourtarticleece chief justice india dy chandrachud march said supreme court would consider listing contempt petition state bank india sbi chairman dinesh kumar khera seeking time till june provide complete details electoral bonds purchased since april anonymously fund political parties petition said banks stand directly contradictory affidavit filed union government march said information bonds completely traceable quickly available centres affidavit said electoral bonds scheme envisaged transparent system acquiring bonds validated kyc audit trail sbi would record kyc pan details identity address full donors xb ",
    "cleaned_title": "electoral bonds disclosure contempt plea moved sbi disclosing details yet",
    "cleaned_selftext": "httpswwwthehinducomnewsnationalsbipleaonelectoralbondsadrfilescontemptpleainsupremecourtarticleecehttpswwwthehinducomnewsnationalsbipleaonelectoralbondsadrfilescontemptpleainsupremecourtarticleece chief justice india dy chandrachud march said supreme court would consider listing contempt petition state bank india sbi chairman dinesh kumar khera seeking time till june provide complete details electoral bonds purchased since april anonymously fund political parties petition said banks stand directly contradictory affidavit filed union government march said information bonds completely traceable quickly available centres affidavit said electoral bonds scheme envisaged transparent system acquiring bonds validated kyc audit trail sbi would record kyc pan details identity address full donors xb",
    "cleaned_comments": "pretty sure sbi staffers still lunch break hope sc serves dinner one hope justice served found guilty prosecuted fully according law country common man suffered enough high time collectively stand corruption sc served dinner modiji dinner juicy post retirement wasnt contempt notice also pushed prashant bhushan court sc supreme joke theyre bunch cowards im amazed manage make way courts",
    "light_cleaned_title": "Electoral bonds disclosure | Contempt plea moved against SBI for not disclosing details yet",
    "light_cleaned_selftext": "[https://www.thehindu.com/news/national/sbi-plea-on-electoral-bonds-adr-files-contempt-plea-in-supreme-court/article67923698.ece](https://www.thehindu.com/news/national/sbi-plea-on-electoral-bonds-adr-files-contempt-plea-in-supreme-court/article67923698.ece) Chief Justice of India D.Y. Chandrachud on March 7 said the Supreme Court would consider listing a contempt petition against State Bank of India (SBI) Chairman Dinesh Kumar Khera for seeking time till June 30 to provide complete details of electoral bonds purchased since April 2019 to anonymously fund political parties. The petition said the bank’s stand was directly contradictory to an affidavit filed by the Union Government on March 15, 2019, which said information about the bonds were completely traceable and quickly available. The Centre’s affidavit had said that the electoral bonds scheme envisaged a transparent system of acquiring bonds with validated KYC and audit trail. The SBI would record KYC, PAN, details of identity and address in full of all the donors. &#x200B;",
    "light_cleaned_comments": "Pretty sure SBI staffers are still on a lunch break🤷‍♂️ Hope SC serves them a dinner too! One can only hope that justice will be served and those found guilty are prosecuted fully according to the law of the country. The common man has suffered enough, it's high time that we collectively stand against corruption. SC will be served dinner by modiji. Dinner being a juicy post after retirement. Wasn't the contempt notice also pushed by Prashant Bhushan NOT the court. The SC is just a Supreme joke. They're such a bunch of Cowards I'm amazed they manage to make their way to the courts at all."
}