{
    "id": "1bqjai5",
    "title": "Employment scenario in India grim, says ILO report  ",
    "url": "https://www.thehindu.com/business/Economy/employment-scenario-in-india-grim-says-ilo-report/article67995387.ece",
    "selftext": "India’s youth account for almost 83% of the unemployed workforce and the share of youngsters with secondary or higher education in the total unemployed youth has almost doubled from 35.2% in 2000 to 65.7% in 2022, as per the India Employment Report 2024 released by the International Labour Organisation (ILO) and the Institute of Human Development (IHD) here on Tuesday. ",
    "flair": "Policy/Economy",
    "score": 30,
    "num_comments": 4,
    "created_utc": 1711697370.0,
    "convurl": "https://external-preview.redd.it/LlD3RLAA4sBQoC7bRaU2eGr6R1iQZDYRTgvwdvIhogQ.jpg?auto=webp&s=f77e69927309fdb318ff80e32dcc9cd0030a4e29",
    "comments": [
        "Yeh ILO ILO kya hai. Yeh ILO ILO. Papa ke advisor ne toh bola na jobs Dena government ka kaam nahi hai. Aur hum toh Kush hai Elvish Bhai ke videos dekh kar. Jaishankar ji ki speech sunkar. Pakode khakar. Kise chahiye kaam. Ram Rajya hai bhai, ab hum kare aaram! \n\nSource for the advisor part:\n\nhttps://www.thehindu.com/business/govt-cant-solve-all-social-economic-problems-such-as-unemployment-cea/article67995614.ece",
        "All govt jobs are contract jobs. All contract jobs are given to connected kids. Lateral hire also is for connected kids and BJP suck ups."
    ],
    "cleaned_text": "employment scenario india grim says ilo report indias youth account almost unemployed workforce share youngsters secondary higher education total unemployed youth almost doubled per india employment report released international labour organisation ilo institute human development ihd tuesday ",
    "cleaned_title": "employment scenario india grim says ilo report",
    "cleaned_selftext": "indias youth account almost unemployed workforce share youngsters secondary higher education total unemployed youth almost doubled per india employment report released international labour organisation ilo institute human development ihd tuesday",
    "cleaned_comments": "yeh ilo ilo kya hai yeh ilo ilo papa ke advisor ne toh bola na jobs dena government ka kaam nahi hai aur hum toh kush hai elvish bhai ke videos dekh kar jaishankar ji ki speech sunkar pakode khakar kise chahiye kaam ram rajya hai bhai ab hum kare aaram source advisor part govt jobs contract jobs contract jobs given connected kids lateral hire also connected kids bjp suck ups",
    "light_cleaned_title": "Employment scenario in India grim, says ILO report",
    "light_cleaned_selftext": "India’s youth account for almost 83% of the unemployed workforce and the share of youngsters with secondary or higher education in the total unemployed youth has almost doubled from 35.2% in 2000 to 65.7% in 2022, as per the India Employment Report 2024 released by the International Labour Organisation (ILO) and the Institute of Human Development (IHD) here on Tuesday.",
    "light_cleaned_comments": "Yeh ILO ILO kya hai. Yeh ILO ILO. Papa ke advisor ne toh bola na jobs Dena government ka kaam nahi hai. Aur hum toh Kush hai Elvish Bhai ke videos dekh kar. Jaishankar ji ki speech sunkar. Pakode khakar. Kise chahiye kaam. Ram Rajya hai bhai, ab hum kare aaram! Source for the advisor part: All govt jobs are contract jobs. All contract jobs are given to connected kids. Lateral hire also is for connected kids and BJP suck ups."
}