{
    "id": "15ke1cx",
    "title": "The Digital Personal Data Protection Bill is listed in the Lok Sabha list of business, join IFF's Members and Donors briefing call to dig deeper.",
    "url": "https://www.reddit.com/r/india/comments/15ke1cx/the_digital_personal_data_protection_bill_is/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/enyjmulb9ngb1.png?width=1600&format=png&auto=webp&s=a7106dd5cd0a9417c70785382867f5f95e68fde5\n\nThe Digital Personal Data Protection Bill, 2023 is listed in the Lok Sabha List of Business for today to follow how the discussion surrounding this nothing short of contentious bill develops over the day, tune into our live coverage on our telegram channel.\n\nInterested in digging deeper? We will be hosting a Members’ Briefing call this evening at 7PM with Prateek Waghre & Vrinda Bhandari, moderated by Tejasi Panjiar.\n\n If you’re a member, the invite is in your inbox, for everyone else, get your membership – we’ll do the rest! [https://internetfreedom.in/donate](https://internetfreedom.in/donate)  \n\n\nFor a quick primer ahead of the call, check out:  \n1. IFF’s [statement](https://internetfreedom.in/statement-dpdpb-2023/) on the DPDPB, 2023 \n\n2. IFF’s [First Read](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/) on the DPDPB, 2023, which highlights key issues and compares this draft with its predecessor \n\n3. An [op-ed](https://twitter.com/internetfreedom/status/1687707230412431360?s=20) by IFF’s Founder Director, Apar Gupta in *The Hindustan Times,* which makes a simple case— poor process will result in poor outcome \n\n4. An [explainer](https://twitter.com/internetfreedom/status/1688061731816271872?s=20) by IFF staffers, Radhika Roy and Tejasi Panjiar in *The Hindu* answering all your questions about the DPDPB, 2023 \n\n5. An [op-ed](https://twitter.com/internetfreedom/status/1688431796398993409?s=20) by IFF’s Policy Director, Prateek Waghre in *The Economic Times* that asks: how much data does the Digital Personal Data Protection Bill, 2023 really protect?",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691395030.0,
    "convurl": "https://external-preview.redd.it/xl9312awVEalZfiWHSkovl6_1r_r8DisVbozR3L5xrg.jpg",
    "comments": [],
    "cleaned_text": "digital personal data protection bill listed lok sabha list business join iffs members donors briefing call dig deeper xb digital personal data protection bill listed lok sabha list business today follow discussion surrounding nothing short contentious bill develops day tune live coverage telegram channel interested digging deeper hosting members briefing call evening pm prateek waghre vrinda bhandari moderated tejasi panjiar youre member invite inbox everyone else get membership well rest httpsinternetfreedomindonatehttpsinternetfreedomindonate quick primer ahead call check iffs statementhttpsinternetfreedominstatementdpdpb dpdpb iffs first readhttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbill dpdpb highlights key issues compares draft predecessor opedhttpstwittercominternetfreedomstatuss iffs founder director apar gupta hindustan times makes simple case poor process result poor outcome explainerhttpstwittercominternetfreedomstatuss iff staffers radhika roy tejasi panjiar hindu answering questions dpdpb opedhttpstwittercominternetfreedomstatuss iffs policy director prateek waghre economic times asks much data digital personal data protection bill really protect ",
    "cleaned_title": "digital personal data protection bill listed lok sabha list business join iffs members donors briefing call dig deeper",
    "cleaned_selftext": "xb digital personal data protection bill listed lok sabha list business today follow discussion surrounding nothing short contentious bill develops day tune live coverage telegram channel interested digging deeper hosting members briefing call evening pm prateek waghre vrinda bhandari moderated tejasi panjiar youre member invite inbox everyone else get membership well rest httpsinternetfreedomindonatehttpsinternetfreedomindonate quick primer ahead call check iffs statementhttpsinternetfreedominstatementdpdpb dpdpb iffs first readhttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbill dpdpb highlights key issues compares draft predecessor opedhttpstwittercominternetfreedomstatuss iffs founder director apar gupta hindustan times makes simple case poor process result poor outcome explainerhttpstwittercominternetfreedomstatuss iff staffers radhika roy tejasi panjiar hindu answering questions dpdpb opedhttpstwittercominternetfreedomstatuss iffs policy director prateek waghre economic times asks much data digital personal data protection bill really protect",
    "cleaned_comments": "",
    "light_cleaned_title": "The Digital Personal Data Protection Bill is listed in the Lok Sabha list of business, join IFF's Members and Donors briefing call to dig deeper.",
    "light_cleaned_selftext": "&#x200B; The Digital Personal Data Protection Bill, 2023 is listed in the Lok Sabha List of Business for today to follow how the discussion surrounding this nothing short of contentious bill develops over the day, tune into our live coverage on our telegram channel. Interested in digging deeper? We will be hosting a Members’ Briefing call this evening at 7PM with Prateek Waghre & Vrinda Bhandari, moderated by Tejasi Panjiar. If you’re a member, the invite is in your inbox, for everyone else, get your membership – we’ll do the rest! [https://internetfreedom.in/donate](https://internetfreedom.in/donate) For a quick primer ahead of the call, check out: 1. IFF’s [statement](https://internetfreedom.in/statement-dpdpb-2023/) on the DPDPB, 2023 2. IFF’s [First Read](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/) on the DPDPB, 2023, which highlights key issues and compares this draft with its predecessor 3. An [op-ed](https://twitter.com/internetfreedom/status/1687707230412431360?s=20) by IFF’s Founder Director, Apar Gupta in *The Hindustan Times,* which makes a simple case— poor process will result in poor outcome 4. An [explainer](https://twitter.com/internetfreedom/status/1688061731816271872?s=20) by IFF staffers, Radhika Roy and Tejasi Panjiar in *The Hindu* answering all your questions about the DPDPB, 2023 5. An [op-ed](https://twitter.com/internetfreedom/status/1688431796398993409?s=20) by IFF’s Policy Director, Prateek Waghre in *The Economic Times* that asks: how much data does the Digital Personal Data Protection Bill, 2023 really protect?",
    "light_cleaned_comments": ""
}