{
    "id": "11uk81w",
    "title": "got a 5-year tourist visa, to visit family and friends, visa run help needed.",
    "url": "https://www.reddit.com/r/india/comments/11uk81w/got_a_5year_tourist_visa_to_visit_family_and/",
    "selftext": "so i have family around India and in Sri Lanka, I'm going to India to take care of my family and meet friends, I'm supported by family on a limited basis and I don't like to keep asking for money from them, so i wanted to know what's the absolute cheapest way to do a visa run?   \nthe Indian government has put up like a million rules and limitations on how you can get into the country and out so it's like a really complex puzzle to figure out a workaround for this.  \nthis is the mail i got with all the rules. they really want to make it difficult, i was thinking of staying in Kolkata and Delhi which will make it cheaper regarding visa run, but I'm a bit lost at the moment, cant find a solution that's feasible.  \n[https://www.india-visa-online.org/indian-e-visa-entry-points-rules](https://www.india-visa-online.org/indian-e-visa-entry-points-rules)\n\nhttps://preview.redd.it/4xqt5oac3hoa1.jpg?width=843&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=ebe8dc9aa899b87610c1bd7fb080462fb6480232",
    "flair": "AskIndia",
    "score": 4,
    "num_comments": 8,
    "created_utc": 1679134469,
    "convurl": "https://b.thumbs.redditmedia.com/oEc2OZcsi_LsPWk9dxyjriYITvqg0Cg0M2sPvMLgg_s.jpg",
    "comments": [
        "ah yes you're right they wrote that entry to India by land immigration is not allowed so I could take the bus to somewhere close to Kolkata or Delhi if i choose to live in those 2 places and then take a flight back to Delhi or Kolkata i guess if that allowed?",
        "thank you i will look into that and see whats the cheapest option i have.",
        "Note that the entry point rules are valid only for your first trip into India (with an evisa ETA).    \nAt the airport immigration, you will get a visa stamp on your passport. For future entries (till the expiry of your five year multiple entry visa), you are treated just like a paper visa holder and can enter through land borders as well.",
        "really ? then i can stay in Delhi and go to Nepal by bus and come back again?   \nwhere is this information, they clearly stats in the letter no land entry, that's why its a bit confusion what you are saying and what they are saying",
        "Yes.    \nThat line about no land entry and the bit about designated entry ports is valid only for the first visit when you're traveling on the basis of the ETA letter that you get via email.      \nFor future visits, you'll be traveling on the basis of the visa stamp on your passport and can enter through any means.     \nI don't think this is clearly written anywhere but it's how things are working right now (and have been working since evisas were introduced). You can confirm this by writing to your local Indian consulate or other authorities.",
        "Are you sure that visa runs are possible with a tourist e-visa? The conditions state: 'Maximum stay in India during one Calendar Year should not exceed 180 days.'",
        "I'm not sure . Ask the person the redditor above",
        "this is still correct and valid info right ? im going back to sl this month after staying 6 months in india, hopefully im not getting fined or arrested",
        "Do you mean the bit about the land borders? Yes, that's still valid. But how is it relevant if you're going to SL?\n\nThe max time allowed per visit is 6 months only for certain passports (like the US, UK and Canada). Do you mean yours is one of the passports which only allow 3 months per visit and you already made a visa run to Nepal and back in the last 6 months? In that case, you'll be fine.",
        ">The max time allowed per visit is 6 months only for certain passports (like the US, UK and Canada)\n\nnooo are you serious ???   \nmy passport is danish, no i i did not make a visa run to nepal, i thought i could stay 180 days  and then travel to sl and back again to india by plane, i have stayed 5 months now, and im going this month, no anything i can do ? this was a pure misunderstanding from my side",
        "I think it's 90 days for Danish passports. You can take out your e-visa ETA and check. It should have a line like \"Continuous stay in India on each entry should not exceed __ days\".           \n\nIf you've indeed overstayed, I'd strongly advise you to immediately [apply here](https://indianfrro.gov.in/eservices/) for an exit permit online. You'll need to pay a fine. The general advice is that it'll be $300 but the actual fine you'll be asked to pay may vary wildly.         \nYou can also just choose to just go to the airport for your flight without getting an exit permit. But in that case, you'll have to prepare yourself to be subjected to intense interrogations, possibly higher fine amounts and a higher chance of Indian visas/entry being denied to you in the future.",
        "update about the visa run  \nHey, I hope it is okay if I continue the conversation in this post.  \nso i wanted to say I am in india again. It was not an easy thing to do, so first, when i left india i needed to show a return ticket which i did, and the immigration man looked at the dates and i felt like he felt suspicious or something. Anyway,  he gave me a departure stamp.  \nNow on the way back, I had to go to immigration, and I got nervous and talked a bit too much maybe, like he didn't even need to see the proof of immigration paper the numbers on the old stamp was enough for him, but I talked too much, and I just said I was planning to take the bus to Nepal in the future, maybe within 3 months, and I could see on him that, oh, he didn't even think of asking such a question about when I was leaving or if I had any proof of leaving, which he stated doing after I mentioned Nepal, so he stamped it and told me to follow him to a lady who asked what my purpose was of the stay, and I said visiting friends, which is true, so they let me go and she told the guy to check up on the address i have given which was half fake address. How long can I stay with this stamp? It doesn't say 180 days. Like the old one, I'm a brown guy, and I speak Tamil on a basic level. i felt like he felt suspicious or something   \n\n\n[my visa pdf file paper](https://imgur.com/a/SvD9HnR)  \n[stamps i got](https://imgur.com/a/gja0Iug)",
        "It's always good to just give to-the-point answers to the questions. But don't worry now. There's no requirement for you to stay in the same address you give so that won't be a problem.              \n\nThe old visa stamp (the one where 180 days is ticked) is still valid and will be valid till the expiry of the 5 year period. You only get an arrival stamp on subsequent visits.       \nSo, since it's not corrected or anything, I would take that to mean that you can stay 180 days on each visit. Taking into account the calendar year rule, you can probably stay for 175 days starting today.        \nIn any case, the next time I meet a traveller on an EU passport, I'll be sure to find out if they have been given 90 days or 180 days and let you know. Just to figure out whether this is an oversight or policy change."
    ],
    "cleaned_text": "got year tourist visa visit family friends visa run help needed family around india sri lanka im going india take care family meet friends im supported family limited basis dont like keep asking money wanted know whats absolute cheapest way visa run indian government put like million rules limitations get country like really complex puzzle figure workaround mail got rules really want make difficult thinking staying kolkata delhi make cheaper regarding visa run im bit lost moment cant find solution thats feasible httpswwwindiavisaonlineorgindianevisaentrypointsruleshttpswwwindiavisaonlineorgindianevisaentrypointsrules ",
    "cleaned_title": "got year tourist visa visit family friends visa run help needed",
    "cleaned_selftext": "family around india sri lanka im going india take care family meet friends im supported family limited basis dont like keep asking money wanted know whats absolute cheapest way visa run indian government put like million rules limitations get country like really complex puzzle figure workaround mail got rules really want make difficult thinking staying kolkata delhi make cheaper regarding visa run im bit lost moment cant find solution thats feasible httpswwwindiavisaonlineorgindianevisaentrypointsruleshttpswwwindiavisaonlineorgindianevisaentrypointsrules",
    "cleaned_comments": "ah yes youre right wrote entry india land immigration allowed could take bus somewhere close kolkata delhi choose live places take flight back delhi kolkata guess allowed thank look see whats cheapest option note entry point rules valid first trip india evisa eta airport immigration get visa stamp passport future entries till expiry five year multiple entry visa treated like paper visa holder enter land borders well really stay delhi go nepal bus come back information clearly stats letter land entry thats bit confusion saying saying yes line land entry bit designated entry ports valid first visit youre traveling basis eta letter get via email future visits youll traveling basis visa stamp passport enter means dont think clearly written anywhere things working right working since evisas introduced confirm writing local indian consulate authorities sure visa runs possible tourist evisa conditions state maximum stay india one calendar year exceed days im sure ask person redditor still correct valid info right im going back sl month staying months india hopefully im getting fined arrested mean bit land borders yes thats still valid relevant youre going sl max time allowed per visit months certain passports like us uk canada mean one passports allow months per visit already made visa run nepal back last months case youll fine max time allowed per visit months certain passports like us uk canada nooo serious passport danish make visa run nepal thought could stay days travel sl back india plane stayed months im going month anything pure misunderstanding side think days danish passports take evisa eta check line like continuous stay india entry exceed days youve indeed overstayed id strongly advise immediately apply herehttpsindianfrrogovineservices exit permit online youll need pay fine general advice itll actual fine youll asked pay may vary wildly also choose go airport flight without getting exit permit case youll prepare subjected intense interrogations possibly higher fine amounts higher chance indian visasentry denied future update visa run hey hope okay continue conversation post wanted say india easy thing first left india needed show return ticket immigration man looked dates felt like felt suspicious something anyway gave departure stamp way back go immigration got nervous talked bit much maybe like didnt even need see proof immigration paper numbers old stamp enough talked much said planning take bus nepal future maybe within months could see oh didnt even think asking question leaving proof leaving stated mentioned nepal stamped told follow lady asked purpose stay said visiting friends true let go told guy check address given half fake address long stay stamp doesnt say days like old one im brown guy speak tamil basic level felt like felt suspicious something visa pdf file paperhttpsimgurcomasvdhnr stamps gothttpsimgurcomagjaiug always good give tothepoint answers questions dont worry theres requirement stay address give wont problem old visa stamp one days ticked still valid valid till expiry year period get arrival stamp subsequent visits since corrected anything would take mean stay days visit taking account calendar year rule probably stay days starting today case next time meet traveller eu passport ill sure find given days days let know figure whether oversight policy change",
    "light_cleaned_title": "got a 5-year tourist visa, to visit family and friends, visa run help needed.",
    "light_cleaned_selftext": "so i have family around India and in Sri Lanka, I'm going to India to take care of my family and meet friends, I'm supported by family on a limited basis and I don't like to keep asking for money from them, so i wanted to know what's the absolute cheapest way to do a visa run? the Indian government has put up like a million rules and limitations on how you can get into the country and out so it's like a really complex puzzle to figure out a workaround for this. this is the mail i got with all the rules. they really want to make it difficult, i was thinking of staying in Kolkata and Delhi which will make it cheaper regarding visa run, but I'm a bit lost at the moment, cant find a solution that's feasible. [https://www.india-visa-online.org/indian-e-visa-entry-points-rules](https://www.india-visa-online.org/indian-e-visa-entry-points-rules)",
    "light_cleaned_comments": "ah yes you're right they wrote that entry to India by land immigration is not allowed so I could take the bus to somewhere close to Kolkata or Delhi if i choose to live in those 2 places and then take a flight back to Delhi or Kolkata i guess if that allowed? thank you i will look into that and see whats the cheapest option i have. Note that the entry point rules are valid only for your first trip into India (with an evisa ETA). At the airport immigration, you will get a visa stamp on your passport. For future entries (till the expiry of your five year multiple entry visa), you are treated just like a paper visa holder and can enter through land borders as well. really ? then i can stay in Delhi and go to Nepal by bus and come back again? where is this information, they clearly stats in the letter no land entry, that's why its a bit confusion what you are saying and what they are saying Yes. That line about no land entry and the bit about designated entry ports is valid only for the first visit when you're traveling on the basis of the ETA letter that you get via email. For future visits, you'll be traveling on the basis of the visa stamp on your passport and can enter through any means. I don't think this is clearly written anywhere but it's how things are working right now (and have been working since evisas were introduced). You can confirm this by writing to your local Indian consulate or other authorities. Are you sure that visa runs are possible with a tourist e-visa? The conditions state: 'Maximum stay in India during one Calendar Year should not exceed 180 days.' I'm not sure . Ask the person the redditor above this is still correct and valid info right ? im going back to sl this month after staying 6 months in india, hopefully im not getting fined or arrested Do you mean the bit about the land borders? Yes, that's still valid. But how is it relevant if you're going to SL? The max time allowed per visit is 6 months only for certain passports (like the US, UK and Canada). Do you mean yours is one of the passports which only allow 3 months per visit and you already made a visa run to Nepal and back in the last 6 months? In that case, you'll be fine. >The max time allowed per visit is 6 months only for certain passports (like the US, UK and Canada) nooo are you serious ??? my passport is danish, no i i did not make a visa run to nepal, i thought i could stay 180 days and then travel to sl and back again to india by plane, i have stayed 5 months now, and im going this month, no anything i can do ? this was a pure misunderstanding from my side I think it's 90 days for Danish passports. You can take out your e-visa ETA and check. It should have a line like \"Continuous stay in India on each entry should not exceed __ days\". If you've indeed overstayed, I'd strongly advise you to immediately [apply here](https://indianfrro.gov.in/eservices/) for an exit permit online. You'll need to pay a fine. The general advice is that it'll be $300 but the actual fine you'll be asked to pay may vary wildly. You can also just choose to just go to the airport for your flight without getting an exit permit. But in that case, you'll have to prepare yourself to be subjected to intense interrogations, possibly higher fine amounts and a higher chance of Indian visas/entry being denied to you in the future. update about the visa run Hey, I hope it is okay if I continue the conversation in this post. so i wanted to say I am in india again. It was not an easy thing to do, so first, when i left india i needed to show a return ticket which i did, and the immigration man looked at the dates and i felt like he felt suspicious or something. Anyway, he gave me a departure stamp. Now on the way back, I had to go to immigration, and I got nervous and talked a bit too much maybe, like he didn't even need to see the proof of immigration paper the numbers on the old stamp was enough for him, but I talked too much, and I just said I was planning to take the bus to Nepal in the future, maybe within 3 months, and I could see on him that, oh, he didn't even think of asking such a question about when I was leaving or if I had any proof of leaving, which he stated doing after I mentioned Nepal, so he stamped it and told me to follow him to a lady who asked what my purpose was of the stay, and I said visiting friends, which is true, so they let me go and she told the guy to check up on the address i have given which was half fake address. How long can I stay with this stamp? It doesn't say 180 days. Like the old one, I'm a brown guy, and I speak Tamil on a basic level. i felt like he felt suspicious or something [my visa pdf file paper](https://imgur.com/a/SvD9HnR) [stamps i got](https://imgur.com/a/gja0Iug) It's always good to just give to-the-point answers to the questions. But don't worry now. There's no requirement for you to stay in the same address you give so that won't be a problem. The old visa stamp (the one where 180 days is ticked) is still valid and will be valid till the expiry of the 5 year period. You only get an arrival stamp on subsequent visits. So, since it's not corrected or anything, I would take that to mean that you can stay 180 days on each visit. Taking into account the calendar year rule, you can probably stay for 175 days starting today. In any case, the next time I meet a traveller on an EU passport, I'll be sure to find out if they have been given 90 days or 180 days and let you know. Just to figure out whether this is an oversight or policy change."
}