{
    "id": "14cj2z1",
    "title": "Women, especially when wearing skimpy clothes,can create problems - Telangana home minister",
    "url": "https://i.redd.it/ppaf4zl0rr6b1.jpg",
    "selftext": "Source : http://epaper.deccanchronicle.com/articledetailpage.aspx?id=17273462",
    "flair": "Politics",
    "score": 1248,
    "num_comments": 227,
    "created_utc": 1687090763.0,
    "convurl": "https://i.redd.it/ppaf4zl0rr6b1.jpg",
    "comments": [
        "His unwrapped potato looking head is turning me on.. 😭",
        "This pathetic garbage just showcases how men can’t take responsibility for fucking anything in this country. You become violent, creepy or an asshole and it’s always somebody else’s fault.",
        "Men when speaking out of their ass can create problems.",
        "Dude Seriously?",
        "Hol' up, girls in the comment section don't generalize men. It's only the bald guy.\n\nRest of the men here would love to see you being gorgeous.",
        "Men?.... It's just that bald guy.",
        "Women don’t exist to be “gorgeous”, we just want to be able to go about our lives without men policing us and Being assaulted.",
        "Absolutely! I've have corrected.",
        "but what about when fat women wear skimpy clothes?",
        "Appreciate it! thank you 😊🙏",
        "Why did he stop there? What kind of problems?  May be some environmental impact or something? Like climate change?",
        "Mollahs and chindus , same bigotry different religion",
        "Hmmmm… why is he wearing a shirt? Doesn’t he know it is European? Wear a uttariya or something? Now he’s clearly asking for it and soon situation will go out of hand.  All these European styles is too much and can create problems. 🤡🤡🤡",
        "The change between his legs. That’s the only change. Stupid fellow.",
        "What is he implying exactly? That we Indians are savages who get uncontrollable urges when we see women who aren't covering up all parts of their skin?",
        "Mera comment sarcastic thaaa. /s lagana bhul gaya.",
        "Precisely, this one, yes.",
        "Yeah yeah I know. I was purely making fun of the sexy, bald, angry-looking man.",
        "What's wrong with The90sManChild's comment? If someone speaks out of their ass , it can create problems.",
        "He's just exposing his mindset and how he'd act. Glad that these guys are dumb enough to expose themselves as the dumbasses they are.",
        "How to say \"Main tharki hoon\" without saying \"Main tharki hoon\"?",
        "Average indian uncle 🤡🤡",
        "Yeah it's always a self-report with these idiots. They are unfortunately too dumb to realise that.",
        "😆sahi me",
        "Coz he can’t keep his 1 inch nunnu in his pants! Chewtiya",
        "I'd say fortunately, otherwise we would have a harder time identifying these kind of fools.",
        "Lol yeah i was gonna add that as an aside, that it is probably fortunate for some who would hear that and fucking bail. What a fucking caveman.",
        "looks like someone hasn't had any action in a while",
        "Reeking patriarchy",
        "Yeah, problems which can be solved with a little self control…",
        "Nice. Now, crawl back under the rock and never come out. Obviously, you  don't fit in and deserve to hibernate.",
        "Hmm, where I am , men and women seem to be happy , even in nude beaches.",
        "Typical bakchod uncle",
        "What's up with this islamic obsession of covering head?",
        "who is he? HM of which state",
        "I have a collection of pictures to show people when they say India is on the path to becoming a superpower, overtaking both the US and China. This is going in there.",
        "Actually the value of g increases to 98 m/s² coz of it, so that would be a problem",
        "ACP Pradyumna??? 💀💀",
        "And uncovering some heads",
        "at least some women can know this creep and stay away from him.",
        "Kuch to garbar hain",
        "And he would be the first one to starr n look if any girl wears tight clothes 🤣",
        "Telangana home minister",
        "The other india sub will be cumming reading this.",
        "I saw a man at airport he was continously staring at the legs of the girl wearing denim shorts sitting just next to him. First I thought she might be his relative but as she felt sleepy that uncle was as if he ready to go in her legs then she got up after several minutes. Why she did not get up earlier,  I keep thinking about it and she was very beautiful but let the uncle stare and almost fall into her legs ?",
        "*gobar",
        "One inch is too big for him dear",
        "😂",
        "Thats your takeaway from this post ?",
        "Need a ShitBRSSays now",
        "Huh. Sounds like men who can't control their urges need to be locked away from society then.",
        "Yeah, problems for men like him who can't keep it in their pants.",
        "Average indian uncle 80% of have the same view they just dont express it public maybe coz they want to sound politically correct or they wanted to been seen liberal but privately 80% of em thinks the same…..waise mera baap bhi aaisa hi hai lol but just to look kool he didn’t say that in public",
        "I too thought the same. Seems sexually frustrated.",
        "Men who wear khakhi chaddas and carry lathis are a turn on 🥰 If they keep at it, it will cause problems for women /s",
        "Bro is one comb away from being bald. Women's clothing is least of his problems",
        "Oh yes. The classic case of wrap up the women, don't teach the men. Indian politicians have the finest views on this.",
        "These people who think like this are the problem. Thanks for outing yourself uncle.",
        "Funny how being in Europe and wearing \"European styled clothes\" absolutely never made me feel unsafe. The only time i felt unsafe in Europe was when a bunch of Indian men decided to follow us for 3 streets harassing us. Maybe it's not the outfit or the origins of it, maybe it's just men like you",
        "-6 inches hona chahiye😂",
        "American here married to Telugu guy.\n\nSudden urge to have athamma (in her 70s I guess?) try on my skimpy European clothes and see what kind of problems she causes. Chalo",
        "For a second I thought it's ACP pradyumann",
        "Ying and yang.",
        "Innie peenie?",
        "When are we gonna stop electing duckheads.",
        "Don't forget the \"fathers\". India is where liberalism goes to die",
        "Literally no one is blaming men here. You gotta be a real piece of work to think like this. Inceldom is getting to you",
        "Aapko toh pata hi hoga",
        "I feel like that meme with the two buttons. \n\nAs a muslim, I want muslims to be represented in government and in visible positions and KCR putting this chap as HM is very encouraging. I applaud KCR for his fortitude in doing so\n\nBut I also want to see progressive politics from Muslim leaders. I want leaders not just politicians. What he is saying will appeal to most Indian men. And many women too. So he is being practical in saying these things, even if he doesnt personally believe in them. \n\nAnd that is where we are stuck in India politics. I do want to add that I've become a big fan of Siddharamiah after seeing his religion neutral approach to things. And he is proof that we can have mature politics from veteran politicians. I have heard* much good about KCR as well, ofcourse.",
        "\"B-but if this teenage girl wears a skirt that shows her knee and a top with shoulders exposed, how am I supposed to think straight and not sexually harass this young girl who has nothing to do with me and is just trying to live her life??\"\n\nBruhhh, stop doing this stuff. Not just for women, let everyone wear what they want",
        "Wasn't his grandson one of the rape case accused.",
        "The dude united Hindus and Muslims in one sentence. Respect! /s\n\nEdit: changed divided to united",
        "Wtf",
        "😂",
        "Rent free",
        "Thanos making sense year after year"
    ],
    "cleaned_text": "women especially wearing skimpy clothescan create problems telangana home minister source ",
    "cleaned_title": "women especially wearing skimpy clothescan create problems telangana home minister",
    "cleaned_selftext": "source",
    "cleaned_comments": "unwrapped potato looking head turning pathetic garbage showcases men cant take responsibility fucking anything country become violent creepy asshole always somebody elses fault men speaking ass create problems dude seriously hol girls comment section dont generalize men bald guy rest men would love see gorgeous men bald guy women dont exist gorgeous want able go lives without men policing us assaulted absolutely ive corrected fat women wear skimpy clothes appreciate thank stop kind problems may environmental impact something like climate change mollahs chindus bigotry different religion hmmmm wearing shirt doesnt know european wear uttariya something hes clearly asking soon situation go hand european styles much create problems change legs thats change stupid fellow implying exactly indians savages get uncontrollable urges see women arent covering parts skin mera comment sarcastic thaaa lagana bhul gaya precisely one yes yeah yeah know purely making fun sexy bald angrylooking man whats wrong thesmanchilds comment someone speaks ass create problems hes exposing mindset hed act glad guys dumb enough expose dumbasses say main tharki hoon without saying main tharki hoon average indian uncle yeah always selfreport idiots unfortunately dumb realise sahi coz cant keep inch nunnu pants chewtiya id say fortunately otherwise would harder time identifying kind fools lol yeah gon na add aside probably fortunate would hear fucking bail fucking caveman looks like someone hasnt action reeking patriarchy yeah problems solved little self control nice crawl back rock never come obviously dont fit deserve hibernate hmm men women seem happy even nude beaches typical bakchod uncle whats islamic obsession covering head hm state collection pictures show people say india path becoming superpower overtaking us china going actually value g increases ms coz would problem acp pradyumna uncovering heads least women know creep stay away kuch garbar hain would first one starr n look girl wears tight clothes telangana home minister india sub cumming reading saw man airport continously staring legs girl wearing denim shorts sitting next first thought might relative felt sleepy uncle ready go legs got several minutes get earlier keep thinking beautiful let uncle stare almost fall legs gobar one inch big dear thats takeaway post need shitbrssays huh sounds like men cant control urges need locked away society yeah problems men like cant keep pants average indian uncle view dont express public maybe coz want sound politically correct wanted seen liberal privately em thinks samewaise mera baap bhi aaisa hi hai lol look kool didnt say public thought seems sexually frustrated men wear khakhi chaddas carry lathis turn keep cause problems women bro one comb away bald womens clothing least problems oh yes classic case wrap women dont teach men indian politicians finest views people think like problem thanks outing uncle funny europe wearing european styled clothes absolutely never made feel unsafe time felt unsafe europe bunch indian men decided follow us streets harassing us maybe outfit origins maybe men like inches hona chahiye american married telugu guy sudden urge athamma guess try skimpy european clothes see kind problems causes chalo second thought acp pradyumann ying yang innie peenie gon na stop electing duckheads dont forget fathers india liberalism goes die literally one blaming men got ta real piece work think like inceldom getting aapko toh pata hi hoga feel like meme two buttons muslim want muslims represented government visible positions kcr putting chap hm encouraging applaud kcr fortitude also want see progressive politics muslim leaders want leaders politicians saying appeal indian men many women practical saying things even doesnt personally believe stuck india politics want add ive become big fan siddharamiah seeing religion neutral approach things proof mature politics veteran politicians heard much good kcr well ofcourse bbut teenage girl wears skirt shows knee top shoulders exposed supposed think straight sexually harass young girl nothing trying live life bruhhh stop stuff women let everyone wear want wasnt grandson one rape case accused dude united hindus muslims one sentence respect edit changed divided united wtf rent free thanos making sense year year",
    "light_cleaned_title": "Women, especially when wearing skimpy clothes,can create problems - Telangana home minister",
    "light_cleaned_selftext": "Source :",
    "light_cleaned_comments": "His unwrapped potato looking head is turning me on.. 😭 This pathetic garbage just showcases how men can’t take responsibility for fucking anything in this country. You become violent, creepy or an asshole and it’s always somebody else’s fault. Men when speaking out of their ass can create problems. Dude Seriously? Hol' up, girls in the comment section don't generalize men. It's only the bald guy. Rest of the men here would love to see you being gorgeous. Men?.... It's just that bald guy. Women don’t exist to be “gorgeous”, we just want to be able to go about our lives without men policing us and Being assaulted. Absolutely! I've have corrected. but what about when fat women wear skimpy clothes? Appreciate it! thank you 😊🙏 Why did he stop there? What kind of problems? May be some environmental impact or something? Like climate change? Mollahs and chindus , same bigotry different religion Hmmmm… why is he wearing a shirt? Doesn’t he know it is European? Wear a uttariya or something? Now he’s clearly asking for it and soon situation will go out of hand. All these European styles is too much and can create problems. 🤡🤡🤡 The change between his legs. That’s the only change. Stupid fellow. What is he implying exactly? That we Indians are savages who get uncontrollable urges when we see women who aren't covering up all parts of their skin? Mera comment sarcastic thaaa. /s lagana bhul gaya. Precisely, this one, yes. Yeah yeah I know. I was purely making fun of the sexy, bald, angry-looking man. What's wrong with The90sManChild's comment? If someone speaks out of their ass , it can create problems. He's just exposing his mindset and how he'd act. Glad that these guys are dumb enough to expose themselves as the dumbasses they are. How to say \"Main tharki hoon\" without saying \"Main tharki hoon\"? Average indian uncle 🤡🤡 Yeah it's always a self-report with these idiots. They are unfortunately too dumb to realise that. 😆sahi me Coz he can’t keep his 1 inch nunnu in his pants! Chewtiya I'd say fortunately, otherwise we would have a harder time identifying these kind of fools. Lol yeah i was gonna add that as an aside, that it is probably fortunate for some who would hear that and fucking bail. What a fucking caveman. looks like someone hasn't had any action in a while Reeking patriarchy Yeah, problems which can be solved with a little self control… Nice. Now, crawl back under the rock and never come out. Obviously, you don't fit in and deserve to hibernate. Hmm, where I am , men and women seem to be happy , even in nude beaches. Typical bakchod uncle What's up with this islamic obsession of covering head? who is he? HM of which state I have a collection of pictures to show people when they say India is on the path to becoming a superpower, overtaking both the US and China. This is going in there. Actually the value of g increases to 98 m/s² coz of it, so that would be a problem ACP Pradyumna??? 💀💀 And uncovering some heads at least some women can know this creep and stay away from him. Kuch to garbar hain And he would be the first one to starr n look if any girl wears tight clothes 🤣 Telangana home minister The other india sub will be cumming reading this. I saw a man at airport he was continously staring at the legs of the girl wearing denim shorts sitting just next to him. First I thought she might be his relative but as she felt sleepy that uncle was as if he ready to go in her legs then she got up after several minutes. Why she did not get up earlier, I keep thinking about it and she was very beautiful but let the uncle stare and almost fall into her legs ? *gobar One inch is too big for him dear 😂 Thats your takeaway from this post ? Need a ShitBRSSays now Huh. Sounds like men who can't control their urges need to be locked away from society then. Yeah, problems for men like him who can't keep it in their pants. Average indian uncle 80% of have the same view they just dont express it public maybe coz they want to sound politically correct or they wanted to been seen liberal but privately 80% of em thinks the same…..waise mera baap bhi aaisa hi hai lol but just to look kool he didn’t say that in public I too thought the same. Seems sexually frustrated. Men who wear khakhi chaddas and carry lathis are a turn on 🥰 If they keep at it, it will cause problems for women /s Bro is one comb away from being bald. Women's clothing is least of his problems Oh yes. The classic case of wrap up the women, don't teach the men. Indian politicians have the finest views on this. These people who think like this are the problem. Thanks for outing yourself uncle. Funny how being in Europe and wearing \"European styled clothes\" absolutely never made me feel unsafe. The only time i felt unsafe in Europe was when a bunch of Indian men decided to follow us for 3 streets harassing us. Maybe it's not the outfit or the origins of it, maybe it's just men like you -6 inches hona chahiye😂 American here married to Telugu guy. Sudden urge to have athamma (in her 70s I guess?) try on my skimpy European clothes and see what kind of problems she causes. Chalo For a second I thought it's ACP pradyumann Ying and yang. Innie peenie? When are we gonna stop electing duckheads. Don't forget the \"fathers\". India is where liberalism goes to die Literally no one is blaming men here. You gotta be a real piece of work to think like this. Inceldom is getting to you Aapko toh pata hi hoga I feel like that meme with the two buttons. As a muslim, I want muslims to be represented in government and in visible positions and KCR putting this chap as HM is very encouraging. I applaud KCR for his fortitude in doing so But I also want to see progressive politics from Muslim leaders. I want leaders not just politicians. What he is saying will appeal to most Indian men. And many women too. So he is being practical in saying these things, even if he doesnt personally believe in them. And that is where we are stuck in India politics. I do want to add that I've become a big fan of Siddharamiah after seeing his religion neutral approach to things. And he is proof that we can have mature politics from veteran politicians. I have heard* much good about KCR as well, ofcourse. \"B-but if this teenage girl wears a skirt that shows her knee and a top with shoulders exposed, how am I supposed to think straight and not sexually harass this young girl who has nothing to do with me and is just trying to live her life??\" Bruhhh, stop doing this stuff. Not just for women, let everyone wear what they want Wasn't his grandson one of the rape case accused. The dude united Hindus and Muslims in one sentence. Respect! /s Edit: changed divided to united Wtf 😂 Rent free Thanos making sense year after year"
}