{
    "id": "1bkqf8z",
    "title": "6 Years After 17 Muslim Men Were Accused Of Celebrating Pakistani Cricket Victory, MP Courts Find Police Case To Be False",
    "url": "https://article-14.com/post/6-years-after-17-muslim-men-were-accused-of-celebrating-pakistani-cricket-victory-mp-courts-find-police-case-to-be-false-65fa4ed58daa7",
    "selftext": "As a country, we have lost our moral compass and all that is left is religious fanaticism. My blood boils reading the horror these men were put through for six years.",
    "flair": "Law & Courts",
    "score": 395,
    "num_comments": 33,
    "created_utc": 1711080090.0,
    "convurl": "https://external-preview.redd.it/J6VnyCYIvqWflWMmh3UtGhQxPEc1r_sLCedlfuiZnY8.jpg?auto=webp&s=2878fe28e897a17558034d58f14381f13e43ddf3",
    "comments": [
        "Do not waste the law and orders time they say , but completely fine if the law nd order wastes 6 years of someone's time I guess 🤷‍♂️",
        "###Indian police is THE WORST! They lie, they hit, they slap, they torture, they fabricate evidence, they take bribes, they are the worst of the worst low-life scum. Thousands of innocents are languishing in jail because of them and thousands of murderers, rapists and goondas are out on the streets because of them. \n\n\n#THE WORST!",
        "Guilty until proven innocent.",
        "6 years !! 17 Men .\n\ncrime? fake accused.\n\nAnd here modi biryani kha ke aaya pakisatan se..",
        "Even if this was true, how is this an offence in a supposedly civilised country?",
        "Remember umar Khalid and all those bhima koregaon accused who are still in jail....",
        "True. Even for passport verification they ask for money",
        "Civilized and india shouldn’t be in the same sentence. Atleast not with the present political scenario",
        "Ronaldo fans celebrate Portugal like it's their uncle's brand. So do Messi fans for Argentina. That's not a crime.\n\nI guess they work on the logic of \"bitter relationship\" and \"unpleasant past\" with the neighbouring country.",
        "Sad how out of reality people are on these liberal subs.\n\nTo connect with police brutality, person shared how they take bribes for passport verification.\n\nThat's the extent of police's interference in their lives.",
        "Police systems and other institutions are basically dogs\n\nWatch GOT season 1 when little finger betrays stark in throne room with a dagger to his throat\n\nHe explains that gold cloaks follow him instead of (hand of the K) because he is the one who pays them\n\nIt's the same principle, cops take oath and study constitution but that's all bullshit and their owner who pays them salary makes them do whatever they want and the dog follows",
        "[https://www.telegraphindia.com/india/gang-of-criminals-label-back-on-cops/cid/1331151](https://www.telegraphindia.com/india/gang-of-criminals-label-back-on-cops/cid/1331151)\n\nhttps://preview.redd.it/71s7y7fudupc1.jpeg?width=1080&format=pjpg&auto=webp&s=5bcf1aef4e70ba36035c3a30a26811a81c7c1c3d",
        "[https://www.telegraphindia.com/india/gang-of-criminals-label-back-on-cops/cid/1331151](https://www.telegraphindia.com/india/gang-of-criminals-label-back-on-cops/cid/1331151)\n\nhttps://preview.redd.it/cq865alaeupc1.jpeg?width=1080&format=pjpg&auto=webp&s=c020cf284dc52a2270104b2cfc21108cd038ecfe",
        "So Modi having Biryani in Pakistan should be seditious?",
        "Very true. \nAnd if they are meant to protect us, then who will protect us from them?",
        "Nice equivalence.",
        "aw",
        "Now, Policemen who forced the neighbours to give false statements should be persecuted. Otherwise, somewhere the same thing will repeat with impunity.",
        "Vetrimaran pls make visaranai part 2",
        "What do the courts mean by false? How does it matter if they were or were no celebrating a Pak win in a feckin cricket match.",
        "And ABV taking dahej in Pak too.",
        "How can it be a crime When people also celebrate football in other countries.",
        "I don't think my nation is so weak as to be threatened by celebrations of a few folks within it , of a neighbouring region win in an inconsequential sporting contest.",
        "Har ek institutions me problems hai because. Azadi je badd jaha hame schools me baccho ke moral compass ko sensitive karna tha vaha hamne sirf iit aur iim banane me hi dhayan diya .hamne apna upper education ka standard too accha kar liya magar school education ka diwali nikal diya. School education me students bass kisi bhi tarah se paisa kamane wali job ke liye tayyar hone lage, vaha na koi moral education thi, na hi ye students feelings sensitivity ka koi lesson sikh paye, na innum students ko koi bhi cross education ke liye tayyar kiya gaya, na hi inn student me koi vision tha humanity, world order, aur civilizations ko lekar. \nYe bachche too bas khub paisa chapne ke liye hi tayyar hue . Aur inn ka concern tha numbers hasil karna jissse ye akhir me ek robot ban gaye",
        "Or yahi bachche aage chal kar  police, neta, beurocrates,, lawyers  docter aur akhir me ek civilian bane jin me koi moral standards nahi the, too yahi society banni thi jaha injustice hi kayam hoga\nKyonki robots koi matlab nahi hota ki desh ka moral standard gir raha hai",
        "Let's put all the Barcelona fans into jail too then? How dare you celebrate some other country's victory",
        "It took 6 years to figure that out???? That’s 102 man years for them! There MUST be consequences.",
        "That's news to me. When did this happen?"
    ],
    "cleaned_text": "years muslim men accused celebrating pakistani cricket victory mp courts find police case false country lost moral compass left religious fanaticism blood boils reading horror men put six years ",
    "cleaned_title": "years muslim men accused celebrating pakistani cricket victory mp courts find police case false",
    "cleaned_selftext": "country lost moral compass left religious fanaticism blood boils reading horror men put six years",
    "cleaned_comments": "waste law orders time say completely fine law nd order wastes years someones time guess indian police worst lie hit slap torture fabricate evidence take bribes worst worst lowlife scum thousands innocents languishing jail thousands murderers rapists goondas streets worst guilty proven innocent years men crime fake accused modi biryani kha ke aaya pakisatan se even true offence supposedly civilised country remember umar khalid bhima koregaon accused still jail true even passport verification ask money civilized india shouldnt sentence atleast present political scenario ronaldo fans celebrate portugal like uncles brand messi fans argentina thats crime guess work logic bitter relationship unpleasant past neighbouring country sad reality people liberal subs connect police brutality person shared take bribes passport verification thats extent polices interference lives police systems institutions basically dogs watch got season little finger betrays stark throne room dagger throat explains gold cloaks follow instead hand k one pays principle cops take oath study constitution thats bullshit owner pays salary makes whatever want dog follows httpswwwtelegraphindiacomindiagangofcriminalslabelbackoncopscidhttpswwwtelegraphindiacomindiagangofcriminalslabelbackoncopscid httpswwwtelegraphindiacomindiagangofcriminalslabelbackoncopscidhttpswwwtelegraphindiacomindiagangofcriminalslabelbackoncopscid modi biryani pakistan seditious true meant protect us protect us nice equivalence aw policemen forced neighbours give false statements persecuted otherwise somewhere thing repeat impunity vetrimaran pls make visaranai part courts mean false matter celebrating pak win feckin cricket match abv taking dahej pak crime people also celebrate football countries dont think nation weak threatened celebrations folks within neighbouring region win inconsequential sporting contest har ek institutions problems hai azadi je badd jaha hame schools baccho ke moral compass ko sensitive karna tha vaha hamne sirf iit aur iim banane hi dhayan diya hamne apna upper education ka standard accha kar liya magar school education ka diwali nikal diya school education students bass kisi bhi tarah se paisa kamane wali job ke liye tayyar hone lage vaha na koi moral education thi na hi ye students feelings sensitivity ka koi lesson sikh paye na innum students ko koi bhi cross education ke liye tayyar kiya gaya na hi inn student koi vision tha humanity world order aur civilizations ko lekar ye bachche bas khub paisa chapne ke liye hi tayyar hue aur inn ka concern tha numbers hasil karna jissse ye akhir ek robot ban gaye yahi bachche aage chal kar police neta beurocrates lawyers docter aur akhir ek civilian bane jin koi moral standards nahi yahi society banni thi jaha injustice hi kayam hoga kyonki robots koi matlab nahi hota ki desh ka moral standard gir raha hai lets put barcelona fans jail dare celebrate countrys victory took years figure thats man years must consequences thats news happen",
    "light_cleaned_title": "6 Years After 17 Muslim Men Were Accused Of Celebrating Pakistani Cricket Victory, MP Courts Find Police Case To Be False",
    "light_cleaned_selftext": "As a country, we have lost our moral compass and all that is left is religious fanaticism. My blood boils reading the horror these men were put through for six years.",
    "light_cleaned_comments": "Do not waste the law and orders time they say , but completely fine if the law nd order wastes 6 years of someone's time I guess 🤷‍♂️ ###Indian police is THE WORST! They lie, they hit, they slap, they torture, they fabricate evidence, they take bribes, they are the worst of the worst low-life scum. Thousands of innocents are languishing in jail because of them and thousands of murderers, rapists and goondas are out on the streets because of them. #THE WORST! Guilty until proven innocent. 6 years !! 17 Men . crime? fake accused. And here modi biryani kha ke aaya pakisatan se.. Even if this was true, how is this an offence in a supposedly civilised country? Remember umar Khalid and all those bhima koregaon accused who are still in jail.... True. Even for passport verification they ask for money Civilized and india shouldn’t be in the same sentence. Atleast not with the present political scenario Ronaldo fans celebrate Portugal like it's their uncle's brand. So do Messi fans for Argentina. That's not a crime. I guess they work on the logic of \"bitter relationship\" and \"unpleasant past\" with the neighbouring country. Sad how out of reality people are on these liberal subs. To connect with police brutality, person shared how they take bribes for passport verification. That's the extent of police's interference in their lives. Police systems and other institutions are basically dogs Watch GOT season 1 when little finger betrays stark in throne room with a dagger to his throat He explains that gold cloaks follow him instead of (hand of the K) because he is the one who pays them It's the same principle, cops take oath and study constitution but that's all bullshit and their owner who pays them salary makes them do whatever they want and the dog follows [https://www.telegraphindia.com/india/gang-of-criminals-label-back-on-cops/cid/1331151](https://www.telegraphindia.com/india/gang-of-criminals-label-back-on-cops/cid/1331151) [https://www.telegraphindia.com/india/gang-of-criminals-label-back-on-cops/cid/1331151](https://www.telegraphindia.com/india/gang-of-criminals-label-back-on-cops/cid/1331151) So Modi having Biryani in Pakistan should be seditious? Very true. And if they are meant to protect us, then who will protect us from them? Nice equivalence. aw Now, Policemen who forced the neighbours to give false statements should be persecuted. Otherwise, somewhere the same thing will repeat with impunity. Vetrimaran pls make visaranai part 2 What do the courts mean by false? How does it matter if they were or were no celebrating a Pak win in a feckin cricket match. And ABV taking dahej in Pak too. How can it be a crime When people also celebrate football in other countries. I don't think my nation is so weak as to be threatened by celebrations of a few folks within it , of a neighbouring region win in an inconsequential sporting contest. Har ek institutions me problems hai because. Azadi je badd jaha hame schools me baccho ke moral compass ko sensitive karna tha vaha hamne sirf iit aur iim banane me hi dhayan diya .hamne apna upper education ka standard too accha kar liya magar school education ka diwali nikal diya. School education me students bass kisi bhi tarah se paisa kamane wali job ke liye tayyar hone lage, vaha na koi moral education thi, na hi ye students feelings sensitivity ka koi lesson sikh paye, na innum students ko koi bhi cross education ke liye tayyar kiya gaya, na hi inn student me koi vision tha humanity, world order, aur civilizations ko lekar. Ye bachche too bas khub paisa chapne ke liye hi tayyar hue . Aur inn ka concern tha numbers hasil karna jissse ye akhir me ek robot ban gaye Or yahi bachche aage chal kar police, neta, beurocrates,, lawyers docter aur akhir me ek civilian bane jin me koi moral standards nahi the, too yahi society banni thi jaha injustice hi kayam hoga Kyonki robots koi matlab nahi hota ki desh ka moral standard gir raha hai Let's put all the Barcelona fans into jail too then? How dare you celebrate some other country's victory It took 6 years to figure that out???? That’s 102 man years for them! There MUST be consequences. That's news to me. When did this happen?"
}