{
    "id": "17spp1x",
    "title": "Sanatana Dharma propounds ‘abominable, pernicious, illegal and evil practices’, Nilgiris MP A. Raja tells Madras High Court",
    "url": "https://www.thehindu.com/news/national/tamil-nadu/sanatana-dharma-propounds-abominable-pernicious-illegal-and-evil-practices-nilgiris-mp-a-raja-tells-madras-high-court/article67521674.ece",
    "selftext": "BJP be like hob half done.",
    "flair": "Politics",
    "score": 94,
    "num_comments": 25,
    "created_utc": 1699688904.0,
    "convurl": "https://external-preview.redd.it/qlwluTbHqGiQ8wt4HpNytoMn4cATP9gfssVWzHXlLwI.jpg?auto=webp&s=a25f016d502d90a5b1b69ed383a461b2984e61de",
    "comments": [
        "He isn't wrong",
        "And other religions tell you how to cook sweet potatoes? What kind of bull shit is this. He is judging practices of the past from a modern day perspective. 2000 years from now, what's normal for people will be completely different and they will look down on us.",
        "It goes both ways! You can't force those practices into the modern population in the name of tradition and culture without proper evaluation or evidence.",
        "Science is the ULTIMATE dharma \n\nWhy? No competition........deals in absolutes......break the laws of biology you can.......chemistry if you can.......mathematics if you dare...... thermodynamics you cannot.....\n\nEverything else is a facade and death is coming for us all......life is a fight against entropy everything becomes one eventually.",
        "If Islamic fanatics get to rule and impose their religion, we will oppose them. Right now it is saffron fanatics in power. It is right to reveal what Santana darma is",
        "That still does not justify his statement. \n\nNo one is asking you to convert, forced conversion is a crime. If in the name of going against one party you decide to go against the majority religion then there is something wrong with you.",
        "He is not wrong . Any shudra’s (non-brajmnical person) birth is his greatest sin.\nBow dont take your smarty ass below and justify below that its right. \n\n***\n\nMrs X: \"My husband is alcoholic, short-tempered, and violent. He beats me up every day.\"\n\nHer husband's sister: \"What about the husbands of other women? Why do you not question their behaviours?\"\n*****",
        "No. You are making multiple assumptions here. Santana dharma doesn't equate to the whole pantheon of idealogies in Hinduism. The statements are not against the majority religion either. It's just the mainstream propaganda lapdogs doing their job. The criticism mainly attacks the fundamental Brahminism, the weaponised Varna system.",
        "I mean you are right, but that should make everyone an atheist, which unfortunately is not true. I agree that every religion is BS, but at the same time the world as it is today is not accepting of the fact. That's why secularism comes into play where people are allowed to follow religions upto certain degrees, and everyone is expected to have respect for others belief.",
        "Not every religion is bullshit. For example buddhism etc",
        "It is, definitely an improvement in context to other religions, but definitely total BS in context to scientific reality.",
        "Science hasn’t caught up yet with non physical realm. Why is it a milestone for us",
        "Again if you go into this then you ought to believe and respect what others are preaching. I only believe in the physical reality and, that the what spirituality defined as the meta physical is nothing but an emergent property resulting from interaction of systems at a lower level. \n\nYour comment implied you are an atheist but as you clarified you aren't, it is more important for you to realise that anything not backed up by evidence be it from Hinduism, Islam, Christianity or Buddhism as exactly same level of authenticity. Henceforth better for you to understand that you have no right to point fingers, as all religions are basically suffering from problems, either accept this fact or learn to be tolerant of others BS.",
        "But Buddhism supports cast tho. Plenty of Buddhist countries practice it.",
        "It is so easy to be hateful.",
        "Well you see that is true but as a person in some power making statement regarding just one religion is wrong, Imagine if a single bjp or shiv Sena or any other far right party made such a comment, it will be equally wrong. A lot of sanatan dharm practices are just good things that respect elders, help the poor, respect women, a lot has been added in the name of religion - child marriage, sati pratha, dahej, caste system etc and all that is either banned or has special protections for the victims. Can you say something similar to a Muslim forcing burkhas, polygamy, madarsa radicalisation etc this all happens, though at a very small scale, so it happens in Hinduism. Don't forget, it was a political statement, to gather votes from non Hindus, he is not an activist but a politician",
        "That isn't sanatan dharam that's toxic kattar Hinduism. The varna system was totally different, based on tasks not birth, over time it did evolve into the caste system, but today it's more of a personal thing, we don't use religion to justify castes we just say it's society and income. \nSecondly, it's not like other religions are not involved in domestic abuse. I can turn around the statement as- majority muslims are terrorists. Am I right? Factually - yes, but morally wrong. America a majority Christian nation shows domestic abuse cases, Iran, Iraq a majority muslim nation shows women's right suppression including journalists, Afghanistan a stonch Muslim nation, promised women empowerment, Bars education for women, mayanmar a Buddhist nation wahed a war on Muslims , china a majority no religion nation whose government started ethnic cleansing of Muslims, Israel a Jewish nation suppressing Muslim Palestinians, do all these nations sanatani? No, are they practicing evil things? Yes",
        "Mayanmar",
        "That's not Hinduism. That's  the toxic part of the Vedic Brahminism. Hinduism is an assimilation of Vedic brahminism and the tribal paganism. Hypergamy and hypogamy was prevalent in the much older times. But stigma of lower caste has been around for as long time. Even before mahabharata.  But referring two different ideologies under Hinduism without a clear demarcation leaves a lot of room for interpretation. People in north interpret santana dharma differently and in south it is interpretation is different. In tamil nadu \n Santana dharma is a reference to the Vedic religion, which has Varna system as it's backbone. The criticism is against  pushing toxicity in the garb of hinduism",
        "The whole meeting is about vote consolidation and testing the ground level sentiments. But DMK is a party whose idealogy has been the same for decades, this is not something happening new. But the comments itself not about hinduism, but more about counter ideological push against BJP's fundamentalism and communalism, which it pushes in name of Sanatana Dharma.",
        "Ha ha , all the best then."
    ],
    "cleaned_text": "sanatana dharma propounds abominable pernicious illegal evil practices nilgiris mp raja tells madras high court bjp like hob half done ",
    "cleaned_title": "sanatana dharma propounds abominable pernicious illegal evil practices nilgiris mp raja tells madras high court",
    "cleaned_selftext": "bjp like hob half done",
    "cleaned_comments": "isnt wrong religions tell cook sweet potatoes kind bull shit judging practices past modern day perspective years whats normal people completely different look us goes ways cant force practices modern population name tradition culture without proper evaluation evidence science ultimate dharma competitiondeals absolutesbreak laws biology canchemistry canmathematics dare thermodynamics everything else facade death coming us alllife fight entropy everything becomes one eventually islamic fanatics get rule impose religion oppose right saffron fanatics power right reveal santana darma still justify statement one asking convert forced conversion crime name going one party decide go majority religion something wrong wrong shudras nonbrajmnical person birth greatest sin bow dont take smarty ass justify right mrs x husband alcoholic shorttempered violent beats every day husbands sister husbands women question behaviours making multiple assumptions santana dharma doesnt equate whole pantheon idealogies hinduism statements majority religion either mainstream propaganda lapdogs job criticism mainly attacks fundamental brahminism weaponised varna system mean right make everyone atheist unfortunately true agree every religion bs time world today accepting fact thats secularism comes play people allowed follow religions upto certain degrees everyone expected respect others belief every religion bullshit example buddhism etc definitely improvement context religions definitely total bs context scientific reality science hasnt caught yet non physical realm milestone us go ought believe respect others preaching believe physical reality spirituality defined meta physical nothing emergent property resulting interaction systems lower level comment implied atheist clarified arent important realise anything backed evidence hinduism islam christianity buddhism exactly level authenticity henceforth better understand right point fingers religions basically suffering problems either accept fact learn tolerant others bs buddhism supports cast tho plenty buddhist countries practice easy hateful well see true person power making statement regarding one religion wrong imagine single bjp shiv sena far right party made comment equally wrong lot sanatan dharm practices good things respect elders help poor respect women lot added name religion child marriage sati pratha dahej caste system etc either banned special protections victims say something similar muslim forcing burkhas polygamy madarsa radicalisation etc happens though small scale happens hinduism dont forget political statement gather votes non hindus activist politician isnt sanatan dharam thats toxic kattar hinduism varna system totally different based tasks birth time evolve caste system today personal thing dont use religion justify castes say society income secondly like religions involved domestic abuse turn around statement majority muslims terrorists right factually yes morally wrong america majority christian nation shows domestic abuse cases iran iraq majority muslim nation shows womens right suppression including journalists afghanistan stonch muslim nation promised women empowerment bars education women mayanmar buddhist nation wahed war muslims china majority religion nation whose government started ethnic cleansing muslims israel jewish nation suppressing muslim palestinians nations sanatani practicing evil things yes mayanmar thats hinduism thats toxic part vedic brahminism hinduism assimilation vedic brahminism tribal paganism hypergamy hypogamy prevalent much older times stigma lower caste around long time even mahabharata referring two different ideologies hinduism without clear demarcation leaves lot room interpretation people north interpret santana dharma differently south interpretation different tamil nadu santana dharma reference vedic religion varna system backbone criticism pushing toxicity garb hinduism whole meeting vote consolidation testing ground level sentiments dmk party whose idealogy decades something happening new comments hinduism counter ideological push bjps fundamentalism communalism pushes name sanatana dharma ha ha best",
    "light_cleaned_title": "Sanatana Dharma propounds ‘abominable, pernicious, illegal and evil practices’, Nilgiris MP A. Raja tells Madras High Court",
    "light_cleaned_selftext": "BJP be like hob half done.",
    "light_cleaned_comments": "He isn't wrong And other religions tell you how to cook sweet potatoes? What kind of bull shit is this. He is judging practices of the past from a modern day perspective. 2000 years from now, what's normal for people will be completely different and they will look down on us. It goes both ways! You can't force those practices into the modern population in the name of tradition and culture without proper evaluation or evidence. Science is the ULTIMATE dharma Why? No competition........deals in absolutes......break the laws of biology you can.......chemistry if you can.......mathematics if you dare...... thermodynamics you cannot..... Everything else is a facade and death is coming for us all......life is a fight against entropy everything becomes one eventually. If Islamic fanatics get to rule and impose their religion, we will oppose them. Right now it is saffron fanatics in power. It is right to reveal what Santana darma is That still does not justify his statement. No one is asking you to convert, forced conversion is a crime. If in the name of going against one party you decide to go against the majority religion then there is something wrong with you. He is not wrong . Any shudra’s (non-brajmnical person) birth is his greatest sin. Bow dont take your smarty ass below and justify below that its right. *** Mrs X: \"My husband is alcoholic, short-tempered, and violent. He beats me up every day.\" Her husband's sister: \"What about the husbands of other women? Why do you not question their behaviours?\" ***** No. You are making multiple assumptions here. Santana dharma doesn't equate to the whole pantheon of idealogies in Hinduism. The statements are not against the majority religion either. It's just the mainstream propaganda lapdogs doing their job. The criticism mainly attacks the fundamental Brahminism, the weaponised Varna system. I mean you are right, but that should make everyone an atheist, which unfortunately is not true. I agree that every religion is BS, but at the same time the world as it is today is not accepting of the fact. That's why secularism comes into play where people are allowed to follow religions upto certain degrees, and everyone is expected to have respect for others belief. Not every religion is bullshit. For example buddhism etc It is, definitely an improvement in context to other religions, but definitely total BS in context to scientific reality. Science hasn’t caught up yet with non physical realm. Why is it a milestone for us Again if you go into this then you ought to believe and respect what others are preaching. I only believe in the physical reality and, that the what spirituality defined as the meta physical is nothing but an emergent property resulting from interaction of systems at a lower level. Your comment implied you are an atheist but as you clarified you aren't, it is more important for you to realise that anything not backed up by evidence be it from Hinduism, Islam, Christianity or Buddhism as exactly same level of authenticity. Henceforth better for you to understand that you have no right to point fingers, as all religions are basically suffering from problems, either accept this fact or learn to be tolerant of others BS. But Buddhism supports cast tho. Plenty of Buddhist countries practice it. It is so easy to be hateful. Well you see that is true but as a person in some power making statement regarding just one religion is wrong, Imagine if a single bjp or shiv Sena or any other far right party made such a comment, it will be equally wrong. A lot of sanatan dharm practices are just good things that respect elders, help the poor, respect women, a lot has been added in the name of religion - child marriage, sati pratha, dahej, caste system etc and all that is either banned or has special protections for the victims. Can you say something similar to a Muslim forcing burkhas, polygamy, madarsa radicalisation etc this all happens, though at a very small scale, so it happens in Hinduism. Don't forget, it was a political statement, to gather votes from non Hindus, he is not an activist but a politician That isn't sanatan dharam that's toxic kattar Hinduism. The varna system was totally different, based on tasks not birth, over time it did evolve into the caste system, but today it's more of a personal thing, we don't use religion to justify castes we just say it's society and income. Secondly, it's not like other religions are not involved in domestic abuse. I can turn around the statement as- majority muslims are terrorists. Am I right? Factually - yes, but morally wrong. America a majority Christian nation shows domestic abuse cases, Iran, Iraq a majority muslim nation shows women's right suppression including journalists, Afghanistan a stonch Muslim nation, promised women empowerment, Bars education for women, mayanmar a Buddhist nation wahed a war on Muslims , china a majority no religion nation whose government started ethnic cleansing of Muslims, Israel a Jewish nation suppressing Muslim Palestinians, do all these nations sanatani? No, are they practicing evil things? Yes Mayanmar That's not Hinduism. That's the toxic part of the Vedic Brahminism. Hinduism is an assimilation of Vedic brahminism and the tribal paganism. Hypergamy and hypogamy was prevalent in the much older times. But stigma of lower caste has been around for as long time. Even before mahabharata. But referring two different ideologies under Hinduism without a clear demarcation leaves a lot of room for interpretation. People in north interpret santana dharma differently and in south it is interpretation is different. In tamil nadu Santana dharma is a reference to the Vedic religion, which has Varna system as it's backbone. The criticism is against pushing toxicity in the garb of hinduism The whole meeting is about vote consolidation and testing the ground level sentiments. But DMK is a party whose idealogy has been the same for decades, this is not something happening new. But the comments itself not about hinduism, but more about counter ideological push against BJP's fundamentalism and communalism, which it pushes in name of Sanatana Dharma. Ha ha , all the best then."
}