{
    "id": "1bc4sjf",
    "title": "(the devil's in the detail) SBI need not to reveal who donated how much to whom",
    "url": "https://www.indiatoday.in/law/story/electoral-bonds-supreme-court-order-sbi-matching-exercise-donation-political-parties-bjp-2513310-2024-03-11",
    "selftext": "Tomorrow when SBI gives the data to EC we will only know\n\n-who bought the bonds, when & how much.\n-which party encashed, when & how much.\n\nThat’s all.\n\nWho gave to whom won’t be known tomorrow (12th March 2024)",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1710168114.0,
    "convurl": "https://external-preview.redd.it/8LSDtibQ-0JadJiScNVIfbkiCtCGwz6n5JvMb9-rJRs.jpg?auto=webp&s=ccc4c457f3b3b9d4a5dd9dbe39352c09a75651b2",
    "comments": [
        "corelate with majority of money went to bjp. you'll have your answers.",
        "everyone gets the piece of pie, bjp is in power so they get bigger. if congress will be in the power they would get too.",
        "bjp got higher share since 2008 even when they were not in power. that is how they fuelled the mega advertising campaigns for Modi."
    ],
    "cleaned_text": "devils detail sbi need reveal donated much tomorrow sbi gives data ec know bought bonds much party encashed much thats gave wont known tomorrow th march ",
    "cleaned_title": "devils detail sbi need reveal donated much",
    "cleaned_selftext": "tomorrow sbi gives data ec know bought bonds much party encashed much thats gave wont known tomorrow th march",
    "cleaned_comments": "corelate majority money went bjp youll answers everyone gets piece pie bjp power get bigger congress power would get bjp got higher share since even power fuelled mega advertising campaigns modi",
    "light_cleaned_title": "(the devil's in the detail) SBI need not to reveal who donated how much to whom",
    "light_cleaned_selftext": "Tomorrow when SBI gives the data to EC we will only know -who bought the bonds, when & how much. -which party encashed, when & how much. That’s all. Who gave to whom won’t be known tomorrow (12th March 2024)",
    "light_cleaned_comments": "corelate with majority of money went to bjp. you'll have your answers. everyone gets the piece of pie, bjp is in power so they get bigger. if congress will be in the power they would get too. bjp got higher share since 2008 even when they were not in power. that is how they fuelled the mega advertising campaigns for Modi."
}