{
    "id": "183fvhn",
    "title": "Exemption of CERT-In from the RTI Act dilutes institutional transparency and weakens individual privacy",
    "url": "https://www.reddit.com/r/india/comments/183fvhn/exemption_of_certin_from_the_rti_act_dilutes/",
    "selftext": "&#x200B;\n\n[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/aomzhzj9ng2c1.png?width=1600&format=png&auto=webp&s=ce4452b494145b27a1f5d5e5928661bb58c7cb53)\n\n An amendment to the Second Schedule to the RTI Act, 2005 was [**notified**](https://egazette.gov.in/(S(qfgob4mjixsp5xt2czi5w3s2))/ViewPDF.aspx?ref=static.internetfreedom.in) by the Department of Personnel and Training (DoPT) on November 24, 2023, exempting the Indian Computer Emergency Response Team (CERT-In) from providing information under the Act. This move is certainly not in the public interest as it weakens the rights of the people by diluting an Act meant to empower them. The exclusion of CERT-In from application of the Act, in an environment where data breaches, device vulnerabilities, and deployment of illegal spywares occur frequently, significantly erodes its accountability. Around 29,20,52,503 Indians were [**reportedly**](https://surfshark.com/research/data-breach-monitoring?ref=static.internetfreedom.in) affected by a breach from 2004 till the second quarter of 2023,  i.e. 9904 breaches per 1 lakh people. The average cost of a data breach in India is at an all-time high, at ₹17.9 crore in 2023. An institution such as the CERT-In, whose actions or inaction is consequential for the status of cyber security and individual privacy in the country, must remain under the purview of the Act. \n\nA principal agreement to exempt CERT-In was [**reportedly**](https://economictimes.indiatimes.com/news/india/stage-set-for-rti-exemption-for-forces-cybersecurity-and-tax-data-agencies/articleshow/91673008.cms?ref=static.internetfreedom.in) reached in May 2022. Earlier that year in March, as per a Parliamentary [**response**](https://www.thehindu.com/news/national/cert-in-may-be-exempted-from-rti-act-govt/article66683021.ece?ref=static.internetfreedom.in), a proposal to include CERT-in in the Second Schedule to the RTI Act was reviewed. Although the decision has been formalised through the notified amendment, Clause 24(3) of the RTI Act, 2005 states that any notification for exempting organisations has to be placed before the Parliament/state assembly for scrutiny. It remains to be seen whether this rights diluting notification will be placed before the Parliament and be subject to any well deserved scrutiny. \n\n### An attack on the RTI Act\n\nThe RTI Act was enacted to promote transparency and accountability to the operations of Indian public authorities, and for preventing them from acting in private interest, or otherwise undermining democratic processes.When organisations investigating cyber-security vulnerabilities in public and private infrastructures like CERT-In are made opaque, decisions impacting citizens’ right to privacy are guarded from scrutiny and accountability. This step patently undermines the constitutional rights of citizens to their privacy, and to information. \n\n### The infamous 2022 CERT-In Directions\n\nThe data security and privacy concerns emerging from the [**Direction No. 20(3)/2022-CERT-In**](https://www.cert-in.org.in/PDF/CERT-In_Directions_70B_28.04.2022.pdf?ref=internetfreedom.in) (“2022 Directions”) makes this exemption even more alarming. The 2022 Directions has overbroad compliance requirements, at the cost of user privacy, which are applicable to a range of services, including but not limited to data centres, virtual private server (VPS) providers, cloud service providers, and Virtual Private Networks (VPN) service providers. These requirements range from enabling logs and storing them for  a rolling period of 180 days within the Indian jurisdiction (Direction 4) to maintaining extremely detailed and invasive personal information of users, even after any cancellation or withdrawal of registration of a user (Direction 5).\n\nNon-compliance with these directions is a punishable offence carrying imprisonment of up to a year and/ or fine. Furthermore, these services may be  required to hand over this information at any time to CERT-In. The 2022 Directions do not impose any limitations on how long CERT-In could retain this data or with whom it could share it. After the release of the 2022 Directions, several prominent and commonly used VPN providers [**pulled their servers out of India**](https://internetfreedom.in/snthostings-a-vpn-seedbox-and-root-server-provider-urges-meity-to-withdraw-the-unlawful-cert-in-direction-which-will-be-effective-on-june-27-2022/?ref=static.internetfreedom.in), unwilling to compromise on users’ privacy on the internet. \n\n### The need for transparency\n\nIt is interesting and unfortunate that on one hand, CERT-In wants our logs and data under the garb of addressing cyber security incidents, non-compliance with which will lead to one year jail time, but on the other hand, it itself doesn’t want to be transparent and held accountable to the citizens. This discrepancy in how Meity envisions citizens’ interaction with the state is further visible in [**Section 15(c)**](https://www.meity.gov.in/writereaddata/files/Digital%20Personal%20Data%20Protection%20Act%202023.pdf?ref=static.internetfreedom.in) of the Digital Personal Data Protection Act, 2023, wherein individuals are bound to share information with the State or any of its instrumentalities, but the latter has no such obligation, and is instead protected against it. Such inconsistent and continued steps to weaken accountability mechanisms towards citizens inflict untold damage to our digital rights. \n\nGiven that most companies fail to even acknowledge these breaches resulting in a near complete lack of information,  IFF recognised the need to maintain a public list of data breaches that occurred in the country since 2020 on a publicly accessible database, [**PlugTheBreach**](https://plugthebreach.in/?ref=static.internetfreedom.in). IFF also provided legal assistance in a [**petition**](https://internetfreedom.in/delhi-hc-issues-notice-in-snthostings-challenge-to-legality-of-cert-ins-directions/?ref=static.internetfreedom.in) in the Delhi High Court challenging the legality of the 2022 Directions. IFF filed [**RTIs**](https://internetfreedom.in/top-secret-one-year-on-cert-in-refuses-to-reveal-information-about-compliance-notices-issued-under-its-2022-directions-on-cybersecurity/?ref=static.internetfreedom.in) with the CERT-In to better understand the institutional process put in place to facilitate the implementation of the 2022 Directions. Disappointingly, in the response, CERT-In was non-responsive and evasive, hindering our efforts to gather necessary information and understand the processes in place. \n\nHelp us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/) or talk to us on the [IFF Forum](https://forum.internetfreedom.in/)!",
    "flair": "Policy/Economy",
    "score": 23,
    "num_comments": 2,
    "created_utc": 1700903554.0,
    "convurl": "https://b.thumbs.redditmedia.com/5S-nJ-oAyjC-vKqYfhGFnR8PJlPojH1hpmeao1F_xCQ.jpg",
    "comments": [],
    "cleaned_text": "exemption certin rti act dilutes institutional transparency weakens individual privacy xb iff needs support ever details end posthttpspreviewredditaomzhzjngcpngwidthformatpngautowebpscebbafdebbccb amendment second schedule rti act notifiedhttpsegazettegovinsqfgobmjixspxtcziwsviewpdfaspxrefstaticinternetfreedomin department personnel training dopt november exempting indian computer emergency response team certin providing information act move certainly public interest weakens rights people diluting act meant empower exclusion certin application act environment data breaches device vulnerabilities deployment illegal spywares occur frequently significantly erodes accountability around indians reportedlyhttpssurfsharkcomresearchdatabreachmonitoringrefstaticinternetfreedomin affected breach till second quarter ie breaches per lakh people average cost data breach india alltime high crore institution certin whose actions inaction consequential status cyber security individual privacy country must remain purview act principal agreement exempt certin reportedlyhttpseconomictimesindiatimescomnewsindiastagesetforrtiexemptionforforcescybersecurityandtaxdataagenciesarticleshowcmsrefstaticinternetfreedomin reached may earlier year march per parliamentary responsehttpswwwthehinducomnewsnationalcertinmaybeexemptedfromrtiactgovtarticleecerefstaticinternetfreedomin proposal include certin second schedule rti act reviewed although decision formalised notified amendment clause rti act states notification exempting organisations placed parliamentstate assembly scrutiny remains seen whether rights diluting notification placed parliament subject well deserved scrutiny attack rti act rti act enacted promote transparency accountability operations indian public authorities preventing acting private interest otherwise undermining democratic processeswhen organisations investigating cybersecurity vulnerabilities public private infrastructures like certin made opaque decisions impacting citizens right privacy guarded scrutiny accountability step patently undermines constitutional rights citizens privacy information infamous certin directions data security privacy concerns emerging direction certinhttpswwwcertinorginpdfcertindirectionsbpdfrefinternetfreedomin directions makes exemption even alarming directions overbroad compliance requirements cost user privacy applicable range services including limited data centres virtual private server vps providers cloud service providers virtual private networks vpn service providers requirements range enabling logs storing rolling period days within indian jurisdiction direction maintaining extremely detailed invasive personal information users even cancellation withdrawal registration user direction noncompliance directions punishable offence carrying imprisonment year fine furthermore services may required hand information time certin directions impose limitations long certin could retain data could share release directions several prominent commonly used vpn providers pulled servers indiahttpsinternetfreedominsnthostingsavpnseedboxandrootserverproviderurgesmeitytowithdrawtheunlawfulcertindirectionwhichwillbeeffectiveonjunerefstaticinternetfreedomin unwilling compromise users privacy internet need transparency interesting unfortunate one hand certin wants logs data garb addressing cyber security incidents noncompliance lead one year jail time hand doesnt want transparent held accountable citizens discrepancy meity envisions citizens interaction state visible section chttpswwwmeitygovinwritereaddatafilesdigitalpersonaldataprotectionactpdfrefstaticinternetfreedomin digital personal data protection act wherein individuals bound share information state instrumentalities latter obligation instead protected inconsistent continued steps weaken accountability mechanisms towards citizens inflict untold damage digital rights given companies fail even acknowledge breaches resulting near complete lack information iff recognised need maintain public list data breaches occurred country since publicly accessible database plugthebreachhttpsplugthebreachinrefstaticinternetfreedomin iff also provided legal assistance petitionhttpsinternetfreedomindelhihcissuesnoticeinsnthostingschallengetolegalityofcertinsdirectionsrefstaticinternetfreedomin delhi high court challenging legality directions iff filed rtishttpsinternetfreedomintopsecretoneyearoncertinrefusestorevealinformationaboutcompliancenoticesissuedunderitsdirectionsoncybersecurityrefstaticinternetfreedomin certin better understand institutional process put place facilitate implementation directions disappointingly response certin nonresponsive evasive hindering efforts gather necessary information understand processes place help us watch watchmen become iff memberhttpsinternetfreedomindonate talk us iff forumhttpsforuminternetfreedomin ",
    "cleaned_title": "exemption certin rti act dilutes institutional transparency weakens individual privacy",
    "cleaned_selftext": "xb iff needs support ever details end posthttpspreviewredditaomzhzjngcpngwidthformatpngautowebpscebbafdebbccb amendment second schedule rti act notifiedhttpsegazettegovinsqfgobmjixspxtcziwsviewpdfaspxrefstaticinternetfreedomin department personnel training dopt november exempting indian computer emergency response team certin providing information act move certainly public interest weakens rights people diluting act meant empower exclusion certin application act environment data breaches device vulnerabilities deployment illegal spywares occur frequently significantly erodes accountability around indians reportedlyhttpssurfsharkcomresearchdatabreachmonitoringrefstaticinternetfreedomin affected breach till second quarter ie breaches per lakh people average cost data breach india alltime high crore institution certin whose actions inaction consequential status cyber security individual privacy country must remain purview act principal agreement exempt certin reportedlyhttpseconomictimesindiatimescomnewsindiastagesetforrtiexemptionforforcescybersecurityandtaxdataagenciesarticleshowcmsrefstaticinternetfreedomin reached may earlier year march per parliamentary responsehttpswwwthehinducomnewsnationalcertinmaybeexemptedfromrtiactgovtarticleecerefstaticinternetfreedomin proposal include certin second schedule rti act reviewed although decision formalised notified amendment clause rti act states notification exempting organisations placed parliamentstate assembly scrutiny remains seen whether rights diluting notification placed parliament subject well deserved scrutiny attack rti act rti act enacted promote transparency accountability operations indian public authorities preventing acting private interest otherwise undermining democratic processeswhen organisations investigating cybersecurity vulnerabilities public private infrastructures like certin made opaque decisions impacting citizens right privacy guarded scrutiny accountability step patently undermines constitutional rights citizens privacy information infamous certin directions data security privacy concerns emerging direction certinhttpswwwcertinorginpdfcertindirectionsbpdfrefinternetfreedomin directions makes exemption even alarming directions overbroad compliance requirements cost user privacy applicable range services including limited data centres virtual private server vps providers cloud service providers virtual private networks vpn service providers requirements range enabling logs storing rolling period days within indian jurisdiction direction maintaining extremely detailed invasive personal information users even cancellation withdrawal registration user direction noncompliance directions punishable offence carrying imprisonment year fine furthermore services may required hand information time certin directions impose limitations long certin could retain data could share release directions several prominent commonly used vpn providers pulled servers indiahttpsinternetfreedominsnthostingsavpnseedboxandrootserverproviderurgesmeitytowithdrawtheunlawfulcertindirectionwhichwillbeeffectiveonjunerefstaticinternetfreedomin unwilling compromise users privacy internet need transparency interesting unfortunate one hand certin wants logs data garb addressing cyber security incidents noncompliance lead one year jail time hand doesnt want transparent held accountable citizens discrepancy meity envisions citizens interaction state visible section chttpswwwmeitygovinwritereaddatafilesdigitalpersonaldataprotectionactpdfrefstaticinternetfreedomin digital personal data protection act wherein individuals bound share information state instrumentalities latter obligation instead protected inconsistent continued steps weaken accountability mechanisms towards citizens inflict untold damage digital rights given companies fail even acknowledge breaches resulting near complete lack information iff recognised need maintain public list data breaches occurred country since publicly accessible database plugthebreachhttpsplugthebreachinrefstaticinternetfreedomin iff also provided legal assistance petitionhttpsinternetfreedomindelhihcissuesnoticeinsnthostingschallengetolegalityofcertinsdirectionsrefstaticinternetfreedomin delhi high court challenging legality directions iff filed rtishttpsinternetfreedomintopsecretoneyearoncertinrefusestorevealinformationaboutcompliancenoticesissuedunderitsdirectionsoncybersecurityrefstaticinternetfreedomin certin better understand institutional process put place facilitate implementation directions disappointingly response certin nonresponsive evasive hindering efforts gather necessary information understand processes place help us watch watchmen become iff memberhttpsinternetfreedomindonate talk us iff forumhttpsforuminternetfreedomin",
    "cleaned_comments": "",
    "light_cleaned_title": "Exemption of CERT-In from the RTI Act dilutes institutional transparency and weakens individual privacy",
    "light_cleaned_selftext": "&#x200B; [IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/aomzhzj9ng2c1.png?width=1600&format=png&auto=webp&s=ce4452b494145b27a1f5d5e5928661bb58c7cb53) An amendment to the Second Schedule to the RTI Act, 2005 was [**notified**](https://egazette.gov.in/(S(qfgob4mjixsp5xt2czi5w3s2))/ViewPDF.aspx?ref=static.internetfreedom.in) by the Department of Personnel and Training (DoPT) on November 24, 2023, exempting the Indian Computer Emergency Response Team (CERT-In) from providing information under the Act. This move is certainly not in the public interest as it weakens the rights of the people by diluting an Act meant to empower them. The exclusion of CERT-In from application of the Act, in an environment where data breaches, device vulnerabilities, and deployment of illegal spywares occur frequently, significantly erodes its accountability. Around 29,20,52,503 Indians were [**reportedly**](https://surfshark.com/research/data-breach-monitoring?ref=static.internetfreedom.in) affected by a breach from 2004 till the second quarter of 2023, i.e. 9904 breaches per 1 lakh people. The average cost of a data breach in India is at an all-time high, at ₹17.9 crore in 2023. An institution such as the CERT-In, whose actions or inaction is consequential for the status of cyber security and individual privacy in the country, must remain under the purview of the Act. A principal agreement to exempt CERT-In was [**reportedly**](https://economictimes.indiatimes.com/news/india/stage-set-for-rti-exemption-for-forces-cybersecurity-and-tax-data-agencies/articleshow/91673008.cms?ref=static.internetfreedom.in) reached in May 2022. Earlier that year in March, as per a Parliamentary [**response**](https://www.thehindu.com/news/national/cert-in-may-be-exempted-from-rti-act-govt/article66683021.ece?ref=static.internetfreedom.in), a proposal to include CERT-in in the Second Schedule to the RTI Act was reviewed. Although the decision has been formalised through the notified amendment, Clause 24(3) of the RTI Act, 2005 states that any notification for exempting organisations has to be placed before the Parliament/state assembly for scrutiny. It remains to be seen whether this rights diluting notification will be placed before the Parliament and be subject to any well deserved scrutiny. ### An attack on the RTI Act The RTI Act was enacted to promote transparency and accountability to the operations of Indian public authorities, and for preventing them from acting in private interest, or otherwise undermining democratic processes.When organisations investigating cyber-security vulnerabilities in public and private infrastructures like CERT-In are made opaque, decisions impacting citizens’ right to privacy are guarded from scrutiny and accountability. This step patently undermines the constitutional rights of citizens to their privacy, and to information. ### The infamous 2022 CERT-In Directions The data security and privacy concerns emerging from the [**Direction No. 20(3)/2022-CERT-In**](https://www.cert-in.org.in/PDF/CERT-In_Directions_70B_28.04.2022.pdf?ref=internetfreedom.in) (“2022 Directions”) makes this exemption even more alarming. The 2022 Directions has overbroad compliance requirements, at the cost of user privacy, which are applicable to a range of services, including but not limited to data centres, virtual private server (VPS) providers, cloud service providers, and Virtual Private Networks (VPN) service providers. These requirements range from enabling logs and storing them for a rolling period of 180 days within the Indian jurisdiction (Direction 4) to maintaining extremely detailed and invasive personal information of users, even after any cancellation or withdrawal of registration of a user (Direction 5). Non-compliance with these directions is a punishable offence carrying imprisonment of up to a year and/ or fine. Furthermore, these services may be required to hand over this information at any time to CERT-In. The 2022 Directions do not impose any limitations on how long CERT-In could retain this data or with whom it could share it. After the release of the 2022 Directions, several prominent and commonly used VPN providers [**pulled their servers out of India**](https://internetfreedom.in/snthostings-a-vpn-seedbox-and-root-server-provider-urges-meity-to-withdraw-the-unlawful-cert-in-direction-which-will-be-effective-on-june-27-2022/?ref=static.internetfreedom.in), unwilling to compromise on users’ privacy on the internet. ### The need for transparency It is interesting and unfortunate that on one hand, CERT-In wants our logs and data under the garb of addressing cyber security incidents, non-compliance with which will lead to one year jail time, but on the other hand, it itself doesn’t want to be transparent and held accountable to the citizens. This discrepancy in how Meity envisions citizens’ interaction with the state is further visible in [**Section 15(c)**](https://www.meity.gov.in/writereaddata/files/Digital%20Personal%20Data%20Protection%20Act%202023.pdf?ref=static.internetfreedom.in) of the Digital Personal Data Protection Act, 2023, wherein individuals are bound to share information with the State or any of its instrumentalities, but the latter has no such obligation, and is instead protected against it. Such inconsistent and continued steps to weaken accountability mechanisms towards citizens inflict untold damage to our digital rights. Given that most companies fail to even acknowledge these breaches resulting in a near complete lack of information, IFF recognised the need to maintain a public list of data breaches that occurred in the country since 2020 on a publicly accessible database, [**PlugTheBreach**](https://plugthebreach.in/?ref=static.internetfreedom.in). IFF also provided legal assistance in a [**petition**](https://internetfreedom.in/delhi-hc-issues-notice-in-snthostings-challenge-to-legality-of-cert-ins-directions/?ref=static.internetfreedom.in) in the Delhi High Court challenging the legality of the 2022 Directions. IFF filed [**RTIs**](https://internetfreedom.in/top-secret-one-year-on-cert-in-refuses-to-reveal-information-about-compliance-notices-issued-under-its-2022-directions-on-cybersecurity/?ref=static.internetfreedom.in) with the CERT-In to better understand the institutional process put in place to facilitate the implementation of the 2022 Directions. Disappointingly, in the response, CERT-In was non-responsive and evasive, hindering our efforts to gather necessary information and understand the processes in place. Help us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/) or talk to us on the [IFF Forum](https://forum.internetfreedom.in/)!",
    "light_cleaned_comments": ""
}