{
    "id": "10qnems",
    "title": "Do you guys remember any examples of Indian media content with references to digital technologies? (example below)",
    "url": "https://www.reddit.com/r/india/comments/10qnems/do_you_guys_remember_any_examples_of_indian_media/",
    "selftext": "The instances I'm looking for can range across all kinds of media like music, films, graphics from news shows, even political slogans and TV commercials.\n\nFor example, there's an old tamil song called \"telephone manipol\", it's lyrics loosely translated mean \"Is she the latest mobile phone? Did Brahma create her like a computer (as perfect as a computer)\".\n\nWhat else comes to your mind? I'm putting together something very interesting about our people's digital history. Hoping to even write about it. Please help out with as many examples as possible! \n\nThank you!\n\nhttps://preview.redd.it/ixc4ur923jfa1.jpg?width=1520&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=5b34e307b688d81b2f6471cec394c8af041601ae",
    "flair": "AskIndia",
    "score": 9,
    "num_comments": 4,
    "created_utc": 1675236040,
    "convurl": "https://b.thumbs.redditmedia.com/CQPY4Jur0UGBB_UtdJimfUPBwKC1_VhVnFUVdAV5VeI.jpg",
    "comments": [
        "[What is Mobile Number?](https://youtu.be/_QqOhN4VYfE)",
        "Got this one! Thanks!",
        "These came to my mind. \n\n1. [Nokia ad on SMS](https://youtu.be/u7mVAVQzinM) \n\n2. [Nokia advertising their torch feature on  Nokia 1100](https://youtu.be/9xRC9gELdeo) \nThis is more of a hardware feature but then telephone wasn't a digital technology either. \n\n3. [Airtel's email for Re. 1](https://youtu.be/F79WIFzfFkU) \n\n4. Reference to email in the lyrics - \"chitthi daali thi aunga mein tere ghar mail bhi kya tha maine tere id par\" from the song [Seher mein](https://youtu.be/Igo8_eK7z9g) ( Rockstar ) \n\n5. Song - [\"Caller tune\"](https://youtu.be/8HnGpDTozTk)( Humshakals) \n\n6. Does photocopy meet the requirement? anyway here's a [kachcha mango bite ad](https://youtu.be/h-gBhGVFdis) \n\n7. [Call me up... call me on my telephone](https://youtu.be/_kxVmhFatb8complete)  ( Bombay Vikings) \n\n8.  [Dil ka telephone](https://youtu.be/a3B2glol4IU) ( Dreamgirl) \n\n9. Scene from Ajnabee - [ Chal main tumhe modern technique se samjha ta hu](https://youtu.be/WCtwgrqW2kw)( watch from 9:34 ) \n\n10. [Bobby deol display his photoshop skill](https://youtube.com/shorts/2SZZBEwZRfQ?feature=share) ( Soldier) \n \n\n11. Reference to www dot com, internet and computer in the song [Dhingtara dhingtara](https://youtu.be/X0zirhsbYgI) ( Hum aapke dil me rehte hai) \n\n12. [Raja meets Roja on IRC ]( https://youtu.be/pRbQXV_lbX0) ( Tamil movie Kadhalar dhiman, 1999) \n\n- telegu [version](https://youtu.be/Hyjs3Da-cSU) \n\n- hindi [version](https://youtu.be/HuR4NXxmRV0) \n\n13. Kaho na pyaar hai [climax  scene](https://youtu.be/PwWrF3b1EJw) \n\n\n\n14. [Mujhe raat din bas mujhe chahte ho ](https://youtu.be/txEPjAe8Vh0) ( Sangharsh) \n\n15. [Main yahan tu wahan](https://youtu.be/himlbsMN4g8) ( Baghban) \n\nDo share once your project complete.",
        "Hey this is superb! I'll be looking at all of these in-depth! Thank you so much! And yes of course, will share what comes of this :)"
    ],
    "cleaned_text": "guys remember examples indian media content references digital technologies example instances im looking range across kinds media like music films graphics news shows even political slogans tv commercials example theres old tamil song called telephone manipol lyrics loosely translated mean latest mobile phone brahma create like computer perfect computer else comes mind im putting together something interesting peoples digital history hoping even write please help many examples possible thank ",
    "cleaned_title": "guys remember examples indian media content references digital technologies example",
    "cleaned_selftext": "instances im looking range across kinds media like music films graphics news shows even political slogans tv commercials example theres old tamil song called telephone manipol lyrics loosely translated mean latest mobile phone brahma create like computer perfect computer else comes mind im putting together something interesting peoples digital history hoping even write please help many examples possible thank",
    "cleaned_comments": "mobile numberhttpsyoutubeqqohnvyfe got one thanks came mind nokia ad smshttpsyoutubeumvavqzinm nokia advertising torch feature nokia httpsyoutubexrcgeldeo hardware feature telephone wasnt digital technology either airtels email httpsyoutubefwifzffku reference email lyrics chitthi daali thi aunga mein tere ghar mail bhi kya tha maine tere id par song seher meinhttpsyoutubeigoekzg rockstar song caller tunehttpsyoutubehngpdtoztk humshakals photocopy meet requirement anyway heres kachcha mango bite adhttpsyoutubehgbhgvfdis call call telephonehttpsyoutubekxvmhfatbcomplete bombay vikings dil ka telephonehttpsyoutubeabgloliu dreamgirl scene ajnabee chal main tumhe modern technique se samjha ta huhttpsyoutubewctwgrqwkw watch bobby deol display photoshop skillhttpsyoutubecomshortsszzbewzrfqfeatureshare soldier reference dot com internet computer song dhingtara dhingtarahttpsyoutubexzirhsbygi hum aapke dil rehte hai raja meets roja irc tamil movie kadhalar dhiman telegu versionhttpsyoutubehyjsdacsu hindi versionhttpsyoutubehurnxxmrv kaho na pyaar hai climax scenehttpsyoutubepwwrfbejw mujhe raat din bas mujhe chahte ho httpsyoutubetxepjaevh sangharsh main yahan tu wahanhttpsyoutubehimlbsmng baghban share project complete hey superb ill looking indepth thank much yes course share comes",
    "light_cleaned_title": "Do you guys remember any examples of Indian media content with references to digital technologies? (example below)",
    "light_cleaned_selftext": "The instances I'm looking for can range across all kinds of media like music, films, graphics from news shows, even political slogans and TV commercials. For example, there's an old tamil song called \"telephone manipol\", it's lyrics loosely translated mean \"Is she the latest mobile phone? Did Brahma create her like a computer (as perfect as a computer)\". What else comes to your mind? I'm putting together something very interesting about our people's digital history. Hoping to even write about it. Please help out with as many examples as possible! Thank you!",
    "light_cleaned_comments": "[What is Mobile Number?](https://youtu.be/_QqOhN4VYfE) Got this one! Thanks! These came to my mind. 1. [Nokia ad on SMS](https://youtu.be/u7mVAVQzinM) 2. [Nokia advertising their torch feature on Nokia 1100](https://youtu.be/9xRC9gELdeo) This is more of a hardware feature but then telephone wasn't a digital technology either. 3. [Airtel's email for Re. 1](https://youtu.be/F79WIFzfFkU) 4. Reference to email in the lyrics - \"chitthi daali thi aunga mein tere ghar mail bhi kya tha maine tere id par\" from the song [Seher mein](https://youtu.be/Igo8_eK7z9g) ( Rockstar ) 5. Song - [\"Caller tune\"](https://youtu.be/8HnGpDTozTk)( Humshakals) 6. Does photocopy meet the requirement? anyway here's a [kachcha mango bite ad](https://youtu.be/h-gBhGVFdis) 7. [Call me up... call me on my telephone](https://youtu.be/_kxVmhFatb8complete) ( Bombay Vikings) 8. [Dil ka telephone](https://youtu.be/a3B2glol4IU) ( Dreamgirl) 9. Scene from Ajnabee - [ Chal main tumhe modern technique se samjha ta hu](https://youtu.be/WCtwgrqW2kw)( watch from 9:34 ) 10. [Bobby deol display his photoshop skill](https://youtube.com/shorts/2SZZBEwZRfQ?feature=share) ( Soldier) 11. Reference to dot com, internet and computer in the song [Dhingtara dhingtara](https://youtu.be/X0zirhsbYgI) ( Hum aapke dil me rehte hai) 12. [Raja meets Roja on IRC ]( ( Tamil movie Kadhalar dhiman, 1999) - telegu [version](https://youtu.be/Hyjs3Da-cSU) - hindi [version](https://youtu.be/HuR4NXxmRV0) 13. Kaho na pyaar hai [climax scene](https://youtu.be/PwWrF3b1EJw) 14. [Mujhe raat din bas mujhe chahte ho ](https://youtu.be/txEPjAe8Vh0) ( Sangharsh) 15. [Main yahan tu wahan](https://youtu.be/himlbsMN4g8) ( Baghban) Do share once your project complete. Hey this is superb! I'll be looking at all of these in-depth! Thank you so much! And yes of course, will share what comes of this :)"
}