{
    "id": "1bqi9tl",
    "title": "Got this in my mail",
    "url": "https://i.redd.it/5kfbdstqu7rc1.jpeg",
    "selftext": "Got this in my mail about a week ago just checked it today though. It is obviously a scam but I'm impressed with new ways these guys are coming up with. Thought I'd post it on reddit so others can also know about this.\n \n*Contents of mail-*\n------------------------------------------------------------------------\nReference:\\\\ OFFICIAL COURT ORDER \nOffice Of The Commissioner Of Police\nCybercrime Cell / Computer Centre\nPolice Headquarters,\nMSO Building, J.P. Estate, New Delhl 110002.\nRef: No. 39724-34-01/ICB-IPHQ/2024                                                                                                                              Dated the 22-03-2024.                                                                        OFFICIAL COURT ORDER.\n\nThis is to inform you of the attached alleged court order against your Internet IP traffic by the Central Bureau of Investigation, Department of Research and Analysis Wing.\nIt is quite unfortunate to turn your official or private Internet to a juvenile pornographic movie cyber. The Central Bureau of Investigation works in partnership with the Police Cybercrime Special Units in handling all complex and sensitive cases of cybercrime, especially when the victims are women and minor children.\nOur laboratories are equipped with state-of-the-art spider/crawling digital software and equipment, having forensic capabilities such as extraction of deleted data from hard drives and mobile phones, imaging and hash value calculation, forensic servers and portable forensic tools for on-site examination, facility to extract data from latest Android or IOS as well as Chinese phones. Based on the above, it is extremely difficult for any victim to consciously or unconsciously visit juvenile pornographic sites without being digitally captured.\nMore information or clarification on the court order will be made available to you upon receipt of your response within 24 hours; our office operates 24 hours / 7 days.\nBe assured that serious legal action will be taken against you if you fail to respond to this notice within 24 hours of receipt.\nTo forewarn is to forearm.\n\nSincerely,\nRitambra Prakash (ACP/CB)\nFor Deputy Commissioner Of Police\nCybercrime Cell / Computer Centre\nPolice Headquarters\n\nCopy to:\nI. Section Officer (UTS-II), GOI/MHA, New Delhi.\n2. So/Ps To CP/Delhi.\n3. Inspr./Cr/Estt. And Intelligence Bureau /PHQ\n4. I/C Computer Centre/PHQ\n5. Acs-R, Vii And Computer Cell/CB\n------------------------------------------------------------------------\n\nStay safe y'all ;)\n",
    "flair": "Crime",
    "score": 1501,
    "num_comments": 500,
    "created_utc": 1711693218.0,
    "convurl": "https://i.redd.it/5kfbdstqu7rc1.jpeg",
    "comments": [
        "Interesting, but they got the wrong IB logo.",
        "Hahahahhahahaah.... Dude. My dad got this mail today. We were all freaking out in the morning. Later we checked a Linkedin post where someone had posted about this scam. Ghosh!\nAlso are u a Rediffmail user? Because it is mostly targeting Rediff users only.",
        "https://preview.redd.it/17fk82nmv8rc1.png?width=860&format=png&auto=webp&s=a9afdcb45c62c05a372e45be4c64172634dee0bf\n\nlol they put stamps at every place empty they could find",
        "Scam",
        "\"Top Secret\" is a dead giveaway. 😂",
        "Wow he personally thought to inform you, yet had to get it sealed and signed by so many people.",
        "They put all the stamps🤣🤣🤣",
        "its also iso certified xD",
        "PM ka sign nahi hai, must be fake.\nFor such an important notice, they need the signatures and seals of the PM, HM, President and at least 2/3rd chief ministers 😜",
        "Omg it's top secret and certified! Why'd you share it!",
        "but watch child pornography inside the house is not a crime as held by the madras high court judge right 😂...",
        "It's missing a few important logos like Pepsi, coke etc.",
        "Tu toh lamba jayega beta 😂",
        "Write back saying 3 important seals are missing in the letter and that you will file case against him for sending half assed letter.",
        "Mereko dhuk dhuk horela hai",
        "Don't forget both BJP and Congress logos for double legitimacy.",
        "Scam. no executive will reach you privately on paper!",
        "Vimal Pan Masala ka logo reh gya bass",
        "agency kafi mil jhul ke kam kar rhi hai",
        "I thought it was pornography with people of legal age acting in it. But it is really unfortunate if a court upholds child pornography.",
        "The dead give away is the \"Top secret\" stamp.",
        "Sharing, uploading, promoting Child pornography is wrong, but not seeing it inside the house alone as per the court. I honestly don't know how to react to it.",
        "Yes, that’s really fucked up.",
        "Bro I actually worked with the Commissioners office, this fake as hell. No one signs so shitty",
        "One question , did you use your email on any un popular dating site or porn site?",
        "I'm dead 🤣🤣",
        "Han to kitne me matter settle hua? 🤒",
        "Okay but what's the scam? As in when and how are they going to ask for or get money from you? \n\nAny chance it's a prank by someone you know?",
        "This letter looks like the News screen with hundreds of ads",
        "How many seals you need so that it looks authentic? Yes :D",
        "Lol even my dad received this email.",
        "Looks legit. Scam hota to 6 stamps aur hote /s",
        "LMAO they're TRYING to make it as fake as possible",
        "One thousand two hundred and fifty five million dollars..",
        "Forward it to cyber security cell. \nCheckmate",
        "Spelling error in the second line \"Squard\" for Squad is a dead giveaway",
        "Top Secret got me",
        "https://preview.redd.it/x0ukbir7l9rc1.jpeg?width=702&format=pjpg&auto=webp&s=14e497843b39a92752e6e7f9dbd3f148a255c44b",
        "“Especially when victims are women and minors” bc scammers be hum mardo k sath biased ho rahe h 😕",
        "RIP 🪦",
        "Good Art work 👌",
        "bery big meet up saar",
        "Well, there is a stamp for \"Top Secret\". 😂😂",
        "There's still space left , could've easily added 48 more",
        "Top secret lmao",
        "More official stamps required",
        "Also “I reached out to you personally”",
        "Now you will get another for sharing a document marked top secret on public platform.",
        "Could you share the email id from where you received it?",
        "Congrats Bhai 🎉, party kab",
        "IP estate ki jagah J P estate. Likha h",
        "Ek FIR kro and mail par reply back kar do",
        "Itne stamp lagaye hai ke padhu kaha se wahi nahi pata lmao 💀",
        "Top Secret 😂",
        "It's fake it does not have the Gandhi ji swatch Bharat glasses , the g20 stamp and Modiji picture.",
        "Wow, that’s a lot of stamps and signatures. It’s a pretty good fake. you should just ignore it.",
        " \" I decided to let you know \" ......ah ha Kindness , bancho!",
        "Its called pmo office stamp",
        "Spelling of SQUAD in second line is incorrect",
        "https://preview.redd.it/siki0hx0r9rc1.jpeg?width=750&format=pjpg&auto=webp&s=5504bbc8ff3fbcf728b5b4c254ac541dcdfe1342\n\nReply with this photo",
        "Op be like \"DON ka intezar toh 11 mulkon ki police kar rahi hai! Lekin Don ko pakadna mushkil hi nahin, namumkin ha\"",
        "The amount of seals and emblems are scary",
        "- CYBER SQUARD -",
        "Tumhe pe official secrets act lagega. \n\nTop secret letter ko public kar diyaa.😂😂😂",
        "First giveaway is obviously the missing photo of Modi .",
        "OP, please tell me your plan is to play along and string them and create a series of threads here where you update us on what’s happening.",
        "#SQUARD",
        "https://preview.redd.it/5lru89lur9rc1.jpeg?width=840&format=pjpg&auto=webp&s=d7922f1e83d87e5213b3cea063f21c5ffa9723b7",
        "Saare jahan ki police dhundh rhi Bhai ko",
        "Thought legitimate for the first part but the last part and top secret 😂. Btw OP you should complain about this as cyber crime which I think they have an online portal. Many will fall for this.",
        "UNESCO declares this as the best notice in the world. \n\nSource: Whatsapp",
        "Missing president signature and seal",
        "They really went hard on this one.",
        "As a law student I'm impressed with this person's drafting skills.",
        "Indian Cyber SQUARD..😀",
        "Bhai top secret tha post kyo kar diya? 😂",
        "You're gone man.",
        "Scammers are upping their game i see.",
        "Ask them on mail address the CIA stamp also then it will look authenticated",
        "https://preview.redd.it/fbyyx0u3u9rc1.png?width=1280&format=pjpg&auto=webp&s=5f1b0e350b6d9246c279448c793604d0e5201968",
        "Veg or Nonveg ka logo toh hai hi nahi..pataa kaise chalega haath lagaaye ya nahi.",
        "Stop surfing scammy websites man this is something that they've backlinked your IP to. Atleast try not to expose your IP when you are surfing scammy websites.",
        "Top secret? Lmao!!!",
        "Send mi 69k wtsup nw\n\n\n/s",
        "Classic scam",
        "Dude it's TOP SECRET. Don't disclose.",
        "Fda certified likjna bhool gaye",
        "That Top Secret seal & I can't stop laughing 😆",
        "lol\n\ndid you tell 'em to stuff it up their xxx \\0",
        "You read that to know it's fake or not?",
        "Bhai CIA aur NIA ka seal bhi dey deta.",
        "No grammer mistake. Pretty nice job.\nA very good percentage will defo fall for this.\nRedditors: Please don't give them ideas on how to perfect this even more!",
        "No Modiji face... Not legit",
        "Needed more logos. What kind of amateur organization is this? /s",
        "Bada wala Modi ka photo nai hai",
        "Bhai apna Don hai. 7 agencies peeche padi hai 😂",
        "Modiji's photo is missing. Must be fake.",
        "It looks like some Cannes film festival award logo",
        "Didn't you guys see the Indian Cyber SQUARD in the second line? With these many typos, it seems totally legit.",
        "Lol Top Secret 🤣",
        "Someone in Kerala unalived himself when this popped up on his screen",
        "Delete this law is a myth in this nation",
        "School ke aakhri din ki yaad aa gayi \n\nAur koi baki nahi tha kya sign karne ko?",
        "Its missing the \"Parental Advisory: Explicit content\" sticker.....",
        "IB and RAW. wow!!\n\ni wish the guy knew the difference between the two.",
        "Had to... It was from Office of the commissioner of police Cyber Cell Wing... 😂😂",
        "First thing first.. email id of sender?",
        "Bro🤣🤣🤣",
        "These scams seem to be on an exponential rise. The cyber cell has got its work cut out. The scamsters can face so many charges at once.",
        "Two more seals and it would’ve looked real.",
        "Modi ji ki photo kaha hai isme?",
        "All these stylish signs is where I lost it….there is no style in Govt",
        "2/3rd chief minister? Got it.\n\n*grabs chainsaw*",
        "PMO ka stamp nai hai ,fake hai",
        "But how will you contact scanmers lol. All these money wasted!!",
        "Forensic disk recovery ka kya lena dena spying se lol.",
        "this is scam as shit. before even reading the content of the letter the logos are spammed as shit with irregular spacing and much of the text description is an explanation rather than a notice.",
        "This is how insecurity looks like 😂😂",
        "“Top secret” at the bottom right takes the cake",
        "All the wordings are on par, definitely la(w)yers are consulted.",
        "This is the best reply.",
        "Where's the seal of POTUS? They clearly forgot or ran out of space....send it back for corrections",
        "This comes under which Yojana?",
        "A lot of logos\nText is description than a statement \nImportant keywords are in all caps to scare you \nLot of ink signatures on digital pdf\nIrregular spacing between content\nCheap ass grammar and punctuations",
        "Kbc logo is important bro. 🤣",
        "Tapan Deka amar rahe.",
        "You know it's fake because it doesn't have enough stamps. If it has at least 15-20 more, it'd be legit! ^/s",
        "Bhai Top Secret of reddit pe post kyu kar Raha hai.",
        "The top secret stamp is what gave it away",
        "Government seals that are legible and aligned? Fake!",
        "Nah, This is from data leaks/ Data selling by scummy companies.",
        "Classic scare tactic scam. Did you also receive it from indiapoli-admin\\[.\\]com ? If not, would you be willing to share a copy email for our analysis.\n\nP.S. I am a threat researchers who specializes in underground cybercrime communities. I'd be happy to get my hands on it and see if leads me to anywhere. Lemme know!",
        "Font, logos and stamps give it away.",
        "This reminded me of the plaster that was put on my fractured hand when I was a kid and all my classmates wrote all kinds of crap over it",
        "Scam",
        "I miss smiling Modi and his pet peacock in that doc. It's a scam.",
        "Certified gold and rated platinum",
        "Lol that \"Top secret\" stamp",
        "Hol up, Is that the USA insignia 💀",
        "Top secret 💀",
        "dunno looks fake to me",
        "“Top secret” but sent it via email 🤣",
        "Trust me, If the officials get a glimpse that you hold any of those content, you'll be in jail now. They wouldn't be sending notice lol.",
        "Scam. CBI busy raiding opposition and those who speak I'll of modixi's glorious rule",
        "Dude y'all can say this is scam but at first we all will be trified.If this comes up first then you will be the one to become a victim to this scam",
        "SquaRd 😂😂",
        "BC Pakistan ka ISI ka stamp bhi maar dete ....FBI, CBI...kuchh mat chhodo 😄",
        "https://preview.redd.it/cabndpkqaarc1.jpeg?width=1080&format=pjpg&auto=webp&s=aaa0e4afc00a29d9d427bd3247adc010bab2deec",
        "Police doesn't send mail, they immediately call and ask you to report at Police station hahaha.",
        "Mere paas v aya thha yeh...it looked so damn authentic , I had to rush to the police station to show it.",
        "https://preview.redd.it/uv5bcm62barc1.png?width=1080&format=pjpg&auto=webp&s=bb23dd7d789e3cbbba12200615b3f201ed3ccd68",
        "Around 6th Paragraph, \"For your Discretion sake\" is where I was deffo Sure it's a fake lol. \n\nToo many emblems, the Watermark on the print doesn't match with any of the displayed logo and I am sure if I look up names and signs, they would be either misspelt or non existent.",
        "https://preview.redd.it/119f6wi9barc1.png?width=888&format=png&auto=webp&s=60501b1abd5bcf9c5d365b2a989aad6e688da217",
        "The Interpol is a joke in this country.",
        "Not enough stamps.",
        "Faced a similiar threat while accessing a torrent. A pop-up redirected to similar kind of wesbite where they sent multiple Alerts stating life imprisonment/ 10L bail.",
        "Isko puch Article 21 nahi pata kya tere ko lawde ka baal",
        "It seems the scammers accommodated all the logos and stamps they could think of. Reminds me of my friend who never watches pron online and is afraid of using torrent.",
        "what were they going to gain with this anyway ? Say you replied to the mail and so on , what next they would have asked you to pay a fine as penalty ? Pathetic",
        "CYBER SQUARD LOL",
        "Missing Modi photo. So it’s a fake.",
        "The letter carries the stamp and signature of all the agencies in India ,only modijis stamp is missing due to non availability of prime space.",
        "https://preview.redd.it/fqt0swq5earc1.jpeg?width=1179&format=pjpg&auto=webp&s=e5227f2de6c26fdf062cda4f443df95553f49644\n\nHigh five bro ✋Posting my copy!",
        "Plural hai",
        "I see more than 3 signatures, it must be legit.",
        "Our office is open 24/7 is another red flag🤣",
        "You have now compromised a Top Secret Cyber Mission",
        "Government notice period itne stamp nhi hote. Ek stamp hi kaafi hai",
        "Relax and party, nothing will happen... I got 4-5 notices till now.",
        "US president ka seal missing, so it's fake...\n\nReply to this mail like this...",
        "So much pushing hard to make it certified genuine. Designer overdid.",
        "Oh what am I seeing!!\n\n\nDude I am the officer who send you this.\n\nJor jor se bol kar scheme mat bata sabko.",
        "Stamp to lagta hai sari duniya ki agency ke laga diye hai",
        "Lol they put every stamp vector they found online in it😂",
        "Scammer: How many stamps should I put on the letter?\nScammer boss: Yes\n😂😆",
        "Dude India Cyber 'SQUARD'... end of story. 😂",
        "CERTIFIED !!!!!!!",
        "Your life is over.  \nYour baccho ki life is over.\n\nBhai shaap 17 pushte jail mien gaana gayengi..  \nपोषम पा भई पोषम पा,  \nसौ रूपए की घडी चुराई,  \nअब तो जेल में जाना पडेगा,  \nजेल की रोटी खानी पड़ेगी,  \nजेल का पानी पीना पड़ेगा,  \nअब तो जेल में जाना पड़ेगा.",
        "Farewell pe meri tshirt bilkul aisi dikhri thi",
        "Save as \"PDF file\"",
        "Needs a few more stamps and seals .. I doubt this letter is legit.",
        "Cyber squard",
        "The random punctuation makes it look very unprofessional and fake",
        "Top secret? 😂",
        " It is quite unfortunate to turn your official or private Internet to a juvenile pornographic movie cyber.  what",
        "One more page of stamps attached would make it look legit",
        "Logos cannot overlap, small mistake gave it away",
        "They still missed lot of spaces to put logos and text or singature.",
        "Couple of changes and it can fly as a genuine letter. Dimag lagaya hai isme scammers ne",
        "Kya kr rha hai bhai top secret ko public kr diya …ab tho ek case or lagega tere pe😤",
        "More stamps than written content.",
        "Khatam bhai tumab",
        "will be going to the court together ig lmao XD",
        "INDIAN CYBER SQUARD",
        "Logo placement ka tareeka thoda kezual hai",
        "“Is sajjan ko kya dikkat hai bhai?” \n\nT : “Does OP has any issues?”",
        "True! This led to sus.",
        "Bhai eisa kya kar diya tumne kahi ki Lanka Fook di kya",
        "Wow we should crush these fake scammers",
        "Just curious what is the sender/cc email ids?",
        "Lmao….that Top Secret seal 🤣💀",
        "It’s clearly fake since modijii picture is not there anywhere.",
        "Intelligence Bureau ka mandate ye nhi hai :(",
        "Chatgpt ka pura istemaal koi inse seekhiye",
        "That’s what gave it away as a scam. No way the narcissistic bastard’s photo isn’t emblazoned on every government documents",
        "Fake",
        "With all those stamps it sure is real.",
        "bhai DTC ka bhi logo laga hi deta sath me",
        "OMG! Look at the amount of seal in that document. Anyways they are creating a scam document why are they not investing in grammar and some actual law clauses.",
        "Also since when is Grooming a crime?",
        "Contact kar aur 10--20 hajar mai maafi maang lengi CBI Wale😂😂😂\nAur mujhe bhi 5k bhej nahi to comment box Mai sabko bata dunga ki tu porn dekhta hai😂😂 aur tereko porn sites se reverse track kar mail kar Diya 😂🤣🤣🤣",
        "Cyber Squard",
        "That top secret stamp is enough to expose this scam",
        "Indian Cyber Squard 💀",
        "https://preview.redd.it/2njve0zytarc1.png?width=1169&format=png&auto=webp&s=9b296c4b574e60a72a6b1afceb201951529c903e\n\nBuddy go to jail now",
        "oh Bhai seriously underrated comment hai ye",
        "Ah yes, Indian Cyber Squard. My favourite squard in the history of squards.",
        "Designer did overtime job to make it look genuine.",
        "This is so well made that a lot of people could fall for it.",
        "They made it look a little too genuine.",
        "Too much seals and stamps is a give away",
        "Pehle CBI then RAW...🤣",
        "Every government organisation is after you.",
        "Squad ka spelling aur grammar ka use dekh ke hi ignore kar Dena chaiye tha. Scam hain bhai!!!",
        " bhai en chijo kai chkkr sai investigation bheth thii toh mai 5 saal phele hee andr hota   \nchill yr this is india yha sarkar piracy ka kuch nhi kr pa rhi en chijo ka kha sai karegi",
        "there is used to be fake webpage too about this in which they asked you to pay some money.",
        "Bhai etni sari mohor to kisi ki citizenship ke liye bhi nahi lagti",
        "notty ho rha kai ?",
        "How can a court order be alleged. It either is against you or not",
        "'I decided to reach you personally'\n---\n\nNo one reaches personally. This is a scam.",
        "Not BJP, that would actually give it legitimacy.",
        "Lol I mean cybercrime doing something is a dead giveaway. Lol.",
        "Why Madhya Pradesh Police logo? Letter to DP ne bheja hai",
        "The technology of information 🤣",
        "Grooming can also refer to a manipulative behavior used by sexual abusers to gain access to a victim.",
        "Looks a lot like the back of my laptop, barely any real estate left for stickers.",
        "Exactly man... So serious it must be... It's Top secret document sent over gmail🤣🤣🤣",
        "The amount of money spent on making those stamps will need at least 10 baits to recover the cost followed by the net profit... Failed planning... Should be IIT pass outs....",
        "And,\n copy to- so many people.",
        "Madhya Pradesh Police logo in top left corner on a letter by \"Delhi Police\".",
        "It’s a scam max thing. Report these guys , get them arrested and locked away .",
        "Additional 14 years for breaking secrecy.",
        "What’s their end game? Do they expect you to go to that address or something? Typically scammers want you to call a number or something, but then this “letter” doesn’t give that.",
        "Right from the get go they messed it up by stating \"Central Bureau of Investigation, Department of Research and Analysis wing.\" These are two different branches, the RAW deals with foreign intelligence and counter terrorism while the CBI is tasked with dealing with domestic crimes. After that the next line that ends with \"...juvenile pornographic movie cyber.\" is just grammatically incorrect and is more jarring when compared to the other lines which seem to flow grammatically and appear to have been just copy pasted from descriptions of the various departments from other sites.",
        "Hasn't asked for a gift card in the amount of 500 dollars yet?",
        "How Fake do you want it to be?\nYES.",
        "Simply Modi Ji ka photo laga dete.... Itna top secret likhne ka kya zarurat tha....",
        "Bas ab koi yeh mat bol dena ki yeh asli hai....",
        "No date?? Ye to chitting hai bc! \nIf I were single, I would've dated this doc. ;)",
        "If there wasn't top secret, I would have believed it.",
        "Make in India lion too",
        "they could have added few more logos.",
        "Yeah, of cops knew you were a pedophile, they'd just come and arrest you instead of asking for \"justification\".",
        "Wow.... you are such an important person and this matter is so important that the Director of IB himself signed off on your crime notice!!",
        "MF used all the stamps saved in his Pirated pdf maker",
        "Indian cyber SQUARD. You should be scared.",
        "We all know the government won't send any mails for legal actions. It's always done by posts. Any sensible adult would recognize this as a scam immediately.",
        "Should use this for a “Spot what is wrong” game",
        "If only it had 1 more stamp it would have been real.",
        "Bhai ke paas jitne stamps the maar diye",
        "Also, there's way too many stamps - it looks like a children's scrapbook",
        "Doesn’t have enough stamps, so obviously fake.",
        "Just reply back and say \" tohri myee ke Cho*o",
        "OP what's the mail id you got this from?",
        "\"Top Secret\" fucking sent me",
        "Stamps kam pad gye! CIA, FBI, MI6, ANONYMOUS sabka daldete to believable lgts",
        "I almost thought it was an IPL jersey",
        "I got something like this but not Indian it is of  European one , as am living in Europe. lol ..",
        "11 mulkon ki police ne milkar ek letter bheja hai....",
        "Scammer employee: How many stamps and signs do you want?\n\nScammer boss: YES!",
        "75 years aazaadi waala watermark hota to I would have believed it",
        "i dont understand one thing if ur punishing me for 'visiting' juvinile pornographic sites , why dont u just ban them or take them dowwn cath them as sellers na , why me",
        "Amount of stamps and signature makes it look fake lol",
        "i dont think ive seen a legal document ever with so many signs and stamps lol tht is more suspicious than anything else here",
        "maybe its modi ji himself",
        "modi ji in his office-\n\nhttps://preview.redd.it/dbtnxsiydbrc1.png?width=470&format=png&auto=webp&s=e0f0e16124d2a6e6f8f9d0f78f96d2cbb39355f0",
        "Cyber Squuard. Lol",
        "It looks so real on first sight but when you pay even slight attention everything starts to break down.\n\n* Just stamps and signatures all over the place,some are right in the middle of the body of the letter. No reasonable human being stamps like that\n*  At the bottom some dude named Akhand also autographs this work, who is Akhand? What is his designation? Nobody knows. There isn't even a space for him to sign.\n* Tapan Deka's signature looks like somebody's ECG reading with letters sprinkled into it. None of those letters are found in the word \"Tapan Deka\"\n* Again, Ritambara Prakash's signature does not translate to Ritambara Prakash from any angle.\n* \"Certified\" stamp. Certified for what? Is this letter Halal certified? Or is it about the kind of paper they're using? It's just certified.\n* Apparently a top secret document (ps these dudes can't decide on whether its confidential or top secret, in military/police circles these words mean two separate things) and yet they decided to literally share it with the accused. \n* Cyber Pornography: this one's the real bait. Most people aren't kid diddlers so they'd know this is fake but they threw in a \"cyber pornography\" charge too because most people do watch porn. However watching/downloading porn is completely legal in India. \n* In the middle of the letter they go into a monologue about what sort of stuff the government does to combat this problem, which would fit in an ad or an interview, but not when you're talking to an accused.\n*  Asks you to respond immediately,expects you to do it on gmail.",
        "Top Secret 😂",
        "Cyber SQARD, lol",
        "Bhai director ne personally mail Kiya hai kaju katli toh lekar hi jana",
        "Thode colors kam the….bilkul asli lagte !",
        "There is more certifications on this than the medals on a north korean general.",
        "Is this from #Muth Mantri Arvind Bhaiya?",
        "Sounds fun. Can you send the mail address?",
        "lmao the number of signs and stamps",
        "Double engine ki sarkar",
        "Indian scamming industry is going out of control everyday . Now with more and more domestic cases. As if bringing shame to the nation by the industrial scale scamming of westerners wasn't enough  . imagine the number of terrified naive people who will commit suicide upon recieving such mails",
        "Common man. It was supposed to be top secret 😂",
        "I had one popping up on laptop screen, from ministry of information or some shit, demanding 32000 rupees as they tracked me watching pedophile p*rn. They uses a faint sound of hooter as bgm.",
        "I work in cybersecurity, it’s fake and I didn’t even read it",
        "OP is a scammer and he is just getting to know what are the obvious give aways that it's a scam.",
        "The spelling of Squard was the only thing that made me laugh.... Lol",
        "What the hell is madhya pradesh police emblem doing at the top left corner lol",
        "Top secret documents don't have Top secret stamp on them",
        "Post office stamp is missing hence it seems fake to me.",
        "top secret,  \nalso signed by atleast thousand people.",
        "Stampmaxxing",
        "he put in so much effort to make it sound legitimate that he gave it away",
        "Is letter k 50 Rs kaato overacting k",
        "Too few stamps, the letter doesn't have a gigantic government of India stamp, Interpol stamp, stamp for each  country in the European Union.",
        "Scammers emailed me from a spoof email looking like mine with something similar. If that happens guys Noone has hacked you email, go check the sent section there's nothing, so stay cautious out there.",
        "Scammers emailed me from a spoof email looking like mine with something similar. If that happens guys Noone has hacked you email, go check the sent section there's nothing, so stay cautious out there.",
        "Scammers emailed me from a spoof email looking like mine with something similar.",
        "If that happens guys Noone has hacked you email, go check the sent section there's nothing, so stay cautious out there.",
        "\"Cyber Squard\" in the first few lines should have been your first red flag 🚩 on the authenticity of this \"court order\" lol",
        "So many scams happening these days.",
        "Squared...  Privately readhing you.  Soo many stamps and signature.  Intented to scare you to partwith your money.",
        "Grammatical mistake on the post of the person on the right hand side. It would be \"Cyber Crime Offences\", not \"Offenses\". \n\nGG top secret fake.",
        "Very less signatures and seals. If there were a few more, I'd probably say this is legit",
        "*grabs several chainsaws*\n\nROADTRIP!!",
        "“ Indian Cyber *Squard* ”😭",
        "Squidward",
        "Some more stamps would make it official",
        "With all these stamps and colors seems the graduation degree of a clown 🤡",
        "Overcompensated with all kind of stamps",
        "Overcompensated with all kind of stamps",
        "Overcompensated with all kind of stamps",
        "Is nobody going to look at Tapan Deka’s signature? No way what he has signed reads Tapan Deka, whatsoever.",
        "This. Itna saara stamp lagake main scam content ka jagah hi ni bach rha. They need to do better.",
        "Is nobody going to look at Tapan Deka’s signature? No way what he has signed reads Tapan Deka, whatsoever.",
        "I’d call them. And string them along for a week. \n\nNahi. Please gareeb aadami hun. Meri biwi chhor degi…..chote chote bachche hain…",
        "Testicular torsion",
        "What have it away? That they sent you a letter without breaking down your door?",
        "Can I ask? What is the point of writing half a sentence in one language (Hindi?) and the rest of it in English. I see this a lot with Indians and Filipinos, and basically nobody else. As a native Norwegian speaker and a fluent English speaker, the idea of writing half a sentence in Norwegian and finishing the paragraph in English strikes me as very odd.\n\nI'm not criticising, just wondering why people do it. Genuinely interested.",
        "Thanks. Almost fell for it.",
        "\"Graphics design is my passion\" energy",
        "My social security number is expired since last week. Bummer.",
        "We actually converse like this, that's how deeply embedded English is in today's India (urban India at least, which is mostly what you'll find on Reddit).",
        "I am fine in jail,outside world is more dangerous",
        "Whole Indian government franchises that document.",
        "Ah, I had no idea. That's really interesting, I thought it was an online thing. Do urban Indian people tend to speak English with interjections in Hindi for emphasis? Or some other reason? I'm very curious about this, haha, thanks for humouring me!",
        "How many logos and stamps do you want ?\n\nScammer:- YES",
        "Top secret lol",
        "It's like kid got hold of photoshop for the first time and pasted all the official seals he could find on Google image and posted on this letter.",
        "More 2-3 logos should have been put",
        "You think ?",
        "Fake hai re pagle...\nUae ka immigration wala bhi seal hai",
        "Scam",
        "Jaysus. Are those official stamps or just cumstains ?",
        "That's actually true.",
        "Looks like a slam book kids have in school",
        "Reply to them saying that you work for national informatics center for CBI, have found their fingerprints on the letter and envelope and will be matching it with the aadhar Database and initiating action against them. But you are reaching out in advance to see if they want to pay a fine to avoid any action.",
        "🤫 Top Secret Scam!",
        "nah, need more chops",
        "There are so many notary stamps",
        "gets new notice for sharing top secret ba dum tss",
        "Top secret stamp 🤣",
        "Mere taraf se ek gandi gaali reply me de Dena.\nAur subject daalde \"me gira hua Banda jama nuch baliye\"",
        "Within our territory 😂 no-one uses that language, it would be replaced by \"within the republic of India\"",
        "Nah..you good. It needs more colorful stamps",
        "lol but teri fatt kyu gayi ;)",
        "it just lacks Forklift Certified.",
        "Less stamps. Need more.",
        "I think they will ask for payment once you reply and ask what can be done",
        "This one looks genuinely fake!",
        "Where is G20 and Azadi Ka Amritotsav logo",
        "I seem to remember the spelling of squad",
        "https://preview.redd.it/ap82vckhvdrc1.png?width=533&format=pjpg&auto=webp&s=99105fa5cb0286967c53d96a68543130781f70c1",
        "Yes this is very common unfortunately. I haven't come across anyone in years who speaks pure Hindi without using English words in urban cities. Though pure English is common but sometimes we add little hindi to it",
        "Damn that \"TOP SECRET\" would work in the 80s lol",
        "Not a single phone number given here",
        "The grammar is atrocious. And spelling mistakes.... Uff. The number of stamps and seals to make it look authentic, these guys have gone overboard 😂. Also signature of Tapan Deka is something else 😜",
        "Tf is “INDIAN CYBER SQUARD”",
        "I dont understand when these scammers would learn not to use capital letters in the middle of the sentence. Its a dead giveaway guys , do better.",
        "It's not halal certified hence can't be accepted.",
        "Best jail services, govt approves",
        "Grooming. Wtf",
        "very convincing. They have done lot of designing work.",
        "Fakest scam ever. They used logos from some wholesale",
        "Lol... What do they mean by \"for discretion sake\"!!!! Obviously fake. But yeah thank you sharing because such scams are rampant. This and the \"a package was being sent to China from you via FedEx and we found drugs in it\".",
        "Why is there an airforce logo🤣",
        "\"Top Secret\" stamp killed me",
        "So how many stamps- \"Yes\"",
        "And Modiji's photo",
        "Signing off with \"Respond Immediately\" 🤣🤣",
        "Bhaichara On Top🫂",
        "It's a scam!\n\n\n* So many logos! MP police, Delhi police, CBI, IB, RAW! Top secret, Certified. Any one left!? 🤣\n* CBI is the national nodal agency for INTERPOL in India.\n* Sec 15 of POCSO would be appropriate not the sec 14.\n* Technology of Information? 🤣 Suggests, Possess...? WTF is going on with this whole paragraph!\n* Discretion sake? 🙃\n* Sanctions will be IMPOSE?\n* Is pedophilia a legal term?",
        "It's not halaal certified therefore it's fake.",
        "As common man we may not know all these certified signatory etc.. What's important for you to check email address from where it was sent. Also, I don't think cyber cell will ask for reaching anyone privately.",
        "Reply them \"I dont know who you are, I dont know where you are. But, I will find you, and make you eat your words🤣\".",
        "That PNG stamp",
        "Designer was High on logos lol ..it's a scam!!! Got same mail a month ago.",
        "Has 10 stamps and 3 signatures... Must be genuine bro... /S",
        "There is no PM Modi's photograph. Hence it is SUS",
        "It's a dead giveaway lmao- why would the government be soooo concerned about such trivial and insignificant matters like child pornography and pedophilia.    /s",
        "INDIAN CYBER 'SQUARD' 😂😂😂",
        "What is the guy who is posting this is a scammer and trying to find out all the issues with the mail before sending it to others 💀",
        "Dude, you unlocked all the stars. Can you see flying chopper in your area?",
        "+1 to what the other person said.\n\nI think it's supposed to he more like 70% Hindi and 30% English. For example, last night me and my friend were talking about relationships, this is what the conversation sounded like:\n\nMe: Are par (but) I don't understand man, agar (if) tu (you) khush (happy) he (even) nahi (not) hai mere (me) sath (with), hum (we) compatible he (even) nahi (not) hai, toh (then) why the fuck are we still with each other?\n\nFriend: Han (yes), aur (and) bhai (brother) ye (this) abusive hai (is) pura (totally). Why do you want a partner? Sukoon (peace) ke liye (for), agar (if) sukoon (peace) he (even) nahi (not) hai toh (then) it's pointless\n\nRead without the bracketed words first. Then read again with the meaning in the bracketed words. We more or less speak like this. It's because the language has been so westernised due to the influence of English. Also, I believe Hinglish (Hindi + English) is much easier to speak than pure Hindi, which can be very complicated and has faded from popular culture over time.\n\nIt also doesn't help that we had to adapt to the west, especially for our education as most textbooks post-school level are in English, as they are written by authors from the west. Due to this, a major chunk of the urban Indian students went to English-medium schools. \n\nAlso, there has always been a huge emphasis on speaking English here, so I think a lot of us just picked up stuff. I have a friend who went to a Hindi medium school for his entire schooling and speaks perfectly fluent English which he picked up from movies, video games and books.\n\nAll in all, yes, it's really how we speak here, and it's percolating down to rural India as well.",
        "> It is quite unfortunate to turn your official or private Internet to a juvenile pornographic movie cyber.\n\nSo sad!",
        "As someone from the United States, I've developed a keen sense for identifying scams, including those that originate from India. My experience isn't based on residing in India but rather on dealing with similar scams within the US, where I actively engage with and disrupt such fraudulent activities. This particular email raised red flags for me due to its writing style, leading me to conclude it's a scam. It's important to clarify that my intention isn't to convey this message with negativity. Unfortunately, it's a reality that the US is a significant target for scam operations.",
        "Now new form of fraud",
        "As long as it’s not Indian cyber squad, you should be fine.\n\nIn case you didn’t get it, the letter says they are Indian cyber squard. Lol",
        "😂😂",
        "Obviously scam but old people and people not having technical knowledge will fall victim to it",
        "This lacks Certification from President.",
        "Looks like they weren't sure as to what would be more scary..... Intelligence Bureau, Central Bureau of Investigation, Madhya Pradesh Police or Delhi Police. Finally decided to use all four😂",
        "Scammer thought more the no. Of stamps more is the seriousness of crime😂",
        "Post the sender email address too bro, community will spam them to d**th",
        "Also needs isi and agmark logo",
        "What is “CYBER SQUARD”?",
        "Sir matter toh winter vegetable hai, taaza baingan le lo 80 ka",
        "it should have minimum 100 stamps to make it look authenticate.",
        "Scammer 1: how many stamps do you want on this?\n\nScammer 2: Yes",
        "Indian Cyber Squard 🤣",
        "Top Secret and then proceeds to send an email.",
        "\"Indian Cyber Squard\"",
        "It’s a scam for sure, but you should try and stay away from obscure/unpopular porn sites. These are the sites where the highest number of scammers plant seeds of phishing, email tracking, viruses, and other malware.",
        "Print and send post this to your friend or foe on 1 April.",
        "India does not use the “Top Secret” vocabulary. \n“Highly confidential” is the official terminology.",
        "Certificate with so many stamps lol",
        "Do you think it's because of the numerous regional languages and dialects in India? If most people speak English to some degree, but don't necessarily share a regional language.",
        "tOp sEcReAT",
        "This prank is Godfather of all pranks.It would be a winner on the 2024 Scammer Awards. They probably spent 100 hours and millions of rupees to extract 50 rupees in the best case scenario or worst case have it thrown into the garbage.",
        ">Do you think it's because of the numerous regional languages and dialects in India?\n\nIn the British time, Hindi replaced many regional languages in north India. Just the state of Bihar had 8 regional languages while today mostly Hindi and some dialects of it are spoken. South India has preserved their languages well. When English is spoken in urban India that's because our higher education is all in English.",
        "Tere peeche to 11 mulko ki police hi lag gayi ... (Count the stamps bro)",
        "Help me find what are other logos in the letter two of them being.       \n1) income tax.            \n2) Army",
        "Bola tha vai mat jaao galat raste pe😞😔.",
        "Fake hai bhai.",
        "bro got all kind of government agency stamps he could find",
        "How many stamps do you want? Yes",
        "But, is it military grade tho?",
        "The biggest give away of these scams is their bad english even on scam calls. Chatgpt use kar le to draft such scams to look less scammy.",
        "I won’t believe this unless it has more stamps ..",
        "squard",
        "Bro frame karwa ke apne ghar ya office main kagwa lo, log ek baar ko dekhenge kya degree hai 🤣🤣🤣",
        "The offences discussed in this email are serious and we all know how bad is Child pronography and it should be taken seriously. I too received the same email. \n\nBut I know I have not committed any offence, But we don't know how our systems and IPs are hacked and misused. In such a scam or misunderstanding if one is wrongly named, its very serious matter.",
        "I just got this today lol. Google searched and found this. 😂",
        "aye we brothers now :)\n\nhttps://preview.redd.it/nm6ivhisb06d1.png?width=2481&format=png&auto=webp&s=8bdbb23805ec1d6b8ff49aa1a0306c5704bb0228",
        "they said to reply to the email within 24 hours, I got one myself lol",
        "I got one today from [PoliceDirectorGeneral9@itechnewscon.email](mailto:PoliceDirectorGeneral9@itechnewscon.email) lol",
        "I got this email today - I don’t even live in India do you? 😂 my email also included LOTS of emojis ⚖️⚖️ ⚖️",
        "Lol XD",
        "Got the same mail, even the name of acp is legible and it mentions high tech laboratory😂😂",
        "You forgot, INTERPOL's \"worst-of-list\"",
        "recieved the same and actually for a moment \"G fati\"   \nReddit saved me once again from a heart attack",
        "https://timesofindia.indiatimes.com/city/kolkata/cops-issue-alert-against-fake-cybercrime-court-orders/amp_articleshow/109115670.cms",
        "I got this email today. How are they attempting to make money out of this? That bit I didn't understand.",
        "Lol i got this mail today. I screenshotted the mail, did reverse image search & landed up here thankfully 🤣",
        "received the same mail today on my official mail. only address changed, reference number is same",
        "INTERPOL, R&AW, IB only have one apparent agenda to track your nsfw activity on the internet Lmao"
    ],
    "cleaned_text": "got mail got mail week ago checked today though obviously scam im impressed new ways guys coming thought id post reddit others also know contents mail reference official court order office commissioner police cybercrime cell computer centre police headquarters mso building jp estate new delhl ref icbiphq dated official court order inform attached alleged court order internet ip traffic central bureau investigation department research analysis wing quite unfortunate turn official private internet juvenile pornographic movie cyber central bureau investigation works partnership police cybercrime special units handling complex sensitive cases cybercrime especially victims women minor children laboratories equipped stateoftheart spidercrawling digital software equipment forensic capabilities extraction deleted data hard drives mobile phones imaging hash value calculation forensic servers portable forensic tools onsite examination facility extract data latest android ios well chinese phones based extremely difficult victim consciously unconsciously visit juvenile pornographic sites without digitally captured information clarification court order made available upon receipt response within hours office operates hours days assured serious legal action taken fail respond notice within hours receipt forewarn forearm sincerely ritambra prakash acpcb deputy commissioner police cybercrime cell computer centre police headquarters copy section officer utsii goimha new delhi sops cpdelhi insprcrestt intelligence bureau phq ic computer centrephq acsr vii computer cellcb stay safe yall ",
    "cleaned_title": "got mail",
    "cleaned_selftext": "got mail week ago checked today though obviously scam im impressed new ways guys coming thought id post reddit others also know contents mail reference official court order office commissioner police cybercrime cell computer centre police headquarters mso building jp estate new delhl ref icbiphq dated official court order inform attached alleged court order internet ip traffic central bureau investigation department research analysis wing quite unfortunate turn official private internet juvenile pornographic movie cyber central bureau investigation works partnership police cybercrime special units handling complex sensitive cases cybercrime especially victims women minor children laboratories equipped stateoftheart spidercrawling digital software equipment forensic capabilities extraction deleted data hard drives mobile phones imaging hash value calculation forensic servers portable forensic tools onsite examination facility extract data latest android ios well chinese phones based extremely difficult victim consciously unconsciously visit juvenile pornographic sites without digitally captured information clarification court order made available upon receipt response within hours office operates hours days assured serious legal action taken fail respond notice within hours receipt forewarn forearm sincerely ritambra prakash acpcb deputy commissioner police cybercrime cell computer centre police headquarters copy section officer utsii goimha new delhi sops cpdelhi insprcrestt intelligence bureau phq ic computer centrephq acsr vii computer cellcb stay safe yall",
    "cleaned_comments": "interesting got wrong ib logo hahahahhahahaah dude dad got mail today freaking morning later checked linkedin post someone posted scam ghosh also u rediffmail user mostly targeting rediff users lol put stamps every place empty could find scam top secret dead giveaway wow personally thought inform yet get sealed signed many people put stamps also iso certified xd pm ka sign nahi hai must fake important notice need signatures seals pm hm president least rd chief ministers omg top secret certified whyd share watch child pornography inside house crime held madras high court judge right missing important logos like pepsi coke etc tu toh lamba jayega beta write back saying important seals missing letter file case sending half assed letter mereko dhuk dhuk horela hai dont forget bjp congress logos double legitimacy scam executive reach privately paper vimal pan masala ka logo reh gya bass agency kafi mil jhul ke kam kar rhi hai thought pornography people legal age acting really unfortunate court upholds child pornography dead give away top secret stamp sharing uploading promoting child pornography wrong seeing inside house alone per court honestly dont know react yes thats really fucked bro actually worked commissioners office fake hell one signs shitty one question use email un popular dating site porn site im dead han kitne matter settle hua okay whats scam going ask get money chance prank someone know letter looks like news screen hundreds ads many seals need looks authentic yes lol even dad received email looks legit scam hota stamps aur hote lmao theyre trying make fake possible one thousand two hundred fifty five million dollars forward cyber security cell checkmate spelling error second line squard squad dead giveaway top secret got especially victims women minors bc scammers hum mardo k sath biased ho rahe h rip good art work bery big meet saar well stamp top secret theres still space left couldve easily added top secret lmao official stamps required also reached personally get another sharing document marked top secret public platform could share email id received congrats bhai party kab ip estate ki jagah j p estate likha h ek fir kro mail par reply back kar itne stamp lagaye hai ke padhu kaha se wahi nahi pata lmao top secret fake gandhi ji swatch bharat glasses g stamp modiji picture wow thats lot stamps signatures pretty good fake ignore decided let know ah ha kindness bancho called pmo office stamp spelling squad second line incorrect reply photo op like ka intezar toh mulkon ki police kar rahi hai lekin ko pakadna mushkil hi nahin namumkin ha amount seals emblems scary cyber squard tumhe pe official secrets act lagega top secret letter ko public kar diyaa first giveaway obviously missing photo modi op please tell plan play along string create series threads update us whats happening squard saare jahan ki police dhundh rhi bhai ko thought legitimate first part last part top secret btw op complain cyber crime think online portal many fall unesco declares best notice world source whatsapp missing president signature seal really went hard one law student im impressed persons drafting skills indian cyber squard bhai top secret tha post kyo kar diya youre gone man scammers upping game see ask mail address cia stamp also look authenticated veg nonveg ka logo toh hai hi nahipataa kaise chalega haath lagaaye ya nahi stop surfing scammy websites man something theyve backlinked ip atleast try expose ip surfing scammy websites top secret lmao send mi k wtsup nw classic scam dude top secret dont disclose fda certified likjna bhool gaye top secret seal cant stop laughing lol tell em stuff xxx read know fake bhai cia aur nia ka seal bhi dey deta grammer mistake pretty nice job good percentage defo fall redditors please dont give ideas perfect even modiji face legit needed logos kind amateur organization bada wala modi ka photo nai hai bhai apna hai agencies peeche padi hai modijis photo missing must fake looks like cannes film festival award logo didnt guys see indian cyber squard second line many typos seems totally legit lol top secret someone kerala unalived popped screen delete law myth nation school ke aakhri din ki yaad aa gayi aur koi baki nahi tha kya sign karne ko missing parental advisory explicit content sticker ib raw wow wish guy knew difference two office commissioner police cyber cell wing first thing first email id sender bro scams seem exponential rise cyber cell got work cut scamsters face many charges two seals wouldve looked real modi ji ki photo kaha hai isme stylish signs lost itthere style govt rd chief minister got grabs chainsaw pmo ka stamp nai hai fake hai contact scanmers lol money wasted forensic disk recovery ka kya lena dena spying se lol scam shit even reading content letter logos spammed shit irregular spacing much text description explanation rather notice insecurity looks like top secret bottom right takes cake wordings par definitely lawyers consulted best reply wheres seal potus clearly forgot ran spacesend back corrections comes yojana lot logos text description statement important keywords caps scare lot ink signatures digital pdf irregular spacing content cheap ass grammar punctuations kbc logo important bro tapan deka amar rahe know fake doesnt enough stamps least itd legit bhai top secret reddit pe post kyu kar raha hai top secret stamp gave away government seals legible aligned fake nah data leaks data selling scummy companies classic scare tactic scam also receive indiapoliadmincom would willing share copy email analysis ps threat researchers specializes underground cybercrime communities id happy get hands see leads anywhere lem know font logos stamps give away reminded plaster put fractured hand kid classmates wrote kinds crap scam miss smiling modi pet peacock doc scam certified gold rated platinum lol top secret stamp hol usa insignia top secret dunno looks fake top secret sent via email trust officials get glimpse hold content youll jail wouldnt sending notice lol scam cbi busy raiding opposition speak ill modixis glorious rule dude yall say scam first trifiedif comes first one become victim scam squard bc pakistan ka isi ka stamp bhi maar dete fbi cbikuchh mat chhodo police doesnt send mail immediately call ask report police station hahaha mere paas v aya thha yehit looked damn authentic rush police station show around th paragraph discretion sake deffo sure fake lol many emblems watermark print doesnt match displayed logo sure look names signs would either misspelt non existent interpol joke country enough stamps faced similiar threat accessing torrent popup redirected similar kind wesbite sent multiple alerts stating life imprisonment l bail isko puch article nahi pata kya tere ko lawde ka baal seems scammers accommodated logos stamps could think reminds friend never watches pron online afraid using torrent going gain anyway say replied mail next would asked pay fine penalty pathetic cyber squard lol missing modi photo fake letter carries stamp signature agencies india modijis stamp missing due non availability prime space high five bro posting copy plural hai see signatures must legit office open another red flag compromised top secret cyber mission government notice period itne stamp nhi hote ek stamp hi kaafi hai relax party nothing happen got notices till us president ka seal missing fake reply mail like much pushing hard make certified genuine designer overdid oh seeing dude officer send jor jor se bol kar scheme mat bata sabko stamp lagta hai sari duniya ki agency ke laga diye hai lol put every stamp vector found online scammer many stamps put letter scammer boss yes dude india cyber squard end story certified life baccho ki life bhai shaap pushte jail mien gaana gayengi farewell pe meri tshirt bilkul aisi dikhri thi save pdf file needs stamps seals doubt letter legit cyber squard random punctuation makes look unprofessional fake top secret quite unfortunate turn official private internet juvenile pornographic movie cyber one page stamps attached would make look legit logos overlap small mistake gave away still missed lot spaces put logos text singature couple changes fly genuine letter dimag lagaya hai isme scammers ne kya kr rha hai bhai top secret ko public kr diya ab tho ek case lagega tere pe stamps written content khatam bhai tumab going court together ig lmao xd indian cyber squard logo placement ka tareeka thoda kezual hai sajjan ko kya dikkat hai bhai op issues true led sus bhai eisa kya kar diya tumne kahi ki lanka fook di kya wow crush fake scammers curious sendercc email ids lmaothat top secret seal clearly fake since modijii picture anywhere intelligence bureau ka mandate ye nhi hai chatgpt ka pura istemaal koi inse seekhiye thats gave away scam way narcissistic bastards photo isnt emblazoned every government documents fake stamps sure real bhai dtc ka bhi logo laga hi deta sath omg look amount seal document anyways creating scam document investing grammar actual law clauses also since grooming crime contact kar aur hajar mai maafi maang lengi cbi wale aur mujhe bhi k bhej nahi comment box mai sabko bata dunga ki tu porn dekhta hai aur tereko porn sites se reverse track kar mail kar diya cyber squard top secret stamp enough expose scam indian cyber squard buddy go jail oh bhai seriously underrated comment hai ye ah yes indian cyber squard favourite squard history squards designer overtime job make look genuine well made lot people could fall made look little genuine much seals stamps give away pehle cbi raw every government organisation squad ka spelling aur grammar ka use dekh ke hi ignore kar dena chaiye tha scam hain bhai bhai en chijo kai chkkr sai investigation bheth thii toh mai saal phele hee andr hota chill yr india yha sarkar piracy ka kuch nhi kr pa rhi en chijo ka kha sai karegi used fake webpage asked pay money bhai etni sari mohor kisi ki citizenship ke liye bhi nahi lagti notty ho rha kai court order alleged either decided reach personally one reaches personally scam bjp would actually give legitimacy lol mean cybercrime something dead giveaway lol madhya pradesh police logo letter dp ne bheja hai technology information grooming also refer manipulative behavior used sexual abusers gain access victim looks lot like back laptop barely real estate left stickers exactly man serious must top secret document sent gmail amount money spent making stamps need least baits recover cost followed net profit failed planning iit pass outs copy many people madhya pradesh police logo top left corner letter delhi police scam max thing report guys get arrested locked away additional years breaking secrecy whats end game expect go address something typically scammers want call number something letter doesnt give right get go messed stating central bureau investigation department research analysis wing two different branches raw deals foreign intelligence counter terrorism cbi tasked dealing domestic crimes next line ends juvenile pornographic movie cyber grammatically incorrect jarring compared lines seem flow grammatically appear copy pasted descriptions various departments sites hasnt asked gift card amount dollars yet fake want yes simply modi ji ka photo laga dete itna top secret likhne ka kya zarurat tha bas ab koi yeh mat bol dena ki yeh asli hai date ye chitting hai bc single wouldve dated doc wasnt top secret would believed make india lion could added logos yeah cops knew pedophile theyd come arrest instead asking justification wow important person matter important director ib signed crime notice mf used stamps saved pirated pdf maker indian cyber squard scared know government wont send mails legal actions always done posts sensible adult would recognize scam immediately use spot wrong game stamp would real bhai ke paas jitne stamps maar diye also theres way many stamps looks like childrens scrapbook doesnt enough stamps obviously fake reply back say tohri myee ke choo op whats mail id got top secret fucking sent stamps kam pad gye cia fbi mi anonymous sabka daldete believable lgts almost thought ipl jersey got something like indian european one living europe lol mulkon ki police ne milkar ek letter bheja hai scammer employee many stamps signs want scammer boss yes years aazaadi waala watermark hota would believed dont understand one thing ur punishing visiting juvinile pornographic sites dont u ban take dowwn cath sellers na amount stamps signature makes look fake lol dont think ive seen legal document ever many signs stamps lol tht suspicious anything else maybe modi ji modi ji office cyber squuard lol looks real first sight pay even slight attention everything starts break stamps signatures placesome right middle body letter reasonable human stamps like bottom dude named akhand also autographs work akhand designation nobody knows isnt even space sign tapan dekas signature looks like somebodys ecg reading letters sprinkled none letters found word tapan deka ritambara prakashs signature translate ritambara prakash angle certified stamp certified letter halal certified kind paper theyre using certified apparently top secret document ps dudes cant decide whether confidential top secret militarypolice circles words mean two separate things yet decided literally share accused cyber pornography ones real bait people arent kid diddlers theyd know fake threw cyber pornography charge people watch porn however watchingdownloading porn completely legal india middle letter go monologue sort stuff government combat problem would fit ad interview youre talking accused asks respond immediatelyexpects gmail top secret cyber sqard lol bhai director ne personally mail kiya hai kaju katli toh lekar hi jana thode colors kam thebilkul asli lagte certifications medals north korean general muth mantri arvind bhaiya sounds fun send mail address lmao number signs stamps double engine ki sarkar indian scamming industry going control everyday domestic cases bringing shame nation industrial scale scamming westerners wasnt enough imagine number terrified naive people commit suicide upon recieving mails common man supposed top secret one popping laptop screen ministry information shit demanding rupees tracked watching pedophile prn uses faint sound hooter bgm work cybersecurity fake didnt even read op scammer getting know obvious give aways scam spelling squard thing made laugh lol hell madhya pradesh police emblem top left corner lol top secret documents dont top secret stamp post office stamp missing hence seems fake top secret also signed atleast thousand people stampmaxxing put much effort make sound legitimate gave away letter k rs kaato overacting k stamps letter doesnt gigantic government india stamp interpol stamp stamp country european union scammers emailed spoof email looking like mine something similar happens guys noone hacked email go check sent section theres nothing stay cautious scammers emailed spoof email looking like mine something similar happens guys noone hacked email go check sent section theres nothing stay cautious scammers emailed spoof email looking like mine something similar happens guys noone hacked email go check sent section theres nothing stay cautious cyber squard first lines first red flag authenticity court order lol many scams happening days squared privately readhing soo many stamps signature intented scare partwith money grammatical mistake post person right hand side would cyber crime offences offenses gg top secret fake less signatures seals id probably say legit grabs several chainsaws roadtrip indian cyber squard squidward stamps would make official stamps colors seems graduation degree clown overcompensated kind stamps overcompensated kind stamps overcompensated kind stamps nobody going look tapan dekas signature way signed reads tapan deka whatsoever itna saara stamp lagake main scam content ka jagah hi ni bach rha need better nobody going look tapan dekas signature way signed reads tapan deka whatsoever id call string along week nahi please gareeb aadami hun meri biwi chhor degichote chote bachche hain testicular torsion away sent letter without breaking door ask point writing half sentence one language hindi rest english see lot indians filipinos basically nobody else native norwegian speaker fluent english speaker idea writing half sentence norwegian finishing paragraph english strikes odd im criticising wondering people genuinely interested thanks almost fell graphics design passion energy social security number expired since last week bummer actually converse like thats deeply embedded english todays india urban india least mostly youll find reddit fine jailoutside world dangerous whole indian government franchises document ah idea thats really interesting thought online thing urban indian people tend speak english interjections hindi emphasis reason im curious haha thanks humouring many logos stamps want scammer yes top secret lol like kid got hold photoshop first time pasted official seals could find google image posted letter logos put think fake hai pagle uae ka immigration wala bhi seal hai scam jaysus official stamps cumstains thats actually true looks like slam book kids school reply saying work national informatics center cbi found fingerprints letter envelope matching aadhar database initiating action reaching advance see want pay fine avoid action top secret scam nah need chops many notary stamps gets new notice sharing top secret ba dum tss top secret stamp mere taraf se ek gandi gaali reply de dena aur subject daalde gira hua banda jama nuch baliye within territory noone uses language would replaced within republic india nahyou good needs colorful stamps lol teri fatt kyu gayi lacks forklift certified less stamps need think ask payment reply ask done one looks genuinely fake g azadi ka amritotsav logo seem remember spelling squad yes common unfortunately havent come across anyone years speaks pure hindi without using english words urban cities though pure english common sometimes add little hindi damn top secret would work lol single phone number given grammar atrocious spelling mistakes uff number stamps seals make look authentic guys gone overboard also signature tapan deka something else tf indian cyber squard dont understand scammers would learn use capital letters middle sentence dead giveaway guys better halal certified hence cant accepted best jail services govt approves grooming wtf convincing done lot designing work fakest scam ever used logos wholesale lol mean discretion sake obviously fake yeah thank sharing scams rampant package sent china via fedex found drugs airforce logo top secret stamp killed many stamps yes modijis photo signing respond immediately bhaichara top scam many logos mp police delhi police cbi ib raw top secret certified one left cbi national nodal agency interpol india sec pocso would appropriate sec technology information suggests possess wtf going whole paragraph discretion sake sanctions impose pedophilia legal term halaal certified therefore fake common man may know certified signatory etc whats important check email address sent also dont think cyber cell ask reaching anyone privately reply dont know dont know find make eat words png stamp designer high logos lol scam got mail month ago stamps signatures must genuine bro pm modis photograph hence sus dead giveaway lmao would government soooo concerned trivial insignificant matters like child pornography pedophilia indian cyber squard guy posting scammer trying find issues mail sending others dude unlocked stars see flying chopper area person said think supposed like hindi english example last night friend talking relationships conversation sounded like par dont understand man agar tu khush happy even nahi hai mere sath hum compatible even nahi hai toh fuck still friend han yes aur bhai brother ye abusive hai pura totally want partner sukoon peace ke liye agar sukoon peace even nahi hai toh pointless read without bracketed words first read meaning bracketed words less speak like language westernised due influence english also believe hinglish hindi english much easier speak pure hindi complicated faded popular culture time also doesnt help adapt west especially education textbooks postschool level english written authors west due major chunk urban indian students went englishmedium schools also always huge emphasis speaking english think lot us picked stuff friend went hindi medium school entire schooling speaks perfectly fluent english picked movies video games books yes really speak percolating rural india well quite unfortunate turn official private internet juvenile pornographic movie cyber sad someone united states ive developed keen sense identifying scams including originate india experience isnt based residing india rather dealing similar scams within us actively engage disrupt fraudulent activities particular email raised red flags due writing style leading conclude scam important clarify intention isnt convey message negativity unfortunately reality us significant target scam operations new form fraud long indian cyber squad fine case didnt get letter says indian cyber squard lol obviously scam old people people technical knowledge fall victim lacks certification president looks like werent sure would scary intelligence bureau central bureau investigation madhya pradesh police delhi police finally decided use four scammer thought stamps seriousness crime post sender email address bro community spam dth also needs isi agmark logo cyber squard sir matter toh winter vegetable hai taaza baingan le lo ka minimum stamps make look authenticate scammer many stamps want scammer yes indian cyber squard top secret proceeds send email indian cyber squard scam sure try stay away obscureunpopular porn sites sites highest number scammers plant seeds phishing email tracking viruses malware print send post friend foe april india use top secret vocabulary highly confidential official terminology certificate many stamps lol think numerous regional languages dialects india people speak english degree dont necessarily share regional language top secreat prank godfather pranksit would winner scammer awards probably spent hours millions rupees extract rupees best case scenario worst case thrown garbage think numerous regional languages dialects india british time hindi replaced many regional languages north india state bihar regional languages today mostly hindi dialects spoken south india preserved languages well english spoken urban india thats higher education english tere peeche mulko ki police hi lag gayi count stamps bro help find logos letter two income tax army bola tha vai mat jaao galat raste pe fake hai bhai bro got kind government agency stamps could find many stamps want yes military grade tho biggest give away scams bad english even scam calls chatgpt use kar le draft scams look less scammy wont believe unless stamps squard bro frame karwa ke apne ghar ya office main kagwa lo log ek baar ko dekhenge kya degree hai offences discussed email serious know bad child pronography taken seriously received email know committed offence dont know systems ips hacked misused scam misunderstanding one wrongly named serious matter got today lol google searched found aye brothers said reply email within hours got one lol got one today policedirectorgeneralitechnewsconemailmailtopolicedirectorgeneralitechnewsconemail lol got email today dont even live india email also included lots emojis lol xd got mail even name acp legible mentions high tech laboratory forgot interpols worstoflist recieved actually moment g fati reddit saved heart attack got email today attempting make money bit didnt understand lol got mail today screenshotted mail reverse image search landed thankfully received mail today official mail address changed reference number interpol raw ib one apparent agenda track nsfw activity internet lmao",
    "light_cleaned_title": "Got this in my mail",
    "light_cleaned_selftext": "Got this in my mail about a week ago just checked it today though. It is obviously a scam but I'm impressed with new ways these guys are coming up with. Thought I'd post it on reddit so others can also know about this. *Contents of mail-* ------------------------------------------------------------------------ Reference:\\\\ OFFICIAL COURT ORDER Office Of The Commissioner Of Police Cybercrime Cell / Computer Centre Police Headquarters, MSO Building, J.P. Estate, New Delhl 110002. Ref: No. 39724-34-01/ICB-IPHQ/2024 Dated the 22-03-2024. OFFICIAL COURT ORDER. This is to inform you of the attached alleged court order against your Internet IP traffic by the Central Bureau of Investigation, Department of Research and Analysis Wing. It is quite unfortunate to turn your official or private Internet to a juvenile pornographic movie cyber. The Central Bureau of Investigation works in partnership with the Police Cybercrime Special Units in handling all complex and sensitive cases of cybercrime, especially when the victims are women and minor children. Our laboratories are equipped with state-of-the-art spider/crawling digital software and equipment, having forensic capabilities such as extraction of deleted data from hard drives and mobile phones, imaging and hash value calculation, forensic servers and portable forensic tools for on-site examination, facility to extract data from latest Android or IOS as well as Chinese phones. Based on the above, it is extremely difficult for any victim to consciously or unconsciously visit juvenile pornographic sites without being digitally captured. More information or clarification on the court order will be made available to you upon receipt of your response within 24 hours; our office operates 24 hours / 7 days. Be assured that serious legal action will be taken against you if you fail to respond to this notice within 24 hours of receipt. To forewarn is to forearm. Sincerely, Ritambra Prakash (ACP/CB) For Deputy Commissioner Of Police Cybercrime Cell / Computer Centre Police Headquarters Copy to: I. Section Officer (UTS-II), GOI/MHA, New Delhi. 2. So/Ps To CP/Delhi. 3. Inspr./Cr/Estt. And Intelligence Bureau /PHQ 4. I/C Computer Centre/PHQ 5. Acs-R, Vii And Computer Cell/CB ------------------------------------------------------------------------ Stay safe y'all ;)",
    "light_cleaned_comments": "Interesting, but they got the wrong IB logo. Hahahahhahahaah.... Dude. My dad got this mail today. We were all freaking out in the morning. Later we checked a Linkedin post where someone had posted about this scam. Ghosh! Also are u a Rediffmail user? Because it is mostly targeting Rediff users only. lol they put stamps at every place empty they could find Scam \"Top Secret\" is a dead giveaway. 😂 Wow he personally thought to inform you, yet had to get it sealed and signed by so many people. They put all the stamps🤣🤣🤣 its also iso certified xD PM ka sign nahi hai, must be fake. For such an important notice, they need the signatures and seals of the PM, HM, President and at least 2/3rd chief ministers 😜 Omg it's top secret and certified! Why'd you share it! but watch child pornography inside the house is not a crime as held by the madras high court judge right 😂... It's missing a few important logos like Pepsi, coke etc. Tu toh lamba jayega beta 😂 Write back saying 3 important seals are missing in the letter and that you will file case against him for sending half assed letter. Mereko dhuk dhuk horela hai Don't forget both BJP and Congress logos for double legitimacy. Scam. no executive will reach you privately on paper! Vimal Pan Masala ka logo reh gya bass agency kafi mil jhul ke kam kar rhi hai I thought it was pornography with people of legal age acting in it. But it is really unfortunate if a court upholds child pornography. The dead give away is the \"Top secret\" stamp. Sharing, uploading, promoting Child pornography is wrong, but not seeing it inside the house alone as per the court. I honestly don't know how to react to it. Yes, that’s really fucked up. Bro I actually worked with the Commissioners office, this fake as hell. No one signs so shitty One question , did you use your email on any un popular dating site or porn site? I'm dead 🤣🤣 Han to kitne me matter settle hua? 🤒 Okay but what's the scam? As in when and how are they going to ask for or get money from you? Any chance it's a prank by someone you know? This letter looks like the News screen with hundreds of ads How many seals you need so that it looks authentic? Yes :D Lol even my dad received this email. Looks legit. Scam hota to 6 stamps aur hote /s LMAO they're TRYING to make it as fake as possible One thousand two hundred and fifty five million dollars.. Forward it to cyber security cell. Checkmate Spelling error in the second line \"Squard\" for Squad is a dead giveaway Top Secret got me “Especially when victims are women and minors” bc scammers be hum mardo k sath biased ho rahe h 😕 RIP 🪦 Good Art work 👌 bery big meet up saar Well, there is a stamp for \"Top Secret\". 😂😂 There's still space left , could've easily added 48 more Top secret lmao More official stamps required Also “I reached out to you personally” Now you will get another for sharing a document marked top secret on public platform. Could you share the email id from where you received it? Congrats Bhai 🎉, party kab IP estate ki jagah J P estate. Likha h Ek FIR kro and mail par reply back kar do Itne stamp lagaye hai ke padhu kaha se wahi nahi pata lmao 💀 Top Secret 😂 It's fake it does not have the Gandhi ji swatch Bharat glasses , the g20 stamp and Modiji picture. Wow, that’s a lot of stamps and signatures. It’s a pretty good fake. you should just ignore it. \" I decided to let you know \" ......ah ha Kindness , bancho! Its called pmo office stamp Spelling of SQUAD in second line is incorrect Reply with this photo Op be like \"DON ka intezar toh 11 mulkon ki police kar rahi hai! Lekin Don ko pakadna mushkil hi nahin, namumkin ha\" The amount of seals and emblems are scary - CYBER SQUARD - Tumhe pe official secrets act lagega. Top secret letter ko public kar diyaa.😂😂😂 First giveaway is obviously the missing photo of Modi . OP, please tell me your plan is to play along and string them and create a series of threads here where you update us on what’s happening. #SQUARD Saare jahan ki police dhundh rhi Bhai ko Thought legitimate for the first part but the last part and top secret 😂. Btw OP you should complain about this as cyber crime which I think they have an online portal. Many will fall for this. UNESCO declares this as the best notice in the world. Source: Whatsapp Missing president signature and seal They really went hard on this one. As a law student I'm impressed with this person's drafting skills. Indian Cyber SQUARD..😀 Bhai top secret tha post kyo kar diya? 😂 You're gone man. Scammers are upping their game i see. Ask them on mail address the CIA stamp also then it will look authenticated Veg or Nonveg ka logo toh hai hi nahi..pataa kaise chalega haath lagaaye ya nahi. Stop surfing scammy websites man this is something that they've backlinked your IP to. Atleast try not to expose your IP when you are surfing scammy websites. Top secret? Lmao!!! Send mi 69k wtsup nw /s Classic scam Dude it's TOP SECRET. Don't disclose. Fda certified likjna bhool gaye That Top Secret seal & I can't stop laughing 😆 lol did you tell 'em to stuff it up their xxx \\0 You read that to know it's fake or not? Bhai CIA aur NIA ka seal bhi dey deta. No grammer mistake. Pretty nice job. A very good percentage will defo fall for this. Redditors: Please don't give them ideas on how to perfect this even more! No Modiji face... Not legit Needed more logos. What kind of amateur organization is this? /s Bada wala Modi ka photo nai hai Bhai apna Don hai. 7 agencies peeche padi hai 😂 Modiji's photo is missing. Must be fake. It looks like some Cannes film festival award logo Didn't you guys see the Indian Cyber SQUARD in the second line? With these many typos, it seems totally legit. Lol Top Secret 🤣 Someone in Kerala unalived himself when this popped up on his screen Delete this law is a myth in this nation School ke aakhri din ki yaad aa gayi Aur koi baki nahi tha kya sign karne ko? Its missing the \"Parental Advisory: Explicit content\" sticker..... IB and RAW. wow!! i wish the guy knew the difference between the two. Had to... It was from Office of the commissioner of police Cyber Cell Wing... 😂😂 First thing first.. email id of sender? Bro🤣🤣🤣 These scams seem to be on an exponential rise. The cyber cell has got its work cut out. The scamsters can face so many charges at once. Two more seals and it would’ve looked real. Modi ji ki photo kaha hai isme? All these stylish signs is where I lost it….there is no style in Govt 2/3rd chief minister? Got it. *grabs chainsaw* PMO ka stamp nai hai ,fake hai But how will you contact scanmers lol. All these money wasted!! Forensic disk recovery ka kya lena dena spying se lol. this is scam as shit. before even reading the content of the letter the logos are spammed as shit with irregular spacing and much of the text description is an explanation rather than a notice. This is how insecurity looks like 😂😂 “Top secret” at the bottom right takes the cake All the wordings are on par, definitely la(w)yers are consulted. This is the best reply. Where's the seal of POTUS? They clearly forgot or ran out of space....send it back for corrections This comes under which Yojana? A lot of logos Text is description than a statement Important keywords are in all caps to scare you Lot of ink signatures on digital pdf Irregular spacing between content Cheap ass grammar and punctuations Kbc logo is important bro. 🤣 Tapan Deka amar rahe. You know it's fake because it doesn't have enough stamps. If it has at least 15-20 more, it'd be legit! ^/s Bhai Top Secret of reddit pe post kyu kar Raha hai. The top secret stamp is what gave it away Government seals that are legible and aligned? Fake! Nah, This is from data leaks/ Data selling by scummy companies. Classic scare tactic scam. Did you also receive it from indiapoli-admin\\[.\\]com ? If not, would you be willing to share a copy email for our analysis. P.S. I am a threat researchers who specializes in underground cybercrime communities. I'd be happy to get my hands on it and see if leads me to anywhere. Lemme know! Font, logos and stamps give it away. This reminded me of the plaster that was put on my fractured hand when I was a kid and all my classmates wrote all kinds of crap over it Scam I miss smiling Modi and his pet peacock in that doc. It's a scam. Certified gold and rated platinum Lol that \"Top secret\" stamp Hol up, Is that the USA insignia 💀 Top secret 💀 dunno looks fake to me “Top secret” but sent it via email 🤣 Trust me, If the officials get a glimpse that you hold any of those content, you'll be in jail now. They wouldn't be sending notice lol. Scam. CBI busy raiding opposition and those who speak I'll of modixi's glorious rule Dude y'all can say this is scam but at first we all will be trified.If this comes up first then you will be the one to become a victim to this scam SquaRd 😂😂 BC Pakistan ka ISI ka stamp bhi maar dete ....FBI, CBI...kuchh mat chhodo 😄 Police doesn't send mail, they immediately call and ask you to report at Police station hahaha. Mere paas v aya thha yeh...it looked so damn authentic , I had to rush to the police station to show it. Around 6th Paragraph, \"For your Discretion sake\" is where I was deffo Sure it's a fake lol. Too many emblems, the Watermark on the print doesn't match with any of the displayed logo and I am sure if I look up names and signs, they would be either misspelt or non existent. The Interpol is a joke in this country. Not enough stamps. Faced a similiar threat while accessing a torrent. A pop-up redirected to similar kind of wesbite where they sent multiple Alerts stating life imprisonment/ 10L bail. Isko puch Article 21 nahi pata kya tere ko lawde ka baal It seems the scammers accommodated all the logos and stamps they could think of. Reminds me of my friend who never watches pron online and is afraid of using torrent. what were they going to gain with this anyway ? Say you replied to the mail and so on , what next they would have asked you to pay a fine as penalty ? Pathetic CYBER SQUARD LOL Missing Modi photo. So it’s a fake. The letter carries the stamp and signature of all the agencies in India ,only modijis stamp is missing due to non availability of prime space. High five bro ✋Posting my copy! Plural hai I see more than 3 signatures, it must be legit. Our office is open 24/7 is another red flag🤣 You have now compromised a Top Secret Cyber Mission Government notice period itne stamp nhi hote. Ek stamp hi kaafi hai Relax and party, nothing will happen... I got 4-5 notices till now. US president ka seal missing, so it's fake... Reply to this mail like this... So much pushing hard to make it certified genuine. Designer overdid. Oh what am I seeing!! Dude I am the officer who send you this. Jor jor se bol kar scheme mat bata sabko. Stamp to lagta hai sari duniya ki agency ke laga diye hai Lol they put every stamp vector they found online in it😂 Scammer: How many stamps should I put on the letter? Scammer boss: Yes 😂😆 Dude India Cyber 'SQUARD'... end of story. 😂 CERTIFIED !!!!!!! Your life is over. Your baccho ki life is over. Bhai shaap 17 pushte jail mien gaana gayengi.. पोषम पा भई पोषम पा, सौ रूपए की घडी चुराई, अब तो जेल में जाना पडेगा, जेल की रोटी खानी पड़ेगी, जेल का पानी पीना पड़ेगा, अब तो जेल में जाना पड़ेगा. Farewell pe meri tshirt bilkul aisi dikhri thi Save as \"PDF file\" Needs a few more stamps and seals .. I doubt this letter is legit. Cyber squard The random punctuation makes it look very unprofessional and fake Top secret? 😂 It is quite unfortunate to turn your official or private Internet to a juvenile pornographic movie cyber. what One more page of stamps attached would make it look legit Logos cannot overlap, small mistake gave it away They still missed lot of spaces to put logos and text or singature. Couple of changes and it can fly as a genuine letter. Dimag lagaya hai isme scammers ne Kya kr rha hai bhai top secret ko public kr diya …ab tho ek case or lagega tere pe😤 More stamps than written content. Khatam bhai tumab will be going to the court together ig lmao XD INDIAN CYBER SQUARD Logo placement ka tareeka thoda kezual hai “Is sajjan ko kya dikkat hai bhai?” T : “Does OP has any issues?” True! This led to sus. Bhai eisa kya kar diya tumne kahi ki Lanka Fook di kya Wow we should crush these fake scammers Just curious what is the sender/cc email ids? Lmao….that Top Secret seal 🤣💀 It’s clearly fake since modijii picture is not there anywhere. Intelligence Bureau ka mandate ye nhi hai :( Chatgpt ka pura istemaal koi inse seekhiye That’s what gave it away as a scam. No way the narcissistic bastard’s photo isn’t emblazoned on every government documents Fake With all those stamps it sure is real. bhai DTC ka bhi logo laga hi deta sath me OMG! Look at the amount of seal in that document. Anyways they are creating a scam document why are they not investing in grammar and some actual law clauses. Also since when is Grooming a crime? Contact kar aur 10--20 hajar mai maafi maang lengi CBI Wale😂😂😂 Aur mujhe bhi 5k bhej nahi to comment box Mai sabko bata dunga ki tu porn dekhta hai😂😂 aur tereko porn sites se reverse track kar mail kar Diya 😂🤣🤣🤣 Cyber Squard That top secret stamp is enough to expose this scam Indian Cyber Squard 💀 Buddy go to jail now oh Bhai seriously underrated comment hai ye Ah yes, Indian Cyber Squard. My favourite squard in the history of squards. Designer did overtime job to make it look genuine. This is so well made that a lot of people could fall for it. They made it look a little too genuine. Too much seals and stamps is a give away Pehle CBI then RAW...🤣 Every government organisation is after you. Squad ka spelling aur grammar ka use dekh ke hi ignore kar Dena chaiye tha. Scam hain bhai!!! bhai en chijo kai chkkr sai investigation bheth thii toh mai 5 saal phele hee andr hota chill yr this is india yha sarkar piracy ka kuch nhi kr pa rhi en chijo ka kha sai karegi there is used to be fake webpage too about this in which they asked you to pay some money. Bhai etni sari mohor to kisi ki citizenship ke liye bhi nahi lagti notty ho rha kai ? How can a court order be alleged. It either is against you or not 'I decided to reach you personally' --- No one reaches personally. This is a scam. Not BJP, that would actually give it legitimacy. Lol I mean cybercrime doing something is a dead giveaway. Lol. Why Madhya Pradesh Police logo? Letter to DP ne bheja hai The technology of information 🤣 Grooming can also refer to a manipulative behavior used by sexual abusers to gain access to a victim. Looks a lot like the back of my laptop, barely any real estate left for stickers. Exactly man... So serious it must be... It's Top secret document sent over gmail🤣🤣🤣 The amount of money spent on making those stamps will need at least 10 baits to recover the cost followed by the net profit... Failed planning... Should be IIT pass outs.... And, copy to- so many people. Madhya Pradesh Police logo in top left corner on a letter by \"Delhi Police\". It’s a scam max thing. Report these guys , get them arrested and locked away . Additional 14 years for breaking secrecy. What’s their end game? Do they expect you to go to that address or something? Typically scammers want you to call a number or something, but then this “letter” doesn’t give that. Right from the get go they messed it up by stating \"Central Bureau of Investigation, Department of Research and Analysis wing.\" These are two different branches, the RAW deals with foreign intelligence and counter terrorism while the CBI is tasked with dealing with domestic crimes. After that the next line that ends with \"...juvenile pornographic movie cyber.\" is just grammatically incorrect and is more jarring when compared to the other lines which seem to flow grammatically and appear to have been just copy pasted from descriptions of the various departments from other sites. Hasn't asked for a gift card in the amount of 500 dollars yet? How Fake do you want it to be? YES. Simply Modi Ji ka photo laga dete.... Itna top secret likhne ka kya zarurat tha.... Bas ab koi yeh mat bol dena ki yeh asli hai.... No date?? Ye to chitting hai bc! If I were single, I would've dated this doc. ;) If there wasn't top secret, I would have believed it. Make in India lion too they could have added few more logos. Yeah, of cops knew you were a pedophile, they'd just come and arrest you instead of asking for \"justification\". Wow.... you are such an important person and this matter is so important that the Director of IB himself signed off on your crime notice!! MF used all the stamps saved in his Pirated pdf maker Indian cyber SQUARD. You should be scared. We all know the government won't send any mails for legal actions. It's always done by posts. Any sensible adult would recognize this as a scam immediately. Should use this for a “Spot what is wrong” game If only it had 1 more stamp it would have been real. Bhai ke paas jitne stamps the maar diye Also, there's way too many stamps - it looks like a children's scrapbook Doesn’t have enough stamps, so obviously fake. Just reply back and say \" tohri myee ke Cho*o OP what's the mail id you got this from? \"Top Secret\" fucking sent me Stamps kam pad gye! CIA, FBI, MI6, ANONYMOUS sabka daldete to believable lgts I almost thought it was an IPL jersey I got something like this but not Indian it is of European one , as am living in Europe. lol .. 11 mulkon ki police ne milkar ek letter bheja hai.... Scammer employee: How many stamps and signs do you want? Scammer boss: YES! 75 years aazaadi waala watermark hota to I would have believed it i dont understand one thing if ur punishing me for 'visiting' juvinile pornographic sites , why dont u just ban them or take them dowwn cath them as sellers na , why me Amount of stamps and signature makes it look fake lol i dont think ive seen a legal document ever with so many signs and stamps lol tht is more suspicious than anything else here maybe its modi ji himself modi ji in his office- Cyber Squuard. Lol It looks so real on first sight but when you pay even slight attention everything starts to break down. * Just stamps and signatures all over the place,some are right in the middle of the body of the letter. No reasonable human being stamps like that * At the bottom some dude named Akhand also autographs this work, who is Akhand? What is his designation? Nobody knows. There isn't even a space for him to sign. * Tapan Deka's signature looks like somebody's ECG reading with letters sprinkled into it. None of those letters are found in the word \"Tapan Deka\" * Again, Ritambara Prakash's signature does not translate to Ritambara Prakash from any angle. * \"Certified\" stamp. Certified for what? Is this letter Halal certified? Or is it about the kind of paper they're using? It's just certified. * Apparently a top secret document (ps these dudes can't decide on whether its confidential or top secret, in military/police circles these words mean two separate things) and yet they decided to literally share it with the accused. * Cyber Pornography: this one's the real bait. Most people aren't kid diddlers so they'd know this is fake but they threw in a \"cyber pornography\" charge too because most people do watch porn. However watching/downloading porn is completely legal in India. * In the middle of the letter they go into a monologue about what sort of stuff the government does to combat this problem, which would fit in an ad or an interview, but not when you're talking to an accused. * Asks you to respond immediately,expects you to do it on gmail. Top Secret 😂 Cyber SQARD, lol Bhai director ne personally mail Kiya hai kaju katli toh lekar hi jana Thode colors kam the….bilkul asli lagte ! There is more certifications on this than the medals on a north korean general. Is this from #Muth Mantri Arvind Bhaiya? Sounds fun. Can you send the mail address? lmao the number of signs and stamps Double engine ki sarkar Indian scamming industry is going out of control everyday . Now with more and more domestic cases. As if bringing shame to the nation by the industrial scale scamming of westerners wasn't enough . imagine the number of terrified naive people who will commit suicide upon recieving such mails Common man. It was supposed to be top secret 😂 I had one popping up on laptop screen, from ministry of information or some shit, demanding 32000 rupees as they tracked me watching pedophile p*rn. They uses a faint sound of hooter as bgm. I work in cybersecurity, it’s fake and I didn’t even read it OP is a scammer and he is just getting to know what are the obvious give aways that it's a scam. The spelling of Squard was the only thing that made me laugh.... Lol What the hell is madhya pradesh police emblem doing at the top left corner lol Top secret documents don't have Top secret stamp on them Post office stamp is missing hence it seems fake to me. top secret, also signed by atleast thousand people. Stampmaxxing he put in so much effort to make it sound legitimate that he gave it away Is letter k 50 Rs kaato overacting k Too few stamps, the letter doesn't have a gigantic government of India stamp, Interpol stamp, stamp for each country in the European Union. Scammers emailed me from a spoof email looking like mine with something similar. If that happens guys Noone has hacked you email, go check the sent section there's nothing, so stay cautious out there. Scammers emailed me from a spoof email looking like mine with something similar. If that happens guys Noone has hacked you email, go check the sent section there's nothing, so stay cautious out there. Scammers emailed me from a spoof email looking like mine with something similar. If that happens guys Noone has hacked you email, go check the sent section there's nothing, so stay cautious out there. \"Cyber Squard\" in the first few lines should have been your first red flag 🚩 on the authenticity of this \"court order\" lol So many scams happening these days. Squared... Privately readhing you. Soo many stamps and signature. Intented to scare you to partwith your money. Grammatical mistake on the post of the person on the right hand side. It would be \"Cyber Crime Offences\", not \"Offenses\". GG top secret fake. Very less signatures and seals. If there were a few more, I'd probably say this is legit *grabs several chainsaws* ROADTRIP!! “ Indian Cyber *Squard* ”😭 Squidward Some more stamps would make it official With all these stamps and colors seems the graduation degree of a clown 🤡 Overcompensated with all kind of stamps Overcompensated with all kind of stamps Overcompensated with all kind of stamps Is nobody going to look at Tapan Deka’s signature? No way what he has signed reads Tapan Deka, whatsoever. This. Itna saara stamp lagake main scam content ka jagah hi ni bach rha. They need to do better. Is nobody going to look at Tapan Deka’s signature? No way what he has signed reads Tapan Deka, whatsoever. I’d call them. And string them along for a week. Nahi. Please gareeb aadami hun. Meri biwi chhor degi…..chote chote bachche hain… Testicular torsion What have it away? That they sent you a letter without breaking down your door? Can I ask? What is the point of writing half a sentence in one language (Hindi?) and the rest of it in English. I see this a lot with Indians and Filipinos, and basically nobody else. As a native Norwegian speaker and a fluent English speaker, the idea of writing half a sentence in Norwegian and finishing the paragraph in English strikes me as very odd. I'm not criticising, just wondering why people do it. Genuinely interested. Thanks. Almost fell for it. \"Graphics design is my passion\" energy My social security number is expired since last week. Bummer. We actually converse like this, that's how deeply embedded English is in today's India (urban India at least, which is mostly what you'll find on Reddit). I am fine in jail,outside world is more dangerous Whole Indian government franchises that document. Ah, I had no idea. That's really interesting, I thought it was an online thing. Do urban Indian people tend to speak English with interjections in Hindi for emphasis? Or some other reason? I'm very curious about this, haha, thanks for humouring me! How many logos and stamps do you want ? Scammer:- YES Top secret lol It's like kid got hold of photoshop for the first time and pasted all the official seals he could find on Google image and posted on this letter. More 2-3 logos should have been put You think ? Fake hai re pagle... Uae ka immigration wala bhi seal hai Scam Jaysus. Are those official stamps or just cumstains ? That's actually true. Looks like a slam book kids have in school Reply to them saying that you work for national informatics center for CBI, have found their fingerprints on the letter and envelope and will be matching it with the aadhar Database and initiating action against them. But you are reaching out in advance to see if they want to pay a fine to avoid any action. 🤫 Top Secret Scam! nah, need more chops There are so many notary stamps gets new notice for sharing top secret ba dum tss Top secret stamp 🤣 Mere taraf se ek gandi gaali reply me de Dena. Aur subject daalde \"me gira hua Banda jama nuch baliye\" Within our territory 😂 no-one uses that language, it would be replaced by \"within the republic of India\" Nah..you good. It needs more colorful stamps lol but teri fatt kyu gayi ;) it just lacks Forklift Certified. Less stamps. Need more. I think they will ask for payment once you reply and ask what can be done This one looks genuinely fake! Where is G20 and Azadi Ka Amritotsav logo I seem to remember the spelling of squad Yes this is very common unfortunately. I haven't come across anyone in years who speaks pure Hindi without using English words in urban cities. Though pure English is common but sometimes we add little hindi to it Damn that \"TOP SECRET\" would work in the 80s lol Not a single phone number given here The grammar is atrocious. And spelling mistakes.... Uff. The number of stamps and seals to make it look authentic, these guys have gone overboard 😂. Also signature of Tapan Deka is something else 😜 Tf is “INDIAN CYBER SQUARD” I dont understand when these scammers would learn not to use capital letters in the middle of the sentence. Its a dead giveaway guys , do better. It's not halal certified hence can't be accepted. Best jail services, govt approves Grooming. Wtf very convincing. They have done lot of designing work. Fakest scam ever. They used logos from some wholesale Lol... What do they mean by \"for discretion sake\"!!!! Obviously fake. But yeah thank you sharing because such scams are rampant. This and the \"a package was being sent to China from you via FedEx and we found drugs in it\". Why is there an airforce logo🤣 \"Top Secret\" stamp killed me So how many stamps- \"Yes\" And Modiji's photo Signing off with \"Respond Immediately\" 🤣🤣 Bhaichara On Top🫂 It's a scam! * So many logos! MP police, Delhi police, CBI, IB, RAW! Top secret, Certified. Any one left!? 🤣 * CBI is the national nodal agency for INTERPOL in India. * Sec 15 of POCSO would be appropriate not the sec 14. * Technology of Information? 🤣 Suggests, Possess...? WTF is going on with this whole paragraph! * Discretion sake? 🙃 * Sanctions will be IMPOSE? * Is pedophilia a legal term? It's not halaal certified therefore it's fake. As common man we may not know all these certified signatory etc.. What's important for you to check email address from where it was sent. Also, I don't think cyber cell will ask for reaching anyone privately. Reply them \"I dont know who you are, I dont know where you are. But, I will find you, and make you eat your words🤣\". That PNG stamp Designer was High on logos lol ..it's a scam!!! Got same mail a month ago. Has 10 stamps and 3 signatures... Must be genuine bro... /S There is no PM Modi's photograph. Hence it is SUS It's a dead giveaway lmao- why would the government be soooo concerned about such trivial and insignificant matters like child pornography and pedophilia. /s INDIAN CYBER 'SQUARD' 😂😂😂 What is the guy who is posting this is a scammer and trying to find out all the issues with the mail before sending it to others 💀 Dude, you unlocked all the stars. Can you see flying chopper in your area? +1 to what the other person said. I think it's supposed to he more like 70% Hindi and 30% English. For example, last night me and my friend were talking about relationships, this is what the conversation sounded like: Me: Are par (but) I don't understand man, agar (if) tu (you) khush (happy) he (even) nahi (not) hai mere (me) sath (with), hum (we) compatible he (even) nahi (not) hai, toh (then) why the fuck are we still with each other? Friend: Han (yes), aur (and) bhai (brother) ye (this) abusive hai (is) pura (totally). Why do you want a partner? Sukoon (peace) ke liye (for), agar (if) sukoon (peace) he (even) nahi (not) hai toh (then) it's pointless Read without the bracketed words first. Then read again with the meaning in the bracketed words. We more or less speak like this. It's because the language has been so westernised due to the influence of English. Also, I believe Hinglish (Hindi + English) is much easier to speak than pure Hindi, which can be very complicated and has faded from popular culture over time. It also doesn't help that we had to adapt to the west, especially for our education as most textbooks post-school level are in English, as they are written by authors from the west. Due to this, a major chunk of the urban Indian students went to English-medium schools. Also, there has always been a huge emphasis on speaking English here, so I think a lot of us just picked up stuff. I have a friend who went to a Hindi medium school for his entire schooling and speaks perfectly fluent English which he picked up from movies, video games and books. All in all, yes, it's really how we speak here, and it's percolating down to rural India as well. > It is quite unfortunate to turn your official or private Internet to a juvenile pornographic movie cyber. So sad! As someone from the United States, I've developed a keen sense for identifying scams, including those that originate from India. My experience isn't based on residing in India but rather on dealing with similar scams within the US, where I actively engage with and disrupt such fraudulent activities. This particular email raised red flags for me due to its writing style, leading me to conclude it's a scam. It's important to clarify that my intention isn't to convey this message with negativity. Unfortunately, it's a reality that the US is a significant target for scam operations. Now new form of fraud As long as it’s not Indian cyber squad, you should be fine. In case you didn’t get it, the letter says they are Indian cyber squard. Lol 😂😂 Obviously scam but old people and people not having technical knowledge will fall victim to it This lacks Certification from President. Looks like they weren't sure as to what would be more scary..... Intelligence Bureau, Central Bureau of Investigation, Madhya Pradesh Police or Delhi Police. Finally decided to use all four😂 Scammer thought more the no. Of stamps more is the seriousness of crime😂 Post the sender email address too bro, community will spam them to d**th Also needs isi and agmark logo What is “CYBER SQUARD”? Sir matter toh winter vegetable hai, taaza baingan le lo 80 ka it should have minimum 100 stamps to make it look authenticate. Scammer 1: how many stamps do you want on this? Scammer 2: Yes Indian Cyber Squard 🤣 Top Secret and then proceeds to send an email. \"Indian Cyber Squard\" It’s a scam for sure, but you should try and stay away from obscure/unpopular porn sites. These are the sites where the highest number of scammers plant seeds of phishing, email tracking, viruses, and other malware. Print and send post this to your friend or foe on 1 April. India does not use the “Top Secret” vocabulary. “Highly confidential” is the official terminology. Certificate with so many stamps lol Do you think it's because of the numerous regional languages and dialects in India? If most people speak English to some degree, but don't necessarily share a regional language. tOp sEcReAT This prank is Godfather of all pranks.It would be a winner on the 2024 Scammer Awards. They probably spent 100 hours and millions of rupees to extract 50 rupees in the best case scenario or worst case have it thrown into the garbage. >Do you think it's because of the numerous regional languages and dialects in India? In the British time, Hindi replaced many regional languages in north India. Just the state of Bihar had 8 regional languages while today mostly Hindi and some dialects of it are spoken. South India has preserved their languages well. When English is spoken in urban India that's because our higher education is all in English. Tere peeche to 11 mulko ki police hi lag gayi ... (Count the stamps bro) Help me find what are other logos in the letter two of them being. 1) income tax. 2) Army Bola tha vai mat jaao galat raste pe😞😔. Fake hai bhai. bro got all kind of government agency stamps he could find How many stamps do you want? Yes But, is it military grade tho? The biggest give away of these scams is their bad english even on scam calls. Chatgpt use kar le to draft such scams to look less scammy. I won’t believe this unless it has more stamps .. squard Bro frame karwa ke apne ghar ya office main kagwa lo, log ek baar ko dekhenge kya degree hai 🤣🤣🤣 The offences discussed in this email are serious and we all know how bad is Child pronography and it should be taken seriously. I too received the same email. But I know I have not committed any offence, But we don't know how our systems and IPs are hacked and misused. In such a scam or misunderstanding if one is wrongly named, its very serious matter. I just got this today lol. Google searched and found this. 😂 aye we brothers now :) they said to reply to the email within 24 hours, I got one myself lol I got one today from [PoliceDirectorGeneral9@itechnewscon.email](mailto:PoliceDirectorGeneral9@itechnewscon.email) lol I got this email today - I don’t even live in India do you? 😂 my email also included LOTS of emojis ⚖️⚖️ ⚖️ Lol XD Got the same mail, even the name of acp is legible and it mentions high tech laboratory😂😂 You forgot, INTERPOL's \"worst-of-list\" recieved the same and actually for a moment \"G fati\" Reddit saved me once again from a heart attack I got this email today. How are they attempting to make money out of this? That bit I didn't understand. Lol i got this mail today. I screenshotted the mail, did reverse image search & landed up here thankfully 🤣 received the same mail today on my official mail. only address changed, reference number is same INTERPOL, R&AW, IB only have one apparent agenda to track your nsfw activity on the internet Lmao"
}