{
    "id": "191wku7",
    "title": "Indian Rape Culture",
    "url": "https://www.reddit.com/r/india/comments/191wku7/indian_rape_culture/",
    "selftext": "*Trigger warning for SA and related topics*\n\nI saw [this video](https://www.youtube.com/watch?v=LRck-5fmRpA) from 13 years ago of this CNN reporter getting sexually assaulted while on air by Indian men. Watch it at your own discretion because it is truly horrifying. \n\nI have a few women friends abroad and the impression they have of Indian men is extremely negative, and it is videos such as these that really highlights why. Although the video is close to 13 years old, it is safe to say that the general behavior of Indian men remains the same, and we have not progressed as a society at all. Feminism has been getting more and more mainstream in Indian cultural discourses in the past years, but mostly because it is antagonized by the community. The general public only seems to want to talk about \"pseudo-feminism\" and how it harms men - a class of people that have historically being protected and in power. Sexism is a universal issue but it seems that it manifests in the most violent ways in India alone. The video of the crowd attacking the woman cannot be brushed off as an isolated incident, it is the culmination of our society's attitude towards women. This is the result of a culture that promotes and rewards misogyny and rape. \n\nRape in India is so disgustingly common, that its almost everyday that we hear about a new extremely gruesome case. When one of these cases gets highly publicized (which is often), the knee-jerk reaction of most people seems to be - \"What religion was the victim?\", \"What religion was the perpetrator?\". It's like we are doing everything in our power to completely jump over the actual discussion we should be having. Communal issues in India are a valid topic that we should talk about, but that is beyond the point of this post, and rarely the cause of rapes in India. Rape does not happen because of religion, it happens out of hate for women - to hate women so much that you don't even consider them worthy of self-autonomy. However, it makes sense why religion seems to be such a prominent topic of discussion surrounding cases of violence against women. It is way more convenient to talk about religion, rather than rape culture. Talking about the latter would mean the men have to come to terms with the fact that Indian society hates women, and that misogyny is real, and that we do, in fact, need feminism. \n\nThis ties into the on-going Maldives situation. The views expressed by the Maldivian Officials are of course blatantly racist and should be condemned, but we cannot ignore that there is reason those views exist at all. The image most people outside of our county have of Indian men is smelly, dirty perverts, and although racism plays a huge role in that, there is absolutely nothing about Indian men that can redeem that image. When the very real aspect of Indian men being bat-shit perverts already exists, it becomes really easy to add a few more bad attributes with that. The current state of our discourse on misogyny is really hopeless. I really do not think we are ever going to enlighten beyond this, at least on a scale that will have any impact. Please remember that the video of the CNN reporter is simply the one that was fortunate enough to be documented. There are thousands upon thousands of women in India that have gone through or will go through through that exact situation without a camera present. It is simply what India is.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1704749277.0,
    "convurl": "https://external-preview.redd.it/JAkbOegG5LT0TWaw-EJoj72RfjNkKe87quHmBiNp3xM.jpg?auto=webp&s=ffaff9f66b8cc3e14317bb18fbba2e2f3cfb9a09",
    "comments": [
        "A thread under that video I linked. Showcases the point I'm trying to make. \n\nhttps://preview.redd.it/95u9ere8babc1.png?width=1171&format=png&auto=webp&s=c85c4c40ab7304005af9aa6539d49598e17acdfc",
        "What are you trying to prove? Everybody here already accepts that there are fucked up parts of our culture which need to go.",
        ">The views expressed by the Maldivian Officials are of course blatantly racist and should be condemned, but we cannot ignore that there is reason those views exist at all. The image most people outside of our county have of Indian men is smelly, dirty perverts, and although racism plays a huge role in that, there is absolutely nothing about Indian men that can redeem that image.\n\nWhat the absolute fuck?"
    ],
    "cleaned_text": "indian rape culture trigger warning sa related topics saw videohttpswwwyoutubecomwatchvlrckfmrpa years ago cnn reporter getting sexually assaulted air indian men watch discretion truly horrifying women friends abroad impression indian men extremely negative videos really highlights although video close years old safe say general behavior indian men remains progressed society feminism getting mainstream indian cultural discourses past years mostly antagonized community general public seems want talk pseudofeminism harms men class people historically protected power sexism universal issue seems manifests violent ways india alone video crowd attacking woman brushed isolated incident culmination societys attitude towards women result culture promotes rewards misogyny rape rape india disgustingly common almost everyday hear new extremely gruesome case one cases gets highly publicized often kneejerk reaction people seems religion victim religion perpetrator like everything power completely jump actual discussion communal issues india valid topic talk beyond point post rarely cause rapes india rape happen religion happens hate women hate women much dont even consider worthy selfautonomy however makes sense religion seems prominent topic discussion surrounding cases violence women way convenient talk religion rather rape culture talking latter would mean men come terms fact indian society hates women misogyny real fact need feminism ties ongoing maldives situation views expressed maldivian officials course blatantly racist condemned ignore reason views exist image people outside county indian men smelly dirty perverts although racism plays huge role absolutely nothing indian men redeem image real aspect indian men batshit perverts already exists becomes really easy add bad attributes current state discourse misogyny really hopeless really think ever going enlighten beyond least scale impact please remember video cnn reporter simply one fortunate enough documented thousands upon thousands women india gone go exact situation without camera present simply india ",
    "cleaned_title": "indian rape culture",
    "cleaned_selftext": "trigger warning sa related topics saw videohttpswwwyoutubecomwatchvlrckfmrpa years ago cnn reporter getting sexually assaulted air indian men watch discretion truly horrifying women friends abroad impression indian men extremely negative videos really highlights although video close years old safe say general behavior indian men remains progressed society feminism getting mainstream indian cultural discourses past years mostly antagonized community general public seems want talk pseudofeminism harms men class people historically protected power sexism universal issue seems manifests violent ways india alone video crowd attacking woman brushed isolated incident culmination societys attitude towards women result culture promotes rewards misogyny rape rape india disgustingly common almost everyday hear new extremely gruesome case one cases gets highly publicized often kneejerk reaction people seems religion victim religion perpetrator like everything power completely jump actual discussion communal issues india valid topic talk beyond point post rarely cause rapes india rape happen religion happens hate women hate women much dont even consider worthy selfautonomy however makes sense religion seems prominent topic discussion surrounding cases violence women way convenient talk religion rather rape culture talking latter would mean men come terms fact indian society hates women misogyny real fact need feminism ties ongoing maldives situation views expressed maldivian officials course blatantly racist condemned ignore reason views exist image people outside county indian men smelly dirty perverts although racism plays huge role absolutely nothing indian men redeem image real aspect indian men batshit perverts already exists becomes really easy add bad attributes current state discourse misogyny really hopeless really think ever going enlighten beyond least scale impact please remember video cnn reporter simply one fortunate enough documented thousands upon thousands women india gone go exact situation without camera present simply india",
    "cleaned_comments": "thread video linked showcases point im trying make trying prove everybody already accepts fucked parts culture need go views expressed maldivian officials course blatantly racist condemned ignore reason views exist image people outside county indian men smelly dirty perverts although racism plays huge role absolutely nothing indian men redeem image absolute fuck",
    "light_cleaned_title": "Indian Rape Culture",
    "light_cleaned_selftext": "*Trigger warning for SA and related topics* I saw [this video](https://www.youtube.com/watch?v=LRck-5fmRpA) from 13 years ago of this CNN reporter getting sexually assaulted while on air by Indian men. Watch it at your own discretion because it is truly horrifying. I have a few women friends abroad and the impression they have of Indian men is extremely negative, and it is videos such as these that really highlights why. Although the video is close to 13 years old, it is safe to say that the general behavior of Indian men remains the same, and we have not progressed as a society at all. Feminism has been getting more and more mainstream in Indian cultural discourses in the past years, but mostly because it is antagonized by the community. The general public only seems to want to talk about \"pseudo-feminism\" and how it harms men - a class of people that have historically being protected and in power. Sexism is a universal issue but it seems that it manifests in the most violent ways in India alone. The video of the crowd attacking the woman cannot be brushed off as an isolated incident, it is the culmination of our society's attitude towards women. This is the result of a culture that promotes and rewards misogyny and rape. Rape in India is so disgustingly common, that its almost everyday that we hear about a new extremely gruesome case. When one of these cases gets highly publicized (which is often), the knee-jerk reaction of most people seems to be - \"What religion was the victim?\", \"What religion was the perpetrator?\". It's like we are doing everything in our power to completely jump over the actual discussion we should be having. Communal issues in India are a valid topic that we should talk about, but that is beyond the point of this post, and rarely the cause of rapes in India. Rape does not happen because of religion, it happens out of hate for women - to hate women so much that you don't even consider them worthy of self-autonomy. However, it makes sense why religion seems to be such a prominent topic of discussion surrounding cases of violence against women. It is way more convenient to talk about religion, rather than rape culture. Talking about the latter would mean the men have to come to terms with the fact that Indian society hates women, and that misogyny is real, and that we do, in fact, need feminism. This ties into the on-going Maldives situation. The views expressed by the Maldivian Officials are of course blatantly racist and should be condemned, but we cannot ignore that there is reason those views exist at all. The image most people outside of our county have of Indian men is smelly, dirty perverts, and although racism plays a huge role in that, there is absolutely nothing about Indian men that can redeem that image. When the very real aspect of Indian men being bat-shit perverts already exists, it becomes really easy to add a few more bad attributes with that. The current state of our discourse on misogyny is really hopeless. I really do not think we are ever going to enlighten beyond this, at least on a scale that will have any impact. Please remember that the video of the CNN reporter is simply the one that was fortunate enough to be documented. There are thousands upon thousands of women in India that have gone through or will go through through that exact situation without a camera present. It is simply what India is.",
    "light_cleaned_comments": "A thread under that video I linked. Showcases the point I'm trying to make. What are you trying to prove? Everybody here already accepts that there are fucked up parts of our culture which need to go. >The views expressed by the Maldivian Officials are of course blatantly racist and should be condemned, but we cannot ignore that there is reason those views exist at all. The image most people outside of our county have of Indian men is smelly, dirty perverts, and although racism plays a huge role in that, there is absolutely nothing about Indian men that can redeem that image. What the absolute fuck?"
}