{
    "id": "18kuyds",
    "title": "Chor (Thief) Company - NoBroker",
    "url": "https://v.redd.it/u20g95al0y6c1",
    "selftext": "🚨 #ScamAlert ⚠️ : These guys are the absolute worst! Holding my money for a Movers and Packers job that was supposed to have been done and dusted like a *week* ago? Seriously? \n\nNoBroker are such con artists. When it’s about getting the money, they’d not only pick-up calls, they’ll CHASE you on your phone. But somehow, their staff *vanishes* when it comes to actually serving what you paid for, and when it comes to refunds/customer support. \n\nI seriously don’t understand how is this company still a legal entity after all the complaints all over the internet. \n\nAnyway, paid Rs. 12k to Agarwal Packers & Movers Ltd. Expensive, but, worth it. Such a smooth experience. \n\nI’m not sure whether am I even getting my money back from NoBroker tho…what a shame. ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1702857157.0,
    "convurl": "https://external-preview.redd.it/MmphZjI3dmsweTZjMdz78TnyY-VnzY887WOhiYVSfzDRV2W3kl3d7iguRt7W.png?format=pjpg&auto=webp&s=12550b66368a7ebb26833cc79ff9fd62d9750b31",
    "comments": [],
    "cleaned_text": "chor thief company nobroker scamalert guys absolute worst holding money movers packers job supposed done dusted like week ago seriously nobroker con artists getting money theyd pickup calls theyll chase phone somehow staff vanishes comes actually serving paid comes refundscustomer support seriously dont understand company still legal entity complaints internet anyway paid rs k agarwal packers movers ltd expensive worth smooth experience im sure whether even getting money back nobroker thowhat shame ",
    "cleaned_title": "chor thief company nobroker",
    "cleaned_selftext": "scamalert guys absolute worst holding money movers packers job supposed done dusted like week ago seriously nobroker con artists getting money theyd pickup calls theyll chase phone somehow staff vanishes comes actually serving paid comes refundscustomer support seriously dont understand company still legal entity complaints internet anyway paid rs k agarwal packers movers ltd expensive worth smooth experience im sure whether even getting money back nobroker thowhat shame",
    "cleaned_comments": "",
    "light_cleaned_title": "Chor (Thief) Company - NoBroker",
    "light_cleaned_selftext": "🚨 #ScamAlert ⚠️ : These guys are the absolute worst! Holding my money for a Movers and Packers job that was supposed to have been done and dusted like a *week* ago? Seriously? NoBroker are such con artists. When it’s about getting the money, they’d not only pick-up calls, they’ll CHASE you on your phone. But somehow, their staff *vanishes* when it comes to actually serving what you paid for, and when it comes to refunds/customer support. I seriously don’t understand how is this company still a legal entity after all the complaints all over the internet. Anyway, paid Rs. 12k to Agarwal Packers & Movers Ltd. Expensive, but, worth it. Such a smooth experience. I’m not sure whether am I even getting my money back from NoBroker tho…what a shame.",
    "light_cleaned_comments": ""
}