{
    "id": "137il80",
    "title": "Count of seats in Lok Sabha if 2021 census (which is yet to happen) is used for delimitation proposed for 2026",
    "url": "https://i.redd.it/zar58wwbjuxa1.jpg",
    "selftext": "[Read more about it here](https://carnegieendowment.org/2019/03/14/india-s-emerging-crisis-of-representation-pub-78588)",
    "flair": "Politics",
    "score": 79,
    "num_comments": 26,
    "created_utc": 1683201867.0,
    "convurl": "https://i.redd.it/zar58wwbjuxa1.jpg",
    "comments": [
        "Let's adopt an electoral college /s\n\nBut seriously, what is the use of representing this data by states if we all end up as Hindi speaking orange robed people anyway?",
        "25% of the seats from UP and Bihar!",
        "States that controlled population shall get less representation.\nWell done. This is called New India.",
        "Look at seat share of southern states",
        "This would not be an issue if States and especially cities and towns had more autonomy in collecting revenue and providing services.  \n\nBut that is not the case and everything is centralized and this outsized representation leads to resentment.  🙄",
        "|State                                   |Current Seats|Percentage|Proposed Seats|Percentage|Difference|\n|----------------------------------------|-------------|----------|--------------|----------|----------|\n|Uttar Pradesh                           |80           |14.73     |143           |16.9      |2.17      |\n|Bihar                                   |40           |7.37      |79            |9.34      |1.97      |\n|Rajasthan                               |25           |4.6       |50            |5.91      |1.31      |\n|Madhya Pradesh                          |29           |5.34      |52            |6.15      |0.81      |\n|Gujarat                                 |26           |4.79      |43            |5.08      |0.29      |\n|Haryana                                 |10           |1.84      |18            |2.13      |0.29      |\n|Jharkhand                               |14           |2.58      |24            |2.84      |0.26      |\n|Chhatisgarh                             |11           |2.03      |19            |2.25      |0.22      |\n|Maharashtra                             |48           |8.84      |76            |8.98      |0.14      |\n|Delhi                                   |7            |1.29      |12            |1.42      |0.13      |\n|Dadra and Nagar Haveli and Daman and Diu|1            |0.18      |2             |0.24      |0.06      |\n|Jammu and Kashmir                       |5            |0.92      |8             |0.95      |0.03      |\n|Mizoram                                 |1            |0.18      |1             |0.12      |-0.06     |\n|Nagaland                                |1            |0.18      |1             |0.12      |-0.06     |\n|Sikkim                                  |1            |0.18      |1             |0.12      |-0.06     |\n|Andaman& Nicobar Islands                |1            |0.18      |1             |0.12      |-0.06     |\n|Chandigarh                              |1            |0.18      |1             |0.12      |-0.06     |\n|Ladakh                                  |1            |0.18      |1             |0.12      |-0.06     |\n|Lakshadweep                             |1            |0.18      |1             |0.12      |-0.06     |\n|Puducherry                              |1            |0.18      |1             |0.12      |-0.06     |\n|Uttarakhand                             |5            |0.92      |7             |0.83      |-0.09     |\n|Assam                                   |14           |2.58      |21            |2.48      |-0.1      |\n|Arunachal Pradesh                       |2            |0.37      |2             |0.24      |-0.13     |\n|Goa                                     |2            |0.37      |2             |0.24      |-0.13     |\n|Manipur                                 |2            |0.37      |2             |0.24      |-0.13     |\n|Meghalaya                               |2            |0.37      |2             |0.24      |-0.13     |\n|Tripura                                 |2            |0.37      |2             |0.24      |-0.13     |\n|Punjab                                  |13           |2.39      |18            |2.13      |-0.26     |\n|Himachal Pradesh                        |4            |0.74      |4             |0.47      |-0.27     |\n|Karnataka                               |28           |5.16      |41            |4.85      |-0.31     |\n|Odisha                                  |21           |3.87      |28            |3.31      |-0.56     |\n|West Bengal                             |42           |7.73      |60            |7.09      |-0.64     |\n|Kerala                                  |20           |3.68      |20            |2.36      |-1.32     |\n|Andhra Pradesh + Telengana              |42           |7.73      |54            |6.38      |-1.35     |\n|Tamil Nadu                              |39           |7.18      |49            |5.79      |-1.39     |\n\n\nAs you can see, only the cow belt states gain with this formula. Every other state loses.",
        "Population control was the exact reason they put a paise on delimitation in the first place. Southern states succeeded, northern didn't",
        "What's the alternative? the USA has electrol college & it's also a different kind of problem.",
        "This was the plan all along. Establish majority in cow belt, build a new parliament and then dig in. US style without deep autonomy for states and Chinese style autocracy without any development, efficiently, industries or anything. Worse of all the worlds in one country.",
        "The delimitation won't happen in 2026. It will just be based on the first census that takes place after 2026. So, most likely the 2031 census.     \nUnless of course the 2021 census is further delayed by 3 years.",
        "South should fucking revolt. Wtf",
        "India being governed by corrupt and uneducated people would ruin this country."
    ],
    "cleaned_text": "count seats lok sabha census yet happen used delimitation proposed read herehttpscarnegieendowmentorgindiasemergingcrisisofrepresentationpub ",
    "cleaned_title": "count seats lok sabha census yet happen used delimitation proposed",
    "cleaned_selftext": "read herehttpscarnegieendowmentorgindiasemergingcrisisofrepresentationpub",
    "cleaned_comments": "lets adopt electoral college seriously use representing data states end hindi speaking orange robed people anyway seats bihar states controlled population shall get less representation well done called new india look seat share southern states would issue states especially cities towns autonomy collecting revenue providing services case everything centralized outsized representation leads resentment state current seatspercentageproposed seatspercentagedifference uttar pradesh bihar rajasthan madhya pradesh gujarat haryana jharkhand chhatisgarh maharashtra delhi dadra nagar haveli daman diu jammu kashmir mizoram nagaland sikkim andaman nicobar islands chandigarh ladakh lakshadweep puducherry uttarakhand assam arunachal pradesh goa manipur meghalaya tripura punjab himachal pradesh karnataka odisha west bengal kerala andhra pradesh telengana tamil nadu see cow belt states gain formula every state loses population control exact reason put paise delimitation first place southern states succeeded northern didnt whats alternative usa electrol college also different kind problem plan along establish majority cow belt build new parliament dig us style without deep autonomy states chinese style autocracy without development efficiently industries anything worse worlds one country delimitation wont happen based first census takes place likely census unless course census delayed years south fucking revolt wtf india governed corrupt uneducated people would ruin country",
    "light_cleaned_title": "Count of seats in Lok Sabha if 2021 census (which is yet to happen) is used for delimitation proposed for 2026",
    "light_cleaned_selftext": "[Read more about it here](https://carnegieendowment.org/2019/03/14/india-s-emerging-crisis-of-representation-pub-78588)",
    "light_cleaned_comments": "Let's adopt an electoral college /s But seriously, what is the use of representing this data by states if we all end up as Hindi speaking orange robed people anyway? 25% of the seats from UP and Bihar! States that controlled population shall get less representation. Well done. This is called New India. Look at seat share of southern states This would not be an issue if States and especially cities and towns had more autonomy in collecting revenue and providing services. But that is not the case and everything is centralized and this outsized representation leads to resentment. 🙄 |State |Current Seats|Percentage|Proposed Seats|Percentage|Difference| |----------------------------------------|-------------|----------|--------------|----------|----------| |Uttar Pradesh |80 |14.73 |143 |16.9 |2.17 | |Bihar |40 |7.37 |79 |9.34 |1.97 | |Rajasthan |25 |4.6 |50 |5.91 |1.31 | |Madhya Pradesh |29 |5.34 |52 |6.15 |0.81 | |Gujarat |26 |4.79 |43 |5.08 |0.29 | |Haryana |10 |1.84 |18 |2.13 |0.29 | |Jharkhand |14 |2.58 |24 |2.84 |0.26 | |Chhatisgarh |11 |2.03 |19 |2.25 |0.22 | |Maharashtra |48 |8.84 |76 |8.98 |0.14 | |Delhi |7 |1.29 |12 |1.42 |0.13 | |Dadra and Nagar Haveli and Daman and Diu|1 |0.18 |2 |0.24 |0.06 | |Jammu and Kashmir |5 |0.92 |8 |0.95 |0.03 | |Mizoram |1 |0.18 |1 |0.12 |-0.06 | |Nagaland |1 |0.18 |1 |0.12 |-0.06 | |Sikkim |1 |0.18 |1 |0.12 |-0.06 | |Andaman& Nicobar Islands |1 |0.18 |1 |0.12 |-0.06 | |Chandigarh |1 |0.18 |1 |0.12 |-0.06 | |Ladakh |1 |0.18 |1 |0.12 |-0.06 | |Lakshadweep |1 |0.18 |1 |0.12 |-0.06 | |Puducherry |1 |0.18 |1 |0.12 |-0.06 | |Uttarakhand |5 |0.92 |7 |0.83 |-0.09 | |Assam |14 |2.58 |21 |2.48 |-0.1 | |Arunachal Pradesh |2 |0.37 |2 |0.24 |-0.13 | |Goa |2 |0.37 |2 |0.24 |-0.13 | |Manipur |2 |0.37 |2 |0.24 |-0.13 | |Meghalaya |2 |0.37 |2 |0.24 |-0.13 | |Tripura |2 |0.37 |2 |0.24 |-0.13 | |Punjab |13 |2.39 |18 |2.13 |-0.26 | |Himachal Pradesh |4 |0.74 |4 |0.47 |-0.27 | |Karnataka |28 |5.16 |41 |4.85 |-0.31 | |Odisha |21 |3.87 |28 |3.31 |-0.56 | |West Bengal |42 |7.73 |60 |7.09 |-0.64 | |Kerala |20 |3.68 |20 |2.36 |-1.32 | |Andhra Pradesh + Telengana |42 |7.73 |54 |6.38 |-1.35 | |Tamil Nadu |39 |7.18 |49 |5.79 |-1.39 | As you can see, only the cow belt states gain with this formula. Every other state loses. Population control was the exact reason they put a paise on delimitation in the first place. Southern states succeeded, northern didn't What's the alternative? the USA has electrol college & it's also a different kind of problem. This was the plan all along. Establish majority in cow belt, build a new parliament and then dig in. US style without deep autonomy for states and Chinese style autocracy without any development, efficiently, industries or anything. Worse of all the worlds in one country. The delimitation won't happen in 2026. It will just be based on the first census that takes place after 2026. So, most likely the 2031 census. Unless of course the 2021 census is further delayed by 3 years. South should fucking revolt. Wtf India being governed by corrupt and uneducated people would ruin this country."
}