{
    "id": "1fnfnwc",
    "title": "Traffic Cops Exploitation!!",
    "url": "https://www.reddit.com/gallery/1fnfnwc",
    "selftext": "This incident occurred near Indiranagar, Bangalore. I had stopped my scooter on the side of the road to check directions, and a traffic police officer approached me, claiming that I was using my phone while the ignition was on. I explained to him that I had halted to navigate and was not using my phone while driving, but he refused to listen and told me the fine would be ₹1500.\n\nWhen I requested him to be considerate, as I had just come from a hospital, he asked how much cash I had on me. Since I didn’t have any cash, he directed me to the nearest ATM and made me withdraw money.",
    "flair": "Law & Courts",
    "score": 70,
    "num_comments": 8,
    "created_utc": 1727080358.0,
    "convurl": "https://i.redd.it/en7b8njlsiqd1.jpg",
    "comments": [
        "Only accepting a bribe should be a crime. So that more such incidents come forward.",
        "Put it on Twitter and tag Bangalore Police",
        "Do it, op and then share link here",
        "Why do Indians call police officers Sir or Madam. Why such undeserved respect.\n\nWhy not address them by name and rank.",
        "Inn suaro ki zamir mar chuki hai. \nGhus lene mei ye log ek laash ko bhi na chhode.",
        "Bhai post it on twitter and tag bangalore police whats the point of posting on reddit",
        "Yes, post it OP. We'll have this corrupt hooligan suspended. \n\nImagine how many people he scares in a day and extorts money in this manner. \n\nLet's do the math.\n\nAvg People threatened in a day: 20\nAvg success rate: 30%\nAvg extortion amount: Rs 700\nAvg patrol days in a year: 260\nTotal extortion income: Rs 10,92,000\n\nNo tax on this income. This is how much one cop can potentially make in a year. This too is a very conservative estimate. Indian police is the biggest organised mafia in the world.",
        "What if the other guy pressurises a govt employee to take a bribe in order to cut corners? The laws are there for a reason.",
        "I didn't post it on twitter. IDK why, but it did not feel right & I felt a little frightened doing that honestly!"
    ],
    "cleaned_text": "traffic cops exploitation incident occurred near indiranagar bangalore stopped scooter side road check directions traffic police officer approached claiming using phone ignition explained halted navigate using phone driving refused listen told fine would requested considerate come hospital asked much cash since didnt cash directed nearest atm made withdraw money ",
    "cleaned_title": "traffic cops exploitation",
    "cleaned_selftext": "incident occurred near indiranagar bangalore stopped scooter side road check directions traffic police officer approached claiming using phone ignition explained halted navigate using phone driving refused listen told fine would requested considerate come hospital asked much cash since didnt cash directed nearest atm made withdraw money",
    "cleaned_comments": "accepting bribe crime incidents come forward put twitter tag bangalore police op share link indians call police officers sir madam undeserved respect address name rank inn suaro ki zamir mar chuki hai ghus lene mei ye log ek laash ko bhi na chhode bhai post twitter tag bangalore police whats point posting reddit yes post op well corrupt hooligan suspended imagine many people scares day extorts money manner lets math avg people threatened day avg success rate avg extortion amount rs avg patrol days year total extortion income rs tax income much one cop potentially make year conservative estimate indian police biggest organised mafia world guy pressurises govt employee take bribe order cut corners laws reason didnt post twitter idk feel right felt little frightened honestly",
    "light_cleaned_title": "Traffic Cops Exploitation!!",
    "light_cleaned_selftext": "This incident occurred near Indiranagar, Bangalore. I had stopped my scooter on the side of the road to check directions, and a traffic police officer approached me, claiming that I was using my phone while the ignition was on. I explained to him that I had halted to navigate and was not using my phone while driving, but he refused to listen and told me the fine would be ₹1500. When I requested him to be considerate, as I had just come from a hospital, he asked how much cash I had on me. Since I didn’t have any cash, he directed me to the nearest ATM and made me withdraw money.",
    "light_cleaned_comments": "Only accepting a bribe should be a crime. So that more such incidents come forward. Put it on Twitter and tag Bangalore Police Do it, op and then share link here Why do Indians call police officers Sir or Madam. Why such undeserved respect. Why not address them by name and rank. Inn suaro ki zamir mar chuki hai. Ghus lene mei ye log ek laash ko bhi na chhode. Bhai post it on twitter and tag bangalore police whats the point of posting on reddit Yes, post it OP. We'll have this corrupt hooligan suspended. Imagine how many people he scares in a day and extorts money in this manner. Let's do the math. Avg People threatened in a day: 20 Avg success rate: 30% Avg extortion amount: Rs 700 Avg patrol days in a year: 260 Total extortion income: Rs 10,92,000 No tax on this income. This is how much one cop can potentially make in a year. This too is a very conservative estimate. Indian police is the biggest organised mafia in the world. What if the other guy pressurises a govt employee to take a bribe in order to cut corners? The laws are there for a reason. I didn't post it on twitter. IDK why, but it did not feel right & I felt a little frightened doing that honestly!"
}