{
    "id": "13o0tb2",
    "title": "Why are cheap \"box fans\" not available in India?",
    "url": "https://www.reddit.com/r/india/comments/13o0tb2/why_are_cheap_box_fans_not_available_in_india/",
    "selftext": "I was very fortunate to go to college in the USA some years ago, and I was able to buy a [box fan](https://m.media-amazon.com/images/I/91pV7sNnEsS.jpg) - a simple fan in a metal/plastic cage - that moves significantly more air in a better form-factor than a [tower fan](https://www.jiomart.com/images/product/original/rvijymcfvn/blueberry-s-140-watts-high-speed-tower-fan-25-ft-air-delivery-4-way-air-flow-btf1106-product-images-orvijymcfvn-p591298700-0-202211281757.jpg) and far more portable than a [pedestal fan](https://www.ubuy.co.in/productimg/?image=aHR0cHM6Ly9pbWFnZXMtY2RuLnVidXkuY28uaW4vNjMzYjIzYjE4ZDMxOTA2MGQ1M2EzNDg0LXRvcm5hZG8tMjAtaW5jaC1oZWF2eS1kdXR5LWluZHVzdHJpYWwuanBn.jpg).\n\nThe cost in the US was barely 2k-3k INR - trying to buy a legitimate \"box fan\" design online, I'm seeing some listings for over 10k INR as though they're imported. And all the affordable 'box fans' are tiny round table-top models that really don't move much air.\n\nWhy is nobody making this in India? Literally a bit of sheet metal, plastic, and a fan motor.\n\nEDIT: this also came to mind after reading about the [Corsi-Rosenthal box](https://en.wikipedia.org/wiki/Corsi%E2%80%93Rosenthal_Box) which is an almost industrial-grade air filter that can be built very affordably using a box fan, and no other fan design is suited for it.",
    "flair": "AskIndia",
    "score": 34,
    "num_comments": 25,
    "created_utc": 1684689955.0,
    "convurl": "https://external-preview.redd.it/9u08WSZ92P2YjoRxglSHlFsDN3LJusHl5QF7XLqIvO8.jpg?auto=webp&v=enabled&s=79859c0fedea090a9f90744cadb9e7f6a0d8d26a",
    "comments": [
        "Never thought about this lol.",
        "\"Navrtatan powder, duniya ka sabse chota AC \"",
        "The fan mafia in India is very strong.. especially in Uttar Pradesh\n\nThey quickly take care of anyone selling box fans on their turf",
        "So true. I was trying to build an air purifier but these damn box fans are way too expensive. It'd be way cheaper to just buy the purifier.",
        "We can start selling these fans if you want to",
        "I noticed it too. This is weird because Indian companies make a lot of kitchen or bathroom exhaust fans of similar dimensions and prices. They just need to remove the mount frames and put it a grill box.",
        "While we don't have the exact same fans or filters for a proper Corsi-Rosenthal box, you can make something similar for around 2k:\n\nhttps://preview.redd.it/0vktels5jb1b1.jpeg?width=1560&format=pjpg&auto=webp&v=enabled&s=332a0e01ad7b1f16dabccc2355cfd481a09db042\n\nThat's two fridge/washing machine stands (Rs 350 each) where one of them is flipped and their feet are connected to each other with four tubes made out of cardboard. Bottom and top are closed off with more cardboard and a 250mm exhaust (Rs 1300) is installed in the top.\n\nFilter material is two overlapping disposable bedsheets (Rs 10 each) and needs to be changed every two to three days in a tier one city.\n\nOf course, there's plenty of refinement possible in this design, like using agriculture 4\" pipe instead of cardboard tubes, and mdf instead of cardboard sheets.",
        "The sheets trap enough dust to discolour pretty significantly so you know when it's time to change them out:\n\nhttps://preview.redd.it/m586igjkkb1b1.jpeg?width=1560&format=pjpg&auto=webp&v=enabled&s=68f236a335563aee6faa1c3aae1d4de3910330ce",
        "Remember using this in my non-ac dorm by placing in front of a window . Saved me during the summer heat.",
        "I’ve also been looking for one so I can hook\nIt up to a window and let it pull or push air during summers. Haven’t found any yet",
        "Are you sure? I got a box fan from a local electric store for 1800 last summer. It is obviously non-branded but works very well.",
        "I think it's because maybe ceiling fans are more common in India and are the main source of ventilation, so portable fans was never innovated on too much maybe.  \nI know ceiling fans are there in some parts of US too, but many parts are too cold and don't need it.",
        "Please tell us more.",
        "We have had table and pedestal fans for decades now, probably why box fans didn't sell here.",
        "Why not use just an exhaust fan? Is that too small?",
        "Is this for real or /s?",
        "Interesting. I may look into this.\n\nBut to be clear, this is still poor quality because the small size of exhaust fans moves a piss-poor amount of air compared to those US retail-store box fans. Perhaps a larger kitchen exhaust fan is what I would try to use. And if I could find something more 'filtering' than bedsheets.",
        "I don't know; I haven't seen any here in Goa and searching on Google turns up unsatisfactory results. Feel free to enlighten me!",
        "Ceiling fans in US are also engineered to run slower overall, along with the lower 120V mains voltage; generally, whole-house residential HVAC is also very common compared to residences in India, meaning fans in general are less necessary.\n\nIn colder months/climates, US ceiling fans have a switch to run in reverse, pulling air upwards to allow for better spread of heating. That is never seen in most of India since it never gets that cold to require heating.",
        "Could be.",
        "The exhaust fans used in toilets have tiny blades with a relatively massive hub. They move a fraction of the air that a box fan does.\n\nFor reference, try standing in front of a small pedestal fan at full speed vs under a ceiling fan at even half-speed. The difference is significant.",
        "It's really real /s",
        "I’m still seeing this too. We should make this more common in India. Especially the top floor of the house gets way too hot in summer and the ceiling fans keep circulating hot air around the room. And I agree box fans are really good"
    ],
    "cleaned_text": "cheap box fans available india fortunate go college usa years ago able buy box fanhttpsmmediaamazoncomimagesipvsnnessjpg simple fan metalplastic cage moves significantly air better formfactor tower fanhttpswwwjiomartcomimagesproductoriginalrvijymcfvnblueberryswattshighspeedtowerfanftairdeliverywayairflowbtfproductimagesorvijymcfvnpjpg far portable pedestal fanhttpswwwubuycoinproductimgimageahrchmlypbwfnzxmtyrulnvidxkuyuawvnjmzyjizyjezdmxotamgqmezndglxrvcmhzgtmjatawjacozwfeskdxrlwluzhvzdhjpywwuanbnjpg cost us barely kk inr trying buy legitimate box fan design online im seeing listings k inr though theyre imported affordable box fans tiny round tabletop models really dont move much air nobody making india literally bit sheet metal plastic fan motor edit also came mind reading corsirosenthal boxhttpsenwikipediaorgwikicorsierosenthalbox almost industrialgrade air filter built affordably using box fan fan design suited ",
    "cleaned_title": "cheap box fans available india",
    "cleaned_selftext": "fortunate go college usa years ago able buy box fanhttpsmmediaamazoncomimagesipvsnnessjpg simple fan metalplastic cage moves significantly air better formfactor tower fanhttpswwwjiomartcomimagesproductoriginalrvijymcfvnblueberryswattshighspeedtowerfanftairdeliverywayairflowbtfproductimagesorvijymcfvnpjpg far portable pedestal fanhttpswwwubuycoinproductimgimageahrchmlypbwfnzxmtyrulnvidxkuyuawvnjmzyjizyjezdmxotamgqmezndglxrvcmhzgtmjatawjacozwfeskdxrlwluzhvzdhjpywwuanbnjpg cost us barely kk inr trying buy legitimate box fan design online im seeing listings k inr though theyre imported affordable box fans tiny round tabletop models really dont move much air nobody making india literally bit sheet metal plastic fan motor edit also came mind reading corsirosenthal boxhttpsenwikipediaorgwikicorsierosenthalbox almost industrialgrade air filter built affordably using box fan fan design suited",
    "cleaned_comments": "never thought lol navrtatan powder duniya ka sabse chota ac fan mafia india strong especially uttar pradesh quickly take care anyone selling box fans turf true trying build air purifier damn box fans way expensive itd way cheaper buy purifier start selling fans want noticed weird indian companies make lot kitchen bathroom exhaust fans similar dimensions prices need remove mount frames put grill box dont exact fans filters proper corsirosenthal box make something similar around k thats two fridgewashing machine stands rs one flipped feet connected four tubes made cardboard bottom top closed cardboard mm exhaust rs installed top filter material two overlapping disposable bedsheets rs needs changed every two three days tier one city course theres plenty refinement possible design like using agriculture pipe instead cardboard tubes mdf instead cardboard sheets sheets trap enough dust discolour pretty significantly know time change remember using nonac dorm placing front window saved summer heat ive also looking one hook window let pull push air summers havent found yet sure got box fan local electric store last summer obviously nonbranded works well think maybe ceiling fans common india main source ventilation portable fans never innovated much maybe know ceiling fans parts us many parts cold dont need please tell us table pedestal fans decades probably box fans didnt sell use exhaust fan small real interesting may look clear still poor quality small size exhaust fans moves pisspoor amount air compared us retailstore box fans perhaps larger kitchen exhaust fan would try use could find something filtering bedsheets dont know havent seen goa searching google turns unsatisfactory results feel free enlighten ceiling fans us also engineered run slower overall along lower v mains voltage generally wholehouse residential hvac also common compared residences india meaning fans general less necessary colder monthsclimates us ceiling fans switch run reverse pulling air upwards allow better spread heating never seen india since never gets cold require heating could exhaust fans used toilets tiny blades relatively massive hub move fraction air box fan reference try standing front small pedestal fan full speed vs ceiling fan even halfspeed difference significant really real im still seeing make common india especially top floor house gets way hot summer ceiling fans keep circulating hot air around room agree box fans really good",
    "light_cleaned_title": "Why are cheap \"box fans\" not available in India?",
    "light_cleaned_selftext": "I was very fortunate to go to college in the USA some years ago, and I was able to buy a [box fan](https://m.media-amazon.com/images/I/91pV7sNnEsS.jpg) - a simple fan in a metal/plastic cage - that moves significantly more air in a better form-factor than a [tower fan](https://www.jiomart.com/images/product/original/rvijymcfvn/blueberry-s-140-watts-high-speed-tower-fan-25-ft-air-delivery-4-way-air-flow-btf1106-product-images-orvijymcfvn-p591298700-0-202211281757.jpg) and far more portable than a [pedestal fan](https://www.ubuy.co.in/productimg/?image=aHR0cHM6Ly9pbWFnZXMtY2RuLnVidXkuY28uaW4vNjMzYjIzYjE4ZDMxOTA2MGQ1M2EzNDg0LXRvcm5hZG8tMjAtaW5jaC1oZWF2eS1kdXR5LWluZHVzdHJpYWwuanBn.jpg). The cost in the US was barely 2k-3k INR - trying to buy a legitimate \"box fan\" design online, I'm seeing some listings for over 10k INR as though they're imported. And all the affordable 'box fans' are tiny round table-top models that really don't move much air. Why is nobody making this in India? Literally a bit of sheet metal, plastic, and a fan motor. EDIT: this also came to mind after reading about the [Corsi-Rosenthal box](https://en.wikipedia.org/wiki/Corsi%E2%80%93Rosenthal_Box) which is an almost industrial-grade air filter that can be built very affordably using a box fan, and no other fan design is suited for it.",
    "light_cleaned_comments": "Never thought about this lol. \"Navrtatan powder, duniya ka sabse chota AC \" The fan mafia in India is very strong.. especially in Uttar Pradesh They quickly take care of anyone selling box fans on their turf So true. I was trying to build an air purifier but these damn box fans are way too expensive. It'd be way cheaper to just buy the purifier. We can start selling these fans if you want to I noticed it too. This is weird because Indian companies make a lot of kitchen or bathroom exhaust fans of similar dimensions and prices. They just need to remove the mount frames and put it a grill box. While we don't have the exact same fans or filters for a proper Corsi-Rosenthal box, you can make something similar for around 2k: That's two fridge/washing machine stands (Rs 350 each) where one of them is flipped and their feet are connected to each other with four tubes made out of cardboard. Bottom and top are closed off with more cardboard and a 250mm exhaust (Rs 1300) is installed in the top. Filter material is two overlapping disposable bedsheets (Rs 10 each) and needs to be changed every two to three days in a tier one city. Of course, there's plenty of refinement possible in this design, like using agriculture 4\" pipe instead of cardboard tubes, and mdf instead of cardboard sheets. The sheets trap enough dust to discolour pretty significantly so you know when it's time to change them out: Remember using this in my non-ac dorm by placing in front of a window . Saved me during the summer heat. I’ve also been looking for one so I can hook It up to a window and let it pull or push air during summers. Haven’t found any yet Are you sure? I got a box fan from a local electric store for 1800 last summer. It is obviously non-branded but works very well. I think it's because maybe ceiling fans are more common in India and are the main source of ventilation, so portable fans was never innovated on too much maybe. I know ceiling fans are there in some parts of US too, but many parts are too cold and don't need it. Please tell us more. We have had table and pedestal fans for decades now, probably why box fans didn't sell here. Why not use just an exhaust fan? Is that too small? Is this for real or /s? Interesting. I may look into this. But to be clear, this is still poor quality because the small size of exhaust fans moves a piss-poor amount of air compared to those US retail-store box fans. Perhaps a larger kitchen exhaust fan is what I would try to use. And if I could find something more 'filtering' than bedsheets. I don't know; I haven't seen any here in Goa and searching on Google turns up unsatisfactory results. Feel free to enlighten me! Ceiling fans in US are also engineered to run slower overall, along with the lower 120V mains voltage; generally, whole-house residential HVAC is also very common compared to residences in India, meaning fans in general are less necessary. In colder months/climates, US ceiling fans have a switch to run in reverse, pulling air upwards to allow for better spread of heating. That is never seen in most of India since it never gets that cold to require heating. Could be. The exhaust fans used in toilets have tiny blades with a relatively massive hub. They move a fraction of the air that a box fan does. For reference, try standing in front of a small pedestal fan at full speed vs under a ceiling fan at even half-speed. The difference is significant. It's really real /s I’m still seeing this too. We should make this more common in India. Especially the top floor of the house gets way too hot in summer and the ceiling fans keep circulating hot air around the room. And I agree box fans are really good"
}