{
    "id": "141dlsl",
    "title": "Has anyone seen this video of a HDFC Bank manager abusing his employees for not meeting sales targets ?",
    "url": "https://www.reddit.com/r/india/comments/141dlsl/has_anyone_seen_this_video_of_a_hdfc_bank_manager/",
    "selftext": "https://in.mashable.com/culture/53970/hdfc-senior-vp-caught-abusing-employees-in-viral-video-sparks-linkedin-debate-on-toxic-work-culture\n\nThis article has the video. This is very common in corporate India. You will find such behaviour common everywhere, in Banking, Insurance, Healthcare (hospitals), and education.\n\nWhat is most concerning is such a situation in Banks and Hospitals, if employees are pressured then they will sell bad financial products to customers, the 2008 financial crisis happened because of sales people being pressured to push shaddy loans on to unsuspecting people, this led to loan defaults, which in turn led to a real estate crisis. \n\nIt also leads to questions such as:\n\n1) Will the bank be still profitable if such loans aren't pushed ? \n\n2) If the question to the above is No. Then the situation of our economy is grim. \n\nI'm surprised to see such behaviour by HDFC, I thought their growth was organic and not like this. It raises serious concern for me as an investor.\n\nEdit: I think the man in the video Pushpal Roy is. Chartered Accountant. What use is a CA degree if in the end you have to do sales and meet targets.",
    "flair": "AskIndia",
    "score": 156,
    "num_comments": 70,
    "created_utc": 1685969562.0,
    "convurl": "https://external-preview.redd.it/mX7pTEdKOobMgE1JmYRnnwOmIULRmQYsmiZz6hJUNVo.jpg?auto=webp&v=enabled&s=76a0f8f147e962f685640ed881a83f4f654fcfda",
    "comments": [
        "I think you should put a trigger warning. \n\nI saw it this morning and haven't been feeling well since.",
        "Wait till you see SBI meetings. Full on maa behen.",
        "Isn't it the norm in all banks? Most people I know that work in banks don't try to get to scale 2 due to things like this. All the abuse from the senior VP or higher trickles down and reaches the branch manager level.",
        "ha ha ha ha...john's my ex manager.",
        "I'm not surprised. Where is the Maa Behen when customers are not treated well or when big shots become NPAs. The biggest NPAs are not even known to people.",
        "How do bankers say “Fuck You”? \nAns: Trust Me.",
        "Same senariao across all private  banks. My wife with Kotak Bank she is at bank 9.30 in morning. They have a conference call 9pm in the evening.  She operation manage there isn't any Sales in her KRA still everyday they pressure for Insurance.",
        "Isi wajah se mai har bar policy kharid leta hu",
        "I'm not defending this. But it's waaaay too common in the banking sector.",
        "How so... that's bad.\nMy bro is at another bank but at senior level.. manages 16 branches. Never in his 18 year career has he faced this.\n\nUr wife should change",
        "Indians can be very rude. It becomes very clear when you live in Europe or the States",
        "This is just the reality of every sales job in India. It sucks. It gives us salespeople nightmares sometimes. I used to have trouble sleeping during my first sales job right out of college.\n\nWhen we tell this to our friends or family, they ask us to listen to it and forget. But its really not that easy. One time my manager was shouting at me over the phone while my parents were in the car with me. I had to sternly tell him to relax cos I didn't want my parents hearing the abuse I go through on a daily basis.\n\nWe have to be really tough to endure through this abuse. The only way to not get abused like this is to do our numbers. People then turn to unethical behaviour too - and I mean even this shouting and pressure is unethical.\n\nSales is not easy. We are abused every day like this. Multiple times a day even. The money is eventually really good. Like really really good. But to get there, you have to lose every spec of humanity you have in you.",
        "That's not healthy at all. Why not leave the job?",
        "Saw this video on LinkedIn today. It's Not only the banks, but It's also all over the industry.\n\nWith regards to the video at the Bank, I think Getting Accounts, Insurance is their Job but why Force them to do it. The bank needs to make itself Visible and get more Customers. Arrange Workshops and Get Customers. You can't Force a Bank Employee to get Customers by hook or crook. And Decency Comes First. You also Show Your Bank in the Bad light.",
        "This is very bad. The government must ban all soliciting sales in b2c space, especially for financial services. This kind of push sales are banned in many countries for good of customers.",
        "Because of ₹₹₹₹₹. But such ₹₹₹₹₹ never ends well.",
        "Tax saving investment scheme.",
        "Wasn't it supposed to be their lunch break?",
        "Yess..its very common",
        "Na bhai har baar mujhe SIP or insurance bech dete hai. Mai mana bhi bai kar pata.",
        "sales is a high pressure job.. the compensation is commensurate, sales in b2b are generally amongst the highest paid, people are willing to tolerate the downsides for the money involved. this is a global situation not  just limited to India",
        "There is no lunch \"break\" in India",
        "Indian corporates are full of maniacs.",
        "I agree, but in industries like banking and health care it leads to serious concerns. In banking such shaddy loans and products led to the 2008 financial crisis. If HDFC Bank has to push such sales to stay profitable, then what does it say about the health of our banking sector ? Will sale of such financial products be in the interest of the consumer ? \n\nI have seen similar things happening in private hospitals as well. Which is even more concerning.\n\nYou have also mentioned this in B2B roles, whereas this is B2C.",
        "banking has the most toxic sales culture, speaking from experience in investment banking, because they tend to engage in undifferentiated services/products.. theres a big tribal-hunter culture in financial services. if the sales isnt primed theres good chance that the opportunity will be lost to competitors, its a situation where youve got to be the first person to know about the opportunity, always switched-on and available, and the work culture can get toxic.\n\nthough i am aware that b2c sales doesnt pay as high as b2b but i believe they'd still be among the highest paid in the division",
        "True story: \n\nDGM of a PSU bank (NOT SBI) asked all the Chief Managers under him to either commit suicide or just retire if their branches couldn't achieve specific targets.",
        "Now that explains why Shalini from Bajaj Finance has been calling me twice a month for 7 months! I thought she liked me 😢",
        "This is same in all sales-driven companies especially Edtech startups.",
        "YES. My ex-manager told me stories about how he was at a DGM level meeting and the way DGM questioned the AGMs, some of them started crying and went into a breakdown. This bank was the reason I would have fights with my family, suffered financial damage, almost lost hope. I will never forgive this bank for breaking my heart (literally).\n\nAlso I had told them about security issues before leaving. One of their golden child branch was looted recently. Fuck the lunchtime bank.",
        "This is very common. Few months back a SBI officer from WB circle comitted suicide in the Bank. His wife has been fighting a legal battle but neither the management nor association has taken any accountability. Another similar case happened in NE circle.",
        "Worked in HDFC for good 7 years. What a great toxic environment. You can be dead by workload. Everyone is so agressive. It changed my personality. Always aggressive defensive mode.overall worst any one can experience.",
        "What did you do after HDFC, how is the work culture over there ?",
        "Shifted to another Bank , faced a lot of racism and nonsense. Looking for next option. Corporate jobs are real shit.",
        "hope he's fired, only then, some things will change",
        "Suspended as of now. Not even fired. The entire chain starting from this guy, going up should be probed. It is possible he see the same treatment from his seniors.",
        "Where are the labor or employee concerned communists? Can the state take strict action against this abuser and the organization for poor practice?",
        "Anyone ping the full video link ?",
        "Banking, health and education should be under government",
        "Thankfully I was never abused, I was shouted at i noped out in 7 months. Not gonna tolerate it. I'd rather be a pauper than get abused.",
        "Someone told me that in telecom zonal/area sales manager walk around with termination letter and a few firings is very common every week. They abuse their underlings and fire one or two to maintain the terror. Of course they themselves are bused by their seniors.",
        "Byjus.",
        "Does anyone have a link for the video with subtitles?",
        "Byjus, Vedantu, Unacademy, Shit Hat Junior- all of them",
        "All of them are like that. How many will you leave?\n\nI've already left 3 jobs cos of this kind of abusive behaviour.",
        "I didn't understand a word that Muppet was saying, some pls translate",
        "The damage that toxic work environments cause really needs to be highlighted. I work in the creative field and I once had the misfortune of working with an absolute terrorist. I used to be under constant stress and in terror as soon as I woke up. Everyone was made to feel bad for leaving on time. During covid, we were made to feel bad for working from home. It was so pathetic. It hampered my creativity so much I couldn't deliver on time, while I had been a star performer on every team before and after that job.\n\nI didn't even serve my notice period. Just emailed my resignation and noped out of there. It took me 6 months to recover. The mental stress caused by that job scared me from another. Only after 6 months of unemployment and a financial distress did I start looking for another job. The indian work culture needs to be seriously regulated.",
        "Guess it’s time to make a white collar union and fuck around with these guys!",
        "This is the condition in every bank including sarkari banks.",
        "You must be Akash from Dil Chahta Hai",
        "Work for 4 to 5 months in sales of insurance it was co related with HDFC somehow.\nThe culture is toxic.\nIt felt i was in army or something.\nConference rooms with booked just for abuses n stressful meeting/shouting.\n\nRIP",
        "Watching these, I'm glad to be in IT.",
        "boy have you not seen the videos and voice recordings of byju’s sales meeting so",
        "Watching this video and hearing all of you saying this is common, I'm glad I didn't end up working for banks.",
        "This is how a sales job is in most of India. Unfortunate truth.",
        "Lol. Koi byjus ka video dalo please.",
        "u/save video",
        "u/savevideo",
        "I know the pain. After the ING lot quit, Kotak has become a shithole.",
        "Looks like the bank will ban camera phones for employees soon",
        "Maybe then you should think of changing the job profile or the field itself. In the end, it's your satisfaction and happiness that matters. No point in being unhappy and mentally unsatisfied with large sums of money in hand.",
        "Sadly that seems to be true. I hope for a day when people will start looking beyond just earning money.",
        "Working on it chief. The only way out is through education. I'm working on it.",
        "Glad to know that 💪",
        "He was just shouting like \nTejasvi surya",
        "The guy shouting has never made a sale himself.",
        "And this is very normalised in everywhere.",
        "All banks will stop having zoom meetings.",
        "B2C aren't well paid.",
        "Why is the country surprised though? It's not just bfsi it's a same situation in every industry of the country. Does the country need viral videos to address the wrongdoings  \nFoul mouthing, naukarshahi is normalised phenomenon of this nation",
        "Non-Indian here.\n\nFrom my experience, it's only with other Indians though. I've seen Indians be incredibly rude and aggressive to other Indians, and be super pleasant with me. I always found it strange, I would think it would be the opposite.",
        "Bro ULIP policies are really bad. Please don't buy. Watch labor law advisor channel on youtube about ulip and insurance.",
        "Placed in HDFC at campus. You’re comment scares the shit out me now regretting my decisions. Still working in banking filed or?",
        "Yes working moved in multiple organisations. Only solution i found not stick for to long and always work on skills so you can move out easily.",
        "Thought working on environment /organisation can develop good bond to work easier. Do you mind sharing what role you are in ?!"
    ],
    "cleaned_text": "anyone seen video hdfc bank manager abusing employees meeting sales targets article video common corporate india find behaviour common everywhere banking insurance healthcare hospitals education concerning situation banks hospitals employees pressured sell bad financial products customers financial crisis happened sales people pressured push shaddy loans unsuspecting people led loan defaults turn led real estate crisis also leads questions bank still profitable loans arent pushed question situation economy grim im surprised see behaviour hdfc thought growth organic like raises serious concern investor edit think man video pushpal roy chartered accountant use ca degree end sales meet targets ",
    "cleaned_title": "anyone seen video hdfc bank manager abusing employees meeting sales targets",
    "cleaned_selftext": "article video common corporate india find behaviour common everywhere banking insurance healthcare hospitals education concerning situation banks hospitals employees pressured sell bad financial products customers financial crisis happened sales people pressured push shaddy loans unsuspecting people led loan defaults turn led real estate crisis also leads questions bank still profitable loans arent pushed question situation economy grim im surprised see behaviour hdfc thought growth organic like raises serious concern investor edit think man video pushpal roy chartered accountant use ca degree end sales meet targets",
    "cleaned_comments": "think put trigger warning saw morning havent feeling well since wait till see sbi meetings full maa behen isnt norm banks people know work banks dont try get scale due things like abuse senior vp higher trickles reaches branch manager level ha ha ha hajohns ex manager im surprised maa behen customers treated well big shots become npas biggest npas even known people bankers say fuck ans trust senariao across private banks wife kotak bank bank morning conference call pm evening operation manage isnt sales kra still everyday pressure insurance isi wajah se mai har bar policy kharid leta hu im defending waaaay common banking sector thats bad bro another bank senior level manages branches never year career faced ur wife change indians rude becomes clear live europe states reality every sales job india sucks gives us salespeople nightmares sometimes used trouble sleeping first sales job right college tell friends family ask us listen forget really easy one time manager shouting phone parents car sternly tell relax cos didnt want parents hearing abuse go daily basis really tough endure abuse way get abused like numbers people turn unethical behaviour mean even shouting pressure unethical sales easy abused every day like multiple times day even money eventually really good like really really good get lose every spec humanity thats healthy leave job saw video linkedin today banks also industry regards video bank think getting accounts insurance job force bank needs make visible get customers arrange workshops get customers cant force bank employee get customers hook crook decency comes first also show bank bad light bad government must ban soliciting sales bc space especially financial services kind push sales banned many countries good customers never ends well tax saving investment scheme wasnt supposed lunch break yessits common na bhai har baar mujhe sip insurance bech dete hai mai mana bhi bai kar pata sales high pressure job compensation commensurate sales bb generally amongst highest paid people willing tolerate downsides money involved global situation limited india lunch break india indian corporates full maniacs agree industries like banking health care leads serious concerns banking shaddy loans products led financial crisis hdfc bank push sales stay profitable say health banking sector sale financial products interest consumer seen similar things happening private hospitals well even concerning also mentioned bb roles whereas bc banking toxic sales culture speaking experience investment banking tend engage undifferentiated servicesproducts theres big tribalhunter culture financial services sales isnt primed theres good chance opportunity lost competitors situation youve got first person know opportunity always switchedon available work culture get toxic though aware bc sales doesnt pay high bb believe theyd still among highest paid division true story dgm psu bank sbi asked chief managers either commit suicide retire branches couldnt achieve specific targets explains shalini bajaj finance calling twice month months thought liked salesdriven companies especially edtech startups yes exmanager told stories dgm level meeting way dgm questioned agms started crying went breakdown bank reason would fights family suffered financial damage almost lost hope never forgive bank breaking heart literally also told security issues leaving one golden child branch looted recently fuck lunchtime bank common months back sbi officer wb circle comitted suicide bank wife fighting legal battle neither management association taken accountability another similar case happened ne circle worked hdfc good years great toxic environment dead workload everyone agressive changed personality always aggressive defensive modeoverall worst one experience hdfc work culture shifted another bank faced lot racism nonsense looking next option corporate jobs real shit hope hes fired things change suspended even fired entire chain starting guy going probed possible see treatment seniors labor employee concerned communists state take strict action abuser organization poor practice anyone ping full video link banking health education government thankfully never abused shouted noped months gon na tolerate id rather pauper get abused someone told telecom zonalarea sales manager walk around termination letter firings common every week abuse underlings fire one two maintain terror course bused seniors byjus anyone link video subtitles byjus vedantu unacademy shit hat junior like many leave ive already left jobs cos kind abusive behaviour didnt understand word muppet saying pls translate damage toxic work environments cause really needs highlighted work creative field misfortune working absolute terrorist used constant stress terror soon woke everyone made feel bad leaving time covid made feel bad working home pathetic hampered creativity much couldnt deliver time star performer every team job didnt even serve notice period emailed resignation noped took months recover mental stress caused job scared another months unemployment financial distress start looking another job indian work culture needs seriously regulated guess time make white collar union fuck around guys condition every bank including sarkari banks must akash dil chahta hai work months sales insurance co related hdfc somehow culture toxic felt army something conference rooms booked abuses n stressful meetingshouting rip watching im glad boy seen videos voice recordings byjus sales meeting watching video hearing saying common im glad didnt end working banks sales job india unfortunate truth lol koi byjus ka video dalo please usave video usavevideo know pain ing lot quit kotak become shithole looks like bank ban camera phones employees soon maybe think changing job profile field end satisfaction happiness matters point unhappy mentally unsatisfied large sums money hand sadly seems true hope day people start looking beyond earning money working chief way education im working glad know shouting like tejasvi surya guy shouting never made sale normalised everywhere banks stop zoom meetings bc arent well paid country surprised though bfsi situation every industry country country need viral videos address wrongdoings foul mouthing naukarshahi normalised phenomenon nation nonindian experience indians though ive seen indians incredibly rude aggressive indians super pleasant always found strange would think would opposite bro ulip policies really bad please dont buy watch labor law advisor channel youtube ulip insurance placed hdfc campus youre comment scares shit regretting decisions still working banking filed yes working moved multiple organisations solution found stick long always work skills move easily thought working environment organisation develop good bond work easier mind sharing role",
    "light_cleaned_title": "Has anyone seen this video of a HDFC Bank manager abusing his employees for not meeting sales targets ?",
    "light_cleaned_selftext": "This article has the video. This is very common in corporate India. You will find such behaviour common everywhere, in Banking, Insurance, Healthcare (hospitals), and education. What is most concerning is such a situation in Banks and Hospitals, if employees are pressured then they will sell bad financial products to customers, the 2008 financial crisis happened because of sales people being pressured to push shaddy loans on to unsuspecting people, this led to loan defaults, which in turn led to a real estate crisis. It also leads to questions such as: 1) Will the bank be still profitable if such loans aren't pushed ? 2) If the question to the above is No. Then the situation of our economy is grim. I'm surprised to see such behaviour by HDFC, I thought their growth was organic and not like this. It raises serious concern for me as an investor. Edit: I think the man in the video Pushpal Roy is. Chartered Accountant. What use is a CA degree if in the end you have to do sales and meet targets.",
    "light_cleaned_comments": "I think you should put a trigger warning. I saw it this morning and haven't been feeling well since. Wait till you see SBI meetings. Full on maa behen. Isn't it the norm in all banks? Most people I know that work in banks don't try to get to scale 2 due to things like this. All the abuse from the senior VP or higher trickles down and reaches the branch manager level. ha ha ha ha...john's my ex manager. I'm not surprised. Where is the Maa Behen when customers are not treated well or when big shots become NPAs. The biggest NPAs are not even known to people. How do bankers say “Fuck You”? Ans: Trust Me. Same senariao across all private banks. My wife with Kotak Bank she is at bank 9.30 in morning. They have a conference call 9pm in the evening. She operation manage there isn't any Sales in her KRA still everyday they pressure for Insurance. Isi wajah se mai har bar policy kharid leta hu I'm not defending this. But it's waaaay too common in the banking sector. How so... that's bad. My bro is at another bank but at senior level.. manages 16 branches. Never in his 18 year career has he faced this. Ur wife should change Indians can be very rude. It becomes very clear when you live in Europe or the States This is just the reality of every sales job in India. It sucks. It gives us salespeople nightmares sometimes. I used to have trouble sleeping during my first sales job right out of college. When we tell this to our friends or family, they ask us to listen to it and forget. But its really not that easy. One time my manager was shouting at me over the phone while my parents were in the car with me. I had to sternly tell him to relax cos I didn't want my parents hearing the abuse I go through on a daily basis. We have to be really tough to endure through this abuse. The only way to not get abused like this is to do our numbers. People then turn to unethical behaviour too - and I mean even this shouting and pressure is unethical. Sales is not easy. We are abused every day like this. Multiple times a day even. The money is eventually really good. Like really really good. But to get there, you have to lose every spec of humanity you have in you. That's not healthy at all. Why not leave the job? Saw this video on LinkedIn today. It's Not only the banks, but It's also all over the industry. With regards to the video at the Bank, I think Getting Accounts, Insurance is their Job but why Force them to do it. The bank needs to make itself Visible and get more Customers. Arrange Workshops and Get Customers. You can't Force a Bank Employee to get Customers by hook or crook. And Decency Comes First. You also Show Your Bank in the Bad light. This is very bad. The government must ban all soliciting sales in b2c space, especially for financial services. This kind of push sales are banned in many countries for good of customers. Because of ₹₹₹₹₹. But such ₹₹₹₹₹ never ends well. Tax saving investment scheme. Wasn't it supposed to be their lunch break? Yess..its very common Na bhai har baar mujhe SIP or insurance bech dete hai. Mai mana bhi bai kar pata. sales is a high pressure job.. the compensation is commensurate, sales in b2b are generally amongst the highest paid, people are willing to tolerate the downsides for the money involved. this is a global situation not just limited to India There is no lunch \"break\" in India Indian corporates are full of maniacs. I agree, but in industries like banking and health care it leads to serious concerns. In banking such shaddy loans and products led to the 2008 financial crisis. If HDFC Bank has to push such sales to stay profitable, then what does it say about the health of our banking sector ? Will sale of such financial products be in the interest of the consumer ? I have seen similar things happening in private hospitals as well. Which is even more concerning. You have also mentioned this in B2B roles, whereas this is B2C. banking has the most toxic sales culture, speaking from experience in investment banking, because they tend to engage in undifferentiated services/products.. theres a big tribal-hunter culture in financial services. if the sales isnt primed theres good chance that the opportunity will be lost to competitors, its a situation where youve got to be the first person to know about the opportunity, always switched-on and available, and the work culture can get toxic. though i am aware that b2c sales doesnt pay as high as b2b but i believe they'd still be among the highest paid in the division True story: DGM of a PSU bank (NOT SBI) asked all the Chief Managers under him to either commit suicide or just retire if their branches couldn't achieve specific targets. Now that explains why Shalini from Bajaj Finance has been calling me twice a month for 7 months! I thought she liked me 😢 This is same in all sales-driven companies especially Edtech startups. YES. My ex-manager told me stories about how he was at a DGM level meeting and the way DGM questioned the AGMs, some of them started crying and went into a breakdown. This bank was the reason I would have fights with my family, suffered financial damage, almost lost hope. I will never forgive this bank for breaking my heart (literally). Also I had told them about security issues before leaving. One of their golden child branch was looted recently. Fuck the lunchtime bank. This is very common. Few months back a SBI officer from WB circle comitted suicide in the Bank. His wife has been fighting a legal battle but neither the management nor association has taken any accountability. Another similar case happened in NE circle. Worked in HDFC for good 7 years. What a great toxic environment. You can be dead by workload. Everyone is so agressive. It changed my personality. Always aggressive defensive mode.overall worst any one can experience. What did you do after HDFC, how is the work culture over there ? Shifted to another Bank , faced a lot of racism and nonsense. Looking for next option. Corporate jobs are real shit. hope he's fired, only then, some things will change Suspended as of now. Not even fired. The entire chain starting from this guy, going up should be probed. It is possible he see the same treatment from his seniors. Where are the labor or employee concerned communists? Can the state take strict action against this abuser and the organization for poor practice? Anyone ping the full video link ? Banking, health and education should be under government Thankfully I was never abused, I was shouted at i noped out in 7 months. Not gonna tolerate it. I'd rather be a pauper than get abused. Someone told me that in telecom zonal/area sales manager walk around with termination letter and a few firings is very common every week. They abuse their underlings and fire one or two to maintain the terror. Of course they themselves are bused by their seniors. Byjus. Does anyone have a link for the video with subtitles? Byjus, Vedantu, Unacademy, Shit Hat Junior- all of them All of them are like that. How many will you leave? I've already left 3 jobs cos of this kind of abusive behaviour. I didn't understand a word that Muppet was saying, some pls translate The damage that toxic work environments cause really needs to be highlighted. I work in the creative field and I once had the misfortune of working with an absolute terrorist. I used to be under constant stress and in terror as soon as I woke up. Everyone was made to feel bad for leaving on time. During covid, we were made to feel bad for working from home. It was so pathetic. It hampered my creativity so much I couldn't deliver on time, while I had been a star performer on every team before and after that job. I didn't even serve my notice period. Just emailed my resignation and noped out of there. It took me 6 months to recover. The mental stress caused by that job scared me from another. Only after 6 months of unemployment and a financial distress did I start looking for another job. The indian work culture needs to be seriously regulated. Guess it’s time to make a white collar union and fuck around with these guys! This is the condition in every bank including sarkari banks. You must be Akash from Dil Chahta Hai Work for 4 to 5 months in sales of insurance it was co related with HDFC somehow. The culture is toxic. It felt i was in army or something. Conference rooms with booked just for abuses n stressful meeting/shouting. RIP Watching these, I'm glad to be in IT. boy have you not seen the videos and voice recordings of byju’s sales meeting so Watching this video and hearing all of you saying this is common, I'm glad I didn't end up working for banks. This is how a sales job is in most of India. Unfortunate truth. Lol. Koi byjus ka video dalo please. u/save video u/savevideo I know the pain. After the ING lot quit, Kotak has become a shithole. Looks like the bank will ban camera phones for employees soon Maybe then you should think of changing the job profile or the field itself. In the end, it's your satisfaction and happiness that matters. No point in being unhappy and mentally unsatisfied with large sums of money in hand. Sadly that seems to be true. I hope for a day when people will start looking beyond just earning money. Working on it chief. The only way out is through education. I'm working on it. Glad to know that 💪 He was just shouting like Tejasvi surya The guy shouting has never made a sale himself. And this is very normalised in everywhere. All banks will stop having zoom meetings. B2C aren't well paid. Why is the country surprised though? It's not just bfsi it's a same situation in every industry of the country. Does the country need viral videos to address the wrongdoings Foul mouthing, naukarshahi is normalised phenomenon of this nation Non-Indian here. From my experience, it's only with other Indians though. I've seen Indians be incredibly rude and aggressive to other Indians, and be super pleasant with me. I always found it strange, I would think it would be the opposite. Bro ULIP policies are really bad. Please don't buy. Watch labor law advisor channel on youtube about ulip and insurance. Placed in HDFC at campus. You’re comment scares the shit out me now regretting my decisions. Still working in banking filed or? Yes working moved in multiple organisations. Only solution i found not stick for to long and always work on skills so you can move out easily. Thought working on environment /organisation can develop good bond to work easier. Do you mind sharing what role you are in ?!"
}