{
    "id": "17jpfw0",
    "title": "Scammers on fb have the guts to call and threaten.",
    "url": "https://www.reddit.com/gallery/17jpfw0",
    "selftext": "I found this ad on fb marketplace selling iPhone 13 under warranty for cheap. They asked me to contact on this number, when I called no one picked and then I received a WhatsApp msg asking for the model I need. They asked for booking amount and only COD option I suspected it's a scam and didn't reply. \n\nToday I received another message from this number with I an offer for 18k for iPhone 14 and airpods both. I replied I'll pay 25k by net banking but not the booking amount and they denied and I messaged 'pele jaoge'. Immediately I received a voice message of a female threatening to complaint to police. And within a few seconds I received video call which I didn't attend and then I got a call on phone number this lady started threatening and saying you don't know who I am jo karna hai karle tere par case dalti hu main. I couldn't record the call and blocked the number immediately.\n\nDo these people get protection from police to run their scam business how can they openly threaten without a sign of fear. I'm worried what if they sell my number to other scammers or report it on Truecaller this is my only number associated everywhere I can't change it.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698658088.0,
    "convurl": "https://i.redd.it/qusj4zsl6bxb1.png",
    "comments": [
        "Bro don't worry. These are just tiny scammers with 3-4 people and they use this threatening to scare others. Believe me they can't do shit and on which issue will they case on🤣and imo the video call was just a inappropriate video so that they can record you with that video and scare you. Chill 😎"
    ],
    "cleaned_text": "scammers fb guts call threaten found ad fb marketplace selling iphone warranty cheap asked contact number called one picked received whatsapp msg asking model need asked booking amount cod option suspected scam didnt reply today received another message number offer k iphone airpods replied ill pay k net banking booking amount denied messaged pele jaoge immediately received voice message female threatening complaint police within seconds received video call didnt attend got call phone number lady started threatening saying dont know jo karna hai karle tere par case dalti hu main couldnt record call blocked number immediately people get protection police run scam business openly threaten without sign fear im worried sell number scammers report truecaller number associated everywhere cant change ",
    "cleaned_title": "scammers fb guts call threaten",
    "cleaned_selftext": "found ad fb marketplace selling iphone warranty cheap asked contact number called one picked received whatsapp msg asking model need asked booking amount cod option suspected scam didnt reply today received another message number offer k iphone airpods replied ill pay k net banking booking amount denied messaged pele jaoge immediately received voice message female threatening complaint police within seconds received video call didnt attend got call phone number lady started threatening saying dont know jo karna hai karle tere par case dalti hu main couldnt record call blocked number immediately people get protection police run scam business openly threaten without sign fear im worried sell number scammers report truecaller number associated everywhere cant change",
    "cleaned_comments": "bro dont worry tiny scammers people use threatening scare others believe cant shit issue case onand imo video call inappropriate video record video scare chill",
    "light_cleaned_title": "Scammers on fb have the guts to call and threaten.",
    "light_cleaned_selftext": "I found this ad on fb marketplace selling iPhone 13 under warranty for cheap. They asked me to contact on this number, when I called no one picked and then I received a WhatsApp msg asking for the model I need. They asked for booking amount and only COD option I suspected it's a scam and didn't reply. Today I received another message from this number with I an offer for 18k for iPhone 14 and airpods both. I replied I'll pay 25k by net banking but not the booking amount and they denied and I messaged 'pele jaoge'. Immediately I received a voice message of a female threatening to complaint to police. And within a few seconds I received video call which I didn't attend and then I got a call on phone number this lady started threatening and saying you don't know who I am jo karna hai karle tere par case dalti hu main. I couldn't record the call and blocked the number immediately. Do these people get protection from police to run their scam business how can they openly threaten without a sign of fear. I'm worried what if they sell my number to other scammers or report it on Truecaller this is my only number associated everywhere I can't change it.",
    "light_cleaned_comments": "Bro don't worry. These are just tiny scammers with 3-4 people and they use this threatening to scare others. Believe me they can't do shit and on which issue will they case on🤣and imo the video call was just a inappropriate video so that they can record you with that video and scare you. Chill 😎"
}