{
    "id": "16qq2b3",
    "title": "Is this real? Are Indians feeling unsafe in Canada",
    "url": "https://www.reddit.com/gallery/16qq2b3",
    "selftext": "Seeing these on Twitter. Sounds like copy paste tweets. What's the truth to this?",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695535780.0,
    "convurl": "https://i.redd.it/oduugcqda5qb1.jpg",
    "comments": [
        "It’s pretty much what it seems like. Actual humans would write a bit different don’t you think?\n\n\n\nIt’s just copy pasted for propaganda",
        "If it walks like a duck and it talks like a duck, it's a duck.",
        "IT cell active.",
        "Come home bots. Vande Mataram",
        "Lol  by this time we should know how India's IT cells work.",
        "Toolkit Sena doing their job.",
        "Nationalist Sanatani 😂😂😂 mofo",
        "Why the heck everybody will write exactly same thin . It's definitely for spreading propaganda.",
        "Lmao, the IT cell must think that we’re really dumb morons.",
        "Canada in general is safe. Scuffles and harassment may escalate in places like Brampton and Surrey but that's to be expected from these 2 khalistani strong holds. The population of Hindus and Sikhs are on par with each other but the former is much more diversified that the blocks of latter.\n\nthe tweets are bots though.",
        "Of course not. Toolkit. \n\nThat’s what they government is best at",
        "Ghar wapsi",
        "im an indian student living in a white majority town. And I know that is what will ensure my safety tbh.",
        "km se km chat gpt ki query unique daal dete it cell walo",
        "These are samples of some low-grade exports from our country that we should get back here asap, so as not to ruin our public image even further.",
        "Do they still get Rs 2 per tweet?",
        "Whole Gujrat will be full again who paid 20-30 lakhs to go to Canada",
        "Bots and copy/pasted statements. Nothing to see here.",
        "Haha. This is too much.",
        "Sadly many people will fall for this. The government is a specialist in spreading these kinds of propaganda.",
        "Well, considering the insane amount of punjabi hindus, gujjus, and haryanvis who arrived in September batch as international students, I really don't think so.",
        "Propaganda run by BJP IT Cell, that's it. Nothing more to it.",
        "Man do you seriously think IT Cell copy pastas are real?",
        "Ask these idiots if they got paid in INR or CAD for these tweets.",
        "True. and tbh there was no need of mentioning your religion. They could just have wrote I am an Indian and ..... Hindu muslim sikh se kuch nai hoga, agar Canada walo ko hate spread karna hoga they will do it against any Indian.",
        "bro even fake reviews are more creative then this , its just copy and paste",
        "Oh, no... So many 'nationalist sanatanis' heading back to India.\n\n@Nationalist sanatanis: please continue to grace the Canadians with your presence. What good will be achieved by your return to India, huh?",
        "Hahaha, this is hilarious. The Indian government is making native Canadians happy. Since they want less Indian immigrants.",
        "No Canadian, especially anyone Canadian born, will call themselves a nationalist Sanatani",
        "Atleast 5 of these Hindus are Sikhs. Hilarious!!",
        "Wake up babe new copy pasta just dropped",
        "you mean BJP's IT cell?",
        "Copy Pasta",
        "Sometimes I see Elon Musk as a lunatic with his handling of Twitter, but I do agree with charging users. Might remove all these bots.",
        "\"Nationalist Sanatani\"- username Bunty Singh. They are nothing but bots, propaganda machine on full swing. \n\nhttps://preview.redd.it/hj43tqhfi5qb1.jpeg?width=720&format=pjpg&auto=webp&s=8ff53033a1990a78634b0421cfce2e30ccba8792",
        "Lol isn't this what every native in every country in the world wants right now?  Less Indian immigrants 😂",
        "Bot army assemble!",
        "Lmfao, aadhe bhakto ke bacho ne PR bhari rakhi hai, babaji ka ghantaa nai wapas aate woh sab.\n\nThere is nothing happening in Canada, it's a government to government issue.\n\nLike it or not, Canadians are mot idiots who will start beating people up, it's not india.",
        "Class Homework be like",
        "\"I'm a nationalist sanatani\", why the fuck did you go to Canada then? Even tier 3 Indian cities must be too progressive for you.",
        "The usual tanatani bot crowd will feel unsafe even in their toilets back in India cuz the shit they took will oppress them",
        "Lol bottom right \"daku Singh\" feeling unsafe... bjp it cell is so silly.so cute.",
        "Modibots",
        "From what I've been told by friends living there approx 50% people there don't even know this India 'tension' is a thing and 90% haven't thought of India today. So yeah, this level of crisis mongering is purely an Indian news channel creation.",
        "Probably bots by some IT cell, shame on how misleading and manipulative these platforms can be( didn't Elon say he removed bots from X)",
        "Violence against Indians (not just Hindus) will be on the rise soon - but these tweets are clearly bots at work. Aadhe se zyaada accounts ke toh naam Sikh hain, I doubt they’d be covert Hindus.",
        "My parents who are hardcore BJP supporters living with us in Canada took the bus to the city (Montreal) and had a great time just yesterday. They had good food out, watched some street  performances, saw people playing chess, usual things. They walked around for over 3 hours. Most people here don’t know about the issue with India. The most educated people typically do know because they read the news. But I know they wouldn’t hate on Indians even if they thought that the Indian government did something wrong to Canada. In general, Canadians are not very nationalistic, and are able to distinguish acts of people Vs their government. \n\nI’ve been hearing that the Indian media is saying Canada is a safe haven for terrorists, Indians are getting hate attacks etc., is this true?",
        "Propaganda by right wing 😂😂😂",
        "These are obvious bjpee it cell people suddenly feeling \"unsafe \" in Canada... if u re feeling unsafe there then come back to India. Simple enough.\n\nCanadians are much more civilized about dealing with minorities as compared to india whose culture is to threaten intimidate and lynch and destroy minority places of worship (church burning)",
        "Bruh IT cell ppl r weirdly dumb...lyk spreading hate and propaganda so openly?",
        "My friend who got Canada citizenship some 5 years ago told me he is irritated with all the - kaisa hai tu aur waha par sab kaisa hai - questions. He told everything is damn fine and he not returning to India. Ab bolo.",
        "It looks a bit like fake news.  I typically travel to/from Canada every 3-4 months and honestly there are no issues there for Indians.  It's a perfectly safe country.  Yes incidents do happen, but those are statistically rare and furthermore they can happen anywhere in the world.  If shit happens it's likely due to bad luck rather than Canada!",
        "Make internet expensive again .",
        "AI sanatani chan to the rescue !",
        "Same tweet from everyone? Isn't this propaganda?",
        "Actual Canadians would be so happy if this is real but that's not going to happen like ever.",
        "They dont approve of womens right and are coming back to support the santani movement to stop new legislation in india.",
        "# #ToolKit",
        "Then they can stop coming here if it’s so unsafe",
        "If you're such a nationalist sanatani, come back to India.",
        "Yes, this is the right to show patriotism.",
        "Lol, these are just fake accounts.",
        "it's rumours sent by  media and bjp it cell",
        "Hindu dharma khatre me.\nPart 2: kanedda",
        "Sardar kabse sanatani ho gaye? I thought Sikkhism was a revolt against rigid sanatan shit. Ye kya ab sardaro ki bhi Ghar wapsi Kara rahe hai?",
        "Why are nationalist sanatani loving in cananda, UP is waiting for them",
        "Pakistani agencies love larping as indians from different ethnicities and run such psyops. Unfortunately, they end up creating a lot of trouble when people are emotional. Once communities start arguing they just watch the show. Happened so many times now. \n\nLook at the first tweet here - guy’s name is pajeet? \n\nMost of the other pseudonyms sound punjabi inspired as well. \n\nYep, pakistani",
        "Just daily wage IT cell coolie",
        "It's simply a basic message meant to be copy pasted to share quickly and bring the issue to light in a united voice which has been done n number of times in social media. Or did op or whoever created this thought that they uncovered some plot?",
        "As riyal as my romantic life with Disha Patani.",
        "Bjp it cell",
        "Yes I moved back from Canada to Mahada out of fear of losing my left testicle",
        "Even gpt can write better versions of this.. \n\nOh but that will cost more than 2 Rs 😅",
        "Fucking right brother high five 👋",
        "Nationalist & Sanatani   \nContradictory in itself 😂  \nBTW Nice One'😂😂  \n\n\nfew months back they write in bio's \"\"PROUD INDIAN\"\"   \nfew months after they have problem with word \"\" INDIA\"\"  \n\n\nIf Have to guess their next target  \n\n\nprobably will be flag or Language",
        "IT cell activated",
        "Ctrl C - Ctrl V",
        "Aren't we ?",
        "I have been in Canada for more than 2 years now, and I'll be honest, I hate current Indian govt, so I am not a Bhakt. You can check my profile.\n\n&#x200B;\n\nI have been living in the city center Vancouver since coming here, and there is one thing I can say with confidence - there is absolutely no fear to Hindus or any human being at all, even if they are Khalistani. Canada is extremely liberal and friendly, people just love other humans.\n\n&#x200B;\n\nThis all is propaganda, swear to god. I just visited a Pakistani restaurant last night, and I visited a Khalistani supported owned grocery store today, and there was no animosity at all. To tell you the truth, it didn't feel any different than it was 20 months back. There is no change at all of any kind\n\nThese people are just trying to create a divide among us in the name of religion even here in Canada, you guys need to be more careful and aware than their cheap tactics. \n\nTo tell you the truth, it didn't feel any different than it was 27 months back when I moved. There is no change at all of any kind. \n\n&#x200B;\n\nI am so ashamed of India right now because Canadian people are now openly calling India's hate spread now on all subreddits and in real life.",
        "Go home.\n\nTo your home.\n\nWhere you belong.",
        "Twitter is 99% bots tbh",
        "For those who don't understand these tweets.\n\nA few accounts (mostly bots/Pro-BJP accounts) initially posted about how they are suddenly feeling unsafe in Canada cause of their Hindu faith. These tweets were called out by both Hindus/Sikh in Canada because they were blatant lies and misinformation.\n\nSo, some Sikh accounts are now treating it as satire and posting their own joke tweets now. Someone even posted about how \"I'm gonna go back and establish Hindu Rashtra lol\"",
        "Why would govt do that?",
        "Indian government’s MEA or some ish org has said Canada is a safe haven for terrorists and about hate attacks",
        "Yeah let's bring back all our students, UP k college me admission dilwa dege ... world class education toh India me bhi hai..",
        "This is so embarrassing",
        "My family and friends in Canada are pretty safe and says nothing is going around to be frightful.",
        "Two rupis peepal",
        "Not everything is Pak psyops. This seems more like dumb Indian bhaktops. The pattern is the same domestically as well.",
        "I am not giving my hatred. But just storming over another people's place and building temples owning truck businesses much more. How do u feel if Nepali stormed comes to Delhi for further setting and u just see them everywhere.",
        "BJP propaganda game is strong af.",
        "India ho ya Canada, Hindu saala khatre mein hi rehta hai",
        "Don't you think that's a bjp propaganda , idiots didn't bother to change the post , spamming same thing like it's a referral link lol",
        "Hindu har jagah khatre mein hai",
        "Sanatani : Far From Home\nSanatani : Homecoming",
        "2014 & 2019 - Hindus are in danger so vote for BJPee\n2024 - Hindus are in danger in canada so...",
        "\"I'm a national sanatani\" This is enough to tell what kind of people they are. These people take their dirt and casteism wherever they go"
    ],
    "cleaned_text": "real indians feeling unsafe canada seeing twitter sounds like copy paste tweets whats truth ",
    "cleaned_title": "real indians feeling unsafe canada",
    "cleaned_selftext": "seeing twitter sounds like copy paste tweets whats truth",
    "cleaned_comments": "pretty much seems like actual humans would write bit different dont think copy pasted propaganda walks like duck talks like duck duck cell active come home bots vande mataram lol time know indias cells work toolkit sena job nationalist sanatani mofo heck everybody write exactly thin definitely spreading propaganda lmao cell must think really dumb morons canada general safe scuffles harassment may escalate places like brampton surrey thats expected khalistani strong holds population hindus sikhs par former much diversified blocks latter tweets bots though course toolkit thats government best ghar wapsi im indian student living white majority town know ensure safety tbh km se km chat gpt ki query unique daal dete cell walo samples lowgrade exports country get back asap ruin public image even still get rs per tweet whole gujrat full paid lakhs go canada bots copypasted statements nothing see haha much sadly many people fall government specialist spreading kinds propaganda well considering insane amount punjabi hindus gujjus haryanvis arrived september batch international students really dont think propaganda run bjp cell thats nothing man seriously think cell copy pastas real ask idiots got paid inr cad tweets true tbh need mentioning religion could wrote indian hindu muslim sikh se kuch nai hoga agar canada walo ko hate spread karna hoga indian bro even fake reviews creative copy paste oh many nationalist sanatanis heading back india nationalist sanatanis please continue grace canadians presence good achieved return india huh hahaha hilarious indian government making native canadians happy since want less indian immigrants canadian especially anyone canadian born call nationalist sanatani atleast hindus sikhs hilarious wake babe new copy pasta dropped mean bjps cell copy pasta sometimes see elon musk lunatic handling twitter agree charging users might remove bots nationalist sanatani username bunty singh nothing bots propaganda machine full swing lol isnt every native every country world wants right less indian immigrants bot army assemble lmfao aadhe bhakto ke bacho ne pr bhari rakhi hai babaji ka ghantaa nai wapas aate woh sab nothing happening canada government government issue like canadians mot idiots start beating people india class homework like im nationalist sanatani fuck go canada even tier indian cities must progressive usual tanatani bot crowd feel unsafe even toilets back india cuz shit took oppress lol bottom right daku singh feeling unsafe bjp cell sillyso cute modibots ive told friends living approx people dont even know india tension thing havent thought india today yeah level crisis mongering purely indian news channel creation probably bots cell shame misleading manipulative platforms didnt elon say removed bots x violence indians hindus rise soon tweets clearly bots work aadhe se zyaada accounts ke toh naam sikh hain doubt theyd covert hindus parents hardcore bjp supporters living us canada took bus city montreal great time yesterday good food watched street performances saw people playing chess usual things walked around hours people dont know issue india educated people typically know read news know wouldnt hate indians even thought indian government something wrong canada general canadians nationalistic able distinguish acts people vs government ive hearing indian media saying canada safe terrorists indians getting hate attacks etc true propaganda right wing obvious bjpee cell people suddenly feeling unsafe canada u feeling unsafe come back india simple enough canadians much civilized dealing minorities compared india whose culture threaten intimidate lynch destroy minority places worship church burning bruh cell ppl r weirdly dumblyk spreading hate propaganda openly friend got canada citizenship years ago told irritated kaisa hai tu aur waha par sab kaisa hai questions told everything damn fine returning india ab bolo looks bit like fake news typically travel tofrom canada every months honestly issues indians perfectly safe country yes incidents happen statistically rare furthermore happen anywhere world shit happens likely due bad luck rather canada make internet expensive ai sanatani chan rescue tweet everyone isnt propaganda actual canadians would happy real thats going happen like ever dont approve womens right coming back support santani movement stop new legislation india toolkit stop coming unsafe youre nationalist sanatani come back india yes right show patriotism lol fake accounts rumours sent media bjp cell hindu dharma khatre part kanedda sardar kabse sanatani ho gaye thought sikkhism revolt rigid sanatan shit ye kya ab sardaro ki bhi ghar wapsi kara rahe hai nationalist sanatani loving cananda waiting pakistani agencies love larping indians different ethnicities run psyops unfortunately end creating lot trouble people emotional communities start arguing watch show happened many times look first tweet guys name pajeet pseudonyms sound punjabi inspired well yep pakistani daily wage cell coolie simply basic message meant copy pasted share quickly bring issue light united voice done n number times social media op whoever created thought uncovered plot riyal romantic life disha patani bjp cell yes moved back canada mahada fear losing left testicle even gpt write better versions oh cost rs fucking right brother high five nationalist sanatani contradictory btw nice one months back write bios proud indian months problem word india guess next target probably flag language cell activated ctrl c ctrl v arent canada years ill honest hate current indian govt bhakt check profile xb living city center vancouver since coming one thing say confidence absolutely fear hindus human even khalistani canada extremely liberal friendly people love humans xb propaganda swear god visited pakistani restaurant last night visited khalistani supported owned grocery store today animosity tell truth didnt feel different months back change kind people trying create divide among us name religion even canada guys need careful aware cheap tactics tell truth didnt feel different months back moved change kind xb ashamed india right canadian people openly calling indias hate spread subreddits real life go home home belong twitter bots tbh dont understand tweets accounts mostly botsprobjp accounts initially posted suddenly feeling unsafe canada cause hindu faith tweets called hindussikh canada blatant lies misinformation sikh accounts treating satire posting joke tweets someone even posted im gon na go back establish hindu rashtra lol would govt indian governments mea ish org said canada safe terrorists hate attacks yeah lets bring back students k college admission dilwa dege world class education toh india bhi hai embarrassing family friends canada pretty safe says nothing going around frightful two rupis peepal everything pak psyops seems like dumb indian bhaktops pattern domestically well giving hatred storming another peoples place building temples owning truck businesses much u feel nepali stormed comes delhi setting u see everywhere bjp propaganda game strong af india ho ya canada hindu saala khatre mein hi rehta hai dont think thats bjp propaganda idiots didnt bother change post spamming thing like referral link lol hindu har jagah khatre mein hai sanatani far home sanatani homecoming hindus danger vote bjpee hindus danger canada im national sanatani enough tell kind people people take dirt casteism wherever go",
    "light_cleaned_title": "Is this real? Are Indians feeling unsafe in Canada",
    "light_cleaned_selftext": "Seeing these on Twitter. Sounds like copy paste tweets. What's the truth to this?",
    "light_cleaned_comments": "It’s pretty much what it seems like. Actual humans would write a bit different don’t you think? It’s just copy pasted for propaganda If it walks like a duck and it talks like a duck, it's a duck. IT cell active. Come home bots. Vande Mataram Lol by this time we should know how India's IT cells work. Toolkit Sena doing their job. Nationalist Sanatani 😂😂😂 mofo Why the heck everybody will write exactly same thin . It's definitely for spreading propaganda. Lmao, the IT cell must think that we’re really dumb morons. Canada in general is safe. Scuffles and harassment may escalate in places like Brampton and Surrey but that's to be expected from these 2 khalistani strong holds. The population of Hindus and Sikhs are on par with each other but the former is much more diversified that the blocks of latter. the tweets are bots though. Of course not. Toolkit. That’s what they government is best at Ghar wapsi im an indian student living in a white majority town. And I know that is what will ensure my safety tbh. km se km chat gpt ki query unique daal dete it cell walo These are samples of some low-grade exports from our country that we should get back here asap, so as not to ruin our public image even further. Do they still get Rs 2 per tweet? Whole Gujrat will be full again who paid 20-30 lakhs to go to Canada Bots and copy/pasted statements. Nothing to see here. Haha. This is too much. Sadly many people will fall for this. The government is a specialist in spreading these kinds of propaganda. Well, considering the insane amount of punjabi hindus, gujjus, and haryanvis who arrived in September batch as international students, I really don't think so. Propaganda run by BJP IT Cell, that's it. Nothing more to it. Man do you seriously think IT Cell copy pastas are real? Ask these idiots if they got paid in INR or CAD for these tweets. True. and tbh there was no need of mentioning your religion. They could just have wrote I am an Indian and ..... Hindu muslim sikh se kuch nai hoga, agar Canada walo ko hate spread karna hoga they will do it against any Indian. bro even fake reviews are more creative then this , its just copy and paste Oh, no... So many 'nationalist sanatanis' heading back to India. @Nationalist sanatanis: please continue to grace the Canadians with your presence. What good will be achieved by your return to India, huh? Hahaha, this is hilarious. The Indian government is making native Canadians happy. Since they want less Indian immigrants. No Canadian, especially anyone Canadian born, will call themselves a nationalist Sanatani Atleast 5 of these Hindus are Sikhs. Hilarious!! Wake up babe new copy pasta just dropped you mean BJP's IT cell? Copy Pasta Sometimes I see Elon Musk as a lunatic with his handling of Twitter, but I do agree with charging users. Might remove all these bots. \"Nationalist Sanatani\"- username Bunty Singh. They are nothing but bots, propaganda machine on full swing. Lol isn't this what every native in every country in the world wants right now? Less Indian immigrants 😂 Bot army assemble! Lmfao, aadhe bhakto ke bacho ne PR bhari rakhi hai, babaji ka ghantaa nai wapas aate woh sab. There is nothing happening in Canada, it's a government to government issue. Like it or not, Canadians are mot idiots who will start beating people up, it's not india. Class Homework be like \"I'm a nationalist sanatani\", why the fuck did you go to Canada then? Even tier 3 Indian cities must be too progressive for you. The usual tanatani bot crowd will feel unsafe even in their toilets back in India cuz the shit they took will oppress them Lol bottom right \"daku Singh\" feeling unsafe... bjp it cell is so silly.so cute. Modibots From what I've been told by friends living there approx 50% people there don't even know this India 'tension' is a thing and 90% haven't thought of India today. So yeah, this level of crisis mongering is purely an Indian news channel creation. Probably bots by some IT cell, shame on how misleading and manipulative these platforms can be( didn't Elon say he removed bots from X) Violence against Indians (not just Hindus) will be on the rise soon - but these tweets are clearly bots at work. Aadhe se zyaada accounts ke toh naam Sikh hain, I doubt they’d be covert Hindus. My parents who are hardcore BJP supporters living with us in Canada took the bus to the city (Montreal) and had a great time just yesterday. They had good food out, watched some street performances, saw people playing chess, usual things. They walked around for over 3 hours. Most people here don’t know about the issue with India. The most educated people typically do know because they read the news. But I know they wouldn’t hate on Indians even if they thought that the Indian government did something wrong to Canada. In general, Canadians are not very nationalistic, and are able to distinguish acts of people Vs their government. I’ve been hearing that the Indian media is saying Canada is a safe haven for terrorists, Indians are getting hate attacks etc., is this true? Propaganda by right wing 😂😂😂 These are obvious bjpee it cell people suddenly feeling \"unsafe \" in Canada... if u re feeling unsafe there then come back to India. Simple enough. Canadians are much more civilized about dealing with minorities as compared to india whose culture is to threaten intimidate and lynch and destroy minority places of worship (church burning) Bruh IT cell ppl r weirdly dumb...lyk spreading hate and propaganda so openly? My friend who got Canada citizenship some 5 years ago told me he is irritated with all the - kaisa hai tu aur waha par sab kaisa hai - questions. He told everything is damn fine and he not returning to India. Ab bolo. It looks a bit like fake news. I typically travel to/from Canada every 3-4 months and honestly there are no issues there for Indians. It's a perfectly safe country. Yes incidents do happen, but those are statistically rare and furthermore they can happen anywhere in the world. If shit happens it's likely due to bad luck rather than Canada! Make internet expensive again . AI sanatani chan to the rescue ! Same tweet from everyone? Isn't this propaganda? Actual Canadians would be so happy if this is real but that's not going to happen like ever. They dont approve of womens right and are coming back to support the santani movement to stop new legislation in india. # #ToolKit Then they can stop coming here if it’s so unsafe If you're such a nationalist sanatani, come back to India. Yes, this is the right to show patriotism. Lol, these are just fake accounts. it's rumours sent by media and bjp it cell Hindu dharma khatre me. Part 2: kanedda Sardar kabse sanatani ho gaye? I thought Sikkhism was a revolt against rigid sanatan shit. Ye kya ab sardaro ki bhi Ghar wapsi Kara rahe hai? Why are nationalist sanatani loving in cananda, UP is waiting for them Pakistani agencies love larping as indians from different ethnicities and run such psyops. Unfortunately, they end up creating a lot of trouble when people are emotional. Once communities start arguing they just watch the show. Happened so many times now. Look at the first tweet here - guy’s name is pajeet? Most of the other pseudonyms sound punjabi inspired as well. Yep, pakistani Just daily wage IT cell coolie It's simply a basic message meant to be copy pasted to share quickly and bring the issue to light in a united voice which has been done n number of times in social media. Or did op or whoever created this thought that they uncovered some plot? As riyal as my romantic life with Disha Patani. Bjp it cell Yes I moved back from Canada to Mahada out of fear of losing my left testicle Even gpt can write better versions of this.. Oh but that will cost more than 2 Rs 😅 Fucking right brother high five 👋 Nationalist & Sanatani Contradictory in itself 😂 BTW Nice One'😂😂 few months back they write in bio's \"\"PROUD INDIAN\"\" few months after they have problem with word \"\" INDIA\"\" If Have to guess their next target probably will be flag or Language IT cell activated Ctrl C - Ctrl V Aren't we ? I have been in Canada for more than 2 years now, and I'll be honest, I hate current Indian govt, so I am not a Bhakt. You can check my profile. &#x200B; I have been living in the city center Vancouver since coming here, and there is one thing I can say with confidence - there is absolutely no fear to Hindus or any human being at all, even if they are Khalistani. Canada is extremely liberal and friendly, people just love other humans. &#x200B; This all is propaganda, swear to god. I just visited a Pakistani restaurant last night, and I visited a Khalistani supported owned grocery store today, and there was no animosity at all. To tell you the truth, it didn't feel any different than it was 20 months back. There is no change at all of any kind These people are just trying to create a divide among us in the name of religion even here in Canada, you guys need to be more careful and aware than their cheap tactics. To tell you the truth, it didn't feel any different than it was 27 months back when I moved. There is no change at all of any kind. &#x200B; I am so ashamed of India right now because Canadian people are now openly calling India's hate spread now on all subreddits and in real life. Go home. To your home. Where you belong. Twitter is 99% bots tbh For those who don't understand these tweets. A few accounts (mostly bots/Pro-BJP accounts) initially posted about how they are suddenly feeling unsafe in Canada cause of their Hindu faith. These tweets were called out by both Hindus/Sikh in Canada because they were blatant lies and misinformation. So, some Sikh accounts are now treating it as satire and posting their own joke tweets now. Someone even posted about how \"I'm gonna go back and establish Hindu Rashtra lol\" Why would govt do that? Indian government’s MEA or some ish org has said Canada is a safe haven for terrorists and about hate attacks Yeah let's bring back all our students, UP k college me admission dilwa dege ... world class education toh India me bhi hai.. This is so embarrassing My family and friends in Canada are pretty safe and says nothing is going around to be frightful. Two rupis peepal Not everything is Pak psyops. This seems more like dumb Indian bhaktops. The pattern is the same domestically as well. I am not giving my hatred. But just storming over another people's place and building temples owning truck businesses much more. How do u feel if Nepali stormed comes to Delhi for further setting and u just see them everywhere. BJP propaganda game is strong af. India ho ya Canada, Hindu saala khatre mein hi rehta hai Don't you think that's a bjp propaganda , idiots didn't bother to change the post , spamming same thing like it's a referral link lol Hindu har jagah khatre mein hai Sanatani : Far From Home Sanatani : Homecoming 2014 & 2019 - Hindus are in danger so vote for BJPee 2024 - Hindus are in danger in canada so... \"I'm a national sanatani\" This is enough to tell what kind of people they are. These people take their dirt and casteism wherever they go"
}