{
    "id": "13rm8lf",
    "title": "India’s opposition to boycott new parliament inauguration by Modi",
    "url": "https://www.aljazeera.com/news/2023/5/25/indias-opposition-to-boycott-new-parliament-inauguration-by-modi",
    "selftext": "Leaders let others shine, so who is the leader in India? Modi will do another solo insta photo op while the president was made to inaugurate Modi stadium.\n\nThe main photo op event before the election is scheduled for January Ram Mandir.\n\nDo people still get fooled by these PR stunts? Didn’t Vajpayee try the same trick with shining India?",
    "flair": "Politics",
    "score": 14,
    "num_comments": 4,
    "created_utc": 1685031997.0,
    "convurl": "https://external-preview.redd.it/GSw8c5PJaDUJe-mWpI47b0N6q62hXIo93Wclg-0hzZs.jpg?auto=webp&v=enabled&s=9d2cfa66b7fc0f8d843d977ececb5728ab287646",
    "comments": [],
    "cleaned_text": "indias opposition boycott new parliament inauguration modi leaders let others shine leader india modi another solo insta photo op president made inaugurate modi stadium main photo op event election scheduled january ram mandir people still get fooled pr stunts didnt vajpayee try trick shining india ",
    "cleaned_title": "indias opposition boycott new parliament inauguration modi",
    "cleaned_selftext": "leaders let others shine leader india modi another solo insta photo op president made inaugurate modi stadium main photo op event election scheduled january ram mandir people still get fooled pr stunts didnt vajpayee try trick shining india",
    "cleaned_comments": "",
    "light_cleaned_title": "India’s opposition to boycott new parliament inauguration by Modi",
    "light_cleaned_selftext": "Leaders let others shine, so who is the leader in India? Modi will do another solo insta photo op while the president was made to inaugurate Modi stadium. The main photo op event before the election is scheduled for January Ram Mandir. Do people still get fooled by these PR stunts? Didn’t Vajpayee try the same trick with shining India?",
    "light_cleaned_comments": ""
}