{
    "id": "oh98w4",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/oh98w4/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**The Movies and Shows Thread is posted every two weeks on Saturday mornings.**\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 33,
    "num_comments": 80,
    "created_utc": 1625880618,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Looking for documentaries similar to Bob Lazar",
        "And if you haven't seen Bob Lazar do watch it",
        "Watching Succession second time around, haven’t watched a better dark psychological comedy",
        "Started watching Barry on Hotstar yesterday. So much fun. Breezed past 3 episodes in no time. \n\nOther than that, I am listening to a lot of TIFO podcasts because of the Euro fever.",
        "Completed Monster (Anime) about 3-4 days ago. If you haven't watched it, I would highly recommend that you watch it. Amazing show.",
        "watching vempire diaries",
        "I watched it last year. Now I am fan Dr Tenma",
        "Try Corporate",
        "In season 2, there’s an episode called ronny/lilly. Be ready to blow your socks off.",
        "Seen the nerdwriter vid on it?",
        "Finished watching How to Become a Tyrant on Netflix! Narrated by Peter Dinklage, loved it. Also, I’m really liking CapitalMinds podcast I wish they were more frequent with their episodes though.",
        "No! Will do once I am done watching the whole thing again! Thanks for the suggestion.",
        "Watched Katla. Set in beautiful iceland. Worth a watch!",
        "Ragnarok on netflix. And ofcourse Black Widow. Wanted to go to theatre for this but 😔",
        "if you liked barry, then watch dexter (only first 4 seasons)",
        "Try Barry on HBO. It's not better but still a pretty good dark comedy",
        "Already did :) Awesome show!",
        "I found Ragnarok underwhelming, although actors are fantastic and cast selection is superb.",
        "Spoke like a real Dexter fan, looking forward to the new limited season!",
        "that was one of the best episodes of any tv show I've ever seen",
        "Thanks, will do.",
        "Yeah I love the characters and casting the most",
        "Completed Erased(Anime)\nSoooooo Goooood.\nOnly 4 hours long",
        "Would you look at that, all of the words in your comment are in alphabetical order.\n\nI have checked 72,240,827 comments, and only 20,188 of them were in alphabetical order.",
        "Not being hipster or anything but I watched the 7 seasons of Dexter during their original run. Gave up on 8th as I was frustrated on how Season 7 ended. And frankly I am glad that I did.\n\nEdit: Agree that they should've called it of after the Trinity Killer. Everything was downhill from there. BTW, a lot of shows would have ended up classics if they kept it short and didn't linger even after they ran out of ideas.",
        "Awesome! Looking forward to it.",
        "Loved Ted Lasso.\n\nAny similar recommendations?",
        "Started Simpsons. \n\nI asked around and people told me to start with season 2\n\nWatched \"Bart gets an F\"\n\nGoddamn its so relatable. I love this show already",
        "Watching Ghost in the Shell: Stand Alone Complex tv series",
        "Saw Mouse - Korean . Loved it  Highly rated on IMDB &gt; 8 . Serial Killer Thriller stuff",
        "It's a series : https://www.imdb.com/title/tt13634792/",
        "You can watch it here : https://watchasian.vc/mouse-2021-episode-1.html",
        "Also watched Castlevania all seasons.\n\nGoddamn the action is amazing",
        "‘Well of Death’   amazing stunt show. Kerela https://youtu.be/H52pb0hudyw",
        "How to Become a Tyrant on Netflix.",
        "Ok u watched the series called mouse, fuck I'm so dumb I was searching for saw mouse😂 nd got strange results, thought saw was that tool, I didn't check that IMDb link also, LoL",
        "How is it? I've not seen the original movie either",
        "Columbus 2017",
        "It is somewhat more faithful to the original manga, overall it has much better world-building and is more light-hearted than the original manga, you should watch it first to get to know all the technical jargon, then go to the original movie even if the chronology is opposite.",
        "If you liked Barry, you might like Mr Inbetween.",
        "Thanks for the elaborate comment. Will definitely check them out.\n\nI also had The Morning Show in mind. I am a sucker for anything having a sports background so Ted Lasso was just the right thing.",
        "Currently watching it too. Realised the narrator was Peter Dinklage after I saw credits.(the voice did seem familiar)",
        "What We Do in the Shadows by Taika Waititi, cannot recommend this enough.\n\nToday wife and I started watching the TV series of the same name (executive produced by Waititi), so far hilarious. \n\nMan's a genius. Also would strongly recommend Hunt for the Wilderpeople, and of course Jojo Rabbit.\n\nAlso, rewatching Coupling, probably some of Steven Moffat's better work, but the show is not living up to the hype I had created, lol.",
        "The TV show What We Do stars Matt Berry. Will recommend The Toast of London, another show with him as the lead, as well as one of the creators.",
        "+1",
        "also recommend IT Crowd with matt berry!",
        "+1",
        "Watched \"Black Widow\" over the weekend. It was okiesh. Doesn't blow you away like some other MCU movies.",
        "Anyone has recommendations for any good reality shows? Cooking show also ok. We like Masterchef Australia and have watched it (and watching it).",
        "Feat Street Part 1 &amp; 2: Okaish, nothing new, retro slasher pastime.",
        "Not exactly related.. But can you guys recommend me a TV that doesn't run into software issues?I am away from home and this is for my mom, who's not really good with technology. I would ideally want a smart TV but the reviews on Amazon worry me. They often run into issues mainly software related. Hence, need your help. Budget is below 20K and 32inch is fine. Full HD is good, but again it should be reliable and shouldn't need much maintenance. Mom would just be watching cable mostly, and maybe YouTube. But, there's no wifi and I am not sure if my mom knows how to run a hotspot. I can teach her that though\n\nAlso, is extended warranty worth it?",
        "Instead of a smart TV, consider Fire TV stick. You would need to teach her how to use it, but it's fairly simple and it won't run into software issues. Also cheaper.",
        "if you are looking for a smart tv or wish to add smart features, I suggest buy a Fire TV edition TV which basically means that the TV's OS is Fire OS (same on in firestick). This way you don't have to separately buy fire stick and FireOS based TVs work well too. I have 2 of them. One from Onida brand and one from amazonbasics brand.\n\nJust so you know, 32 Inch mostly will come as 720p. Even if you get 1080p, it may be relatively more expensive.",
        "Is there english dub available? I know many people despise watched dubbed content and I am also of same opinion but for stuff I do like it dubbed.\n\nLike I am currently watching \"The Naked Directory\" in original Japanese language with English subtitles and even saw Narcos that way. But watched Lupin in English dub.",
        "One suggestion for the mods here. Please try to post the last thread's link in the latest thread.",
        "Gullak season 1 and Season 2 best Indian tv series. Sony liv has very good original content but a very shitty app.",
        "/u/IAmMohit ^^",
        "Speaking of IT Crowd, folks should watch Submarine. It's directed by Richard Ayoade.",
        "I think originally it is from TVF. So basically it is not sonyliv content, it is from TVF. Same with their different shows like \"Yeh Meri Family\".",
        "they are now making exclusive content for ott platforms.",
        "Right but I think they make and it is shown on multiple platforms. I guess their own app isn't working that well for them and on youtube, with plethora of videos, it gets lost I guess.",
        "Good idea.. Thanks!",
        "Thanks!!!",
        "Watched Collar Bomb just because I wanted some Bollywood content. Don't make the same mistake.",
        "black widow what y'all think about it, is it worth seeing..",
        "I am thinking of Ending things . Crazy movie. Might require a bit reading later in order to understand it fully.",
        "I loved that movie watched it a while back had to read bunch of articles to understand the movie fully haha",
        "Looking from Spanish thriller/horror movies any suggestions? Something like wildtales/the platform/rec.",
        "A lot of big Netflix shows getting their sequel seasons this year....I advise people to catch up on them if they haven't...The Witcher, Sex education, Ozark, You, Stranger Things, Money Heist, Cobra Kai to name some of the big baddies....",
        "Books and Authors)The Pen that Writes\n\nWe are starting our new podcast soon.\nEp 0 and Trailer out.\n\n \n\"The Pen that Writes\" is a podcast full of conversations around the lives of authors, their aspirations, muses, and stories behind the scenes of the books. A comforting space where we'll talk to our heart's content and cherish your work. All this is accompanied by a conversation around interesting insights about lives of authors and their motivation.\n\nSpotify:https://open.spotify.com/show/5JFkVnBDapockCNOfsxhbe?si=FaylRCd4QAiPxpsuWmMP_Q&amp;utm_source=copy-link&amp;dl_branch=1\n\nCheers !",
        "Saw 'Ray' on Netflix, based on a collection of short stories by Satyajit Ray. I'd say it's a pretty good one time watch.",
        "Tbh it's better than WW84. It is worth it for the first half. But it's much much better than WW84 and isn't cringe or badly made.",
        "La Llarona by Jayro Bustamante",
        "A friend coincidentally recommended this just a few moments ago. Is it on any streaming platform?",
        "Thanks but i have already watched it",
        "The Invisible Guest"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings",
    "cleaned_comments": "looking documentaries similar bob lazar havent seen bob lazar watch watching succession second time around havent watched better dark psychological comedy started watching barry hotstar yesterday much fun breezed past episodes time listening lot tifo podcasts euro fever completed monster anime days ago havent watched would highly recommend watch amazing show watching vempire diaries watched last year fan dr tenma try corporate season theres episode called ronnylilly ready blow socks seen nerdwriter vid finished watching become tyrant netflix narrated peter dinklage loved also im really liking capitalminds podcast wish frequent episodes though done watching whole thing thanks suggestion watched katla set beautiful iceland worth watch ragnarok netflix ofcourse black widow wanted go theatre liked barry watch dexter first seasons try barry hbo better still pretty good dark comedy already awesome show found ragnarok underwhelming although actors fantastic cast selection superb spoke like real dexter fan looking forward new limited season one best episodes tv show ive ever seen thanks yeah love characters casting completed erasedanime soooooo goooood hours long would look words comment alphabetical order checked comments alphabetical order hipster anything watched seasons dexter original run gave th frustrated season ended frankly glad edit agree shouldve called trinity killer everything downhill btw lot shows would ended classics kept short didnt linger even ran ideas awesome looking forward loved ted lasso similar recommendations started simpsons asked around people told start season watched bart gets f goddamn relatable love show already watching ghost shell stand alone complex tv series saw mouse korean loved highly rated imdb gt serial killer thriller stuff series watch also watched castlevania seasons goddamn action amazing well death amazing stunt show kerela become tyrant netflix ok u watched series called mouse fuck im dumb searching saw mouse nd got strange results thought saw tool didnt check imdb link also lol ive seen original movie either columbus somewhat faithful original manga overall much better worldbuilding lighthearted original manga watch first get know technical jargon go original movie even chronology opposite liked barry might like mr inbetween thanks elaborate comment definitely check also morning show mind sucker anything sports background ted lasso right thing currently watching realised narrator peter dinklage saw creditsthe voice seem familiar shadows taika waititi recommend enough today wife started watching tv series name executive produced waititi far hilarious mans genius also would strongly recommend hunt wilderpeople course jojo rabbit also rewatching coupling probably steven moffats better work show living hype created lol tv show stars matt berry recommend toast london another show lead well one creators also recommend crowd matt berry watched black widow weekend okiesh doesnt blow away like mcu movies anyone recommendations good reality shows cooking show also ok like masterchef australia watched watching feat street part amp okaish nothing new retro slasher pastime exactly related guys recommend tv doesnt run software issuesi away home mom whos really good technology would ideally want smart tv reviews amazon worry often run issues mainly software related hence need help budget k inch fine full hd good reliable shouldnt need much maintenance mom would watching cable mostly maybe youtube theres wifi sure mom knows run hotspot teach though also extended warranty worth instead smart tv consider fire tv stick would need teach use fairly simple wont run software issues also cheaper looking smart tv wish add smart features suggest buy fire tv edition tv basically means tvs os fire os firestick way dont separately buy fire stick fireos based tvs work well one onida brand one amazonbasics brand know inch mostly come p even get p may relatively expensive english dub available know many people despise watched dubbed content also opinion stuff like dubbed like currently watching naked directory original japanese language english subtitles even saw narcos way watched lupin english dub one suggestion mods please try post last threads link latest thread gullak season season best indian tv series sony liv good original content shitty app uiammohit speaking crowd folks watch submarine directed richard ayoade think originally tvf basically sonyliv content tvf different shows like yeh meri family making exclusive content ott platforms right think make shown multiple platforms guess app isnt working well youtube plethora videos gets lost guess good idea thanks thanks watched collar bomb wanted bollywood content dont make mistake black widow yall think worth seeing thinking ending things crazy movie might require bit reading later order understand fully loved movie watched back read bunch articles understand movie fully haha looking spanish thrillerhorror movies suggestions something like wildtalesthe platformrec lot big netflix shows getting sequel seasons yeari advise people catch haventthe witcher sex education ozark stranger things money heist cobra kai name big baddies books authorsthe pen writes starting new podcast soon ep trailer pen writes podcast full conversations around lives authors aspirations muses stories behind scenes books comforting space well talk hearts content cherish work accompanied conversation around interesting insights lives authors motivation spotifyhttpsopenspotifycomshowjfkvnbdapockcnofsxhbesifaylrcdqaipxpsuwmmpqamputmsourcecopylinkampdlbranch cheers saw ray netflix based collection short stories satyajit ray id say pretty good one time watch tbh better ww worth first half much much better ww isnt cringe badly made la llarona jayro bustamante friend coincidentally recommended moments ago streaming platform thanks already watched invisible guest",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **The Movies and Shows Thread is posted every two weeks on Saturday mornings.**",
    "light_cleaned_comments": "Looking for documentaries similar to Bob Lazar And if you haven't seen Bob Lazar do watch it Watching Succession second time around, haven’t watched a better dark psychological comedy Started watching Barry on Hotstar yesterday. So much fun. Breezed past 3 episodes in no time. Other than that, I am listening to a lot of TIFO podcasts because of the Euro fever. Completed Monster (Anime) about 3-4 days ago. If you haven't watched it, I would highly recommend that you watch it. Amazing show. watching vempire diaries I watched it last year. Now I am fan Dr Tenma Try Corporate In season 2, there’s an episode called ronny/lilly. Be ready to blow your socks off. Seen the nerdwriter vid on it? Finished watching How to Become a Tyrant on Netflix! Narrated by Peter Dinklage, loved it. Also, I’m really liking CapitalMinds podcast I wish they were more frequent with their episodes though. No! Will do once I am done watching the whole thing again! Thanks for the suggestion. Watched Katla. Set in beautiful iceland. Worth a watch! Ragnarok on netflix. And ofcourse Black Widow. Wanted to go to theatre for this but 😔 if you liked barry, then watch dexter (only first 4 seasons) Try Barry on HBO. It's not better but still a pretty good dark comedy Already did :) Awesome show! I found Ragnarok underwhelming, although actors are fantastic and cast selection is superb. Spoke like a real Dexter fan, looking forward to the new limited season! that was one of the best episodes of any tv show I've ever seen Thanks, will do. Yeah I love the characters and casting the most Completed Erased(Anime) Soooooo Goooood. Only 4 hours long Would you look at that, all of the words in your comment are in alphabetical order. I have checked 72,240,827 comments, and only 20,188 of them were in alphabetical order. Not being hipster or anything but I watched the 7 seasons of Dexter during their original run. Gave up on 8th as I was frustrated on how Season 7 ended. And frankly I am glad that I did. Edit: Agree that they should've called it of after the Trinity Killer. Everything was downhill from there. BTW, a lot of shows would have ended up classics if they kept it short and didn't linger even after they ran out of ideas. Awesome! Looking forward to it. Loved Ted Lasso. Any similar recommendations? Started Simpsons. I asked around and people told me to start with season 2 Watched \"Bart gets an F\" Goddamn its so relatable. I love this show already Watching Ghost in the Shell: Stand Alone Complex tv series Saw Mouse - Korean . Loved it Highly rated on IMDB &gt; 8 . Serial Killer Thriller stuff It's a series : You can watch it here : Also watched Castlevania all seasons. Goddamn the action is amazing ‘Well of Death’ amazing stunt show. Kerela How to Become a Tyrant on Netflix. Ok u watched the series called mouse, fuck I'm so dumb I was searching for saw mouse😂 nd got strange results, thought saw was that tool, I didn't check that IMDb link also, LoL How is it? I've not seen the original movie either Columbus 2017 It is somewhat more faithful to the original manga, overall it has much better world-building and is more light-hearted than the original manga, you should watch it first to get to know all the technical jargon, then go to the original movie even if the chronology is opposite. If you liked Barry, you might like Mr Inbetween. Thanks for the elaborate comment. Will definitely check them out. I also had The Morning Show in mind. I am a sucker for anything having a sports background so Ted Lasso was just the right thing. Currently watching it too. Realised the narrator was Peter Dinklage after I saw credits.(the voice did seem familiar) What We Do in the Shadows by Taika Waititi, cannot recommend this enough. Today wife and I started watching the TV series of the same name (executive produced by Waititi), so far hilarious. Man's a genius. Also would strongly recommend Hunt for the Wilderpeople, and of course Jojo Rabbit. Also, rewatching Coupling, probably some of Steven Moffat's better work, but the show is not living up to the hype I had created, lol. The TV show What We Do stars Matt Berry. Will recommend The Toast of London, another show with him as the lead, as well as one of the creators. +1 also recommend IT Crowd with matt berry! +1 Watched \"Black Widow\" over the weekend. It was okiesh. Doesn't blow you away like some other MCU movies. Anyone has recommendations for any good reality shows? Cooking show also ok. We like Masterchef Australia and have watched it (and watching it). Feat Street Part 1 &amp; 2: Okaish, nothing new, retro slasher pastime. Not exactly related.. But can you guys recommend me a TV that doesn't run into software issues?I am away from home and this is for my mom, who's not really good with technology. I would ideally want a smart TV but the reviews on Amazon worry me. They often run into issues mainly software related. Hence, need your help. Budget is below 20K and 32inch is fine. Full HD is good, but again it should be reliable and shouldn't need much maintenance. Mom would just be watching cable mostly, and maybe YouTube. But, there's no wifi and I am not sure if my mom knows how to run a hotspot. I can teach her that though Also, is extended warranty worth it? Instead of a smart TV, consider Fire TV stick. You would need to teach her how to use it, but it's fairly simple and it won't run into software issues. Also cheaper. if you are looking for a smart tv or wish to add smart features, I suggest buy a Fire TV edition TV which basically means that the TV's OS is Fire OS (same on in firestick). This way you don't have to separately buy fire stick and FireOS based TVs work well too. I have 2 of them. One from Onida brand and one from amazonbasics brand. Just so you know, 32 Inch mostly will come as 720p. Even if you get 1080p, it may be relatively more expensive. Is there english dub available? I know many people despise watched dubbed content and I am also of same opinion but for stuff I do like it dubbed. Like I am currently watching \"The Naked Directory\" in original Japanese language with English subtitles and even saw Narcos that way. But watched Lupin in English dub. One suggestion for the mods here. Please try to post the last thread's link in the latest thread. Gullak season 1 and Season 2 best Indian tv series. Sony liv has very good original content but a very shitty app. /u/IAmMohit ^^ Speaking of IT Crowd, folks should watch Submarine. It's directed by Richard Ayoade. I think originally it is from TVF. So basically it is not sonyliv content, it is from TVF. Same with their different shows like \"Yeh Meri Family\". they are now making exclusive content for ott platforms. Right but I think they make and it is shown on multiple platforms. I guess their own app isn't working that well for them and on youtube, with plethora of videos, it gets lost I guess. Good idea.. Thanks! Thanks!!! Watched Collar Bomb just because I wanted some Bollywood content. Don't make the same mistake. black widow what y'all think about it, is it worth seeing.. I am thinking of Ending things . Crazy movie. Might require a bit reading later in order to understand it fully. I loved that movie watched it a while back had to read bunch of articles to understand the movie fully haha Looking from Spanish thriller/horror movies any suggestions? Something like wildtales/the platform/rec. A lot of big Netflix shows getting their sequel seasons this year....I advise people to catch up on them if they haven't...The Witcher, Sex education, Ozark, You, Stranger Things, Money Heist, Cobra Kai to name some of the big baddies.... Books and Authors)The Pen that Writes We are starting our new podcast soon. Ep 0 and Trailer out. \"The Pen that Writes\" is a podcast full of conversations around the lives of authors, their aspirations, muses, and stories behind the scenes of the books. A comforting space where we'll talk to our heart's content and cherish your work. All this is accompanied by a conversation around interesting insights about lives of authors and their motivation. Spotify:https://open.spotify.com/show/5JFkVnBDapockCNOfsxhbe?si=FaylRCd4QAiPxpsuWmMP_Q&amp;utm_source=copy-link&amp;dl_branch=1 Cheers ! Saw 'Ray' on Netflix, based on a collection of short stories by Satyajit Ray. I'd say it's a pretty good one time watch. Tbh it's better than WW84. It is worth it for the first half. But it's much much better than WW84 and isn't cringe or badly made. La Llarona by Jayro Bustamante A friend coincidentally recommended this just a few moments ago. Is it on any streaming platform? Thanks but i have already watched it The Invisible Guest"
}