{
    "id": "180j9ft",
    "title": "Gas Cylinder Jumla",
    "url": "https://i.redd.it/xx5pqv9hwp1c1.jpeg",
    "selftext": "When I came to India in 2018, home use gas cylinders were priced around INR 800/- ( and then the subsidy) coming to a total of about INR 600/- for the end user.\n\nFor this you needed to have an Adhaar card and I remember the masses standing in long queues to get their Adhaar card so as to link it with their bank account so as to avail the gas subsidy promised by the government. \n\nAnd then suddenly when almost everybody got their Adhar card and government had collected enough data, one day the government stopped this subsidy in 2020. \n\nNow the price of a  cylinder comes to INR 1,100/- for the end user , which is almost 83% more than 2018 or if divided among the past 4 years this is an yearly hike of 21%.\n\nAs someome privileged enough to not be bothered if the cylinder costs INR 500 or INR 2,000  it baffles me how the ones most affected by these price hikes are the ones who mostly keeps falling for these jumlas one after the other put forth by the government with the face of the mass hypnotizer.\n\nGovernment using yet another festival to further push their agenda and brainwash the already braindead public. \n\nIsn't it time yet to wake up ?\n\nPhoto clicked in an HP gas station in kerala using my phone",
    "flair": "Rant / Vent",
    "score": 103,
    "num_comments": 32,
    "created_utc": 1700579676.0,
    "convurl": "https://i.redd.it/xx5pqv9hwp1c1.jpeg",
    "comments": [
        "Hi are you aware of something called inflation and covid market shortage or loss\n\nThe price of LPG gas in India has been rising since November 2020 due to a steady increase in crude prices due to the recovery in demand following the easing of Covid restrictions, slow restoration of production by oil exporters, and the Russia-Ukraine war. India's LPG prices are benchmarked to international prices of petroleum gas.",
        "phonpe still shows my last cylinder purchase from may2020 . only 596rs",
        "Whoever made this poster should be arrested. The picture of the woman is the same size as PM Modi's. (/s).",
        "Life sentence",
        "Inflation and global prices. Also, here it's under 950 and not 1100 (Delhi and Himachal)",
        "wtf you have been living under a rock or something do you know about infaltion russia ukraine war and its implication in india gas is still cheap in usa and eurple it costs litrall 10s of euros YOU are brainwashed into thinking everything is goverments fault and scheme\n\nand the subsidy was not stopped some random day in random year it stopped in fucking 2020 global pandemic covid budget deficit was there to cope with the virus hence subidy was stopped \n\nseriously the ignorence",
        "What happened to the subsidy? Earlier we used to get like ₹150-200, now nothing.",
        "Are bodsike, mudi chhaap. He took away the subsidy that public had . Now go on and rant how subsidies are bad",
        "To all the bodsike, mudi chhaap coting inflation and what not. He took away the subsidy that public had thats. Now go on and rant how subsidies are bad while adani , ambani , and all bank absconders live in written of asset money and taxes",
        "Russia Ukraine war started in February 2022. \n\nI won't get into an argument.\nWe all know about inflation Mr. Economist, the point being inflation control and subsidy is part of government's responsibility.\n\nSubsidy stopped in June 2020, 2 months into pandemic, within 2 months government lost all its revenue ? \n\nYou're aware of fuel prices in Nepal ?",
        "UAPA for her next 3 generations",
        "Where did the subsidy go? \nWhy is almost 50% of the cost of fuel only taxes?\nIf govt is in need of funds why are you trying to get it from your poor to middle class citizens and not from your billion dollar businesses?",
        "because world is not perfect the rich who are taxed 30% ALWAYS find ways to not give tax its not govt. fault its the pittifullness of people there is no unbiased or DEMOCRATIC  system through which the rich can be efficiently taxed \n\nand 50% taxes is for all the transport cost and cost to recover the money put into its purchase and transport",
        "“Bhaiyo behenooooo, ye revdi culture, desh ko barbaad kar raha hai”",
        "\"Russia Ukraine war started in February 2022.\" thats when the price started to go crazy and also after that and during covid the suppliers of gas and oil started to raise the prize of oil and gas \n\n\"Subsidy stopped in June 2020, 2 months into pandemic, within 2 months government lost all its revenue ?\"\n\nso what the govt should have waited till all its revenue depleted to stop it 1 month n covid it was evident that covid will stay of quite a bit so budget was planned accordingly\n\n\"inflation control and subsidy is part of government's responsibility.\"\n\nyes inflation control is and its being done but steadly ,to control inflation that too the uneven demand and ditribution of currency slow and carefull steps need to be taken to control inflation the intrest rates (RBI)need to be adjusted and cutting flow of currency is required  but thats just not easy in countrylike india because of its massive population with many in below middle class \n\nand as for subsidy its a blessing not a required thing that govt needs to do subsidies are to AID the people not make people totally dependent on them \n\noverall if control of fuel and gas prises was the only concern it could have been stable but at the cost of expenditure cuts, and diverting large amount of funds to it which is not possiblr\n\n(and serioulsy comparing india with  nepal do you know the size diffrence in every aspect more poplulation more land much more diverse and bigger economy much more expenses much bigger market much bigger supply )",
        "That is a great excuse. If I continue believing this excuse, there is something even more bizarre. \n\nFuel prices dropped in international market later on, then why didn't this happen in India? The prices are not benchmarked to anything. Either you are misinformed, or spreading false information. The fuel prices continued to increase while it was getting cheaper in international market. And even if we were to believe the rising fuel price excuse, what made them being able to provide subsidy now? Recently, they gave subsidy of 400 rs or so. Just before elections are about to be held.\n\nAnd the fact is we were buying oil from Russia at a much cheaper rate compared to intl markets. So, please spare the excuse of inflation and covid market.\n\nSo, initially they raised the prices owing to \"inflation and covid market\". Then they started buying cheaper oil from Russia. After that oil prices dropped in intl market. But gas prices stayed the same.",
        ">rich who are taxed 30%\n\nI'm not talking about the income taxes but corporate taxes which have been reduced by the current government. Tenders are rigged to give the favourite ones all the support even if there were higher bids (read Dharavi project). No action is taken by SEBI against companies for shady practices and share price inflation. All of this and many more things show that the government works hand in hand with the billionaires.\n\n>and 50% taxes is for all the transport cost and cost to recover the money put into its purchase and transport\n\nYou'll be surprised to know the cost of fuel already takes into consideration the cost of transport, labour and a cut for the fuel station which as of now would be at an average 50 rupees, the remaining 50 is solely taxes! Which again is split between centre and state.\n\nNo democracy is perfect, no government can do everything. But we need to stop defending their actions and demand better from them, they work for us not us for them. If a majority of the people become spokespersons for the government they don't have to give 2 fucks about anybody as the masses don't care about any issues.",
        "Now hear another twist, in fual now we mix 30% (or gonna be) ethanol that's highest till date that also reduce the cost of fuel (in theory haha)",
        "Teaser price",
        "This is quite sexist. Why is this “gift” only for “our sisters”? Do “our brothers” not need/use LPG?",
        "? For this you needed to have an Adhaar card and I remember the masses standing in long queues to get their Adhaar card so as to link it with their bank account so as to avail the gas subsidy promised by the government.\n\n> And then suddenly when almost everybody got their Adhar card and government had collected enough data, one day the government stopped this subsidy in 2020.    \n\nOne more trick the BJP govt played on people to enroll them into an irrelevant, useless and dangerous Aadhaar scheme.",
        "wtf you have been living under a rock or something\n the subsidy was not stopped some random day in random year it stopped in fucking 2020 global pandemic covid budget deficit was there to cope with the virus hence subsidy was stopped \n\nseriously the ignorance",
        "That hasn't happened yet",
        "And while lockdown fuel prices were so low even at that time these looters pumped the prices at 100s .",
        "Adjust that inflation value in 15 lakhs which madi ji promised to pay us . Panauti madi .\n\nSo when fuel prices were low at COVID did they reduce the fuel price these ppls are only good at loot and weaving stories after a problem.",
        "Yes, true, but then the guy who is a blind supporter doesn't care.",
        "Is this the inflation you are mentioning ?\n\nhttps://www.ft.com/content/7aadb3d7-4a03-44ba-a01e-8ddd8bce29ed",
        "OP doesn’t live in India as already mentioned.",
        "Then he has no right to make such comments",
        "its for coal dumb bitch we are taking about petrol and gas kal tujhe cancer bhi hooye na too bhi  adani aur modi ko he blame kariyo",
        "Oh dumb bitch if coal price increases it won't affect any basic commodity price ffs read some econ books puzzy",
        "Always an excuse or sinister silence for the peoples suffering.   \n\nBut there is no dearth of funds for extravaganzas like G20 where more than 4 times the budgeted amount was spent."
    ],
    "cleaned_text": "gas cylinder jumla came india home use gas cylinders priced around inr subsidy coming total inr end user needed adhaar card remember masses standing long queues get adhaar card link bank account avail gas subsidy promised government suddenly almost everybody got adhar card government collected enough data one day government stopped subsidy price cylinder comes inr end user almost divided among past years yearly hike someome privileged enough bothered cylinder costs inr inr baffles ones affected price hikes ones mostly keeps falling jumlas one put forth government face mass hypnotizer government using yet another festival push agenda brainwash already braindead public isnt time yet wake photo clicked hp gas station kerala using phone ",
    "cleaned_title": "gas cylinder jumla",
    "cleaned_selftext": "came india home use gas cylinders priced around inr subsidy coming total inr end user needed adhaar card remember masses standing long queues get adhaar card link bank account avail gas subsidy promised government suddenly almost everybody got adhar card government collected enough data one day government stopped subsidy price cylinder comes inr end user almost divided among past years yearly hike someome privileged enough bothered cylinder costs inr inr baffles ones affected price hikes ones mostly keeps falling jumlas one put forth government face mass hypnotizer government using yet another festival push agenda brainwash already braindead public isnt time yet wake photo clicked hp gas station kerala using phone",
    "cleaned_comments": "hi aware something called inflation covid market shortage loss price lpg gas india rising since november due steady increase crude prices due recovery demand following easing covid restrictions slow restoration production oil exporters russiaukraine war indias lpg prices benchmarked international prices petroleum gas phonpe still shows last cylinder purchase may rs whoever made poster arrested picture woman size pm modis life sentence inflation global prices also delhi himachal wtf living rock something know infaltion russia ukraine war implication india gas still cheap usa eurple costs litrall euros brainwashed thinking everything goverments fault scheme subsidy stopped random day random year stopped fucking global pandemic covid budget deficit cope virus hence subidy stopped seriously ignorence happened subsidy earlier used get like nothing bodsike mudi chhaap took away subsidy public go rant subsidies bad bodsike mudi chhaap coting inflation took away subsidy public thats go rant subsidies bad adani ambani bank absconders live written asset money taxes russia ukraine war started february wont get argument know inflation mr economist point inflation control subsidy part governments responsibility subsidy stopped june months pandemic within months government lost revenue youre aware fuel prices nepal uapa next generations subsidy go almost cost fuel taxes govt need funds trying get poor middle class citizens billion dollar businesses world perfect rich taxed always find ways give tax govt fault pittifullness people unbiased democratic system rich efficiently taxed taxes transport cost cost recover money put purchase transport bhaiyo behenooooo ye revdi culture desh ko barbaad kar raha hai russia ukraine war started february thats price started go crazy also covid suppliers gas oil started raise prize oil gas subsidy stopped june months pandemic within months government lost revenue govt waited till revenue depleted stop month n covid evident covid stay quite bit budget planned accordingly inflation control subsidy part governments responsibility yes inflation control done steadly control inflation uneven demand ditribution currency slow carefull steps need taken control inflation intrest rates rbineed adjusted cutting flow currency required thats easy countrylike india massive population many middle class subsidy blessing required thing govt needs subsidies aid people make people totally dependent overall control fuel gas prises concern could stable cost expenditure cuts diverting large amount funds possiblr serioulsy comparing india nepal know size diffrence every aspect poplulation land much diverse bigger economy much expenses much bigger market much bigger supply great excuse continue believing excuse something even bizarre fuel prices dropped international market later didnt happen india prices benchmarked anything either misinformed spreading false information fuel prices continued increase getting cheaper international market even believe rising fuel price excuse made able provide subsidy recently gave subsidy rs elections held fact buying oil russia much cheaper rate compared intl markets please spare excuse inflation covid market initially raised prices owing inflation covid market started buying cheaper oil russia oil prices dropped intl market gas prices stayed rich taxed im talking income taxes corporate taxes reduced current government tenders rigged give favourite ones support even higher bids read dharavi project action taken sebi companies shady practices share price inflation many things show government works hand hand billionaires taxes transport cost cost recover money put purchase transport youll surprised know cost fuel already takes consideration cost transport labour cut fuel station would average rupees remaining solely taxes split centre state democracy perfect government everything need stop defending actions demand better work us us majority people become spokespersons government dont give fucks anybody masses dont care issues hear another twist fual mix gon na ethanol thats highest till date also reduce cost fuel theory haha teaser price quite sexist gift sisters brothers needuse lpg needed adhaar card remember masses standing long queues get adhaar card link bank account avail gas subsidy promised government suddenly almost everybody got adhar card government collected enough data one day government stopped subsidy one trick bjp govt played people enroll irrelevant useless dangerous aadhaar scheme wtf living rock something subsidy stopped random day random year stopped fucking global pandemic covid budget deficit cope virus hence subsidy stopped seriously ignorance hasnt happened yet lockdown fuel prices low even time looters pumped prices adjust inflation value lakhs madi ji promised pay us panauti madi fuel prices low covid reduce fuel price ppls good loot weaving stories problem yes true guy blind supporter doesnt care inflation mentioning op doesnt live india already mentioned right make comments coal dumb bitch taking petrol gas kal tujhe cancer bhi hooye na bhi adani aur modi ko blame kariyo oh dumb bitch coal price increases wont affect basic commodity price ffs read econ books puzzy always excuse sinister silence peoples suffering dearth funds extravaganzas like g times budgeted amount spent",
    "light_cleaned_title": "Gas Cylinder Jumla",
    "light_cleaned_selftext": "When I came to India in 2018, home use gas cylinders were priced around INR 800/- ( and then the subsidy) coming to a total of about INR 600/- for the end user. For this you needed to have an Adhaar card and I remember the masses standing in long queues to get their Adhaar card so as to link it with their bank account so as to avail the gas subsidy promised by the government. And then suddenly when almost everybody got their Adhar card and government had collected enough data, one day the government stopped this subsidy in 2020. Now the price of a cylinder comes to INR 1,100/- for the end user , which is almost 83% more than 2018 or if divided among the past 4 years this is an yearly hike of 21%. As someome privileged enough to not be bothered if the cylinder costs INR 500 or INR 2,000 it baffles me how the ones most affected by these price hikes are the ones who mostly keeps falling for these jumlas one after the other put forth by the government with the face of the mass hypnotizer. Government using yet another festival to further push their agenda and brainwash the already braindead public. Isn't it time yet to wake up ? Photo clicked in an HP gas station in kerala using my phone",
    "light_cleaned_comments": "Hi are you aware of something called inflation and covid market shortage or loss The price of LPG gas in India has been rising since November 2020 due to a steady increase in crude prices due to the recovery in demand following the easing of Covid restrictions, slow restoration of production by oil exporters, and the Russia-Ukraine war. India's LPG prices are benchmarked to international prices of petroleum gas. phonpe still shows my last cylinder purchase from may2020 . only 596rs Whoever made this poster should be arrested. The picture of the woman is the same size as PM Modi's. (/s). Life sentence Inflation and global prices. Also, here it's under 950 and not 1100 (Delhi and Himachal) wtf you have been living under a rock or something do you know about infaltion russia ukraine war and its implication in india gas is still cheap in usa and eurple it costs litrall 10s of euros YOU are brainwashed into thinking everything is goverments fault and scheme and the subsidy was not stopped some random day in random year it stopped in fucking 2020 global pandemic covid budget deficit was there to cope with the virus hence subidy was stopped seriously the ignorence What happened to the subsidy? Earlier we used to get like ₹150-200, now nothing. Are bodsike, mudi chhaap. He took away the subsidy that public had . Now go on and rant how subsidies are bad To all the bodsike, mudi chhaap coting inflation and what not. He took away the subsidy that public had thats. Now go on and rant how subsidies are bad while adani , ambani , and all bank absconders live in written of asset money and taxes Russia Ukraine war started in February 2022. I won't get into an argument. We all know about inflation Mr. Economist, the point being inflation control and subsidy is part of government's responsibility. Subsidy stopped in June 2020, 2 months into pandemic, within 2 months government lost all its revenue ? You're aware of fuel prices in Nepal ? UAPA for her next 3 generations Where did the subsidy go? Why is almost 50% of the cost of fuel only taxes? If govt is in need of funds why are you trying to get it from your poor to middle class citizens and not from your billion dollar businesses? because world is not perfect the rich who are taxed 30% ALWAYS find ways to not give tax its not govt. fault its the pittifullness of people there is no unbiased or DEMOCRATIC system through which the rich can be efficiently taxed and 50% taxes is for all the transport cost and cost to recover the money put into its purchase and transport “Bhaiyo behenooooo, ye revdi culture, desh ko barbaad kar raha hai” \"Russia Ukraine war started in February 2022.\" thats when the price started to go crazy and also after that and during covid the suppliers of gas and oil started to raise the prize of oil and gas \"Subsidy stopped in June 2020, 2 months into pandemic, within 2 months government lost all its revenue ?\" so what the govt should have waited till all its revenue depleted to stop it 1 month n covid it was evident that covid will stay of quite a bit so budget was planned accordingly \"inflation control and subsidy is part of government's responsibility.\" yes inflation control is and its being done but steadly ,to control inflation that too the uneven demand and ditribution of currency slow and carefull steps need to be taken to control inflation the intrest rates (RBI)need to be adjusted and cutting flow of currency is required but thats just not easy in countrylike india because of its massive population with many in below middle class and as for subsidy its a blessing not a required thing that govt needs to do subsidies are to AID the people not make people totally dependent on them overall if control of fuel and gas prises was the only concern it could have been stable but at the cost of expenditure cuts, and diverting large amount of funds to it which is not possiblr (and serioulsy comparing india with nepal do you know the size diffrence in every aspect more poplulation more land much more diverse and bigger economy much more expenses much bigger market much bigger supply ) That is a great excuse. If I continue believing this excuse, there is something even more bizarre. Fuel prices dropped in international market later on, then why didn't this happen in India? The prices are not benchmarked to anything. Either you are misinformed, or spreading false information. The fuel prices continued to increase while it was getting cheaper in international market. And even if we were to believe the rising fuel price excuse, what made them being able to provide subsidy now? Recently, they gave subsidy of 400 rs or so. Just before elections are about to be held. And the fact is we were buying oil from Russia at a much cheaper rate compared to intl markets. So, please spare the excuse of inflation and covid market. So, initially they raised the prices owing to \"inflation and covid market\". Then they started buying cheaper oil from Russia. After that oil prices dropped in intl market. But gas prices stayed the same. >rich who are taxed 30% I'm not talking about the income taxes but corporate taxes which have been reduced by the current government. Tenders are rigged to give the favourite ones all the support even if there were higher bids (read Dharavi project). No action is taken by SEBI against companies for shady practices and share price inflation. All of this and many more things show that the government works hand in hand with the billionaires. >and 50% taxes is for all the transport cost and cost to recover the money put into its purchase and transport You'll be surprised to know the cost of fuel already takes into consideration the cost of transport, labour and a cut for the fuel station which as of now would be at an average 50 rupees, the remaining 50 is solely taxes! Which again is split between centre and state. No democracy is perfect, no government can do everything. But we need to stop defending their actions and demand better from them, they work for us not us for them. If a majority of the people become spokespersons for the government they don't have to give 2 fucks about anybody as the masses don't care about any issues. Now hear another twist, in fual now we mix 30% (or gonna be) ethanol that's highest till date that also reduce the cost of fuel (in theory haha) Teaser price This is quite sexist. Why is this “gift” only for “our sisters”? Do “our brothers” not need/use LPG? ? For this you needed to have an Adhaar card and I remember the masses standing in long queues to get their Adhaar card so as to link it with their bank account so as to avail the gas subsidy promised by the government. > And then suddenly when almost everybody got their Adhar card and government had collected enough data, one day the government stopped this subsidy in 2020. One more trick the BJP govt played on people to enroll them into an irrelevant, useless and dangerous Aadhaar scheme. wtf you have been living under a rock or something the subsidy was not stopped some random day in random year it stopped in fucking 2020 global pandemic covid budget deficit was there to cope with the virus hence subsidy was stopped seriously the ignorance That hasn't happened yet And while lockdown fuel prices were so low even at that time these looters pumped the prices at 100s . Adjust that inflation value in 15 lakhs which madi ji promised to pay us . Panauti madi . So when fuel prices were low at COVID did they reduce the fuel price these ppls are only good at loot and weaving stories after a problem. Yes, true, but then the guy who is a blind supporter doesn't care. Is this the inflation you are mentioning ? OP doesn’t live in India as already mentioned. Then he has no right to make such comments its for coal dumb bitch we are taking about petrol and gas kal tujhe cancer bhi hooye na too bhi adani aur modi ko he blame kariyo Oh dumb bitch if coal price increases it won't affect any basic commodity price ffs read some econ books puzzy Always an excuse or sinister silence for the peoples suffering. But there is no dearth of funds for extravaganzas like G20 where more than 4 times the budgeted amount was spent."
}