{
    "id": "14nl29p",
    "title": "Alternative to aspartame based sweeteners like \"Sugar Free Gold\" in India.",
    "url": "https://www.reddit.com/r/india/comments/14nl29p/alternative_to_aspartame_based_sweeteners_like/",
    "selftext": "Many of my diabetic relatives used aspartame based sweeteners like \"Sugar Free Gold\" for sweetening tea ,coffee etc. Till recently aspartame was approved by US FDA and European Food Safety Authority (EFSA) for consumption in recommended quantities daily.\n\nBut few days backs there were reports of studies which show  that aspartame can cause cancer.What  other sweeteners are available in India which diabetics can user, without having such side effects.\n\n\nhttps://www.reuters.com/business/healthcare-pharmaceuticals/whos-cancer-research-agency-say-aspartame-sweetener-possible-carcinogen-sources-2023-06-29/",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1688184197.0,
    "convurl": "https://external-preview.redd.it/9YuiH0ce3MMavlqj42an-l7YCcIZLRClAiF5UI5F3qE.jpg?auto=webp&v=enabled&s=ed29f280e1fed6fc6499b9fe355146e2cfea74cf",
    "comments": [
        "Maybe use something that had stevia in it. It is a plant based sweetener but without the calories or sugar. But be warned it does have an acquired taste",
        "Coconut sugar is really good"
    ],
    "cleaned_text": "alternative aspartame based sweeteners like sugar free gold india many diabetic relatives used aspartame based sweeteners like sugar free gold sweetening tea coffee etc till recently aspartame approved us fda european food safety authority efsa consumption recommended quantities daily days backs reports studies show aspartame cause cancerwhat sweeteners available india diabetics user without side effects ",
    "cleaned_title": "alternative aspartame based sweeteners like sugar free gold india",
    "cleaned_selftext": "many diabetic relatives used aspartame based sweeteners like sugar free gold sweetening tea coffee etc till recently aspartame approved us fda european food safety authority efsa consumption recommended quantities daily days backs reports studies show aspartame cause cancerwhat sweeteners available india diabetics user without side effects",
    "cleaned_comments": "maybe use something stevia plant based sweetener without calories sugar warned acquired taste coconut sugar really good",
    "light_cleaned_title": "Alternative to aspartame based sweeteners like \"Sugar Free Gold\" in India.",
    "light_cleaned_selftext": "Many of my diabetic relatives used aspartame based sweeteners like \"Sugar Free Gold\" for sweetening tea ,coffee etc. Till recently aspartame was approved by US FDA and European Food Safety Authority (EFSA) for consumption in recommended quantities daily. But few days backs there were reports of studies which show that aspartame can cause cancer.What other sweeteners are available in India which diabetics can user, without having such side effects.",
    "light_cleaned_comments": "Maybe use something that had stevia in it. It is a plant based sweetener but without the calories or sugar. But be warned it does have an acquired taste Coconut sugar is really good"
}