{
    "id": "1714mav",
    "title": "India ranks below Afghanistan in world Press Freedom Index.",
    "url": "https://www.reddit.com/r/india/comments/1714mav/india_ranks_below_afghanistan_in_world_press/",
    "selftext": "That's right. The \"mother of democracy\" now ranks below countries like Afghanistan, Somalia and even Pakistan. \n\nAlso from the country details section:\n\n*But the abundance of media outlets conceals tendencies toward the concentration of ownership, with only a handful of sprawling media companies at the national level, including the Times Group, HT Media Ltd, The Hindu Group and Network18.*\n\nhttps://rsf.org/en/index",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696571775.0,
    "convurl": "https://external-preview.redd.it/x7eIP4RaFRspNCadPTWl4NQqLr0I-x_CTTkD7JR2dO0.jpg?auto=webp&s=e8cd3efe3fe8ac00fd12a20e639445474daac99f",
    "comments": [
        "By ranking between countries, all these global rankings are hurting their own goals. Better to focus on each country's fall or improvement in score relative to its own older scores.",
        "What a joke. How can I take this ranking seriously?",
        "By reading the whole report. Highlighting if you find any discrepancies.",
        "You know those bhakts do have a point. Western media is actually biased against India. \n\nRemember when they ranked India below Pakistan for food security once? Literal months after that Pakistan started to have food supply shortages due to their economy collapsing.  \n\nI don't believe such stats anymore. If you really believe Afghanistan has freer press than India you are a gullible fuck.",
        "r/usernamedoesntchecksout",
        "Is there a news channel in India that criticizes government or covers news antithetical to government's agenda?",
        "Yes but websites from foreign are allowed. I can watch a Chinese news article of downsides of India. Apart from the whole BBC thing. You think in Afghanistan, you are free to insult Taliban?",
        "In an interview about the Press Freedom Index, P Sainath rightly said that the ranking of the Indian media in the index is actually generous. The fact is, it is easier for a media to criticise the Government in even Pakistan and Afghanistan.\n\nAccording to a CSDS survey, 80% of the journalists believe that their organization is too favorable to the Modi Government. Most of the news media operate as the propaganda machine of the ruling party. \n\nGodi media often suppresses important issues if it is against the ruling party. The story of Adani scam was suppressed. There has been hardly any discussion on Manipur. Or unemployment.\n\nThe few journalists who dare to question the Government are persecuted. Siddique Kappan was jailed for over two years. Many journalists have been targeted and even jailed. In 2019, Modi Government withdrew advertisement from three newspapers who were critical of the Government. Dainik Bhaskar was raided for COVID coverage.\n\n[67 journalists arrested, detained, questioned in India in 2020 for their work | The News Minute](https://www.thenewsminute.com/article/67-journalists-arrested-detained-questioned-india-2020-their-work-140963 \"67 journalists arrested, detained, questioned in India in 2020 for their work | The News Minute\")\n\n[Man who questioned UP minister about development work arrested | Cities News,The Indian Express](https://indianexpress.com/article/cities/delhi/journalist-arrested-up-sambhal-questions-minister-development-work-8495655/ \"Man who questioned UP minister about development work arrested | Cities News,The Indian Express\")\n\n[Eight including journalist stripped at MP police station; probe ordered | Cities News,The Indian Express](https://indianexpress.com/article/cities/bhopal/mp-photo-of-men-stripped-at-police-station-goes-viral-inquiry-ordered-7858717/ \"Eight including journalist stripped at MP police station; probe ordered | Cities News,The Indian Express\")\n\n[Siddique Kappan: Indian journalist released from jail after two years - BBC News](https://www.bbc.com/news/world-asia-india-64494426 \"Siddique Kappan: Indian journalist released from jail after two years - BBC News\")\n\n[Eleven Journalists Killed, 46 Attacked, 27 Cases of Police Action: Report on Press Freedom 2017](https://thewire.in/media/eleven-journalists-killed-46-attacked-27-cases-police-action-report-press-freedom-2017 \"Eleven Journalists Killed, 46 Attacked, 27 Cases of Police Action: Report on Press Freedom 2017\")\n\n[In Yogi's UP, 48 Journalists Assaulted, 66 Booked, 12 Killed: Report](https://thewire.in/media/in-yogis-up-48-journalists-assaulted-66-booked-12-killed-report \"In Yogi's UP, 48 Journalists Assaulted, 66 Booked, 12 Killed: Report\")\n\n[Attacks on journalists: Nearly 200 serious instances since 2014, forty died](https://scroll.in/latest/947640/40-indian-journalists-killed-nearly-200-faced-serious-attacks-since-2014-study \"Attacks on journalists: Nearly 200 serious instances since 2014, forty died\")\n\nRecently, Mumbai bureau chief of NDTV quit after he was asked to create disturbance in Rahul Gandhi's press conference. Many journalists have been fired or have quit because for their reporting.\n\nThen there is the point of hateful and communal propaganda. Several media houses have been fined for communal reporting. Supreme Court had called it a chief medium of hate speech, and asked the Government to take action against them.",
        "> You know those bhakts do have a point. Western media is actually biased against India.\n\nIts a questionnaire based ranking, not data based. It should be read more as what is the perception of journalists on their own country based on their freedom and ability to work honestly.\n\nYou can read methodology than falling for conspiracy theories like a dumb person.",
        ">the perception of journalists on their own country based on their freedom and ability to work honestly.\n\nSelf reported data is even more unreliable.",
        "We do have a lot of issues, we also have pro and Anti govt journalists, journalists with ideological bias. This was the case when UPA was in power and when NDA is in power. Once the next govt comes to power, these guys will jump ship. But our ranking below AFG, reduces the credibility of the rfs.org itself.",
        "Lol what?",
        "India has done well on food security index and it is constantly improving on that front - not sure what you are talking about. I think it wrong to look at these lists as some sort of entrance exam merit list and focus on ranking. \n\nWhat really matters in these lists and scores is \"are things improving or regressing\". Food security in India is improving without a doubt."
    ],
    "cleaned_text": "india ranks afghanistan world press freedom index thats right mother democracy ranks countries like afghanistan somalia even pakistan also country details section abundance media outlets conceals tendencies toward concentration ownership handful sprawling media companies national level including times group ht media ltd hindu group network ",
    "cleaned_title": "india ranks afghanistan world press freedom index",
    "cleaned_selftext": "thats right mother democracy ranks countries like afghanistan somalia even pakistan also country details section abundance media outlets conceals tendencies toward concentration ownership handful sprawling media companies national level including times group ht media ltd hindu group network",
    "cleaned_comments": "ranking countries global rankings hurting goals better focus countrys fall improvement score relative older scores joke take ranking seriously reading whole report highlighting find discrepancies know bhakts point western media actually biased india remember ranked india pakistan food security literal months pakistan started food supply shortages due economy collapsing dont believe stats anymore really believe afghanistan freer press india gullible fuck rusernamedoesntchecksout news channel india criticizes government covers news antithetical governments agenda yes websites foreign allowed watch chinese news article downsides india apart whole bbc thing think afghanistan free insult taliban interview press freedom index p sainath rightly said ranking indian media index actually generous fact easier media criticise government even pakistan afghanistan according csds survey journalists believe organization favorable modi government news media operate propaganda machine ruling party godi media often suppresses important issues ruling party story adani scam suppressed hardly discussion manipur unemployment journalists dare question government persecuted siddique kappan jailed two years many journalists targeted even jailed modi government withdrew advertisement three newspapers critical government dainik bhaskar raided covid coverage journalists arrested detained questioned india work news minutehttpswwwthenewsminutecomarticlejournalistsarresteddetainedquestionedindiatheirwork journalists arrested detained questioned india work news minute man questioned minister development work arrested cities newsthe indian expresshttpsindianexpresscomarticlecitiesdelhijournalistarrestedupsambhalquestionsministerdevelopmentwork man questioned minister development work arrested cities newsthe indian express eight including journalist stripped mp police station probe ordered cities newsthe indian expresshttpsindianexpresscomarticlecitiesbhopalmpphotoofmenstrippedatpolicestationgoesviralinquiryordered eight including journalist stripped mp police station probe ordered cities newsthe indian express siddique kappan indian journalist released jail two years bbc newshttpswwwbbccomnewsworldasiaindia siddique kappan indian journalist released jail two years bbc news eleven journalists killed attacked cases police action report press freedom httpsthewireinmediaelevenjournalistskilledattackedcasespoliceactionreportpressfreedom eleven journalists killed attacked cases police action report press freedom yogis journalists assaulted booked killed reporthttpsthewireinmediainyogisupjournalistsassaultedbookedkilledreport yogis journalists assaulted booked killed report attacks journalists nearly serious instances since forty diedhttpsscrollinlatestindianjournalistskillednearlyfacedseriousattackssincestudy attacks journalists nearly serious instances since forty died recently mumbai bureau chief ndtv quit asked create disturbance rahul gandhis press conference many journalists fired quit reporting point hateful communal propaganda several media houses fined communal reporting supreme court called chief medium hate speech asked government take action know bhakts point western media actually biased india questionnaire based ranking data based read perception journalists country based freedom ability work honestly read methodology falling conspiracy theories like dumb person perception journalists country based freedom ability work honestly self reported data even unreliable lot issues also pro anti govt journalists journalists ideological bias case upa power nda power next govt comes power guys jump ship ranking afg reduces credibility rfsorg lol india done well food security index constantly improving front sure talking think wrong look lists sort entrance exam merit list focus ranking really matters lists scores things improving regressing food security india improving without doubt",
    "light_cleaned_title": "India ranks below Afghanistan in world Press Freedom Index.",
    "light_cleaned_selftext": "That's right. The \"mother of democracy\" now ranks below countries like Afghanistan, Somalia and even Pakistan. Also from the country details section: *But the abundance of media outlets conceals tendencies toward the concentration of ownership, with only a handful of sprawling media companies at the national level, including the Times Group, HT Media Ltd, The Hindu Group and Network18.*",
    "light_cleaned_comments": "By ranking between countries, all these global rankings are hurting their own goals. Better to focus on each country's fall or improvement in score relative to its own older scores. What a joke. How can I take this ranking seriously? By reading the whole report. Highlighting if you find any discrepancies. You know those bhakts do have a point. Western media is actually biased against India. Remember when they ranked India below Pakistan for food security once? Literal months after that Pakistan started to have food supply shortages due to their economy collapsing. I don't believe such stats anymore. If you really believe Afghanistan has freer press than India you are a gullible fuck. r/usernamedoesntchecksout Is there a news channel in India that criticizes government or covers news antithetical to government's agenda? Yes but websites from foreign are allowed. I can watch a Chinese news article of downsides of India. Apart from the whole BBC thing. You think in Afghanistan, you are free to insult Taliban? In an interview about the Press Freedom Index, P Sainath rightly said that the ranking of the Indian media in the index is actually generous. The fact is, it is easier for a media to criticise the Government in even Pakistan and Afghanistan. According to a CSDS survey, 80% of the journalists believe that their organization is too favorable to the Modi Government. Most of the news media operate as the propaganda machine of the ruling party. Godi media often suppresses important issues if it is against the ruling party. The story of Adani scam was suppressed. There has been hardly any discussion on Manipur. Or unemployment. The few journalists who dare to question the Government are persecuted. Siddique Kappan was jailed for over two years. Many journalists have been targeted and even jailed. In 2019, Modi Government withdrew advertisement from three newspapers who were critical of the Government. Dainik Bhaskar was raided for COVID coverage. [67 journalists arrested, detained, questioned in India in 2020 for their work | The News Minute](https://www.thenewsminute.com/article/67-journalists-arrested-detained-questioned-india-2020-their-work-140963 \"67 journalists arrested, detained, questioned in India in 2020 for their work | The News Minute\") [Man who questioned UP minister about development work arrested | Cities News,The Indian Express](https://indianexpress.com/article/cities/delhi/journalist-arrested-up-sambhal-questions-minister-development-work-8495655/ \"Man who questioned UP minister about development work arrested | Cities News,The Indian Express\") [Eight including journalist stripped at MP police station; probe ordered | Cities News,The Indian Express](https://indianexpress.com/article/cities/bhopal/mp-photo-of-men-stripped-at-police-station-goes-viral-inquiry-ordered-7858717/ \"Eight including journalist stripped at MP police station; probe ordered | Cities News,The Indian Express\") [Siddique Kappan: Indian journalist released from jail after two years - BBC News](https://www.bbc.com/news/world-asia-india-64494426 \"Siddique Kappan: Indian journalist released from jail after two years - BBC News\") [Eleven Journalists Killed, 46 Attacked, 27 Cases of Police Action: Report on Press Freedom 2017](https://thewire.in/media/eleven-journalists-killed-46-attacked-27-cases-police-action-report-press-freedom-2017 \"Eleven Journalists Killed, 46 Attacked, 27 Cases of Police Action: Report on Press Freedom 2017\") [In Yogi's UP, 48 Journalists Assaulted, 66 Booked, 12 Killed: Report](https://thewire.in/media/in-yogis-up-48-journalists-assaulted-66-booked-12-killed-report \"In Yogi's UP, 48 Journalists Assaulted, 66 Booked, 12 Killed: Report\") [Attacks on journalists: Nearly 200 serious instances since 2014, forty died](https://scroll.in/latest/947640/40-indian-journalists-killed-nearly-200-faced-serious-attacks-since-2014-study \"Attacks on journalists: Nearly 200 serious instances since 2014, forty died\") Recently, Mumbai bureau chief of NDTV quit after he was asked to create disturbance in Rahul Gandhi's press conference. Many journalists have been fired or have quit because for their reporting. Then there is the point of hateful and communal propaganda. Several media houses have been fined for communal reporting. Supreme Court had called it a chief medium of hate speech, and asked the Government to take action against them. > You know those bhakts do have a point. Western media is actually biased against India. Its a questionnaire based ranking, not data based. It should be read more as what is the perception of journalists on their own country based on their freedom and ability to work honestly. You can read methodology than falling for conspiracy theories like a dumb person. >the perception of journalists on their own country based on their freedom and ability to work honestly. Self reported data is even more unreliable. We do have a lot of issues, we also have pro and Anti govt journalists, journalists with ideological bias. This was the case when UPA was in power and when NDA is in power. Once the next govt comes to power, these guys will jump ship. But our ranking below AFG, reduces the credibility of the rfs.org itself. Lol what? India has done well on food security index and it is constantly improving on that front - not sure what you are talking about. I think it wrong to look at these lists as some sort of entrance exam merit list and focus on ranking. What really matters in these lists and scores is \"are things improving or regressing\". Food security in India is improving without a doubt."
}