{
    "id": "1hen2bw",
    "title": "Atul Subhash suicide: After asking man to pay Rs 5 crore in an old divorce case, SC lists 8 factors to decide alimony - The Economic Times",
    "url": "https://m.economictimes.com/wealth/save/atul-subhash-suicide-after-asking-man-to-pay-rs-5-crore-in-an-old-divorce-case-sc-lists-8-factors-to-decide-alimony/articleshow/116287155.cms",
    "selftext": "As per the Supreme Court here are the factors which are used as reference for deciding alimony are:\n\n> 1. *Status of the parties, social and financial*\n\n> 2. *Reasonable needs of the wife and the dependent children*\n\n>3. *Parties' individual qualifications and employment statuses*\n\n>4. *Independent income or assets owned by the applicant*\n\n>5. *Standard of life enjoyed by the wife in the matrimonial home*\n\n>6. *Any employment sacrifices made for the family responsibilities*\n\n>7. *Reasonable litigation costs for a non-working wife*\n\n>8. *Financial capacity of the husband, his income, maintenance obligations, and liabilities*",
    "flair": "Law & Courts",
    "score": 21,
    "num_comments": 7,
    "created_utc": 1734245571.0,
    "convurl": "https://external-preview.redd.it/O4EjJ_RPj7kw-hhY3N_N5NjMvYUoW0QWNUPB0WyGMaI.jpg?auto=webp&s=cc6e9ea18403774cbce98b0b884afd79464ce3dd",
    "comments": [
        "Very sad. For the supreme court to become reasonable, a man has to commit suicide?!",
        "Der aaye, durust aaye",
        "Bohot zyada der se aaye bhai. Banda chala gaya humara iske liye",
        "Sadly yes, all we can do now is save more lives!",
        "It had nothing to do with Atul case. Read the article please",
        "I never said that it did. I just said that it was long overdue and it's good that it has come!"
    ],
    "cleaned_text": "atul subhash suicide asking man pay rs crore old divorce case sc lists factors decide alimony economic times per supreme court factors used reference deciding alimony status parties social financial reasonable needs wife dependent children parties individual qualifications employment statuses independent income assets owned applicant standard life enjoyed wife matrimonial home employment sacrifices made family responsibilities reasonable litigation costs nonworking wife financial capacity husband income maintenance obligations liabilities ",
    "cleaned_title": "atul subhash suicide asking man pay rs crore old divorce case sc lists factors decide alimony economic times",
    "cleaned_selftext": "per supreme court factors used reference deciding alimony status parties social financial reasonable needs wife dependent children parties individual qualifications employment statuses independent income assets owned applicant standard life enjoyed wife matrimonial home employment sacrifices made family responsibilities reasonable litigation costs nonworking wife financial capacity husband income maintenance obligations liabilities",
    "cleaned_comments": "sad supreme court become reasonable man commit suicide der aaye durust aaye bohot zyada der se aaye bhai banda chala gaya humara iske liye sadly yes save lives nothing atul case read article please never said said long overdue good come",
    "light_cleaned_title": "Atul Subhash suicide: After asking man to pay Rs 5 crore in an old divorce case, SC lists 8 factors to decide alimony - The Economic Times",
    "light_cleaned_selftext": "As per the Supreme Court here are the factors which are used as reference for deciding alimony are: > 1. *Status of the parties, social and financial* > 2. *Reasonable needs of the wife and the dependent children* >3. *Parties' individual qualifications and employment statuses* >4. *Independent income or assets owned by the applicant* >5. *Standard of life enjoyed by the wife in the matrimonial home* >6. *Any employment sacrifices made for the family responsibilities* >7. *Reasonable litigation costs for a non-working wife* >8. *Financial capacity of the husband, his income, maintenance obligations, and liabilities*",
    "light_cleaned_comments": "Very sad. For the supreme court to become reasonable, a man has to commit suicide?! Der aaye, durust aaye Bohot zyada der se aaye bhai. Banda chala gaya humara iske liye Sadly yes, all we can do now is save more lives! It had nothing to do with Atul case. Read the article please I never said that it did. I just said that it was long overdue and it's good that it has come!"
}