{
    "id": "1etg05q",
    "title": "This was not just a rape/murder. Please read details. ",
    "url": "https://www.reddit.com/r/india/comments/1etg05q/this_was_not_just_a_rapemurder_please_read_details/",
    "selftext": "\n\nWho was the most scared politician during unrest in Bangladesh? \nHer folded hand appeal was extraordinary. \nThat humbleness which is not her personality was not without a reason. She knew the heat will come on her soon. And it didn't take long. A rape case & who's linking it to Bangladesh unrest? \nShe, herself.\n\nhttps://www.indiatoday.in/india/story/mamata-banerjee-slams-cheap-politics-kolkata-rape-murder-case-bangladesh-reference-2582273-2024-08-14\n\nIt's a matter of time before the 11th president rule probably is imposed. \nAnd it will be, if this pressure & mass protests go on. \nThe evidences of the crime scene might be thoroughly cleansed first by the administration & then by the manufactured violence by party goons, but the Calcutta High Court itself flagging some of these concerns & giving the case to CBI speaks volumes. \nCBI can not only corroborate circumstantial & evidences from arrests, but can discloses some very shocking details, which are already been talked about in media. \nIf true, this wasn't just a rape case but something more sinister going on since long. \n\nThis story of death of a medical student from the same R.G Kar Medical College in 2001 will send shivers down your spine when you read the dirty details of what goes on & how political patronage plays an essential part in such crimes -\nhttps://timesofindia.indiatimes.com/city/kolkata/porn-ring-behind-students-murder-at-r-g-kar-medical-college-in-kolkata/articleshow/1900044424.cms\n\nIt's not a coincidence the current accused too is a porn addict, well connected to the system, was part of state police -\nhttps://timesofindia.indiatimes.com/india/kolkata-doctor-rape-murder-case-accused-was-addicted-to-violent-porn-known-as-womaniser/articleshow/112475334.cms\n\nIf you still aren't feeling like puking, here's more. This 6.7 minute audio clip going viral on X (formerly Twitter) speaks of unspeakable crimes to human bodies along with a drug racket (cannot vouch for its authenticity, do your due diligence) -\nhttps://x.com/Doctors__squad/status/1824167056822112600?t=DBRInG7cc8LXecnlM_EK8A&s=19\n\n\nSo now a few questions to you, the people:\n\nFor how long this has been going on? \nSince decades.\n\nWhat did you, the people, do? Nothing.\n\nYou sleep & elect a government, not even knowing what's going in your neighborhood, and then have the gumption to question politicians.\n\nPeople get the government they deserve. All this couldn't have happened without political patronage. So where was your moral compass all these years? \n\nEasy to always blame others after an event. You, the people, rot a system. You all are equally culpable.\n\n\nSome questions to \"feminists\"\n\nHow many women chief ministers in India? \nJust one\n\nWho? \nMamata Banerjee.\n\nAnd this is the state of affairs for women?\n\nWho is also the health minister of West Bengal? \nMamata Banerjee.\n\nHow many \"champions of women causes\" have come on the road? \nHow many Bollywood liberals have come forward with placards like they did for \"justice for Kathua rape\"? Sonia, Priyanka, Rahul even did a candle light vigil at Delhi's India Gate. Forgot? \n\nYou will forget because for you everything is politics. The same Sagarika who questions a CM over women safety, gets labelled instantly as maoist sympathizer, apologizes immediately, is later made an MP, & now distances from \"your cause\". These are your spokespersons.\n\nYou hype the screeching of a TMC MP as oratory. She is often accused (even by her own ex-bf) of taking money from one businessman to target the other. \n\nAsk yourself honestly a question - what use is all that \"oratory\" if it today doesn't stand with you, cannot even write the word \"rape\" & question the CM? You gave her all your voice & support, when it was her time to reciprocate & your need, you got a big 0 in return.\n\nThe deceased girl will get justice, but look at yourself in the mirror too. \nNone of you are innocent.",
    "flair": "Law & Courts",
    "score": 2,
    "num_comments": 1,
    "created_utc": 1723783029.0,
    "convurl": "https://external-preview.redd.it/Ffk_EPE5raDpDYqu4q7wjnISRIgmcImqxLPH_Hx9h4s.jpg?auto=webp&s=c76242512295f294aa8eeb1dd2be246638d9d522",
    "comments": [
        "President rule isn't this easy to impose.After SR Bommai Judgement SC has given many guidelines which has to be looked upon before imposing president rule in a state.Modi govt imposed president rule in most of the states where the issue was about the formation of govt and numbers required for that.\n\nFailure of a govt on one particular issue is not enough to impose president rule in that state."
    ],
    "cleaned_text": "rapemurder please read details scared politician unrest bangladesh folded hand appeal extraordinary humbleness personality without reason knew heat come soon didnt take long rape case whos linking bangladesh unrest matter time th president rule probably imposed pressure mass protests go evidences crime scene might thoroughly cleansed first administration manufactured violence party goons calcutta high court flagging concerns giving case cbi speaks volumes cbi corroborate circumstantial evidences arrests discloses shocking details already talked media true wasnt rape case something sinister going since long story death medical student rg kar medical college send shivers spine read dirty details goes political patronage plays essential part crimes coincidence current accused porn addict well connected system part state police still arent feeling like puking heres minute audio clip going viral x formerly twitter speaks unspeakable crimes human bodies along drug racket vouch authenticity due diligence questions people long going since decades people nothing sleep elect government even knowing whats going neighborhood gumption question politicians people get government deserve couldnt happened without political patronage moral compass years easy always blame others event people rot system equally culpable questions feminists many women chief ministers india one mamata banerjee state affairs women also health minister west bengal mamata banerjee many champions women causes come road many bollywood liberals come forward placards like justice kathua rape sonia priyanka rahul even candle light vigil delhis india gate forgot forget everything politics sagarika questions cm women safety gets labelled instantly maoist sympathizer apologizes immediately later made mp distances cause spokespersons hype screeching tmc mp oratory often accused even exbf taking money one businessman target ask honestly question use oratory today doesnt stand even write word rape question cm gave voice support time reciprocate need got big return deceased girl get justice look mirror none innocent ",
    "cleaned_title": "rapemurder please read details",
    "cleaned_selftext": "scared politician unrest bangladesh folded hand appeal extraordinary humbleness personality without reason knew heat come soon didnt take long rape case whos linking bangladesh unrest matter time th president rule probably imposed pressure mass protests go evidences crime scene might thoroughly cleansed first administration manufactured violence party goons calcutta high court flagging concerns giving case cbi speaks volumes cbi corroborate circumstantial evidences arrests discloses shocking details already talked media true wasnt rape case something sinister going since long story death medical student rg kar medical college send shivers spine read dirty details goes political patronage plays essential part crimes coincidence current accused porn addict well connected system part state police still arent feeling like puking heres minute audio clip going viral x formerly twitter speaks unspeakable crimes human bodies along drug racket vouch authenticity due diligence questions people long going since decades people nothing sleep elect government even knowing whats going neighborhood gumption question politicians people get government deserve couldnt happened without political patronage moral compass years easy always blame others event people rot system equally culpable questions feminists many women chief ministers india one mamata banerjee state affairs women also health minister west bengal mamata banerjee many champions women causes come road many bollywood liberals come forward placards like justice kathua rape sonia priyanka rahul even candle light vigil delhis india gate forgot forget everything politics sagarika questions cm women safety gets labelled instantly maoist sympathizer apologizes immediately later made mp distances cause spokespersons hype screeching tmc mp oratory often accused even exbf taking money one businessman target ask honestly question use oratory today doesnt stand even write word rape question cm gave voice support time reciprocate need got big return deceased girl get justice look mirror none innocent",
    "cleaned_comments": "president rule isnt easy imposeafter sr bommai judgement sc given many guidelines looked upon imposing president rule statemodi govt imposed president rule states issue formation govt numbers required failure govt one particular issue enough impose president rule state",
    "light_cleaned_title": "This was not just a rape/murder. Please read details.",
    "light_cleaned_selftext": "Who was the most scared politician during unrest in Bangladesh? Her folded hand appeal was extraordinary. That humbleness which is not her personality was not without a reason. She knew the heat will come on her soon. And it didn't take long. A rape case & who's linking it to Bangladesh unrest? She, herself. It's a matter of time before the 11th president rule probably is imposed. And it will be, if this pressure & mass protests go on. The evidences of the crime scene might be thoroughly cleansed first by the administration & then by the manufactured violence by party goons, but the Calcutta High Court itself flagging some of these concerns & giving the case to CBI speaks volumes. CBI can not only corroborate circumstantial & evidences from arrests, but can discloses some very shocking details, which are already been talked about in media. If true, this wasn't just a rape case but something more sinister going on since long. This story of death of a medical student from the same R.G Kar Medical College in 2001 will send shivers down your spine when you read the dirty details of what goes on & how political patronage plays an essential part in such crimes - It's not a coincidence the current accused too is a porn addict, well connected to the system, was part of state police - If you still aren't feeling like puking, here's more. This 6.7 minute audio clip going viral on X (formerly Twitter) speaks of unspeakable crimes to human bodies along with a drug racket (cannot vouch for its authenticity, do your due diligence) - So now a few questions to you, the people: For how long this has been going on? Since decades. What did you, the people, do? Nothing. You sleep & elect a government, not even knowing what's going in your neighborhood, and then have the gumption to question politicians. People get the government they deserve. All this couldn't have happened without political patronage. So where was your moral compass all these years? Easy to always blame others after an event. You, the people, rot a system. You all are equally culpable. Some questions to \"feminists\" How many women chief ministers in India? Just one Who? Mamata Banerjee. And this is the state of affairs for women? Who is also the health minister of West Bengal? Mamata Banerjee. How many \"champions of women causes\" have come on the road? How many Bollywood liberals have come forward with placards like they did for \"justice for Kathua rape\"? Sonia, Priyanka, Rahul even did a candle light vigil at Delhi's India Gate. Forgot? You will forget because for you everything is politics. The same Sagarika who questions a CM over women safety, gets labelled instantly as maoist sympathizer, apologizes immediately, is later made an MP, & now distances from \"your cause\". These are your spokespersons. You hype the screeching of a TMC MP as oratory. She is often accused (even by her own ex-bf) of taking money from one businessman to target the other. Ask yourself honestly a question - what use is all that \"oratory\" if it today doesn't stand with you, cannot even write the word \"rape\" & question the CM? You gave her all your voice & support, when it was her time to reciprocate & your need, you got a big 0 in return. The deceased girl will get justice, but look at yourself in the mirror too. None of you are innocent.",
    "light_cleaned_comments": "President rule isn't this easy to impose.After SR Bommai Judgement SC has given many guidelines which has to be looked upon before imposing president rule in a state.Modi govt imposed president rule in most of the states where the issue was about the formation of govt and numbers required for that. Failure of a govt on one particular issue is not enough to impose president rule in that state."
}