{
    "id": "14odoa2",
    "title": "What Does It Feel Like To Be A Muslim In Narendra Modi's India?",
    "url": "https://youtu.be/oflEB1wacLs",
    "selftext": "This one is quite hard hitting",
    "flair": "Politics",
    "score": 30,
    "num_comments": 12,
    "created_utc": 1688267976.0,
    "convurl": "https://external-preview.redd.it/kBH2I5-LUCA9YMyf2owW0lOir2WH1u_fpa43ARm-TTM.jpg?auto=webp&s=1e149d70d729d4c4747352318ce46dd0c4f109a0",
    "comments": [
        "Post Independence, 97% of lynchings have need registered since 2014",
        "This has always been the goal of BJP/RSS but the collective silence of the opposition parties and the rest of the country is what is most disheartening.",
        "if that's not terrorism then what is",
        "Modi and BJP IT cell will claim that before 2014 people were not allowed to report lynching. They will spin it as a victory that people are empowered to report under BJP democracy 🙄",
        "Don't give them ideas. They'll spread it like wild fire and people will start believing it as a truth.\n\nIt's not just terrorism against a specific community it's for everyone. You cannot criticize or have a civil discussion or debate anymore. One wrong tweet and you'll be jailed for no reason and no justice in sight. State sponsored terror.",
        "Congress has been vocal, it's not their fault that the media ignores or worse twists their stance.",
        "When did rahul gandhi or any other top congress leader visit pehlu khan's home?"
    ],
    "cleaned_text": "feel like muslim narendra modis india one quite hard hitting ",
    "cleaned_title": "feel like muslim narendra modis india",
    "cleaned_selftext": "one quite hard hitting",
    "cleaned_comments": "post independence lynchings need registered since always goal bjprss collective silence opposition parties rest country disheartening thats terrorism modi bjp cell claim people allowed report lynching spin victory people empowered report bjp democracy dont give ideas theyll spread like wild fire people start believing truth terrorism specific community everyone criticize civil discussion debate anymore one wrong tweet youll jailed reason justice sight state sponsored terror congress vocal fault media ignores worse twists stance rahul gandhi top congress leader visit pehlu khans home",
    "light_cleaned_title": "What Does It Feel Like To Be A Muslim In Narendra Modi's India?",
    "light_cleaned_selftext": "This one is quite hard hitting",
    "light_cleaned_comments": "Post Independence, 97% of lynchings have need registered since 2014 This has always been the goal of BJP/RSS but the collective silence of the opposition parties and the rest of the country is what is most disheartening. if that's not terrorism then what is Modi and BJP IT cell will claim that before 2014 people were not allowed to report lynching. They will spin it as a victory that people are empowered to report under BJP democracy 🙄 Don't give them ideas. They'll spread it like wild fire and people will start believing it as a truth. It's not just terrorism against a specific community it's for everyone. You cannot criticize or have a civil discussion or debate anymore. One wrong tweet and you'll be jailed for no reason and no justice in sight. State sponsored terror. Congress has been vocal, it's not their fault that the media ignores or worse twists their stance. When did rahul gandhi or any other top congress leader visit pehlu khan's home?"
}