{
    "id": "17j3gd5",
    "title": "ouch",
    "url": "https://www.reddit.com/r/india/comments/17j3gd5/ouch/",
    "selftext": "[https://x.com/Haqiqatjou/status/1718623344398835854?s=20](https://x.com/Haqiqatjou/status/1718623344398835854?s=20)\n\nhttps://preview.redd.it/erko5k0fd5xb1.jpg?width=469&format=pjpg&auto=webp&s=ea66239f38b199c6fdbf906a731883fe43521e78",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698587750.0,
    "convurl": "https://external-preview.redd.it/jkruGc9DwqJFEu-U9vFZx09QWJ9TypjbXYdrjoBzjEQ.jpg?auto=webp&s=52b52da062e1bc1acfa8add14dd23584c91c2ae5",
    "comments": [
        "Why the dark side is based-\n\nLight side sounds like some sissy ass bullshit when compared to dark side.\n\nDark side is where all the cool weapons of mass destruction are.\n\nThere is literally no character in star wars universe to match Lord Darth Vaders drip.\n\nRebels act and dress like fucking retards. No fucking way these retards actually won against the empire in a realistic scenario.",
        "The Twitter handle terror_alarm does not seem to have this tweet. The handle claims to be Non-State-Affiliated Agenda-Free Media. World's First Ai-Generated News and Views.",
        "US, Israel & Co. are literally the fucking EMPIRE in the current scenario."
    ],
    "cleaned_text": "ouch httpsxcomhaqiqatjoustatusshttpsxcomhaqiqatjoustatuss ",
    "cleaned_title": "ouch",
    "cleaned_selftext": "httpsxcomhaqiqatjoustatusshttpsxcomhaqiqatjoustatuss",
    "cleaned_comments": "dark side based light side sounds like sissy ass bullshit compared dark side dark side cool weapons mass destruction literally character star wars universe match lord darth vaders drip rebels act dress like fucking retards fucking way retards actually empire realistic scenario twitter handle terroralarm seem tweet handle claims nonstateaffiliated agendafree media worlds first aigenerated news views us israel co literally fucking empire current scenario",
    "light_cleaned_title": "ouch",
    "light_cleaned_selftext": "[https://x.com/Haqiqatjou/status/1718623344398835854?s=20](https://x.com/Haqiqatjou/status/1718623344398835854?s=20)",
    "light_cleaned_comments": "Why the dark side is based- Light side sounds like some sissy ass bullshit when compared to dark side. Dark side is where all the cool weapons of mass destruction are. There is literally no character in star wars universe to match Lord Darth Vaders drip. Rebels act and dress like fucking retards. No fucking way these retards actually won against the empire in a realistic scenario. The Twitter handle terror_alarm does not seem to have this tweet. The handle claims to be Non-State-Affiliated Agenda-Free Media. World's First Ai-Generated News and Views. US, Israel & Co. are literally the fucking EMPIRE in the current scenario."
}