{
    "id": "14jb3cu",
    "title": "Have you seen the interview of S. Jaishankar by BeerBiceps, It was probably done as part of a Govt. tender for Influencers",
    "url": "https://www.reddit.com/r/india/comments/14jb3cu/have_you_seen_the_interview_of_s_jaishankar_by/",
    "selftext": "I am sure some of you may have heard about BeerBiceps youtube channel and his interview with S. Jaishankar - https://www.youtube.com/watch?v=yVTNge3sXpg  \n\nYou may be wondering why this youtube channel is pro-government. We may finally have the answer. If you check the description of the video it says \"Co-presented to you by ⁠@MyGovIndia\". Recently there was a tender issued by the govt. \"Request for Empanelment (RFE) for Selection of Influencer Marketing Agencies for Empanelment with MyGov\" dated 07.03.2023 .  \n\nlink for tender - https://www.meity.gov.in/writereaddata/files/RFEInfluencerMarketingAgencyMyGov.pdf  \n\nIf this link between the podcaster and govt. is true then we can see how govt. is funding Influencers to become propaganda outlets for the government. The Influencers themselves are not disclosing this fact properly which informs the audience. Even if there is no exchange of money it is clear that this podcast was used to further the narrative of the ruling establishment.\n\n\nApar Gupta of Internet Freedom Foundation pointed it out first on twitter - https://twitter.com/apar1984/status/1673223203630481408",
    "flair": "Politics",
    "score": 1257,
    "num_comments": 162,
    "created_utc": 1687766992.0,
    "convurl": "https://external-preview.redd.it/-LmCTSBAVazaZNGDtVBOfvXtFfQ98Ig2eEltnNtcBpw.jpg?auto=webp&v=enabled&s=9cf0696050e0ea8cd51d308185eb6ec081dc1aeb",
    "comments": [
        "Have they shared who has been selected as a part of the tender and does this fall under RTI by any chance?",
        "There's an actual tender for it. Lmaooo. Amazing.",
        "Atleast they are transparent about this.\n\nIs there a way to know how much of our tax money is wasted?",
        "Tax money used for govt podcasts by influencers",
        "BeerBiceps is annoying AF to be honest. Zero maturity and depth. \n\nWatched only the Rajshri Nandy one and all his podcasts with other streamers are better than the BeerBiceps one.",
        "Beerbiceps' video description says \"Co-presented by MyGovIndia\"",
        "Modiji going after them 18 Yr old Beer balti followers with tax payers 💰 ..",
        "Sellouts mfs …\n\nCant even call them sellouts coz they didn’t even begin with integrity. \n\nIn words for someone who didn’t sellout even when their media house was bought…\n\nEk dara hua / bika hua patrakar, adhmara nagrik paida krta hai\n\nRoughly translated as \nA sellout media ( journalist/ reporter / influencer ) produces zombie citizens",
        "Probably does",
        "Lmfao. Fuckers are eating public money buying social media after buying traditional media.",
        "It was high cringe how BeerBiceps lead every question by basically praising the India. Interestingly S. Jaishankar gave somewhat neutral responses. He even said that his son studies in USA.\n\nYeah it was baised from the get go. Sucks that no disclaimer was given but then again different news channels all over world ( including USA ) are baised to certain groups etc.\n\nIt was just a matter of time when we would have the same on Youtube / Reels.",
        "90% of it.",
        "It all started with his Partnership with Ajio and line se Saare Minister's Podcast m participate kar rahe hai....",
        "It should.",
        "is it any different than having hoardings/newspaper/tv ads?",
        "...On this PR stunt...",
        "Yes, they are labeled as Ads",
        "Probably? It was definitely done by sponsorship from GoI. It’s just pathetic this Beer tuchiya doesn’t have the integrity to call it so openly.",
        "They were not transparent about it. Somebody saw the Jaishankar podcast and connected back to a tender which had come out in the past. \n\nBeer Biceps did not disclose that and neither did the government.",
        "Sab bikke hue hai .... mdrchd k bache....\n\n          ~ Gali ki aunty",
        "Few questions, the government is hiring marketing/digital agencies to reach these so called influencers? The do the same in case of print media. The excuse there is so that they can let people know about government schemes but usually we see chowkidar's full page photo in newspapers. What's the excuse for reaching there so called influencers? Ofcourse we all the truth, to create their postive image and to control the minds of the youth.",
        "Ahh, the Gigachad S.Jaishankar.",
        "I don't know who beer biceps is but any channel interviewing bjp fellows should be propagating it's ideology and stuff because they don't take interview to real journalists.",
        "Putting out the tender is part of the transparency, nothing else is needed to be disclosed by anyone else. Legally speaking.",
        "So I need a govt who would connect with me gen people. \n\n\nLook at the govt they are connecting with us via influencers my tax money is in drain.",
        "Good first step to at least show that it is a ad\n\nGovt se nah re baba, beer biceps se.",
        "Beer biceps has been a propaganda machine for quite a while now.\n\nI used to watch him a couple of years ago when he actually made good stuff, over time his content got repetitive and boring with the same people discussing the same topics over and over again.\n\nGuess you gotta bag that money somehow 🤷🤷",
        "I say Fleventy Five percent!",
        "Pathetic",
        "I just watch sarabjeet mohanty and his team's podcast rest I don't even check.",
        "Ajio bjp ka hai?",
        "Reliance",
        "Interesting 🤔",
        "Which buisness houses supports bjp?",
        "North Korea 2.O in the making",
        "Jo Rulling party hoti  Business houses unko Support Karti hai ,so that Policy unke favour m ho and they in turn Pay Political party  via Electoral Bond.\nYehi Game  Chal Raha hai since 2018",
        "Amrit kaal 💯🤡",
        "It might be against youtube’s terms of service to not disclose your sponsor in a sponsored video",
        "Gaand Phati Ke",
        "He has mentioned in the description: Collaboration with @MyGovIndia",
        "Surreal and disgusting in equal measure",
        "Hope reddit does it's thing.",
        "Haven't heard this myself but sounds like Ravish Kumar. He deserves every bit of respect he gets and more.",
        "Might. Also, getting a tender and sponser are two different things.",
        "Sad using our tax moneys to further their agenda. Such a disgrace",
        "Nope, it's [schfifty five](https://www.youtube.com/watch?v=-XccUMOQ978) percent",
        "What was the need to pay Turd Biceps when he is doing bootlicking for free?",
        "You mean he has hidden it in description?",
        "Exactly. Can only see when you expand it",
        "It's been so long since we have seen a grilling interview of any Cabinet Minister or the Prime Minister.",
        "Transparency pro max. Great, now follow this everywhere else.",
        "So a government of terrible people has chosen another terrible person to do propaganda for them? Not surprised at all.",
        "If the government has such surplus monies, I'm once again asking the government to pay the poor research scholars who are literally wasting away the prime of their youth for the betterment of the country and the world overall.",
        "Wow so this is where my hard earned money goes. To the very people I despise the most and learn nothing from.",
        "This is the actual Revdi culture",
        "Haven’t seen yet but will be unsubscribing his channel for sure.",
        "Beer bicep has to mention in his Video in Partnership or Collaboration with Government",
        "Instagram ka Zamana hai, Govt has also stepped in",
        ">Tax money used for govt podcasts by influencers\n\nDo you have any proof at all that this podcast or any other podcast was funded by the government?\n\nBy this same speculative logic, the post made by OP and your post could also be funded by the opposition. Or by any anti-government agency.\n\nPlease stop spreading rumors and pure speculative toxic BS. I am firmly in the middle myself but find it appalling at the amount of outright lies and pure speculation that is being posted as if it was fact.",
        "Govt tenders for influencers will be a base for stable income and might be the only efficient way to monetize their efforts\n\n&#x200B;\n\nAlthough I consider them dumbfluencers, everyone has a right to make a living out of their work and I hope they get their due\n\n&#x200B;\n\nAlso quite surprised that OP thinks this is something new. There were literally well made professional graphics to protect the Pedo Brij Busan by the IT cell.",
        "Vo banda kabhi press conf karta hai kya? \nThese ppl have so much time for podcasts and stuff, but no time for press conferences, where actual questions will be asked. \n\nAnd indians dont question this kinda behavior, thats kinda sad.",
        "Sab chalta h. Maja maadi.",
        "Repeat a lie so many times that ppl start to believe it. In this case the lie is, \"india kitna tarakki kar raha hai bjp ki vajeh se\"",
        "Ngl Genius strategy",
        "The amount of ministers on podcasts in the last month is astounding, its a coherent strategy on part of the govt to gain youth vote share by partnering with these influencers , saw a twitter post about it a couple weeks ago",
        "If the money is not exchanged, then its fine. The issue is, its not a level playing field. \n\n1. These people barely do press conferences where hard hitting questions are asked. \n2. Public issues are ignored by the main media, so a narrative is set: \"sab changa si\"\n3. Anyone who does good journalism, ED or other things are sent their way. So there is no one to challenge the narrative that is set.\n4. If this BeerBicep guy himself brings in some opposition leader, none of these ppl will give him interview, tanking his ratings, and even ED or harassers will be sent his way.\n\nCombining all this, creates a big problem that people dont realize what the real issues country is facing. Its ironic how similar it is with the way British ruled India.",
        "Govt. using influencers and local leaders to propagate their propaganda nowadays.\nEarlier these were done to propagate govt. schemes info.",
        "I hate that filmy guy masquerading as FM",
        "Ab WhatsApp University se badhkar YouTube University khulne waali hai. Zyada wakt nhi lagega agar ye influencers bhi media ki tarah zeher dete rahenge har video me.",
        "Free ka cheez jo public dekhte hai bina pese de kar uska sponsor govt ke peso se leta hai. You're spot on.",
        "Let's boycott this hypocrite",
        "BJp has already started exploring podcast as a marketing channel for 2024 election.\n\nIt started with Raj Samani, Beer biceps and a lot more in upcoming months\n\nRemember:\nWe are only 10 months away from first voting phase",
        "Meri colony ke samne wali tuti hui naali ka bhi tender nikalwa do koi please 🙏",
        "Ranveer Allahabadia is broker for many top youtubers for getting them promotions for their videos . He has a great network",
        "He did a cringeworthy interview with the German ambassador where he asked him to explain why Jaishankar was such a successful FM as if the global order was awestruck by the IT cell PR work - poor ambassador was suckered into a Jaishankar praise-fest on the pretext of an interview.",
        "Other state propaganda channels, like RT and TRT have clearly written below the video as funded by a particular government (on YouTube). These channels must also have it written on them."
    ],
    "cleaned_text": "seen interview jaishankar beerbiceps probably done part govt tender influencers sure may heard beerbiceps youtube channel interview jaishankar may wondering youtube channel progovernment may finally answer check description video says copresented mygovindia recently tender issued govt request empanelment rfe selection influencer marketing agencies empanelment mygov dated link tender link podcaster govt true see govt funding influencers become propaganda outlets government influencers disclosing fact properly informs audience even exchange money clear podcast used narrative ruling establishment apar gupta internet freedom foundation pointed first twitter ",
    "cleaned_title": "seen interview jaishankar beerbiceps probably done part govt tender influencers",
    "cleaned_selftext": "sure may heard beerbiceps youtube channel interview jaishankar may wondering youtube channel progovernment may finally answer check description video says copresented mygovindia recently tender issued govt request empanelment rfe selection influencer marketing agencies empanelment mygov dated link tender link podcaster govt true see govt funding influencers become propaganda outlets government influencers disclosing fact properly informs audience even exchange money clear podcast used narrative ruling establishment apar gupta internet freedom foundation pointed first twitter",
    "cleaned_comments": "shared selected part tender fall rti chance theres actual tender lmaooo amazing atleast transparent way know much tax money wasted tax money used govt podcasts influencers beerbiceps annoying af honest zero maturity depth watched rajshri nandy one podcasts streamers better beerbiceps one beerbiceps video description says copresented mygovindia modiji going yr old beer balti followers tax payers sellouts mfs cant even call sellouts coz didnt even begin integrity words someone didnt sellout even media house bought ek dara hua bika hua patrakar adhmara nagrik paida krta hai roughly translated sellout media journalist reporter influencer produces zombie citizens probably lmfao fuckers eating public money buying social media buying traditional media high cringe beerbiceps lead every question basically praising india interestingly jaishankar gave somewhat neutral responses even said son studies usa yeah baised get go sucks disclaimer given different news channels world including usa baised certain groups etc matter time would youtube reels started partnership ajio line se saare ministers podcast participate kar rahe hai different hoardingsnewspapertv ads pr stunt yes labeled ads probably definitely done sponsorship goi pathetic beer tuchiya doesnt integrity call openly transparent somebody saw jaishankar podcast connected back tender come past beer biceps disclose neither government sab bikke hue hai mdrchd k bache gali ki aunty questions government hiring marketingdigital agencies reach called influencers case print media excuse let people know government schemes usually see chowkidars full page photo newspapers whats excuse reaching called influencers ofcourse truth create postive image control minds youth ahh gigachad sjaishankar dont know beer biceps channel interviewing bjp fellows propagating ideology stuff dont take interview real journalists putting tender part transparency nothing else needed disclosed anyone else legally speaking need govt would connect gen people look govt connecting us via influencers tax money drain good first step least show ad govt se nah baba beer biceps se beer biceps propaganda machine quite used watch couple years ago actually made good stuff time content got repetitive boring people discussing topics guess got ta bag money somehow say fleventy five percent pathetic watch sarabjeet mohanty teams podcast rest dont even check ajio bjp ka hai reliance interesting buisness houses supports bjp north korea making jo rulling party hoti business houses unko support karti hai policy unke favour ho turn pay political party via electoral bond yehi game chal raha hai since amrit kaal might youtubes terms service disclose sponsor sponsored video gaand phati ke mentioned description collaboration mygovindia surreal disgusting equal measure hope reddit thing havent heard sounds like ravish kumar deserves every bit respect gets might also getting tender sponser two different things sad using tax moneys agenda disgrace nope schfifty fivehttpswwwyoutubecomwatchvxccumoq percent need pay turd biceps bootlicking free mean hidden description exactly see expand long since seen grilling interview cabinet minister prime minister transparency pro max great follow everywhere else government terrible people chosen another terrible person propaganda surprised government surplus monies im asking government pay poor research scholars literally wasting away prime youth betterment country world overall wow hard earned money goes people despise learn nothing actual revdi culture havent seen yet unsubscribing channel sure beer bicep mention video partnership collaboration government instagram ka zamana hai govt also stepped tax money used govt podcasts influencers proof podcast podcast funded government speculative logic post made op post could also funded opposition antigovernment agency please stop spreading rumors pure speculative toxic bs firmly middle find appalling amount outright lies pure speculation posted fact govt tenders influencers base stable income might efficient way monetize efforts xb although consider dumbfluencers everyone right make living work hope get due xb also quite surprised op thinks something new literally well made professional graphics protect pedo brij busan cell vo banda kabhi press conf karta hai kya ppl much time podcasts stuff time press conferences actual questions asked indians dont question kinda behavior thats kinda sad sab chalta h maja maadi repeat lie many times ppl start believe case lie india kitna tarakki kar raha hai bjp ki vajeh se ngl genius strategy amount ministers podcasts last month astounding coherent strategy part govt gain youth vote share partnering influencers saw twitter post couple weeks ago money exchanged fine issue level playing field people barely press conferences hard hitting questions asked public issues ignored main media narrative set sab changa si anyone good journalism ed things sent way one challenge narrative set beerbicep guy brings opposition leader none ppl give interview tanking ratings even ed harassers sent way combining creates big problem people dont realize real issues country facing ironic similar way british ruled india govt using influencers local leaders propagate propaganda nowadays earlier done propagate govt schemes info hate filmy guy masquerading fm ab whatsapp university se badhkar youtube university khulne waali hai zyada wakt nhi lagega agar ye influencers bhi media ki tarah zeher dete rahenge har video free ka cheez jo public dekhte hai bina pese de kar uska sponsor govt ke peso se leta hai youre spot lets boycott hypocrite bjp already started exploring podcast marketing channel election started raj samani beer biceps lot upcoming months remember months away first voting phase meri colony ke samne wali tuti hui naali ka bhi tender nikalwa koi please ranveer allahabadia broker many top youtubers getting promotions videos great network cringeworthy interview german ambassador asked explain jaishankar successful fm global order awestruck cell pr work poor ambassador suckered jaishankar praisefest pretext interview state propaganda channels like rt trt clearly written video funded particular government youtube channels must also written",
    "light_cleaned_title": "Have you seen the interview of S. Jaishankar by BeerBiceps, It was probably done as part of a Govt. tender for Influencers",
    "light_cleaned_selftext": "I am sure some of you may have heard about BeerBiceps youtube channel and his interview with S. Jaishankar - You may be wondering why this youtube channel is pro-government. We may finally have the answer. If you check the description of the video it says \"Co-presented to you by ⁠@MyGovIndia\". Recently there was a tender issued by the govt. \"Request for Empanelment (RFE) for Selection of Influencer Marketing Agencies for Empanelment with MyGov\" dated 07.03.2023 . link for tender - If this link between the podcaster and govt. is true then we can see how govt. is funding Influencers to become propaganda outlets for the government. The Influencers themselves are not disclosing this fact properly which informs the audience. Even if there is no exchange of money it is clear that this podcast was used to further the narrative of the ruling establishment. Apar Gupta of Internet Freedom Foundation pointed it out first on twitter -",
    "light_cleaned_comments": "Have they shared who has been selected as a part of the tender and does this fall under RTI by any chance? There's an actual tender for it. Lmaooo. Amazing. Atleast they are transparent about this. Is there a way to know how much of our tax money is wasted? Tax money used for govt podcasts by influencers BeerBiceps is annoying AF to be honest. Zero maturity and depth. Watched only the Rajshri Nandy one and all his podcasts with other streamers are better than the BeerBiceps one. Beerbiceps' video description says \"Co-presented by MyGovIndia\" Modiji going after them 18 Yr old Beer balti followers with tax payers 💰 .. Sellouts mfs … Cant even call them sellouts coz they didn’t even begin with integrity. In words for someone who didn’t sellout even when their media house was bought… Ek dara hua / bika hua patrakar, adhmara nagrik paida krta hai Roughly translated as A sellout media ( journalist/ reporter / influencer ) produces zombie citizens Probably does Lmfao. Fuckers are eating public money buying social media after buying traditional media. It was high cringe how BeerBiceps lead every question by basically praising the India. Interestingly S. Jaishankar gave somewhat neutral responses. He even said that his son studies in USA. Yeah it was baised from the get go. Sucks that no disclaimer was given but then again different news channels all over world ( including USA ) are baised to certain groups etc. It was just a matter of time when we would have the same on Youtube / Reels. 90% of it. It all started with his Partnership with Ajio and line se Saare Minister's Podcast m participate kar rahe hai.... It should. is it any different than having hoardings/newspaper/tv ads? ...On this PR stunt... Yes, they are labeled as Ads Probably? It was definitely done by sponsorship from GoI. It’s just pathetic this Beer tuchiya doesn’t have the integrity to call it so openly. They were not transparent about it. Somebody saw the Jaishankar podcast and connected back to a tender which had come out in the past. Beer Biceps did not disclose that and neither did the government. Sab bikke hue hai .... mdrchd k bache.... ~ Gali ki aunty Few questions, the government is hiring marketing/digital agencies to reach these so called influencers? The do the same in case of print media. The excuse there is so that they can let people know about government schemes but usually we see chowkidar's full page photo in newspapers. What's the excuse for reaching there so called influencers? Ofcourse we all the truth, to create their postive image and to control the minds of the youth. Ahh, the Gigachad S.Jaishankar. I don't know who beer biceps is but any channel interviewing bjp fellows should be propagating it's ideology and stuff because they don't take interview to real journalists. Putting out the tender is part of the transparency, nothing else is needed to be disclosed by anyone else. Legally speaking. So I need a govt who would connect with me gen people. Look at the govt they are connecting with us via influencers my tax money is in drain. Good first step to at least show that it is a ad Govt se nah re baba, beer biceps se. Beer biceps has been a propaganda machine for quite a while now. I used to watch him a couple of years ago when he actually made good stuff, over time his content got repetitive and boring with the same people discussing the same topics over and over again. Guess you gotta bag that money somehow 🤷🤷 I say Fleventy Five percent! Pathetic I just watch sarabjeet mohanty and his team's podcast rest I don't even check. Ajio bjp ka hai? Reliance Interesting 🤔 Which buisness houses supports bjp? North Korea 2.O in the making Jo Rulling party hoti Business houses unko Support Karti hai ,so that Policy unke favour m ho and they in turn Pay Political party via Electoral Bond. Yehi Game Chal Raha hai since 2018 Amrit kaal 💯🤡 It might be against youtube’s terms of service to not disclose your sponsor in a sponsored video Gaand Phati Ke He has mentioned in the description: Collaboration with @MyGovIndia Surreal and disgusting in equal measure Hope reddit does it's thing. Haven't heard this myself but sounds like Ravish Kumar. He deserves every bit of respect he gets and more. Might. Also, getting a tender and sponser are two different things. Sad using our tax moneys to further their agenda. Such a disgrace Nope, it's [schfifty five](https://www.youtube.com/watch?v=-XccUMOQ978) percent What was the need to pay Turd Biceps when he is doing bootlicking for free? You mean he has hidden it in description? Exactly. Can only see when you expand it It's been so long since we have seen a grilling interview of any Cabinet Minister or the Prime Minister. Transparency pro max. Great, now follow this everywhere else. So a government of terrible people has chosen another terrible person to do propaganda for them? Not surprised at all. If the government has such surplus monies, I'm once again asking the government to pay the poor research scholars who are literally wasting away the prime of their youth for the betterment of the country and the world overall. Wow so this is where my hard earned money goes. To the very people I despise the most and learn nothing from. This is the actual Revdi culture Haven’t seen yet but will be unsubscribing his channel for sure. Beer bicep has to mention in his Video in Partnership or Collaboration with Government Instagram ka Zamana hai, Govt has also stepped in >Tax money used for govt podcasts by influencers Do you have any proof at all that this podcast or any other podcast was funded by the government? By this same speculative logic, the post made by OP and your post could also be funded by the opposition. Or by any anti-government agency. Please stop spreading rumors and pure speculative toxic BS. I am firmly in the middle myself but find it appalling at the amount of outright lies and pure speculation that is being posted as if it was fact. Govt tenders for influencers will be a base for stable income and might be the only efficient way to monetize their efforts &#x200B; Although I consider them dumbfluencers, everyone has a right to make a living out of their work and I hope they get their due &#x200B; Also quite surprised that OP thinks this is something new. There were literally well made professional graphics to protect the Pedo Brij Busan by the IT cell. Vo banda kabhi press conf karta hai kya? These ppl have so much time for podcasts and stuff, but no time for press conferences, where actual questions will be asked. And indians dont question this kinda behavior, thats kinda sad. Sab chalta h. Maja maadi. Repeat a lie so many times that ppl start to believe it. In this case the lie is, \"india kitna tarakki kar raha hai bjp ki vajeh se\" Ngl Genius strategy The amount of ministers on podcasts in the last month is astounding, its a coherent strategy on part of the govt to gain youth vote share by partnering with these influencers , saw a twitter post about it a couple weeks ago If the money is not exchanged, then its fine. The issue is, its not a level playing field. 1. These people barely do press conferences where hard hitting questions are asked. 2. Public issues are ignored by the main media, so a narrative is set: \"sab changa si\" 3. Anyone who does good journalism, ED or other things are sent their way. So there is no one to challenge the narrative that is set. 4. If this BeerBicep guy himself brings in some opposition leader, none of these ppl will give him interview, tanking his ratings, and even ED or harassers will be sent his way. Combining all this, creates a big problem that people dont realize what the real issues country is facing. Its ironic how similar it is with the way British ruled India. Govt. using influencers and local leaders to propagate their propaganda nowadays. Earlier these were done to propagate govt. schemes info. I hate that filmy guy masquerading as FM Ab WhatsApp University se badhkar YouTube University khulne waali hai. Zyada wakt nhi lagega agar ye influencers bhi media ki tarah zeher dete rahenge har video me. Free ka cheez jo public dekhte hai bina pese de kar uska sponsor govt ke peso se leta hai. You're spot on. Let's boycott this hypocrite BJp has already started exploring podcast as a marketing channel for 2024 election. It started with Raj Samani, Beer biceps and a lot more in upcoming months Remember: We are only 10 months away from first voting phase Meri colony ke samne wali tuti hui naali ka bhi tender nikalwa do koi please 🙏 Ranveer Allahabadia is broker for many top youtubers for getting them promotions for their videos . He has a great network He did a cringeworthy interview with the German ambassador where he asked him to explain why Jaishankar was such a successful FM as if the global order was awestruck by the IT cell PR work - poor ambassador was suckered into a Jaishankar praise-fest on the pretext of an interview. Other state propaganda channels, like RT and TRT have clearly written below the video as funded by a particular government (on YouTube). These channels must also have it written on them."
}