{
    "id": "13dxmyc",
    "title": "GDP doesn't matter",
    "url": "https://www.reddit.com/r/india/comments/13dxmyc/gdp_doesnt_matter/",
    "selftext": "Hot take - We as a national have an ego problem. Most of us have a mindset that we are better than many developing countries as we are 5th in GDP. \n\n\nBeing 5th in GDP means nothing if GDP per capita is 139th. Am I the only person who feels this way ?\n\n[GDP ](https://i.imgur.com/tQOlTHG.jpg)",
    "flair": "Policy/Economy",
    "score": 38,
    "num_comments": 21,
    "created_utc": 1683740078.0,
    "convurl": "https://external-preview.redd.it/lgjVW08CKqxUaUcnYW0CvPk9kRUF912FXBMBJGziR-0.jpg?auto=webp&v=enabled&s=0457a13a20d9de00d57bfc6f4ba26316138055ee",
    "comments": [
        "Kinda the whole point of having GDP per capita as a measurement.",
        "My teammate is proud that apple products are made in India now and more people can buy their products",
        "The price hasn’t dropped a jot. We’re people who could afford them when they were made elsewhere buying now just because it’s assembled here?",
        "Its just senseless talk from a bhakt.",
        "Total GDP is helpful for bragging / negotiating purposes, eg you can go to a room full of investors and say “India is a $X trillion economy” and that’s a great headline, because it says “we’re a big market”.\n\nIn reality there’s lots of challenges but most people who attend investment briefings have done their due diligence and are aware of the challenges.\n\nEg, the number of Indians who track somewhere close to “global middle class” is pretty low. Eg look the median price of a mobile phone or car sold in India — it’s not high. Then there are lots of business environment / bureaucratic challenges.\n\nIt’s worth remembering, even if India goes to 4X current GDP per capita, at current levels it’ll still be poorer per capita than Mexico. Hence my thesis, that in the medium term, India’s “likely outcome” is a Mexico++: pockets of affluence and wealth, large pockets  of poverty, and a huge swathe of households with relatively low pay (20-60k/month). But equally, a *huge* market.",
        "GDP matters to big money, GDP per Capita matter to us the people",
        "This is an excellent take. Even with a 8k - 10k USD per capita gdp for India, there will be millions of rich Indians. In this scenario the average gdp per capita for the top 50-100 million Indians will be around 40-50 k USD. \n\nDelhi, Mumbai, Bengaluru will be akin to Beijing, Shanghai and Shenzen metropolitan regions. Huge pockets of wealth in an otherwise middle / lower middle income country.\n\nAnd statistically, even the most pessimistic estimates put India at 10k USD gdp per capita by 2040. That's  not that far of in the grand scheme of things.",
        "With more population than china we are 1/6th their size . Tells a lot about how great our economy is doing.",
        ">In reality there’s lots of challenges but most people who attend investment briefings have done their due diligence and are aware of the challenges.\n\nPrecisely! Investors aren’t typically fools who blindly invest just because India is a X trillion economy. And so are the people seeking investments. They don’t go on social media every week bragging about it. They have responsibilities and businesses to conduct. The ones who keep bragging about it often on social media are the ones who have nothing to do with it. It’s analogous to being proud of someone else’s success as if it was theirs.",
        "GDP doesn't matter. Life is maaya. Gender is a notion. Poverty is a state of mind.\n\nThat's India's judiciary, mythology, and jio-politics in a single line.\n\nSeriously speaking, you're right. Further, the government changed the calculation formula in 2015, so even the real growth on the relatively low base is lower than what's actually claimed.",
        "> And statistically, even the most pessimistic estimates put India at 10k USD gdp per capita by 2040. That's  not that far of in the grand scheme of things.\n\nI think that’s very doable but there are plenty of ways to screw it up.\n\nEg a big climate emergency type event. Or even a bunch of smaller events. Eg floods or extreme heat or water table crisis or something. These are difficult to predict.\n\nThen there are political miscalculations, eg something which produces worldwide condemnation and causes MNCs to pull out. But hopefully that’s unlikely!\n\nThe big question I have though is … 40k USD is about 33LPA currently … what % of say Bombay or Bangalore residents will make that much? Put another way, what % or Bombay or Bangalore folk make half that, ie 16 LPA today?\n\n(40k USD *household* income is much easier though.)",
        "We love headlines like \"India became no 1 or India broke a world record or geniusworld record or only happens (good thing) in India. \"",
        "You are correct. \n\nfor example : The combined economy of Africa is higher than India, would you rather move to Africa for a better life?\n\nThe state of economy is gauged by a bunch of indicators and not just taking 1 datapoint as is the case with our govt spokies. gdp size, gdp growth rate, gdp/gapita , debt , exports and plenty of other things."
    ],
    "cleaned_text": "gdp doesnt matter hot take national ego problem us mindset better many developing countries th gdp th gdp means nothing gdp per capita th person feels way gdp httpsiimgurcomtqolthgjpg ",
    "cleaned_title": "gdp doesnt matter",
    "cleaned_selftext": "hot take national ego problem us mindset better many developing countries th gdp th gdp means nothing gdp per capita th person feels way gdp httpsiimgurcomtqolthgjpg",
    "cleaned_comments": "kinda whole point gdp per capita measurement teammate proud apple products made india people buy products price hasnt dropped jot people could afford made elsewhere buying assembled senseless talk bhakt total gdp helpful bragging negotiating purposes eg go room full investors say india x trillion economy thats great headline says big market reality theres lots challenges people attend investment briefings done due diligence aware challenges eg number indians track somewhere close global middle class pretty low eg look median price mobile phone car sold india high lots business environment bureaucratic challenges worth remembering even india goes x current gdp per capita current levels itll still poorer per capita mexico hence thesis medium term indias likely outcome mexico pockets affluence wealth large pockets poverty huge swathe households relatively low pay kmonth equally huge market gdp matters big money gdp per capita matter us people excellent take even k k usd per capita gdp india millions rich indians scenario average gdp per capita top million indians around k usd delhi mumbai bengaluru akin beijing shanghai shenzen metropolitan regions huge pockets wealth otherwise middle lower middle income country statistically even pessimistic estimates put india k usd gdp per capita thats far grand scheme things population china th size tells lot great economy reality theres lots challenges people attend investment briefings done due diligence aware challenges precisely investors arent typically fools blindly invest india x trillion economy people seeking investments dont go social media every week bragging responsibilities businesses conduct ones keep bragging often social media ones nothing analogous proud someone elses success gdp doesnt matter life maaya gender notion poverty state mind thats indias judiciary mythology jiopolitics single line seriously speaking youre right government changed calculation formula even real growth relatively low base lower whats actually claimed statistically even pessimistic estimates put india k usd gdp per capita thats far grand scheme things think thats doable plenty ways screw eg big climate emergency type event even bunch smaller events eg floods extreme heat water table crisis something difficult predict political miscalculations eg something produces worldwide condemnation causes mncs pull hopefully thats unlikely big question though k usd lpa currently say bombay bangalore residents make much put another way bombay bangalore folk make half ie lpa today k usd household income much easier though love headlines like india became india broke world record geniusworld record happens good thing india correct example combined economy africa higher india would rather move africa better life state economy gauged bunch indicators taking datapoint case govt spokies gdp size gdp growth rate gdpgapita debt exports plenty things",
    "light_cleaned_title": "GDP doesn't matter",
    "light_cleaned_selftext": "Hot take - We as a national have an ego problem. Most of us have a mindset that we are better than many developing countries as we are 5th in GDP. Being 5th in GDP means nothing if GDP per capita is 139th. Am I the only person who feels this way ? [GDP ](https://i.imgur.com/tQOlTHG.jpg)",
    "light_cleaned_comments": "Kinda the whole point of having GDP per capita as a measurement. My teammate is proud that apple products are made in India now and more people can buy their products The price hasn’t dropped a jot. We’re people who could afford them when they were made elsewhere buying now just because it’s assembled here? Its just senseless talk from a bhakt. Total GDP is helpful for bragging / negotiating purposes, eg you can go to a room full of investors and say “India is a $X trillion economy” and that’s a great headline, because it says “we’re a big market”. In reality there’s lots of challenges but most people who attend investment briefings have done their due diligence and are aware of the challenges. Eg, the number of Indians who track somewhere close to “global middle class” is pretty low. Eg look the median price of a mobile phone or car sold in India — it’s not high. Then there are lots of business environment / bureaucratic challenges. It’s worth remembering, even if India goes to 4X current GDP per capita, at current levels it’ll still be poorer per capita than Mexico. Hence my thesis, that in the medium term, India’s “likely outcome” is a Mexico++: pockets of affluence and wealth, large pockets of poverty, and a huge swathe of households with relatively low pay (20-60k/month). But equally, a *huge* market. GDP matters to big money, GDP per Capita matter to us the people This is an excellent take. Even with a 8k - 10k USD per capita gdp for India, there will be millions of rich Indians. In this scenario the average gdp per capita for the top 50-100 million Indians will be around 40-50 k USD. Delhi, Mumbai, Bengaluru will be akin to Beijing, Shanghai and Shenzen metropolitan regions. Huge pockets of wealth in an otherwise middle / lower middle income country. And statistically, even the most pessimistic estimates put India at 10k USD gdp per capita by 2040. That's not that far of in the grand scheme of things. With more population than china we are 1/6th their size . Tells a lot about how great our economy is doing. >In reality there’s lots of challenges but most people who attend investment briefings have done their due diligence and are aware of the challenges. Precisely! Investors aren’t typically fools who blindly invest just because India is a X trillion economy. And so are the people seeking investments. They don’t go on social media every week bragging about it. They have responsibilities and businesses to conduct. The ones who keep bragging about it often on social media are the ones who have nothing to do with it. It’s analogous to being proud of someone else’s success as if it was theirs. GDP doesn't matter. Life is maaya. Gender is a notion. Poverty is a state of mind. That's India's judiciary, mythology, and jio-politics in a single line. Seriously speaking, you're right. Further, the government changed the calculation formula in 2015, so even the real growth on the relatively low base is lower than what's actually claimed. > And statistically, even the most pessimistic estimates put India at 10k USD gdp per capita by 2040. That's not that far of in the grand scheme of things. I think that’s very doable but there are plenty of ways to screw it up. Eg a big climate emergency type event. Or even a bunch of smaller events. Eg floods or extreme heat or water table crisis or something. These are difficult to predict. Then there are political miscalculations, eg something which produces worldwide condemnation and causes MNCs to pull out. But hopefully that’s unlikely! The big question I have though is … 40k USD is about 33LPA currently … what % of say Bombay or Bangalore residents will make that much? Put another way, what % or Bombay or Bangalore folk make half that, ie 16 LPA today? (40k USD *household* income is much easier though.) We love headlines like \"India became no 1 or India broke a world record or geniusworld record or only happens (good thing) in India. \" You are correct. for example : The combined economy of Africa is higher than India, would you rather move to Africa for a better life? The state of economy is gauged by a bunch of indicators and not just taking 1 datapoint as is the case with our govt spokies. gdp size, gdp growth rate, gdp/gapita , debt , exports and plenty of other things."
}