{
    "id": "1bvkj5j",
    "title": "Scammers are going crazy NGL",
    "url": "https://www.reddit.com/gallery/1bvkj5j",
    "selftext": "Stay safe guys came across this article, thought this might help you guys to be on your toes while shopping online.",
    "flair": "Crime",
    "score": 42,
    "num_comments": 16,
    "created_utc": 1712229360.0,
    "convurl": "https://i.redd.it/0399uxby4gsc1.jpg",
    "comments": [
        "Transactions can be reversed in UPI, if been scammed.",
        "Transactions will never be reversed in UPI, even if u lodge a complaint UPI will get back asking you to raise a complaint with the bank, Bank will ask you to file a police complaint saying the receiver not available or insufficient balance in receivers account. Be very careful while using UPI😅",
        "Kal hi pdha hai answer key mei, question galat tick maara tha. Agr itni jaldi bhul gya to apna ilaaz krvane chla jaunga",
        "Ye rha\n\nhttps://preview.redd.it/96ei8ikgegsc1.jpeg?width=2880&format=pjpg&auto=webp&s=bedaea349464102114a4f5550d034f5c2ee2bf3c",
        "Bhai sirf “ UPI safe hai “ dhikane keliye ye sab govt advertise karthe hai, real life me ek bar galati kardiya to manlo paisa gya",
        "Ha, colluded hota hoga system. Vrna track krna aur reverse krna transaction ko verify krke asaan process hai.",
        "Some information is missing. \nUPI won't work without UPI pin and app lock code/pattern.\nCard otp needs card details.\nNetbanking needs userid,pass or mPin.\nUnless he had stored this info in plainsight on his phone it's just not possible\nHe must have entered some info when he clicked that link , pretty sure it was his card details.",
        "I just started using the dumb ways like old times. Purchase things physically, check it before paying. I don’t do any transaction above 20k unless doing it with trusted recipients.\n\nI prefer NEFT over UPIs for big transactions. Better slow than scam.\n\nThe bank rep asks me why don’t I do my part payment of home loan on bank’s portal? My reply is I don’t trust internet with huge amounts. Basically I travel 10 mins to the branch, wait for 5 mins, spend 5 mins on formalities and properly handover the cheque with big amount to a proper bank representative.",
        "I have seen UPI business transactions connected to Current account reversed. So your statement is not entirely true. You will need the immediate help of a bank official though.",
        "I know right.. Just open a link and boom you lose money , it doesn't make sense to me from a CS point of view. Are they using any 0 day exploits. I don't think scammers do this type of stuff though.   \nI think some details are left out. I think the person did fill his details.",
        "Maybe.. you can just have it at auto , so the amount gets deducted automatically y'know?  \nAlso COD exists for a reason. Also amazon is so so much better than facebook in such things , there is virtually not much difference between amazon and facebook except I've heard quite a bit of scams on facebooks on this exact subreddit.",
        "THE CLASSIC WAYS ARE ALWAYS A GO TO NOT GONNA LIE.",
        "Yeah and ofcourse he won't admit it in the FIR thinking he has a chance at getting the transaction reversed from the bank .",
        "How is nobody talking about the fact that a dishonest person got scammed here",
        "That's what I think too he has to enter some details in order to get scammed like this that's how people are nowadays they just do it, coz they find it boring to read stuff that are actually imp. and when they end up getting scammed for the same mistake they suddenly start blaming others i am not saying it's just his fault but people just need to take time and read certain stuffs before initiating something especially in this scamming era."
    ],
    "cleaned_text": "scammers going crazy ngl stay safe guys came across article thought might help guys toes shopping online ",
    "cleaned_title": "scammers going crazy ngl",
    "cleaned_selftext": "stay safe guys came across article thought might help guys toes shopping online",
    "cleaned_comments": "transactions reversed upi scammed transactions never reversed upi even u lodge complaint upi get back asking raise complaint bank bank ask file police complaint saying receiver available insufficient balance receivers account careful using upi kal hi pdha hai answer key mei question galat tick maara tha agr itni jaldi bhul gya apna ilaaz krvane chla jaunga ye rha bhai sirf upi safe hai dhikane keliye ye sab govt advertise karthe hai real life ek bar galati kardiya manlo paisa gya ha colluded hota hoga system vrna track krna aur reverse krna transaction ko verify krke asaan process hai information missing upi wont work without upi pin app lock codepattern card otp needs card details netbanking needs useridpass mpin unless stored info plainsight phone possible must entered info clicked link pretty sure card details started using dumb ways like old times purchase things physically check paying dont transaction k unless trusted recipients prefer neft upis big transactions better slow scam bank rep asks dont part payment home loan banks portal reply dont trust internet huge amounts basically travel mins branch wait mins spend mins formalities properly handover cheque big amount proper bank representative seen upi business transactions connected current account reversed statement entirely true need immediate help bank official though know right open link boom lose money doesnt make sense cs point view using day exploits dont think scammers type stuff though think details left think person fill details maybe auto amount gets deducted automatically yknow also cod exists reason also amazon much better facebook things virtually much difference amazon facebook except ive heard quite bit scams facebooks exact subreddit classic ways always go gon na lie yeah ofcourse wont admit fir thinking chance getting transaction reversed bank nobody talking fact dishonest person got scammed thats think enter details order get scammed like thats people nowadays coz find boring read stuff actually imp end getting scammed mistake suddenly start blaming others saying fault people need take time read certain stuffs initiating something especially scamming era",
    "light_cleaned_title": "Scammers are going crazy NGL",
    "light_cleaned_selftext": "Stay safe guys came across this article, thought this might help you guys to be on your toes while shopping online.",
    "light_cleaned_comments": "Transactions can be reversed in UPI, if been scammed. Transactions will never be reversed in UPI, even if u lodge a complaint UPI will get back asking you to raise a complaint with the bank, Bank will ask you to file a police complaint saying the receiver not available or insufficient balance in receivers account. Be very careful while using UPI😅 Kal hi pdha hai answer key mei, question galat tick maara tha. Agr itni jaldi bhul gya to apna ilaaz krvane chla jaunga Ye rha Bhai sirf “ UPI safe hai “ dhikane keliye ye sab govt advertise karthe hai, real life me ek bar galati kardiya to manlo paisa gya Ha, colluded hota hoga system. Vrna track krna aur reverse krna transaction ko verify krke asaan process hai. Some information is missing. UPI won't work without UPI pin and app lock code/pattern. Card otp needs card details. Netbanking needs userid,pass or mPin. Unless he had stored this info in plainsight on his phone it's just not possible He must have entered some info when he clicked that link , pretty sure it was his card details. I just started using the dumb ways like old times. Purchase things physically, check it before paying. I don’t do any transaction above 20k unless doing it with trusted recipients. I prefer NEFT over UPIs for big transactions. Better slow than scam. The bank rep asks me why don’t I do my part payment of home loan on bank’s portal? My reply is I don’t trust internet with huge amounts. Basically I travel 10 mins to the branch, wait for 5 mins, spend 5 mins on formalities and properly handover the cheque with big amount to a proper bank representative. I have seen UPI business transactions connected to Current account reversed. So your statement is not entirely true. You will need the immediate help of a bank official though. I know right.. Just open a link and boom you lose money , it doesn't make sense to me from a CS point of view. Are they using any 0 day exploits. I don't think scammers do this type of stuff though. I think some details are left out. I think the person did fill his details. Maybe.. you can just have it at auto , so the amount gets deducted automatically y'know? Also COD exists for a reason. Also amazon is so so much better than facebook in such things , there is virtually not much difference between amazon and facebook except I've heard quite a bit of scams on facebooks on this exact subreddit. THE CLASSIC WAYS ARE ALWAYS A GO TO NOT GONNA LIE. Yeah and ofcourse he won't admit it in the FIR thinking he has a chance at getting the transaction reversed from the bank . How is nobody talking about the fact that a dishonest person got scammed here That's what I think too he has to enter some details in order to get scammed like this that's how people are nowadays they just do it, coz they find it boring to read stuff that are actually imp. and when they end up getting scammed for the same mistake they suddenly start blaming others i am not saying it's just his fault but people just need to take time and read certain stuffs before initiating something especially in this scamming era."
}