{
    "id": "flt1kx",
    "title": "Read IFF’s Response to the Draft Competition (Amendment) Bill, 2020",
    "url": "https://www.reddit.com/r/india/comments/flt1kx/read_iffs_response_to_the_draft_competition/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/1qrp3ydx2tn41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=32cb6d54eff751a80678d6e010d62b8c9725d72a\n\n### Tl;dr\n\nIFF shared a response with the Ministry of Corporate Affairs on its draft Competition (Amendment) Bill, 2020 which was put out for public consultation last month. We suggest ways in which the Government could strengthen and streamline its institutions within India’s competition framework. More importantly we stress on the need for India’s competition laws to be modernised to reflect challenges emerging from market concentration in technology markets. We look at it through the prism of innovation, consumer welfare and human rights dimensions. We also flag our concerns with certain insertions in the draft amendment. Additionally, we suggest certain additions/changes to help adapt the role of competition frameworks to modern digital markets.\n\n### Background to the proposed amendment\n\nOwing to the ongoing COVID-19 global pandemic, many people across India are adjusting to their new reality of work from home and learn from home environments. In such times, important professional, education and personal connections are being facilitated by the internet. In particular a lot of us will notice that most of our integral interactions are being facilitated by platforms typically provided by a few firms. One may even say that these platforms and services which are required for communication, collaboration, information gathering and so on are becoming essential in these times. However, ask yourselves this. When these potentially essential services are basically controlled by a few firms what are the risks which arise as a consequence? Well, our response last week to the Ministry of Corporate Affairs  (“MCA”) attempts to articulate these concerns and submits proposals in a recently concluded consultation of India’s competition laws.\n\nFor context, on February 20, 2020 the MCA released a call for public comments on a proposed amendment to [**India’s Competition Act, 2002**](https://www.cci.gov.in/sites/default/files/cci_pdf/competitionact2012.pdf). In its current form the proposed amendment is called the [**draft Competition (Amendment) Bill, 2020**](http://feedapp.mca.gov.in/pdf/Draft-Competition-Amendment-Bill-2020.pdf). This amendment was an outcome to an earlier process where the Government had formed a Competition Law Review Committee (“CLRC”). This Committee submitted its final recommendations and accompanying [**report**](http://www.mca.gov.in/Ministry/pdf/ReportCLRC_14082019.pdf) in August last year. In short the Committee made 50 recommendations and has a dedicated chapter on how competition laws must be updated for the digital economy.\n\n### So what does the proposed amendment attempt to do?\n\nTo its credit, the proposed amendment accepts 45 of the CLRC’s recommendations. Relevant for the digital economy, it tries to broaden definitions for what constitutes a “cartel”. In addition the amendment attempts to broaden India’s nodal competition authority i.e. the Competition Commission of India’s (“CCI’s”) ability to scrutinise anti-competitive agreements/arrangements. This is important since digital economies are multi-sided markets which are prone to rapid “[**network effects**](https://hbr.org/2019/01/why-some-platforms-thrive-and-others-dont)”. In essence it is also prone to challenges like user lock in, or stickiness. Such considerations also serve as a barrier for other players to compete since service providers must necessarily also acquire a degree of scale to survive. In this context, there are many instances of service delivery chains being integrated through strategic partnerships by large technology platforms in a manner where businesses end up being excluded and struggle to compete. To this end, we laud the amendment’s attempt to broaden the CCI’s ability to look into anti-competitive agreements.\n\nSimilarly, we applaud the amendment’s attempt in expanding the CCI’s ability to scrutinise mergers and acquisitions (collectively referred to as combinations) in technology markets. This is important since large  mergers and acquisitions which often slip under the radar in technology markets-- and can lead to silent concentration in markets unbeknownst to users and even the regulator. Some clear examples of this include Microsoft’s acquisitions of Skype and LinkedIn; Facebook’s acquisitions of WhatsApp and Instagram; or Google’s acquisitions of health companies like FitBit. The reason this happens is because in digital markets it is difficult to gauge assets and the nature of the concentration really taking place in the market. To this end, we applaud the proposed amendment which seems like an enabling provision to scrutinise mergers of an ilk similar to the ones mentioned above.\n\n### Well if the amendment sounds so good then what’s missing or wrong? And what have we said?\n\nFirst, our response has really focused on better institutional design. First, the amendment proposes institutional changes which may compromise the independence of the CCI, thereby compromising an essential facet of strong competition laws. We propose a change which can achieve the desired objective of accountability whilst preserving the desired goal of CCI’s independence vis-a-vis Government functionaries. We have also suggested that in modern technology markets there will be greater need for the CCI to coordinate with other sector specific regulators in domains like telecom, digital payments and user privacy. We propose a framework through which such interactions are formalised and can be as streamlined as possible. We have also suggested measures to improve capacity within the CCI and its appellate structures, in terms of number of benches (to help with overburdening of cases), and greater specialisation which will be required when it comes to competition matters in technology markets.\n\nSecond, we oppose a specific insertion which seeks to create an exception for intellectual property holders when it comes to investigations on abuse of dominance. Abuse of dominance is a type of anti-competitive practices where an entity uses its power within the market, to either suppress competition, innovation, consumer choice and so on. Relying on the works of [**field experts**](https://spicyip.com/2020/03/draft-competition-act-amendment-bill-proposes-extension-of-protection-to-ipr-holders-in-abuse-of-dominance-cases.html) we have articulated that such a carve out for IP holders in matters of abuse of dominance does not exist in other advanced jurisdictions like Europe. Second, an exception for IP holders would be able to use this as a defence tactic which can slow down or serve as an obstacle to legitimate investigations in abuse of dominance cases. The same research also indicates that such a provision may also make it harder to hold players who provide essential facilities accountable. As we have seen in the context of COVID-19 there are certain players in information/tech markets which provide services which may be construed as essential facilities.\n\nThird, we stress on the need for competition laws to be amended in a manner to hold big tech and big data analysis accountable. Our response relies considerably on the works of international organisations like [**Privacy International**](https://privacyinternational.org/explainer/2293/competition-and-data). We unpack how our personal data is often used as a proxy for price. And therefore, there is an inextricable linkage with our informational privacy. We discuss how our rights may be harmed by opaque integration of upstream and downstream chains through which the service is put together and ultimately delivered to consumers. Similarly, major mergers and acquisitions are also linked with individual rights including the right to privacy. What it also leads to is a greater concentration of our personal data across a few entities.\n\nUnfortunately, our competition laws are not mature enough to adequately look at what constitutes holding a dominant position in internet markets. Second, our competition laws (as articulated by the CCI in matters like *Vinod Kumar Gupta v WhatsApp Inc*) do not view it as an essential to consider privacy when hearing competition related matters. We suggest mechanisms through which individual rights should also be considered in our competition frameworks. \n\nOne suggestion we make pertains to instances of combinations; or key business decisions which consider integration of different databases/backend infrastructure. We believe the CCI should be able to have the ability to work with relevant authorities like India’s future data protection authority to undertake human rights or privacy impact assessment as a result of a suggested measure. Along the same lines we also suggest that the CCI must modernise its approaches in measuring what constitutes enjoying a dominant position in a particular market.\n\nWe hope the Ministry keeps our submissions in mind during subsequent deliberations. The hope is that a subsequent draft can have a more detailed consultation wherein stakeholders are afforded greater time and adequate space to share substantive feedback with the Ministry.\n\n### Important Documents\n\n1. Link to IFF’s Submission on the draft Competition Amendment Bill, 2020 ([**click here**](https://drive.google.com/file/d/14c9eT4helAMeRibXQvgW-6oys1gOqiTp/view?usp=sharing))\n2. Link to the Ministry of Corporate Affairs’ draft Competition Amendment Bill, 2020 ([**click here**](http://feedapp.mca.gov.in//pdf/Draft-Competition-Amendment-Bill-2020.pdf))\n3. Link to the Competition Law Review Committee's report which was published in August 2019 ([**click here**](http://www.mca.gov.in/Ministry/pdf/ReportCLRC_14082019.pdf))\n4. Link to the Competition Act, 2002 ([**click here**](https://www.cci.gov.in/sites/default/files/cci_pdf/competitionact2012.pdf))\n5. Link to a SpicyIP post by Dr Vikas Kathuria which explains challenges with exceptions for IP holders against abuse of dominance investigations ([**click here**](https://spicyip.com/2020/03/draft-competition-act-amendment-bill-proposes-extension-of-protection-to-ipr-holders-in-abuse-of-dominance-cases.html))\n6. Link to an explainer by Privacy International on the relationship between competition laws and people’s privacy ([**click here**](https://privacyinternational.org/explainer/2293/competition-and-data))  \n\n\n**Uncle Ben taught us well! Our objective is to hold large platforms accountable. Our mission is to support individual and entrepreneur centric innovation. You too can jump on the cause and #SaveTheInternet.** [**Help us by joining forces and becoming an IFF Member today!**](https://internetfreedom.in/donate/)\n\n**Have some views on how we can hold large internet players accountable? Kick start the conversation with our community on IFF’s new forum at** [**forum.internetfreedom.in**](https://forum.internetfreedom.in/)**.**",
    "flair": "Policy/Economy",
    "score": 4,
    "num_comments": 0,
    "created_utc": 1584701534,
    "convurl": "https://a.thumbs.redditmedia.com/WCH4VZ3eUcwwnrK0ZUBx-l0CONalfBBMXjioGovw3r8.jpg",
    "comments": [],
    "cleaned_text": "read iffs response draft competition amendment bill ampxb tldr iff shared response ministry corporate affairs draft competition amendment bill put public consultation last month suggest ways government could strengthen streamline institutions within indias competition framework importantly stress need indias competition laws modernised reflect challenges emerging market concentration technology markets look prism innovation consumer welfare human rights dimensions also flag concerns certain insertions draft amendment additionally suggest certain additionschanges help adapt role competition frameworks modern digital markets background proposed amendment owing ongoing covid global pandemic many people across india adjusting new reality work home learn home environments times important professional education personal connections facilitated internet particular lot us notice integral interactions facilitated platforms typically provided firms one may even say platforms services required communication collaboration information gathering becoming essential times however ask potentially essential services basically controlled firms risks arise consequence well response last week ministry corporate affairs mca attempts articulate concerns submits proposals recently concluded consultation indias competition laws context february mca released call public comments proposed amendment indias competition act httpswwwccigovinsitesdefaultfilesccipdfcompetitionactpdf current form proposed amendment called draft competition amendment bill httpfeedappmcagovinpdfdraftcompetitionamendmentbillpdf amendment outcome earlier process government formed competition law review committee clrc committee submitted final recommendations accompanying reporthttpwwwmcagovinministrypdfreportclrcpdf august last year short committee made recommendations dedicated chapter competition laws must updated digital economy proposed amendment attempt credit proposed amendment accepts clrcs recommendations relevant digital economy tries broaden definitions constitutes cartel addition amendment attempts broaden indias nodal competition authority ie competition commission indias ccis ability scrutinise anticompetitive agreementsarrangements important since digital economies multisided markets prone rapid network effectshttpshbrorgwhysomeplatformsthriveandothersdont essence also prone challenges like user lock stickiness considerations also serve barrier players compete since service providers must necessarily also acquire degree scale survive context many instances service delivery chains integrated strategic partnerships large technology platforms manner businesses end excluded struggle compete end laud amendments attempt broaden ccis ability look anticompetitive agreements similarly applaud amendments attempt expanding ccis ability scrutinise mergers acquisitions collectively referred combinations technology markets important since large mergers acquisitions often slip radar technology markets lead silent concentration markets unbeknownst users even regulator clear examples include microsofts acquisitions skype linkedin facebooks acquisitions whatsapp instagram googles acquisitions health companies like fitbit reason happens digital markets difficult gauge assets nature concentration really taking place market end applaud proposed amendment seems like enabling provision scrutinise mergers ilk similar ones mentioned well amendment sounds good whats missing wrong said first response really focused better institutional design first amendment proposes institutional changes may compromise independence cci thereby compromising essential facet strong competition laws propose change achieve desired objective accountability whilst preserving desired goal ccis independence visavis government functionaries also suggested modern technology markets greater need cci coordinate sector specific regulators domains like telecom digital payments user privacy propose framework interactions formalised streamlined possible also suggested measures improve capacity within cci appellate structures terms number benches help overburdening cases greater specialisation required comes competition matters technology markets second oppose specific insertion seeks create exception intellectual property holders comes investigations abuse dominance abuse dominance type anticompetitive practices entity uses power within market either suppress competition innovation consumer choice relying works field expertshttpsspicyipcomdraftcompetitionactamendmentbillproposesextensionofprotectiontoiprholdersinabuseofdominancecaseshtml articulated carve ip holders matters abuse dominance exist advanced jurisdictions like europe second exception ip holders would able use defence tactic slow serve obstacle legitimate investigations abuse dominance cases research also indicates provision may also make harder hold players provide essential facilities accountable seen context covid certain players informationtech markets provide services may construed essential facilities third stress need competition laws amended manner hold big tech big data analysis accountable response relies considerably works international organisations like privacy internationalhttpsprivacyinternationalorgexplainercompetitionanddata unpack personal data often used proxy price therefore inextricable linkage informational privacy discuss rights may harmed opaque integration upstream downstream chains service put together ultimately delivered consumers similarly major mergers acquisitions also linked individual rights including right privacy also leads greater concentration personal data across entities unfortunately competition laws mature enough adequately look constitutes holding dominant position internet markets second competition laws articulated cci matters like vinod kumar gupta v whatsapp inc view essential consider privacy hearing competition related matters suggest mechanisms individual rights also considered competition frameworks one suggestion make pertains instances combinations key business decisions consider integration different databasesbackend infrastructure believe cci able ability work relevant authorities like indias future data protection authority undertake human rights privacy impact assessment result suggested measure along lines also suggest cci must modernise approaches measuring constitutes enjoying dominant position particular market hope ministry keeps submissions mind subsequent deliberations hope subsequent draft detailed consultation wherein stakeholders afforded greater time adequate space share substantive feedback ministry important documents link iffs submission draft competition amendment bill click herehttpsdrivegooglecomfiledcethelameribxqvgwoysgoqitpviewuspsharing link ministry corporate affairs draft competition amendment bill click herehttpfeedappmcagovinpdfdraftcompetitionamendmentbillpdf link competition law review committees report published august click herehttpwwwmcagovinministrypdfreportclrcpdf link competition act click herehttpswwwccigovinsitesdefaultfilesccipdfcompetitionactpdf link spicyip post dr vikas kathuria explains challenges exceptions ip holders abuse dominance investigations click herehttpsspicyipcomdraftcompetitionactamendmentbillproposesextensionofprotectiontoiprholdersinabuseofdominancecaseshtml link explainer privacy international relationship competition laws peoples privacy click herehttpsprivacyinternationalorgexplainercompetitionanddata uncle ben taught us well objective hold large platforms accountable mission support individual entrepreneur centric innovation jump cause savetheinternet help us joining forces becoming iff member todayhttpsinternetfreedomindonate views hold large internet players accountable kick start conversation community iffs new forum foruminternetfreedominhttpsforuminternetfreedomin ",
    "cleaned_title": "read iffs response draft competition amendment bill",
    "cleaned_selftext": "ampxb tldr iff shared response ministry corporate affairs draft competition amendment bill put public consultation last month suggest ways government could strengthen streamline institutions within indias competition framework importantly stress need indias competition laws modernised reflect challenges emerging market concentration technology markets look prism innovation consumer welfare human rights dimensions also flag concerns certain insertions draft amendment additionally suggest certain additionschanges help adapt role competition frameworks modern digital markets background proposed amendment owing ongoing covid global pandemic many people across india adjusting new reality work home learn home environments times important professional education personal connections facilitated internet particular lot us notice integral interactions facilitated platforms typically provided firms one may even say platforms services required communication collaboration information gathering becoming essential times however ask potentially essential services basically controlled firms risks arise consequence well response last week ministry corporate affairs mca attempts articulate concerns submits proposals recently concluded consultation indias competition laws context february mca released call public comments proposed amendment indias competition act httpswwwccigovinsitesdefaultfilesccipdfcompetitionactpdf current form proposed amendment called draft competition amendment bill httpfeedappmcagovinpdfdraftcompetitionamendmentbillpdf amendment outcome earlier process government formed competition law review committee clrc committee submitted final recommendations accompanying reporthttpwwwmcagovinministrypdfreportclrcpdf august last year short committee made recommendations dedicated chapter competition laws must updated digital economy proposed amendment attempt credit proposed amendment accepts clrcs recommendations relevant digital economy tries broaden definitions constitutes cartel addition amendment attempts broaden indias nodal competition authority ie competition commission indias ccis ability scrutinise anticompetitive agreementsarrangements important since digital economies multisided markets prone rapid network effectshttpshbrorgwhysomeplatformsthriveandothersdont essence also prone challenges like user lock stickiness considerations also serve barrier players compete since service providers must necessarily also acquire degree scale survive context many instances service delivery chains integrated strategic partnerships large technology platforms manner businesses end excluded struggle compete end laud amendments attempt broaden ccis ability look anticompetitive agreements similarly applaud amendments attempt expanding ccis ability scrutinise mergers acquisitions collectively referred combinations technology markets important since large mergers acquisitions often slip radar technology markets lead silent concentration markets unbeknownst users even regulator clear examples include microsofts acquisitions skype linkedin facebooks acquisitions whatsapp instagram googles acquisitions health companies like fitbit reason happens digital markets difficult gauge assets nature concentration really taking place market end applaud proposed amendment seems like enabling provision scrutinise mergers ilk similar ones mentioned well amendment sounds good whats missing wrong said first response really focused better institutional design first amendment proposes institutional changes may compromise independence cci thereby compromising essential facet strong competition laws propose change achieve desired objective accountability whilst preserving desired goal ccis independence visavis government functionaries also suggested modern technology markets greater need cci coordinate sector specific regulators domains like telecom digital payments user privacy propose framework interactions formalised streamlined possible also suggested measures improve capacity within cci appellate structures terms number benches help overburdening cases greater specialisation required comes competition matters technology markets second oppose specific insertion seeks create exception intellectual property holders comes investigations abuse dominance abuse dominance type anticompetitive practices entity uses power within market either suppress competition innovation consumer choice relying works field expertshttpsspicyipcomdraftcompetitionactamendmentbillproposesextensionofprotectiontoiprholdersinabuseofdominancecaseshtml articulated carve ip holders matters abuse dominance exist advanced jurisdictions like europe second exception ip holders would able use defence tactic slow serve obstacle legitimate investigations abuse dominance cases research also indicates provision may also make harder hold players provide essential facilities accountable seen context covid certain players informationtech markets provide services may construed essential facilities third stress need competition laws amended manner hold big tech big data analysis accountable response relies considerably works international organisations like privacy internationalhttpsprivacyinternationalorgexplainercompetitionanddata unpack personal data often used proxy price therefore inextricable linkage informational privacy discuss rights may harmed opaque integration upstream downstream chains service put together ultimately delivered consumers similarly major mergers acquisitions also linked individual rights including right privacy also leads greater concentration personal data across entities unfortunately competition laws mature enough adequately look constitutes holding dominant position internet markets second competition laws articulated cci matters like vinod kumar gupta v whatsapp inc view essential consider privacy hearing competition related matters suggest mechanisms individual rights also considered competition frameworks one suggestion make pertains instances combinations key business decisions consider integration different databasesbackend infrastructure believe cci able ability work relevant authorities like indias future data protection authority undertake human rights privacy impact assessment result suggested measure along lines also suggest cci must modernise approaches measuring constitutes enjoying dominant position particular market hope ministry keeps submissions mind subsequent deliberations hope subsequent draft detailed consultation wherein stakeholders afforded greater time adequate space share substantive feedback ministry important documents link iffs submission draft competition amendment bill click herehttpsdrivegooglecomfiledcethelameribxqvgwoysgoqitpviewuspsharing link ministry corporate affairs draft competition amendment bill click herehttpfeedappmcagovinpdfdraftcompetitionamendmentbillpdf link competition law review committees report published august click herehttpwwwmcagovinministrypdfreportclrcpdf link competition act click herehttpswwwccigovinsitesdefaultfilesccipdfcompetitionactpdf link spicyip post dr vikas kathuria explains challenges exceptions ip holders abuse dominance investigations click herehttpsspicyipcomdraftcompetitionactamendmentbillproposesextensionofprotectiontoiprholdersinabuseofdominancecaseshtml link explainer privacy international relationship competition laws peoples privacy click herehttpsprivacyinternationalorgexplainercompetitionanddata uncle ben taught us well objective hold large platforms accountable mission support individual entrepreneur centric innovation jump cause savetheinternet help us joining forces becoming iff member todayhttpsinternetfreedomindonate views hold large internet players accountable kick start conversation community iffs new forum foruminternetfreedominhttpsforuminternetfreedomin",
    "cleaned_comments": "",
    "light_cleaned_title": "Read IFF’s Response to the Draft Competition (Amendment) Bill, 2020",
    "light_cleaned_selftext": "### Tl;dr IFF shared a response with the Ministry of Corporate Affairs on its draft Competition (Amendment) Bill, 2020 which was put out for public consultation last month. We suggest ways in which the Government could strengthen and streamline its institutions within India’s competition framework. More importantly we stress on the need for India’s competition laws to be modernised to reflect challenges emerging from market concentration in technology markets. We look at it through the prism of innovation, consumer welfare and human rights dimensions. We also flag our concerns with certain insertions in the draft amendment. Additionally, we suggest certain additions/changes to help adapt the role of competition frameworks to modern digital markets. ### Background to the proposed amendment Owing to the ongoing COVID-19 global pandemic, many people across India are adjusting to their new reality of work from home and learn from home environments. In such times, important professional, education and personal connections are being facilitated by the internet. In particular a lot of us will notice that most of our integral interactions are being facilitated by platforms typically provided by a few firms. One may even say that these platforms and services which are required for communication, collaboration, information gathering and so on are becoming essential in these times. However, ask yourselves this. When these potentially essential services are basically controlled by a few firms what are the risks which arise as a consequence? Well, our response last week to the Ministry of Corporate Affairs (“MCA”) attempts to articulate these concerns and submits proposals in a recently concluded consultation of India’s competition laws. For context, on February 20, 2020 the MCA released a call for public comments on a proposed amendment to [**India’s Competition Act, 2002**](https://www.cci.gov.in/sites/default/files/cci_pdf/competitionact2012.pdf). In its current form the proposed amendment is called the [**draft Competition (Amendment) Bill, 2020**](http://feedapp.mca.gov.in/pdf/Draft-Competition-Amendment-Bill-2020.pdf). This amendment was an outcome to an earlier process where the Government had formed a Competition Law Review Committee (“CLRC”). This Committee submitted its final recommendations and accompanying [**report**](http://www.mca.gov.in/Ministry/pdf/ReportCLRC_14082019.pdf) in August last year. In short the Committee made 50 recommendations and has a dedicated chapter on how competition laws must be updated for the digital economy. ### So what does the proposed amendment attempt to do? To its credit, the proposed amendment accepts 45 of the CLRC’s recommendations. Relevant for the digital economy, it tries to broaden definitions for what constitutes a “cartel”. In addition the amendment attempts to broaden India’s nodal competition authority i.e. the Competition Commission of India’s (“CCI’s”) ability to scrutinise anti-competitive agreements/arrangements. This is important since digital economies are multi-sided markets which are prone to rapid “[**network effects**](https://hbr.org/2019/01/why-some-platforms-thrive-and-others-dont)”. In essence it is also prone to challenges like user lock in, or stickiness. Such considerations also serve as a barrier for other players to compete since service providers must necessarily also acquire a degree of scale to survive. In this context, there are many instances of service delivery chains being integrated through strategic partnerships by large technology platforms in a manner where businesses end up being excluded and struggle to compete. To this end, we laud the amendment’s attempt to broaden the CCI’s ability to look into anti-competitive agreements. Similarly, we applaud the amendment’s attempt in expanding the CCI’s ability to scrutinise mergers and acquisitions (collectively referred to as combinations) in technology markets. This is important since large mergers and acquisitions which often slip under the radar in technology markets-- and can lead to silent concentration in markets unbeknownst to users and even the regulator. Some clear examples of this include Microsoft’s acquisitions of Skype and LinkedIn; Facebook’s acquisitions of WhatsApp and Instagram; or Google’s acquisitions of health companies like FitBit. The reason this happens is because in digital markets it is difficult to gauge assets and the nature of the concentration really taking place in the market. To this end, we applaud the proposed amendment which seems like an enabling provision to scrutinise mergers of an ilk similar to the ones mentioned above. ### Well if the amendment sounds so good then what’s missing or wrong? And what have we said? First, our response has really focused on better institutional design. First, the amendment proposes institutional changes which may compromise the independence of the CCI, thereby compromising an essential facet of strong competition laws. We propose a change which can achieve the desired objective of accountability whilst preserving the desired goal of CCI’s independence vis-a-vis Government functionaries. We have also suggested that in modern technology markets there will be greater need for the CCI to coordinate with other sector specific regulators in domains like telecom, digital payments and user privacy. We propose a framework through which such interactions are formalised and can be as streamlined as possible. We have also suggested measures to improve capacity within the CCI and its appellate structures, in terms of number of benches (to help with overburdening of cases), and greater specialisation which will be required when it comes to competition matters in technology markets. Second, we oppose a specific insertion which seeks to create an exception for intellectual property holders when it comes to investigations on abuse of dominance. Abuse of dominance is a type of anti-competitive practices where an entity uses its power within the market, to either suppress competition, innovation, consumer choice and so on. Relying on the works of [**field experts**](https://spicyip.com/2020/03/draft-competition-act-amendment-bill-proposes-extension-of-protection-to-ipr-holders-in-abuse-of-dominance-cases.html) we have articulated that such a carve out for IP holders in matters of abuse of dominance does not exist in other advanced jurisdictions like Europe. Second, an exception for IP holders would be able to use this as a defence tactic which can slow down or serve as an obstacle to legitimate investigations in abuse of dominance cases. The same research also indicates that such a provision may also make it harder to hold players who provide essential facilities accountable. As we have seen in the context of COVID-19 there are certain players in information/tech markets which provide services which may be construed as essential facilities. Third, we stress on the need for competition laws to be amended in a manner to hold big tech and big data analysis accountable. Our response relies considerably on the works of international organisations like [**Privacy International**](https://privacyinternational.org/explainer/2293/competition-and-data). We unpack how our personal data is often used as a proxy for price. And therefore, there is an inextricable linkage with our informational privacy. We discuss how our rights may be harmed by opaque integration of upstream and downstream chains through which the service is put together and ultimately delivered to consumers. Similarly, major mergers and acquisitions are also linked with individual rights including the right to privacy. What it also leads to is a greater concentration of our personal data across a few entities. Unfortunately, our competition laws are not mature enough to adequately look at what constitutes holding a dominant position in internet markets. Second, our competition laws (as articulated by the CCI in matters like *Vinod Kumar Gupta v WhatsApp Inc*) do not view it as an essential to consider privacy when hearing competition related matters. We suggest mechanisms through which individual rights should also be considered in our competition frameworks. One suggestion we make pertains to instances of combinations; or key business decisions which consider integration of different databases/backend infrastructure. We believe the CCI should be able to have the ability to work with relevant authorities like India’s future data protection authority to undertake human rights or privacy impact assessment as a result of a suggested measure. Along the same lines we also suggest that the CCI must modernise its approaches in measuring what constitutes enjoying a dominant position in a particular market. We hope the Ministry keeps our submissions in mind during subsequent deliberations. The hope is that a subsequent draft can have a more detailed consultation wherein stakeholders are afforded greater time and adequate space to share substantive feedback with the Ministry. ### Important Documents 1. Link to IFF’s Submission on the draft Competition Amendment Bill, 2020 ([**click here**](https://drive.google.com/file/d/14c9eT4helAMeRibXQvgW-6oys1gOqiTp/view?usp=sharing)) 2. Link to the Ministry of Corporate Affairs’ draft Competition Amendment Bill, 2020 ([**click here**](http://feedapp.mca.gov.in//pdf/Draft-Competition-Amendment-Bill-2020.pdf)) 3. Link to the Competition Law Review Committee's report which was published in August 2019 ([**click here**](http://www.mca.gov.in/Ministry/pdf/ReportCLRC_14082019.pdf)) 4. Link to the Competition Act, 2002 ([**click here**](https://www.cci.gov.in/sites/default/files/cci_pdf/competitionact2012.pdf)) 5. Link to a SpicyIP post by Dr Vikas Kathuria which explains challenges with exceptions for IP holders against abuse of dominance investigations ([**click here**](https://spicyip.com/2020/03/draft-competition-act-amendment-bill-proposes-extension-of-protection-to-ipr-holders-in-abuse-of-dominance-cases.html)) 6. Link to an explainer by Privacy International on the relationship between competition laws and people’s privacy ([**click here**](https://privacyinternational.org/explainer/2293/competition-and-data)) **Uncle Ben taught us well! Our objective is to hold large platforms accountable. Our mission is to support individual and entrepreneur centric innovation. You too can jump on the cause and #SaveTheInternet.** [**Help us by joining forces and becoming an IFF Member today!**](https://internetfreedom.in/donate/) **Have some views on how we can hold large internet players accountable? Kick start the conversation with our community on IFF’s new forum at** [**forum.internetfreedom.in**](https://forum.internetfreedom.in/)**.**",
    "light_cleaned_comments": ""
}