{
    "id": "16ndcq1",
    "title": "Chill in Nitish, INDIA ties grows: Boycott of TV anchors to coordination gaps to RJD minister row",
    "url": "https://indianexpress.com/article/political-pulse/chill-nitish-india-ties-grows-boycott-tv-anchors-coordination-rjd-minister-row-8947883/",
    "selftext": "'Right from how joint rallies should be planned to how Left parties should be taken into confidence, to what should be INDIA's stand on caste census, we need more clarity,' says a JD(U) leader.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695188921.0,
    "convurl": "https://external-preview.redd.it/MJNxmLe_cUeJlXavpEWemK0SNjhXSD1xcQbMmUAG8YM.jpg?auto=webp&s=3e3ca4a318ff830c2ac47ab0795f54082d8a9dff",
    "comments": [
        ">Among other issues, Nitish is said to be uncomfortable with the RJD’s alleged bid to sharpen “backward versus forward” politics by not reining in its Education Minister Chandra Shekhar, who continues to criticise Ramcharitmanas.\n\n>The BJP also appears to have softened its targeting of Nitish in recent days, with Union Home Minister Amit Shah remaining mild in his attack on him while addressing a rally at Jhanjharpur rally in Madhubani last Saturday. Shah likened Nitish to “water” and Lalu to “oil”, adding that “oil does not mix with water but ends up defiling it”. He also refrained from reiterating that the “BJP door has been shut for him for ever”.\n\n>JD(U) sources said while Nitish would continue to sail with the INDIA bloc, he was upset with his allies over “lack of proper coordination and communication” in the grouping. “Right from how joint rallies should be planned to how Left parties should be taken into confidence, to what should be the INDIA’s stand on caste census, we need more clarity,” said a JD (U) leader, requesting anonymity.\n\n>The JD(U) has taken a dim view of Chandra Shekhar’s repeated criticism of Tulsidas’s epic, with the party’s chief spokesperson Neeraj Kumar saying “Our ministers should focus on matters on governance rather than speaking on sensitive issues, especially on matters of religion”. Neeraj sought to play down differences within the INDIA alliance, though.\n\nThey need to sort all these issues quick"
    ],
    "cleaned_text": "chill nitish india ties grows boycott tv anchors coordination gaps rjd minister row right joint rallies planned left parties taken confidence indias stand caste census need clarity says jdu leader ",
    "cleaned_title": "chill nitish india ties grows boycott tv anchors coordination gaps rjd minister row",
    "cleaned_selftext": "right joint rallies planned left parties taken confidence indias stand caste census need clarity says jdu leader",
    "cleaned_comments": "among issues nitish said uncomfortable rjds alleged bid sharpen backward versus forward politics reining education minister chandra shekhar continues criticise ramcharitmanas bjp also appears softened targeting nitish recent days union home minister amit shah remaining mild attack addressing rally jhanjharpur rally madhubani last saturday shah likened nitish water lalu oil adding oil mix water ends defiling also refrained reiterating bjp door shut ever jdu sources said nitish would continue sail india bloc upset allies lack proper coordination communication grouping right joint rallies planned left parties taken confidence indias stand caste census need clarity said jd u leader requesting anonymity jdu taken dim view chandra shekhars repeated criticism tulsidass epic partys chief spokesperson neeraj kumar saying ministers focus matters governance rather speaking sensitive issues especially matters religion neeraj sought play differences within india alliance though need sort issues quick",
    "light_cleaned_title": "Chill in Nitish, INDIA ties grows: Boycott of TV anchors to coordination gaps to RJD minister row",
    "light_cleaned_selftext": "'Right from how joint rallies should be planned to how Left parties should be taken into confidence, to what should be INDIA's stand on caste census, we need more clarity,' says a JD(U) leader.",
    "light_cleaned_comments": ">Among other issues, Nitish is said to be uncomfortable with the RJD’s alleged bid to sharpen “backward versus forward” politics by not reining in its Education Minister Chandra Shekhar, who continues to criticise Ramcharitmanas. >The BJP also appears to have softened its targeting of Nitish in recent days, with Union Home Minister Amit Shah remaining mild in his attack on him while addressing a rally at Jhanjharpur rally in Madhubani last Saturday. Shah likened Nitish to “water” and Lalu to “oil”, adding that “oil does not mix with water but ends up defiling it”. He also refrained from reiterating that the “BJP door has been shut for him for ever”. >JD(U) sources said while Nitish would continue to sail with the INDIA bloc, he was upset with his allies over “lack of proper coordination and communication” in the grouping. “Right from how joint rallies should be planned to how Left parties should be taken into confidence, to what should be the INDIA’s stand on caste census, we need more clarity,” said a JD (U) leader, requesting anonymity. >The JD(U) has taken a dim view of Chandra Shekhar’s repeated criticism of Tulsidas’s epic, with the party’s chief spokesperson Neeraj Kumar saying “Our ministers should focus on matters on governance rather than speaking on sensitive issues, especially on matters of religion”. Neeraj sought to play down differences within the INDIA alliance, though. They need to sort all these issues quick"
}