{
    "id": "1ciad5z",
    "title": "Meitei women vigilante group frees 11 armed men detained by Army in Manipur",
    "url": "https://www.indiatoday.in/amp/india/story/manipur-violence-armed-men-dressed-in-police-attire-freed-mahar-regiment-2533818-2024-05-01",
    "selftext": "The 11 armed individuals, dressed in police attire and intercepted by personnel of the Army's 2 Mahar regiment in Imphal, were freed on Wednesday.\n\nThe men were detained during patrolling in the early hours of Tuesday, after they were found in possession of a significant arsenal, including AK rifles, INSAS rifles, SLRs, hand grenades, and bulletproof jackets.",
    "flair": "Law & Courts",
    "score": 160,
    "num_comments": 8,
    "created_utc": 1714637950.0,
    "convurl": "https://external-preview.redd.it/arfZmiUVP_yPqaAen0f-mbX9HWOs5_-XrQO4npicrPs.jpg?auto=webp&s=7c33f5eb19652e3b4dae3bf6f9f250ea9ff2e4b7",
    "comments": [
        "Those 11 armed men were PLA-M (people's liberation army Manipur-meitei) a separatist meitei militant group. They carried out many ambushes against our Indian army which took the lives of many and injured several others.  A few years back they bombed an army Colonel entourage which took the lives of the colonel, his wife, his kid and several other Central forces",
        ">It was then agreed that the Army would later hand the arms to the police\n\nWtf? District police is not a neutral player.\n\nPrivate militias in Manipur must be ordered to stand down or get wiped out.",
        "Feku's \"timely intervention\" in Manipur clearly showing good results",
        "What the fuck is even happening in Manipur. After all these months scumbag Mudi couldn't fix anything.",
        "Hahaha",
        "All militants must be wiped and ended swiftly. The situation in Manipur has to be controlled. Leaving the people to the mercy of the circumstances cannot be accepted.\n\nThe government should need be impose presidents rule or whatever procedures follow to re establish law and order and to stabilise the area.",
        "Kya matlab mudi xi ne Manipur pe to kuch Kiya nahi lekin Congress Wale sawan m meat khate hn speach m bol rahe 🗿💀",
        "When government looses people's trust, they take up arms.",
        "Yes but BJP govt in state isn’t doing shit.\n\nMeiteis are afraid to blame the BJP govt in the state either. If CM Biren was replaced, this won’t have gone as far as this. I could be wrong though."
    ],
    "cleaned_text": "meitei women vigilante group frees armed men detained army manipur armed individuals dressed police attire intercepted personnel armys mahar regiment imphal freed wednesday men detained patrolling early hours tuesday found possession significant arsenal including ak rifles insas rifles slrs hand grenades bulletproof jackets ",
    "cleaned_title": "meitei women vigilante group frees armed men detained army manipur",
    "cleaned_selftext": "armed individuals dressed police attire intercepted personnel armys mahar regiment imphal freed wednesday men detained patrolling early hours tuesday found possession significant arsenal including ak rifles insas rifles slrs hand grenades bulletproof jackets",
    "cleaned_comments": "armed men plam peoples liberation army manipurmeitei separatist meitei militant group carried many ambushes indian army took lives many injured several others years back bombed army colonel entourage took lives colonel wife kid several central forces agreed army would later hand arms police wtf district police neutral player private militias manipur must ordered stand get wiped fekus timely intervention manipur clearly showing good results fuck even happening manipur months scumbag mudi couldnt fix anything hahaha militants must wiped ended swiftly situation manipur controlled leaving people mercy circumstances accepted government need impose presidents rule whatever procedures follow establish law order stabilise area kya matlab mudi xi ne manipur pe kuch kiya nahi lekin congress wale sawan meat khate hn speach bol rahe government looses peoples trust take arms yes bjp govt state isnt shit meiteis afraid blame bjp govt state either cm biren replaced wont gone far could wrong though",
    "light_cleaned_title": "Meitei women vigilante group frees 11 armed men detained by Army in Manipur",
    "light_cleaned_selftext": "The 11 armed individuals, dressed in police attire and intercepted by personnel of the Army's 2 Mahar regiment in Imphal, were freed on Wednesday. The men were detained during patrolling in the early hours of Tuesday, after they were found in possession of a significant arsenal, including AK rifles, INSAS rifles, SLRs, hand grenades, and bulletproof jackets.",
    "light_cleaned_comments": "Those 11 armed men were PLA-M (people's liberation army Manipur-meitei) a separatist meitei militant group. They carried out many ambushes against our Indian army which took the lives of many and injured several others. A few years back they bombed an army Colonel entourage which took the lives of the colonel, his wife, his kid and several other Central forces >It was then agreed that the Army would later hand the arms to the police Wtf? District police is not a neutral player. Private militias in Manipur must be ordered to stand down or get wiped out. Feku's \"timely intervention\" in Manipur clearly showing good results What the fuck is even happening in Manipur. After all these months scumbag Mudi couldn't fix anything. Hahaha All militants must be wiped and ended swiftly. The situation in Manipur has to be controlled. Leaving the people to the mercy of the circumstances cannot be accepted. The government should need be impose presidents rule or whatever procedures follow to re establish law and order and to stabilise the area. Kya matlab mudi xi ne Manipur pe to kuch Kiya nahi lekin Congress Wale sawan m meat khate hn speach m bol rahe 🗿💀 When government looses people's trust, they take up arms. Yes but BJP govt in state isn’t doing shit. Meiteis are afraid to blame the BJP govt in the state either. If CM Biren was replaced, this won’t have gone as far as this. I could be wrong though."
}