{
    "id": "1hcjfd8",
    "title": "No surveys of places of worship, fresh suits till hearing ends: Supreme Court",
    "url": "https://www.indiatoday.in/india/law-news/story/mandir-masjid-supreme-court-places-of-worship-act-1991-hearing-2648824-2024-12-12",
    "selftext": "In a significant decision, #SupremeCourt directs that till it decides the case on #PlacesofWorshipAct , no other court shall: \n\n1. Register any fresh suits\n2. pass any effective final orders or interim order \n3. No decision of surveying any area etc",
    "flair": "Law & Courts",
    "score": 11,
    "num_comments": 3,
    "created_utc": 1734004286.0,
    "convurl": "https://external-preview.redd.it/9oXjLd8ZKbdiAVUgwQPNmmbkBpMvloS23QW4JzDVJks.jpg?auto=webp&s=fa389e13b022739cfa265d6c49e8bf14f6cb8e3b",
    "comments": [
        "Fuckers are going to weaken the act if not outright repeal it. I guarantee it. ",
        "We as a Hindu majoritarian country can demolish mosque and build temples in its places but when hindu temples are demolished and a mosque is built in its place in Afghanistan, pakistan or Bangladesh, it is wrong? Fuck RSS/BJP.\n\nThis is hunting minorities. This will lead to islamic extremists, Christian extremists and Hindu extremists. Religious harmony is NIL in this country at this right now.\n\nBJP/RSS strategy is, 1) give tax cuts to corporationton 2) Give airports, expressways and vande Bharat to upper middle class and middle class. 3) Use religion to attract poor people.  \n\nJust sick of people and political parties use religion to advance their Power & money."
    ],
    "cleaned_text": "surveys places worship fresh suits till hearing ends supreme court significant decision supremecourt directs till decides case placesofworshipact court shall register fresh suits pass effective final orders interim order decision surveying area etc ",
    "cleaned_title": "surveys places worship fresh suits till hearing ends supreme court",
    "cleaned_selftext": "significant decision supremecourt directs till decides case placesofworshipact court shall register fresh suits pass effective final orders interim order decision surveying area etc",
    "cleaned_comments": "fuckers going weaken act outright repeal guarantee hindu majoritarian country demolish mosque build temples places hindu temples demolished mosque built place afghanistan pakistan bangladesh wrong fuck rssbjp hunting minorities lead islamic extremists christian extremists hindu extremists religious harmony nil country right bjprss strategy give tax cuts corporationton give airports expressways vande bharat upper middle class middle class use religion attract poor people sick people political parties use religion advance power money",
    "light_cleaned_title": "No surveys of places of worship, fresh suits till hearing ends: Supreme Court",
    "light_cleaned_selftext": "In a significant decision, #SupremeCourt directs that till it decides the case on #PlacesofWorshipAct , no other court shall: 1. Register any fresh suits 2. pass any effective final orders or interim order 3. No decision of surveying any area etc",
    "light_cleaned_comments": "Fuckers are going to weaken the act if not outright repeal it. I guarantee it. We as a Hindu majoritarian country can demolish mosque and build temples in its places but when hindu temples are demolished and a mosque is built in its place in Afghanistan, pakistan or Bangladesh, it is wrong? Fuck RSS/BJP. This is hunting minorities. This will lead to islamic extremists, Christian extremists and Hindu extremists. Religious harmony is NIL in this country at this right now. BJP/RSS strategy is, 1) give tax cuts to corporationton 2) Give airports, expressways and vande Bharat to upper middle class and middle class. 3) Use religion to attract poor people. Just sick of people and political parties use religion to advance their Power & money."
}