{
    "id": "1544uhb",
    "title": "What a fuckin joke!",
    "url": "https://www.reddit.com/gallery/1544uhb",
    "selftext": "Manipur police is so swift at arresting any random person who makes a comment against the CM or government on social media even if they are residing outside the state ( yes I know because I have friends who are constantly targeted for their social media posts) but they could not find the rapists even after 2 months.Some faces are clearly seen in the video and the location of the incident is also known.And they have only spoken up after the video got viral today.What a joke! This is sickening!",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689795885.0,
    "convurl": "https://i.redd.it/sjg24oaq6zcb1.jpg",
    "comments": [
        "https://twitter.com/manipur_police/status/1681709460618895360?t=7xiQa1H-gYxGmuOrFOdfug&s=19",
        "A case of two identity. Both murdered by Meitei miscreants. One of them is a Kuki. Another a Naga.  \nDifferent treatment from Manipur Goverment and Manipur Police.  \n\n\nhttps://preview.redd.it/bdw9dnc7f0db1.jpeg?width=1079&format=pjpg&auto=webp&s=75ed2838312bcd928eccf79b56e5d3fb2fdc02d5",
        "&#x200B;\n\nhttps://preview.redd.it/eavnzqr3g0db1.jpeg?width=720&format=pjpg&auto=webp&s=491b38bd660c6d0a50bf86b76012a5903eb2c421",
        "They are just implementing the guju model"
    ],
    "cleaned_text": "fuckin joke manipur police swift arresting random person makes comment cm government social media even residing outside state yes know friends constantly targeted social media posts could find rapists even monthssome faces clearly seen video location incident also knownand spoken video got viral todaywhat joke sickening ",
    "cleaned_title": "fuckin joke",
    "cleaned_selftext": "manipur police swift arresting random person makes comment cm government social media even residing outside state yes know friends constantly targeted social media posts could find rapists even monthssome faces clearly seen video location incident also knownand spoken video got viral todaywhat joke sickening",
    "cleaned_comments": "case two identity murdered meitei miscreants one kuki another naga different treatment manipur goverment manipur police xb implementing guju model",
    "light_cleaned_title": "What a fuckin joke!",
    "light_cleaned_selftext": "Manipur police is so swift at arresting any random person who makes a comment against the CM or government on social media even if they are residing outside the state ( yes I know because I have friends who are constantly targeted for their social media posts) but they could not find the rapists even after 2 months.Some faces are clearly seen in the video and the location of the incident is also known.And they have only spoken up after the video got viral today.What a joke! This is sickening!",
    "light_cleaned_comments": "A case of two identity. Both murdered by Meitei miscreants. One of them is a Kuki. Another a Naga. Different treatment from Manipur Goverment and Manipur Police. &#x200B; They are just implementing the guju model"
}