{
    "id": "1d40ymd",
    "title": "Special Marriage Act union between Hindu and Muslim not valid under Muslim Law: Madhya Pradesh High Court",
    "url": "https://www.barandbench.com/news/special-marriage-act-union-between-hindu-muslim-not-valid-muslim-law-madhya-pradesh-high-court",
    "selftext": "Incompetent Judiciary Strikes again. If this doesn't scream out for UCC then nothing ever will. ",
    "flair": "Law & Courts",
    "score": 163,
    "num_comments": 33,
    "created_utc": 1717065426.0,
    "convurl": "https://external-preview.redd.it/j2za6mU1RHIJnUJQ6-bR7wAgBlOnxgw79CIkVghXCdo.jpg?auto=webp&s=47c0cd267d7acb711a7237cec63f5d5cf1ca6816",
    "comments": [
        "UCC is dire need for this generation. Anybody who doesn't like it will have to evaluate their priorities, no matter how uncomfortable it is.",
        "Why do you think people are uncomfortable with ucc proposed by bjp",
        "UCC and BJP ucc is different. Most progressives support UCC, what people don’t support is BJP UCC which is way more regressive",
        "Agreed, but if Miya-Biwi raazi, to kya karega Qazi?",
        "Can you point me to an article, video, analysis, document, or anything that discusses what ucc is being proposed by the progressives?",
        "Do you think bjp started talking about ucc?",
        "Can you point me to an article, video, analysis, document, or anything that discusses what ucc is being proposed by the progressives?",
        "Google. \n\nIt started in 1985 BM (Before Modi)",
        "The only real differences from the BJP's proposed versions would be that progressives would be absolutely against registration of live-in relationships or any interference in live-in relationships in general. Apart from that there might possibility be some difference with how inheritance is defined, since I believe some current inheritance laws treat daughters and sons differently which progressives would be against.\n\nThe main issue boils down to the fact that every marriage should be registered by the government and not be a religious affair; and similarly divorce can only be a legal matter and not a religious one",
        "Ask yourself, would a progressive want gay marriages, inter religious marriages and inter caste marriages done easily or would a conservative? A true UCC would allow all of this. \n\nThe discussion for a UCC has been happening since the 80s. \n\nSadly, a lot of nuance was lost when the Indian progressives focused on the wrong part during the Shah Bano case. Indian history would have been different if that had not happened, and I of course do not support Congress Act of 1986.",
        "It's a need, perhaps, but dire need? What percent of marriages are hindu-muslim? It's almost like there is a vested interest in diverting attention away from education, pollution, inflation, unemployment, corruption, healthcare, infrastructure, lawlessness, global warming, etc - issues far more relevant to the common people than hindu-muslim marriages, polygamy, or triple talaq.",
        "I don't understand why people are even arguing about ucc in this case.. Seems like a bad interpretation of the law..? As per this judge a muslim and a hindu can never marry under special marriage act.. but it happens every day. This case is in the court only because these people asked for police protection to go to the register office.. ",
        "I think such judgements should be used for removal or demotion of judges.",
        "Arguing UCC here is not completely unwarranted. UCC (in theory) would not allow judges to come up with their own (bad) interpretation.\n\n\nIt's pretty obvious this Judge is right wing Hindu who is using Sharia to nullify marriage between Hindu girl and Muslim man.",
        "Judge need to be dismissed.  He can't pass his own laws",
        "no court/government is telling me who I can and cannot marry - I am a human being and not a doll",
        "If you have UCC, no more need for religion based on inheritance and marriage laws.\n\nThe demand is very much valid.",
        "Talk about a brainless judge. The whole point of the SMA is that personal law doesn't apply. Personal religious law governs people who *want* to be governed by it. The special marriage act was specifically created to allow those who did not wish for marriages to be governed by religious principles. This judge is a blithering moron and if we had a competent legislature he'd be impeached. And if we had a halfway competent court system the HC's Chief Justice would remove him from all personal law cases after a division bench or a SC bench sent him back to law school for some remedial classes.",
        "> \"*Marriage under Special Marriage Act would not legalise the marriage which otherwise is prohibited under personal law. Section 4 of Special Marriage Act provides that if the parties are not within prohibited relationship then only marriage can be performed,\"* the Court went on to hold.\n\nWhat ? Why does conditions under personal laws matter if the marriage is being performed under the SMA which is a separate law ?",
        "We need UCC so much. A unbiased and progressive one devoid of any influence of political ideology.",
        "Nah..  He seems to be a Sikh. His name is something something ahluwalia. Search it",
        "He probably has access to some amazing stuff🍃Though he'll probably issue contempt of court if we ask him to share",
        "When did Religious laws rise above Government laws ?",
        "Then what the hell is the purpose of Special Marriage Act? What kind of twisted interpretation of law is this? This needs to be appealed. Wtf?",
        "It doesn't work like that. Judges also come from the same community of people. It's the educational system & the method of appointing judges is what needs to change. Merit & performance only should be the criteria for appointing/promoting or transferring judges.",
        "I get the sentiment but marriage is a legal agreement, so the government is very much going to tell you who you can and cannot marry. If you're buying into the institution of marriage, you're already agreeing to abide by certain rules laid out by the government (depends on where you live and how archaic the government is). I'd say no court/government can tell you who you can and cannot love.",
        "tbh I'd marry whomever I want to regardless of the laws - it might not get registered but at least it would be a social marriage \n\nMine is a statement about refusing the \"right\" for a govt/court to tell me whom I am \"allowed\" to marry",
        "Yeah some LGBTQ people have been doing that in India, but without registration they don't get the same rights as legally married people do.\n\nTbh I'd much prefer a world where marriage is only defined as you're defining it (something people do for personal/social reasons) and is different from civil partnerships where all partners agree to a legal union with rights & responsibilities.\n\nThat way, people get the satisfaction of saying that they're married, but it doesn't put a damper on the fight to have equal legal rights. Conflating marriage and all its historical baggage with legal matters means that sometimes, people willingly give up their rights in favour of the sense of fulfillment that comes from saying \"I'm married\".",
        "Guy thought he could ban all Muslim boy Hindu girl marriages with One Weird Trick. What a bigot",
        "Why the hell do we have government and constitution for \nLikha toh “sati”  bhi tha Hindu grantho me but it was abolished cause it was a dumb thing and we need to move on into a progressive society \nBut jab baat Muslim and Muslim law ki aaye toh chutiyo ko Muslim law and shariya law pe he rehna hai \nAage nhi badna hai \nDouble standards of Indian Muslims and Indian Secularism"
    ],
    "cleaned_text": "special marriage act union hindu muslim valid muslim law madhya pradesh high court incompetent judiciary strikes doesnt scream ucc nothing ever ",
    "cleaned_title": "special marriage act union hindu muslim valid muslim law madhya pradesh high court",
    "cleaned_selftext": "incompetent judiciary strikes doesnt scream ucc nothing ever",
    "cleaned_comments": "ucc dire need generation anybody doesnt like evaluate priorities matter uncomfortable think people uncomfortable ucc proposed bjp ucc bjp ucc different progressives support ucc people dont support bjp ucc way regressive agreed miyabiwi raazi kya karega qazi point article video analysis document anything discusses ucc proposed progressives think bjp started talking ucc point article video analysis document anything discusses ucc proposed progressives google started bm modi real differences bjps proposed versions would progressives would absolutely registration livein relationships interference livein relationships general apart might possibility difference inheritance defined since believe current inheritance laws treat daughters sons differently progressives would main issue boils fact every marriage registered government religious affair similarly divorce legal matter religious one ask would progressive want gay marriages inter religious marriages inter caste marriages done easily would conservative true ucc would allow discussion ucc happening since sadly lot nuance lost indian progressives focused wrong part shah bano case indian history would different happened course support congress act need perhaps dire need percent marriages hindumuslim almost like vested interest diverting attention away education pollution inflation unemployment corruption healthcare infrastructure lawlessness global warming etc issues far relevant common people hindumuslim marriages polygamy triple talaq dont understand people even arguing ucc case seems like bad interpretation law per judge muslim hindu never marry special marriage act happens every day case court people asked police protection go register office think judgements used removal demotion judges arguing ucc completely unwarranted ucc theory would allow judges come bad interpretation pretty obvious judge right wing hindu using sharia nullify marriage hindu girl muslim man judge need dismissed cant pass laws courtgovernment telling marry human doll ucc need religion based inheritance marriage laws demand much valid talk brainless judge whole point sma personal law doesnt apply personal religious law governs people want governed special marriage act specifically created allow wish marriages governed religious principles judge blithering moron competent legislature hed impeached halfway competent court system hcs chief justice would remove personal law cases division bench sc bench sent back law school remedial classes marriage special marriage act would legalise marriage otherwise prohibited personal law section special marriage act provides parties within prohibited relationship marriage performed court went hold conditions personal laws matter marriage performed sma separate law need ucc much unbiased progressive one devoid influence political ideology nah seems sikh name something something ahluwalia search probably access amazing stuffthough hell probably issue contempt court ask share religious laws rise government laws hell purpose special marriage act kind twisted interpretation law needs appealed wtf doesnt work like judges also come community people educational system method appointing judges needs change merit performance criteria appointingpromoting transferring judges get sentiment marriage legal agreement government much going tell marry youre buying institution marriage youre already agreeing abide certain rules laid government depends live archaic government id say courtgovernment tell love tbh id marry whomever want regardless laws might get registered least would social marriage mine statement refusing right govtcourt tell allowed marry yeah lgbtq people india without registration dont get rights legally married people tbh id much prefer world marriage defined youre defining something people personalsocial reasons different civil partnerships partners agree legal union rights responsibilities way people get satisfaction saying theyre married doesnt put damper fight equal legal rights conflating marriage historical baggage legal matters means sometimes people willingly give rights favour sense fulfillment comes saying im married guy thought could ban muslim boy hindu girl marriages one weird trick bigot hell government constitution likha toh sati bhi tha hindu grantho abolished cause dumb thing need move progressive society jab baat muslim muslim law ki aaye toh chutiyo ko muslim law shariya law pe rehna hai aage nhi badna hai double standards indian muslims indian secularism",
    "light_cleaned_title": "Special Marriage Act union between Hindu and Muslim not valid under Muslim Law: Madhya Pradesh High Court",
    "light_cleaned_selftext": "Incompetent Judiciary Strikes again. If this doesn't scream out for UCC then nothing ever will.",
    "light_cleaned_comments": "UCC is dire need for this generation. Anybody who doesn't like it will have to evaluate their priorities, no matter how uncomfortable it is. Why do you think people are uncomfortable with ucc proposed by bjp UCC and BJP ucc is different. Most progressives support UCC, what people don’t support is BJP UCC which is way more regressive Agreed, but if Miya-Biwi raazi, to kya karega Qazi? Can you point me to an article, video, analysis, document, or anything that discusses what ucc is being proposed by the progressives? Do you think bjp started talking about ucc? Can you point me to an article, video, analysis, document, or anything that discusses what ucc is being proposed by the progressives? Google. It started in 1985 BM (Before Modi) The only real differences from the BJP's proposed versions would be that progressives would be absolutely against registration of live-in relationships or any interference in live-in relationships in general. Apart from that there might possibility be some difference with how inheritance is defined, since I believe some current inheritance laws treat daughters and sons differently which progressives would be against. The main issue boils down to the fact that every marriage should be registered by the government and not be a religious affair; and similarly divorce can only be a legal matter and not a religious one Ask yourself, would a progressive want gay marriages, inter religious marriages and inter caste marriages done easily or would a conservative? A true UCC would allow all of this. The discussion for a UCC has been happening since the 80s. Sadly, a lot of nuance was lost when the Indian progressives focused on the wrong part during the Shah Bano case. Indian history would have been different if that had not happened, and I of course do not support Congress Act of 1986. It's a need, perhaps, but dire need? What percent of marriages are hindu-muslim? It's almost like there is a vested interest in diverting attention away from education, pollution, inflation, unemployment, corruption, healthcare, infrastructure, lawlessness, global warming, etc - issues far more relevant to the common people than hindu-muslim marriages, polygamy, or triple talaq. I don't understand why people are even arguing about ucc in this case.. Seems like a bad interpretation of the law..? As per this judge a muslim and a hindu can never marry under special marriage act.. but it happens every day. This case is in the court only because these people asked for police protection to go to the register office.. I think such judgements should be used for removal or demotion of judges. Arguing UCC here is not completely unwarranted. UCC (in theory) would not allow judges to come up with their own (bad) interpretation. It's pretty obvious this Judge is right wing Hindu who is using Sharia to nullify marriage between Hindu girl and Muslim man. Judge need to be dismissed. He can't pass his own laws no court/government is telling me who I can and cannot marry - I am a human being and not a doll If you have UCC, no more need for religion based on inheritance and marriage laws. The demand is very much valid. Talk about a brainless judge. The whole point of the SMA is that personal law doesn't apply. Personal religious law governs people who *want* to be governed by it. The special marriage act was specifically created to allow those who did not wish for marriages to be governed by religious principles. This judge is a blithering moron and if we had a competent legislature he'd be impeached. And if we had a halfway competent court system the HC's Chief Justice would remove him from all personal law cases after a division bench or a SC bench sent him back to law school for some remedial classes. > \"*Marriage under Special Marriage Act would not legalise the marriage which otherwise is prohibited under personal law. Section 4 of Special Marriage Act provides that if the parties are not within prohibited relationship then only marriage can be performed,\"* the Court went on to hold. What ? Why does conditions under personal laws matter if the marriage is being performed under the SMA which is a separate law ? We need UCC so much. A unbiased and progressive one devoid of any influence of political ideology. Nah.. He seems to be a Sikh. His name is something something ahluwalia. Search it He probably has access to some amazing stuff🍃Though he'll probably issue contempt of court if we ask him to share When did Religious laws rise above Government laws ? Then what the hell is the purpose of Special Marriage Act? What kind of twisted interpretation of law is this? This needs to be appealed. Wtf? It doesn't work like that. Judges also come from the same community of people. It's the educational system & the method of appointing judges is what needs to change. Merit & performance only should be the criteria for appointing/promoting or transferring judges. I get the sentiment but marriage is a legal agreement, so the government is very much going to tell you who you can and cannot marry. If you're buying into the institution of marriage, you're already agreeing to abide by certain rules laid out by the government (depends on where you live and how archaic the government is). I'd say no court/government can tell you who you can and cannot love. tbh I'd marry whomever I want to regardless of the laws - it might not get registered but at least it would be a social marriage Mine is a statement about refusing the \"right\" for a govt/court to tell me whom I am \"allowed\" to marry Yeah some LGBTQ people have been doing that in India, but without registration they don't get the same rights as legally married people do. Tbh I'd much prefer a world where marriage is only defined as you're defining it (something people do for personal/social reasons) and is different from civil partnerships where all partners agree to a legal union with rights & responsibilities. That way, people get the satisfaction of saying that they're married, but it doesn't put a damper on the fight to have equal legal rights. Conflating marriage and all its historical baggage with legal matters means that sometimes, people willingly give up their rights in favour of the sense of fulfillment that comes from saying \"I'm married\". Guy thought he could ban all Muslim boy Hindu girl marriages with One Weird Trick. What a bigot Why the hell do we have government and constitution for Likha toh “sati” bhi tha Hindu grantho me but it was abolished cause it was a dumb thing and we need to move on into a progressive society But jab baat Muslim and Muslim law ki aaye toh chutiyo ko Muslim law and shariya law pe he rehna hai Aage nhi badna hai Double standards of Indian Muslims and Indian Secularism"
}