{
    "id": "17wlkjt",
    "title": "#LetUsChill | (Regulatory) dark clouds loom over “OTT” platforms | Broadcasting Services (Regulation) Bill, 2023",
    "url": "https://www.reddit.com/r/india/comments/17wlkjt/letuschill_regulatory_dark_clouds_loom_over_ott/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/bwusqhkncp0c1.png?width=1600&format=png&auto=webp&s=0d3fea33e8c3b09b70e52c34b98a58479daee06b\n\n#  tl;dr\n\nThe Ministry of Information and Broadcasting (“MIB”) released the Broadcasting Services (Regulation) Bill, 2023 (“Broadcasting Bill”) for public consultation on November 10. The draft bill includes “Over-the-Top” (“OTT”) content & digital news published by individuals under the regulatory ambit raising concerns for online free speech and journalistic freedom. Read our initial analysis of the Broadcasting Bill, after a first read.\n\n### About the draft bill\n\nComments on the [**Broadcasting Bill**](https://drive.google.com/file/d/1ROw6fLMir_tXhsHY1cfHcDFvkhSblCmJ/view?usp=sharing&ref=static.internetfreedom.in) have been invited till December 9. MIB claims to have introduced the Broadcasting Bill to cater to the evolving needs of the broadcasting sector and in light of the technological advancements in the sector. The Broadcasting Bill, if converted into an Act of Parliament, will replace The Cable Television Networks (Regulation) Act, 1995 (“Cable Act”) as well as other policy guidelines currently governing the sector. An explanatory note has been released alongside the draft bill to facilitate better comprehension. The Bill comprises six chapters, 48 sections, and three schedules. Part C of the Broadcasting Bill applies to internet broadcasting networks. As per the Broadcasting Bill, a broadcasting services or network will only be allowed to provide service/ operate if the Union government has registered or provided an intimation to the broadcaster or broadcasting network operator \\[Clause 4(1), (4)\\]. With respect to the “OTT” broadcasting service, they will be required to provide an intimation to the Union government of its operations, if their number of subscribers or viewers fall within the prescribed threshold. The threshold as well as the form and manner of intimation will be prescribed by the Union government at a later stage \\[Clause 16(2)\\]. \n\n### (Regulatory) dark clouds looms over “OTT” platforms\n\nThe Broadcasting Bill expands the regulatory coverage of the Cable Act to include “OTT” content & digital news media under the ambit of the regulation. To capture emerging technologies, the draft bill extends application to “internet broadcasting networks”, which as per its definition in the draft bill includes Internet Protocol Television (“IPTV”) and “OTT” broadcasting services. The Broadcasting Bill defines “broadcasting” as  “one-to-many transmission of audio, visual or audio-visual programmes using a broadcasting network, intended to be received or made available for viewing, by the general public or by subscribers of the broadcasting network.” As an extension of this definition, ‘OTT broadcasting service operators’ such as Netflix, Disney Hotstar, Jio Cinema, etc. are classified as “Broadcasting network operator”. It clarifies that an “OTT” broadcasting service would not include a social media intermediary, or a user of such intermediary, as defined in rules under the Information Technology (IT) Act, 2000.\n\n“OTT” broadcasting services make on-demand or curated programmes available over the internet or a computer resource, which is consumed by a subscriber who makes an account with the provider. While “OTT” broadcasting services provide access to a range of content on its platform to several of its subscribers, viewers retain the autonomy to not consume a programme if they wish to do so. This, in principle, is a direct contradiction to the nature of cable TV or radio services, wherein consumers cannot choose to stop the airing of a programme (even if they may be able to switch channels). Applying stringent rules and codes to “OTT” broadcasting services may increase financial and compliance burden for such broadcasters, negatively impact user experience, choice, and even costs borne by the users. Thus, we question the very need to bring “OTT” broadcasting services under regulation and at par with terrestrial, cable, and radio broadcasting services.\n\nHere, we must recall MIB’s historical baggage with respect to its conventional regulation of traditional forms of media. It has administered both licensing and content censorship powers over radio, cinema, and television broadcasting, specifically through laws such as the Cinematograph Act and the Cable Act. The 2020 [**notification**](https://twitter.com/internetfreedom/status/1326405658862874624?ref=static.internetfreedom.in) under the Business of Allocation Rules brought digital and online media under the jurisdiction of MIB. An [**amendment**](https://www.ahlawatassociates.com/news/government-expands-scope-of-governance-of-ministry-of-information-and-broadcasting/?ref=static.internetfreedom.in) to the Rules in August 2023 brought ‘Films and Audio-Visual programmes/content made available by online content providers/publishers’ as well as ‘online advertisements’ were brought under the regulatory ambit of MIB. Thus, the Broadcasting Bill, which seeks to envelope “OTT” broadcasting under the regulatory umbrella for radio and tv, must be examined while keeping in mind MIB’s institutional history of regulation and censorship.\n\nHere, MIB must take inspiration from the principles laid down in the [**report**](https://mib.gov.in/sites/default/files/Shyam_Benegal_committee_Report_compressed.pdf?ref=static.internetfreedom.in) of MIB’s Expert Committee on Film Certification chaired by Shyam Benegal (“Expert Committee”). The Expert Committee stated that film viewing is a consensual act, and so regulation should limit itself to a statutory warning, noting that the artistic expression and creative freedom of filmmakers should be protected and any certification should be responsive to social change. Such arguments apply even more to the realm of online content, where the viewer directly chooses the content they wish to consume. \n\nNotwithstanding our criticisms of the draft bill, we appreciate the Ministry’s intention to include Accessibility Guidelines in the Broadcasting Bill in order to make broadcasting services more accessible to persons with disabilities. Some commendable measures proposed include availability of sign language, audio descriptions and subtitles for videos, designation of a disability grievance redressal officer, etc.\n\n### Current affairs, codes, and censorship\n\nAny programme and advertisement transmitted or re-transmitted as broadcasting services must be in conformity with the Programme Code and Advertisement Code (“Codes”) respectively \\[Clause 19(1), (2)\\]. Adherence to the Codes, which are yet to be prescribed, extends to any person who broadcasts news and current affairs programs through a digital medium (such as online paper, news portal, website, social media intermediary, or other similar medium). This excludes publishers of professional or commercial newspapers and online replicas of such newspapers. \n\nThis one sentence provision under Clause 20 titled 'News and Current Affairs Programmes' may have wide ranging consequences on independent journalists who rely on the digital platforms such as social media to publish news that may typically be viewed as unpalatable to the government. This over broad provision will apply to not only journalists, but even individuals who choose to share news through online blogs or platforms. This Clause raises alarm as an individual sharing news on social media platforms may become liable if the broadcaster/ broadcasting network, self regulatory organisation, or a government appointed council believe that they have not complied with the Codes. This may affect online free speech as well as the freedom of journalistic expression of a news broadcaster or an independent news disseminator, whether it is in an organisational or individual capacity. Further, such regulation may also threaten a users’ right to access multiple, diverse points of view because the individual broadcasting news will likely only produce content which is palatable to the Union government so as to avoid non-compliance penalty. \n\n### Choosing the path of self-regulation\n\nThe Broadcasting Bill suggests a three-pronged regulatory structure: \n\n1. Self-regulation by broadcasters and broadcasting network operators \n2. Self-regulatory organisations (“SROs”)\n3. The Broadcast Advisory Council (“BAC”)\n\nSuch a three-tiered regulatory system was introduced under the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (“IT Rules, 2021”). This structure was created without any statutory basis or any public consultation. The allotment of such wide powers to the Union government in the absence of any constitutional or parliamentary backing posed a grave threat to the freedom of speech and expression of content creators and publishers, as well as to the right of free access to information of the consumers of such content. The constitutionality of this part of the IT Rules, 2021 has been [**challenged**](https://internetfreedom.in/supreme-court-stays-proceedings-before-high-courts-challenging-it-rules-2021-interim-orders-to-continue/?ref=static.internetfreedom.in) in several Courts. Given the challenge to Part 3 of the IT Rules, which is administered by the MIB, we must question the attempt to bring a similar model of regulation and grievance redressal for “OTT” content and digital news media as well as the imposition of other obligations on broadcasters such as the need to ‘intimate’ the Union government. A similar obligation was imposed on publishers of news media by the Ministry, to [**furnish**](https://internetfreedom.in/rule-18-it-rules-rti-appeal/?ref=static.internetfreedom.in) information under Rule 18 of the IT Rules, 2021, despite a stay on the Rules that lay out the 3-tier regulatory mechanism.\n\nUnder the Broadcasting Bill, a broadcaster or operator would be required to appoint a grievance redressal officer for the purpose of receiving and hearing complaints in contravention of the Codes, become a member of an SRO, establish and maintain suitable mechanisms for the filing and redress of complaints, and publish information related to complaint redressal mechanisms prominently  \\[Clause 25(1)\\]. In addition to this, every broadcaster or operator would be required to constitute one or more “Content Evaluation Committee” (“CEC”), the size, quorum, and operational details of which would be determined by the Union government. As per the draft bill, broadcasters could only broadcast programmes that have been certified by the CEC. \n\nAs per the functions listed under the Broadcasting Bill, the SROs will address grievances which have not been addressed by the broadcaster or broadcasting network operators within the prescribed time period, hear appeals filed by complainants against the decision of the latter, and issue guidance or advisories to its members for ensuring compliance to the Codes \\[Clause 26(3)\\]. An SRO will also be required to make governing norms and articles for its members, which would include punishment for non-compliance with the norms or the Codes. The punishment includes temporary suspension, expulsion from membership, advisory, warning, censure, and/or monetary fine up to 5 lakhs \\[Clause 26(4)\\]. Through the standards and practices formulated and adopted by the BAC, the Union government will be able to exercise indirect control over curated content. \n\nThe Broadcasting Bill allows the Union government to constitute the BAC consisting of an independent member with 25 years of experience in the media industry as the Chairperson; 5 ex officio officers representing MIB, Ministry of Women and Child Development, Ministry of Home Affairs, Ministry of External Affairs, and Ministry of Social Justice and Empowerment; and 5 additional eminent independent persons \\[Clause 27(1)\\]. The terms and conditions related to the appointment of members to the BAC, the manner of their selection, tenure, and the manner of performance of their functions are yet to be prescribed. The BAC may refer any appeal or reference to review panels constituted by it. The current composition of the BAC raises concerns around the Council's autonomy.   \n\nThe BAC may hear appeals filed by complainants against the decision of the SROs as well as the complaints regarding violation or contravention of the Codes referred to it by the Union government \\[28(1)\\]. After examining complaints, the BAC has to make recommendations to the Union government, which will then issue appropriate orders and directions \\[Clause 28(2),(3)\\]. The ability of the Union government to refer a complaint to a government-appointed body as well as the power to issue final order is likely to pave the way for censorship as well as self-censorship. \n\nClause 31 allows the Union government’s power to inspect, intercept, monitor, and seize the equipment of broadcasting networks and services. Notably, the broadcasting network and services will have to be provided a notice in writing informing them of the grounds of confiscation, a reasonable opportunity of making a representation in writing, as well as an opportunity to appeal the decision of the authorised officer to the court. The application of such powers on “OTT” broadcasting services raises concerns around the executive’s indirect control over the platforms. Clause 35 further strengthens these concerns as it allows the Union government to order the broadcaster or the network to delete or modify programme or advertisement and even direct the channel to be off-air for a specified number of hours as a penalty for violating the Codes. The Union government cements its censorship powers under the draft bill through Clause 36(2) under which it may, if it deems it necessary or expedient to do so in public interest, prohibit the operation of any broadcasting services or broadcasting network operators in the areas notified.\n\nIn light of increasing [**scrutiny**](https://www.business-standard.com/industry/news/worried-about-obscenity-india-asks-ott-platforms-for-content-checks-123071400415_1.html?ref=static.internetfreedom.in) of streaming platforms, the Union government oversight over the BAC and CEC raise censorship concerns. Here, the MIB’s Expert Committee recommendation for a more liberalised regime even for film certification and its caution against the Central Board of Film Certification acting as a ‘moral compass’ must be remembered and applied. The Union government must take inspiration from the recommendation given by the Expert Committee and steer away from dictating modifications and deletions. \n\n### Excessive delegation of rule-making powers\n\nThe Broadcasting Bill has left a lot of the specific provisions to be determined in the future by the executive. Such excessive delegation of rule-making leads to uncertainty for the stakeholders who may be impacted by the draft bill and prevents individuals from being fully informed so as to meaningfully engage in the consultation process. Spanning over 70 pages, the Bill includes 60 instances of \"as may be prescribed\" and 17 instances of \"as notified by the \\[Union\\] Government”. While we recognise that in some instances specificity is needed to be or must be left to future rulemaking, these must be accompanied by relevant safeguards to protect against arbitrary rule-making. However, a number of the instances of delegated legislation in the Broadcasting Bill contribute to increased uncertainty, vagueness, and raise concerns. Some grievous examples of delegated executive rule-making (without safeguards/protection), wherein clarity and specificity are of utmost importance in our opinion, are stated below:\n\n>***The Central Government, may, for the fulfilment of such social objectives, as may be prescribed, allow registration or intimation as a broadcaster or broadcasting network operator..... \\[Clause 4(4)\\]***\n\n&#x200B;\n\n>***Every broadcaster and broadcasting Network Operator shall ensure that: (a) he transmits programmes in compliance with such terms and conditions and in such manner as may be prescribed. \\[Clause 5(1)(a)\\]***\n\n&#x200B;\n\n>***Any cable broadcasting network operator, satellite broadcasting network operator, IPTV network operator or such other broadcasting network operator, as may be prescribed, who intends to provide Platform Services on their registered broadcasting network may apply for permission to broadcast Platform Services to the registering authority in such form, manner and containing such particulars as may be prescribed. \\[Clause 7(1)\\]***\n\n&#x200B;\n\n>***Any programme transmitted or re-transmitted as broadcasting services shall be in conformity with the Programme Code, as may be prescribed. \\[Clause 19(1)\\]***\n\n&#x200B;\n\n>***Any advertisement transmitted or re-transmitted as broadcasting services shall be in conformity with the Advertisement Code, as may be prescribed. \\[Clause 19(2)\\]***\n\n&#x200B;\n\n>***Any person providing an OTT broadcasting service in India, with such number of Indian subscribers or viewers as may be prescribed, shall, within a period of one month from the notification of this Act or its meeting the prescribed threshold, provide an intimation to the \\[Union\\] Government of its operations, in such form and manner as may be prescribed. \\[Clause 16(2)\\]***\n\n&#x200B;\n\n>***The Broadcast Advisory Council, may, constitute review panels, with such number of members and such composition, as may be prescribed, to carry out its functions referred in section 28. \\[Clause 19(1)\\]***\n\n&#x200B;\n\n>***The terms and conditions related to the appointment of members to the Broadcast Advisory Council, the manner of their selection, tenure and the manner of performance of their functions shall be such as may be prescribed. \\[Clause 27(4)\\]***\n\n### Let Us Chill\n\nPrevious attempts to suggest self-regulation for on-demand video streaming platforms have been viewed with scepticism in light of increasing censorship, both self-imposed and through legal requests. The unfortunate consequence of such censorship is a negative impact on the fundamental right to freedom of speech and expression. Exerting executive control over “OTT” content will lead to over-compliance and self-censorship on part of platforms, who will be keen to avoid the wide discretion allowed to the government when it comes to punishments. Reports suggest that several completed TV shows and movies have already been [**cancelled**](https://www.livemint.com/industry/media/otts-tread-on-cautious-ground-axe-shows/amp-11615188592226.html?ref=static.internetfreedom.in) fearing government censure. Given the Codes’ similarity to the Code applicable to cable TV, and the increased censorship of TV programmes as a consequence, the Broadcasting Bill must be examined with caution.\n\n**Important documents**\n\n1. Draft Broadcasting Services (Regulation) Bill, 2023 ([**link**](https://drive.google.com/file/d/1ROw6fLMir_tXhsHY1cfHcDFvkhSblCmJ/view?usp=sharing&ref=static.internetfreedom.in))",
    "flair": "Policy/Economy",
    "score": 27,
    "num_comments": 1,
    "created_utc": 1700137310.0,
    "convurl": "https://b.thumbs.redditmedia.com/zuNZvxgscykFhszd84i2RHhunO0AKw0h-69Tfe2BLYI.jpg",
    "comments": [],
    "cleaned_text": "letuschill regulatory dark clouds loom ott platforms broadcasting services regulation bill xb tldr ministry information broadcasting mib released broadcasting services regulation bill broadcasting bill public consultation november draft bill includes overthetop ott content digital news published individuals regulatory ambit raising concerns online free speech journalistic freedom read initial analysis broadcasting bill first read draft bill comments broadcasting billhttpsdrivegooglecomfiledrowflmirtxhshycfhcdfvkhsblcmjviewuspsharingrefstaticinternetfreedomin invited till december mib claims introduced broadcasting bill cater evolving needs broadcasting sector light technological advancements sector broadcasting bill converted act parliament replace cable television networks regulation act cable act well policy guidelines currently governing sector explanatory note released alongside draft bill facilitate better comprehension bill comprises six chapters sections three schedules part c broadcasting bill applies internet broadcasting networks per broadcasting bill broadcasting services network allowed provide service operate union government registered provided intimation broadcaster broadcasting network operator clause respect ott broadcasting service required provide intimation union government operations number subscribers viewers fall within prescribed threshold threshold well form manner intimation prescribed union government later stage clause regulatory dark clouds looms ott platforms broadcasting bill expands regulatory coverage cable act include ott content digital news media ambit regulation capture emerging technologies draft bill extends application internet broadcasting networks per definition draft bill includes internet protocol television iptv ott broadcasting services broadcasting bill defines broadcasting onetomany transmission audio visual audiovisual programmes using broadcasting network intended received made available viewing general public subscribers broadcasting network extension definition ott broadcasting service operators netflix disney hotstar jio cinema etc classified broadcasting network operator clarifies ott broadcasting service would include social media intermediary user intermediary defined rules information technology act ott broadcasting services make ondemand curated programmes available internet computer resource consumed subscriber makes account provider ott broadcasting services provide access range content platform several subscribers viewers retain autonomy consume programme wish principle direct contradiction nature cable tv radio services wherein consumers choose stop airing programme even may able switch channels applying stringent rules codes ott broadcasting services may increase financial compliance burden broadcasters negatively impact user experience choice even costs borne users thus question need bring ott broadcasting services regulation par terrestrial cable radio broadcasting services must recall mibs historical baggage respect conventional regulation traditional forms media administered licensing content censorship powers radio cinema television broadcasting specifically laws cinematograph act cable act notificationhttpstwittercominternetfreedomstatusrefstaticinternetfreedomin business allocation rules brought digital online media jurisdiction mib amendmenthttpswwwahlawatassociatescomnewsgovernmentexpandsscopeofgovernanceofministryofinformationandbroadcastingrefstaticinternetfreedomin rules august brought films audiovisual programmescontent made available online content providerspublishers well online advertisements brought regulatory ambit mib thus broadcasting bill seeks envelope ott broadcasting regulatory umbrella radio tv must examined keeping mind mibs institutional history regulation censorship mib must take inspiration principles laid reporthttpsmibgovinsitesdefaultfilesshyambenegalcommitteereportcompressedpdfrefstaticinternetfreedomin mibs expert committee film certification chaired shyam benegal expert committee expert committee stated film viewing consensual act regulation limit statutory warning noting artistic expression creative freedom filmmakers protected certification responsive social change arguments apply even realm online content viewer directly chooses content wish consume notwithstanding criticisms draft bill appreciate ministrys intention include accessibility guidelines broadcasting bill order make broadcasting services accessible persons disabilities commendable measures proposed include availability sign language audio descriptions subtitles videos designation disability grievance redressal officer etc current affairs codes censorship programme advertisement transmitted retransmitted broadcasting services must conformity programme code advertisement code codes respectively clause adherence codes yet prescribed extends person broadcasts news current affairs programs digital medium online paper news portal website social media intermediary similar medium excludes publishers professional commercial newspapers online replicas newspapers one sentence provision clause titled news current affairs programmes may wide ranging consequences independent journalists rely digital platforms social media publish news may typically viewed unpalatable government broad provision apply journalists even individuals choose share news online blogs platforms clause raises alarm individual sharing news social media platforms may become liable broadcaster broadcasting network self regulatory organisation government appointed council believe complied codes may affect online free speech well freedom journalistic expression news broadcaster independent news disseminator whether organisational individual capacity regulation may also threaten users right access multiple diverse points view individual broadcasting news likely produce content palatable union government avoid noncompliance penalty choosing path selfregulation broadcasting bill suggests threepronged regulatory structure selfregulation broadcasters broadcasting network operators selfregulatory organisations sros broadcast advisory council bac threetiered regulatory system introduced information technology intermediary guidelines digital media ethics code rules rules structure created without statutory basis public consultation allotment wide powers union government absence constitutional parliamentary backing posed grave threat freedom speech expression content creators publishers well right free access information consumers content constitutionality part rules challengedhttpsinternetfreedominsupremecourtstaysproceedingsbeforehighcourtschallengingitrulesinterimorderstocontinuerefstaticinternetfreedomin several courts given challenge part rules administered mib must question attempt bring similar model regulation grievance redressal ott content digital news media well imposition obligations broadcasters need intimate union government similar obligation imposed publishers news media ministry furnishhttpsinternetfreedominruleitrulesrtiappealrefstaticinternetfreedomin information rule rules despite stay rules lay tier regulatory mechanism broadcasting bill broadcaster operator would required appoint grievance redressal officer purpose receiving hearing complaints contravention codes become member sro establish maintain suitable mechanisms filing redress complaints publish information related complaint redressal mechanisms prominently clause addition every broadcaster operator would required constitute one content evaluation committee cec size quorum operational details would determined union government per draft bill broadcasters could broadcast programmes certified cec per functions listed broadcasting bill sros address grievances addressed broadcaster broadcasting network operators within prescribed time period hear appeals filed complainants decision latter issue guidance advisories members ensuring compliance codes clause sro also required make governing norms articles members would include punishment noncompliance norms codes punishment includes temporary suspension expulsion membership advisory warning censure andor monetary fine lakhs clause standards practices formulated adopted bac union government able exercise indirect control curated content broadcasting bill allows union government constitute bac consisting independent member years experience media industry chairperson ex officio officers representing mib ministry women child development ministry home affairs ministry external affairs ministry social justice empowerment additional eminent independent persons clause terms conditions related appointment members bac manner selection tenure manner performance functions yet prescribed bac may refer appeal reference review panels constituted current composition bac raises concerns around councils autonomy bac may hear appeals filed complainants decision sros well complaints regarding violation contravention codes referred union government examining complaints bac make recommendations union government issue appropriate orders directions clause ability union government refer complaint governmentappointed body well power issue final order likely pave way censorship well selfcensorship clause allows union governments power inspect intercept monitor seize equipment broadcasting networks services notably broadcasting network services provided notice writing informing grounds confiscation reasonable opportunity making representation writing well opportunity appeal decision authorised officer court application powers ott broadcasting services raises concerns around executives indirect control platforms clause strengthens concerns allows union government order broadcaster network delete modify programme advertisement even direct channel offair specified number hours penalty violating codes union government cements censorship powers draft bill clause may deems necessary expedient public interest prohibit operation broadcasting services broadcasting network operators areas notified light increasing scrutinyhttpswwwbusinessstandardcomindustrynewsworriedaboutobscenityindiaasksottplatformsforcontentcheckshtmlrefstaticinternetfreedomin streaming platforms union government oversight bac cec raise censorship concerns mibs expert committee recommendation liberalised regime even film certification caution central board film certification acting moral compass must remembered applied union government must take inspiration recommendation given expert committee steer away dictating modifications deletions excessive delegation rulemaking powers broadcasting bill left lot specific provisions determined future executive excessive delegation rulemaking leads uncertainty stakeholders may impacted draft bill prevents individuals fully informed meaningfully engage consultation process spanning pages bill includes instances may prescribed instances notified union government recognise instances specificity needed must left future rulemaking must accompanied relevant safeguards protect arbitrary rulemaking however number instances delegated legislation broadcasting bill contribute increased uncertainty vagueness raise concerns grievous examples delegated executive rulemaking without safeguardsprotection wherein clarity specificity utmost importance opinion stated central government may fulfilment social objectives may prescribed allow registration intimation broadcaster broadcasting network operator clause xb every broadcaster broadcasting network operator shall ensure transmits programmes compliance terms conditions manner may prescribed clause xb cable broadcasting network operator satellite broadcasting network operator iptv network operator broadcasting network operator may prescribed intends provide platform services registered broadcasting network may apply permission broadcast platform services registering authority form manner containing particulars may prescribed clause xb programme transmitted retransmitted broadcasting services shall conformity programme code may prescribed clause xb advertisement transmitted retransmitted broadcasting services shall conformity advertisement code may prescribed clause xb person providing ott broadcasting service india number indian subscribers viewers may prescribed shall within period one month notification act meeting prescribed threshold provide intimation union government operations form manner may prescribed clause xb broadcast advisory council may constitute review panels number members composition may prescribed carry functions referred section clause xb terms conditions related appointment members broadcast advisory council manner selection tenure manner performance functions shall may prescribed clause let us chill previous attempts suggest selfregulation ondemand video streaming platforms viewed scepticism light increasing censorship selfimposed legal requests unfortunate consequence censorship negative impact fundamental right freedom speech expression exerting executive control ott content lead overcompliance selfcensorship part platforms keen avoid wide discretion allowed government comes punishments reports suggest several completed tv shows movies already cancelledhttpswwwlivemintcomindustrymediaottstreadoncautiousgroundaxeshowsamphtmlrefstaticinternetfreedomin fearing government censure given codes similarity code applicable cable tv increased censorship tv programmes consequence broadcasting bill must examined caution important documents draft broadcasting services regulation bill linkhttpsdrivegooglecomfiledrowflmirtxhshycfhcdfvkhsblcmjviewuspsharingrefstaticinternetfreedomin ",
    "cleaned_title": "letuschill regulatory dark clouds loom ott platforms broadcasting services regulation bill",
    "cleaned_selftext": "xb tldr ministry information broadcasting mib released broadcasting services regulation bill broadcasting bill public consultation november draft bill includes overthetop ott content digital news published individuals regulatory ambit raising concerns online free speech journalistic freedom read initial analysis broadcasting bill first read draft bill comments broadcasting billhttpsdrivegooglecomfiledrowflmirtxhshycfhcdfvkhsblcmjviewuspsharingrefstaticinternetfreedomin invited till december mib claims introduced broadcasting bill cater evolving needs broadcasting sector light technological advancements sector broadcasting bill converted act parliament replace cable television networks regulation act cable act well policy guidelines currently governing sector explanatory note released alongside draft bill facilitate better comprehension bill comprises six chapters sections three schedules part c broadcasting bill applies internet broadcasting networks per broadcasting bill broadcasting services network allowed provide service operate union government registered provided intimation broadcaster broadcasting network operator clause respect ott broadcasting service required provide intimation union government operations number subscribers viewers fall within prescribed threshold threshold well form manner intimation prescribed union government later stage clause regulatory dark clouds looms ott platforms broadcasting bill expands regulatory coverage cable act include ott content digital news media ambit regulation capture emerging technologies draft bill extends application internet broadcasting networks per definition draft bill includes internet protocol television iptv ott broadcasting services broadcasting bill defines broadcasting onetomany transmission audio visual audiovisual programmes using broadcasting network intended received made available viewing general public subscribers broadcasting network extension definition ott broadcasting service operators netflix disney hotstar jio cinema etc classified broadcasting network operator clarifies ott broadcasting service would include social media intermediary user intermediary defined rules information technology act ott broadcasting services make ondemand curated programmes available internet computer resource consumed subscriber makes account provider ott broadcasting services provide access range content platform several subscribers viewers retain autonomy consume programme wish principle direct contradiction nature cable tv radio services wherein consumers choose stop airing programme even may able switch channels applying stringent rules codes ott broadcasting services may increase financial compliance burden broadcasters negatively impact user experience choice even costs borne users thus question need bring ott broadcasting services regulation par terrestrial cable radio broadcasting services must recall mibs historical baggage respect conventional regulation traditional forms media administered licensing content censorship powers radio cinema television broadcasting specifically laws cinematograph act cable act notificationhttpstwittercominternetfreedomstatusrefstaticinternetfreedomin business allocation rules brought digital online media jurisdiction mib amendmenthttpswwwahlawatassociatescomnewsgovernmentexpandsscopeofgovernanceofministryofinformationandbroadcastingrefstaticinternetfreedomin rules august brought films audiovisual programmescontent made available online content providerspublishers well online advertisements brought regulatory ambit mib thus broadcasting bill seeks envelope ott broadcasting regulatory umbrella radio tv must examined keeping mind mibs institutional history regulation censorship mib must take inspiration principles laid reporthttpsmibgovinsitesdefaultfilesshyambenegalcommitteereportcompressedpdfrefstaticinternetfreedomin mibs expert committee film certification chaired shyam benegal expert committee expert committee stated film viewing consensual act regulation limit statutory warning noting artistic expression creative freedom filmmakers protected certification responsive social change arguments apply even realm online content viewer directly chooses content wish consume notwithstanding criticisms draft bill appreciate ministrys intention include accessibility guidelines broadcasting bill order make broadcasting services accessible persons disabilities commendable measures proposed include availability sign language audio descriptions subtitles videos designation disability grievance redressal officer etc current affairs codes censorship programme advertisement transmitted retransmitted broadcasting services must conformity programme code advertisement code codes respectively clause adherence codes yet prescribed extends person broadcasts news current affairs programs digital medium online paper news portal website social media intermediary similar medium excludes publishers professional commercial newspapers online replicas newspapers one sentence provision clause titled news current affairs programmes may wide ranging consequences independent journalists rely digital platforms social media publish news may typically viewed unpalatable government broad provision apply journalists even individuals choose share news online blogs platforms clause raises alarm individual sharing news social media platforms may become liable broadcaster broadcasting network self regulatory organisation government appointed council believe complied codes may affect online free speech well freedom journalistic expression news broadcaster independent news disseminator whether organisational individual capacity regulation may also threaten users right access multiple diverse points view individual broadcasting news likely produce content palatable union government avoid noncompliance penalty choosing path selfregulation broadcasting bill suggests threepronged regulatory structure selfregulation broadcasters broadcasting network operators selfregulatory organisations sros broadcast advisory council bac threetiered regulatory system introduced information technology intermediary guidelines digital media ethics code rules rules structure created without statutory basis public consultation allotment wide powers union government absence constitutional parliamentary backing posed grave threat freedom speech expression content creators publishers well right free access information consumers content constitutionality part rules challengedhttpsinternetfreedominsupremecourtstaysproceedingsbeforehighcourtschallengingitrulesinterimorderstocontinuerefstaticinternetfreedomin several courts given challenge part rules administered mib must question attempt bring similar model regulation grievance redressal ott content digital news media well imposition obligations broadcasters need intimate union government similar obligation imposed publishers news media ministry furnishhttpsinternetfreedominruleitrulesrtiappealrefstaticinternetfreedomin information rule rules despite stay rules lay tier regulatory mechanism broadcasting bill broadcaster operator would required appoint grievance redressal officer purpose receiving hearing complaints contravention codes become member sro establish maintain suitable mechanisms filing redress complaints publish information related complaint redressal mechanisms prominently clause addition every broadcaster operator would required constitute one content evaluation committee cec size quorum operational details would determined union government per draft bill broadcasters could broadcast programmes certified cec per functions listed broadcasting bill sros address grievances addressed broadcaster broadcasting network operators within prescribed time period hear appeals filed complainants decision latter issue guidance advisories members ensuring compliance codes clause sro also required make governing norms articles members would include punishment noncompliance norms codes punishment includes temporary suspension expulsion membership advisory warning censure andor monetary fine lakhs clause standards practices formulated adopted bac union government able exercise indirect control curated content broadcasting bill allows union government constitute bac consisting independent member years experience media industry chairperson ex officio officers representing mib ministry women child development ministry home affairs ministry external affairs ministry social justice empowerment additional eminent independent persons clause terms conditions related appointment members bac manner selection tenure manner performance functions yet prescribed bac may refer appeal reference review panels constituted current composition bac raises concerns around councils autonomy bac may hear appeals filed complainants decision sros well complaints regarding violation contravention codes referred union government examining complaints bac make recommendations union government issue appropriate orders directions clause ability union government refer complaint governmentappointed body well power issue final order likely pave way censorship well selfcensorship clause allows union governments power inspect intercept monitor seize equipment broadcasting networks services notably broadcasting network services provided notice writing informing grounds confiscation reasonable opportunity making representation writing well opportunity appeal decision authorised officer court application powers ott broadcasting services raises concerns around executives indirect control platforms clause strengthens concerns allows union government order broadcaster network delete modify programme advertisement even direct channel offair specified number hours penalty violating codes union government cements censorship powers draft bill clause may deems necessary expedient public interest prohibit operation broadcasting services broadcasting network operators areas notified light increasing scrutinyhttpswwwbusinessstandardcomindustrynewsworriedaboutobscenityindiaasksottplatformsforcontentcheckshtmlrefstaticinternetfreedomin streaming platforms union government oversight bac cec raise censorship concerns mibs expert committee recommendation liberalised regime even film certification caution central board film certification acting moral compass must remembered applied union government must take inspiration recommendation given expert committee steer away dictating modifications deletions excessive delegation rulemaking powers broadcasting bill left lot specific provisions determined future executive excessive delegation rulemaking leads uncertainty stakeholders may impacted draft bill prevents individuals fully informed meaningfully engage consultation process spanning pages bill includes instances may prescribed instances notified union government recognise instances specificity needed must left future rulemaking must accompanied relevant safeguards protect arbitrary rulemaking however number instances delegated legislation broadcasting bill contribute increased uncertainty vagueness raise concerns grievous examples delegated executive rulemaking without safeguardsprotection wherein clarity specificity utmost importance opinion stated central government may fulfilment social objectives may prescribed allow registration intimation broadcaster broadcasting network operator clause xb every broadcaster broadcasting network operator shall ensure transmits programmes compliance terms conditions manner may prescribed clause xb cable broadcasting network operator satellite broadcasting network operator iptv network operator broadcasting network operator may prescribed intends provide platform services registered broadcasting network may apply permission broadcast platform services registering authority form manner containing particulars may prescribed clause xb programme transmitted retransmitted broadcasting services shall conformity programme code may prescribed clause xb advertisement transmitted retransmitted broadcasting services shall conformity advertisement code may prescribed clause xb person providing ott broadcasting service india number indian subscribers viewers may prescribed shall within period one month notification act meeting prescribed threshold provide intimation union government operations form manner may prescribed clause xb broadcast advisory council may constitute review panels number members composition may prescribed carry functions referred section clause xb terms conditions related appointment members broadcast advisory council manner selection tenure manner performance functions shall may prescribed clause let us chill previous attempts suggest selfregulation ondemand video streaming platforms viewed scepticism light increasing censorship selfimposed legal requests unfortunate consequence censorship negative impact fundamental right freedom speech expression exerting executive control ott content lead overcompliance selfcensorship part platforms keen avoid wide discretion allowed government comes punishments reports suggest several completed tv shows movies already cancelledhttpswwwlivemintcomindustrymediaottstreadoncautiousgroundaxeshowsamphtmlrefstaticinternetfreedomin fearing government censure given codes similarity code applicable cable tv increased censorship tv programmes consequence broadcasting bill must examined caution important documents draft broadcasting services regulation bill linkhttpsdrivegooglecomfiledrowflmirtxhshycfhcdfvkhsblcmjviewuspsharingrefstaticinternetfreedomin",
    "cleaned_comments": "",
    "light_cleaned_title": "#LetUsChill | (Regulatory) dark clouds loom over “OTT” platforms | Broadcasting Services (Regulation) Bill, 2023",
    "light_cleaned_selftext": "&#x200B; # tl;dr The Ministry of Information and Broadcasting (“MIB”) released the Broadcasting Services (Regulation) Bill, 2023 (“Broadcasting Bill”) for public consultation on November 10. The draft bill includes “Over-the-Top” (“OTT”) content & digital news published by individuals under the regulatory ambit raising concerns for online free speech and journalistic freedom. Read our initial analysis of the Broadcasting Bill, after a first read. ### About the draft bill Comments on the [**Broadcasting Bill**](https://drive.google.com/file/d/1ROw6fLMir_tXhsHY1cfHcDFvkhSblCmJ/view?usp=sharing&ref=static.internetfreedom.in) have been invited till December 9. MIB claims to have introduced the Broadcasting Bill to cater to the evolving needs of the broadcasting sector and in light of the technological advancements in the sector. The Broadcasting Bill, if converted into an Act of Parliament, will replace The Cable Television Networks (Regulation) Act, 1995 (“Cable Act”) as well as other policy guidelines currently governing the sector. An explanatory note has been released alongside the draft bill to facilitate better comprehension. The Bill comprises six chapters, 48 sections, and three schedules. Part C of the Broadcasting Bill applies to internet broadcasting networks. As per the Broadcasting Bill, a broadcasting services or network will only be allowed to provide service/ operate if the Union government has registered or provided an intimation to the broadcaster or broadcasting network operator \\[Clause 4(1), (4)\\]. With respect to the “OTT” broadcasting service, they will be required to provide an intimation to the Union government of its operations, if their number of subscribers or viewers fall within the prescribed threshold. The threshold as well as the form and manner of intimation will be prescribed by the Union government at a later stage \\[Clause 16(2)\\]. ### (Regulatory) dark clouds looms over “OTT” platforms The Broadcasting Bill expands the regulatory coverage of the Cable Act to include “OTT” content & digital news media under the ambit of the regulation. To capture emerging technologies, the draft bill extends application to “internet broadcasting networks”, which as per its definition in the draft bill includes Internet Protocol Television (“IPTV”) and “OTT” broadcasting services. The Broadcasting Bill defines “broadcasting” as “one-to-many transmission of audio, visual or audio-visual programmes using a broadcasting network, intended to be received or made available for viewing, by the general public or by subscribers of the broadcasting network.” As an extension of this definition, ‘OTT broadcasting service operators’ such as Netflix, Disney Hotstar, Jio Cinema, etc. are classified as “Broadcasting network operator”. It clarifies that an “OTT” broadcasting service would not include a social media intermediary, or a user of such intermediary, as defined in rules under the Information Technology (IT) Act, 2000. “OTT” broadcasting services make on-demand or curated programmes available over the internet or a computer resource, which is consumed by a subscriber who makes an account with the provider. While “OTT” broadcasting services provide access to a range of content on its platform to several of its subscribers, viewers retain the autonomy to not consume a programme if they wish to do so. This, in principle, is a direct contradiction to the nature of cable TV or radio services, wherein consumers cannot choose to stop the airing of a programme (even if they may be able to switch channels). Applying stringent rules and codes to “OTT” broadcasting services may increase financial and compliance burden for such broadcasters, negatively impact user experience, choice, and even costs borne by the users. Thus, we question the very need to bring “OTT” broadcasting services under regulation and at par with terrestrial, cable, and radio broadcasting services. Here, we must recall MIB’s historical baggage with respect to its conventional regulation of traditional forms of media. It has administered both licensing and content censorship powers over radio, cinema, and television broadcasting, specifically through laws such as the Cinematograph Act and the Cable Act. The 2020 [**notification**](https://twitter.com/internetfreedom/status/1326405658862874624?ref=static.internetfreedom.in) under the Business of Allocation Rules brought digital and online media under the jurisdiction of MIB. An [**amendment**](https://www.ahlawatassociates.com/news/government-expands-scope-of-governance-of-ministry-of-information-and-broadcasting/?ref=static.internetfreedom.in) to the Rules in August 2023 brought ‘Films and Audio-Visual programmes/content made available by online content providers/publishers’ as well as ‘online advertisements’ were brought under the regulatory ambit of MIB. Thus, the Broadcasting Bill, which seeks to envelope “OTT” broadcasting under the regulatory umbrella for radio and tv, must be examined while keeping in mind MIB’s institutional history of regulation and censorship. Here, MIB must take inspiration from the principles laid down in the [**report**](https://mib.gov.in/sites/default/files/Shyam_Benegal_committee_Report_compressed.pdf?ref=static.internetfreedom.in) of MIB’s Expert Committee on Film Certification chaired by Shyam Benegal (“Expert Committee”). The Expert Committee stated that film viewing is a consensual act, and so regulation should limit itself to a statutory warning, noting that the artistic expression and creative freedom of filmmakers should be protected and any certification should be responsive to social change. Such arguments apply even more to the realm of online content, where the viewer directly chooses the content they wish to consume. Notwithstanding our criticisms of the draft bill, we appreciate the Ministry’s intention to include Accessibility Guidelines in the Broadcasting Bill in order to make broadcasting services more accessible to persons with disabilities. Some commendable measures proposed include availability of sign language, audio descriptions and subtitles for videos, designation of a disability grievance redressal officer, etc. ### Current affairs, codes, and censorship Any programme and advertisement transmitted or re-transmitted as broadcasting services must be in conformity with the Programme Code and Advertisement Code (“Codes”) respectively \\[Clause 19(1), (2)\\]. Adherence to the Codes, which are yet to be prescribed, extends to any person who broadcasts news and current affairs programs through a digital medium (such as online paper, news portal, website, social media intermediary, or other similar medium). This excludes publishers of professional or commercial newspapers and online replicas of such newspapers. This one sentence provision under Clause 20 titled 'News and Current Affairs Programmes' may have wide ranging consequences on independent journalists who rely on the digital platforms such as social media to publish news that may typically be viewed as unpalatable to the government. This over broad provision will apply to not only journalists, but even individuals who choose to share news through online blogs or platforms. This Clause raises alarm as an individual sharing news on social media platforms may become liable if the broadcaster/ broadcasting network, self regulatory organisation, or a government appointed council believe that they have not complied with the Codes. This may affect online free speech as well as the freedom of journalistic expression of a news broadcaster or an independent news disseminator, whether it is in an organisational or individual capacity. Further, such regulation may also threaten a users’ right to access multiple, diverse points of view because the individual broadcasting news will likely only produce content which is palatable to the Union government so as to avoid non-compliance penalty. ### Choosing the path of self-regulation The Broadcasting Bill suggests a three-pronged regulatory structure: 1. Self-regulation by broadcasters and broadcasting network operators 2. Self-regulatory organisations (“SROs”) 3. The Broadcast Advisory Council (“BAC”) Such a three-tiered regulatory system was introduced under the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (“IT Rules, 2021”). This structure was created without any statutory basis or any public consultation. The allotment of such wide powers to the Union government in the absence of any constitutional or parliamentary backing posed a grave threat to the freedom of speech and expression of content creators and publishers, as well as to the right of free access to information of the consumers of such content. The constitutionality of this part of the IT Rules, 2021 has been [**challenged**](https://internetfreedom.in/supreme-court-stays-proceedings-before-high-courts-challenging-it-rules-2021-interim-orders-to-continue/?ref=static.internetfreedom.in) in several Courts. Given the challenge to Part 3 of the IT Rules, which is administered by the MIB, we must question the attempt to bring a similar model of regulation and grievance redressal for “OTT” content and digital news media as well as the imposition of other obligations on broadcasters such as the need to ‘intimate’ the Union government. A similar obligation was imposed on publishers of news media by the Ministry, to [**furnish**](https://internetfreedom.in/rule-18-it-rules-rti-appeal/?ref=static.internetfreedom.in) information under Rule 18 of the IT Rules, 2021, despite a stay on the Rules that lay out the 3-tier regulatory mechanism. Under the Broadcasting Bill, a broadcaster or operator would be required to appoint a grievance redressal officer for the purpose of receiving and hearing complaints in contravention of the Codes, become a member of an SRO, establish and maintain suitable mechanisms for the filing and redress of complaints, and publish information related to complaint redressal mechanisms prominently \\[Clause 25(1)\\]. In addition to this, every broadcaster or operator would be required to constitute one or more “Content Evaluation Committee” (“CEC”), the size, quorum, and operational details of which would be determined by the Union government. As per the draft bill, broadcasters could only broadcast programmes that have been certified by the CEC. As per the functions listed under the Broadcasting Bill, the SROs will address grievances which have not been addressed by the broadcaster or broadcasting network operators within the prescribed time period, hear appeals filed by complainants against the decision of the latter, and issue guidance or advisories to its members for ensuring compliance to the Codes \\[Clause 26(3)\\]. An SRO will also be required to make governing norms and articles for its members, which would include punishment for non-compliance with the norms or the Codes. The punishment includes temporary suspension, expulsion from membership, advisory, warning, censure, and/or monetary fine up to 5 lakhs \\[Clause 26(4)\\]. Through the standards and practices formulated and adopted by the BAC, the Union government will be able to exercise indirect control over curated content. The Broadcasting Bill allows the Union government to constitute the BAC consisting of an independent member with 25 years of experience in the media industry as the Chairperson; 5 ex officio officers representing MIB, Ministry of Women and Child Development, Ministry of Home Affairs, Ministry of External Affairs, and Ministry of Social Justice and Empowerment; and 5 additional eminent independent persons \\[Clause 27(1)\\]. The terms and conditions related to the appointment of members to the BAC, the manner of their selection, tenure, and the manner of performance of their functions are yet to be prescribed. The BAC may refer any appeal or reference to review panels constituted by it. The current composition of the BAC raises concerns around the Council's autonomy. The BAC may hear appeals filed by complainants against the decision of the SROs as well as the complaints regarding violation or contravention of the Codes referred to it by the Union government \\[28(1)\\]. After examining complaints, the BAC has to make recommendations to the Union government, which will then issue appropriate orders and directions \\[Clause 28(2),(3)\\]. The ability of the Union government to refer a complaint to a government-appointed body as well as the power to issue final order is likely to pave the way for censorship as well as self-censorship. Clause 31 allows the Union government’s power to inspect, intercept, monitor, and seize the equipment of broadcasting networks and services. Notably, the broadcasting network and services will have to be provided a notice in writing informing them of the grounds of confiscation, a reasonable opportunity of making a representation in writing, as well as an opportunity to appeal the decision of the authorised officer to the court. The application of such powers on “OTT” broadcasting services raises concerns around the executive’s indirect control over the platforms. Clause 35 further strengthens these concerns as it allows the Union government to order the broadcaster or the network to delete or modify programme or advertisement and even direct the channel to be off-air for a specified number of hours as a penalty for violating the Codes. The Union government cements its censorship powers under the draft bill through Clause 36(2) under which it may, if it deems it necessary or expedient to do so in public interest, prohibit the operation of any broadcasting services or broadcasting network operators in the areas notified. In light of increasing [**scrutiny**](https://www.business-standard.com/industry/news/worried-about-obscenity-india-asks-ott-platforms-for-content-checks-123071400415_1.html?ref=static.internetfreedom.in) of streaming platforms, the Union government oversight over the BAC and CEC raise censorship concerns. Here, the MIB’s Expert Committee recommendation for a more liberalised regime even for film certification and its caution against the Central Board of Film Certification acting as a ‘moral compass’ must be remembered and applied. The Union government must take inspiration from the recommendation given by the Expert Committee and steer away from dictating modifications and deletions. ### Excessive delegation of rule-making powers The Broadcasting Bill has left a lot of the specific provisions to be determined in the future by the executive. Such excessive delegation of rule-making leads to uncertainty for the stakeholders who may be impacted by the draft bill and prevents individuals from being fully informed so as to meaningfully engage in the consultation process. Spanning over 70 pages, the Bill includes 60 instances of \"as may be prescribed\" and 17 instances of \"as notified by the \\[Union\\] Government”. While we recognise that in some instances specificity is needed to be or must be left to future rulemaking, these must be accompanied by relevant safeguards to protect against arbitrary rule-making. However, a number of the instances of delegated legislation in the Broadcasting Bill contribute to increased uncertainty, vagueness, and raise concerns. Some grievous examples of delegated executive rule-making (without safeguards/protection), wherein clarity and specificity are of utmost importance in our opinion, are stated below: >***The Central Government, may, for the fulfilment of such social objectives, as may be prescribed, allow registration or intimation as a broadcaster or broadcasting network operator..... \\[Clause 4(4)\\]*** &#x200B; >***Every broadcaster and broadcasting Network Operator shall ensure that: (a) he transmits programmes in compliance with such terms and conditions and in such manner as may be prescribed. \\[Clause 5(1)(a)\\]*** &#x200B; >***Any cable broadcasting network operator, satellite broadcasting network operator, IPTV network operator or such other broadcasting network operator, as may be prescribed, who intends to provide Platform Services on their registered broadcasting network may apply for permission to broadcast Platform Services to the registering authority in such form, manner and containing such particulars as may be prescribed. \\[Clause 7(1)\\]*** &#x200B; >***Any programme transmitted or re-transmitted as broadcasting services shall be in conformity with the Programme Code, as may be prescribed. \\[Clause 19(1)\\]*** &#x200B; >***Any advertisement transmitted or re-transmitted as broadcasting services shall be in conformity with the Advertisement Code, as may be prescribed. \\[Clause 19(2)\\]*** &#x200B; >***Any person providing an OTT broadcasting service in India, with such number of Indian subscribers or viewers as may be prescribed, shall, within a period of one month from the notification of this Act or its meeting the prescribed threshold, provide an intimation to the \\[Union\\] Government of its operations, in such form and manner as may be prescribed. \\[Clause 16(2)\\]*** &#x200B; >***The Broadcast Advisory Council, may, constitute review panels, with such number of members and such composition, as may be prescribed, to carry out its functions referred in section 28. \\[Clause 19(1)\\]*** &#x200B; >***The terms and conditions related to the appointment of members to the Broadcast Advisory Council, the manner of their selection, tenure and the manner of performance of their functions shall be such as may be prescribed. \\[Clause 27(4)\\]*** ### Let Us Chill Previous attempts to suggest self-regulation for on-demand video streaming platforms have been viewed with scepticism in light of increasing censorship, both self-imposed and through legal requests. The unfortunate consequence of such censorship is a negative impact on the fundamental right to freedom of speech and expression. Exerting executive control over “OTT” content will lead to over-compliance and self-censorship on part of platforms, who will be keen to avoid the wide discretion allowed to the government when it comes to punishments. Reports suggest that several completed TV shows and movies have already been [**cancelled**](https://www.livemint.com/industry/media/otts-tread-on-cautious-ground-axe-shows/amp-11615188592226.html?ref=static.internetfreedom.in) fearing government censure. Given the Codes’ similarity to the Code applicable to cable TV, and the increased censorship of TV programmes as a consequence, the Broadcasting Bill must be examined with caution. **Important documents** 1. Draft Broadcasting Services (Regulation) Bill, 2023 ([**link**](https://drive.google.com/file/d/1ROw6fLMir_tXhsHY1cfHcDFvkhSblCmJ/view?usp=sharing&ref=static.internetfreedom.in))",
    "light_cleaned_comments": ""
}