{
    "id": "1fgq6t7",
    "title": "Satellite-based toll system to have factory-fitted unit, phased launch",
    "url": "https://timesofindia.indiatimes.com/india/satellite-based-toll-system-to-have-factory-fitted-unit-phased-launch/articleshow/113335203.cms",
    "selftext": "Is no one concerned about what a privacy nightmare it would be with the on-board GPS enabled unit you are potentially giving your location at all times. A very convenient way of tracking a person of interest.\nThey also mention possibility of virtual tolls. No infra is required just some tweak on the server side and geofence the area and voila you have a new toll.\n\nWhy are the current high speed camera that are used for challan not being leveraged for toll collection? Record the numbers and deduct from the owner of the registration which you already have via the Vaahan database.",
    "flair": "Policy/Economy",
    "score": 17,
    "num_comments": 4,
    "created_utc": 1726331772.0,
    "convurl": "https://external-preview.redd.it/g0IxHRbxquw_-zkPenlNWP4sl2F7idgvC9_QTJbGLVo.jpg?auto=webp&s=600f92d451a50c12557be6b00a50015a397fb43c",
    "comments": [
        "They need to sell all those unused cars. Why use what you already have?",
        "I don't think it works the way you are expecting it to. It is easier to receive the signal but difficult to send it back to the satellite.\n\nSo what they might actually be doing is: \n\ngps will always be running on the obu. When traveling on the highways, the obu will send the gps coordinates to the machines/readers on the side of the toll Plaza lanes. Based on the coordinates, the vehicle will be charged.\n\nMy guess is eventually it's possible to get manufacturer obu that are more privacy friendly and don't transmit the gps coordinates without an explicit consent from the driver.\n\nOf course till we have the above, the government can keep these receivers wherever they want and capture the whole gps log even when charging vehicles.",
        "*Pees lo janata ko, nichod lo tax.*",
        "What do you mean by explicit consent from\nDriver? Its not possible to implement as it not only creates distractions to driver but many would ignore to save toll fee.\n\nIf they are going to install barriers to validate if gps is turned on or not, then this system is not at all needed, fastag is adequate",
        "New contracts = more bribe money. \n\nIt's obvious."
    ],
    "cleaned_text": "satellitebased toll system factoryfitted unit phased launch one concerned privacy nightmare would onboard gps enabled unit potentially giving location times convenient way tracking person interest also mention possibility virtual tolls infra required tweak server side geofence area voila new toll current high speed camera used challan leveraged toll collection record numbers deduct owner registration already via vaahan database ",
    "cleaned_title": "satellitebased toll system factoryfitted unit phased launch",
    "cleaned_selftext": "one concerned privacy nightmare would onboard gps enabled unit potentially giving location times convenient way tracking person interest also mention possibility virtual tolls infra required tweak server side geofence area voila new toll current high speed camera used challan leveraged toll collection record numbers deduct owner registration already via vaahan database",
    "cleaned_comments": "need sell unused cars use already dont think works way expecting easier receive signal difficult send back satellite might actually gps always running obu traveling highways obu send gps coordinates machinesreaders side toll plaza lanes based coordinates vehicle charged guess eventually possible get manufacturer obu privacy friendly dont transmit gps coordinates without explicit consent driver course till government keep receivers wherever want capture whole gps log even charging vehicles pees lo janata ko nichod lo tax mean explicit consent driver possible implement creates distractions driver many would ignore save toll fee going install barriers validate gps turned system needed fastag adequate new contracts bribe money obvious",
    "light_cleaned_title": "Satellite-based toll system to have factory-fitted unit, phased launch",
    "light_cleaned_selftext": "Is no one concerned about what a privacy nightmare it would be with the on-board GPS enabled unit you are potentially giving your location at all times. A very convenient way of tracking a person of interest. They also mention possibility of virtual tolls. No infra is required just some tweak on the server side and geofence the area and voila you have a new toll. Why are the current high speed camera that are used for challan not being leveraged for toll collection? Record the numbers and deduct from the owner of the registration which you already have via the Vaahan database.",
    "light_cleaned_comments": "They need to sell all those unused cars. Why use what you already have? I don't think it works the way you are expecting it to. It is easier to receive the signal but difficult to send it back to the satellite. So what they might actually be doing is: gps will always be running on the obu. When traveling on the highways, the obu will send the gps coordinates to the machines/readers on the side of the toll Plaza lanes. Based on the coordinates, the vehicle will be charged. My guess is eventually it's possible to get manufacturer obu that are more privacy friendly and don't transmit the gps coordinates without an explicit consent from the driver. Of course till we have the above, the government can keep these receivers wherever they want and capture the whole gps log even when charging vehicles. *Pees lo janata ko, nichod lo tax.* What do you mean by explicit consent from Driver? Its not possible to implement as it not only creates distractions to driver but many would ignore to save toll fee. If they are going to install barriers to validate if gps is turned on or not, then this system is not at all needed, fastag is adequate New contracts = more bribe money. It's obvious."
}