{
    "id": "1153fz8",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/1153fz8/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ae6b7a10fa3272821e9904431dab0b993b36aae7",
    "flair": "Scheduled",
    "score": 16,
    "num_comments": 23,
    "created_utc": 1676683809,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "* Poker face\n* South Park S26\n* The Last of Us",
        "great",
        "great",
        "nice",
        "great",
        "interesting",
        "amazing",
        "great",
        "great",
        "amazing",
        "Came across a Russian film production studio called [Mosfilm](https://youtube.com/@Mosfilm_eng) on YouTube. There are several movies uploaded in this channel. I recently watched War and Peace and wanted to check if there are any other movies in this channel that are worth watching from Mosfilm(other than Tarkovsky's). I don't have any genre preference.",
        "* Farzi\n* Cunk on the earth\n* The winning secrets (webseries)",
        "Watched pawan kumar's kudi yedamaithe",
        "Podcast - There's a new Indian science podcast called Imagined Tomorrow. Looks at the future, and quite well made.\n\nTV series - The Night Manager, Indian adaptation is surprisingly good. Don't understand why they split it up into two chunks.",
        "Any good non-Hindi Netflix/Amazon Prime worth watching? Looking for a series with subtitles. Open to all genres.",
        "Do you recommend the Night Manager? How is the original series?",
        "The original series is pretty good. Hugh Laurie is excellent. The Indian version has adapted to the South Asian context well, imo. But while the original is 6 episodes, the Indian one has been stretched out and made longer",
        "Checkout Fauda. Ignore if watched already.",
        "Watching The Bridge on Amazon Prime. Right now on the 7th episode of season 1 and so far seems pretty good.",
        "Romance can be done in any life frames. We Indians are so romantic. But confused how to do that? Hello guys!, I found a video which is just meant for you. Go watch it! [Life romance](https://youtu.be/eejIaWW45Ig)",
        "I loved the original series. Didn't know there was an Indian version will check it out. Thanks!"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "poker face south park last us great great nice great interesting amazing great great amazing came across russian film production studio called mosfilmhttpsyoutubecommosfilmeng youtube several movies uploaded channel recently watched war peace wanted check movies channel worth watching mosfilmother tarkovskys dont genre preference farzi cunk earth winning secrets webseries watched pawan kumars kudi yedamaithe podcast theres new indian science podcast called imagined tomorrow looks future quite well made tv series night manager indian adaptation surprisingly good dont understand split two chunks good nonhindi netflixamazon prime worth watching looking series subtitles open genres recommend night manager original series original series pretty good hugh laurie excellent indian version adapted south asian context well imo original episodes indian one stretched made longer checkout fauda ignore watched already watching bridge amazon prime right th episode season far seems pretty good romance done life frames indians romantic confused hello guys found video meant go watch life romancehttpsyoutubeeejiawwig loved original series didnt know indian version check thanks",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "* Poker face * South Park S26 * The Last of Us great great nice great interesting amazing great great amazing Came across a Russian film production studio called [Mosfilm](https://youtube.com/@Mosfilm_eng) on YouTube. There are several movies uploaded in this channel. I recently watched War and Peace and wanted to check if there are any other movies in this channel that are worth watching from Mosfilm(other than Tarkovsky's). I don't have any genre preference. * Farzi * Cunk on the earth * The winning secrets (webseries) Watched pawan kumar's kudi yedamaithe Podcast - There's a new Indian science podcast called Imagined Tomorrow. Looks at the future, and quite well made. TV series - The Night Manager, Indian adaptation is surprisingly good. Don't understand why they split it up into two chunks. Any good non-Hindi Netflix/Amazon Prime worth watching? Looking for a series with subtitles. Open to all genres. Do you recommend the Night Manager? How is the original series? The original series is pretty good. Hugh Laurie is excellent. The Indian version has adapted to the South Asian context well, imo. But while the original is 6 episodes, the Indian one has been stretched out and made longer Checkout Fauda. Ignore if watched already. Watching The Bridge on Amazon Prime. Right now on the 7th episode of season 1 and so far seems pretty good. Romance can be done in any life frames. We Indians are so romantic. But confused how to do that? Hello guys!, I found a video which is just meant for you. Go watch it! [Life romance](https://youtu.be/eejIaWW45Ig) I loved the original series. Didn't know there was an Indian version will check it out. Thanks!"
}