{
    "id": "15vzlgx",
    "title": "Election Commissioners' Appointment Bill: Farewell to Free and Fair Elections?",
    "url": "https://m.thewire.in/article/government/election-commissioners-appointment-bill-farewell-to-free-and-fair-elections",
    "selftext": "So much for \"Mother of Democracy\"",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 7,
    "created_utc": 1692500354.0,
    "convurl": "https://external-preview.redd.it/wvgqcFWIUDSx1QkQztkS7B0MIVTuMrIzIT8CZvOq7EU.jpg?auto=webp&amp;s=8b44653b5145d3500321965790fa6ef18a7ef37c",
    "comments": [
        "(Scroll down for TLDR)\n\nIMAO.. As it stands presently.. GLOBALLY Democracy is the biggest con now playing at a election near you.. \n\nThis unfunny farce is starring, produced, scripted and directed by the ruling elite capitalist classes who have a captive audience namely, the compliant masses.. \n\nBut on the other hand.. \n\nI dream of a future where democracy is rescued and resurrected by technology.. \n\nAfter all we should really be voting for and against POLICIES AND NOT POLITICIANS .. \n\nA new technology (just around the corner) can easily rid us of these useless middlemen ie. politicians who in theory have been democratically elected based on the policies that they have proposed for the betterment of the society.. But in reality are too busy pulling each other down while covering their own crimes.. \n\nOur current crop of power hungry politicians (and this is globally) operate just like the entitled tyrannical monarchs from history and rule over their fiefdoms (constituencies) like it is their own private backyard while regarding their subjects (the so called electorate) as nothing more than cannon fodder.. \n\nWhere were stand today, globally, democracy is a cruel joke.. Because.. Democracy ceases to function efficiently when the disparities within a society get out of control.. When the differences between the haves and have-nots between the knowledgeable and the ignorant are too much then the very ground on which we place our so called democratic values is rather nonexistent and therefore a total lie.. A farce.. Add rampant capitalism to this scenerio and we have a global society where we literally worship money so then we might as well make the richest person in the land our supreme leader.. Why do all this farce of free and fair elections..🤔\n\nIdeally capitalist tendencies (the profit motive) should not be allowed to operate in atleast these 3 major \"industries\" namely 1. health care 2. education and 3. warfare.. But today in our rather twisted world we see the very same 3 sectors operating with the utmost greed, reaping ridiculous profits at the expense of perpetuating horrendous and inhumane social disparities.. All in the name of driving the so called \"economic growth\" of a so called \"nation\".. \n\nYet there is hope and I am betting on a humane technology to come to our rescue.. Because history repeats itself.. Whenever humanity has faced any crises it has always been our innovations ie. technologies which have rescued us time and again.. These technologies can only be invented by a new generation who first question and then reject the old values because they see the world in a different way.. This new generation is already here.. The tools namely AI, AGI are also available.. Now only the will and the skill to make sincere creative efforts are needed.. I hope that this happens in my lifetime.. .. First imagine a world without any \"career politicians\" .. Then imagine a world where every citizen is in effect a politician because they have the power to not only directly vote on each and every policy that stands to affect them.. But also propose any policy that they wish to come into governance.. That would be so cool.. \n\nHowever for now until then.. What to do.. Well in my personal capacity, the above reasons stand for the fact that I have stopped voting.. Because I want to boycott not just our corrupt politicians but the insidious system itself.. I reject this false democracy and farce called elections.. Yes I know that there is something called the NOTA vote.. But (in India) this NOTA is a toothless tiger ffs.. So the only option for me in my personal capacity is to boycott these mofoking farcical elections. \n\n\nTLDR.. Democracy breaks down when there is too much disparity in society because then this disparity is cunningly and cruelly leveraged by the corrupt politicians.. However with Technological advances there is hope that this system can be repaired.. After all we should BE VOTING FOR POLICIES AND NOT FOR POLITICIANS.. Technology can empower the electorate and finally make these middleman ie. politicians obsolete.. Computer ji pls help..",
        "> Bringing the Election Commission under the control of the political executive is repugnant to the concept of an independent election commission enshrined in the constitution.\n\nTalk about someone who hasn't even read the constitution. The text of the constitution puts appointment of the Election commissioners under the authority of the president with guidelines to be set by parliament.\n\nIe exactly what is happening here.\n\nParliament is simply fixing the court massively overstepping their own constitutional mandate earlier this year and undoing their grossly unconstitutional actions.",
        " court gave the right judgement. Election commissioner should be neutral entity. But pm modi appointed arul goel within 24 hours of retirement and election commissioner was acting as stooge. \n\nSo court said 3 member committee will form election commissioner. Pm , lop and cji. Because chi is neutral.\n\nThe govt formed committe and the committe recommended that pm ,lop , cji should choose election commissioner. \n\nBut they brought a bill contrary to their own committe recommendation\n\nhttps://www.google.com/amp/s/www.thehindu.com/news/national/bill-to-replace-cji-from-selection-panel-for-cec-runs-contrary-to-govts-own-committee-recommendation/article67181647.ece/amp/\n\n\nBut in the lust for power , they removed cji and replace it with cabinet minister nominated by pm. So election commissioner will continue to be stooge.",
        "The court's decision was temporary pending legislature by the Govt. Courts don't have the right to make laws.",
        ">Election commissioner should be neutral entity. But pm modi appointed arul goel within 24 hours of retirement and election commissioner was acting as stooge. \n\nSo the constitution is wrong then? Because the constitution itself says the exact opposite. That the ECI is appointed by the president.\n\nAnd parliament and the government aren't bound to legislate on what a committee dictates. If parliament believes the PM is wrong to bring this bill, they can vote it down. That's how a parliamentary democracy works.",
        "[ECI Bill: Open Letter To Chief Ministers| E A S Sarma, Former Secretary to the Government of India](https://countercurrents.org/2023/08/eci-bill-open-letter-to-chief-ministers/)"
    ],
    "cleaned_text": "election commissioners appointment bill farewell free fair elections much mother democracy ",
    "cleaned_title": "election commissioners appointment bill farewell free fair elections",
    "cleaned_selftext": "much mother democracy",
    "cleaned_comments": "scroll tldr imao stands presently globally democracy biggest con playing election near unfunny farce starring produced scripted directed ruling elite capitalist classes captive audience namely compliant masses hand dream future democracy rescued resurrected technology really voting policies politicians new technology around corner easily rid us useless middlemen ie politicians theory democratically elected based policies proposed betterment society reality busy pulling covering crimes current crop power hungry politicians globally operate like entitled tyrannical monarchs history rule fiefdoms constituencies like private backyard regarding subjects called electorate nothing cannon fodder stand today globally democracy cruel joke democracy ceases function efficiently disparities within society get control differences haves havenots knowledgeable ignorant much ground place called democratic values rather nonexistent therefore total lie farce add rampant capitalism scenerio global society literally worship money might well make richest person land supreme leader farce free fair elections ideally capitalist tendencies profit motive allowed operate atleast major industries namely health care education warfare today rather twisted world see sectors operating utmost greed reaping ridiculous profits expense perpetuating horrendous inhumane social disparities name driving called economic growth called nation yet hope betting humane technology come rescue history repeats whenever humanity faced crises always innovations ie technologies rescued us time technologies invented new generation first question reject old values see world different way new generation already tools namely ai agi also available skill make sincere creative efforts needed hope happens lifetime first imagine world without career politicians imagine world every citizen effect politician power directly vote every policy stands affect also propose policy wish come governance would cool however well personal capacity reasons stand fact stopped voting want boycott corrupt politicians insidious system reject false democracy farce called elections yes know something called nota vote india nota toothless tiger ffs option personal capacity boycott mofoking farcical elections tldr democracy breaks much disparity society disparity cunningly cruelly leveraged corrupt politicians however technological advances hope system repaired voting policies politicians technology empower electorate finally make middleman ie politicians obsolete computer ji pls help bringing election commission control political executive repugnant concept independent election commission enshrined constitution talk someone hasnt even read constitution text constitution puts appointment election commissioners authority president guidelines set parliament ie exactly happening parliament simply fixing court massively overstepping constitutional mandate earlier year undoing grossly unconstitutional actions court gave right judgement election commissioner neutral entity pm modi appointed arul goel within hours retirement election commissioner acting stooge court said member committee form election commissioner pm lop cji chi neutral govt formed committe committe recommended pm lop cji choose election commissioner brought bill contrary committe recommendation lust power removed cji replace cabinet minister nominated pm election commissioner continue stooge courts decision temporary pending legislature govt courts dont right make laws election commissioner neutral entity pm modi appointed arul goel within hours retirement election commissioner acting stooge constitution wrong constitution says exact opposite eci appointed president parliament government arent bound legislate committee dictates parliament believes pm wrong bring bill vote thats parliamentary democracy works eci bill open letter chief ministers e sarma former secretary government indiahttpscountercurrentsorgecibillopenlettertochiefministers",
    "light_cleaned_title": "Election Commissioners' Appointment Bill: Farewell to Free and Fair Elections?",
    "light_cleaned_selftext": "So much for \"Mother of Democracy\"",
    "light_cleaned_comments": "(Scroll down for TLDR) IMAO.. As it stands presently.. GLOBALLY Democracy is the biggest con now playing at a election near you.. This unfunny farce is starring, produced, scripted and directed by the ruling elite capitalist classes who have a captive audience namely, the compliant masses.. But on the other hand.. I dream of a future where democracy is rescued and resurrected by technology.. After all we should really be voting for and against POLICIES AND NOT POLITICIANS .. A new technology (just around the corner) can easily rid us of these useless middlemen ie. politicians who in theory have been democratically elected based on the policies that they have proposed for the betterment of the society.. But in reality are too busy pulling each other down while covering their own crimes.. Our current crop of power hungry politicians (and this is globally) operate just like the entitled tyrannical monarchs from history and rule over their fiefdoms (constituencies) like it is their own private backyard while regarding their subjects (the so called electorate) as nothing more than cannon fodder.. Where were stand today, globally, democracy is a cruel joke.. Because.. Democracy ceases to function efficiently when the disparities within a society get out of control.. When the differences between the haves and have-nots between the knowledgeable and the ignorant are too much then the very ground on which we place our so called democratic values is rather nonexistent and therefore a total lie.. A farce.. Add rampant capitalism to this scenerio and we have a global society where we literally worship money so then we might as well make the richest person in the land our supreme leader.. Why do all this farce of free and fair elections..🤔 Ideally capitalist tendencies (the profit motive) should not be allowed to operate in atleast these 3 major \"industries\" namely 1. health care 2. education and 3. warfare.. But today in our rather twisted world we see the very same 3 sectors operating with the utmost greed, reaping ridiculous profits at the expense of perpetuating horrendous and inhumane social disparities.. All in the name of driving the so called \"economic growth\" of a so called \"nation\".. Yet there is hope and I am betting on a humane technology to come to our rescue.. Because history repeats itself.. Whenever humanity has faced any crises it has always been our innovations ie. technologies which have rescued us time and again.. These technologies can only be invented by a new generation who first question and then reject the old values because they see the world in a different way.. This new generation is already here.. The tools namely AI, AGI are also available.. Now only the will and the skill to make sincere creative efforts are needed.. I hope that this happens in my lifetime.. .. First imagine a world without any \"career politicians\" .. Then imagine a world where every citizen is in effect a politician because they have the power to not only directly vote on each and every policy that stands to affect them.. But also propose any policy that they wish to come into governance.. That would be so cool.. However for now until then.. What to do.. Well in my personal capacity, the above reasons stand for the fact that I have stopped voting.. Because I want to boycott not just our corrupt politicians but the insidious system itself.. I reject this false democracy and farce called elections.. Yes I know that there is something called the NOTA vote.. But (in India) this NOTA is a toothless tiger ffs.. So the only option for me in my personal capacity is to boycott these mofoking farcical elections. TLDR.. Democracy breaks down when there is too much disparity in society because then this disparity is cunningly and cruelly leveraged by the corrupt politicians.. However with Technological advances there is hope that this system can be repaired.. After all we should BE VOTING FOR POLICIES AND NOT FOR POLITICIANS.. Technology can empower the electorate and finally make these middleman ie. politicians obsolete.. Computer ji pls help.. > Bringing the Election Commission under the control of the political executive is repugnant to the concept of an independent election commission enshrined in the constitution. Talk about someone who hasn't even read the constitution. The text of the constitution puts appointment of the Election commissioners under the authority of the president with guidelines to be set by parliament. Ie exactly what is happening here. Parliament is simply fixing the court massively overstepping their own constitutional mandate earlier this year and undoing their grossly unconstitutional actions. court gave the right judgement. Election commissioner should be neutral entity. But pm modi appointed arul goel within 24 hours of retirement and election commissioner was acting as stooge. So court said 3 member committee will form election commissioner. Pm , lop and cji. Because chi is neutral. The govt formed committe and the committe recommended that pm ,lop , cji should choose election commissioner. But they brought a bill contrary to their own committe recommendation But in the lust for power , they removed cji and replace it with cabinet minister nominated by pm. So election commissioner will continue to be stooge. The court's decision was temporary pending legislature by the Govt. Courts don't have the right to make laws. >Election commissioner should be neutral entity. But pm modi appointed arul goel within 24 hours of retirement and election commissioner was acting as stooge. So the constitution is wrong then? Because the constitution itself says the exact opposite. That the ECI is appointed by the president. And parliament and the government aren't bound to legislate on what a committee dictates. If parliament believes the PM is wrong to bring this bill, they can vote it down. That's how a parliamentary democracy works. [ECI Bill: Open Letter To Chief Ministers| E A S Sarma, Former Secretary to the Government of India](https://countercurrents.org/2023/08/eci-bill-open-letter-to-chief-ministers/)"
}