{
    "id": "14rxha9",
    "title": "A Contempt of court filing against Bengaluru Urban DC seems like the only legal option. Don't they realize it is a waste of time and money?",
    "url": "https://www.reddit.com/r/india/comments/14rxha9/a_contempt_of_court_filing_against_bengaluru/",
    "selftext": "There is a long-pending issue of land title that the Revenue officials have been dragging their feet on. (x-post from [r/LegalAdviceIndia](https://np.reddit.com/r/LegalAdviceIndia/comments/14r9sjr/is_contempt_of_court_against_bengaluru_urban_dc/)) \n\nMy lawyer filed a Writ Petition in HC. The honourable Karnataka High Court passed an order directing Bengaluru Urban Deputy Comissioner to act within 45 days - Order on Writ Petition ( WP 6929/2023) dated 28/03/2023 \n\nMy lawyer has been trying to follow up with DC after handing him a copy of the order but the officials simply refuse to act nearly 3 months after the order.\n\nContempt of Court seems to be my only legal option. Don't the officials realize it is a waste of time and money?\n\n------\n\nHere is a brief summary of my story in [The Hindu](https://www.thehindu.com/news/cities/bangalore/bengaluru-urban-dc-accused-of-violating-hc-order-over-issuance-of-khata/article66985535.ece)",
    "flair": "Rant / Vent",
    "score": 38,
    "num_comments": 7,
    "created_utc": 1688616645.0,
    "convurl": "https://external-preview.redd.it/fZ-LkH51-tLfTZG9a_r18hQblPi0KLatlaUOsCZ0og8.jpg",
    "comments": [
        "By going to court and forcing the Urban DC to comply you are now the enemy. The DC is now playing the long con as in - he/she is deliberately non cooperative in an attempt to trigger you to do something (contempt of court). By the time the case winds through the court and you have won, he/she would have transferred, promoted or retired. \n\nSo you incur all the lawyer fees, the headache of 'winning' but not getting the desired outcome. You are losing not the DC. \\]\n\nBTW - you should do now what you should have done before going to court. Make friends with the DC and ask what needs to be done from your side. I have no direct experience with Karnataka but whole heartedly know that the equivalent Mumbai officers are corrupt as shit.",
        "> Make friends with the DC and ask what needs to be done from your side. I have no direct experience with Karnataka but whole heartedly know that the equivalent Mumbai officers are corrupt as shit.\n\nTried that. Those folks are not just corrupt but have layers of corruption. .... dad spent Lakhs with 'agents' in a futile attempt. No honor among thieves, as the saying goes.\n\nCourt is a Hail Mary!",
        "You have to take it to SC, that’s the only contempt they care about.",
        "Any experience with this or just an academic suggestion?",
        "We did it for our apartment clubhouse with BDA, even with SC order mentioning the BDA chairman himself, we had to wait till the last day before contempt when it was handed over.  Almost. 7 year fight across levels of courts",
        "Thanks.... Tired of trying to bribe and dubious agents... hence legal route"
    ],
    "cleaned_text": "contempt court filing bengaluru urban dc seems like legal option dont realize waste time money longpending issue land title revenue officials dragging feet xpost rlegaladviceindiahttpsnpredditcomrlegaladviceindiacommentsrsjriscontemptofcourtagainstbengaluruurbandc lawyer filed writ petition hc honourable karnataka high court passed order directing bengaluru urban deputy comissioner act within days order writ petition wp dated lawyer trying follow dc handing copy order officials simply refuse act nearly months order contempt court seems legal option dont officials realize waste time money brief summary story hinduhttpswwwthehinducomnewscitiesbangalorebengaluruurbandcaccusedofviolatinghcorderoverissuanceofkhataarticleece ",
    "cleaned_title": "contempt court filing bengaluru urban dc seems like legal option dont realize waste time money",
    "cleaned_selftext": "longpending issue land title revenue officials dragging feet xpost rlegaladviceindiahttpsnpredditcomrlegaladviceindiacommentsrsjriscontemptofcourtagainstbengaluruurbandc lawyer filed writ petition hc honourable karnataka high court passed order directing bengaluru urban deputy comissioner act within days order writ petition wp dated lawyer trying follow dc handing copy order officials simply refuse act nearly months order contempt court seems legal option dont officials realize waste time money brief summary story hinduhttpswwwthehinducomnewscitiesbangalorebengaluruurbandcaccusedofviolatinghcorderoverissuanceofkhataarticleece",
    "cleaned_comments": "going court forcing urban dc comply enemy dc playing long con heshe deliberately non cooperative attempt trigger something contempt court time case winds court heshe would transferred promoted retired incur lawyer fees headache winning getting desired outcome losing dc btw done going court make friends dc ask needs done side direct experience karnataka whole heartedly know equivalent mumbai officers corrupt shit make friends dc ask needs done side direct experience karnataka whole heartedly know equivalent mumbai officers corrupt shit tried folks corrupt layers corruption dad spent lakhs agents futile attempt honor among thieves saying goes court hail mary take sc thats contempt care experience academic suggestion apartment clubhouse bda even sc order mentioning bda chairman wait till last day contempt handed almost year fight across levels courts thanks tired trying bribe dubious agents hence legal route",
    "light_cleaned_title": "A Contempt of court filing against Bengaluru Urban DC seems like the only legal option. Don't they realize it is a waste of time and money?",
    "light_cleaned_selftext": "There is a long-pending issue of land title that the Revenue officials have been dragging their feet on. (x-post from [r/LegalAdviceIndia](https://np.reddit.com/r/LegalAdviceIndia/comments/14r9sjr/is_contempt_of_court_against_bengaluru_urban_dc/)) My lawyer filed a Writ Petition in HC. The honourable Karnataka High Court passed an order directing Bengaluru Urban Deputy Comissioner to act within 45 days - Order on Writ Petition ( WP 6929/2023) dated 28/03/2023 My lawyer has been trying to follow up with DC after handing him a copy of the order but the officials simply refuse to act nearly 3 months after the order. Contempt of Court seems to be my only legal option. Don't the officials realize it is a waste of time and money? ------ Here is a brief summary of my story in [The Hindu](https://www.thehindu.com/news/cities/bangalore/bengaluru-urban-dc-accused-of-violating-hc-order-over-issuance-of-khata/article66985535.ece)",
    "light_cleaned_comments": "By going to court and forcing the Urban DC to comply you are now the enemy. The DC is now playing the long con as in - he/she is deliberately non cooperative in an attempt to trigger you to do something (contempt of court). By the time the case winds through the court and you have won, he/she would have transferred, promoted or retired. So you incur all the lawyer fees, the headache of 'winning' but not getting the desired outcome. You are losing not the DC. \\] BTW - you should do now what you should have done before going to court. Make friends with the DC and ask what needs to be done from your side. I have no direct experience with Karnataka but whole heartedly know that the equivalent Mumbai officers are corrupt as shit. > Make friends with the DC and ask what needs to be done from your side. I have no direct experience with Karnataka but whole heartedly know that the equivalent Mumbai officers are corrupt as shit. Tried that. Those folks are not just corrupt but have layers of corruption. .... dad spent Lakhs with 'agents' in a futile attempt. No honor among thieves, as the saying goes. Court is a Hail Mary! You have to take it to SC, that’s the only contempt they care about. Any experience with this or just an academic suggestion? We did it for our apartment clubhouse with BDA, even with SC order mentioning the BDA chairman himself, we had to wait till the last day before contempt when it was handed over. Almost. 7 year fight across levels of courts Thanks.... Tired of trying to bribe and dubious agents... hence legal route"
}