{
    "id": "rynudo",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/rynudo/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 6,
    "num_comments": 9,
    "created_utc": 1641605421,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Humble Politician Nograj",
        "Don't Look Up",
        "+1 for this. Its a satire movie, but well done. And they didn't skimp on the sci-fi stuff at the end.",
        "The Shrink Next Door. Paul Rudd surprisingly pulls off a self serving manipulative psychiatrist.",
        "A Polish series called \"signs\". It is a suspense thriller on Netflix, really good.",
        "Suggest some good foreign cinema or TV show that is other then English and Korean. I'm trying to watch content from different country lately. Last I saw Merlí  a Spanish show, really liked it. I wish there was more content like that out there.",
        "Turkish movie : Miracle in Cell No 7  (remade from a Korean movie i think). It's on Netflix",
        "Minnal Murali",
        "Arcane, its an adaptation of two characters from the game league of legends. Very successfully done, as the entire production ownership was given to artists."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "humble politician nograj dont look satire movie well done didnt skimp scifi stuff end shrink next door paul rudd surprisingly pulls self serving manipulative psychiatrist polish series called signs suspense thriller netflix really good suggest good foreign cinema tv show english korean im trying watch content different country lately last saw merl spanish show really liked wish content like turkish movie miracle cell remade korean movie think netflix minnal murali arcane adaptation two characters game league legends successfully done entire production ownership given artists",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Humble Politician Nograj Don't Look Up +1 for this. Its a satire movie, but well done. And they didn't skimp on the sci-fi stuff at the end. The Shrink Next Door. Paul Rudd surprisingly pulls off a self serving manipulative psychiatrist. A Polish series called \"signs\". It is a suspense thriller on Netflix, really good. Suggest some good foreign cinema or TV show that is other then English and Korean. I'm trying to watch content from different country lately. Last I saw Merlí a Spanish show, really liked it. I wish there was more content like that out there. Turkish movie : Miracle in Cell No 7 (remade from a Korean movie i think). It's on Netflix Minnal Murali Arcane, its an adaptation of two characters from the game league of legends. Very successfully done, as the entire production ownership was given to artists."
}