{
    "id": "1h11lpt",
    "title": "How does the GST percentage vary across franchises?",
    "url": "https://www.reddit.com/gallery/1h11lpt",
    "selftext": "COFFEE WORLD’s parent company is KEVENTERS and the GST percentage is 5% here whereas in KEVENTERS, its 18%! How does the GST vary that much?\n\nPS: I ordered coffee from COFFEE WORLD and sundae from KEVENTERS. I asked the barista and he told me that it varies with the product, i.e., waffles, shakes, sundaes, etc. How exactly does it work like that?",
    "flair": "Policy/Economy",
    "score": 566,
    "num_comments": 90,
    "created_utc": 1732704534,
    "convurl": "https://i.redd.it/jwlpzt55cf3e1.jpg",
    "comments": [
        "\nhttps://groww.in/p/tax/gst-on-food-and-restaurants",
        "We have a variety of GST slabs, varying from 0.3% to 28%, and the GST is applicable on the item and varies according to that.\n\nCoffee has a GST of 5% while ice cream has a GST of 18%, hence your bills have different rates.\n\nIf you had purchased both, you would have got a bill which would have one line item at 5% and another at 18%.",
        "Coffee taxed at 5% and Ice Cream taxed at 18% basically hotel lobby is more powerful",
        "Different items",
        "For this same thing, a businessman in Tamil Nadu had asked directly to our FM. He said that even his C.A. gets confused.\nLater he apologized for the question.",
        "Tbh 28% is too much",
        "We should ask Nirmala Tai about that",
        "There is provision in gst where it can go upto 40% pray to god 28 to be maximum",
        "Pleasure at 18%, frap at 5% sounds about right.",
        "> Later he apologized for the question.\n\n\nMore like, he was forced/bullied into apologising for a very simple and genuine question",
        "Only applicable on 'luxury' and sin items for the most part.",
        "Lol many people drink coffee daily once or twice\n\nNo normal person  eats ice cream daily",
        "Ice cream is a luxury, you should stick to adulterated milk. \n\n\n- you know who",
        "Coffee is staple bruh, ice cream is not",
        "The slabs are a disaster.",
        "I’m pretty sure a business owner asked raised a similar point with the FM only to have to apologise later.",
        "Beverage is Useless item should have 50% GST it's not good for health moreover Income goes to foreign counties, Drink fresh Juices or make fruit Fizz at home",
        "Lmao",
        "Applies to basic cars also",
        "Cigarettes and alcohol should be taxed at 100% GST then by your logic.",
        "Luxury is in quotes for a reason and I said 'for the most part as well'.",
        "Restaurants have 5% GST. The other order might not be restaurant, instead be a retail store only for selling, so 18% GST.\n\nIt needs to be kept in mind though that restaurants don't get input credit. So if they collect 5%, all of it goes to the government. Retail store charging 18% will get input credit. So they will only deposit a part of the tax collected to the government, remaining will be adjusted against GST paid to their suppliers.\n\nSo if restaurant sells goods worth 200 and charges 5% GST (₹10), ₹10 goes to the government.\n\nIf a retail store sells goods worth ₹200 and charges 18% GST (₹36), and has used input worth ₹100 on which they have paid 18% GST (₹18), then it ₹18 (36-18) goes to the government.\n\nThis is the reason for restaurant GST rate to be lower. Not because coffee is a daily need which people apparently can't live without.",
        "Please don't give them anymore ideas",
        "Go for 1000% still people use them, I would be the happiest person even at 100%",
        "GUILTY PLEASURE",
        "If a restaurant is part of a hotel with more than a certain number of rooms, 9% gst is charged instead of 5",
        "It also depends on where you are being served. There is a restaurant in my home town which has two adjacent areas. One is Non-AC and another has AC and both have their own billing counters. The food comes from a common kitchen and the menu is common, but based on where you are seated and served, you would have a different percentage of GST.",
        "Hotels have a GST differential issue. Govt allowed either 5% without ITC and 18% with ITC. \n\n[Differential options](https://cleartax.in/s/impact-gst-food-services-restaurant-business)\n\nThats why the difference. The GSTIN are also different on each bill. So its not a single entity providing this.",
        "Different items. GST is not applicable to a state or a franchise or a person. It's applicable on a product. And it's not as broad a classification like food, beverages. That was the old model. In the new model, individual items are taxed at various rates. It's super confusing tbh. What's the gst on ice cream made in the restaurant, is it even ice cream, can it be called a frozen dessert, what happens if you buy a big box of amul and serve scoops to customers - our FM has no answer for that. The government just randomly picks stuff and updates a slab.",
        "From how it was before 45-48% VAT/Excise, GST is lower at 28%. However, we are still stuck wik GST compensatory cess, which is keeping total tax at 45-48%. It was supposed to be over 2 years back, but then state FMs asked for funds post covid so the council decided to keep it till 2026. \n\nI hope it goes away, but then state FMs wil cry again to make it continue, making it an immortal cess.",
        "GST on car is 28% (upto 50% including cess for suv) and GST on helicopters is 5%. They recently cut tax for helicopter rides from 18% to 5% because poor people are suffering. They have put 18% GST for ice cream but 3% GST for Gold.They have put 28% GST for A/c and 3% GST for diamonds. They have put 18% GST for corn, computers, tooth paste, toiletries, hair oil, pasta, soup but 3% GST for imitation jewelry. They have put 12% GST for mobiles, Ghee, butter, almonds, fruits, fruit juice, jam, chutney, jelly but 0.25% for non industrial diamonds.",
        "Breakpads have 28% gst for scooty",
        "There is a separate HSN code for every product in GST and SAC code for services.\nYou can look up for the code of product or service on google and then check about its taxability.\nLike for example for Ice-Cream HSN code is 2105 and if you google it, you’ll get the taxability of 18%.",
        "its not a laughing matter it just demonstrates that the voice of people doesn't matter as long as the elected dumbfucks feel good",
        "Love the #HumbleBrag",
        "The management and structuralization of the GST collection done by both the State and Central Government has gone for a toss. Maybe one of the reasons why the Central Government doesn't like to show the returns they have collected from them.",
        "What an absolute clusterfuck",
        "Not that I am defending that dumbass, but yea.. Ciggys are already taxed at > 50%. Don't jinx it to a century 🥹",
        "Thats a luxury that you shouldn’t have",
        "Could it cos of the beverage?",
        "Nope.. this is not the case of RCM. Just a case of different HSN codes. Please don't misguide.",
        "Are you talking about Composition scheme? No, that is not the reason. Difference in HSN code should be the reason.",
        "Restaurants have two options for gst filing , one is flat 5 percent on all the transactions but you can’t claim any gst returns and in the other the items have varied gst rates where you can file gst returns since this is more complicated most of the small restaurants go for the flat rate . But big chains go for the latter model since they file gst returns and in turn is more profitable .",
        "https://preview.redd.it/wlbtucwf3h3e1.jpeg?width=207&format=pjpg&auto=webp&s=09623953047f7aefb7a9f2354f9072e7e013c2c2",
        "Pleasure pe tax jyada lagta hai.. laate khaane waalon pe sarkar taras kar leti hai..",
        "Anything that is made in house(coffee in this case) is classified as restaurant service attracting 5% gst and anything that is packaged or manufactured in a standardised way (ice cream) is classified as a good with a varied rate depending on its HSN",
        "We regular people with our simple brains simply can't fathom the the complexities and reasons why a great person like nimmi ji made such a decision. Just do as asked, no questions.",
        "Lol",
        "Not surprising, the MLA will give themselves tons of benefits including wage increase to accommodate the cost of living but when it comes to the public, you bet it's never gonna happen.\nI have had hope that people would revolt but there is no way it's gonna happen as the rich keeps on getting more power and control over the population with technology.",
        "You mean Nirmala forced him to apologize and recorded and released the video online ?",
        " non-ac restaurants charge 5% gst and ac restaurants charge 18% gst. Maybe that could be the case. Was the other one non-ac",
        "*Main to ice cream nahi khaati jeeeee*",
        "Don't forget the GST on Health Insurance is 18%",
        "No. \n\nAll 36 goes to the government one way or the other. What are you even saying above man?",
        "bro let me explain you how gst works for a resraurant owner so when they cross the turnover limit of 20 lakhs they have 2 options of gst to opt for either 5% or 18% but when you chose 5% you get no itc(input tax credit) basically get to cut off the amount of gst he paid while purchasing under the restaurant name where gst is applied but with 5% you get no itc meaning you have to pay your entire 5% gst",
        "GST on cars below 4 meters is 28%, however if the car is more than 4 meters long then GST is 40% if I'm not wrong.",
        "And Nirmala is not even elected. She is from Rajya Sabha. Hence, the farty attitude.",
        "The GST rates for restaurants serving food and beverages are 5% for non-air-conditioned restaurants and 18% for air-conditioned restaurants. Additionally, the GST rate is 18% for restaurants serving alcoholic beverages",
        "I wish to do so though, only if weren't getting this costly while at the same time also having shirnkflation",
        "yup GST varies on car types. for ev i guess it is 5% but i am saying in general.",
        "yup GST varies on car types. for ev i guess it is 5% but i am saying in general.",
        "eh just the same doesn't change the fact that the elected ones aren't any better",
        "I think OP is asking *how* does it work, i.e. based on what frameworks does the Finance Ministry decide these slabs?",
        "GST on ice creams is 18%(specifically ice creams), whereas coffee generally comes under food is charged 5% simple as that",
        "You don't know me!",
        "In life, understand the difference between dal-chawal and biriyani...",
        "The EV benefit ends this year. Same rules as normal cars.",
        "I've explained as much as I can in a Reddit comment. Please look up on Google how input tax credit works in case you need further understanding.",
        "Now some schmuck will come and justify that by saying these are high ticket expenditures so the tax % is supposed to be lower.\n\n\nPoint is, only ultra rich can afford these high ticket stuff, plus ALL OF IT IS LUXURY, and they still have tonnes of money to afford it in first place, while  the stuff with high tax % are essential goods and the people buying them come from poor families as well.\n\n\nIf you're sensible, even a tiny % increase in high ticket luxury expenditures can offset some % decrease on essential goods. But then how will they serve their billionaire underlords and this also helps them with poor as they have to be dependent on the govt, which, they then advertise like they're doing some God's work.",
        "You pay 18 GST on input. \nYou pay 18 GST on (36-18).\nUltimate the government does get 36.\nYou ultimately paid 36 too.",
        "Not technology, religion. \n\n\nTechnology just aids to it.",
        "I didn't say the government gets less. I simply said that in one case the restaurant pays whole of what it charges from you and in another case it pays part of it. That's the difference between whether or not input tax credit is available.\n\nThat's it, that was the whole of my point. Nothing with regards to how much the government gets.",
        "Coz both are different products and have different rates",
        "GST on Coffee is 5% and any other beverage is 18%",
        "GST is applied on food items based on different tax slabs. Coffee is taxed lower whereas packed beverages are taxed higher. So this doesn't pertain to outlets but rather the item in question.",
        "Yep! Welcome to the Clusterfuck that is GST. We make croissants at a central kitchen and send it to two units - one is a \"bakery\" and the other is a \"restaurant\". At the bakery, we have to charge 18% GST whereas at the restaurant, its a flat 5%. Someone had mentioned that the tax slabs vary because of the nature of the beverage and while that is true, it could also be because of how the establishment is presented to the GST council.",
        "Yes",
        "But that 5% is on seat sharing helicopter service, not on buying helicopter.",
        "Because tax on ice cream is high. Reduce it and see daily consumption sky rocket  /s",
        "Ya that's why I had written the word normal person in my comment",
        "BRB going to get a heli for myself",
        "Shit country",
        "both.",
        "I tried searching, but couldn't find the tax on helicopter purchase. Can you share some link please?",
        "[here you go](https://charteredonline.in/gst-on-helicopter-purchase/)",
        "The variation in GST rates between OFFEE WORLD and KEVENTERS can be attributed to the different tax slabs applicable to food and beverages in India. The GST Council has categorized food items into different tax slabs, ranging from 0% to 28%.In this case, the 5% GST rate applicable to OFFEE WORLD likely pertains to the supply of food and beverages, such as coffee, that are not served in a restaurant or are sold as takeaways. On the other hand, KEVENTERS, being a restaurant or an eatery, attracts a higher GST rate of 18% for its products, such as waffles, shakes, and sundaes.The barista's explanation that the GST rate varies with the product is accurate. Different products have different GST rates. For instance, food items like milkshakes and sundaes may attract a higher GST rate, while packaged food items like cookies or chocolates may attract a lower rate.",
        "XD Thank you so much!",
        ">rich keeps on getting more power and control over the population with technology.\n\nThat is why Ladki Bahin happened? Free money for poor, taken from taxes that are majorly paid by the rich. Because 'rich keeps on getting more power and control'",
        ">Coffee has a GST of 5% while ice cream has a GST of 18%, hence your bills have different rates.\n\nThe difference lies in whether the food is freshly prepared or it is pre-made. Freshly made food means it is a restaurant, and restaurants have 5% GST with no input credit available. Ice cream is pre-made in a factory and just sold in the outlet / shop. So 18% GST is applicable on it, with input credit available.",
        "Sanitary pads carry 18% and the loudspeaker used to hide the hike was the pad man movie."
    ],
    "cleaned_text": "gst percentage vary across franchises coffee worlds parent company keventers gst percentage whereas keventers gst vary much ps ordered coffee coffee world sundae keventers asked barista told varies product ie waffles shakes sundaes etc exactly work like ",
    "cleaned_title": "gst percentage vary across franchises",
    "cleaned_selftext": "coffee worlds parent company keventers gst percentage whereas keventers gst vary much ps ordered coffee coffee world sundae keventers asked barista told varies product ie waffles shakes sundaes etc exactly work like",
    "cleaned_comments": "variety gst slabs varying gst applicable item varies according coffee gst ice cream gst hence bills different rates purchased would got bill would one line item another coffee taxed ice cream taxed basically hotel lobby powerful different items thing businessman tamil nadu asked directly fm said even ca gets confused later apologized question tbh much ask nirmala tai provision gst go upto pray god maximum pleasure frap sounds right later apologized question like forcedbullied apologising simple genuine question applicable luxury sin items part lol many people drink coffee daily twice normal person eats ice cream daily ice cream luxury stick adulterated milk know coffee staple bruh ice cream slabs disaster im pretty sure business owner asked raised similar point fm apologise later beverage useless item gst good health moreover income goes foreign counties drink fresh juices make fruit fizz home lmao applies basic cars also cigarettes alcohol taxed gst logic luxury quotes reason said part well restaurants gst order might restaurant instead retail store selling gst needs kept mind though restaurants dont get input credit collect goes government retail store charging get input credit deposit part tax collected government remaining adjusted gst paid suppliers restaurant sells goods worth charges gst goes government retail store sells goods worth charges gst used input worth paid gst goes government reason restaurant gst rate lower coffee daily need people apparently cant live without please dont give anymore ideas go still people use would happiest person even guilty pleasure restaurant part hotel certain number rooms gst charged instead also depends served restaurant home town two adjacent areas one nonac another ac billing counters food comes common kitchen menu common based seated served would different percentage gst hotels gst differential issue govt allowed either without itc itc differential optionshttpscleartaxinsimpactgstfoodservicesrestaurantbusiness thats difference gstin also different bill single entity providing different items gst applicable state franchise person applicable product broad classification like food beverages old model new model individual items taxed various rates super confusing tbh whats gst ice cream made restaurant even ice cream called frozen dessert happens buy big box amul serve scoops customers fm answer government randomly picks stuff updates slab vatexcise gst lower however still stuck wik gst compensatory cess keeping total tax supposed years back state fms asked funds post covid council decided keep till hope goes away state fms wil cry make continue making immortal cess gst car upto including cess suv gst helicopters recently cut tax helicopter rides poor people suffering put gst ice cream gst goldthey put gst ac gst diamonds put gst corn computers tooth paste toiletries hair oil pasta soup gst imitation jewelry put gst mobiles ghee butter almonds fruits fruit juice jam chutney jelly non industrial diamonds breakpads gst scooty separate hsn code every product gst sac code services look code product service google check taxability like example icecream hsn code google youll get taxability laughing matter demonstrates voice people doesnt matter long elected dumbfucks feel good love humblebrag management structuralization gst collection done state central government gone toss maybe one reasons central government doesnt like show returns collected absolute clusterfuck defending dumbass yea ciggys already taxed dont jinx century thats luxury shouldnt could cos beverage nope case rcm case different hsn codes please dont misguide talking composition scheme reason difference hsn code reason restaurants two options gst filing one flat percent transactions cant claim gst returns items varied gst rates file gst returns since complicated small restaurants go flat rate big chains go latter model since file gst returns turn profitable pleasure pe tax jyada lagta hai laate khaane waalon pe sarkar taras kar leti hai anything made housecoffee case classified restaurant service attracting gst anything packaged manufactured standardised way ice cream classified good varied rate depending hsn regular people simple brains simply cant fathom complexities reasons great person like nimmi ji made decision asked questions lol surprising mla give tons benefits including wage increase accommodate cost living comes public bet never gon na happen hope people would revolt way gon na happen rich keeps getting power control population technology mean nirmala forced apologize recorded released video online nonac restaurants charge gst ac restaurants charge gst maybe could case one nonac main ice cream nahi khaati jeeeee dont forget gst health insurance goes government one way even saying man bro let explain gst works resraurant owner cross turnover limit lakhs options gst opt either chose get itcinput tax credit basically get cut amount gst paid purchasing restaurant name gst applied get itc meaning pay entire gst gst cars meters however car meters long gst im wrong nirmala even elected rajya sabha hence farty attitude gst rates restaurants serving food beverages nonairconditioned restaurants airconditioned restaurants additionally gst rate restaurants serving alcoholic beverages wish though werent getting costly time also shirnkflation yup gst varies car types ev guess saying general yup gst varies car types ev guess saying general eh doesnt change fact elected ones arent better think op asking work ie based frameworks finance ministry decide slabs gst ice creams specifically ice creams whereas coffee generally comes food charged simple dont know life understand difference dalchawal biriyani ev benefit ends year rules normal cars ive explained much reddit comment please look google input tax credit works case need understanding schmuck come justify saying high ticket expenditures tax supposed lower point ultra rich afford high ticket stuff plus luxury still tonnes money afford first place stuff high tax essential goods people buying come poor families well youre sensible even tiny increase high ticket luxury expenditures offset decrease essential goods serve billionaire underlords also helps poor dependent govt advertise like theyre gods work pay gst input pay gst ultimate government get ultimately paid technology religion technology aids didnt say government gets less simply said one case restaurant pays whole charges another case pays part thats difference whether input tax credit available thats whole point nothing regards much government gets coz different products different rates gst coffee beverage gst applied food items based different tax slabs coffee taxed lower whereas packed beverages taxed higher doesnt pertain outlets rather item question yep welcome clusterfuck gst make croissants central kitchen send two units one bakery restaurant bakery charge gst whereas restaurant flat someone mentioned tax slabs vary nature beverage true could also establishment presented gst council yes seat sharing helicopter service buying helicopter tax ice cream high reduce see daily consumption sky rocket ya thats written word normal person comment brb going get heli shit country tried searching couldnt find tax helicopter purchase share link please gohttpscharteredonlineingstonhelicopterpurchase variation gst rates offee world keventers attributed different tax slabs applicable food beverages india gst council categorized food items different tax slabs ranging case gst rate applicable offee world likely pertains supply food beverages coffee served restaurant sold takeaways hand keventers restaurant eatery attracts higher gst rate products waffles shakes sundaesthe baristas explanation gst rate varies product accurate different products different gst rates instance food items like milkshakes sundaes may attract higher gst rate packaged food items like cookies chocolates may attract lower rate xd thank much rich keeps getting power control population technology ladki bahin happened free money poor taken taxes majorly paid rich rich keeps getting power control coffee gst ice cream gst hence bills different rates difference lies whether food freshly prepared premade freshly made food means restaurant restaurants gst input credit available ice cream premade factory sold outlet shop gst applicable input credit available sanitary pads carry loudspeaker used hide hike pad man movie",
    "light_cleaned_title": "How does the GST percentage vary across franchises?",
    "light_cleaned_selftext": "COFFEE WORLD’s parent company is KEVENTERS and the GST percentage is 5% here whereas in KEVENTERS, its 18%! How does the GST vary that much? PS: I ordered coffee from COFFEE WORLD and sundae from KEVENTERS. I asked the barista and he told me that it varies with the product, i.e., waffles, shakes, sundaes, etc. How exactly does it work like that?",
    "light_cleaned_comments": "We have a variety of GST slabs, varying from 0.3% to 28%, and the GST is applicable on the item and varies according to that. Coffee has a GST of 5% while ice cream has a GST of 18%, hence your bills have different rates. If you had purchased both, you would have got a bill which would have one line item at 5% and another at 18%. Coffee taxed at 5% and Ice Cream taxed at 18% basically hotel lobby is more powerful Different items For this same thing, a businessman in Tamil Nadu had asked directly to our FM. He said that even his C.A. gets confused. Later he apologized for the question. Tbh 28% is too much We should ask Nirmala Tai about that There is provision in gst where it can go upto 40% pray to god 28 to be maximum Pleasure at 18%, frap at 5% sounds about right. > Later he apologized for the question. More like, he was forced/bullied into apologising for a very simple and genuine question Only applicable on 'luxury' and sin items for the most part. Lol many people drink coffee daily once or twice No normal person eats ice cream daily Ice cream is a luxury, you should stick to adulterated milk. - you know who Coffee is staple bruh, ice cream is not The slabs are a disaster. I’m pretty sure a business owner asked raised a similar point with the FM only to have to apologise later. Beverage is Useless item should have 50% GST it's not good for health moreover Income goes to foreign counties, Drink fresh Juices or make fruit Fizz at home Lmao Applies to basic cars also Cigarettes and alcohol should be taxed at 100% GST then by your logic. Luxury is in quotes for a reason and I said 'for the most part as well'. Restaurants have 5% GST. The other order might not be restaurant, instead be a retail store only for selling, so 18% GST. It needs to be kept in mind though that restaurants don't get input credit. So if they collect 5%, all of it goes to the government. Retail store charging 18% will get input credit. So they will only deposit a part of the tax collected to the government, remaining will be adjusted against GST paid to their suppliers. So if restaurant sells goods worth 200 and charges 5% GST (₹10), ₹10 goes to the government. If a retail store sells goods worth ₹200 and charges 18% GST (₹36), and has used input worth ₹100 on which they have paid 18% GST (₹18), then it ₹18 (36-18) goes to the government. This is the reason for restaurant GST rate to be lower. Not because coffee is a daily need which people apparently can't live without. Please don't give them anymore ideas Go for 1000% still people use them, I would be the happiest person even at 100% GUILTY PLEASURE If a restaurant is part of a hotel with more than a certain number of rooms, 9% gst is charged instead of 5 It also depends on where you are being served. There is a restaurant in my home town which has two adjacent areas. One is Non-AC and another has AC and both have their own billing counters. The food comes from a common kitchen and the menu is common, but based on where you are seated and served, you would have a different percentage of GST. Hotels have a GST differential issue. Govt allowed either 5% without ITC and 18% with ITC. [Differential options](https://cleartax.in/s/impact-gst-food-services-restaurant-business) Thats why the difference. The GSTIN are also different on each bill. So its not a single entity providing this. Different items. GST is not applicable to a state or a franchise or a person. It's applicable on a product. And it's not as broad a classification like food, beverages. That was the old model. In the new model, individual items are taxed at various rates. It's super confusing tbh. What's the gst on ice cream made in the restaurant, is it even ice cream, can it be called a frozen dessert, what happens if you buy a big box of amul and serve scoops to customers - our FM has no answer for that. The government just randomly picks stuff and updates a slab. From how it was before 45-48% VAT/Excise, GST is lower at 28%. However, we are still stuck wik GST compensatory cess, which is keeping total tax at 45-48%. It was supposed to be over 2 years back, but then state FMs asked for funds post covid so the council decided to keep it till 2026. I hope it goes away, but then state FMs wil cry again to make it continue, making it an immortal cess. GST on car is 28% (upto 50% including cess for suv) and GST on helicopters is 5%. They recently cut tax for helicopter rides from 18% to 5% because poor people are suffering. They have put 18% GST for ice cream but 3% GST for Gold.They have put 28% GST for A/c and 3% GST for diamonds. They have put 18% GST for corn, computers, tooth paste, toiletries, hair oil, pasta, soup but 3% GST for imitation jewelry. They have put 12% GST for mobiles, Ghee, butter, almonds, fruits, fruit juice, jam, chutney, jelly but 0.25% for non industrial diamonds. Breakpads have 28% gst for scooty There is a separate HSN code for every product in GST and SAC code for services. You can look up for the code of product or service on google and then check about its taxability. Like for example for Ice-Cream HSN code is 2105 and if you google it, you’ll get the taxability of 18%. its not a laughing matter it just demonstrates that the voice of people doesn't matter as long as the elected dumbfucks feel good Love the #HumbleBrag The management and structuralization of the GST collection done by both the State and Central Government has gone for a toss. Maybe one of the reasons why the Central Government doesn't like to show the returns they have collected from them. What an absolute clusterfuck Not that I am defending that dumbass, but yea.. Ciggys are already taxed at > 50%. Don't jinx it to a century 🥹 Thats a luxury that you shouldn’t have Could it cos of the beverage? Nope.. this is not the case of RCM. Just a case of different HSN codes. Please don't misguide. Are you talking about Composition scheme? No, that is not the reason. Difference in HSN code should be the reason. Restaurants have two options for gst filing , one is flat 5 percent on all the transactions but you can’t claim any gst returns and in the other the items have varied gst rates where you can file gst returns since this is more complicated most of the small restaurants go for the flat rate . But big chains go for the latter model since they file gst returns and in turn is more profitable . Pleasure pe tax jyada lagta hai.. laate khaane waalon pe sarkar taras kar leti hai.. Anything that is made in house(coffee in this case) is classified as restaurant service attracting 5% gst and anything that is packaged or manufactured in a standardised way (ice cream) is classified as a good with a varied rate depending on its HSN We regular people with our simple brains simply can't fathom the the complexities and reasons why a great person like nimmi ji made such a decision. Just do as asked, no questions. Lol Not surprising, the MLA will give themselves tons of benefits including wage increase to accommodate the cost of living but when it comes to the public, you bet it's never gonna happen. I have had hope that people would revolt but there is no way it's gonna happen as the rich keeps on getting more power and control over the population with technology. You mean Nirmala forced him to apologize and recorded and released the video online ? non-ac restaurants charge 5% gst and ac restaurants charge 18% gst. Maybe that could be the case. Was the other one non-ac *Main to ice cream nahi khaati jeeeee* Don't forget the GST on Health Insurance is 18% No. All 36 goes to the government one way or the other. What are you even saying above man? bro let me explain you how gst works for a resraurant owner so when they cross the turnover limit of 20 lakhs they have 2 options of gst to opt for either 5% or 18% but when you chose 5% you get no itc(input tax credit) basically get to cut off the amount of gst he paid while purchasing under the restaurant name where gst is applied but with 5% you get no itc meaning you have to pay your entire 5% gst GST on cars below 4 meters is 28%, however if the car is more than 4 meters long then GST is 40% if I'm not wrong. And Nirmala is not even elected. She is from Rajya Sabha. Hence, the farty attitude. The GST rates for restaurants serving food and beverages are 5% for non-air-conditioned restaurants and 18% for air-conditioned restaurants. Additionally, the GST rate is 18% for restaurants serving alcoholic beverages I wish to do so though, only if weren't getting this costly while at the same time also having shirnkflation yup GST varies on car types. for ev i guess it is 5% but i am saying in general. yup GST varies on car types. for ev i guess it is 5% but i am saying in general. eh just the same doesn't change the fact that the elected ones aren't any better I think OP is asking *how* does it work, i.e. based on what frameworks does the Finance Ministry decide these slabs? GST on ice creams is 18%(specifically ice creams), whereas coffee generally comes under food is charged 5% simple as that You don't know me! In life, understand the difference between dal-chawal and biriyani... The EV benefit ends this year. Same rules as normal cars. I've explained as much as I can in a Reddit comment. Please look up on Google how input tax credit works in case you need further understanding. Now some schmuck will come and justify that by saying these are high ticket expenditures so the tax % is supposed to be lower. Point is, only ultra rich can afford these high ticket stuff, plus ALL OF IT IS LUXURY, and they still have tonnes of money to afford it in first place, while the stuff with high tax % are essential goods and the people buying them come from poor families as well. If you're sensible, even a tiny % increase in high ticket luxury expenditures can offset some % decrease on essential goods. But then how will they serve their billionaire underlords and this also helps them with poor as they have to be dependent on the govt, which, they then advertise like they're doing some God's work. You pay 18 GST on input. You pay 18 GST on (36-18). Ultimate the government does get 36. You ultimately paid 36 too. Not technology, religion. Technology just aids to it. I didn't say the government gets less. I simply said that in one case the restaurant pays whole of what it charges from you and in another case it pays part of it. That's the difference between whether or not input tax credit is available. That's it, that was the whole of my point. Nothing with regards to how much the government gets. Coz both are different products and have different rates GST on Coffee is 5% and any other beverage is 18% GST is applied on food items based on different tax slabs. Coffee is taxed lower whereas packed beverages are taxed higher. So this doesn't pertain to outlets but rather the item in question. Yep! Welcome to the Clusterfuck that is GST. We make croissants at a central kitchen and send it to two units - one is a \"bakery\" and the other is a \"restaurant\". At the bakery, we have to charge 18% GST whereas at the restaurant, its a flat 5%. Someone had mentioned that the tax slabs vary because of the nature of the beverage and while that is true, it could also be because of how the establishment is presented to the GST council. Yes But that 5% is on seat sharing helicopter service, not on buying helicopter. Because tax on ice cream is high. Reduce it and see daily consumption sky rocket /s Ya that's why I had written the word normal person in my comment BRB going to get a heli for myself Shit country both. I tried searching, but couldn't find the tax on helicopter purchase. Can you share some link please? [here you go](https://charteredonline.in/gst-on-helicopter-purchase/) The variation in GST rates between OFFEE WORLD and KEVENTERS can be attributed to the different tax slabs applicable to food and beverages in India. The GST Council has categorized food items into different tax slabs, ranging from 0% to 28%.In this case, the 5% GST rate applicable to OFFEE WORLD likely pertains to the supply of food and beverages, such as coffee, that are not served in a restaurant or are sold as takeaways. On the other hand, KEVENTERS, being a restaurant or an eatery, attracts a higher GST rate of 18% for its products, such as waffles, shakes, and sundaes.The barista's explanation that the GST rate varies with the product is accurate. Different products have different GST rates. For instance, food items like milkshakes and sundaes may attract a higher GST rate, while packaged food items like cookies or chocolates may attract a lower rate. XD Thank you so much! >rich keeps on getting more power and control over the population with technology. That is why Ladki Bahin happened? Free money for poor, taken from taxes that are majorly paid by the rich. Because 'rich keeps on getting more power and control' >Coffee has a GST of 5% while ice cream has a GST of 18%, hence your bills have different rates. The difference lies in whether the food is freshly prepared or it is pre-made. Freshly made food means it is a restaurant, and restaurants have 5% GST with no input credit available. Ice cream is pre-made in a factory and just sold in the outlet / shop. So 18% GST is applicable on it, with input credit available. Sanitary pads carry 18% and the loudspeaker used to hide the hike was the pad man movie."
}