{
    "id": "18pzyf8",
    "title": "Rat miners refuse to encash 'inadequate' prize cheques",
    "url": "https://m.rediff.com/news/report/rat-miners-refuse-to-encash-inadequate-prize-cheques/20231223.htm",
    "selftext": "How greedy someone can be, I mean they tried getting machinery worth crores for the operation but only willing to shell peanuts after a successful rescue by the miners.",
    "flair": "Politics",
    "score": 255,
    "num_comments": 20,
    "created_utc": 1703439926.0,
    "convurl": "https://external-preview.redd.it/DAxhLNeaE2j--yBF_cvW8KOflIek6Q9bw8xxYjWaLXM.jpg?auto=webp&s=83d018709be2564e15be42afa842d4fba2d0807c",
    "comments": [
        "Rofl.. Their default reaction is to be douche bags.. It's the natural instinct of the Sanghi to be a douche as many times as possible in any given situation..  \n\nYou can't tell me someone senior wasn't involved in the ammount to be given to the real heroes of the rescue.. If Adani did it they would have given him the entire mountain range as a thank you. \n\nNot to mention how they seem to love rewarding rapists.",
        "Bridge collapsed some time back , no action taken .\nTunnel collapsed , no action taken , insulting these guys with a paltry sum and no real recognition.  \n\nMedia has really sold it soul to G , if this was done by any other govt it would have been on news every bloody day .",
        "Agreed",
        "Peeple live rings true even today.",
        "theres no value of life as well as valor. sirf siachen par hi ladai nahi hoti hai..there is fight for survival everyday",
        "Garlands and parties for rapists, paltry cheques for rescuers, sleeping on roads for Olympics medalists and masala dosa and coffee for sending a probe on the moon.\n\nGood to know where this govts priorities are.",
        "Amount?",
        "This is why no one helps anyone in India, when some incident happens people just walk away.\nEvery time the soul awakens to help others, we are more hurt. Rat miners shouldn’t have helped, govt should have just given an award and not humiliated by paltry cash",
        "50k.",
        "What do you expect from a system run by cornershop banias. Thanks to the media spotlight otherwise they wouldn't have even tried to save those stuck.",
        "I was told by BJP bhakts that this is the first time they are lives being valued in India. The PM office spared no expense in ordering experts and machineries from around the world",
        "meanwhile where those extra unspent crores in PM Cares scam gonna be used nexr year?",
        "You're only slightly off about the media. They've literally sold themselves to be official mouthpieces. We have almost no credible independent media left.",
        ">Garlands and parties for rapists\n\nSo aren't they human they also deserve parties imagine you meet your friend after a long time and he doesnt give you party, how bad will you feel\n\n>paltry cheques for rescuers,\n\nCan't even help your fellow brothers, Jana gana mana wasted\n\n>sleeping on roads for Olympics medalists\n\nSo you want us to make them weak by giving them luxury.\n\n>masala dosa and coffee for sending a probe on the moon.\n\nCoffee has caffeine so it gives them boost and dosa has protein so they don't lose muscles.",
        "I know this is sarcasm. But you're not far away from the arguments made by the government sympathisers",
        "Govt be like good don't encash then... We saved 50k 🗿",
        "50k each for 12 miners? is that small?"
    ],
    "cleaned_text": "rat miners refuse encash inadequate prize cheques greedy someone mean tried getting machinery worth crores operation willing shell peanuts successful rescue miners ",
    "cleaned_title": "rat miners refuse encash inadequate prize cheques",
    "cleaned_selftext": "greedy someone mean tried getting machinery worth crores operation willing shell peanuts successful rescue miners",
    "cleaned_comments": "rofl default reaction douche bags natural instinct sanghi douche many times possible given situation cant tell someone senior wasnt involved ammount given real heroes rescue adani would given entire mountain range thank mention seem love rewarding rapists bridge collapsed time back action taken tunnel collapsed action taken insulting guys paltry sum real recognition media really sold soul g done govt would news every bloody day agreed peeple live rings true even today theres value life well valor sirf siachen par hi ladai nahi hoti haithere fight survival everyday garlands parties rapists paltry cheques rescuers sleeping roads olympics medalists masala dosa coffee sending probe moon good know govts priorities amount one helps anyone india incident happens people walk away every time soul awakens help others hurt rat miners shouldnt helped govt given award humiliated paltry cash k expect system run cornershop banias thanks media spotlight otherwise wouldnt even tried save stuck told bjp bhakts first time lives valued india pm office spared expense ordering experts machineries around world meanwhile extra unspent crores pm cares scam gon na used nexr year youre slightly media theyve literally sold official mouthpieces almost credible independent media left garlands parties rapists arent human also deserve parties imagine meet friend long time doesnt give party bad feel paltry cheques rescuers cant even help fellow brothers jana gana mana wasted sleeping roads olympics medalists want us make weak giving luxury masala dosa coffee sending probe moon coffee caffeine gives boost dosa protein dont lose muscles know sarcasm youre far away arguments made government sympathisers govt like good dont encash saved k k miners small",
    "light_cleaned_title": "Rat miners refuse to encash 'inadequate' prize cheques",
    "light_cleaned_selftext": "How greedy someone can be, I mean they tried getting machinery worth crores for the operation but only willing to shell peanuts after a successful rescue by the miners.",
    "light_cleaned_comments": "Rofl.. Their default reaction is to be douche bags.. It's the natural instinct of the Sanghi to be a douche as many times as possible in any given situation.. You can't tell me someone senior wasn't involved in the ammount to be given to the real heroes of the rescue.. If Adani did it they would have given him the entire mountain range as a thank you. Not to mention how they seem to love rewarding rapists. Bridge collapsed some time back , no action taken . Tunnel collapsed , no action taken , insulting these guys with a paltry sum and no real recognition. Media has really sold it soul to G , if this was done by any other govt it would have been on news every bloody day . Agreed Peeple live rings true even today. theres no value of life as well as valor. sirf siachen par hi ladai nahi hoti hai..there is fight for survival everyday Garlands and parties for rapists, paltry cheques for rescuers, sleeping on roads for Olympics medalists and masala dosa and coffee for sending a probe on the moon. Good to know where this govts priorities are. Amount? This is why no one helps anyone in India, when some incident happens people just walk away. Every time the soul awakens to help others, we are more hurt. Rat miners shouldn’t have helped, govt should have just given an award and not humiliated by paltry cash 50k. What do you expect from a system run by cornershop banias. Thanks to the media spotlight otherwise they wouldn't have even tried to save those stuck. I was told by BJP bhakts that this is the first time they are lives being valued in India. The PM office spared no expense in ordering experts and machineries from around the world meanwhile where those extra unspent crores in PM Cares scam gonna be used nexr year? You're only slightly off about the media. They've literally sold themselves to be official mouthpieces. We have almost no credible independent media left. >Garlands and parties for rapists So aren't they human they also deserve parties imagine you meet your friend after a long time and he doesnt give you party, how bad will you feel >paltry cheques for rescuers, Can't even help your fellow brothers, Jana gana mana wasted >sleeping on roads for Olympics medalists So you want us to make them weak by giving them luxury. >masala dosa and coffee for sending a probe on the moon. Coffee has caffeine so it gives them boost and dosa has protein so they don't lose muscles. I know this is sarcasm. But you're not far away from the arguments made by the government sympathisers Govt be like good don't encash then... We saved 50k 🗿 50k each for 12 miners? is that small?"
}