{
    "id": "124wp2d",
    "title": "Don't buy anything from XTRACOVER.COM, it's a scam site!",
    "url": "https://www.reddit.com/gallery/124wp2d",
    "selftext": "Bought a refurbished iPhone SE 1st gen for Rs.8799. Received a pair of Vim Bars.",
    "flair": "Rant / Vent",
    "score": 117,
    "num_comments": 45,
    "created_utc": 1680025913,
    "convurl": "https://i.redd.it/vz3pba02qiqa1.jpg",
    "comments": [
        "How do you come across such beautiful websites?",
        "I know, should have been more careful. This post is in case if someone searches for more info on this website before buying on reddit.",
        "koi naa kuch toh mila \n\n\\*ab ja ke mummy ko dede",
        "Based website 🤗",
        "You don't say...",
        "They clean out your wallet and the utensils",
        "Ngl bro, this one is on ya. Like you really fell for such a shady site over a deal that literally sounds as pure fkn scam?\n\nAnd, you even paid 8k for this, tf man. You could get a decent Android smartphone in that price from Amazon.",
        "I thought it was some new condum brand",
        "Remember everyone. If it sounds too good to me true, it most likely is a scam.",
        "Its an iPhone SE 1st gen 2016. The price of those go even lower. I already use a 12 mini, this was bought as a backup in case my main phone goes for service sometime.",
        "Good lesson for op . He is one of those who fell for video with titles \"  download gta 5 in Android at size of 2 MB \" .\nBut still fk the scammers always . Our country is infamous for scamming around the world . But i believe the more the people will be wise ,the less scam will happen . \nI hope u learnt your lesson and maybe find a way to catch these scammers.",
        "&gt;XTRACOVER.COM\n\nIts obvious just from the name.",
        "Yeah",
        "why do you want to visit these sites?",
        "XTRACOVER  name gives away their creative knowledge. \nAlso, just checked that their website has mixed reviews and some YouTuber has also did a review of their product (I didn’t watch it). By there are a lot of other red flags. \n\nOP, try getting in touch with their management. The idea is a crap but you don’t have any other options. But I can seen sh*t load of red flags just by searching them on Google. You get a lesson worth 8k which can save you 800k in future.",
        "I mean it was obviously my mistake i didn't check anything on them just because i was looking for a cheap backup phone that i was not really planning on using. The price looked legit for a 7 year old phone model. But yes, lesson learnt.",
        "8k sounds like a cheap lesson you got. Now you know that if something's too good to be true. It's not. Sad that you learned it the hard way.",
        "———————————No Iphone?———————————\n⠀⣞⢽⢪⢣⢣⢣⢫⡺⡵⣝⡮⣗⢷⢽⢽⢽⣮⡷⡽⣜⣜⢮⢺⣜⢷⢽⢝⡽⣝\n⠸⡸⠜⠕⠕⠁⢁⢇⢏⢽⢺⣪⡳⡝⣎⣏⢯⢞⡿⣟⣷⣳⢯⡷⣽⢽⢯⣳⣫⠇\n⠀⠀⢀⢀⢄⢬⢪⡪⡎⣆⡈⠚⠜⠕⠇⠗⠝⢕⢯⢫⣞⣯⣿⣻⡽⣏⢗⣗⠏⠀\n⠀⠪⡪⡪⣪⢪⢺⢸⢢⢓⢆⢤⢀⠀⠀⠀⠀⠈⢊⢞⡾⣿⡯⣏⢮⠷⠁⠀⠀\n⠀⠀⠀⠈⠊⠆⡃⠕⢕⢇⢇⢇⢇⢇⢏⢎⢎⢆⢄⠀⢑⣽⣿⢝⠲⠉⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⡿⠂⠠⠀⡇⢇⠕⢈⣀⠀⠁⠡⠣⡣⡫⣂⣿⠯⢪⠰⠂⠀⠀⠀⠀\n⠀⠀⠀⠀⡦⡙⡂⢀⢤⢣⠣⡈⣾⡃⠠⠄⠀⡄⢱⣌⣶⢏⢊⠂⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⢝⡲⣜⡮⡏⢎⢌⢂⠙⠢⠐⢀⢘⢵⣽⣿⡿⠁⠁⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠨⣺⡺⡕⡕⡱⡑⡆⡕⡅⡕⡜⡼⢽⡻⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⣼⣳⣫⣾⣵⣗⡵⡱⡡⢣⢑⢕⢜⢕⡝⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⣴⣿⣾⣿⣿⣿⡿⡽⡑⢌⠪⡢⡣⣣⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⡟⡾⣿⢿⢿⢵⣽⣾⣼⣘⢸⢸⣞⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠁⠇⠡⠩⡫⢿⣝⡻⡮⣒⢽⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n—————————————————————————————",
        "Report on consumer court online",
        "Got a lot of extra cover tho. As promised.",
        "BAHAHAAHAHAHAHA",
        "By using Xtracover.com you made a sillypoint.",
        "I don't get this actually. Why do people buy such old iPhones? If you're not able to buy current gen iPhones please buy new Androids, they're way better value for money. Buying a 7 year old phone just because it's an iPhone is not a good purchase.",
        "I'm actually surprised OP even got anything delivered. I would've thought these scam sites ghost customers soon after getting the money",
        "the se costs 30k on flipkart, you seriusly expected a 60% discount on that? just google before making purchase on unknown website [https://www.google.com/search?q=is+xtracover+scam&amp;sourceid=chrome](https://www.google.com/search?q=is+xtracover+scam&amp;sourceid=chrome)",
        "What the fuck is a “XTRACOVER.com” it looks like a porn site name Lol!",
        "How did you fall for this after reading that name?",
        "The site name is extra cover and you got a lot of extra covers. I don't see the problem here.",
        "No one is foolish enough to buy from such sites.",
        "Bruh, why does it have to be fucking Vim bars every single time. 😭",
        "But, OP did. So, \"no one\" part is thoroughly debunked by OP. ¯\\\\\\_(ツ)\\_/¯",
        "Atleast you can wash away your tears",
        "Chal bartan dhole ab.",
        "Absolutely, perfect reasoning to post it online to save others from same shit. Specially, knowing full well ridicule you gonna face. That's brave. 👍",
        "Bruh people don't even trust sites like Flipkart these days. Regardless, file a chargeback and file a formal complaint against the company.",
        "But don’t we have an option to backtrack the money ? With whom OP did transaction from which source to which source money got transferred and even if it was some business account I mean obviously there must some kind of tracking present because banks are involved.",
        "Reminds me of this [skit by CalebCity](https://youtu.be/IZ8X8_9fSE4)",
        "Enjoy the vim bars.",
        "Did that. Let's ee if they can do anything.",
        "Noted 👍",
        "Are to Amazon use karne ka na",
        "I think this is the handiwork of courier partners. I also bought iphone SE 2 last week from XTRACOVER.COM for ₹10,000. Order was cash on delivery. Got a proper phone within a week. And there are no issues.",
        "I bought SE2 for 10,000 last week and recieved the delivery.",
        "How?",
        "I bought it from the same website that the OP bought his iphone from. Except I got proper working mobile. XTRACOVER.COM",
        "Why are they selling for 10k? Defective? Stolen?",
        "All refurbished phones. But it was a perfect deal for me since I only needed an apple device to create apple tv account.",
        "Huh ? ive  bought a P3 XL last year & a P4a a few months ago. Worked flawlessly both times"
    ],
    "cleaned_text": "dont buy anything xtracovercom scam site bought refurbished iphone se st gen rs received pair vim bars ",
    "cleaned_title": "dont buy anything xtracovercom scam site",
    "cleaned_selftext": "bought refurbished iphone se st gen rs received pair vim bars",
    "cleaned_comments": "come across beautiful websites know careful post case someone searches info website buying reddit koi naa kuch toh mila ab ja ke mummy ko dede based website dont say clean wallet utensils ngl bro one ya like really fell shady site deal literally sounds pure fkn scam even paid k tf man could get decent android smartphone price amazon thought new condum brand remember everyone sounds good true likely scam iphone se st gen price go even lower already use mini bought backup case main phone goes service sometime good lesson op one fell video titles download gta android size mb still fk scammers always country infamous scamming around world believe people wise less scam happen hope u learnt lesson maybe find way catch scammers gtxtracovercom obvious name yeah want visit sites xtracover name gives away creative knowledge also checked website mixed reviews youtuber also review product didnt watch lot red flags op try getting touch management idea crap dont options seen sht load red flags searching google get lesson worth k save k future mean obviously mistake didnt check anything looking cheap backup phone really planning using price looked legit year old phone model yes lesson learnt k sounds like cheap lesson got know somethings good true sad learned hard way iphone report consumer court online got lot extra cover tho promised bahahaahahahaha using xtracovercom made sillypoint dont get actually people buy old iphones youre able buy current gen iphones please buy new androids theyre way better value money buying year old phone iphone good purchase im actually surprised op even got anything delivered wouldve thought scam sites ghost customers soon getting money se costs k flipkart seriusly expected discount google making purchase unknown website httpswwwgooglecomsearchqisxtracoverscamampsourceidchromehttpswwwgooglecomsearchqisxtracoverscamampsourceidchrome fuck xtracovercom looks like porn site name lol fall reading name site name extra cover got lot extra covers dont see problem one foolish enough buy sites bruh fucking vim bars every single time op one part thoroughly debunked op atleast wash away tears chal bartan dhole ab absolutely perfect reasoning post online save others shit specially knowing full well ridicule gon na face thats brave bruh people dont even trust sites like flipkart days regardless file chargeback file formal complaint company dont option backtrack money op transaction source source money got transferred even business account mean obviously must kind tracking present banks involved reminds skit calebcityhttpsyoutubeizxfse enjoy vim bars lets ee anything noted amazon use karne ka na think handiwork courier partners also bought iphone se last week xtracovercom order cash delivery got proper phone within week issues bought se last week recieved delivery bought website op bought iphone except got proper working mobile xtracovercom selling k defective stolen refurbished phones perfect deal since needed apple device create apple tv account huh ive bought p xl last year pa months ago worked flawlessly times",
    "light_cleaned_title": "Don't buy anything from XTRACOVER.COM, it's a scam site!",
    "light_cleaned_selftext": "Bought a refurbished iPhone SE 1st gen for Rs.8799. Received a pair of Vim Bars.",
    "light_cleaned_comments": "How do you come across such beautiful websites? I know, should have been more careful. This post is in case if someone searches for more info on this website before buying on reddit. koi naa kuch toh mila \\*ab ja ke mummy ko dede Based website 🤗 You don't say... They clean out your wallet and the utensils Ngl bro, this one is on ya. Like you really fell for such a shady site over a deal that literally sounds as pure fkn scam? And, you even paid 8k for this, tf man. You could get a decent Android smartphone in that price from Amazon. I thought it was some new condum brand Remember everyone. If it sounds too good to me true, it most likely is a scam. Its an iPhone SE 1st gen 2016. The price of those go even lower. I already use a 12 mini, this was bought as a backup in case my main phone goes for service sometime. Good lesson for op . He is one of those who fell for video with titles \" download gta 5 in Android at size of 2 MB \" . But still fk the scammers always . Our country is infamous for scamming around the world . But i believe the more the people will be wise ,the less scam will happen . I hope u learnt your lesson and maybe find a way to catch these scammers. &gt;XTRACOVER.COM Its obvious just from the name. Yeah why do you want to visit these sites? XTRACOVER name gives away their creative knowledge. Also, just checked that their website has mixed reviews and some YouTuber has also did a review of their product (I didn’t watch it). By there are a lot of other red flags. OP, try getting in touch with their management. The idea is a crap but you don’t have any other options. But I can seen sh*t load of red flags just by searching them on Google. You get a lesson worth 8k which can save you 800k in future. I mean it was obviously my mistake i didn't check anything on them just because i was looking for a cheap backup phone that i was not really planning on using. The price looked legit for a 7 year old phone model. But yes, lesson learnt. 8k sounds like a cheap lesson you got. Now you know that if something's too good to be true. It's not. Sad that you learned it the hard way. ———————————No Iphone?——————————— ⠀⣞⢽⢪⢣⢣⢣⢫⡺⡵⣝⡮⣗⢷⢽⢽⢽⣮⡷⡽⣜⣜⢮⢺⣜⢷⢽⢝⡽⣝ ⠸⡸⠜⠕⠕⠁⢁⢇⢏⢽⢺⣪⡳⡝⣎⣏⢯⢞⡿⣟⣷⣳⢯⡷⣽⢽⢯⣳⣫⠇ ⠀⠀⢀⢀⢄⢬⢪⡪⡎⣆⡈⠚⠜⠕⠇⠗⠝⢕⢯⢫⣞⣯⣿⣻⡽⣏⢗⣗⠏⠀ ⠀⠪⡪⡪⣪⢪⢺⢸⢢⢓⢆⢤⢀⠀⠀⠀⠀⠈⢊⢞⡾⣿⡯⣏⢮⠷⠁⠀⠀ ⠀⠀⠀⠈⠊⠆⡃⠕⢕⢇⢇⢇⢇⢇⢏⢎⢎⢆⢄⠀⢑⣽⣿⢝⠲⠉⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⡿⠂⠠⠀⡇⢇⠕⢈⣀⠀⠁⠡⠣⡣⡫⣂⣿⠯⢪⠰⠂⠀⠀⠀⠀ ⠀⠀⠀⠀⡦⡙⡂⢀⢤⢣⠣⡈⣾⡃⠠⠄⠀⡄⢱⣌⣶⢏⢊⠂⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢝⡲⣜⡮⡏⢎⢌⢂⠙⠢⠐⢀⢘⢵⣽⣿⡿⠁⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠨⣺⡺⡕⡕⡱⡑⡆⡕⡅⡕⡜⡼⢽⡻⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣼⣳⣫⣾⣵⣗⡵⡱⡡⢣⢑⢕⢜⢕⡝⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⣴⣿⣾⣿⣿⣿⡿⡽⡑⢌⠪⡢⡣⣣⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⡟⡾⣿⢿⢿⢵⣽⣾⣼⣘⢸⢸⣞⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠁⠇⠡⠩⡫⢿⣝⡻⡮⣒⢽⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ————————————————————————————— Report on consumer court online Got a lot of extra cover tho. As promised. BAHAHAAHAHAHAHA By using Xtracover.com you made a sillypoint. I don't get this actually. Why do people buy such old iPhones? If you're not able to buy current gen iPhones please buy new Androids, they're way better value for money. Buying a 7 year old phone just because it's an iPhone is not a good purchase. I'm actually surprised OP even got anything delivered. I would've thought these scam sites ghost customers soon after getting the money the se costs 30k on flipkart, you seriusly expected a 60% discount on that? just google before making purchase on unknown website [https://www.google.com/search?q=is+xtracover+scam&amp;sourceid=chrome](https://www.google.com/search?q=is+xtracover+scam&amp;sourceid=chrome) What the fuck is a “XTRACOVER.com” it looks like a porn site name Lol! How did you fall for this after reading that name? The site name is extra cover and you got a lot of extra covers. I don't see the problem here. No one is foolish enough to buy from such sites. Bruh, why does it have to be fucking Vim bars every single time. 😭 But, OP did. So, \"no one\" part is thoroughly debunked by OP. ¯\\\\\\_(ツ)\\_/¯ Atleast you can wash away your tears Chal bartan dhole ab. Absolutely, perfect reasoning to post it online to save others from same shit. Specially, knowing full well ridicule you gonna face. That's brave. 👍 Bruh people don't even trust sites like Flipkart these days. Regardless, file a chargeback and file a formal complaint against the company. But don’t we have an option to backtrack the money ? With whom OP did transaction from which source to which source money got transferred and even if it was some business account I mean obviously there must some kind of tracking present because banks are involved. Reminds me of this [skit by CalebCity](https://youtu.be/IZ8X8_9fSE4) Enjoy the vim bars. Did that. Let's ee if they can do anything. Noted 👍 Are to Amazon use karne ka na I think this is the handiwork of courier partners. I also bought iphone SE 2 last week from XTRACOVER.COM for ₹10,000. Order was cash on delivery. Got a proper phone within a week. And there are no issues. I bought SE2 for 10,000 last week and recieved the delivery. How? I bought it from the same website that the OP bought his iphone from. Except I got proper working mobile. XTRACOVER.COM Why are they selling for 10k? Defective? Stolen? All refurbished phones. But it was a perfect deal for me since I only needed an apple device to create apple tv account. Huh ? ive bought a P3 XL last year & a P4a a few months ago. Worked flawlessly both times"
}