{
    "id": "1fo0emk",
    "title": "Yogendra Yadav writes: One Nation One Election is a desire to cut down clutter of democratic politics",
    "url": "https://indianexpress.com/article/opinion/columns/yogendra-yadav-writes-one-nation-one-election-is-a-desire-to-cut-down-clutter-of-democratic-politics-9584686/",
    "selftext": "The world is full of clever answers in search of a genuine question. When talk of One Nation One Election (ONOE) began, it looked like a grand policy solution in search of a real problem. Either a remedy in search of a disease, or a medicine worse than the disease. It looked like a sequel to demonetisation, another brainchild of a modern-day Tughlaq’s penchant for something grand sans a vision or a blueprint.\n\nNoting the alacrity with which the present regime has gone about pushing this scheme and reading the Report on Simultaneous Elections in India of the High Level Committee (HLC), I am now convinced that One Nation One Election is not just a quixotic yet harmless fantasy. It fits into a larger political design that has been in the works for long. Originating in the middle-class fantasy to save the republic from the public and the bureaucratic quest to evacuate democracy of its popular content, this design has now fused with the rulers’ desire to tame and defang democracy.\n\nThe 281-page report (18,345 pages with annexures) is a made-to-order document whose conclusions were written into its terms of reference. Just as the RBI was asked to invent virtues of demonetisation, the HLC was designed to discover the rationale for ONOE.",
    "flair": "Policy/Economy",
    "score": 153,
    "num_comments": 22,
    "created_utc": 1727139596.0,
    "convurl": "https://external-preview.redd.it/oKErNT0rlC_A6c4SSOwd0dy4KXasp0fakF7Ki9NXryQ.jpg?auto=webp&s=41e2803d4af2e8c51a15599357c06557e5580799",
    "comments": [
        "The compulsion to discover a rationale makes for strange reading. The report claims that constant elections account for a loss of “about 300 days in an average year” in some states like Maharashtra (p.167). The ONOE would offer “equitable opportunity to political workers” (p.155) since the same leader won’t contest for MLA and MP. Not just that, ONOE would lead to “reduction in instances of hate speeches” (p.156). It would solve the problem of “voter fatigue” (pp.153-4) — a problem I never heard about in two decades of doing research on Indian elections.",
        "People who didn't study history can only come up with bullshit to support this",
        "ONOE = Oh No!",
        "Reduction in instances of hate speech?...how?",
        "Oh, they were thinking about themselves I think. Election speech to them means hate speech no 😂",
        "Depends on the implementation. Many nations across the world do it that way and it seems much cleaner.",
        "😂😂",
        "There is not a single nation on earth that is as richly diverse as India.",
        "Agreed. And how is that relevant to my comment?",
        "Well let’s see it like this Modi ji will go in campaign mode only once a five years and spare us with all the jumelas throughout the 5 years.",
        "You won't get the answer..",
        "It seems like you simply do not understand how the vast diversity could affect the systems that are built on this.",
        "Why will he stop?",
        "I dont know. It can save some money in the short term, but it has no long term effect on anything. I think it is just busy work for modi.\n\nLike DeMo, he will talk about it a lot and it will not improve anyones life.",
        "This is a gimmick. There is no way these constitutional amendments can pass when BJP has 240 seats. You need 2/3rd majority for passing these"
    ],
    "cleaned_text": "yogendra yadav writes one nation one election desire cut clutter democratic politics world full clever answers search genuine question talk one nation one election onoe began looked like grand policy solution search real problem either remedy search disease medicine worse disease looked like sequel demonetisation another brainchild modernday tughlaqs penchant something grand sans vision blueprint noting alacrity present regime gone pushing scheme reading report simultaneous elections india high level committee hlc convinced one nation one election quixotic yet harmless fantasy fits larger political design works long originating middleclass fantasy save republic public bureaucratic quest evacuate democracy popular content design fused rulers desire tame defang democracy page report pages annexures madetoorder document whose conclusions written terms reference rbi asked invent virtues demonetisation hlc designed discover rationale onoe ",
    "cleaned_title": "yogendra yadav writes one nation one election desire cut clutter democratic politics",
    "cleaned_selftext": "world full clever answers search genuine question talk one nation one election onoe began looked like grand policy solution search real problem either remedy search disease medicine worse disease looked like sequel demonetisation another brainchild modernday tughlaqs penchant something grand sans vision blueprint noting alacrity present regime gone pushing scheme reading report simultaneous elections india high level committee hlc convinced one nation one election quixotic yet harmless fantasy fits larger political design works long originating middleclass fantasy save republic public bureaucratic quest evacuate democracy popular content design fused rulers desire tame defang democracy page report pages annexures madetoorder document whose conclusions written terms reference rbi asked invent virtues demonetisation hlc designed discover rationale onoe",
    "cleaned_comments": "compulsion discover rationale makes strange reading report claims constant elections account loss days average year states like maharashtra p onoe would offer equitable opportunity political workers p since leader wont contest mla mp onoe would lead reduction instances hate speeches p would solve problem voter fatigue pp problem never heard two decades research indian elections people didnt study history come bullshit support onoe oh reduction instances hate speechhow oh thinking think election speech means hate speech depends implementation many nations across world way seems much cleaner single nation earth richly diverse india agreed relevant comment well lets see like modi ji go campaign mode five years spare us jumelas throughout years wont get answer seems like simply understand vast diversity could affect systems built stop dont know save money short term long term effect anything think busy work modi like demo talk lot improve anyones life gimmick way constitutional amendments pass bjp seats need rd majority passing",
    "light_cleaned_title": "Yogendra Yadav writes: One Nation One Election is a desire to cut down clutter of democratic politics",
    "light_cleaned_selftext": "The world is full of clever answers in search of a genuine question. When talk of One Nation One Election (ONOE) began, it looked like a grand policy solution in search of a real problem. Either a remedy in search of a disease, or a medicine worse than the disease. It looked like a sequel to demonetisation, another brainchild of a modern-day Tughlaq’s penchant for something grand sans a vision or a blueprint. Noting the alacrity with which the present regime has gone about pushing this scheme and reading the Report on Simultaneous Elections in India of the High Level Committee (HLC), I am now convinced that One Nation One Election is not just a quixotic yet harmless fantasy. It fits into a larger political design that has been in the works for long. Originating in the middle-class fantasy to save the republic from the public and the bureaucratic quest to evacuate democracy of its popular content, this design has now fused with the rulers’ desire to tame and defang democracy. The 281-page report (18,345 pages with annexures) is a made-to-order document whose conclusions were written into its terms of reference. Just as the RBI was asked to invent virtues of demonetisation, the HLC was designed to discover the rationale for ONOE.",
    "light_cleaned_comments": "The compulsion to discover a rationale makes for strange reading. The report claims that constant elections account for a loss of “about 300 days in an average year” in some states like Maharashtra (p.167). The ONOE would offer “equitable opportunity to political workers” (p.155) since the same leader won’t contest for MLA and MP. Not just that, ONOE would lead to “reduction in instances of hate speeches” (p.156). It would solve the problem of “voter fatigue” (pp.153-4) — a problem I never heard about in two decades of doing research on Indian elections. People who didn't study history can only come up with bullshit to support this ONOE = Oh No! Reduction in instances of hate speech?...how? Oh, they were thinking about themselves I think. Election speech to them means hate speech no 😂 Depends on the implementation. Many nations across the world do it that way and it seems much cleaner. 😂😂 There is not a single nation on earth that is as richly diverse as India. Agreed. And how is that relevant to my comment? Well let’s see it like this Modi ji will go in campaign mode only once a five years and spare us with all the jumelas throughout the 5 years. You won't get the answer.. It seems like you simply do not understand how the vast diversity could affect the systems that are built on this. Why will he stop? I dont know. It can save some money in the short term, but it has no long term effect on anything. I think it is just busy work for modi. Like DeMo, he will talk about it a lot and it will not improve anyones life. This is a gimmick. There is no way these constitutional amendments can pass when BJP has 240 seats. You need 2/3rd majority for passing these"
}