{
    "id": "182qba9",
    "title": "Story, not history: NCERT must not include myths in history syllabi; myths have helped us endure; history divides us",
    "url": "https://timesofindia.indiatimes.com/blogs/toi-editorials/story-not-history-ncert-must-not-include-myths-in-history-syllabi-myths-have-helped-us-endure-history-divides-us/",
    "selftext": "And there goes ToI on my Blocklist",
    "flair": "Policy/Economy",
    "score": 84,
    "num_comments": 19,
    "created_utc": 1700826201.0,
    "convurl": "https://external-preview.redd.it/ji-7Dp-Q1paqEivjVLKEda9706cTQrGR5l0F81FUo-I.jpg?auto=webp&s=4ad39b3aaffce703b2561e9833c6dd7af3ce5c57",
    "comments": [
        "> What is history, after all, but the names and dates of empires and battles, endless rounds of violence and extraction?\n\nChetan Bhagat is an editor there these days? 😒",
        "This is hilarious. So even these right wing chutiyas are disturbed with the idea of ramayana being taught as history, but being the typical liars and hypocrites that they are, the message is spun as \"let us not taint our great pure epics by mixing them with a dirty thing like history\". What a buffoon.",
        "No author's name ? What kind of BS they are spewing here?",
        "This is one of the stupidest things I've ever read. Our obsession with myths ensures that we never move past regressive practices that are embedded in our culture.",
        "I am so glad my brother is done with school",
        "wait till your children will face this bullshit.",
        "As per the Supreme Court judgement last month, gay couples don't have the right to adoption unless the Parliament changes the rules. \n\nSo don't need to worry about that. \n\nAll the 'Narendra will teach the Muslims a lesson' morons can pat themselves on their back for giving their kids a bright future.",
        ">taking survive the disaster route. \n\nthat is more depressing. \nwhy not elect a politician who cares about both the literacy and LGBTQ group  instead?",
        "I'm not really worried about that. I have negative rizz so it will never happen.",
        "India will not vote for either DMK or CPI.",
        "Damn that was a juvenile article. Did an intern write this?\n\nThat said, I do think we should see *how* the Mahabharata and Ramayana are inculcated into the NCERT syllabus. If the idea is to teach them as historical documents that were major sources of cultural understanding for people in the ancient world, that's probably important to teach. Sort of like how you would teach the Trojan War. The Mahabharata and Ramayana are deeply entwined with cultural practices and even dynastic records in Ancient India. Many rulers for instance claimed to be descended from the heroes of the epics. If they're being taught as epics, I don't think we should object to that.",
        "A person involved in editing NCERT textbooks once passed this comment: \n\nNCERT has to design a curriculum that can be taught by the dumbest of teachers to the brightest of students and vice versa. \n\nEven if the textbooks are written in the way you are saying (support that) the vast number of teachers is unlikely to impart it in that way and taking this under consideration should also be a part of NCERT's job. \n\nEspecially so when the largest network of Private Schools in India is run by the RSS.",
        "If you don't mention it at all, you're opening up far more space for disinformation. If the epics aren't mentioned at all, that's hardly going to stop bad faith teachers from teaching nonsense about them. But if the book is clear about their role in history then the biased, religiously minded instructor has to contradict the official text to push their agenda.",
        "Agreed.",
        "This article has got to be satire. How can anyone think this is actually being said with all seriousness:\n\n> Our calm indifference, our ability to keep our eyes on a different horizon in myth has helped us to not be imprisoned by the past\n\nYeah, India is clearly not a nation imprisoned by its past",
        "but surely bjp will make things worse. previous month didn't the judiciary under bjp  rejected the  right to marriage or something for gay people ?",
        "Some intentionally gaslighting editorial by TOIlet paper team. So much bullsh** the write-up is, that if they keep it simple, readers will call it right away.",
        "Yep. Tushar Mehta made the argument that even single parents are better than two parents of the same sex."
    ],
    "cleaned_text": "story history ncert must include myths history syllabi myths helped us endure history divides us goes toi blocklist ",
    "cleaned_title": "story history ncert must include myths history syllabi myths helped us endure history divides us",
    "cleaned_selftext": "goes toi blocklist",
    "cleaned_comments": "history names dates empires battles endless rounds violence extraction chetan bhagat editor days hilarious even right wing chutiyas disturbed idea ramayana taught history typical liars hypocrites message spun let us taint great pure epics mixing dirty thing like history buffoon authors name kind bs spewing one stupidest things ive ever read obsession myths ensures never move past regressive practices embedded culture glad brother done school wait till children face bullshit per supreme court judgement last month gay couples dont right adoption unless parliament changes rules dont need worry narendra teach muslims lesson morons pat back giving kids bright future taking survive disaster route depressing elect politician cares literacy lgbtq group instead im really worried negative rizz never happen india vote either dmk cpi damn juvenile article intern write said think see mahabharata ramayana inculcated ncert syllabus idea teach historical documents major sources cultural understanding people ancient world thats probably important teach sort like would teach trojan war mahabharata ramayana deeply entwined cultural practices even dynastic records ancient india many rulers instance claimed descended heroes epics theyre taught epics dont think object person involved editing ncert textbooks passed comment ncert design curriculum taught dumbest teachers brightest students vice versa even textbooks written way saying support vast number teachers unlikely impart way taking consideration also part ncerts job especially largest network private schools india run rss dont mention youre opening far space disinformation epics arent mentioned thats hardly going stop bad faith teachers teaching nonsense book clear role history biased religiously minded instructor contradict official text push agenda agreed article got satire anyone think actually said seriousness calm indifference ability keep eyes different horizon myth helped us imprisoned past yeah india clearly nation imprisoned past surely bjp make things worse previous month didnt judiciary bjp rejected right marriage something gay people intentionally gaslighting editorial toilet paper team much bullsh writeup keep simple readers call right away yep tushar mehta made argument even single parents better two parents sex",
    "light_cleaned_title": "Story, not history: NCERT must not include myths in history syllabi; myths have helped us endure; history divides us",
    "light_cleaned_selftext": "And there goes ToI on my Blocklist",
    "light_cleaned_comments": "> What is history, after all, but the names and dates of empires and battles, endless rounds of violence and extraction? Chetan Bhagat is an editor there these days? 😒 This is hilarious. So even these right wing chutiyas are disturbed with the idea of ramayana being taught as history, but being the typical liars and hypocrites that they are, the message is spun as \"let us not taint our great pure epics by mixing them with a dirty thing like history\". What a buffoon. No author's name ? What kind of BS they are spewing here? This is one of the stupidest things I've ever read. Our obsession with myths ensures that we never move past regressive practices that are embedded in our culture. I am so glad my brother is done with school wait till your children will face this bullshit. As per the Supreme Court judgement last month, gay couples don't have the right to adoption unless the Parliament changes the rules. So don't need to worry about that. All the 'Narendra will teach the Muslims a lesson' morons can pat themselves on their back for giving their kids a bright future. >taking survive the disaster route. that is more depressing. why not elect a politician who cares about both the literacy and LGBTQ group instead? I'm not really worried about that. I have negative rizz so it will never happen. India will not vote for either DMK or CPI. Damn that was a juvenile article. Did an intern write this? That said, I do think we should see *how* the Mahabharata and Ramayana are inculcated into the NCERT syllabus. If the idea is to teach them as historical documents that were major sources of cultural understanding for people in the ancient world, that's probably important to teach. Sort of like how you would teach the Trojan War. The Mahabharata and Ramayana are deeply entwined with cultural practices and even dynastic records in Ancient India. Many rulers for instance claimed to be descended from the heroes of the epics. If they're being taught as epics, I don't think we should object to that. A person involved in editing NCERT textbooks once passed this comment: NCERT has to design a curriculum that can be taught by the dumbest of teachers to the brightest of students and vice versa. Even if the textbooks are written in the way you are saying (support that) the vast number of teachers is unlikely to impart it in that way and taking this under consideration should also be a part of NCERT's job. Especially so when the largest network of Private Schools in India is run by the RSS. If you don't mention it at all, you're opening up far more space for disinformation. If the epics aren't mentioned at all, that's hardly going to stop bad faith teachers from teaching nonsense about them. But if the book is clear about their role in history then the biased, religiously minded instructor has to contradict the official text to push their agenda. Agreed. This article has got to be satire. How can anyone think this is actually being said with all seriousness: > Our calm indifference, our ability to keep our eyes on a different horizon in myth has helped us to not be imprisoned by the past Yeah, India is clearly not a nation imprisoned by its past but surely bjp will make things worse. previous month didn't the judiciary under bjp rejected the right to marriage or something for gay people ? Some intentionally gaslighting editorial by TOIlet paper team. So much bullsh** the write-up is, that if they keep it simple, readers will call it right away. Yep. Tushar Mehta made the argument that even single parents are better than two parents of the same sex."
}