{
    "id": "136b23g",
    "title": "Urgent- Kind humans!! Barfi is still looking for her forever home. We need your help!",
    "url": "https://www.reddit.com/gallery/136b23g",
    "selftext": "HOW YOU CAN HELP - By adopting her. By sharing this post with your friends and family. By upvoting the post so that it reaches more and more people. \n\nBarfi is a Spitz and Himalayan cross dog abandoned by her previous owners. \n\nShe is vaccinated and spayed. Right now we are fostering her in Noida. But, we can't keep her for long. \n\nFew details about Barfi- \n\n[Name] : Barfi\n[Breed] : Spitz and himalayan dog cross\n[Gender] : female\n[Age] : 2 years\n[Weight] : 18 kgs\n********\nGood With Adults: yes\nGood With Kids: yes\nGood With Other Dogs: takes little time to get friendly\nGood With Cats: unknown\nGood with strangers: takes few minutes to get friendly\nEnergy Level: very active\nCan be handled/touched: yes\nFood Aggressive: no\nResource Guarding : no\nVaccination Status: up to date\nWalk on leash: yes\nAfraid of loud noises: no\nAny special traits: She loves to SING, loves pets and to run\n******\n\nReddit doesn't allow sharing contact information but please dm me and I will get back in no time.",
    "flair": "AskIndia",
    "score": 113,
    "num_comments": 12,
    "created_utc": 1683090555.0,
    "convurl": "https://i.redd.it/d0jhmxnsujxa1.jpg",
    "comments": [
        "Oh dear Barfi :(",
        ":(",
        "Might be useful to let people know where Barfi is located. I really hope she finds a home soon ❤️",
        "She is Noida currently. Her adoption is open Pan India",
        "Can you deliver in Lalitpur Uttar Pradesh?\n284403 pin code",
        "Yes we can. Please message me and we can discuss more phone",
        "Kar diya msg",
        "I hope this works out",
        "Hi yes. We are still considering this. Sending a dog 500 kms is a huge risk in case of an adult dog in case adoption fails.",
        "Yes, it is not so easy. How old is Barfi?",
        "2 yrs old"
    ],
    "cleaned_text": "urgent kind humans barfi still looking forever home need help help adopting sharing post friends family upvoting post reaches people barfi spitz himalayan cross dog abandoned previous owners vaccinated spayed right fostering noida cant keep long details barfi name barfi breed spitz himalayan dog cross gender female age years weight kgs good adults yes good kids yes good dogs takes little time get friendly good cats unknown good strangers takes minutes get friendly energy level active handledtouched yes food aggressive resource guarding vaccination status date walk leash yes afraid loud noises special traits loves sing loves pets run reddit doesnt allow sharing contact information please dm get back time ",
    "cleaned_title": "urgent kind humans barfi still looking forever home need help",
    "cleaned_selftext": "help adopting sharing post friends family upvoting post reaches people barfi spitz himalayan cross dog abandoned previous owners vaccinated spayed right fostering noida cant keep long details barfi name barfi breed spitz himalayan dog cross gender female age years weight kgs good adults yes good kids yes good dogs takes little time get friendly good cats unknown good strangers takes minutes get friendly energy level active handledtouched yes food aggressive resource guarding vaccination status date walk leash yes afraid loud noises special traits loves sing loves pets run reddit doesnt allow sharing contact information please dm get back time",
    "cleaned_comments": "oh dear barfi might useful let people know barfi located really hope finds home soon noida currently adoption open pan india deliver lalitpur uttar pradesh pin code yes please message discuss phone kar diya msg hope works hi yes still considering sending dog kms huge risk case adult dog case adoption fails yes easy old barfi yrs old",
    "light_cleaned_title": "Urgent- Kind humans!! Barfi is still looking for her forever home. We need your help!",
    "light_cleaned_selftext": "HOW YOU CAN HELP - By adopting her. By sharing this post with your friends and family. By upvoting the post so that it reaches more and more people. Barfi is a Spitz and Himalayan cross dog abandoned by her previous owners. She is vaccinated and spayed. Right now we are fostering her in Noida. But, we can't keep her for long. Few details about Barfi- [Name] : Barfi [Breed] : Spitz and himalayan dog cross [Gender] : female [Age] : 2 years [Weight] : 18 kgs ******** Good With Adults: yes Good With Kids: yes Good With Other Dogs: takes little time to get friendly Good With Cats: unknown Good with strangers: takes few minutes to get friendly Energy Level: very active Can be handled/touched: yes Food Aggressive: no Resource Guarding : no Vaccination Status: up to date Walk on leash: yes Afraid of loud noises: no Any special traits: She loves to SING, loves pets and to run ****** Reddit doesn't allow sharing contact information but please dm me and I will get back in no time.",
    "light_cleaned_comments": "Oh dear Barfi :( :( Might be useful to let people know where Barfi is located. I really hope she finds a home soon ❤️ She is Noida currently. Her adoption is open Pan India Can you deliver in Lalitpur Uttar Pradesh? 284403 pin code Yes we can. Please message me and we can discuss more phone Kar diya msg I hope this works out Hi yes. We are still considering this. Sending a dog 500 kms is a huge risk in case of an adult dog in case adoption fails. Yes, it is not so easy. How old is Barfi? 2 yrs old"
}