{
    "id": "1eibu5u",
    "title": "Modi 240 wants to shut down @MrBeast... and @dhruvrathee | Broadcasting Bill EXPLAINED!",
    "url": "https://youtu.be/Vj5p7jrw7d4?si=Kj6I242V4kZAhG1h",
    "selftext": "Under the v2/revised broadcasting bill. Anyone can be considered as broadcaster",
    "flair": "Policy/Economy",
    "score": 62,
    "num_comments": 9,
    "created_utc": 1722609824.0,
    "convurl": "https://external-preview.redd.it/2sk_rZKVpRzZVj4MpM-6nSK114RrHxP7dDEHpLlrY5s.jpg?auto=webp&s=51cca9e76409849229a1468797fdd04521e02fe0",
    "comments": [
        "as a subscriber and a frequent visitor of Megnerd, I have to say its a great all round discussion on varied topics that brings me back to them....\n\nStrongly recommend watching them if you can sit through hour long videos.",
        "Great wall of india?",
        "Someone just read Orwell and liked it a little too much! Just saw the video, writing comments on reddit or sending messages on whatsapp would also come into the purview of this bill if I am not wrong. \n\nDoes the SC have the power to strike this down as unconstitutional?",
        "But, the governent can't built their own wall, they are asking us to self-censor, or else...",
        "Ministry of truth"
    ],
    "cleaned_text": "modi wants shut mrbeast dhruvrathee broadcasting bill explained vrevised broadcasting bill anyone considered broadcaster ",
    "cleaned_title": "modi wants shut mrbeast dhruvrathee broadcasting bill explained",
    "cleaned_selftext": "vrevised broadcasting bill anyone considered broadcaster",
    "cleaned_comments": "subscriber frequent visitor megnerd say great round discussion varied topics brings back strongly recommend watching sit hour long videos great wall india someone read orwell liked little much saw video writing comments reddit sending messages whatsapp would also come purview bill wrong sc power strike unconstitutional governent cant built wall asking us selfcensor else ministry truth",
    "light_cleaned_title": "Modi 240 wants to shut down @MrBeast... and @dhruvrathee | Broadcasting Bill EXPLAINED!",
    "light_cleaned_selftext": "Under the v2/revised broadcasting bill. Anyone can be considered as broadcaster",
    "light_cleaned_comments": "as a subscriber and a frequent visitor of Megnerd, I have to say its a great all round discussion on varied topics that brings me back to them.... Strongly recommend watching them if you can sit through hour long videos. Great wall of india? Someone just read Orwell and liked it a little too much! Just saw the video, writing comments on reddit or sending messages on whatsapp would also come into the purview of this bill if I am not wrong. Does the SC have the power to strike this down as unconstitutional? But, the governent can't built their own wall, they are asking us to self-censor, or else... Ministry of truth"
}