{
    "id": "14vuyjc",
    "title": "Hey! This is Shah Rule - Rapper, Producer & Songwriter. You might've seen me in Gully Boy! I'm releasing my debut album \"Call You Right Back, I'm in Therapy\" this Wednesday, July 12th. Ask me anything!",
    "url": "https://www.reddit.com/r/india/comments/14vuyjc/hey_this_is_shah_rule_rapper_producer_songwriter/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/s41to51a95bb1.jpg?width=3438&format=pjpg&auto=webp&s=80735bcfadfec927bd682d012997c17c67926304",
    "flair": "AskIndia",
    "score": 194,
    "num_comments": 128,
    "created_utc": 1688997811.0,
    "convurl": "https://b.thumbs.redditmedia.com/URzYwy2SOfgaGMYSCQWdrdQbeq_AAkFHdahPkIPw5VU.jpg",
    "comments": [
        "What was it like on the set of Gully Boy and any other movies/TV appearances coming soon?",
        "So whats the story behind the name Shah Rule?",
        "Do you believe people have a nature gift for freestyling/improv or can you train yourself for it?",
        "A big fan of Ja Rule 😀",
        "Certain individuals definitely blessed with having a quick way with words and rhyming off the top of their head but I totally agree you can train yourself to be great at it with practice & training yourself over different beat tempos, topics etc. Respect to those do it well!",
        "Your background is pretty diverse, having lived in various countries. How has this multicultural experience influenced your music and style?",
        "My real name is Rahul Shahani.. my first rap name was RULE which was a nickname in school stemming from Rahul, and overtime I ended up adding the SHAH from Shahani to the name make my stage name more unique and blend a bit of Hip-Hop (Ja Rule being one of the few artists I grew up on in the early 2000's) & my Indian roots with Bollywood being a huge part of my upbringing and Shahrukh Khan being the goat that he is.",
        "How would you describe your individual style when it comes to hip-hop, both musically and in terms of fashion?",
        "What was your interaction with Ranveer Singh like during the filming of Gully Boy? Any memorable anecdotes?",
        "What are your favorite subreddits?",
        "Your thoughts on kalamkaars ongoing controversy ?",
        "Any spicy gossips from the sets of Gully Boy you can share?",
        "Why are you in therapy?",
        "Sir When we will see Shahrule x Kr$na ? \nExcited for your Album sir you are one of the finest English rapper in India",
        "I've always been open to trying all genres & styles, having accumulated a taste for different sounds throughout my upbringing. 6 months ago, for my single Tension, I mixed South African Amapiano beats & classical Indian sitars with Punjabi & English R&B vocals for a track because I was inspired from Afro Beats music festival I visited in Portugal last summer. I'm constantly inspired by new sounds and love to incorporate them into my music! Style wise, I grew up in Moscow, Russia, and I love big flashy jackets and hoodies which unfortunately I cannot where in Bombay for obvious reasons haha",
        "I totally remember this - You were awesome. [https://www.youtube.com/watch?v=JzqD2kZPo50](https://www.youtube.com/watch?v=JzqD2kZPo50)",
        "What needs to change about the Indian Hip Hop scene?",
        "Hey man! What do you think about the way the desi Hip hop scene has grown in the last decade, did you ever imagine that it would get this big?",
        "If you weren't a rapper what would you be?",
        "Let's create a rap here:\n\nI'll start:   \nShah Rule ka hai ye AMA, abe!  \nPoochh le kuchh bhi, aur mera faadu answer le, abe!",
        "Epic experience! Truly blessed to have been on a Zoya Akhtar set for my first film shoot experience. So much respect to her and her whole team at Excel. \n\nI just did  the theme song for Ayushmann Khuranna's last movie An Action Hero on Netflix, its called \"Asli Action Hero\" and its alongside my Gully Gang brother, D'Evil! Do check it out on YouTube!",
        "Bhai you are really a very good hookmaker, your every song is top tier. Kindly tell when you are going to Collab with KRSNA?",
        "Any fitness tips?",
        "Do you guys comeup with the words / lyrics first and then add a beat or the beat first then rhyme your words on the theme as you go.",
        "Didn't realise how much I was holding in until I reached a breaking point that came to fruition because of a break up and a lot moments in my personal life from the last 3-4 years. It has truly been a life changing experience and I have learned so much in the last 8-9 months, of course I still am. But talking it through it with professional on a weekly basis and building support systems around me to help me hold myself accountable for me from growth has been an absolute game changer! I've been obsessed with progress within music and my career, but I totally neglected my mental health & well being.",
        "Indian version of Ja Rule? 🤣",
        "More melodies in general would take us to a different level and audience but mainly more music from WOMEN & for WOMEN! We gotta empower our sisters! Big shout out to all the Females Emcees & Artists killing it - Raja Kumari, Dee MC, Siri, Agsy, Irfana and so many more!",
        "Ass or Titties?",
        "Chef Shah Rule! Definitely stepping into the food space soon too, its definitely a dream of mine!",
        "I am proud of you my friend 👏",
        "Sex",
        "Just had a snippet of what the album sounds like, I may not be a constant listener or follower of your music mate but the energy and hype your musics about (ref: lakhs, vibe hai rap etc) is something that can be seen in this album! How big is this for you?",
        "Appreciate you! \n\nHopefully we'll find something we're both happy to release soon! We have worked on a few songs but our styles / the times do change quite quick so over time it doesn't necessarily fit the current spaces we're in. Big love & respect to KR$NA, he's one of the real ones in our game and deserve all the flowers for his grind!",
        "How do you choose your finger nail colours/patterns?",
        "What's the most unexplored genre currently in the Indian scene in your opinion and why do you think is it still untapped?\nAlso what are your opinions on gospel rap?",
        "He low key ignored me & was joking around with everyone else the first day to I guess prepare for the scene, but as soon as Zoya yelled cut after the first take of our scene, he gave a giant bear hug and was the most chilled person from then on haha. Really respect is passion, humility and work ethic! He made everyone feel super comfortable and would constantly show us love for our music.",
        "Appreciated it Mate",
        "IndianHipHopHeads!!! Love em! Even some of the haters on there lol but its always a lot of support and I really appreciate that there's a space for the community to discuss and grow the conversation of our culture.",
        "Clearly your from IndianHipHopHeads so you gotta go check my answer from then, and no it hasn't changed :)",
        "When are u collabing with yungsta again",
        "When is your next show in Delhi?\nAlso, which Delhi talent (whom you’ve not collaborated with yet) would you like to work with next?",
        "have you heard of r/DHHMemes? if so, what is your opinion on it?",
        "Its been incredible to see, as a fan and as someone who is part of the community. Honestly, the last moment that really blew my mind was seeing DIVINE's album launch at NSCI Dome Stadium. Seeing his rise has been magical and I'm truly blessed to have been a part of his journey and movement. That moment when he rode out on the bike and the entire building was literally shaking... goosebumps! He a legend fr!",
        "Is there any possibility of you collabbing with Honey Singh?",
        "Its never the same process tbh! Sometimes we do songwriting camps and run through beats and freestyle melodies and gibberish until an idea pops up and we roll with it / explore the idea. Or sometimes a topic or a message will be calling out to you so strongly that you need to write first and then find the correct beat or music to match the words.",
        "Big love !",
        "Eyyy! Right now, its the orange aesthetic of my album, with different symbols representing the themes involved haha but mostly my Sindhi inner spidey sense cannot resist Gold & Silver chrome lol gotta love it!\n\nhttps://preview.redd.it/s8j43rari5bb1.jpeg?width=1170&format=pjpg&auto=webp&v=enabled&s=c2ef1267829fa8556183b2f28fe547b4259690e9",
        "Kya rappers paisa kama pa rahe hai?",
        "How much do you earn?",
        "Its huge! First independent project since moving to India and my debut album! I'm super excited and ready to share this with the world. I do have all sorts of flavours on this album but you do get a bit of the Lakhs, Vibe Hai zone of a few songs like Saari Raatein & Bad For Me!",
        "Who would you choose to have a sesh 💨 with? A$AP Rocky, Kanye, or Snoop?",
        "We actually haven't release anything yet, but I have a collab with Full Power in the works! Hope to get it out this year after the album! Big fan of his new album and his overall craft! He's a G!",
        "I am a Meme Connoisseur so I will definitely check em out soon!",
        "Love the songs in gully boy. I have  already memorised three of them",
        "Would love to! He's been super supportive and has shared my music on multiple occasions.",
        "KANYE ALL DAYYYYYYYY",
        "Another collab with Krsna? Also your bars are 🔥",
        "what's the mood of this album?",
        "Bro did you spend time with Kaam Bhari on the set of gully boy? That dude is fuckin legit!!",
        "How much you make from albums?",
        "Can we expect some fire collabs in the album?",
        "Another? Pehela konsa hai?",
        "iska answer dediya toh nipple pe shah rule ka tatto karaunga./s",
        "Mickey Singh, Lisa Mishra, Abhijay Sharma, Sammohit, Dorwin John, Anik Khan, and more! All of them brought their A game!",
        "there seems to be a relation between your last project hooked and cyrbiit - how is it similar and what different can we expect from you? also that t-shirt you wore at that sneaker festival was sick, would definitely buy if it ever went on sale",
        "Shahrule bhai seedhe maut ke bare main kuch kaho",
        "I dont know who you are. And I haven’t heard a your songs. But those are nice glasses.",
        "Sonically a little trap, old school boom bap, and a few afro beats / amapiano vibes! \n\nLot of self reflection to say the least.",
        "He's a G indeed!!! Super talented and humble! \n\nThe whole vibe on set was just banter and jokes. D'Evil roasting everyone and all of us are laughing until he focuses on you lmao",
        "that sounds awesome!",
        "Haha sounds like a fuckin trip bro! It’s all fun n games till D’Evil looks at you 💀\n\nAll the best for your new release bro, will check it out! Hit me up if you swing by Blingapore!",
        "Damn. Looking forward to it!",
        "there exists one panda too 😃...... oh.. is that fat shaming ? sorry",
        "Thank you! Gotta wear them indoors as well when you have a bright future ahead of you. Do check out my album out this Wednesday, I'm wearing some cool shades on the cover art too.",
        "Dog bless you, you beautiful man.",
        "TBSM! Bhussi was crazy! Looking forward to the mixtape! I never miss a show when they come to Bombay!",
        "unacceptable-friend-29",
        "Lmao",
        "Definitely agreed, hiphop has historically been very male dominated, esp old school, now that hiphop arrived later in India there’s a much better chance for women to get opportunities",
        "Appreciate you! The album march will be on sale very soon after the release :)\n\nAnd yes, this album continues from where Hooked is left off. Hooked EP was about our generations addiction to Materialism via our close connection with our phones & the digital world. That EP definitely had its own transformation but this album is the healing and dealing after affects of those addictions and the toxic zone I was stuck in. Our phones do definitely define our generation so its always part of my skits and my story telling as a symbol of comfort but also a way to reveal harsh truths about our ways today, especially when it comes to dealing with our relationships.",
        "Oh yeah!",
        "Wtf bro",
        "Any plans on collab with frappe ash??",
        "bruh 1/10 roasting skills, please go sip some more haterade, come back and try again!",
        "Track is in the works with Full Power! Issa vibe!",
        "Working on the tour and will definitely pass through Delhi! \n\nI'm a fan of Seedhe Maut, Full Power, Rawal and many more, so hopefully soon!",
        "Sindhi AF! \n\nOnly gold bars in my lines, and whole lot of gold on my neck, I'mma shine!",
        "Fr, which one? lol",
        "Bro, any tips to fellow producers. I have written many Rap's but I am not able to make beat that would go with my Lyrics.",
        "Top 5 ihh? removing yourself",
        "I find it difficult to appreciate creative ppl. Do u have any words that can change my mind? (I know art is important but I cant bring myself to like stuff that goes beyond the norm)",
        "Force yourself to find 1-2 things to like about the art first before criticising. Art is suppose to be polarising and not suppose to translate to everyone, but the only way it grows and reaches more people is if the audience challenges themselves every now and then to try new things other than the norm they are used to. \n\nI'm not a fan of techno or trance in anyway at all, I cannot stand being a rave or any of those parties but I respect the feeling it gives people and the synergy in the room at those parties. I think its just great to be open to more and there's more to experience that way, and if its not for you, you'll know right away and you can move on.",
        "I use to produce a lot more and then I saw that I wrote better to other peoples beats. Maybe its not for you or maybe its the type of beat or there could be a lot of factors. But keep trying and learn from your influences!",
        "Amazing Merch idea 🔥",
        "https://preview.redd.it/ha6w9ulo56bb1.jpeg?width=4000&format=pjpg&auto=webp&v=enabled&s=60f3d17c73891a270b2b4fc3e11485981e566963\n\nLaunching super soon🙏🏽🧡",
        "shah brother my question is that \"What are your views on the diss culture growing nowadays ? like is this good for our rap industry or it's gradually making this industry hollow? \" btw love your work and thanks for the AMA. hoping best for the future.",
        "DIVINE, Raftaar, KR$NA, Sikander Kahlon & Ikka!",
        "Favorite rapper in DHH industry ?",
        "Judging by the title of your new album, does your new album promote mental health awareness in any way?",
        "https://preview.redd.it/mfkaq3z096bb1.jpeg?width=555&format=pjpg&auto=webp&v=enabled&s=0f70cd3e98134f971bd54a283ceba379f4783fe1",
        "How come you manage to ft. Mickey singh in your album . What was  the though process according to you . I m guessing that this track might be the commercial cuz mickey singh is a good singh he can use the melody in the track.",
        "Can you speak or understand sindhi?",
        "I’m 15 and I LOVE writing English lyrics. Do you think it’s possible to find a job with my passion or people just respect those who rap AND write their own stuff? Since I don’t believe i have good vocals so I only write lyrics haha!",
        "What were your international influences and fav rappers?",
        "Did you leave gully gang?",
        "Ass or boobs?",
        "Bro caught me. All the best for the album",
        "Where did you move from?",
        "Bro aap Maggie banate samaye paani aage daalte ho ya pehle sukhi Maggie ?",
        "Whats for dinner?",
        "Favorite philosopher or a way of life that speaks to you?",
        "Are you up for doing a collab with Bella.. Just like you he too drops dope shit.. your combination will be lethal.",
        "Are you okay bro ?",
        "Ab ye sikka mera bolega",
        "To all the ladies who be givin it up …",
        "If Gully Boy brought Indian hip hop to the mainstream, what gets it to the next level?",
        "Where is your mixed accent from?",
        "Ask krsna when's he gonna drop his album.",
        "Who is your nail tech? 😍",
        "TBSM4L",
        "Kabhi nahi",
        "YES",
        "Indian hip-hop is amazing",
        "I do not listen to Indian Hiphop and has never heard of Shah Rule. But this AMA makes me want to listen to the rapper and the genre. Very thoughtful answers to most questions.  This is how an AMA should be. Thank you for doing it. Hope you become very successful if you are not already.",
        "Appreciate it! Thank you🙏🏽🧡",
        "Thank you for the response, Mr. Rule.",
        "Wut",
        "yea that makes sense. I don't have to be welcoming to all sorts of art but I can pick 'my stuff'. Thanks dude!!",
        "nah, there actually is a guy named coolnamepanda"
    ],
    "cleaned_text": "hey shah rule rapper producer songwriter mightve seen gully boy im releasing debut album call right back im therapy wednesday july th ask anything xb ",
    "cleaned_title": "hey shah rule rapper producer songwriter mightve seen gully boy im releasing debut album call right back im therapy wednesday july th ask anything",
    "cleaned_selftext": "xb",
    "cleaned_comments": "like set gully boy moviestv appearances coming soon whats story behind name shah rule believe people nature gift freestylingimprov train big fan ja rule certain individuals definitely blessed quick way words rhyming top head totally agree train great practice training different beat tempos topics etc respect well background pretty diverse lived various countries multicultural experience influenced music style real name rahul shahani first rap name rule nickname school stemming rahul overtime ended adding shah shahani name make stage name unique blend bit hiphop ja rule one artists grew early indian roots bollywood huge part upbringing shahrukh khan goat would describe individual style comes hiphop musically terms fashion interaction ranveer singh like filming gully boy memorable anecdotes favorite subreddits thoughts kalamkaars ongoing controversy spicy gossips sets gully boy share therapy sir see shahrule x krna excited album sir one finest english rapper india ive always open trying genres styles accumulated taste different sounds throughout upbringing months ago single tension mixed south african amapiano beats classical indian sitars punjabi english rb vocals track inspired afro beats music festival visited portugal last summer im constantly inspired new sounds love incorporate music style wise grew moscow russia love big flashy jackets hoodies unfortunately bombay obvious reasons haha totally remember awesome httpswwwyoutubecomwatchvjzqdkzpohttpswwwyoutubecomwatchvjzqdkzpo needs change indian hip hop scene hey man think way desi hip hop scene grown last decade ever imagine would get big werent rapper would lets create rap ill start shah rule ka hai ye ama abe poochh le kuchh bhi aur mera faadu answer le abe epic experience truly blessed zoya akhtar set first film shoot experience much respect whole team excel theme song ayushmann khurannas last movie action hero netflix called asli action hero alongside gully gang brother devil check youtube bhai really good hookmaker every song top tier kindly tell going collab krsna fitness tips guys comeup words lyrics first add beat beat first rhyme words theme go didnt realise much holding reached breaking point came fruition break lot moments personal life last years truly life changing experience learned much last months course still talking professional weekly basis building support systems around help hold accountable growth absolute game changer ive obsessed progress within music career totally neglected mental health well indian version ja rule melodies general would take us different level audience mainly music women women got ta empower sisters big shout females emcees artists killing raja kumari dee mc siri agsy irfana many ass titties chef shah rule definitely stepping food space soon definitely dream mine proud friend sex snippet album sounds like may constant listener follower music mate energy hype musics ref lakhs vibe hai rap etc something seen album big appreciate hopefully well find something happy release soon worked songs styles times change quite quick time doesnt necessarily fit current spaces big love respect krna hes one real ones game deserve flowers grind choose finger nail colourspatterns whats unexplored genre currently indian scene opinion think still untapped also opinions gospel rap low key ignored joking around everyone else first day guess prepare scene soon zoya yelled cut first take scene gave giant bear hug chilled person haha really respect passion humility work ethic made everyone feel super comfortable would constantly show us love music appreciated mate indianhiphopheads love em even haters lol always lot support really appreciate theres space community discuss grow conversation culture clearly indianhiphopheads got ta go check answer hasnt changed u collabing yungsta next show delhi also delhi talent youve collaborated yet would like work next heard rdhhmemes opinion incredible see fan someone part community honestly last moment really blew mind seeing divines album launch nsci dome stadium seeing rise magical im truly blessed part journey movement moment rode bike entire building literally shaking goosebumps legend fr possibility collabbing honey singh never process tbh sometimes songwriting camps run beats freestyle melodies gibberish idea pops roll explore idea sometimes topic message calling strongly need write first find correct beat music match words big love eyyy right orange aesthetic album different symbols representing themes involved haha mostly sindhi inner spidey sense resist gold silver chrome lol got ta love kya rappers paisa kama pa rahe hai much earn huge first independent project since moving india debut album im super excited ready share world sorts flavours album get bit lakhs vibe hai zone songs like saari raatein bad would choose sesh aap rocky kanye snoop actually havent release anything yet collab full power works hope get year album big fan new album overall craft hes g meme connoisseur definitely check em soon love songs gully boy already memorised three would love hes super supportive shared music multiple occasions kanye dayyyyyyyy another collab krsna also bars whats mood album bro spend time kaam bhari set gully boy dude fuckin legit much make albums expect fire collabs album another pehela konsa hai iska answer dediya toh nipple pe shah rule ka tatto karaungas mickey singh lisa mishra abhijay sharma sammohit dorwin john anik khan brought game seems relation last project hooked cyrbiit similar different expect also tshirt wore sneaker festival sick would definitely buy ever went sale shahrule bhai seedhe maut ke bare main kuch kaho dont know havent heard songs nice glasses sonically little trap old school boom bap afro beats amapiano vibes lot self reflection say least hes g indeed super talented humble whole vibe set banter jokes devil roasting everyone us laughing focuses lmao sounds awesome haha sounds like fuckin trip bro fun n games till devil looks best new release bro check hit swing blingapore damn looking forward exists one panda oh fat shaming sorry thank got ta wear indoors well bright future ahead check album wednesday im wearing cool shades cover art dog bless beautiful man tbsm bhussi crazy looking forward mixtape never miss show come bombay unacceptablefriend lmao definitely agreed hiphop historically male dominated esp old school hiphop arrived later india theres much better chance women get opportunities appreciate album march sale soon release yes album continues hooked left hooked ep generations addiction materialism via close connection phones digital world ep definitely transformation album healing dealing affects addictions toxic zone stuck phones definitely define generation always part skits story telling symbol comfort also way reveal harsh truths ways today especially comes dealing relationships oh yeah wtf bro plans collab frappe ash bruh roasting skills please go sip haterade come back try track works full power issa vibe working tour definitely pass delhi im fan seedhe maut full power rawal many hopefully soon sindhi af gold bars lines whole lot gold neck imma shine fr one lol bro tips fellow producers written many raps able make beat would go lyrics top ihh removing find difficult appreciate creative ppl u words change mind know art important cant bring like stuff goes beyond norm force find things like art first criticising art suppose polarising suppose translate everyone way grows reaches people audience challenges every try new things norm used im fan techno trance anyway stand rave parties respect feeling gives people synergy room parties think great open theres experience way youll know right away move use produce lot saw wrote better peoples beats maybe maybe type beat could lot factors keep trying learn influences amazing merch idea launching super soon shah brother question views diss culture growing nowadays like good rap industry gradually making industry hollow btw love work thanks ama hoping best future divine raftaar krna sikander kahlon ikka favorite rapper dhh industry judging title new album new album promote mental health awareness way come manage ft mickey singh album though process according guessing track might commercial cuz mickey singh good singh use melody track speak understand sindhi im love writing english lyrics think possible find job passion people respect rap write stuff since dont believe good vocals write lyrics haha international influences fav rappers leave gully gang ass boobs bro caught best album move bro aap maggie banate samaye paani aage daalte ho ya pehle sukhi maggie whats dinner favorite philosopher way life speaks collab bella like drops dope shit combination lethal okay bro ab ye sikka mera bolega ladies givin gully boy brought indian hip hop mainstream gets next level mixed accent ask krsna whens gon na drop album nail tech tbsml kabhi nahi yes indian hiphop amazing listen indian hiphop never heard shah rule ama makes want listen rapper genre thoughtful answers questions ama thank hope become successful already appreciate thank thank response mr rule wut yea makes sense dont welcoming sorts art pick stuff thanks dude nah actually guy named coolnamepanda",
    "light_cleaned_title": "Hey! This is Shah Rule - Rapper, Producer & Songwriter. You might've seen me in Gully Boy! I'm releasing my debut album \"Call You Right Back, I'm in Therapy\" this Wednesday, July 12th. Ask me anything!",
    "light_cleaned_selftext": "&#x200B;",
    "light_cleaned_comments": "What was it like on the set of Gully Boy and any other movies/TV appearances coming soon? So whats the story behind the name Shah Rule? Do you believe people have a nature gift for freestyling/improv or can you train yourself for it? A big fan of Ja Rule 😀 Certain individuals definitely blessed with having a quick way with words and rhyming off the top of their head but I totally agree you can train yourself to be great at it with practice & training yourself over different beat tempos, topics etc. Respect to those do it well! Your background is pretty diverse, having lived in various countries. How has this multicultural experience influenced your music and style? My real name is Rahul Shahani.. my first rap name was RULE which was a nickname in school stemming from Rahul, and overtime I ended up adding the SHAH from Shahani to the name make my stage name more unique and blend a bit of Hip-Hop (Ja Rule being one of the few artists I grew up on in the early 2000's) & my Indian roots with Bollywood being a huge part of my upbringing and Shahrukh Khan being the goat that he is. How would you describe your individual style when it comes to hip-hop, both musically and in terms of fashion? What was your interaction with Ranveer Singh like during the filming of Gully Boy? Any memorable anecdotes? What are your favorite subreddits? Your thoughts on kalamkaars ongoing controversy ? Any spicy gossips from the sets of Gully Boy you can share? Why are you in therapy? Sir When we will see Shahrule x Kr$na ? Excited for your Album sir you are one of the finest English rapper in India I've always been open to trying all genres & styles, having accumulated a taste for different sounds throughout my upbringing. 6 months ago, for my single Tension, I mixed South African Amapiano beats & classical Indian sitars with Punjabi & English R&B vocals for a track because I was inspired from Afro Beats music festival I visited in Portugal last summer. I'm constantly inspired by new sounds and love to incorporate them into my music! Style wise, I grew up in Moscow, Russia, and I love big flashy jackets and hoodies which unfortunately I cannot where in Bombay for obvious reasons haha I totally remember this - You were awesome. [https://www.youtube.com/watch?v=JzqD2kZPo50](https://www.youtube.com/watch?v=JzqD2kZPo50) What needs to change about the Indian Hip Hop scene? Hey man! What do you think about the way the desi Hip hop scene has grown in the last decade, did you ever imagine that it would get this big? If you weren't a rapper what would you be? Let's create a rap here: I'll start: Shah Rule ka hai ye AMA, abe! Poochh le kuchh bhi, aur mera faadu answer le, abe! Epic experience! Truly blessed to have been on a Zoya Akhtar set for my first film shoot experience. So much respect to her and her whole team at Excel. I just did the theme song for Ayushmann Khuranna's last movie An Action Hero on Netflix, its called \"Asli Action Hero\" and its alongside my Gully Gang brother, D'Evil! Do check it out on YouTube! Bhai you are really a very good hookmaker, your every song is top tier. Kindly tell when you are going to Collab with KRSNA? Any fitness tips? Do you guys comeup with the words / lyrics first and then add a beat or the beat first then rhyme your words on the theme as you go. Didn't realise how much I was holding in until I reached a breaking point that came to fruition because of a break up and a lot moments in my personal life from the last 3-4 years. It has truly been a life changing experience and I have learned so much in the last 8-9 months, of course I still am. But talking it through it with professional on a weekly basis and building support systems around me to help me hold myself accountable for me from growth has been an absolute game changer! I've been obsessed with progress within music and my career, but I totally neglected my mental health & well being. Indian version of Ja Rule? 🤣 More melodies in general would take us to a different level and audience but mainly more music from WOMEN & for WOMEN! We gotta empower our sisters! Big shout out to all the Females Emcees & Artists killing it - Raja Kumari, Dee MC, Siri, Agsy, Irfana and so many more! Ass or Titties? Chef Shah Rule! Definitely stepping into the food space soon too, its definitely a dream of mine! I am proud of you my friend 👏 Sex Just had a snippet of what the album sounds like, I may not be a constant listener or follower of your music mate but the energy and hype your musics about (ref: lakhs, vibe hai rap etc) is something that can be seen in this album! How big is this for you? Appreciate you! Hopefully we'll find something we're both happy to release soon! We have worked on a few songs but our styles / the times do change quite quick so over time it doesn't necessarily fit the current spaces we're in. Big love & respect to KR$NA, he's one of the real ones in our game and deserve all the flowers for his grind! How do you choose your finger nail colours/patterns? What's the most unexplored genre currently in the Indian scene in your opinion and why do you think is it still untapped? Also what are your opinions on gospel rap? He low key ignored me & was joking around with everyone else the first day to I guess prepare for the scene, but as soon as Zoya yelled cut after the first take of our scene, he gave a giant bear hug and was the most chilled person from then on haha. Really respect is passion, humility and work ethic! He made everyone feel super comfortable and would constantly show us love for our music. Appreciated it Mate IndianHipHopHeads!!! Love em! Even some of the haters on there lol but its always a lot of support and I really appreciate that there's a space for the community to discuss and grow the conversation of our culture. Clearly your from IndianHipHopHeads so you gotta go check my answer from then, and no it hasn't changed :) When are u collabing with yungsta again When is your next show in Delhi? Also, which Delhi talent (whom you’ve not collaborated with yet) would you like to work with next? have you heard of r/DHHMemes? if so, what is your opinion on it? Its been incredible to see, as a fan and as someone who is part of the community. Honestly, the last moment that really blew my mind was seeing DIVINE's album launch at NSCI Dome Stadium. Seeing his rise has been magical and I'm truly blessed to have been a part of his journey and movement. That moment when he rode out on the bike and the entire building was literally shaking... goosebumps! He a legend fr! Is there any possibility of you collabbing with Honey Singh? Its never the same process tbh! Sometimes we do songwriting camps and run through beats and freestyle melodies and gibberish until an idea pops up and we roll with it / explore the idea. Or sometimes a topic or a message will be calling out to you so strongly that you need to write first and then find the correct beat or music to match the words. Big love ! Eyyy! Right now, its the orange aesthetic of my album, with different symbols representing the themes involved haha but mostly my Sindhi inner spidey sense cannot resist Gold & Silver chrome lol gotta love it! Kya rappers paisa kama pa rahe hai? How much do you earn? Its huge! First independent project since moving to India and my debut album! I'm super excited and ready to share this with the world. I do have all sorts of flavours on this album but you do get a bit of the Lakhs, Vibe Hai zone of a few songs like Saari Raatein & Bad For Me! Who would you choose to have a sesh 💨 with? A$AP Rocky, Kanye, or Snoop? We actually haven't release anything yet, but I have a collab with Full Power in the works! Hope to get it out this year after the album! Big fan of his new album and his overall craft! He's a G! I am a Meme Connoisseur so I will definitely check em out soon! Love the songs in gully boy. I have already memorised three of them Would love to! He's been super supportive and has shared my music on multiple occasions. KANYE ALL DAYYYYYYYY Another collab with Krsna? Also your bars are 🔥 what's the mood of this album? Bro did you spend time with Kaam Bhari on the set of gully boy? That dude is fuckin legit!! How much you make from albums? Can we expect some fire collabs in the album? Another? Pehela konsa hai? iska answer dediya toh nipple pe shah rule ka tatto karaunga./s Mickey Singh, Lisa Mishra, Abhijay Sharma, Sammohit, Dorwin John, Anik Khan, and more! All of them brought their A game! there seems to be a relation between your last project hooked and cyrbiit - how is it similar and what different can we expect from you? also that t-shirt you wore at that sneaker festival was sick, would definitely buy if it ever went on sale Shahrule bhai seedhe maut ke bare main kuch kaho I dont know who you are. And I haven’t heard a your songs. But those are nice glasses. Sonically a little trap, old school boom bap, and a few afro beats / amapiano vibes! Lot of self reflection to say the least. He's a G indeed!!! Super talented and humble! The whole vibe on set was just banter and jokes. D'Evil roasting everyone and all of us are laughing until he focuses on you lmao that sounds awesome! Haha sounds like a fuckin trip bro! It’s all fun n games till D’Evil looks at you 💀 All the best for your new release bro, will check it out! Hit me up if you swing by Blingapore! Damn. Looking forward to it! there exists one panda too 😃...... oh.. is that fat shaming ? sorry Thank you! Gotta wear them indoors as well when you have a bright future ahead of you. Do check out my album out this Wednesday, I'm wearing some cool shades on the cover art too. Dog bless you, you beautiful man. TBSM! Bhussi was crazy! Looking forward to the mixtape! I never miss a show when they come to Bombay! unacceptable-friend-29 Lmao Definitely agreed, hiphop has historically been very male dominated, esp old school, now that hiphop arrived later in India there’s a much better chance for women to get opportunities Appreciate you! The album march will be on sale very soon after the release :) And yes, this album continues from where Hooked is left off. Hooked EP was about our generations addiction to Materialism via our close connection with our phones & the digital world. That EP definitely had its own transformation but this album is the healing and dealing after affects of those addictions and the toxic zone I was stuck in. Our phones do definitely define our generation so its always part of my skits and my story telling as a symbol of comfort but also a way to reveal harsh truths about our ways today, especially when it comes to dealing with our relationships. Oh yeah! Wtf bro Any plans on collab with frappe ash?? bruh 1/10 roasting skills, please go sip some more haterade, come back and try again! Track is in the works with Full Power! Issa vibe! Working on the tour and will definitely pass through Delhi! I'm a fan of Seedhe Maut, Full Power, Rawal and many more, so hopefully soon! Sindhi AF! Only gold bars in my lines, and whole lot of gold on my neck, I'mma shine! Fr, which one? lol Bro, any tips to fellow producers. I have written many Rap's but I am not able to make beat that would go with my Lyrics. Top 5 ihh? removing yourself I find it difficult to appreciate creative ppl. Do u have any words that can change my mind? (I know art is important but I cant bring myself to like stuff that goes beyond the norm) Force yourself to find 1-2 things to like about the art first before criticising. Art is suppose to be polarising and not suppose to translate to everyone, but the only way it grows and reaches more people is if the audience challenges themselves every now and then to try new things other than the norm they are used to. I'm not a fan of techno or trance in anyway at all, I cannot stand being a rave or any of those parties but I respect the feeling it gives people and the synergy in the room at those parties. I think its just great to be open to more and there's more to experience that way, and if its not for you, you'll know right away and you can move on. I use to produce a lot more and then I saw that I wrote better to other peoples beats. Maybe its not for you or maybe its the type of beat or there could be a lot of factors. But keep trying and learn from your influences! Amazing Merch idea 🔥 Launching super soon🙏🏽🧡 shah brother my question is that \"What are your views on the diss culture growing nowadays ? like is this good for our rap industry or it's gradually making this industry hollow? \" btw love your work and thanks for the AMA. hoping best for the future. DIVINE, Raftaar, KR$NA, Sikander Kahlon & Ikka! Favorite rapper in DHH industry ? Judging by the title of your new album, does your new album promote mental health awareness in any way? How come you manage to ft. Mickey singh in your album . What was the though process according to you . I m guessing that this track might be the commercial cuz mickey singh is a good singh he can use the melody in the track. Can you speak or understand sindhi? I’m 15 and I LOVE writing English lyrics. Do you think it’s possible to find a job with my passion or people just respect those who rap AND write their own stuff? Since I don’t believe i have good vocals so I only write lyrics haha! What were your international influences and fav rappers? Did you leave gully gang? Ass or boobs? Bro caught me. All the best for the album Where did you move from? Bro aap Maggie banate samaye paani aage daalte ho ya pehle sukhi Maggie ? Whats for dinner? Favorite philosopher or a way of life that speaks to you? Are you up for doing a collab with Bella.. Just like you he too drops dope shit.. your combination will be lethal. Are you okay bro ? Ab ye sikka mera bolega To all the ladies who be givin it up … If Gully Boy brought Indian hip hop to the mainstream, what gets it to the next level? Where is your mixed accent from? Ask krsna when's he gonna drop his album. Who is your nail tech? 😍 TBSM4L Kabhi nahi YES Indian hip-hop is amazing I do not listen to Indian Hiphop and has never heard of Shah Rule. But this AMA makes me want to listen to the rapper and the genre. Very thoughtful answers to most questions. This is how an AMA should be. Thank you for doing it. Hope you become very successful if you are not already. Appreciate it! Thank you🙏🏽🧡 Thank you for the response, Mr. Rule. Wut yea that makes sense. I don't have to be welcoming to all sorts of art but I can pick 'my stuff'. Thanks dude!! nah, there actually is a guy named coolnamepanda"
}