{
    "id": "15hu52o",
    "title": "‘Saare mulle kaate jayenge, Ram Ram chillayenge’ ('When we slaughter all the Muslims, they will scream the name of Ram') - Bajrang Dal in Hisar, Haryana, has given an ultimatum of 2 days for Muslims to leave or face the consequences. Video:",
    "url": "https://twitter.com/zakiralityagi/status/1687018152411254784?s=46&t=2TSyKDcpXaQBQU4_CyTmzw",
    "selftext": "Source: Twitter handle of Zakir Ali, The Wire Hindi journalist \n\nhttps://twitter.com/zakiralityagi/status/1687018152411254784?s=46&t=2TSyKDcpXaQBQU4_CyTmzw",
    "flair": "Crime",
    "score": 1,
    "num_comments": 43,
    "created_utc": 1691137526.0,
    "convurl": "https://external-preview.redd.it/AG-KqV36Q6XP81sEWkWQZgZwT4R4H3ROAlwfSD-WCaI.jpg?auto=webp&s=9ba01537bfabc0c654fe2417924bcd4c0fa949b1",
    "comments": [
        "How  are  all our institutions silent on  this open callout for human Slaughter  🤔 .Feels like I'm watch some Taliban shit at this point ..",
        "Terrorism",
        "what happened to supreme court? they released order to take action on hate speech but now remain silent.",
        "Relax, people, this is just part of Modi's \"pasmanda\" \"outreach.\"",
        "The same people are protecting Monu Manesar.\n\nRemember what bjp did when they were threatened by Amritpal, but there is literally no efforts from the govt to capture Monu because he fits with their narrative.",
        "I want to say that this is Gujrat Model, but this is the BJP model.",
        "BJP ko 2024 ka darr hai.. isliye ab desh me bs hindu musalman hoga. 10 saal me kaam kiya nhi.. hindu religion ke naam pe vote mange jaenge...",
        "That’s genocide with extra steps.",
        "Even the Hindu voters are to be blamed for falling for this hatred and enabling genocide mongers.",
        "> Source: Twitter handle of Zakir Ali, The Wire Hindi journalist.   \n    \nHaryana Police: Quick! File some cases against him! How dare he disturb the peace????",
        "Ky ek Hindu apne desh me shanti se genocide bhi nahi kar sakta? Whats the uproar about",
        "As Naseeruddin Shah said in interview with Karan Thapar 'there will be civil war in this country'.",
        "I believe the name is Bharat todo yatra",
        "Did I wake up to 1697? I thought 2023 chal raha tha",
        "Dumb fcuks like Sai Deepak j*rk off to this content.",
        "Some people in our country are seriously f'ed up in their brain. It's pathetic to see the North/Hindi Belt of India in such a pathetic state. No wonder people have been gaining courage in demanding up of splitting up of our nation.",
        "People can be such idiots. My phd father was telling me yesterday that the rpf guy was not targeting muslims as he killed 2 hindus and 2 muslims (his eyes read this in Times of India, now the fucker has started seeing things that fit his narrative)",
        "If a civil war happens, most of the country and its allies will side with the oppressors. We already have a huge number of status quo warriors ready to back the oppression of minorities in this country and it’s not going to change unless something radical happens.",
        "🗿🗿",
        "Same my father who has retired from central govt,was a lifelong Communist party supporter and has never supported hindutva agenda has now started acting like a bhakt. I was shocked that how can someone who has been a left supporter his entire life has suddenly become RW supporter. Then I saw the messages in his phone and understood quickly that he joined a WhatsApp group in which there hate machine going on 24*7. It's the social media and the godi media which has turned people's hatred by fuelling fire with their propaganda(although we don't watch godi media channels at all bcoz I know the shit godi media runs on its channels). But it's the social media which has turned sane people into andhbhakts through their hate and propaganda which has targeted people from every age group.",
        "1 senior officer and 3 muslims on the basis of their identity. The senior also belonged to ST caste and the words that rpf guy sopke after killing those three muslims were \" media has shown the truth . Only modi and yogi are two options\"",
        "Try telling this to my father",
        "Man I'm scared of living in this country now. Thank fuck I'm in the South and it's relatively less crazy down here but it's only a matter of time the cancer spreads down here too. Fuck religion man. If you must kill another to protect your religion, you probably should consider killing yourself. Brain dead trolls",
        "I don't ram would like this",
        "You guys are forgetting one thing. \nThey can create as many riots as they want and kill more of the minorities, but they'll still win. Because Ayodhya.",
        "Basically a get out of jail free card",
        "Is this AdLonely our Critfin?",
        "Yep"
    ],
    "cleaned_text": "saare mulle kaate jayenge ram ram chillayenge slaughter muslims scream name ram bajrang dal hisar haryana given ultimatum days muslims leave face consequences video source twitter handle zakir ali wire hindi journalist ",
    "cleaned_title": "saare mulle kaate jayenge ram ram chillayenge slaughter muslims scream name ram bajrang dal hisar haryana given ultimatum days muslims leave face consequences video",
    "cleaned_selftext": "source twitter handle zakir ali wire hindi journalist",
    "cleaned_comments": "institutions silent open callout human slaughter feels like im watch taliban shit point terrorism happened supreme court released order take action hate speech remain silent relax people part modis pasmanda outreach people protecting monu manesar remember bjp threatened amritpal literally efforts govt capture monu fits narrative want say gujrat model bjp model bjp ko ka darr hai isliye ab desh bs hindu musalman hoga saal kaam kiya nhi hindu religion ke naam pe vote mange jaenge thats genocide extra steps even hindu voters blamed falling hatred enabling genocide mongers source twitter handle zakir ali wire hindi journalist haryana police quick file cases dare disturb peace ky ek hindu apne desh shanti se genocide bhi nahi kar sakta whats uproar naseeruddin shah said interview karan thapar civil war country believe name bharat todo yatra wake thought chal raha tha dumb fcuks like sai deepak jrk content people country seriously fed brain pathetic see northhindi belt india pathetic state wonder people gaining courage demanding splitting nation people idiots phd father telling yesterday rpf guy targeting muslims killed hindus muslims eyes read times india fucker started seeing things fit narrative civil war happens country allies side oppressors already huge number status quo warriors ready back oppression minorities country going change unless something radical happens father retired central govtwas lifelong communist party supporter never supported hindutva agenda started acting like bhakt shocked someone left supporter entire life suddenly become rw supporter saw messages phone understood quickly joined whatsapp group hate machine going social media godi media turned peoples hatred fuelling fire propagandaalthough dont watch godi media channels bcoz know shit godi media runs channels social media turned sane people andhbhakts hate propaganda targeted people every age group senior officer muslims basis identity senior also belonged st caste words rpf guy sopke killing three muslims media shown truth modi yogi two options try telling father man im scared living country thank fuck im south relatively less crazy matter time cancer spreads fuck religion man must kill another protect religion probably consider killing brain dead trolls dont ram would like guys forgetting one thing create many riots want kill minorities theyll still win ayodhya basically get jail free card adlonely critfin yep",
    "light_cleaned_title": "‘Saare mulle kaate jayenge, Ram Ram chillayenge’ ('When we slaughter all the Muslims, they will scream the name of Ram') - Bajrang Dal in Hisar, Haryana, has given an ultimatum of 2 days for Muslims to leave or face the consequences. Video:",
    "light_cleaned_selftext": "Source: Twitter handle of Zakir Ali, The Wire Hindi journalist",
    "light_cleaned_comments": "How are all our institutions silent on this open callout for human Slaughter 🤔 .Feels like I'm watch some Taliban shit at this point .. Terrorism what happened to supreme court? they released order to take action on hate speech but now remain silent. Relax, people, this is just part of Modi's \"pasmanda\" \"outreach.\" The same people are protecting Monu Manesar. Remember what bjp did when they were threatened by Amritpal, but there is literally no efforts from the govt to capture Monu because he fits with their narrative. I want to say that this is Gujrat Model, but this is the BJP model. BJP ko 2024 ka darr hai.. isliye ab desh me bs hindu musalman hoga. 10 saal me kaam kiya nhi.. hindu religion ke naam pe vote mange jaenge... That’s genocide with extra steps. Even the Hindu voters are to be blamed for falling for this hatred and enabling genocide mongers. > Source: Twitter handle of Zakir Ali, The Wire Hindi journalist. Haryana Police: Quick! File some cases against him! How dare he disturb the peace???? Ky ek Hindu apne desh me shanti se genocide bhi nahi kar sakta? Whats the uproar about As Naseeruddin Shah said in interview with Karan Thapar 'there will be civil war in this country'. I believe the name is Bharat todo yatra Did I wake up to 1697? I thought 2023 chal raha tha Dumb fcuks like Sai Deepak j*rk off to this content. Some people in our country are seriously f'ed up in their brain. It's pathetic to see the North/Hindi Belt of India in such a pathetic state. No wonder people have been gaining courage in demanding up of splitting up of our nation. People can be such idiots. My phd father was telling me yesterday that the rpf guy was not targeting muslims as he killed 2 hindus and 2 muslims (his eyes read this in Times of India, now the fucker has started seeing things that fit his narrative) If a civil war happens, most of the country and its allies will side with the oppressors. We already have a huge number of status quo warriors ready to back the oppression of minorities in this country and it’s not going to change unless something radical happens. 🗿🗿 Same my father who has retired from central govt,was a lifelong Communist party supporter and has never supported hindutva agenda has now started acting like a bhakt. I was shocked that how can someone who has been a left supporter his entire life has suddenly become RW supporter. Then I saw the messages in his phone and understood quickly that he joined a WhatsApp group in which there hate machine going on 24*7. It's the social media and the godi media which has turned people's hatred by fuelling fire with their propaganda(although we don't watch godi media channels at all bcoz I know the shit godi media runs on its channels). But it's the social media which has turned sane people into andhbhakts through their hate and propaganda which has targeted people from every age group. 1 senior officer and 3 muslims on the basis of their identity. The senior also belonged to ST caste and the words that rpf guy sopke after killing those three muslims were \" media has shown the truth . Only modi and yogi are two options\" Try telling this to my father Man I'm scared of living in this country now. Thank fuck I'm in the South and it's relatively less crazy down here but it's only a matter of time the cancer spreads down here too. Fuck religion man. If you must kill another to protect your religion, you probably should consider killing yourself. Brain dead trolls I don't ram would like this You guys are forgetting one thing. They can create as many riots as they want and kill more of the minorities, but they'll still win. Because Ayodhya. Basically a get out of jail free card Is this AdLonely our Critfin? Yep"
}