{
    "id": "1457y3f",
    "title": "Does anyone remember the Karan Johar's bollywood documentary on History TV18 and how can one watch it now?",
    "url": "https://www.reddit.com/r/india/comments/1457y3f/does_anyone_remember_the_karan_johars_bollywood/",
    "selftext": "Ok,  so when I watched the romantics (that bollywood documentary on netflix  for someone living under the rock and doesn't know yet), I couldn't help  but reminisce of something similar where a lot of bollywood stars came  and talked about bollywood trends and history. After a lot of googling, I  now know it was called 'Bollywood@100' and Karan Johar hosted it.\n\n[A news article for reference if anyone needs](https://www.tellychakkar.com/tv/tv-news/karan-johar-excited-he-relives-100-years-of-cinema-history-tv18)\n\n[I was also able to find the trailer here](https://www.youtube.com/watch?v=IV9cQy6pqSA)\n\nSo  yeah, I remember it being really informative and fun and it wasn't as  much just for the chopra's but the history of bollywood as a whole. Does  anyone know where I can find it to stream now? I tried to find everyone  but to no avail. It's like everyone just forgot about it, I had a very  tough time just finding the name of it.\n\nI wanna watch it again fr ;\\~;",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 2,
    "created_utc": 1686323718.0,
    "convurl": "https://external-preview.redd.it/sYMW4elt5UyQRrFBL3v024jwvI8j8rK5y1I32SllPUM.jpg?auto=webp&v=enabled&s=8ad2d1e6c09d7662b6787b03765caa5113b0fbab",
    "comments": [
        "Ask in r/bollywood maybe.",
        "Yeah me too I have been looking for it for years now. Did you find it?",
        "No man, couldn't find it anywhere :'("
    ],
    "cleaned_text": "anyone remember karan johars bollywood documentary history tv one watch ok watched romantics bollywood documentary netflix someone living rock doesnt know yet couldnt help reminisce something similar lot bollywood stars came talked bollywood trends history lot googling know called bollywood karan johar hosted news article reference anyone needshttpswwwtellychakkarcomtvtvnewskaranjoharexcitedherelivesyearsofcinemahistorytv also able find trailer herehttpswwwyoutubecomwatchvivcqypqsa yeah remember really informative fun wasnt much chopras history bollywood whole anyone know find stream tried find everyone avail like everyone forgot tough time finding name wan na watch fr ",
    "cleaned_title": "anyone remember karan johars bollywood documentary history tv one watch",
    "cleaned_selftext": "ok watched romantics bollywood documentary netflix someone living rock doesnt know yet couldnt help reminisce something similar lot bollywood stars came talked bollywood trends history lot googling know called bollywood karan johar hosted news article reference anyone needshttpswwwtellychakkarcomtvtvnewskaranjoharexcitedherelivesyearsofcinemahistorytv also able find trailer herehttpswwwyoutubecomwatchvivcqypqsa yeah remember really informative fun wasnt much chopras history bollywood whole anyone know find stream tried find everyone avail like everyone forgot tough time finding name wan na watch fr",
    "cleaned_comments": "ask rbollywood maybe yeah looking years find man couldnt find anywhere",
    "light_cleaned_title": "Does anyone remember the Karan Johar's bollywood documentary on History TV18 and how can one watch it now?",
    "light_cleaned_selftext": "Ok, so when I watched the romantics (that bollywood documentary on netflix for someone living under the rock and doesn't know yet), I couldn't help but reminisce of something similar where a lot of bollywood stars came and talked about bollywood trends and history. After a lot of googling, I now know it was called 'Bollywood@100' and Karan Johar hosted it. [A news article for reference if anyone needs](https://www.tellychakkar.com/tv/tv-news/karan-johar-excited-he-relives-100-years-of-cinema-history-tv18) [I was also able to find the trailer here](https://www.youtube.com/watch?v=IV9cQy6pqSA) So yeah, I remember it being really informative and fun and it wasn't as much just for the chopra's but the history of bollywood as a whole. Does anyone know where I can find it to stream now? I tried to find everyone but to no avail. It's like everyone just forgot about it, I had a very tough time just finding the name of it. I wanna watch it again fr ;\\~;",
    "light_cleaned_comments": "Ask in r/bollywood maybe. Yeah me too I have been looking for it for years now. Did you find it? No man, couldn't find it anywhere :'("
}