{
    "id": "hwau4v",
    "title": "Fridays For Future India resists illegal website blocking #WhatTheBlock",
    "url": "https://www.reddit.com/r/india/comments/hwau4v/fridays_for_future_india_resists_illegal_website/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/mfxqn6eexjc51.png?width=1024&amp;format=png&amp;auto=webp&amp;s=cc5adf2bbd5e71a63716cbfa85e8ed14e4e901d3\n\n### Tl;dr\n\nOn 22 July 2020, Fridays for Future (FFF) sent a representation to the Delhi Police seeking restoration of its website which was blocked for encouraging public participation in the consultation on the Draft EIA Notification. In its representation, FFF has clarified that it merely provided a template for citizens to submit their objections and the emails were actually sent from personal email IDs of concerned individuals who could edit the content of the email. The representation also strenuously objects to the Delhi Police's characterization of FFF's email campaign as an unlawful and terrorist activity which threatens sovereignty, peace and tranquility and promotes religious hatred. \n\n### Background\n\nFridays for Future ('FFF') is an informal collective of volunteers who trace their roots to the international climate change movement launched by Greta Thunberg and other young environmental activists. To protect the environment, FFF has organized climate strikes, tree plantation drives, beach clean ups and email campaigns. Most recently, FFF launched an email campaign to encourage public participation in the consultation being held by the Ministry of Environment and Forests on the Draft Environmental Impact Assessment Notification, 2020 ('Draft EIA Notification'). \n\nSince 10 July 2020, FFF's website hosted at [**https://www.fridaysforfuture.in**](https://www.fridaysforfuture.in/) has been disabled by its domain service provider, Big Rock. Upon enquiry, Big Rock revealed that the website had been blocked in accordance with a notice received from the Delhi Police under Section 79(3)(b) of the Information Technology Act, 2000. A copy of this notice was sent to FFF by Big Rock on 14 July 2020 and it revealed that basis for the notice was a complaint received from Mr. Prakash Javadekar, Minister of Environment and Forests regarding *\"the incident of getting multiple emails on his email address with the subject name similar to ‘EIA 2020’.\"*\n\nAfter receiving a complaint from Mr. Javadekar, the Delhi Police conducted some kind of investigation which allegedly revealed that emails were being sent \"mainly\" from the FFF website. This sending of emails to a public official has been characterized by the Delhi Police as an act which which *“may disturb peace, sovereignty of India”* and it has also been alleged that the FFF website displays *“objectionable contents and unlawful activities or terrorist act, which are dangerous for the peace, tranquillity and sovereignty of the India (sic)”* and contains *“religious hatred content/material.”*\n\n### Representation to the Delhi Police\n\nOn 22 July 2020, FFF sent a representation to the Delhi Police seeking restoration of its website and highlighted several inaccuracies in the notice issued by the Delhi Police. The representation clarifies that the FFF website merely provided a template to make it easier for citizens to participate in the public consultation on the Draft EIA Notification and it did not send the emails received by Mr. Javadekar which were actually sent by concerned citizens from their personal email IDs. The template provided on the FFF website can be loaded into a person's email service, and after this, the concerned individual is free to edit the content of the email and must choose to hit 'send.' Therefore, FFF does not exercise any control over the content or number of emails which are finally received by public officials.\n\nIn addition to providing a template, the FFF website also provided email IDs for Mr. Javadekar, the Ministry of Environment and Forests and the dedicated email address for the Draft EIA Notification consultation process. However, these email IDs were already available in the public domain and citizens expressing their concerns to their public representatives is part of any healthy democracy. This is especially true during the COVID-19 pandemic which has made it very difficult for environmentalists to host in person demonstrations or protests. As a result,  contacting public officials through digital means is the only way for citizens to express their objections about the Draft EIA Notification. \n\nIt must also be noted that the short timeline for the consultation process for the Draft EIA Notification has drawn heavy criticism, and the Hon'ble Delhi High Court has also intervened to extend the deadline for submission of comments till 11 August 2020. In a similar vein, the Hon'ble Karnataka High Court has directed the government to give wide publicity to the Draft EIA Notification in local languages so that citizens can submit their objections by 11 August 2020. Therefore, even courts have recognized that citizens may face difficulties in participating in the consultation process in such a short time frame, and the email campaign launched by FFF only sought to make this process easier for people concerned about the dilution of environmental protection standards. \n\nIFF is providing legal assistance to FFF in this matter and we are very grateful to Advocate Abhinav Sekhri and our Of Counsel Vrinda Bhandari for their time and efforts. As an organization born out of the SaveTheInternet movement which involved over a million citizens writing to the Telecom Regulatory Authority of India in favour of net neutrality, we fully recognize the importance of digital activism and we are committing to defending the rights of young environmentalists who are trying to create a better future for all of us. \n\n### Statement by FFF India \n\nA statement by Friday's For Future on their social media page is embedded below.\n\nhttps://preview.redd.it/z5xy0mdmxjc51.png?width=483&amp;format=png&amp;auto=webp&amp;s=a09973612ad52f2326ebe9c04e299973c599a2fa\n\n### Important Documents\n\n1. Notice dated 08.07.2020 sent by Delhi Police ([**link**](https://drive.google.com/file/d/1O4CIzziS-7wJjBoF8J00--4q8A7PbHir/view?usp=sharing))\n2. Representation dated 22.07.2020 sent by FFF ([**link**](https://drive.google.com/file/d/1YiJLIR6tVtarkZHhC-k7DZUzNemPSly_/view?usp=sharing))\n3. Previous update on blocking of FFF's website ([**link**](https://internetfreedom.in/blocking_env_web/))\n\n[**If you would like IFF to continue its work against such arbitrary website blocking, please consider donating to the Internet Freedom Device Drive that we are hosting to provide tech support to our staff.**](https://internetfreedom.in/iff-device-drive/)",
    "flair": "Policy/Economy",
    "score": 141,
    "num_comments": 3,
    "created_utc": 1595486137,
    "convurl": "https://b.thumbs.redditmedia.com/nxYElLn5MkkrOV6ZVruH6I-Kc3lac2JmAfgy145s1zg.jpg",
    "comments": [
        "Remove porn block 😢",
        "Remove blocking of websites completely. None should be blocked. Neither porn, torrents, NSFW subreddits, nothing",
        "Retards will disagree."
    ],
    "cleaned_text": "fridays future india resists illegal website blocking whattheblock ampxb tldr july fridays future fff sent representation delhi police seeking restoration website blocked encouraging public participation consultation draft eia notification representation fff clarified merely provided template citizens submit objections emails actually sent personal email ids concerned individuals could edit content email representation also strenuously objects delhi polices characterization fffs email campaign unlawful terrorist activity threatens sovereignty peace tranquility promotes religious hatred background fridays future fff informal collective volunteers trace roots international climate change movement launched greta thunberg young environmental activists protect environment fff organized climate strikes tree plantation drives beach clean ups email campaigns recently fff launched email campaign encourage public participation consultation held ministry environment forests draft environmental impact assessment notification draft eia notification since july fffs website hosted httpswwwfridaysforfutureinhttpswwwfridaysforfuturein disabled domain service provider big rock upon enquiry big rock revealed website blocked accordance notice received delhi police section b information technology act copy notice sent fff big rock july revealed basis notice complaint received mr prakash javadekar minister environment forests regarding incident getting multiple emails email address subject name similar eia receiving complaint mr javadekar delhi police conducted kind investigation allegedly revealed emails sent mainly fff website sending emails public official characterized delhi police act may disturb peace sovereignty india also alleged fff website displays objectionable contents unlawful activities terrorist act dangerous peace tranquillity sovereignty india sic contains religious hatred contentmaterial representation delhi police july fff sent representation delhi police seeking restoration website highlighted several inaccuracies notice issued delhi police representation clarifies fff website merely provided template make easier citizens participate public consultation draft eia notification send emails received mr javadekar actually sent concerned citizens personal email ids template provided fff website loaded persons email service concerned individual free edit content email must choose hit send therefore fff exercise control content number emails finally received public officials addition providing template fff website also provided email ids mr javadekar ministry environment forests dedicated email address draft eia notification consultation process however email ids already available public domain citizens expressing concerns public representatives part healthy democracy especially true covid pandemic made difficult environmentalists host person demonstrations protests result contacting public officials digital means way citizens express objections draft eia notification must also noted short timeline consultation process draft eia notification drawn heavy criticism honble delhi high court also intervened extend deadline submission comments till august similar vein honble karnataka high court directed government give wide publicity draft eia notification local languages citizens submit objections august therefore even courts recognized citizens may face difficulties participating consultation process short time frame email campaign launched fff sought make process easier people concerned dilution environmental protection standards iff providing legal assistance fff matter grateful advocate abhinav sekhri counsel vrinda bhandari time efforts organization born savetheinternet movement involved million citizens writing telecom regulatory authority india favour net neutrality fully recognize importance digital activism committing defending rights young environmentalists trying create better future us statement fff india statement fridays future social media page embedded important documents notice dated sent delhi police linkhttpsdrivegooglecomfiledocizziswjjbofjqapbhirviewuspsharing representation dated sent fff linkhttpsdrivegooglecomfiledyijlirtvtarkzhhckdzuznempslyviewuspsharing previous update blocking fffs website linkhttpsinternetfreedominblockingenvweb would like iff continue work arbitrary website blocking please consider donating internet freedom device drive hosting provide tech support staffhttpsinternetfreedominiffdevicedrive ",
    "cleaned_title": "fridays future india resists illegal website blocking whattheblock",
    "cleaned_selftext": "ampxb tldr july fridays future fff sent representation delhi police seeking restoration website blocked encouraging public participation consultation draft eia notification representation fff clarified merely provided template citizens submit objections emails actually sent personal email ids concerned individuals could edit content email representation also strenuously objects delhi polices characterization fffs email campaign unlawful terrorist activity threatens sovereignty peace tranquility promotes religious hatred background fridays future fff informal collective volunteers trace roots international climate change movement launched greta thunberg young environmental activists protect environment fff organized climate strikes tree plantation drives beach clean ups email campaigns recently fff launched email campaign encourage public participation consultation held ministry environment forests draft environmental impact assessment notification draft eia notification since july fffs website hosted httpswwwfridaysforfutureinhttpswwwfridaysforfuturein disabled domain service provider big rock upon enquiry big rock revealed website blocked accordance notice received delhi police section b information technology act copy notice sent fff big rock july revealed basis notice complaint received mr prakash javadekar minister environment forests regarding incident getting multiple emails email address subject name similar eia receiving complaint mr javadekar delhi police conducted kind investigation allegedly revealed emails sent mainly fff website sending emails public official characterized delhi police act may disturb peace sovereignty india also alleged fff website displays objectionable contents unlawful activities terrorist act dangerous peace tranquillity sovereignty india sic contains religious hatred contentmaterial representation delhi police july fff sent representation delhi police seeking restoration website highlighted several inaccuracies notice issued delhi police representation clarifies fff website merely provided template make easier citizens participate public consultation draft eia notification send emails received mr javadekar actually sent concerned citizens personal email ids template provided fff website loaded persons email service concerned individual free edit content email must choose hit send therefore fff exercise control content number emails finally received public officials addition providing template fff website also provided email ids mr javadekar ministry environment forests dedicated email address draft eia notification consultation process however email ids already available public domain citizens expressing concerns public representatives part healthy democracy especially true covid pandemic made difficult environmentalists host person demonstrations protests result contacting public officials digital means way citizens express objections draft eia notification must also noted short timeline consultation process draft eia notification drawn heavy criticism honble delhi high court also intervened extend deadline submission comments till august similar vein honble karnataka high court directed government give wide publicity draft eia notification local languages citizens submit objections august therefore even courts recognized citizens may face difficulties participating consultation process short time frame email campaign launched fff sought make process easier people concerned dilution environmental protection standards iff providing legal assistance fff matter grateful advocate abhinav sekhri counsel vrinda bhandari time efforts organization born savetheinternet movement involved million citizens writing telecom regulatory authority india favour net neutrality fully recognize importance digital activism committing defending rights young environmentalists trying create better future us statement fff india statement fridays future social media page embedded important documents notice dated sent delhi police linkhttpsdrivegooglecomfiledocizziswjjbofjqapbhirviewuspsharing representation dated sent fff linkhttpsdrivegooglecomfiledyijlirtvtarkzhhckdzuznempslyviewuspsharing previous update blocking fffs website linkhttpsinternetfreedominblockingenvweb would like iff continue work arbitrary website blocking please consider donating internet freedom device drive hosting provide tech support staffhttpsinternetfreedominiffdevicedrive",
    "cleaned_comments": "remove porn block remove blocking websites completely none blocked neither porn torrents nsfw subreddits nothing retards disagree",
    "light_cleaned_title": "Fridays For Future India resists illegal website blocking #WhatTheBlock",
    "light_cleaned_selftext": "### Tl;dr On 22 July 2020, Fridays for Future (FFF) sent a representation to the Delhi Police seeking restoration of its website which was blocked for encouraging public participation in the consultation on the Draft EIA Notification. In its representation, FFF has clarified that it merely provided a template for citizens to submit their objections and the emails were actually sent from personal email IDs of concerned individuals who could edit the content of the email. The representation also strenuously objects to the Delhi Police's characterization of FFF's email campaign as an unlawful and terrorist activity which threatens sovereignty, peace and tranquility and promotes religious hatred. ### Background Fridays for Future ('FFF') is an informal collective of volunteers who trace their roots to the international climate change movement launched by Greta Thunberg and other young environmental activists. To protect the environment, FFF has organized climate strikes, tree plantation drives, beach clean ups and email campaigns. Most recently, FFF launched an email campaign to encourage public participation in the consultation being held by the Ministry of Environment and Forests on the Draft Environmental Impact Assessment Notification, 2020 ('Draft EIA Notification'). Since 10 July 2020, FFF's website hosted at [**https://www.fridaysforfuture.in**](https://www.fridaysforfuture.in/) has been disabled by its domain service provider, Big Rock. Upon enquiry, Big Rock revealed that the website had been blocked in accordance with a notice received from the Delhi Police under Section 79(3)(b) of the Information Technology Act, 2000. A copy of this notice was sent to FFF by Big Rock on 14 July 2020 and it revealed that basis for the notice was a complaint received from Mr. Prakash Javadekar, Minister of Environment and Forests regarding *\"the incident of getting multiple emails on his email address with the subject name similar to ‘EIA 2020’.\"* After receiving a complaint from Mr. Javadekar, the Delhi Police conducted some kind of investigation which allegedly revealed that emails were being sent \"mainly\" from the FFF website. This sending of emails to a public official has been characterized by the Delhi Police as an act which which *“may disturb peace, sovereignty of India”* and it has also been alleged that the FFF website displays *“objectionable contents and unlawful activities or terrorist act, which are dangerous for the peace, tranquillity and sovereignty of the India (sic)”* and contains *“religious hatred content/material.”* ### Representation to the Delhi Police On 22 July 2020, FFF sent a representation to the Delhi Police seeking restoration of its website and highlighted several inaccuracies in the notice issued by the Delhi Police. The representation clarifies that the FFF website merely provided a template to make it easier for citizens to participate in the public consultation on the Draft EIA Notification and it did not send the emails received by Mr. Javadekar which were actually sent by concerned citizens from their personal email IDs. The template provided on the FFF website can be loaded into a person's email service, and after this, the concerned individual is free to edit the content of the email and must choose to hit 'send.' Therefore, FFF does not exercise any control over the content or number of emails which are finally received by public officials. In addition to providing a template, the FFF website also provided email IDs for Mr. Javadekar, the Ministry of Environment and Forests and the dedicated email address for the Draft EIA Notification consultation process. However, these email IDs were already available in the public domain and citizens expressing their concerns to their public representatives is part of any healthy democracy. This is especially true during the COVID-19 pandemic which has made it very difficult for environmentalists to host in person demonstrations or protests. As a result, contacting public officials through digital means is the only way for citizens to express their objections about the Draft EIA Notification. It must also be noted that the short timeline for the consultation process for the Draft EIA Notification has drawn heavy criticism, and the Hon'ble Delhi High Court has also intervened to extend the deadline for submission of comments till 11 August 2020. In a similar vein, the Hon'ble Karnataka High Court has directed the government to give wide publicity to the Draft EIA Notification in local languages so that citizens can submit their objections by 11 August 2020. Therefore, even courts have recognized that citizens may face difficulties in participating in the consultation process in such a short time frame, and the email campaign launched by FFF only sought to make this process easier for people concerned about the dilution of environmental protection standards. IFF is providing legal assistance to FFF in this matter and we are very grateful to Advocate Abhinav Sekhri and our Of Counsel Vrinda Bhandari for their time and efforts. As an organization born out of the SaveTheInternet movement which involved over a million citizens writing to the Telecom Regulatory Authority of India in favour of net neutrality, we fully recognize the importance of digital activism and we are committing to defending the rights of young environmentalists who are trying to create a better future for all of us. ### Statement by FFF India A statement by Friday's For Future on their social media page is embedded below. ### Important Documents 1. Notice dated 08.07.2020 sent by Delhi Police ([**link**](https://drive.google.com/file/d/1O4CIzziS-7wJjBoF8J00--4q8A7PbHir/view?usp=sharing)) 2. Representation dated 22.07.2020 sent by FFF ([**link**](https://drive.google.com/file/d/1YiJLIR6tVtarkZHhC-k7DZUzNemPSly_/view?usp=sharing)) 3. Previous update on blocking of FFF's website ([**link**](https://internetfreedom.in/blocking_env_web/)) [**If you would like IFF to continue its work against such arbitrary website blocking, please consider donating to the Internet Freedom Device Drive that we are hosting to provide tech support to our staff.**](https://internetfreedom.in/iff-device-drive/)",
    "light_cleaned_comments": "Remove porn block 😢 Remove blocking of websites completely. None should be blocked. Neither porn, torrents, NSFW subreddits, nothing Retards will disagree."
}