{
    "id": "16x3e59",
    "title": "NDTV: \"No Posters Or Bribes, Vote For Me If You Want To\": Nitin Gadkari",
    "url": "https://www.ndtv.com/india-news/no-posters-or-bribes-vote-for-me-if-you-want-to-nitin-gadkari-4439031?utm_source=newsshowcase&utm_medium=gnews&utm_campaign=CDAqEAgAKgcICjCPyf8KMMit-QIwxqXOAg&utm_content=bullets",
    "selftext": "An exception! Wonder if this man goes up there😊😊😊",
    "flair": "Politics",
    "score": 1,
    "num_comments": 25,
    "created_utc": 1696172261.0,
    "convurl": "https://external-preview.redd.it/-v5mn8b5qR19FAxswA7l0BBYxTXxY91Z1JjjhO85gkA.jpg?auto=webp&s=6b71573ffc939d49a24d69ec8de1b3b2d3f68d8c",
    "comments": [
        "One of the most corrupt politicians, and yet gets things done and is acceptable to both sides of the aisle. He's also a. committed RSS mam through and through. But I've never seen him engage in Hindu - Muslim nonsense and fanning hatred. Interesting politician, I respect and loathe him at the same time.",
        "Seems he is really angry with mudi",
        "He’s just one of the character archetype in this shitshow… move along people, this is still BJ Party and politics.",
        "Why so?",
        "Just wondering . Seen a video where he didn't bow and shake hands",
        "Mudi spent 4100 crore on posters for g20 /s",
        "PM ke liye utariye phir",
        "Scania Agrees.",
        "says the guy who robbed paving the road. - CAG",
        "Link.",
        "\"It should have been me, not him\"",
        "Bcoz money 💰 talks 👄",
        "Similar take. But i feel least corrupt of the lot. Isn't after lofty designs atleast his image doesn't seem to be. He doesn't shove ideology in anyone's face. Our highways are so good. And some credit goes to him.",
        "Only leader in bjp with 56inch chest",
        "Exception? He is part of the system.",
        "Just putting this up here .\n\nhttps://theprint.in/india/oppn-cries-scam-govt-says-erroneous-whats-in-cag-report-on-rs-250-cr-km-dwarka-expressway/1718639/",
        "Angry coz he is jealous",
        "Bus bhai /s",
        "Of what",
        "Who else but Modi?",
        "Modani"
    ],
    "cleaned_text": "ndtv posters bribes vote want nitin gadkari exception wonder man goes ",
    "cleaned_title": "ndtv posters bribes vote want nitin gadkari",
    "cleaned_selftext": "exception wonder man goes",
    "cleaned_comments": "one corrupt politicians yet gets things done acceptable sides aisle hes also committed rss mam ive never seen engage hindu muslim nonsense fanning hatred interesting politician respect loathe time seems really angry mudi hes one character archetype shitshow move along people still bj party politics wondering seen video didnt bow shake hands mudi spent crore posters g pm ke liye utariye phir scania agrees says guy robbed paving road cag link bcoz money talks similar take feel least corrupt lot isnt lofty designs atleast image doesnt seem doesnt shove ideology anyones face highways good credit goes leader bjp inch chest exception part system putting angry coz jealous bus bhai else modi modani",
    "light_cleaned_title": "NDTV: \"No Posters Or Bribes, Vote For Me If You Want To\": Nitin Gadkari",
    "light_cleaned_selftext": "An exception! Wonder if this man goes up there😊😊😊",
    "light_cleaned_comments": "One of the most corrupt politicians, and yet gets things done and is acceptable to both sides of the aisle. He's also a. committed RSS mam through and through. But I've never seen him engage in Hindu - Muslim nonsense and fanning hatred. Interesting politician, I respect and loathe him at the same time. Seems he is really angry with mudi He’s just one of the character archetype in this shitshow… move along people, this is still BJ Party and politics. Why so? Just wondering . Seen a video where he didn't bow and shake hands Mudi spent 4100 crore on posters for g20 /s PM ke liye utariye phir Scania Agrees. says the guy who robbed paving the road. - CAG Link. \"It should have been me, not him\" Bcoz money 💰 talks 👄 Similar take. But i feel least corrupt of the lot. Isn't after lofty designs atleast his image doesn't seem to be. He doesn't shove ideology in anyone's face. Our highways are so good. And some credit goes to him. Only leader in bjp with 56inch chest Exception? He is part of the system. Just putting this up here . Angry coz he is jealous Bus bhai /s Of what Who else but Modi? Modani"
}