{
    "id": "16dw5kk",
    "title": "My post about Bribe and nepotism in India blew up earlier - Declaring victory in my quest to avoid paying a large graft/fee",
    "url": "https://www.reddit.com/r/india/comments/16dw5kk/my_post_about_bribe_and_nepotism_in_india_blew_up/",
    "selftext": "Thanks to many of you had supported my quest and also asked me to keep you posted. Sharing my experience and victory. \n\nI have been pursuing the update of our land records at the office of Bangalore Urban Deputy Commissioner. [TL;DR – Details of #mystory in the Change petition](https://www.change.org/RevenueKarnataka).  \n\n It has been a couple of years since I started actively posting on social media and a [Change.org](https://www.change.org/RevenueKarnataka) petition drive. and I am proud to say that **I have finally received a favorable order** from Bengaluru Deputy Commissioner. All done without paying a HUGE bribe that had been demanded by agents and middlemen. All done by repeatedly knocking on the doors of High Court. \n\n**A bit of background and context:** My dad, a retired Indian military officer acquired the title to a 20 Gunta (half-acre) land in Vaderahalli village in North Bengaluru in 1995. The registration had been pending for nearly 25 years for some technical reason that officials hadn't been able to explain. \n\nAfter repeated petitions and RTIs to the DC, I took the matter to Karnataka High Court in 2017 and 2023:\n\n* WP 46964/2017 \n* WA 6697/2017 \n* WP 6929/2023\n\nThe honorable #HighCourt passed a judgement directing the office of #Bangaluru Deputy Commissioner (DC) to review and adjudicate the matter.  As the officials of Bangalore Deputy Commissioner’s office delayed action on this latest order, my lawyer filed a **Contempt of Court in Karnataka High Court** (CCC 734/2023) on 25-07-2023.  \n\n\nThe officials of Bangalore Deputy Commissioner’s finally passed an order about my land records on 04 Aug 2023. A copy was mailed to me last week. \n\nIt hasn't been an easy journey thus far. 5-6 years of repeated legal battles and knocking on the doors of the High Court.\n\n**Lessons here:**\n\n* If you are well 'connected,' politically or with high ranking officials, all this doesn't matter since your  files will be looked at expeditiously. \n* From the comments and feedback I received, Revenue departments that manage land records are notorious for corruption and bribes. However, even they are bound by the law of the land \n* If are right and you have time and patience on your side, pursue your interactions with local officials legally. \n* Legal battles are lengthy but justice eventually prevails.  \n* Some folks fear courts and legal battles. However, if you have a lawyer who knows the system and process, you should trust him/her to do the right thing.   \n",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694233492.0,
    "convurl": "https://external-preview.redd.it/Y32CksZe3-RaJVTHS3HyVGaYCed2eBAoIYucNz8LFZQ.jpg?auto=webp&s=d19baf38673dc4a2fcc9e240050ce0095d1d1238",
    "comments": [
        "Congrats, Mohan!\n\nAny guesstimate on the ratio of total amount you spent via legal route to the demanded bribe?\n\nAnd were any bribes demanded in the justice system too?",
        "Thanks.\n\n> Any guesstimate on the ratio of total amount you spent via legal route to the demanded bribe?\n> \n\nLegal fee was a fraction of the bribe demanded by middlemen. Look at it this way. The land is in North Bengaluru and the 'fee' is about 10 % of \"current market value\"... whatever that means. \n\n> And were any bribes demanded in the justice system too?\n\nNo. But I was flabbergast over total disregards officials show for court orders. \n\nI was pleasantly surprised over how the process in HC is digitized. Reports and orders are available online to review (if you know where to look)",
        "Useful info, thanks. Enjoy the well-deserved peace of mind!",
        "Finally. As mentioned earlier we have to keep at it but it does pay. \n\nBeen part of it such a case with BDA for our apartment clubhouse, that had to go to SC contempt",
        "They wanted 10% of total land value to update the records! Have these officers been charged with bribery yet? Any chance you could anonymously reports the higher up to tax department? If they have been asking everyone to this kind of hand greasing, it's unlikely that they have paid taxes on their earnings.",
        "What do we learn from all this?\n\nOur country is so corrupt that unless you bring media attention or you don't have any political connections, it is impossible to get the job done by any govt office without bribe.\n\nPathetic."
    ],
    "cleaned_text": "post bribe nepotism india blew earlier declaring victory quest avoid paying large graftfee thanks many supported quest also asked keep posted sharing experience victory pursuing update land records office bangalore urban deputy commissioner tldr details mystory change petitionhttpswwwchangeorgrevenuekarnataka couple years since started actively posting social media changeorghttpswwwchangeorgrevenuekarnataka petition drive proud say finally received favorable order bengaluru deputy commissioner done without paying huge bribe demanded agents middlemen done repeatedly knocking doors high court bit background context dad retired indian military officer acquired title gunta halfacre land vaderahalli village north bengaluru registration pending nearly years technical reason officials hadnt able explain repeated petitions rtis dc took matter karnataka high court wp wa wp honorable highcourt passed judgement directing office bangaluru deputy commissioner dc review adjudicate matter officials bangalore deputy commissioners office delayed action latest order lawyer filed contempt court karnataka high court ccc officials bangalore deputy commissioners finally passed order land records aug copy mailed last week hasnt easy journey thus far years repeated legal battles knocking doors high court lessons well connected politically high ranking officials doesnt matter since files looked expeditiously comments feedback received revenue departments manage land records notorious corruption bribes however even bound law land right time patience side pursue interactions local officials legally legal battles lengthy justice eventually prevails folks fear courts legal battles however lawyer knows system process trust himher right thing ",
    "cleaned_title": "post bribe nepotism india blew earlier declaring victory quest avoid paying large graftfee",
    "cleaned_selftext": "thanks many supported quest also asked keep posted sharing experience victory pursuing update land records office bangalore urban deputy commissioner tldr details mystory change petitionhttpswwwchangeorgrevenuekarnataka couple years since started actively posting social media changeorghttpswwwchangeorgrevenuekarnataka petition drive proud say finally received favorable order bengaluru deputy commissioner done without paying huge bribe demanded agents middlemen done repeatedly knocking doors high court bit background context dad retired indian military officer acquired title gunta halfacre land vaderahalli village north bengaluru registration pending nearly years technical reason officials hadnt able explain repeated petitions rtis dc took matter karnataka high court wp wa wp honorable highcourt passed judgement directing office bangaluru deputy commissioner dc review adjudicate matter officials bangalore deputy commissioners office delayed action latest order lawyer filed contempt court karnataka high court ccc officials bangalore deputy commissioners finally passed order land records aug copy mailed last week hasnt easy journey thus far years repeated legal battles knocking doors high court lessons well connected politically high ranking officials doesnt matter since files looked expeditiously comments feedback received revenue departments manage land records notorious corruption bribes however even bound law land right time patience side pursue interactions local officials legally legal battles lengthy justice eventually prevails folks fear courts legal battles however lawyer knows system process trust himher right thing",
    "cleaned_comments": "congrats mohan guesstimate ratio total amount spent via legal route demanded bribe bribes demanded justice system thanks guesstimate ratio total amount spent via legal route demanded bribe legal fee fraction bribe demanded middlemen look way land north bengaluru fee current market value whatever means bribes demanded justice system flabbergast total disregards officials show court orders pleasantly surprised process hc digitized reports orders available online review know look useful info thanks enjoy welldeserved peace mind finally mentioned earlier keep pay part case bda apartment clubhouse go sc contempt wanted total land value update records officers charged bribery yet chance could anonymously reports higher tax department asking everyone kind hand greasing unlikely paid taxes earnings learn country corrupt unless bring media attention dont political connections impossible get job done govt office without bribe pathetic",
    "light_cleaned_title": "My post about Bribe and nepotism in India blew up earlier - Declaring victory in my quest to avoid paying a large graft/fee",
    "light_cleaned_selftext": "Thanks to many of you had supported my quest and also asked me to keep you posted. Sharing my experience and victory. I have been pursuing the update of our land records at the office of Bangalore Urban Deputy Commissioner. [TL;DR – Details of #mystory in the Change petition](https://www.change.org/RevenueKarnataka). It has been a couple of years since I started actively posting on social media and a [Change.org](https://www.change.org/RevenueKarnataka) petition drive. and I am proud to say that **I have finally received a favorable order** from Bengaluru Deputy Commissioner. All done without paying a HUGE bribe that had been demanded by agents and middlemen. All done by repeatedly knocking on the doors of High Court. **A bit of background and context:** My dad, a retired Indian military officer acquired the title to a 20 Gunta (half-acre) land in Vaderahalli village in North Bengaluru in 1995. The registration had been pending for nearly 25 years for some technical reason that officials hadn't been able to explain. After repeated petitions and RTIs to the DC, I took the matter to Karnataka High Court in 2017 and 2023: * WP 46964/2017 * WA 6697/2017 * WP 6929/2023 The honorable #HighCourt passed a judgement directing the office of #Bangaluru Deputy Commissioner (DC) to review and adjudicate the matter. As the officials of Bangalore Deputy Commissioner’s office delayed action on this latest order, my lawyer filed a **Contempt of Court in Karnataka High Court** (CCC 734/2023) on 25-07-2023. The officials of Bangalore Deputy Commissioner’s finally passed an order about my land records on 04 Aug 2023. A copy was mailed to me last week. It hasn't been an easy journey thus far. 5-6 years of repeated legal battles and knocking on the doors of the High Court. **Lessons here:** * If you are well 'connected,' politically or with high ranking officials, all this doesn't matter since your files will be looked at expeditiously. * From the comments and feedback I received, Revenue departments that manage land records are notorious for corruption and bribes. However, even they are bound by the law of the land * If are right and you have time and patience on your side, pursue your interactions with local officials legally. * Legal battles are lengthy but justice eventually prevails. * Some folks fear courts and legal battles. However, if you have a lawyer who knows the system and process, you should trust him/her to do the right thing.",
    "light_cleaned_comments": "Congrats, Mohan! Any guesstimate on the ratio of total amount you spent via legal route to the demanded bribe? And were any bribes demanded in the justice system too? Thanks. > Any guesstimate on the ratio of total amount you spent via legal route to the demanded bribe? > Legal fee was a fraction of the bribe demanded by middlemen. Look at it this way. The land is in North Bengaluru and the 'fee' is about 10 % of \"current market value\"... whatever that means. > And were any bribes demanded in the justice system too? No. But I was flabbergast over total disregards officials show for court orders. I was pleasantly surprised over how the process in HC is digitized. Reports and orders are available online to review (if you know where to look) Useful info, thanks. Enjoy the well-deserved peace of mind! Finally. As mentioned earlier we have to keep at it but it does pay. Been part of it such a case with BDA for our apartment clubhouse, that had to go to SC contempt They wanted 10% of total land value to update the records! Have these officers been charged with bribery yet? Any chance you could anonymously reports the higher up to tax department? If they have been asking everyone to this kind of hand greasing, it's unlikely that they have paid taxes on their earnings. What do we learn from all this? Our country is so corrupt that unless you bring media attention or you don't have any political connections, it is impossible to get the job done by any govt office without bribe. Pathetic."
}