{
    "id": "17x8ku9",
    "title": "Do you think people leaving from India to overseas need to learn how to behave in civilized societies like the one in Japan?",
    "url": "https://www.reddit.com/gallery/17x8ku9",
    "selftext": "As said in the heading, wished our country men /women can be more civil and respect local culture. (Japan in this case)\n\nRespect is earned!!! You need to respect to earn respect.",
    "flair": "Politics",
    "score": 3266,
    "num_comments": 665,
    "created_utc": 1700201317.0,
    "convurl": "https://i.redd.it/9qrdemafnu0c1.jpg",
    "comments": [
        "Whip their ass already!",
        "Oh my god this is rough. Lived in ur for 5 years but never saw such notice targeting specific community.",
        "This is tip of the iceberg, just look for nichannel",
        "What is **Post?** in **\"**do not climb the post\"\n\nis it compound or some barrier between ground and plant soil.",
        "This is shit is so incredibly racist wtf",
        "This is what you get when you disrespect their county and culture",
        "How is this racist? They are calling out specifically who the perpetrator is with details of the unacceptable behavior. Without knowing the name, how else are they supposed to call out the perpetrators if not using the national identity?",
        "How is it, racist? When in Rome...",
        "Absolutely! \nThese idiots give a bad name to all of us and create a stereotype (and continue to prove the stereotype)",
        "But not respecting a country's rules is okay? \nImagine the outrage if a Japanese person walks into a temple with their shoes on?",
        "[I wrote this comment for which i was downvoted, ](https://www.reddit.com/k97q0dp?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2) but the posters here are correct. Indians are filthy by nature, they consider their house to be clean and disciplined no matter what but show true colours outside. Then show arrogancy, insecurity and cry racism which we about to see in the threads.",
        "They don't need to call out \"Indian\" specifically. That's just agenda-pushing. They can just say \"The man in a border pattern, backpack, please stop urinating\" or \"To dads and moms, this entrance is not a playground\". It can absolutely be a general warning. \n\nI agree many Indians go abroad and refuse to acclimatize to the environment there, but this shit is just plain racism.",
        "Lots of Indians who immigrate aren't interested at all in learning about local customs or changing their ways. Sad reality.",
        "I don't know why you are being downvoted. \n\nWhy mention Indian man when they can just say the man who is breaking the rules. \n\nAgain with the Indian parents, just write parents.",
        "Can't call these stereotypes, they are a reality. Majority of Indians aren't taught about hygiene since childhood.",
        "By looking at the first picture it seems they are describing jethalal from tmkoc",
        "Indians generally have poor behaviour and Indian kids are even worse because of laad pyar from grandparents in our society there are kids all day playing in the stairs of the building.",
        "[Something like this.](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTLyX3i3czGqsUorZGcrTbrxaVdaNh2jEPlvw&usqp=CAU)",
        "They go there and want to change people there like them, instead of changing.",
        "This is too much, they shouldn’t have mentioned “Indian”. I understand the point you are thinking that how will they address if they don’t specify but that doesn’t give anyone the right to generalize everyone \n\nWhat this does is create hatred for all other rule abiding Indian looking people from the locals. This is how attacks in the name of hate take shape. Good guys will always be punished with things like this",
        "Not racist, its the reality.",
        "I think its only the Indians in their community who behave like absolute shitholes. Now you can't just blame the entire community for how a certain people behaved.",
        "Not urinating here and there has nothing to do with local customs. It's phucking civic sense, the most basic of basic ones. Asses must be whipped for these types of ppl.",
        "These individuals are among the group of Indians who migrate primarily for financial reasons, they  place everything else in the backseat and do not bother about it, just chalta hai attitude.. they unintentionally put india down every where they live I have seen some scums like this in my life",
        "That's definitely a stool for someone...\n\nJust Kidding, sad to see people not teaching manners, atleast from those educated and top society people.",
        "So they actually think notices can reform Indians' behaviour? 🤣",
        "Yes, we do. I have seen enough to agree with this. Might be a smaller portion among us but nobody wants to take a chance after a bad experience.",
        "Many people behave weirdly when they move abroad. \n\nOne of my friend (girl) who was studying in a US university decided to go to bar with her other Indian friend and US friends. \n\nAn Indian fellow approached her for dance and she denied. Now he started verbally abusing her, her other Indian friend said you can complain to the bar owner but no one even understands what he is trying to say. \n\nThey went to another place.\n\nSome Indians don’t even have manners and follow rules in their own country, then they go abroad and do the same.\n\nThey need to learn to be civil in India as well in abroad.",
        "Don't disrespect their culture then.\n\nGoes for all nations.",
        "It should humiliate them enough to want to change. That’s the aim.",
        "Call me a hater (I wish I didn’t have to be) but it saddens me that people like these get to move abroad and pursue great opportunities. There are so many people that I see nowadays moving to HK, UK, Australia, etc. who are the most disgusting, ill-mannered people ever and it pains me that I’m still stuck here and they’re out there embarrassing the South East Asian diaspora and India 🥲 How they even get in and not get kicked out is beyond me",
        "While learning the norms of other countries is necessary, I think labelling communities like this is racist and dangerous. It generalises an entire community based on the actions of a few. Such notices should be taken down immediately",
        "But then, if I scold my kid won't that affect his self-confidence. Won't that lead to suppression of his feelings. Won't that make my kid a wimp. Our 1000 year old culture and civilization has become great by urinating here and there and showing our dominance and by jumping like monkeys.\n\nDon't these Japs know that, don't they? How dare they say such insulting things to us. We will boycott their movies and cripple their economy. They don't know, \"Mera baap kaun hai\".",
        "Don't expect civil etiquette from Indians when they were never taught these things from the very start. In this country there is this \"are sb chalta hai\" wala attitude and Indians carry this wherever they go. They refuse to learn local customs and blame others when they get uncomfortable.",
        "Where ever you go Indians will be Indians.",
        "Oh! this is an attack against our cultural heritage. What a man can do when his bladders are full? Let it burst. Those racist Japanese. They are stifling the freedom of our kids to play and make happy sounds. Such a cruelty.",
        "Nothing wrong with kids playing. Kids will do such things - Japan is notorious for having a culture of being too formal / obedient. There is a stereotype of \"salaryman\" there - people who work 16 hours a day, never say no to their boss and drop dead when they're 50.\n\nYes urination in public place is not ok - especially in a country where public toilets are easily found.",
        "does south east asia mean only india or there are countries in it too.",
        "For that. They need to have shame. \n\nJust look around you man, do you think majority of the Indian uncles and aunties have shame?",
        "✨embarrassing✨",
        "exactly shit parent make shit adults.",
        "Did you forget a /s?",
        "From my personal experience, i believe that young adults(17-22yrs) who go abroad are very much easily adjusted to the environment and the cultural practices, but the people who go abroad after that age (mostly master students and working professionals) are stuck to the indian idea of things and do not care or choose to ignore cultural practices followed in the region. I am by no way saying that this is a general norm, there are exceptions everywhere. But these are the people whose incidents are highlighted by social media and a general bad name for indians is generated. \n\nPS: This refers only to Indians living abroad and not tourists.",
        "Sadly no. All they do is put the rest of us Indians to shame.",
        "right in puranas and veda people used to urinate on nearby plant so it can get nitrogen and grow, westerns dont know how advanced our thinking were /s",
        "Lmao fr",
        "People who usually who go abroad are from the affluent sections of society (read \"upper\" caste) who are entitled af. They bring their attitudes and cultures along with them when they move to other countries. That's why you still see casteism with immigrated Indians abroad.",
        "This is obviously to defame Indians. /s",
        "Oh God, disgusting & shameful! I hate the ones who urinate in India itself. Like can't you hold it in until you're home? Women have smaller bladder and we do it. What's the *ghamand* with these men?!!",
        "When I used to live in Bangalore , I used to walk in the nearby park Every evening after work for 1 hour. Lot of parents used to come with their kids. I have seen these parents making the kids urinate in the park . These were good educated folks , they looked very rich. I used to stay in HSR so it's a techy area. I used to wonder what these people are teaching their kids ? That it is okay to urinate in public? How is this correct. Parents are supposed to teach to respect the environment but here they are teaching them to urinate wherever they want even in a nice park. Such is the sad state of Indians. Call me whatever but Indians are the most uncivil and dirty people on the planet. Indians are Disgusting.",
        "The parents don't even teach manners in the USA, it's sad",
        "I will be so embarrassed l won't show up from the next day. Fucking shithole and shitty people.",
        "Our modern do you think Japan is!! Targetting people by the race who lives in the same building shows how racists they are. They could have just mention their name or appartment no. Or probably just talked to them directly.",
        "nichannel?",
        "That’s a postbox\nThey might be referring to an actual post. Like a pillar",
        "The requests are valid but the form isn't. Reeks discrimination.",
        "stfu",
        "Jus FYI - south east Asia doesn't include India. India is a part of the South Asian region",
        "Yeah so weird to see people defend this, imagine if we were living elsewhere and faced racism due to flyers like this for what someone else did even though we have never behaved poorly!",
        "I'm sorry, but you seem to belong to the type being pointed out in the first poster. The fact that you have to be called out like this is HUGE. It's expected that when you come to a new place you learn their ways. Having to be told like this is shameful and disgusting!",
        "We have to teach the lesson this foreigners who visit in India. Get ready to fuck this foreigners",
        "These aren't highly complex complicated things, but basic things and manners. This is taught in schools iirc but people just don't follow.",
        "This has nothing to do with caste lol. \n\nAre you personally taking the guarantee that a person who's not from the \"upper\" caste as you term it would not show attitude whilst abroad?",
        "2chan? How can I find translated posts?",
        "first one is fine.\n\nbut the 2nd notice about children playing looks like a pretty common whatsapp notice of any gated society in India also....",
        "English seekh le pehle foreigners ko fuck baad mein karliyo",
        "Go to foreign country. Mark territory. Assert dominance. This is a win.",
        "Page not found.",
        "I've never urinated outside or in any park, I swear. \n\nI'm laughing at their unrealistic expectation that Indians, who could neither reform themselves nor be reformed by their schools, teachers, parents, or society over 2 1/2 decades on average, will reform through passive notices.",
        "Those people are either rich or intelligent/skilled, even if they lack civic sense",
        "Japan is not as nice as it looks, they have cultural differences with everyone else but it is slightly better if you are a white guy.",
        "I am conflicted with this.\n\nI do completely agree that if you are moving overseas, you should learn about the culture and customs and adhere to them as much as possible. \n\nOn the other hand, I mean it's kids. It's not always possible to control all their behaviours. Anyone who has kids will understand this. If they aren't telling their kids off at all, fair. But I have seen plenty of Japanese kids act a fool as well. There's no reason to call out the race of people in this scenario.",
        "I would rather have Indians living in India behaving in a civilized way.",
        "Feeling piraud Indian arm...",
        "India comes in south Asia, along with nepal, sri lanka, pakistan, bhutan, etc. SEA consist of thailand, vietnam, philippines, singapore, indonesia, etc.",
        "Not exactly. Most people are concerned with personal hygiene but... public hygiene, that's just a shitshow here. Littering is not even frowned upon by most.\n\nPlease try to call out anyone you notice littering in public places, I have managed to change some people, mostly friends of mine, for the better in this regard.",
        "Japan is racist as shit towards any foreigners. This really shows their culture and manners. Instead of talking to the guy directly, they created these racist posters and stick them around.",
        "I agree with your sentiment. And yes I do call out people if I see them throwing thrash in public spaces. I recently started college and some people are absolutel a holes. And I make sure I call them out. I also managed to change my friends. Also, Happy cake day.",
        "India and Japan are on 2 different planets",
        "A guy who urinates in park deserve to be humiliate. Don't defend the criminals.",
        "lol",
        "I'm wondering how civilized a society is that can be so blatantly racist. That note is clearly racist and uncalled for. They could've called out the person without involving their nationality. If they can't identify the individual then how do they know they are Indian? If they can, then why not take it up with the offenders directly? What kind of 'civilized society' points a finger at a whole country of billions over an offence done by a couple of people?",
        "That's why I like Hawaii very much",
        "They take their lack of manners with them to these countries. \n\nEven if some of them do, it’s only in those countries for a short stint. Once they’re back in India, they’re back to behaving like they’ve got zero respect for any kind of rules.",
        "Who is teaching civilization to India, India is the only county which continued culture and it's civilization from thousands of years unlike Babylon or Westernization is not civilization, because we had a massive population, some people judge all indians by observing few reckless people.People has to realize, we have great civilization and we are not implementing by our laziness and busy life style.",
        "WTF is ‘the man who gained weight’ can’t stop laughing at what’s going through the mind of the person who created this notice",
        "?? \nJust understand this when someone moves abroad they are not called by caste or by what name they call god. The person is Indian once he/she goes out of India. \n\nCasteism among Indians only exists in India not outside of India.",
        "Of course whichever country one goes to they should follow the how things work in that country",
        "I mean it's a local custom in India to urinate on the streets 😭",
        "Japan me toh sudhar jao",
        "My observations of Indians behavior when traveling abroad :\n1. Treating airplanes like a roadways bus. No one waiting for the airplane to be stationary in the parking bay and waiting for the seat belt sign to be off. Everyone stands up. Kids running havoc on aisles . In one case a kid threw warm shahi paneer like a cricket ball only to land on a foreign guy dressed in a business suit\n\n2. Bargaining like hell in showrooms causing a lot of embarrassment. Not ready to pay the display price . \n\n3. Exceptionally loud talking when the same message can be delivered while talking softly . Not being aware of the immediate social environment. \n\n4. Absolute lack of personal hygiene and a general disregard for it. Not sanitizing gym equipments after each use , poor toilet manners, not cleaning up after themselves , not clearing used cutlery crockery at the cafes and leaving them on the table . \n\n5. Some fellow men have a problem of consistent staring and ogling at white girls, no matter where. In public transport , on the street , on the beach . Location doesn’t matter. Expressions are worst if there is a group of men who are into this kind of voyeur/ perverted behavior .\n\n6. Not willing to read and understand the local rules \n\n7. Using phones while watching movies in theaters. \n\nFeel free to add to the list so we can all learn and reflect",
        "fr i crossed 2 people urinating on walls behind a dumpster while coming back from college",
        "This is only going to become more common. When you see videos of Indians doing shitty things in Brampton or Southall on Instagram, there are on an average 400 comments from India defending them. We are going to become more brazen with our disgusting attitude, and more and more of that 'model immigrant' reputation is going to crumble in the coming years.",
        "Last 2-3 months ago when I was in the UK, i went to a beach for a walk and there were signs of no swimming or going into the water. I saw an Indian family (i know from where they were based on their language and accent) going into the sea for a swim. \nThey broke the rules and moreover there are unwritten rules like do not throw trash on the beach or in the sea. I saw them doing that as well. \n\nSo when someone non Indian sees this, they think that all Indians are like that but in fact not every Indian is like that.",
        "OP, Could you explain why this is being shared in r/India, considering the minimal likelihood of its members either residing in Japan or desiring to relocate there? \nI'm sure all of us can feel bad and correct our course of action but I don't think it has any actionable component tied to it. what can be done about it?\n\nless than 0.01% people in this sub want to ever go to Japan and let their kids jump on the fucking post.\n\nIf a survey results in over 100 affirmative responses, in jest, I might consider an outrageous act at Marine Drive with a live stream on Instagram. Just a light-hearted remark though.",
        "Same old approach - find issues with the complainant instead of addressing the issue at hand.",
        "The 2ch forum/textboard. It's an anonymous board with usually a lot of ultra conservative/xenophobic users, many of whom participate it various forms of \"activism\".\n\nI believe 4chan was inspired by 2ch.",
        "Pretty North Indian attitude which we see in south India as well",
        "Indians are stubborn. Adult-babies, if you will.",
        "Like islam",
        "You have not met Telugu people in US. Everything operates within caste among them",
        "This may not affect that shameless man, but it will affect Indians who have done nothing wrong.",
        "From their perspective, Notices like this spread on their SNS which in turn act as warnings to various communities/societies of the risks of allowing Indians to live amongst them.\n\nBasically giving Indians a bad name. Their culture is usually very non-confrontational, so they only do stuff this when they want to do as much damage as possible.",
        "and one more thing any parent would agree with that - kids running in park is not a sign of a civilised society and if it ever is then perhaps the very claim seems dubious to me\n\n\none more thing, if you ever are interested in civilised societies please read more about how japanese soldiers treated Korean matured adult women called \"comfort woman\" \n\n\nmake sure you let your wife or your sister see [this](https://youtube.com/shorts/K1U3CaM4db0?si=S0-4__sdteEeW_RF) and then let me know how civilised Japanese society is.\n\n\nThat being said I have great respect for them.But sorry, the kids running with \"high momentum\" is an overkill.\n\n\nLast but not the least, let the kids run [man](https://youtu.be/TmhoSj3wkDM?si=qB1896hn4Xap7-UR).",
        "I have met some Tamils in France i do agree but the point being at least an Indian Tamil never discriminated with me for being from other parts of India like Bihar, UP, Assam, etc. \n\nI have no idea of people who migrated there more than 15-20 years ago.",
        "This is why I don't make any friends here in India, nor anywhere. It is better to live alone and process life in a calm manner, which majority of Indians don't do. They deserve this.",
        "Not all, but many individuals, similar to the OP, tend to \"conform\" rather than think independently. \n\nInstead of steering conversations rationally, they unfortunately often accept whatever they are told without critical analysis.\n\n\n#SlaveMentality",
        "So public urination is an Indian custom? 🤭",
        "do you mean 4Chan?",
        "Yeah 4chan is the en counterpart of 2chan which is Japanese",
        "Okay, this is racist. They can make this announcements without mentioning race and it won't make a difference.",
        "YES! Never conform! Piss on the streets! Full Support! /s",
        "piss mat Kar bhai Lekin baccho ko.khelne de",
        "mene kab kaha piss in my post padhna seekh le lodhu",
        "So it's the bhartiya culture to urinate in public? 🤭💀",
        "Had to scroll all the way down to find this post.",
        "It is true though. I'd wager you'd correct someone that it is Islamic rape gangs in UK and not Indian rape gangs.",
        "this feels very xenophobic to me why constantly refer to their nationality instead of their name or house number? you have access to security footage but don’t know their name?",
        "this is pretty ignorant. casteism is definitely a problem outside India. Notably in [Silicon Valley](https://www.wired.com/story/trapped-in-silicon-valleys-hidden-caste-system/), where most Indians are educated and earning well.",
        "It's common knowledge that Japanese are very racist towards Indians so it's kinda expected that this will be the language used there. However, there's no reason to excuse the misbehaviour. Both sides in this case need to get better.",
        "I'm from the Netherlands and live one street away from the local small Hindu temple. I have to say: Indian immigrants are nice.\n\nThey tend to be very polite and hard working. I often see a bunch of men in their 20's and 30's playing cricket in the park, looks kinda wholesome. Once a year they hold a festival at the temple, with music and a food market. That's the time for me to get some Indian snacks. Don't be so strict on yourselves: you're good people.",
        "Japan is a deeply racist and xenophobic country. That being said, Indian really need to learn how to behave",
        "Basically Indians who migrate to first world countries with their third world culture. This won't change within a generation or two. Change has to start here at home. It's shameful knowing half of the people in the country behave like hooligans and teach their children the same thing. Be better people",
        "I have lived in Japan almost my adult life. I don’t think Japan is racist. I am sure it is less racist than India, I have lived in many Indian states, I face less racism in Japan compared to India",
        "Ok let me comment on each point fairly.\n\n1. This is a fairly universal behaviour. Not including Shahi paneer cases lol but literally no nationality waits for the plane to park. Also, it's about proper instructions from the flight crew. I have been in many Indian flights and if instructed no one get the f up. \n\n2. I have never seen this in Germany. Indians here are model citizens. Like we have the money to pay for anything.\n\n3. This might be true for some Indians especially while on mobile phones on public transport. \n\n4. This is just bonkers. Never seen anything like am Indian dude not disinfecting the equipment. Either everyone does it or no one does it. It depends on the gym's culture and areas of the gym. In my gym, only cardio area is disinfected. Never encountered anyone except teens who would leave their coffee cups on the table. \n\n5. This again is universal 'man' behaviour. \n\n6. Again universal tourist behaviour. \n\n7. I don't watch that many movies at the cinema, but I didn't notice the race and the person doing it in the cinema.",
        "Inn logon ko onsite kaun bhej raha???",
        "While Indians do have issues and we should introspect it. But try to substitute any other community with Indians, don't you feel there is racism in those posters, specially the second one.",
        "Those maybe Sri Lankan refugees too who moved to Netherlands in the 80 s and 90s  and the kids may have been educated in Netherlands too. Netherlands has a good population of SL tamils...",
        "The Japanese should learn grammar first",
        "We don't know what dick they might have sucked to get there 😂",
        "South Asians especially Indians, Bangladeshis and Pakis along with Chinese are notorious for bringing their practices from home countries abroad. \n\nSouth Asians are one of the worst offenders when it comes to petty offences like Jay walking, littering and flouting rules. \n\nBut that doesn’t justify shit like that, you can’t imagine this in a western country. You can’t collectively name a nationality of 1.4B for acts of few uncivilised idiots. Japan and South Korea are known for their xenophobic racist attitudes, Japan loves to blame others collectively until it comes to apologising for WW2 crimes then you could see them being all individualistic and how they aren’t responsible, it was their ancestors.",
        "😂",
        "Feelingg paraud indiann..",
        "Aussie here. But also lived and worked in many parts of India over two decades.\n\nSpeaking from Sydney experience we have a huge Indian community, some centralised around a few great foodie suburbs, others spread out over established suburbs. I don't believe there has ever been any complaints of the type to which the OP has referred - resident or tourist. \n\nI think the \"problem\" is hugely overblown in certain other monocultural countries. And reflects a certain bias against foreigners, especially in some other Asian countries. \n\nSouth Asians are a very welcome addition to the mix in Australia, though I speak from mainly Sydney experience. \n\nDon't let these other isolated incidents take the headlines.",
        "Japan is racist, says the casteists.",
        "Target the person not his nationality, ethnicity and race. \n\nHow’s this different from calling Osama a Muslim terrorist man.",
        "The last 4 letters of your username suit you perfectly.",
        "I wouldn’t hit Indians too hard.. Japanese are the most xenophobic and racist bunch of people I have known.. while they are outwardly polite they hate your guts if you are an outsider be it white or black or Indian",
        "Ah okay okay. I just generally see people using the term ‘SEA diaspora’ everywhere, so I used it here.  Thanks for letting me know!",
        "If you're gonna live at Japan you gotta follow their rules. Same if someone comes to India. Japanese are real serious about their culture and all unlike Indians.",
        "Open air defecation is definitely an Indian custom",
        "Calling out a bunch of idiots by their Nationality isn’t Racism ? \n\nImmigrants from underdeveloped countries are less civil and it’s a known fact, you don’t see western countries calling out people like this. \n\nImagine the backlash if they did this to black people in US.\n\nGet your head out of your Japanese master’s ass, ww2 is long gone man Jap lost it.",
        "Public urination is common in India because of a lack of public toilets and a lack of care for the environment.\n\nThe first one can change depending where you go. The second one, if the person does not care, there is nothing to be done.",
        "Thanks, On another note the first 5 would never suit you 😎👍",
        "lol, address the problem. :-) this is not racism. If it came to racism, it’s because of this act. Who in right senses publicly urinate and defecate.",
        "What do you mean we can't do how we please? That's how we've always been, we're Indians. /s",
        "This is blatant racism, especially the second notice. Shame on the Japanese",
        "Some aunties do, for sure \n\nIndian uncles however might be an entirely different species, maybe I'll know in a few years if I go bald, grow a belly, a shitty stache and make jingoistic comments to mask my insecurities",
        "I know, but I've talked to them: they're Indian and/or of Indian descent.",
        ">lack of care for the environment.\n\nUrine is biodegradable.  What harm will it cause to the environment?",
        "No, if you understand Japanese society, you will understand what they said is not racism. It’s not India, you have to live within the rules, this is a rule based society. Even for kids there are rules.",
        "Getting kids to wee in parks is kind of acceptable outside India as well. Children don't have the self control. Of course it is the last option if there are no bathrooms nearby.",
        "Corpses are also biodegradable. What harm will they cause to the environment?",
        "What’s more, I bet ¥ 1 million that the sort of Indians who pull this kind of shit, will be the first one to take umbrage if a foreigner doesn’t follow some Indian custom, in India. Then it will be like “you’re in India, you must respect the local culture”. In short they’re nothing but Indian supremacists.",
        "Running wild is not acceptable in Japan, even for locals. Why do you think they called out Indians, because only Indian parents are letting that happen that building.",
        "I had to smile reading this. \n\nFirst of all, your post title implies that India is not a civilised society… I don’t think that’s true.\n\nSecond, it’s extremely weird to single out one nationality for doing something wrong. That’s racist.\n\nI live in Germany and most Indians I meet here are quite nice. Germany has A LOT of rules for everything and everyone, and the peer pressure from society will make sure everyone subconsciously starts following these rules.\n\nSome of these rules are explicitly written somewhere, like “put your dog on leash”, or “no noise after 2200”, but the most important rules are actually implicit: let the elderly sit on the bus. don’t stand in the corridors of public transportation. don’t stand next to a free seat blocking it, use a “Warentrenner” in the supermarket to separate your groceries from the next person’s, don’t cut the queue, etc.\n\nLike, if I am about to throw trash on the street, I won’t do it because even if there’s no one on the street watching me, I have this sense of doom that some aunty will come and start screaming at me for it. It’s a sense of righteousness and climate awareness that has been instilled in me since childhood and I simply can’t. As a European, I also don’t throw stuff on the street in India, no matter how normalised it is.\n\nIn my experience, Indian immigrants to Germany are amongst the most law-abiding people. They’re super scared of doing things the wrong way. Precisely because they seek acceptance from society and are scared of being judged / rejected.\n\nIronically, peeing in public in Germany is something people do if it’s in nature and away from the crowd. \nIt’s technically illegal but I’ve seen people pee in hardly secluded places after drinking. Since drinking is part of German culture, so is peeing. 😂",
        "You are right. Corpses don't cause any harm to the environment. In fact they help the environment by providing nutrients to plants.",
        "Well, it takes one to know one (bigot)\n\nWe pretty much excel in all forms of bigotry from petty material comparison to evils like caste/gender based violence.\nDoesn't mean that Japs aren't the most Xenobhobic lot in the whole world",
        "You can take an Indian out of India but...",
        "And now the parents and the pee guy will cry Raaaccciiiiisssmmmm saaaaar\n\nMedia will do their usual song and dance.\n\n Japanese authority will be called and threaten to apologise.\n\nJaishankar will issue his tight slap \n\nThe same old thing",
        "It's about the conditioning that Indian parents are giving to kids that , public urination is fine .. btw I have seen adults do it as well .",
        "Post the rules and don't target a community. This is racism if they are targeting a community.",
        "Care for the environment? I think urinating in garden or tress actually help the environment 🤔",
        "Also, Japan is a very discriminatory nation.",
        "This is not about India, these guys are drunk and don't have manners, happens all over the world",
        "You my friend has never been to Soho London on Saturday night. People do crazy shit in urban areas, urinating in public is definitely wrong but that doesn’t give anyone right to identity them with their race. \n\nHow much do you hate yourself to defend some low life Japanese man who put that poster out there against your own identity? Defending racism against your race is the worst you can stoop down. \n\nEven culturally aware Japanese would agree using ‘Indian’ was unnecessary besides Japanese can’t really distinguish between Indians and other South Asian how do they know their ethnicity? \n\nYou will never be Japanese mate you are always brown skinned man, get a life.",
        "Caring for your environment does not only mean \"take care of trees, plants and animals\" but it also has the more literal meaning of taking care of the area around you. Which means keeping it clean and beautiful.",
        "You are comparing to a party street with residential place, give me a break",
        "True, especially in Japan where there are toilets are regular intervals.",
        "Yeah, environment is the wrong word. Lack of care for cleanliness and hygiene is probably what they meant.\n\nMy cats pee all over my house, so expand that to the outside world, humans peeing all over the place.\n\nHeck, there's a stretch of pavement nearby which everyone avoids walking on because it's covered in pee stains.",
        "It's the circle of life 🎶",
        "Yeah, lots of arrogant people like my father, who get angry when they're told not to disturb others.",
        "bherund bejatti hai bhai, I agree hum log ko bahar hi nahi, apne desh mai bhi sudharne jaroorat hai.",
        "not supporting 'em but quite the opposite",
        "Yeah this seems to potray their prejudice.",
        "This is such a racist and insensitive way to call them out tho.",
        "This is how Indians behave in my country. I feel we have regressed socially by accepting third world scums.",
        "Main question: \"Is there a bathroom nearby?\"\n\nNo? Then it's the fault of whoever built and maintains the place........\n\nAll animals including humans pee and defecate. If you want the human animals to only do that in toilets to be neat or whatever, then you've got to provide bathrooms st sufficient intervals. Same for dustbins.",
        "Yeah, poles and pillars are sometimes referred to as posts",
        "\"boycott their movies\"\n\nIndian anime fans be like: haha, no",
        "True",
        "Don't worry about being a model immigrant, the locals are crappy too",
        "How many clean toilets did the park have ?",
        "We Indians don't learn about local cultures within the country (when relocating to other states), learning a foreign culture is far fetched.",
        "You are living in your rich upper class shell. If you need to pee or shit, there is nothing wrong with it, it's absurd that is considered dirty.",
        "Which board",
        "No, it depends a lot. Certain people are arrogant and entitled. Heavy overlap with being conservative and crappy in other ways (sexism, homophobia, racism etc.)",
        "It's their country. I don't blame them for calling out Indians and making a strong statement.",
        "We have to agree with some of it.\n\n\nWe have no sense of personal space\nWe have no respect\nWe have no manners\nWe feel we don't have the need to respect or follow someone elses culture or way of living even though we migrated.\nWe dont want to follow rules (traffic or non traffic)\nWe dont even make a half Hearted attempt at learning the language or interacting with locals\nWe only prefer to hang out with other indians \nWe are racist\nWe are sexist\nWe are misogynistic \nWe are homophobic\nWe are openly jealous and gossip about everybodys life and their lifestyle.\n\nAdd to this if u have some more 😂😂🤣",
        "How do you know Indian and not any other south-Asian country?",
        "That second notice about children is creepy and menacing",
        "Japanese people would never behave in such a disgusting manner. This is typical Indian behaviour so of course they are going to refer to the dirty person by race.",
        "Lord ,another day another post on Indians outside india.\nYawn. Bad apples everywhere. Accept and move on.",
        "Yeah, he was feeling insecure and needed to mark his territory..........just like my cats 😂",
        "It's their country. Respect their rules and their culture or leave.",
        "Piss is not dirty technically, does not habour bacteria, mostly minerals and nitrates, pissing into soil helps the plants.",
        "Good to know you do not consider urine as dirty. I will make sure to help out your environment by urinating in your bedroom daily.",
        "Japan is pretty outspoken \nI've heard Southeast Asians taking the brunt of the racism mostly since they're more then Indians there.",
        "In that case they're raising awareness that maybe Indians should not be let inside their country.",
        "And, (I'm not Indian nor Japanese) how the fuck do they know that the phantom pisser is actually an Indian?",
        "Yes, they need to learn manners and leave the religion and caste shit in India.",
        "Pretty sure that's a poem.",
        "What's wrong with discrimination? It's their country they don't want dirty Indians in their country.",
        "In my experience Indians are mostly cowards. I once saw an Indian man littering in Australia and kicked him in the leg - I might have given him a large bruise. If more Indians did this to the uncivilised Indians then India would change and become a better country.",
        "You are welcome to use my garden!!\n\nThere is difference between urinating in soil Vs other areas, here we are talking about garden which I believe have soil",
        "You sound like an uneducated idiot. Please never travel to Japan if you cannot respect their culture.",
        "Might get downvoted for this but I am gonna say it anyway. This summer my husband and I decided to book airbnb in one of the beautiful town in Italy. The host was so much sceptical to accept my booking because she had a very bad experience with one of the indians who left her house so dirty. I went to one the parks in london where there was a group of indians tourists casually throwing their snacks wrappers in the park. They think it is their own country where they can throw garbage anywhere.Most indians dont know about basic hygiene. They dont care about public property at all. I just wonder how these people must be living inside their own house.",
        "Ar\n\n![gif](giphy|oudLetMk6WF3i)",
        "I get about the urinating part but the kids,whats the problem in them playing around,I don't get it am I missing something?",
        "Prime example: CANADA 🙂",
        "Which is why we stood out. This attitude is going to be absolutely problematic for us in the future.",
        "People in India need to learn manners (most of it) even if they are in India ..",
        "The place it is posted is an apartment provided by Japanese government in a subsidized rates to all, mainly to elderly society. There are some rules about making noise and kids playing. There are designated place like parks and ground for kids to play and Japanese kids don’t play inside the apartment blocks or in the halls that too late night So when kids playing they make noises which basically a nuisance to others.",
        "The place it is posted is an apartment provided by Japanese government in a subsidized rates to all, mainly to elderly society. There are some rules about making noise and kids playing. There are designated place like parks and ground for kids to play and Japanese kids don’t play inside the apartment blocks or in the halls that too late night So when kids playing they make noises which basically a nuisance to others.",
        "Japanese are very racist people. I have heard that most of South East Asia is very racist and xenophobic.\n\nMaybe those Indians were asshole but that statement is also deragatory",
        "Thank you for the insight.",
        "Wait a minute, none of the commentators here have seen men in their 40s or 50s standing and pissing in public ? That too riding on their bike, stop along the road and piss on somebody's private property without a care in the world.\nIf you're doing in your home without a worry for 20 or 30 years, how in the world will this dipshit attitude change if you move abroad ?\n\nStill wondering why foreigners complain about smelly India and smelly Indians ? \n\nAnd maybe the sub will explode, but really get a grip soaking your hair in mustard oil (atleast while you're in public places) It stinks from a mile and it has \"Indian\" plastered all over.",
        "It is racism. Whoever wrote the message felt the need to point out the ethnicity of the person urinating and the ethnicity of the children.\n\nThese details don't really contribute to the probelm being addressed. Urine is Urine,  Indian or Japanese.\n\nThe person urinating obviously knows who he is. I'm assuming that the person writing the message is against all people urinating outside, not just Indians. \n\nMentioning their nationality serves no purpose other that associating 'Indian' with 'Urinates outside'.",
        "Same shit is tolerated in India..lol. No civic sense in India.",
        "1. Why are we ashamed of someone’s actions? One person doesn’t represent entire nation. There are good and bad people everywhere. So we should stop feeling embarrassed of someone else’s action. \n2. Instead of discussing the post reeks of racism we are diving and blaming the so called Indian person, is wrong! Stand up for the community like black people do. Same message could be conveyed in a better fashion by choosing good words.. it shows how deep rooted systemic racism is in Japan. \n\nAssuming only our race is notorious of actions is false . I’ve seen many whites making their kids pee at park on trees or bushes.. \n\nNow people may argue Indians are racist - not all Indians are !  And nobody deserves to be treated in humiliating way",
        "these children could be from any nation theyre constantly adding the adjective indian like an insult almost",
        "True colours. What a horrible thing to say",
        "you are talking like you live in japan.",
        "Someone better inform the Japanese, urinating in public is a fundamental right in India.",
        "No it's not okay to train children to pee and shit in the open . That is why we need toilets , if there are no toilets , then Indians have to work on getting toilets built  , Indian agencies build parks without toilets exactly because of this mindset that peeing and shitting in the park is absolutely okay . It is a societal issue and hence the authorities are least concerned also. It is gross and abused to shit and pee in a park.Abroad , if you have a dog , then you have to scrap up the excreta of the dog. That is a civilized  society, not saying things like it's okay to shit in public. This is exactly what I am referring that Indians are uncivilized.",
        "Yeah the Indian people in the post are definitely in the wrong. I do know that such people exist but the posters themselves are racist. Just call out an individual for bad behaviour. Say \"this idiot lives here who does these bad things\". But they had to go out of their way and make it clear that it's an 'Indian'. I have plenty of Indian friends living in Japan who are living a great life and are loved by the locals and don't do anything problematic and put effort into learning the local norms.",
        "Yes , but why are parks in India designed without toilets ? Because of the Indian attitude -why need a toilet, people will pass urine along the wall of the park. It is the culture of anything can be done without consequence is what is being highlighted here.",
        "And why is that so ? Why parks are designed without toilets ? Because those who designed it did not see the need for it. Why ? Because we have the habit of peeing in open and toilet seems unnecessary. It is the culture that is being discussed here , that anything can be done , shitting , peeing without consequences.",
        "People lose their inhibitions when in another country. There's no one to correct them and not many ways for their friends or family to know about their misdeeds.",
        "Agree",
        "They have clearly seen this guy do it. That's why they are describing his physique and clothing as well.",
        "Aah, of course, there is a distinctive Indian clothing in Japan, and a distinctly Indian physique. WTF are you talking about?",
        "this is just racist. the need to mention specific community let alone the shaming",
        "It's Japan kawaii anime hentai uwu. They would never be racist!",
        "The hacker?",
        "I find it strange in this thread that there's more foreigners defending Indians than Indians defending their own. Wtf?",
        "Dude are you an idiot? Imagine that you live in an apartment. Now a few people from Germany come and occupy a 4-5 flats in your building. \n\nSince, it's a new developement there's excitement in the building that there are new people in the building from Germany (because word spreads that way). Now you saw one of them do this. How are you gonna describe them in the poster? One poor way is to write - To the german who urinates, has gotten fat recently, wears check shirt and backpack, stop pissing. That's what those guys did. Japanese are racist no doubt but Indians have a very bad attitude towards learning civic sense.",
        "absolutely arigato yamete kudasai yamero shiro oni ryuhei momotaro",
        "“The man who gained weight” ?!\n\nNow that’s just water boarding level shit!",
        "Indian meanwhile: I was watering and fertilizing your plants.",
        "These children could be Pakistani or Bengali or Sri Lankan.",
        "We as Indians will instead fight them saying that they should be more accepting or something 🙄",
        "Thank you. You've proved a point, you've gone for the ad hominem argument. Last resort. Attack the person posting, don't address the argument.\n\nAnd WTF do fat Germans in lederhosen have to do with this discussion? Have  rest, reflect on your silly post. Don't bother replying, I've blocked you.",
        "Majority of Indians don't have the civilised sense of developed nations. Examples:\n1. Not saying sorry if they collide with you (while both are walking).\n2. Standing so close to you in a queue that their bellies touch your body. I find it very irritating, but it's better than not queuing up at all.\n3. Spitting in public, clearing throat in public. Yuck! 🤢🤢🤮🤮\n4. Playing phones loudly in public.",
        "Again!! This is not a 'INDIAN' problem, its a human problem.",
        "Can you tell me from which country you belong? I am making a guess that you are from E Asia.",
        "Yeah bro, in India everyone makes sure that when they are urinating in public they do it in soil. Totally not on pavements and against the side of the road or anything.",
        "wow i said the same thing and got downvoted on a previous thread, lol , yea we seee the same in UK. A  man spat inside the train just before leaving the train, We have bins inside train near the train door , it was just disgusting seeing all the red stain on the bins. like just go home or near a tree not inside a train.",
        "Could it be the effects of brain drain?\n\nI can imagine the people being rude and untidy in India are not your best and brightest. And the Indians in the Netherlands are, for a large part, highly educated people who were headhunted for specialized jobs.",
        "What if they dont know who they are and which room the live in how do they then describe them ?",
        "went to japan had the best  time dint face any racisms , lived with friends in a village , met old japanese people who were very intrested in india and life in india, but i dont live there so couldnt say much. \n\nyou just need to be a bit civil",
        "I know they’re doing it in good faith and I think it’s very kind of them to defend Indians but I think it’s because they don’t actively live in india and don’t see the shit show that we regularly see living in India.",
        "It's not exactly brain drain, it's more like an inverse of brain drain. The less educated yet rich (usually family wealth) are leaving the country more. They go to Australia, Canada, etc. where the barrier to entry is lower. \n\nYou rarely see people from countries generally with low number of immigrants and stereotyped as racist acting racist to Indians online (ex. Russia, Czechia, Serbia, etc.).",
        "Let's all be racist to black people because African countries are bad to live in! \n\nI'm gonna say the n-word!",
        "Don't think the need to not build toilets has anything to do with peeing outside. The guys who plan and MPs who approve generally don't give a damn about the people",
        "There is nothing racist in pointing out facts. If a person of any race is filthy AF then they need to be called out.",
        "nahh UK is far worse",
        "Yes, call out the person not the race.",
        "Don't try justifying defecating publically, it's uncivilized behavior",
        "WTF, exporting #PeeGate to Japan! /s",
        "Some India students have been rationing the food distributed by the govt for the homeless there. Nothing is more shameful than that.",
        ">migrate primarily for financial reasons,\n\nWho doesn't?",
        "Exactly, the urge to mention the nationality of people whose behavior is offensive, is pretty typically racist behavior. \n\nIm pretty sure if it was a drunk Japanese person, no nationality would have been mentioned here. \n\nHere in Germany, I have often noticed that the nationality of the accused is rarely ever mentioned unless its necessary to be mentioned for context. \n\nHere the intention seems to be to add to the existing xenophobia and not actually solve the problem.",
        "That dude is revealing his fetish for the world to see xdddd",
        "What the fuck is going on here? \n\nThere's a guy with piss fetish in above comments and then there's this one with corpse fetish. Next kya hoga?",
        "There are many Indians who have no sense of etiquettes. Many in my close circle often complain the way Indians behave abroad.",
        "I don’t understand how are you guys defending such racist shit. Where is the proof that the behaviour listed is actually from an Indian ? Are all brown people Indian ? I have been to America where I have been mistaken for a Mexican. If my kid is energised and is playing, he / she will play. Fucking big woop, deal with it. \n\nStop being so inferior, always apologetic, always sorry. We apply for visas they accept and with that they accept what’s going to come with it. It’s not fucking North Korean. \n\nJapanese racist pigs getting all the support from  “yes sir” “yes madam” “please take my soul and my ass if you will “ people. \n\nRub it and get on with it.",
        "When majority people from a specific race are only known to cause nuisance and change the way other people live then it’s understandable that they will give fuck all about being “nice”. There is a limit to everything and in many cases stereotypes exist for a reason.",
        "Necrophilia",
        "Are you Japanese?",
        "\"Playing tag with tremendous momentum\" wtf are they trying to say here?? 😭",
        "Okay, listen for me a moment. Even if this is done by an indian and it is absolutely not ok and this behaviour must be condemned. Isn’t posting this in this tone quite explicitly racist and xenophobic of Japan?",
        "Don't vilify something which are default bodily functions. Provide the options like clean free toilets before passing judgement",
        "Japan is an extremely racist country. They hate everyone other than themselves, especially Indians because of the whole tech spotlight shift thing.\n\nBe it cultural, economical or something very basic like repairs, the bias is very visible. They are good at being racist and acting like they are not. It is cultural.\n\nBut oh no Japan did nothing wrong, the nanjing massacre, unit 731 and tons of other things are not real. Look into the anime waifu's eyes and forget it all lmaoo",
        "FYI,most African countries,except the ones that are in an active conflict,are better places to live than in India.Atleast they have unpolluted nature and a friendly culture.",
        ">When majority people from a specific race\n\nLol did you even read my comment?\n\nIf there are 40 Indian families and 3 Indian families are causing issues then is it right to be racist like that?\n\nIndians being a visible minority will have to face the \"association bias\". i.e. \"I saw this Indian guy do something bad so you're like him too.\" White people who cause issues in bars a lot don't deal with this.\n\nJapanese bars somtimes don't allow white people in. But they tell them only \"Foreigners not allowed\" not \"Americans not allowed\" or \"Indians not allowed\" or something. The same way they could have just said \"Foreign residents are causing problems\" instead of singling out Indians.",
        "It's for you to decide whether discrimination is wrong or not (obviously you won't care for my personal opinion that discrimination of any kind is wrong)\n\nNobody wants dirty humans, anywhere (obviously you don't care for the kind of heinous crimes Japanese themselves do in their own country or for that matter any person of any origin anywhere)",
        "Bruh I have seen two moms giggling and talking with each other while their three vile children formed a noose two puppies' neck and hanged them on a pole in park. Hygiene is a baseline that they have ignored eons ago.",
        "For them Indian Bangladeshi Pakistani and srilankan all are Indians.",
        "This was on full display this past Diwali weekend. Saw dozens of families enjoying the public waterfront near my apartment, lighting fireworks, diyas, etc. \n\nNext day (as expected), trash all along the waterfront. Couldn’t take a step without stepping on used fireworks. Why move to a clean area if you’re going to trash it every chance you get? And not to mention teaching your kids the same shit.",
        "He is living there...in his mind...with his harem of waifus",
        "Indians are getting a lot of hate everywhere abroad and it is bound to happen. India has world’s youngest population which is eager to go abroad. Other countries have ageing population and they need immigrants. As Indians are going abroad in very large numbers, a percentage of them will not follow rules, offend people of other culture and so on. \n\nCanada has no countrywise cap, so any number of Indians can come in if they have enough points for PR. Apart from this you have student population who also come to try for PR eventually.",
        "No I'm Indian (Gujarati).",
        "waifus.... lol",
        "The vast vast majority of South Asian looking people in Japan are Indians. Usually in IT. Assuming they are Indians is probably 99% correct.",
        "If someone came to India and urinated in a temple on one of the idols do you honestly think most Indians wouldn't get violent? You might even do it.",
        "Here is a scenario: If you are not from the south, the people in my state tend to call your brainless vadaks and don't want them here. Obviosuly my state is better compared to other states in terms of education, hygiene and economy. So I should call you brainless right?",
        "as an american, i’m not trying to roast you Indians but holy shit, this behavior is the exact same in the US\n\na lot of resentment you all get is because you clearly don’t give a shit about our culture or trying to assimilate, it’s rude as hell",
        " Sometimes im ashamed to be an Indian…",
        "I wouldn’t blame their entire ethnicity and put up posters saying “Look, a CHINESE man did this” (And stuff like that does happen, increasing hate against anyone of east Asian ethnicity in India) especially when racism against Indians is so high in many countries.",
        "Personal hygiene is limited to baths. Men especially . No grooming,  terrible body odor, etc. my brother earns in 6 figures, but stinks like a pig and zero manscaping. But his attitude when I point this out is basically my Lyf my rulz.",
        "F**k, of all the countries to show your 3rd class behaviour! Moving to one of the cleanest and most disciplined countries in the world -- and then urinating outside!",
        "Do you honestly think all Indians are civilised? I never said we are all uncivilised.\n\nSterotyping is normal. It is finding patterns in groups of people that are often rooted in reality. This very sub says things about my people (Gujarati) all the time - and you know what? A lot of those sterotypes about Gujaratis are true.",
        "Places like Japan and Korea have a reputation for being xenophobic.",
        "Stop taking offence for every little thing that is happening at any part of the world.",
        "I’m glad they’re being shamed, particularly the urinator, fcuk that guy, put up his photo on posters.",
        "Funny thing, there are tons of Japanese people who pee on streets. Sometimes property owners post their pictures in public to shame them.",
        "Yes. A bunch of H1B’s over here in the US who are now green card holders are insane. The most racist interactions I’ve ever had at work is from these Indians. They have their residency and now their true colors come out. In my community, my family is sort of alienated because we are not from the same part of India (not from the South). We’ve lived here for over 20 years yet we’re starred at like we’re aliens. \n\nIn addition, they have terrible etiquette. Let their children run amok in the streets with cars pretending like it’s India. It’s getting bad because it’s giving us a bad name in general.",
        "Lol how can one find one's origin just by looking\n\nMy Indonesian members of my group confused people from gulf countries and neighbouring India with Indians \n\nBut anyway you can see how vaguely (in poor English)/informally their notice is written, it seems a rant/vent of any security manager",
        "Lol how can one find one's origin just by looking\n\nMy Indonesian members of my group confused people from gulf countries and neighbouring India with Indians \n\nBut anyway you can see how vaguely (in poor English)/informally their notice is written, it seems a rant/vent of any security manager",
        "The first one is understandable still the second one definitely is.\n\nAlso it's japan these societies have a PhD in racism.",
        "I had an interaction with one and she kinda opened my eyes, it's society mirrors ours and most of Asia, where problems with colourism and racial homogeneity exist.Western people have struggled with racism and tried to address it head on..... Asian cultures have never even acknowledged it's existence in their societies.",
        "The second notice is a matter of cultural difference. Some norms in Japanese society are pedantic compared to a neutral baseline.",
        "#Before you have a big trouble",
        "![gif](giphy|YoOM0hliors7cLsgmk|downsized)\n\nWhat jethalal doing in Japan?",
        "I would add people who wear extremely stinky socks, jackets and get on public transport. For people who sweat a lot, or for people who play sports, sweaty socks stink in a day. When a person's stuff (noise, smell, body part) enters the personal space of others, it's rude.",
        "Most Indians who travel to western countries don’t deserve the quality of life there. I have seen indians embarrassing themselves multiple times. Urinating in parks , making terrible loud noises for diwali , blaring loud punjabi music, i am not even sure how these entitled prics are even allowed to immigrate to a different country.  Most Indian folks for the same reason never want to stay in Indians filled neighbourhood in western world. You go to a costco you see the line of Indian folks abusing the return policy and standing in lines to return back used items in bad condition saying they are damaged \n\nThe worse of the pack is the folks in Thailand , oh my god the kind of haggling , cheap negotiation tactics and harassment these men do in Thailand is simply disgusting",
        "Terrible Canada",
        "I agree with you but I have to be fair here. Indians don't realise that they have BO. I have seen a lot of my friends who have BO and they don't anything about it. I don't consider it their fault as no one tells them about it.\nOur food plays a major role in that.",
        "Agree. I am not talking about BO. \n\nWhen we cook in apartments of cold countries with windows closed, our outer wear picks up a lot of smell. \n\nWe don't wash socks every day. For sweaty people, it would stink very bad in a week. I know my colleagues who traveled with just 2 pairs of socks for a month long trip.",
        "I didn't know of this bad habit. Sounds stinky.",
        "Canada is filled up with illiterate brats who are almost good for nothing, who just went their to show off and nothing else. Ik i will be criticised for this statement, but telling this from first hand experience. As few friends from my own group are there. Who couldn’t achieve anything in India and cried always.\nThere they are doing shitty jobs and are happy with that lol.",
        "Trust me, I am in the UK, and it’s 100x better than Canada.",
        "Is this some kind of kink? To shame yourself and put yourself down? That is the most racist shit I’ve seen in a while and we’re all just like “fair enough.” NO. Not fair enough. This is why people think they can walk all over us. It’s cause they know that we would rather send one of our own to the chopping block before ever thinking about uniting",
        "I have to disagree with the second image , there is nothing “uncivilized” with kids playing about. The urinator should be jailed for a day with a fine though",
        "NANI??",
        "The amount on reckless Punjabis I've seen in Canada is outrageous tho",
        ">These individuals are among the group of Indians who migrate primarily for financial reasons\n\nJapan doesn't pay much for IT. What other reasons do people migrate for? Obviously japanophiles would be more observant of local norms.",
        ">they unintentionally put india down every where they live I have seen some scums like this in my life\n\nI think thats why the term \"Pajeets\" is used more often",
        "Before we start blaming ourselves, this notice smells racism behavior:Writing Indian. Blaming whole country instead of individual.\n\nJapan is comparatively not a diverse society. Any country with less diverse population will typically be unwelcoming to foreigners.\n\nLast but not least expat must understand that their behavior gives bad name to country hence respect  and understand the foreign culture",
        "I think i understood the term Pajeets for this specific group. Kinda interesting",
        "Different Perceptions Different Realities \n\n\\~Daryl Davis",
        "How do we know the person being blamed is Indian. He could be from any neighbouring country or a PIO (East African/Fijian/West Indian).",
        "Pedofile in the UK cases :(",
        "i wish the 2011-2013 days return",
        "Well, I don't know about the most.  I'd say that South Koreans and Mainland Chinese people are far more xenophobic.  People in Japan have preconceived notions, but if you observe their customs and respect them, then they tend to be very accommodating.  It's moreso that Japanese people have very strict standards in their own society, and when foreigners who aren't aware of that show up and mess up the status quo, they get annoyed, as they are very habitual people. They are quite xenophobic, yes, but it's hyperbolic to say they are the worst in the world.  Israelis are also very xenophobic, and so are many Gulf Arabs.",
        "Once I saw \"Do NOT shower here\" in an indian restaurant restroom in NY. Don't know who it was intended for. But mostly indians frequent there.",
        "Would you guys be happy if you saw a sign outside that specifically called out Dalits for being unclean and disgusting? \n\nIs racism only cool when glorious nippon does it?",
        "That's nice to hear from a Dutch person.  I love the Netherlands, but I have definitely seen a little bit of racism over there.  My wife deals with it rather than me actually, as she has much more \"Desi\" features (I'm roughly 40% Scandinavian, and I am very tall, so I don't think Dutch people realize I am of Indian origin).  Just small things, like people will talk to me nicely (sometimes even in Dutch, of which I know a little bit), but they tend to give her shorter, more abrupt answers to things, or when we're together, they will only make eye contact with me and will basically ignore her altogether.  I don't think they necessarily do this purposefully, but it still happens nonetheless.  Not to say that constitutes anything other than a minority of interactions.  Overall, Dutch people are some of the most progressive, accommodating people in the world.  Maybe it's directness that gets misconstrued as racism?",
        "It's not even about that.  I think they genuinely can't take it when people flout the norms.  It makes them deeply uncomfortable, because in Japan, that's just not done.  It basically interrupts the peace and harmony of their community.  They don't mind foreigners who are respectful, but unfortunately, many foreigners intentionally go to Japan to do messed up things or they don't bother to follow the cultural norms, so Japanese get jaded regarding foreigners pretty quickly.",
        "Whaaaaaaaaaaaaaattttttttt...........",
        "It's just about the way we are educated. We are not thought to be considerate to others. As my high school teacher used to say, we are literate but not educated.",
        "Sorry to hear your wife gets treated like that.\n\nIt may very well be racism, there's plenty of that going on as well. It could be 'racism of low expectations', with people thinking it's going to be more of a hassle to bridge the cultural and language gap based on her looks. Or it could also be the regular old 'we don't like your kind here' type of racism. We're working on it!",
        "I totally agree",
        "Civics studies or teaching is non existent in schools. So naturally some Indians are less civic.",
        "There are people who are already well off in India and don’t need to leave for financial security but they do that for a variety of reasons.\n\nFor example, I fell victim to the American dream when I was very young, and now I’m a permanent resident in the U.S. and on my way to that dream.",
        "Idk why this thread appeared in my reddit feed but here I am.\n\nJust to let you know that 'Japs' is a slur just like Nigger. I can see that you mean well but please call them Japanese.",
        "The way Indians spit like fing everywhere🤦‍♂️. Worst behaviour. Without teaching these basic public manners right from the kindergarten, we'll be like this forever.",
        "Our people lack civic sense and I have no idea why. I used to believe this is being educated vs not but that’s not the case. This Diwali there were cops called on people lighting fireworks at 2am in the night. How inconsiderate can you be? Sure it is Diwali, try to celebrate it before quite hours. If you cannot by any reason, you shouldn’t doing it at 2am either.",
        "I've heard that Japan is really racist. But spitting in public? Come on yaar...",
        "That’s meant for homeless people.",
        "I am not sure that's true. It was not NYC. It was near Niagara Falls. I didn't see any homeless people there.",
        "We don’t follow rules or good etiquettes here, how do you expect them to follow outside.",
        "The second 5 are never in my bank account or wallet 💀",
        "Ah Japnese drink alcohol beyond capacity and puke sleep on tokyo roads at night is this also in their culture then",
        "I read this in a south park japanese accent lol",
        "I would have done the same. Nothing wrong. Act stupid, then face the heat.",
        "I’ve travel quite a lot and I can tell you it is sometimes very embarrassing to be identified as Indian. We are known for lack of mannerism, gawking at women like meat, talking loudly in restaurants, letting kids run around yelling, talking loudly on phones in cinema halls, poor hygiene, the list can go on. \n\nI have no idea why government is not putting enough emphasis on learning mannerism. In Japan this is taught in schools, heck they even clean their own classrooms as part of discipline.",
        "Interesting, reminds me of a video where a Japanese person refers to a problem with elderly or drunk middle-aged Japanese men who can be found (infrequently) urinating in public places - googled it and it was [this video by Mrs Eats](https://www.youtube.com/watch?v=b_aW4-2iihE).\n\nIt seems the responses are similar, the sign is less confrontational compared to directly addressing the offender, and I can certainly understand wishing to prevent anyone from public urination.\n\nMy own conclusion is that there are individuals in every part of the world who are deciding to pee in all the wrong places, a problem that all nations can recognise perhaps?",
        "Stfu with ur moral brigading. Just coz I'm Indian doesn't mean I am similar to or have anything to do with the billion random Indians.    \n   \nPeople do shit. They alone represent themselves. U don't need to take that burden. Or do u also represent all the Indian murderers, dacoits, rapists, etc",
        "Peeing outdoors in Japan is completely culturally acceptable. \n\nAs long as the people doing it are Japanese",
        "It’s because most western and European countries have strict rules against discrimination, they put everyone in one basket and all you have to do is tick a checkbox to get in the country. Canada is prime example of a poor and failed immigration system. They are taking people in bulk and conduct no test to see if they are fit to mix with the society.",
        "Lol, these posters are as racist af. Why did they have to specifically mention indian children. Could they simply have not said the same thing without specifying the race. How did they even know the kids were indian? Could they not have been anywhere from the indian subcontinent?\nWeird shit",
        "Japan is incredibly racist and monocultural. Largely as a result of a policy of isolationism for centuries. They have very strict societal norms, and do not accept people acting outside of those norms. As most people are japanese, calling somebody by their race is often just a simple and easy way of identify who the person is. There will also be a lot of signs, on japanese, telling people off for bad behaviour, warning people not to do certain things, etc etc.",
        "Change can only happen if we accept there is a need for change. Most people in India are like you and refuse to accept that there is something wrong and hence we never change.",
        "You could atleast try and respect their ways. \n\nI hate to generalize, but Indians are not properly taught to lookout for others, let alone respect. In India, everyone behaves like it is a cutthroat world and many just don't bother to shake that off when they move abroad.  I'm not saying that I don't understand our circumstances which made us to scramble for everything, but it doesn't have to stay that way. Indians are not taught that it is not okay to cut lines, take what you want and treat others however you like.\nI live in Canada where I see this first hand. In a country where people hold the door for you from a mile away, it is a bit sad to see Indians behave exactly how they used to back home where every other person is considered a threat to your very existence.\n\nSadly, over time this changes the general perspective towards Indians.  When you treat waiters like shit, when you dirty a hotel room or an Airbnb, when you urinate or spit in public and when you just 'mind your own business' , you are slowly chipping away at an entire culture.",
        "While it is probably true, that's a very bad way of generalizing a group.\n\nE.g - Japanese people are the most conservative, xenophobic and racist people in the world. They are outwardly polite but most stuck up and pretentious, given what they did in world war 2 but never apologized for it. Chinese hate them passionately for a reason.",
        "Then it’s meant for backpackers looking to visit Niagara Falls without hotel reservations.",
        "Isn't Japan extremely racist? Heard they were just scared of dark skinned people in general.",
        "The first guy is a Sanghi. 100%\nBefore accusing me of anything, please Google \"bjp urinating\".",
        "No that was moot",
        "Ah a savvy investor.",
        "The joke here is calling a society like Japan civilized",
        "I don’t live in India and also don’t behave like bogan. We live in a free world and people make their choices, so really what can you do! Are you trying to school people by adopting social score like china has? You think it’s democracy ? \nTwo wrongs cannot make a right.. some people behave the way they do! That doesn’t give Japanese right to have racist tone to their complaint. Why not also discuss racism and bias a brown person has to face because of such comments and treatment? \n\nAny persons action  should not be representation of entire nation or race - its person issue!  \nYou are putting westerners to a very high pedestal by your change comment. You think their entire society is goody good? \nAlso who determines what’s a good change and bad?",
        "I was simply pointing out the scientific inaccuracy of the statement that pee is bad for the environment.",
        "well then u haven’t looked at who is the PM then… he itself is the biggest dick around",
        "No one is asking to change our culture. In fact in most countries people admire our culture and want to learn more. I am purely talking about behavior in Public. As a recent example when I was in Switzerland there was this Indian lady who thought playing candy crush with loud mobile speaker in a public train is cool. I had to ask her to use headphone or shut it down as I can see people around were fuming and making remarks. She was clueless as to why I asked her to do that because if you ever travel in Indian trains this is perfectly normal. We are in billions so this ‘one person’ thing you mention when extrapolated accounts to thousands of people. Let’s accept it we don’t have public etiquettes and this is why we get such treatment.",
        "You claim that you are not like other Indians and therefore are embarrassed and feel the need for change. And there are many like you and there will be many like others. This is classic all Chinese tourists are terrible - are they? That’s pure wrong to judge all Chinese tourists based off their behavior.\n\nI am not disagreeing to general etiquette, but generalizing to whole country and not calling out  racism is also incorrect.The post has very rude and racist tone, there are better ways to resolve the issue perhaps better etiquette on calling out too.\n\nAlso feeling embarrassed of someone’s behaviour is plain stupid. A person owns their action- categorising people in buckets is creating bias which eventually leads to racism",
        ">When we cook in apartments of cold countries with windows closed, our outer wear picks up a lot of smell. \n\nI had this problem. Put the jackets in the closet and away from the kitchen. It's ok to realise and try to correct but most don't.",
        "This. I saw a recent Instagram video of a cars of senior advocates and judges of Delhi High court or maybe supreme court. Some Punjabi guy in the comments were saying he makes 7K$ per month delivering pizza and Uber which is better than the judges lifestyle in India. \n\nI'm in Canada, I'd give this up to be a judge I'm India. The political influence and immunity that comes with being a judge or any civil service has to be witnessed to be believed",
        "The amount of hate clouding your mind. Hope you find help soon.",
        "People in Japan often prioritize cleanliness, follow public etiquette, and maintain discipline in public spaces which most people in India lack. Hell, that's the one of the reasons they don't even give citizenship to other countries'citizens.",
        "We need these in Canada tbh. Uncivilised behaviour is at all time high.",
        "this may be offensive to others but for those who dont know japanese people are very systematic they wont even cross road unless its a red light even if the road is empty and noone is around. while in india you only behave when someone is watching. the difference in culture is there. either is not bad but for indians these much systematic may look like too much restricting while for a japanese this thing may look uncivilised.",
        "It is slipper shot to the people of Vishwaguru nation.",
        "Don't climb the post lol",
        "Don't climb the post lol",
        "I have no idea who says Chinese tourists are terrible or ever heard of it so can’t add much.\n\nI respect your opinion, truly do. But trust me it is not generalizing when 1000’s of people from the same country do it. All I’m saying is, we do have an etiquette problem and this can only be solved if we acknowledge it and get better.",
        "Videsh Jake kya ho jata hai in logo ko, sala yaha to itna acha dikhate hai apne aapko par bahar jate hi gawarpana bahar aajata hai in logo ka. Deport Karo salo ko.",
        "Don't blame the food.. Blame your fuckin hygiene you dirty rotten scumbag !!",
        "I've been saying this for ages. Indians need to learn about morals, ethics and humanity!",
        "People tend to forget this, since they mostly see Japanese culture through a lens of popular media. But Japan, has been, and continues to be, massively racist.",
        "Nice Engrish.",
        "Not defending the peeing outdoors but I think it's a bit of a Karen move to tell kids not to play in a communal space. Like bc what the fuck even is playing with great momentum. I know Indians get a bad rap for sticking out, but I genuinely believe that a lot of hate comes out of racism. Seen this in person, where a group of Australian tourists were being super loud in a restaurant I was at but a group of Indian people sitting next to them were asked to keep it down. \n\nNot saying that a large majority of Indian expats are perfect, but trust me, we get a lot more flak for shit than our whiter counterparts",
        "Nipponese don't know English. Why did they bother to write this in English. If I was a Nipponese I wod use Google translator write that out in all indian languages besides English.",
        "Nenu Canada vachi 20 yrs aithundi. Nenu vachinappudu konni chinna pockets lo desi gallu undevallu mostly Sikulollu. Vallalo chalavaraku 2nd gen. Nenu proper thellolla & asians areas lo undevanni. Digina kpthalo edho kotha janma ethinattu anipinchedi. Telugu leka Hindi vadu kanipiste annai ani jai chiranjeeva cinema laga emotional ga palakarinchukune vallam. Past 5 years lo ikkada vipareethamga India nunchi janalu diguthunnaru. Okkosari nenu canada lo ne unnana anipistundi. Chillar chesi pardobbaru. Road meeda traffic sense ledu, India style competition annitlo, lines break chestaru, manners public etiquette bochu kuda ledu, eppudu phone pattukoni selfiela gola road pakkana chettu ni kuda vadalaru selfie kosam, bus stops ninda desi students, amazonlo uberlo taxi migilina delivery vallu motham manolle. Road meeda litter start aindi inka ememi chudalo.",
        "This is why Indians get so much hate because of these idiots.",
        "Mukhyamga ee punjabi sale gallu aa lathkor music andariki vinipinchalane doola endo artham kadhu. Headphones pettukinna kavalani pakkodiki vinipinchela pettukuntaru public places lo. Inka car unte vallani evvaru aapaleru.",
        "That's only because women can't pee while standing.",
        "I maybe downvoted for this... but this does smell of racism, a bit. There may be an Indian out there who is responsible for the mentioned deeds but the Poster does casually throw dirt on Indians as a whole.",
        "These are the same Indians who tell Indians from north eastern part of India to not cook their regional food and respect Indian culture.",
        "I went to a restaurant with family about an hour ago and the people next to us were sitting cross legged on the chairs.",
        "Totally.",
        "You have to understand Japan is very matured country and their population demographics lean towards more older side. That means not many children around to make level of raucous that small children do. With age many people develop dislike for loud noise and uncivil (subjective) behavior. Indians going out of country first time are natural to seem uncivilized in many developed countries, Indians tend to be loud in general cause they grow up in noisy environments of beeping car horns and too much noise in general majority of places outside. Their sensitivity of surrounding noise or lack there of gets diminished and it’s natural to happen, It’s a evolving society will have to go through some growing pains but they will get there. I already see transformations happening among the diaspora who has visited other countries or lived in them for sometime. But when we have half a billion people to uplift it’s going to take time.",
        "Thing is. People have stopped working hard. Thanks to social media, they think everyone deserves easy money. iPhones, Audis, Gucci, Prada etc have ruined people’s mind with materialism. \nAnd another issue that lies with Indians is, they are sex addicts, or perverts and don’t leave a chance to ask for sex whether be in India or Canada. After some research I believe, Education has to be prioritised. Lack of PROPER education caused this havoc today.",
        ">I just wonder how these people must be living inside their own house.\n\ninside is clean. outside is dirty. - indian logic",
        "No one's asking you to go home and sit & pee. Go home and stand and pee only, but go home. Why can't you wait till you go home?",
        "yes, it is important...tho the discussion should not be abt whether its an indian man in civilized society like japan should be told off... India or japan him urinating outdoors is a crime...its because of people like him why india has still not acheived swatcch barath.....i am also against that man tho calling him fat was completely wrong",
        "Yeah this is common when making the onion masala fry which is the base of most delicious indian cooking. My mom used to make it on a hotplate on the patio in the summer and in the garage in the winter. Otherwise the whole house and all the clothes in it will smell. The parents dont care, but us young people trying to fit in with the rest of society gave a huge damn about it.",
        "Agreed let's not forget about the ugly American tourist. Spring break in Mexico is like Dantes Inferno.",
        "Not to make excuses for them, but they mostly come from poor rural villages and live in abject poverty. Manners are low on the list when you're trying to make enough money to feed your family. \n\nWestern society is far richer on the average and mist of life's needs are met. Then a person tries to rise from being just a man to become a gentleman. Just my opinion.",
        "A very sensible comment\n\nJaps aren't quite welcoming, and often resort to closet racism towards foreigners, even the white people. Granted, it's their country, and their rules, but there is a reason why the country is unable to attract immigrants and their economy is in a steep decline.\n\nFor all we know, it could have been a random south asian who was urinating in public. Also, children climbing up poles or rough housing is natural. They could have easily made a generic statement not to engage in these behaviours, instead of pointing out to the community, as if its the parents teaching them to climb poles.",
        ">Nothing wrong with kids playing. Kids will do such things -\n\nExactly. And it's written as Indian children, as if playing and rough hosing isn't done by a Jap kid.\n\nIn a more immigrant friendly country, they would put up a generic message or inform the parents directly. Not paint a target on the backs of Indian kids.\n\nThere is a reason nobody wants to settle down in Japan, not even the young Japanese. Bunch of old prudes hanging onto outdated formalities.",
        "Feedback from Japan is as follows \n\nNo I've not seen quite such blatant statements like this, and I was actually going to comment about old Japanese guys I've seen peeing pretty blatantly on side-streets being relatively common.",
        "Sure. Next time, someone in India would put up a post saying that kids from so and so caste/ community are jumping on benches or climbing up walls.\n\nIf that is unsettling, then so is this",
        "The entire nation is filled up with elderly people. If this xenophobic behaviour is to go by, the nation would run out of youngsters pretty soon.",
        "Except that said caste belongs to this land not the Indians in japan. Behave in the place you go.",
        "Ok. By this logic , would you be ok if south Indians show this kind of racism towards North Indians in their home state? And that too over children playing?\n\nLet's call spade a spade. The guy urinating is a moron. So is the building security putting up racist messages and clubbing it with children's play issues.",
        "Indians won't be pissed about any of this in first place. I'm just saying I can understand those Japanese, their social behaviour is different, expecting them to adapt to Indian behaviour is audacious, hence this reaction was natural.",
        ">expecting them to adapt to Indian behaviour is audacious,\n\nI am not expecting them to adapt. I only mean that there is a way of conflict resolution without sounding crass.\n\nTo be honest, I think Japan needs immigrants real bad. They are running out of working age population so fast that it's scary. It is just old people doing short term thinking that's driving out people who genuinely want to settle down in their country. This kind of behaviour isn't just directed to Indians , but even towards Europeans and Americans. Like them prohibiting entry to restaurants and public spaces for foreigners.\n\nYou can try understanding them, but that doesn't make it correct even from their POV. Japan has a rigid culture driven by oldies that's incompatible with 21st century sensibilities. They need to adapt fast or die out.",
        "You should be arguing about this to the government and the people, not me\n\nI have been the change that I want to see, and I have not seen it",
        "Yes 100% India (along with a great deal of Asian countries) is very much uncivilised, I think the biggest struggle must be things like keeping sandals on in public and driving.",
        "I don't know how to feel about this. \n\nIf an Indian person urinated in the park, then it's that PERSON who did that crime. So, no need to stereotype the whole damn country. Yes, there is an issue in India but making generalisations helps no one. So, there is no need to call out the \"INDIAN.\" \n\nTo the Indian person, I would say to not urinate in public. The outcry is completely justified. I honestly don't give a damn about what foreigners or other Indians think about Indians. I think it's more important to think about WHY you should follow the rules more than appearances. \n\nWhen it comes to being civil and respecting local culture, I think it's okay to be yourself. So if Indian children are a bit loud or playful, then I literally see nothing wrong with that. Children develop motor skills and action-and-consequence learning. I don't like how they are micro-managing children. In fact, I don't like the Japanese stand on \"Children running in the hallway being bad.\" I know children can be a little loud and naughty, but I don't see that as a bad thing in a normal setting. Unless their lives are literally in danger, I don't think it's wrong to stop children from, well, being children. Yet, I think it's important to teach children about \"crossing the line\" and not being too extra. I understand that the entrance is not a playground. I agree with not climbing the post because that could be dangerous. But, I don't know how I feel about the tag. I think the solution is easy just ask them to go to the playground.",
        "Yes, I agree",
        "I don't like broad generalisations. I also don't like \"Civilised Sense\" coz that word has a lot of colonial baggage and sense of superiority. I absolutely despise this mindset.\n\n1. This is just a cultural difference. Indian cultural norms have more impact for sorry and thank you, so they are reserved for when you actually mean sorry and thank you. So, bumping into someone isn't a big issue, culturally speaking, so that's why some Indians don't say sorry or thank you. I don't think not saying sorry makes you less \"civilised.\"\n2. I've seen this happen sometimes in India and abroad, especially in airports. Maybe, this is because of population numbers. I was a queue at an American college the other day, and they were touching each other. This mostly happens in temples and that's due to logistical nightmares and people stopping to see the idol/god for more time. I've seen people rush out of Indian metros not letting people out, and I've seen the same in an American metro. \n3. I personally hate spitting in public and will avoid it unless absolutely necessary. I hate paan a lot, which is why most Indians spit. It's a psycho-active addiction, so that's why it's hard to stop it. I've seen Americans spit on the road too. \n4. I've seen so many Americans do this. They also put 100000% volume on their cars and drive down the neighbourhood. \n\nAll cultures are \"uncivilised\" to some extent. No culture is perfect. Japanese society has a lot of flaws, you know with high suicide rates and loneliness epidemics. So, I don't think it's right to denounce a culture, country or something collective when an individual breaks a role or is being gross.",
        "Oh this is bad..when in Rome, obey you know 🤦🏻‍♀️",
        "Totally, they should respect rules of the culture they live in and blend instead of causing troubles to others",
        "Totally. Being a himachali and extreme spice eater my friends have told me this 😂😂😂",
        "This deserves 🍰",
        "And vice versa",
        "No its more of Sab chalta hai attitude which ruins for others",
        "Its more of they live with thier own community which alienates from nativee of that culture",
        "😂😂😂",
        "Yeah agree. Age group matters here too. Moreover the community they live in and associate with affects their ability to adapt",
        "Again, sab chalta hai attitude",
        "Wait whaaaaaa 😂😂😂",
        "Could be lol, still funny",
        "I live in Canada and I always tell my family and friends that we represent India and it's very important to be mindful of that when we are outside. In the elevator, when driving, in the mall, at the workplace or anywhere. It doesn't take too much effort to behave like a part of these societies. It becomes a habit after a while. The basic idea is to be aware of your actions and respect other people and think from their perspective. Unfortunately Indians lack this awareness and anything a non Indian would say to address this is seen as racism. On top of that there is this jingoism among Indians that they and their culture is the best and what not.\n\nI love India and most Indians but I am ashamed to be coming from the same country as these uncivilized \"Indians\".",
        "It is unfair to blame Indians for this. Both the post are extremely racists.",
        "That man definitely nit civilised but nit all of the Indians. And whole of Japan was uncivilized in reference to Japan's brutality against the Chinese and Korean women before world war II. So called all civilised societies are in wars forcing millions without toilets in refugee camps...",
        "That man must have been taking the piss, the second thing with children playing is not that serious. Maybe it's healthy to have animated kids that like to play, even if it upset Japanese sensibilities. Japan has the reputation of being a really Xenophobic society, that not the hallmark of a civilised society.",
        "We aren’t even talking about PM. Stop inserting POLITICS everywhere. The discussion is something about the type of people. And for your info, Rishi is not an immigrant, he’s a British Citizen by birth. There’s a difference.\nYes he is 2nd generation desi. But not an immigrant. So, please keep politics aside and see. Canada is full of illiterate and sick minded people, who just go simply for showing off, fulfilling their dreams of having s*x with a foreigner, get PR. Tell me if I am wrong. Canada is doomed",
        "If you re-read my comment you'd see that I have specifically mentioned civilised sense of *developed nations*. I didn't say universal civilised sense\n\n1. When I complain to Indians about driving on the wrong side of the road they say I should be driving carefully and everyone else is doing it. When I tell some of the Indian smokers to not smoke in public they ignore me as men ignore male-protagonists in porn movies. So much for deeply feeling sorry.\n\n2. Maybe you have seen. I have not to parts of developed nations I have been to.\n\n3.I didn't talk about your habits, I talked about the mass. Right?\n\n4. Again, I haven't seen this in the parts of developed nations I have been to. I do know that there are punks who do it, but with Indians it's with almost everyone. As soon as I enter the lift of my society people are looking at their phones with loud music on, in buses, trains, and sometimes even in aeroplanes.",
        "First they need to shed this cultural superiority they have. We are not better than anyone else. Respect all cultures!",
        "Even in NYC is you let kids run rampant in an apartment building lobby you'll get heat for it.  Children don't get to rampage everywhere all the time",
        "Buddy looks like you haven't heard the line \"catch them young.\" You need to teach them at young age to start with. Then too it's difficult as when the child grows up they see things around them and pick them up. Happened with my kid!",
        "I would say that the kindergarten years should be spent in teaching them basic manners, etiquettes and civil behaviour. People are rude, loud, and inconsiderate. Atleast I have found that all over India. And if you are soft spoken and polite they think they dance over your head. We Indians need to be taught these things but instead are concerned Abt useless things like history, language, ......etc",
        "Another one : I see random signs like \"don't throw cigarette butts from the balcony\" and other things which SHOULD be obvious posted up in the lobby of my UR place, but it's always written in four languages and never calling out a single group. That's pretty terrible of them in that building in that post...",
        "Aren't that upper class, upper class middle people who dress nice speak 🗣️ high level English and have attitude not giving bhav to other middle class? They don't have manners to behave in foreign country especially Japan who is pro follower of systematic discipline life? \n\nWhich individuals type people from India behaving bad like this? Want to know",
        "BO?",
        "Mate, you can't teach self control to a toddler. Big parks have toilets, small ones don't. The best way to avoid is to get them to the toilet before leaving but kids are kids and accidents happen.\n\nMy kid is older now and does not have a \"bush wee\" any more.",
        "As a parent to two kids I am replying it can be done at some point. Toddlers are not the only ones peeing on the road. I have seen kids come out of the house and pee on the road simply because they have been taught so! I was in Western state of India! Not stating the name in fear of offending people. The effort to teach itself is not made! I have seen men brag Abt this privilege. This man who lived and worked in gulf made money and is now back leading a retired life in India. On the contrary how many women do you find peeing all over the town! It's to do with the attitude.",
        "I have lots of acquaintances in Canada. The \"locals\" don't give much bhaav to Indian immigrants.\n\n(Locals means the European settlers from a few centuries ago, the real natives are totally sidelined)",
        "I am not proud of my fellow Indians at this point of time",
        "Body odour",
        "I’ve seen Americans(both northern and southern), Europeans spit in public and clear their throats. So that’s a you problem !",
        "2nd one is stupid. Japanese robots smh",
        "More like \"Inside is someone's property, outside is no one's property\". Ideally it should be \"outside is _everyone's_ property\" which is the heart of why there is a lack of civic sense.\n\nWhen there is a shared and understood responsibility that keeping one's surroundings clean benefits _them_ as much as it benefits everyone, things will change.",
        "funny thing is when i tell ppl to not throw food wrappers out of the car they''ll say  \"this is india,  thats how things work here\"  .",
        "Yep, because at that point they rationalize it with \"Oh, it's already dirty anyway, so my food wrapper/chips packet/plastic bag isn't going to damage it in the grand scheme of things\". It's unfortunate, the only way I've gotten people to stop is to shame them into picking up after themselves, because trying to reason with them has gotten nowhere.",
        "Concept of privacy and giving space is absent there. Visited Ind last year, went to watch a movie in one of the malls, movie starts and this mom talking to her kids loudly as if she’s in her living room. I ask her to stay quiet as the movie has started, her reply “don’t you understand they are my kids”",
        "They have a certain resentment about the country they go to and like to bring their hyper nationalism when challenged.",
        "Been to Japan. Just go out on weekends and you will see so called “civilised society “ drunk pissing on street and alleys same. Passing out in their own vomit. And don’t even start on pervs on subways",
        "India needs to teach its people civil sense.\n\nFor all this nationalism - you still don't care what happens 5 ft from your home. I find that jarring. Trash, urination and various other things are calmly accepted.",
        "Jethabhai is out pissing outdoors in Japan?",
        "Bro chill, There are small instances. These types of behaviors are super rare by Indians abroad especially the U.S.  I live in the U.S and Indian people here are educated, civilized and a good contributor to the society. Indians here have super low crime rates compared to other ethnicities. I know there might be some weird Indians abroad especially in Thailand but, Indians wherever they go are largely peaceful and follow the rules. The stereotype against Indians by foreigners is largely driven by social media, biased media, wrong portrayal of Indians in popular media etc.",
        "That doesn't mean a foreigner should be pissing openly in the parks!",
        "bro took the post from r/newsentence",
        "two things:-\n\n1) wtf is wrong with the english here lmao  \n2) second one is brutal, like c'mon those are kids. Those kids are gonna feel guilt for something they had no control over, after reading it, god knows if the other kids make fun of them or judge them.\n\nalso people don't see but it's problematic to blatantly just call someone by their race and post it on public, like if they had a problem they could have mailed personally or talked personally but to post notices and referring to them as \"that indian guy\" kinda seems sad. Maybe i'm wrong but that's just how i feel.",
        "Anyone who's been a victim of a hit-and-run in Japan and doesn't know the culprit should start posting, 'The Japanese driver who hit me broke all the rules, and if anyone finds that  japanese person, please report.' Let's see how these yellow monkeys react to that.",
        "What culture does not emulate this?",
        "I am ashamed of being indian. God please next time give birth to me in Japan!"
    ],
    "cleaned_text": "think people leaving india overseas need learn behave civilized societies like one japan said heading wished country men women civil respect local culture japan case respect earned need respect earn respect ",
    "cleaned_title": "think people leaving india overseas need learn behave civilized societies like one japan",
    "cleaned_selftext": "said heading wished country men women civil respect local culture japan case respect earned need respect earn respect",
    "cleaned_comments": "whip ass already oh god rough lived ur years never saw notice targeting specific community tip iceberg look nichannel post climb post compound barrier ground plant soil shit incredibly racist wtf get disrespect county culture racist calling specifically perpetrator details unacceptable behavior without knowing name else supposed call perpetrators using national identity racist rome absolutely idiots give bad name us create stereotype continue prove stereotype respecting countrys rules okay imagine outrage japanese person walks temple shoes wrote comment downvoted httpswwwredditcomkqdputmsourceshareutmmediumandroidapputmnameandroidcssutmtermutmcontent posters correct indians filthy nature consider house clean disciplined matter show true colours outside show arrogancy insecurity cry racism see threads dont need call indian specifically thats agendapushing say man border pattern backpack please stop urinating dads moms entrance playground absolutely general warning agree many indians go abroad refuse acclimatize environment shit plain racism lots indians immigrate arent interested learning local customs changing ways sad reality dont know downvoted mention indian man say man breaking rules indian parents write parents cant call stereotypes reality majority indians arent taught hygiene since childhood looking first picture seems describing jethalal tmkoc indians generally poor behaviour indian kids even worse laad pyar grandparents society kids day playing stairs building something like thishttpsencryptedtbngstaticcomimagesqtbnandgctlyxiczgqsuorzgcrtbrxavdanhjeplvwusqpcau go want change people like instead changing much shouldnt mentioned indian understand point thinking address dont specify doesnt give anyone right generalize everyone create hatred rule abiding indian looking people locals attacks name hate take shape good guys always punished things like racist reality think indians community behave like absolute shitholes cant blame entire community certain people behaved urinating nothing local customs phucking civic sense basic basic ones asses must whipped types ppl individuals among group indians migrate primarily financial reasons place everything else backseat bother chalta hai attitude unintentionally put india every live seen scums like life thats definitely stool someone kidding sad see people teaching manners atleast educated top society people actually think notices reform indians behaviour yes seen enough agree might smaller portion among us nobody wants take chance bad experience many people behave weirdly move abroad one friend girl studying us university decided go bar indian friend us friends indian fellow approached dance denied started verbally abusing indian friend said complain bar owner one even understands trying say went another place indians dont even manners follow rules country go abroad need learn civil india well abroad dont disrespect culture goes nations humiliate enough want change thats aim call hater wish didnt saddens people like get move abroad pursue great opportunities many people see nowadays moving hk uk australia etc disgusting illmannered people ever pains im still stuck theyre embarrassing south east asian diaspora india even get get kicked beyond learning norms countries necessary think labelling communities like racist dangerous generalises entire community based actions notices taken immediately scold kid wont affect selfconfidence wont lead suppression feelings wont make kid wimp year old culture civilization become great urinating showing dominance jumping like monkeys dont japs know dont dare say insulting things us boycott movies cripple economy dont know mera baap kaun hai dont expect civil etiquette indians never taught things start country sb chalta hai wala attitude indians carry wherever go refuse learn local customs blame others get uncomfortable ever go indians indians oh attack cultural heritage man bladders full let burst racist japanese stifling freedom kids play make happy sounds cruelty nothing wrong kids playing kids things japan notorious culture formal obedient stereotype salaryman people work hours day never say boss drop dead theyre yes urination public place ok especially country public toilets easily found south east asia mean india countries need shame look around man think majority indian uncles aunties shame embarrassing exactly shit parent make shit adults forget personal experience believe young adultsyrs go abroad much easily adjusted environment cultural practices people go abroad age mostly master students working professionals stuck indian idea things care choose ignore cultural practices followed region way saying general norm exceptions everywhere people whose incidents highlighted social media general bad name indians generated ps refers indians living abroad tourists sadly put rest us indians shame right puranas veda people used urinate nearby plant get nitrogen grow westerns dont know advanced thinking lmao fr people usually go abroad affluent sections society read upper caste entitled af bring attitudes cultures along move countries thats still see casteism immigrated indians abroad obviously defame indians oh god disgusting shameful hate ones urinate india like cant hold youre home women smaller bladder whats ghamand men used live bangalore used walk nearby park every evening work hour lot parents used come kids seen parents making kids urinate park good educated folks looked rich used stay hsr techy area used wonder people teaching kids okay urinate public correct parents supposed teach respect environment teaching urinate wherever want even nice park sad state indians call whatever indians uncivil dirty people planet indians disgusting parents dont even teach manners usa sad embarrassed l wont show next day fucking shithole shitty people modern think japan targetting people race lives building shows racists could mention name appartment probably talked directly nichannel thats postbox might referring actual post like pillar requests valid form isnt reeks discrimination stfu jus fyi south east asia doesnt include india india part south asian region yeah weird see people defend imagine living elsewhere faced racism due flyers like someone else even though never behaved poorly im sorry seem belong type pointed first poster fact called like huge expected come new place learn ways told like shameful disgusting teach lesson foreigners visit india get ready fuck foreigners arent highly complex complicated things basic things manners taught schools iirc people dont follow nothing caste lol personally taking guarantee person whos upper caste term would show attitude whilst abroad chan find translated posts first one fine nd notice children playing looks like pretty common whatsapp notice gated society india also english seekh le pehle foreigners ko fuck baad mein karliyo go foreign country mark territory assert dominance win page found ive never urinated outside park swear im laughing unrealistic expectation indians could neither reform reformed schools teachers parents society decades average reform passive notices people either rich intelligentskilled even lack civic sense japan nice looks cultural differences everyone else slightly better white guy conflicted completely agree moving overseas learn culture customs adhere much possible hand mean kids always possible control behaviours anyone kids understand arent telling kids fair seen plenty japanese kids act fool well theres reason call race people scenario would rather indians living india behaving civilized way feeling piraud indian arm india comes south asia along nepal sri lanka pakistan bhutan etc sea consist thailand vietnam philippines singapore indonesia etc exactly people concerned personal hygiene public hygiene thats shitshow littering even frowned upon please try call anyone notice littering public places managed change people mostly friends mine better regard japan racist shit towards foreigners really shows culture manners instead talking guy directly created racist posters stick around agree sentiment yes call people see throwing thrash public spaces recently started college people absolutel holes make sure call also managed change friends also happy cake day india japan different planets guy urinates park deserve humiliate dont defend criminals lol im wondering civilized society blatantly racist note clearly racist uncalled couldve called person without involving nationality cant identify individual know indian take offenders directly kind civilized society points finger whole country billions offence done couple people thats like hawaii much take lack manners countries even countries short stint theyre back india theyre back behaving like theyve got zero respect kind rules teaching civilization india india county continued culture civilization thousands years unlike babylon westernization civilization massive population people judge indians observing reckless peoplepeople realize great civilization implementing laziness busy life style wtf man gained weight cant stop laughing whats going mind person created notice understand someone moves abroad called caste name call god person indian heshe goes india casteism among indians exists india outside india course whichever country one goes follow things work country mean local custom india urinate streets japan toh sudhar jao observations indians behavior traveling abroad treating airplanes like roadways bus one waiting airplane stationary parking bay waiting seat belt sign everyone stands kids running havoc aisles one case kid threw warm shahi paneer like cricket ball land foreign guy dressed business suit bargaining like hell showrooms causing lot embarrassment ready pay display price exceptionally loud talking message delivered talking softly aware immediate social environment absolute lack personal hygiene general disregard sanitizing gym equipments use poor toilet manners cleaning clearing used cutlery crockery cafes leaving table fellow men problem consistent staring ogling white girls matter public transport street beach location doesnt matter expressions worst group men kind voyeur perverted behavior willing read understand local rules using phones watching movies theaters feel free add list learn reflect fr crossed people urinating walls behind dumpster coming back college going become common see videos indians shitty things brampton southall instagram average comments india defending going become brazen disgusting attitude model immigrant reputation going crumble coming years last months ago uk went beach walk signs swimming going water saw indian family know based language accent going sea swim broke rules moreover unwritten rules like throw trash beach sea saw well someone non indian sees think indians like fact every indian like op could explain shared rindia considering minimal likelihood members either residing japan desiring relocate im sure us feel bad correct course action dont think actionable component tied done less people sub want ever go japan let kids jump fucking post survey results affirmative responses jest might consider outrageous act marine drive live stream instagram lighthearted remark though old approach find issues complainant instead addressing issue hand ch forumtextboard anonymous board usually lot ultra conservativexenophobic users many participate various forms activism believe chan inspired ch pretty north indian attitude see south india well indians stubborn adultbabies like islam met telugu people us everything operates within caste among may affect shameless man affect indians done nothing wrong perspective notices like spread sns turn act warnings various communitiessocieties risks allowing indians live amongst basically giving indians bad name culture usually nonconfrontational stuff want much damage possible one thing parent would agree kids running park sign civilised society ever perhaps claim seems dubious one thing ever interested civilised societies please read japanese soldiers treated korean matured adult women called comfort woman make sure let wife sister see thishttpsyoutubecomshortskucamdbsissdteeewrf let know civilised japanese society said great respect thembut sorry kids running high momentum overkill last least let kids run manhttpsyoutubetmhosjwkdmsiqbhnxapur met tamils france agree point least indian tamil never discriminated parts india like bihar assam etc idea people migrated years ago dont make friends india anywhere better live alone process life calm manner majority indians dont deserve many individuals similar op tend conform rather think independently instead steering conversations rationally unfortunately often accept whatever told without critical analysis slavementality public urination indian custom mean chan yeah chan en counterpart chan japanese okay racist make announcements without mentioning race wont make difference yes never conform piss streets full support piss mat kar bhai lekin baccho kokhelne de mene kab kaha piss post padhna seekh le lodhu bhartiya culture urinate public scroll way find post true though id wager youd correct someone islamic rape gangs uk indian rape gangs feels xenophobic constantly refer nationality instead name house number access security footage dont know name pretty ignorant casteism definitely problem outside india notably silicon valleyhttpswwwwiredcomstorytrappedinsiliconvalleyshiddencastesystem indians educated earning well common knowledge japanese racist towards indians kinda expected language used however theres reason excuse misbehaviour sides case need get better im netherlands live one street away local small hindu temple say indian immigrants nice tend polite hard working often see bunch men playing cricket park looks kinda wholesome year hold festival temple music food market thats time get indian snacks dont strict youre good people japan deeply racist xenophobic country said indian really need learn behave basically indians migrate first world countries third world culture wont change within generation two change start home shameful knowing half people country behave like hooligans teach children thing better people lived japan almost adult life dont think japan racist sure less racist india lived many indian states face less racism japan compared india ok let comment point fairly fairly universal behaviour including shahi paneer cases lol literally nationality waits plane park also proper instructions flight crew many indian flights instructed one get f never seen germany indians model citizens like money pay anything might true indians especially mobile phones public transport bonkers never seen anything like indian dude disinfecting equipment either everyone one depends gyms culture areas gym gym cardio area disinfected never encountered anyone except teens would leave coffee cups table universal man behaviour universal tourist behaviour dont watch many movies cinema didnt notice race person cinema inn logon ko onsite kaun bhej raha indians issues introspect try substitute community indians dont feel racism posters specially second one maybe sri lankan refugees moved netherlands kids may educated netherlands netherlands good population sl tamils japanese learn grammar first dont know dick might sucked get south asians especially indians bangladeshis pakis along chinese notorious bringing practices home countries abroad south asians one worst offenders comes petty offences like jay walking littering flouting rules doesnt justify shit like cant imagine western country cant collectively name nationality b acts uncivilised idiots japan south korea known xenophobic racist attitudes japan loves blame others collectively comes apologising ww crimes could see individualistic arent responsible ancestors feelingg paraud indiann aussie also lived worked many parts india two decades speaking sydney experience huge indian community centralised around great foodie suburbs others spread established suburbs dont believe ever complaints type op referred resident tourist think problem hugely overblown certain monocultural countries reflects certain bias foreigners especially asian countries south asians welcome addition mix australia though speak mainly sydney experience dont let isolated incidents take headlines japan racist says casteists target person nationality ethnicity race hows different calling osama muslim terrorist man last letters username suit perfectly wouldnt hit indians hard japanese xenophobic racist bunch people known outwardly polite hate guts outsider white black indian ah okay okay generally see people using term sea diaspora everywhere used thanks letting know youre gon na live japan got ta follow rules someone comes india japanese real serious culture unlike indians open air defecation definitely indian custom calling bunch idiots nationality isnt racism immigrants underdeveloped countries less civil known fact dont see western countries calling people like imagine backlash black people us get head japanese masters ass ww long gone man jap lost public urination common india lack public toilets lack care environment first one change depending go second one person care nothing done thanks another note first would never suit lol address problem racism came racism act right senses publicly urinate defecate mean cant please thats weve always indians blatant racism especially second notice shame japanese aunties sure indian uncles however might entirely different species maybe ill know years go bald grow belly shitty stache make jingoistic comments mask insecurities know ive talked theyre indian andor indian descent lack care environment urine biodegradable harm cause environment understand japanese society understand said racism india live within rules rule based society even kids rules getting kids wee parks kind acceptable outside india well children dont self control course last option bathrooms nearby corpses also biodegradable harm cause environment whats bet million sort indians pull kind shit first one take umbrage foreigner doesnt follow indian custom india like youre india must respect local culture short theyre nothing indian supremacists running wild acceptable japan even locals think called indians indian parents letting happen building smile reading first post title implies india civilised society dont think thats true second extremely weird single one nationality something wrong thats racist live germany indians meet quite nice germany lot rules everything everyone peer pressure society make sure everyone subconsciously starts following rules rules explicitly written somewhere like put dog leash noise important rules actually implicit let elderly sit bus dont stand corridors public transportation dont stand next free seat blocking use warentrenner supermarket separate groceries next persons dont cut queue etc like throw trash street wont even theres one street watching sense doom aunty come start screaming sense righteousness climate awareness instilled since childhood simply cant european also dont throw stuff street india matter normalised experience indian immigrants germany amongst lawabiding people theyre super scared things wrong way precisely seek acceptance society scared judged rejected ironically peeing public germany something people nature away crowd technically illegal ive seen people pee hardly secluded places drinking since drinking part german culture peeing right corpses dont cause harm environment fact help environment providing nutrients plants well takes one know one bigot pretty much excel forms bigotry petty material comparison evils like castegender based violence doesnt mean japs arent xenobhobic lot whole world take indian india parents pee guy cry raaaccciiiiisssmmmm saaaaar media usual song dance japanese authority called threaten apologise jaishankar issue tight slap old thing conditioning indian parents giving kids public urination fine btw seen adults well post rules dont target community racism targeting community care environment think urinating garden tress actually help environment also japan discriminatory nation india guys drunk dont manners happens world friend never soho london saturday night people crazy shit urban areas urinating public definitely wrong doesnt give anyone right identity race much hate defend low life japanese man put poster identity defending racism race worst stoop even culturally aware japanese would agree using indian unnecessary besides japanese cant really distinguish indians south asian know ethnicity never japanese mate always brown skinned man get life caring environment mean take care trees plants animals also literal meaning taking care area around means keeping clean beautiful comparing party street residential place give break true especially japan toilets regular intervals yeah environment wrong word lack care cleanliness hygiene probably meant cats pee house expand outside world humans peeing place heck theres stretch pavement nearby everyone avoids walking covered pee stains circle life yeah lots arrogant people like father get angry theyre told disturb others bherund bejatti hai bhai agree hum log ko bahar hi nahi apne desh mai bhi sudharne jaroorat hai supporting em quite opposite yeah seems potray prejudice racist insensitive way call tho indians behave country feel regressed socially accepting third world scums main question bathroom nearby fault whoever built maintains place animals including humans pee defecate want human animals toilets neat whatever youve got provide bathrooms st sufficient intervals dustbins yeah poles pillars sometimes referred posts boycott movies indian anime fans like haha true dont worry model immigrant locals crappy many clean toilets park indians dont learn local cultures within country relocating states learning foreign culture far fetched living rich upper class shell need pee shit nothing wrong absurd considered dirty board depends lot certain people arrogant entitled heavy overlap conservative crappy ways sexism homophobia racism etc country dont blame calling indians making strong statement agree sense personal space respect manners feel dont need respect follow someone elses culture way living even though migrated dont want follow rules traffic non traffic dont even make half hearted attempt learning language interacting locals prefer hang indians racist sexist misogynistic homophobic openly jealous gossip everybodys life lifestyle add u know indian southasian country second notice children creepy menacing japanese people would never behave disgusting manner typical indian behaviour course going refer dirty person race lord another day another post indians outside india yawn bad apples everywhere accept move yeah feeling insecure needed mark territoryjust like cats country respect rules culture leave piss dirty technically habour bacteria mostly minerals nitrates pissing soil helps plants good know consider urine dirty make sure help environment urinating bedroom daily japan pretty outspoken ive heard southeast asians taking brunt racism mostly since theyre indians case theyre raising awareness maybe indians let inside country im indian japanese fuck know phantom pisser actually indian yes need learn manners leave religion caste shit india pretty sure thats poem whats wrong discrimination country dont want dirty indians country experience indians mostly cowards saw indian man littering australia kicked leg might given large bruise indians uncivilised indians india would change become better country welcome use garden difference urinating soil vs areas talking garden believe soil sound like uneducated idiot please never travel japan respect culture might get downvoted gon na say anyway summer husband decided book airbnb one beautiful town italy host much sceptical accept booking bad experience one indians left house dirty went one parks london group indians tourists casually throwing snacks wrappers park think country throw garbage anywheremost indians dont know basic hygiene dont care public property wonder people must living inside house ar gifgiphyoudletmkwfi get urinating part kidswhats problem playing aroundi dont get missing something prime example canada stood attitude going absolutely problematic us future people india need learn manners even india place posted apartment provided japanese government subsidized rates mainly elderly society rules making noise kids playing designated place like parks ground kids play japanese kids dont play inside apartment blocks halls late night kids playing make noises basically nuisance others place posted apartment provided japanese government subsidized rates mainly elderly society rules making noise kids playing designated place like parks ground kids play japanese kids dont play inside apartment blocks halls late night kids playing make noises basically nuisance others japanese racist people heard south east asia racist xenophobic maybe indians asshole statement also deragatory thank insight wait minute none commentators seen men standing pissing public riding bike stop along road piss somebodys private property without care world youre home without worry years world dipshit attitude change move abroad still wondering foreigners complain smelly india smelly indians maybe sub explode really get grip soaking hair mustard oil atleast youre public places stinks mile indian plastered racism whoever wrote message felt need point ethnicity person urinating ethnicity children details dont really contribute probelm addressed urine urine indian japanese person urinating obviously knows im assuming person writing message people urinating outside indians mentioning nationality serves purpose associating indian urinates outside shit tolerated indialol civic sense india ashamed someones actions one person doesnt represent entire nation good bad people everywhere stop feeling embarrassed someone elses action instead discussing post reeks racism diving blaming called indian person wrong stand community like black people message could conveyed better fashion choosing good words shows deep rooted systemic racism japan assuming race notorious actions false ive seen many whites making kids pee park trees bushes people may argue indians racist indians nobody deserves treated humiliating way children could nation theyre constantly adding adjective indian like insult almost true colours horrible thing say talking like live japan someone better inform japanese urinating public fundamental right india okay train children pee shit open need toilets toilets indians work getting toilets built indian agencies build parks without toilets exactly mindset peeing shitting park absolutely okay societal issue hence authorities least concerned also gross abused shit pee parkabroad dog scrap excreta dog civilized society saying things like okay shit public exactly referring indians uncivilized yeah indian people post definitely wrong know people exist posters racist call individual bad behaviour say idiot lives bad things go way make clear indian plenty indian friends living japan living great life loved locals dont anything problematic put effort learning local norms yes parks india designed without toilets indian attitude need toilet people pass urine along wall park culture anything done without consequence highlighted parks designed without toilets designed see need habit peeing open toilet seems unnecessary culture discussed anything done shitting peeing without consequences people lose inhibitions another country theres one correct many ways friends family know misdeeds agree clearly seen guy thats describing physique clothing well aah course distinctive indian clothing japan distinctly indian physique wtf talking racist need mention specific community let alone shaming japan kawaii anime hentai uwu would never racist hacker find strange thread theres foreigners defending indians indians defending wtf dude idiot imagine live apartment people germany come occupy flats building since new developement theres excitement building new people building germany word spreads way saw one gon na describe poster one poor way write german urinates gotten fat recently wears check shirt backpack stop pissing thats guys japanese racist doubt indians bad attitude towards learning civic sense absolutely arigato yamete kudasai yamero shiro oni ryuhei momotaro man gained weight thats water boarding level shit indian meanwhile watering fertilizing plants children could pakistani bengali sri lankan indians instead fight saying accepting something thank youve proved point youve gone ad hominem argument last resort attack person posting dont address argument wtf fat germans lederhosen discussion rest reflect silly post dont bother replying ive blocked majority indians dont civilised sense developed nations examples saying sorry collide walking standing close queue bellies touch body find irritating better queuing spitting public clearing throat public yuck playing phones loudly public indian problem human problem tell country belong making guess e asia yeah bro india everyone makes sure urinating public soil totally pavements side road anything wow said thing got downvoted previous thread lol yea seee uk man spat inside train leaving train bins inside train near train door disgusting seeing red stain bins like go home near tree inside train could effects brain drain imagine people rude untidy india best brightest indians netherlands large part highly educated people headhunted specialized jobs dont know room live describe went japan best time dint face racisms lived friends village met old japanese people intrested india life india dont live couldnt say much need bit civil know theyre good faith think kind defend indians think dont actively live india dont see shit show regularly see living india exactly brain drain like inverse brain drain less educated yet rich usually family wealth leaving country go australia canada etc barrier entry lower rarely see people countries generally low number immigrants stereotyped racist acting racist indians online ex russia czechia serbia etc lets racist black people african countries bad live im gon na say nword dont think need build toilets anything peeing outside guys plan mps approve generally dont give damn people nothing racist pointing facts person race filthy af need called nahh uk far worse yes call person race dont try justifying defecating publically uncivilized behavior wtf exporting peegate japan india students rationing food distributed govt homeless nothing shameful migrate primarily financial reasons doesnt exactly urge mention nationality people whose behavior offensive pretty typically racist behavior im pretty sure drunk japanese person nationality would mentioned germany often noticed nationality accused rarely ever mentioned unless necessary mentioned context intention seems add existing xenophobia actually solve problem dude revealing fetish world see xdddd fuck going theres guy piss fetish comments theres one corpse fetish next kya hoga many indians sense etiquettes many close circle often complain way indians behave abroad dont understand guys defending racist shit proof behaviour listed actually indian brown people indian america mistaken mexican kid energised playing play fucking big woop deal stop inferior always apologetic always sorry apply visas accept accept whats going come fucking north korean japanese racist pigs getting support yes sir yes madam please take soul ass people rub get majority people specific race known cause nuisance change way people live understandable give fuck nice limit everything many cases stereotypes exist reason necrophilia japanese playing tag tremendous momentum wtf trying say okay listen moment even done indian absolutely ok behaviour must condemned isnt posting tone quite explicitly racist xenophobic japan dont vilify something default bodily functions provide options like clean free toilets passing judgement japan extremely racist country hate everyone especially indians whole tech spotlight shift thing cultural economical something basic like repairs bias visible good racist acting like cultural oh japan nothing wrong nanjing massacre unit tons things real look anime waifus eyes forget lmaoo fyimost african countriesexcept ones active conflictare better places live indiaatleast unpolluted nature friendly culture majority people specific race lol even read comment indian families indian families causing issues right racist like indians visible minority face association bias ie saw indian guy something bad youre like white people cause issues bars lot dont deal japanese bars somtimes dont allow white people tell foreigners allowed americans allowed indians allowed something way could said foreign residents causing problems instead singling indians decide whether discrimination wrong obviously wont care personal opinion discrimination kind wrong nobody wants dirty humans anywhere obviously dont care kind heinous crimes japanese country matter person origin anywhere bruh seen two moms giggling talking three vile children formed noose two puppies neck hanged pole park hygiene baseline ignored eons ago indian bangladeshi pakistani srilankan indians full display past diwali weekend saw dozens families enjoying public waterfront near apartment lighting fireworks diyas etc next day expected trash along waterfront couldnt take step without stepping used fireworks move clean area youre going trash every chance get mention teaching kids shit living therein mindwith harem waifus indians getting lot hate everywhere abroad bound happen india worlds youngest population eager go abroad countries ageing population need immigrants indians going abroad large numbers percentage follow rules offend people culture canada countrywise cap number indians come enough points pr apart student population also come try pr eventually im indian gujarati waifus lol vast vast majority south asian looking people japan indians usually assuming indians probably correct someone came india urinated temple one idols honestly think indians wouldnt get violent might even scenario south people state tend call brainless vadaks dont want obviosuly state better compared states terms education hygiene economy call brainless right american im trying roast indians holy shit behavior exact us lot resentment get clearly dont give shit culture trying assimilate rude hell sometimes im ashamed indian wouldnt blame entire ethnicity put posters saying look chinese man stuff like happen increasing hate anyone east asian ethnicity india especially racism indians high many countries personal hygiene limited baths men especially grooming terrible body odor etc brother earns figures stinks like pig zero manscaping attitude point basically lyf rulz fk countries show rd class behaviour moving one cleanest disciplined countries world urinating outside honestly think indians civilised never said uncivilised sterotyping normal finding patterns groups people often rooted reality sub says things people gujarati time know lot sterotypes gujaratis true places like japan korea reputation xenophobic stop taking offence every little thing happening part world im glad theyre shamed particularly urinator fcuk guy put photo posters funny thing tons japanese people pee streets sometimes property owners post pictures public shame yes bunch hbs us green card holders insane racist interactions ive ever work indians residency true colors come community family sort alienated part india south weve lived years yet starred like aliens addition terrible etiquette let children run amok streets cars pretending like india getting bad giving us bad name general lol one find ones origin looking indonesian members group confused people gulf countries neighbouring india indians anyway see vaguely poor englishinformally notice written seems rantvent security manager lol one find ones origin looking indonesian members group confused people gulf countries neighbouring india indians anyway see vaguely poor englishinformally notice written seems rantvent security manager first one understandable still second one definitely also japan societies phd racism interaction one kinda opened eyes society mirrors asia problems colourism racial homogeneity existwestern people struggled racism tried address head asian cultures never even acknowledged existence societies second notice matter cultural difference norms japanese society pedantic compared neutral baseline big trouble gifgiphyyoomhliorsclsgmkdownsized jethalal japan would add people wear extremely stinky socks jackets get public transport people sweat lot people play sports sweaty socks stink day persons stuff noise smell body part enters personal space others rude indians travel western countries dont deserve quality life seen indians embarrassing multiple times urinating parks making terrible loud noises diwali blaring loud punjabi music even sure entitled prics even allowed immigrate different country indian folks reason never want stay indians filled neighbourhood western world go costco see line indian folks abusing return policy standing lines return back used items bad condition saying damaged worse pack folks thailand oh god kind haggling cheap negotiation tactics harassment men thailand simply disgusting terrible canada agree fair indians dont realise bo seen lot friends bo dont anything dont consider fault one tells food plays major role agree talking bo cook apartments cold countries windows closed outer wear picks lot smell dont wash socks every day sweaty people would stink bad week know colleagues traveled pairs socks month long trip didnt know bad habit sounds stinky canada filled illiterate brats almost good nothing went show nothing else ik criticised statement telling first hand experience friends group couldnt achieve anything india cried always shitty jobs happy lol trust uk x better canada kind kink shame put racist shit ive seen like fair enough fair enough people think walk us cause know would rather send one chopping block ever thinking uniting disagree second image nothing uncivilized kids playing urinator jailed day fine though nani amount reckless punjabis ive seen canada outrageous tho individuals among group indians migrate primarily financial reasons japan doesnt pay much reasons people migrate obviously japanophiles would observant local norms unintentionally put india every live seen scums like life think thats term pajeets used often start blaming notice smells racism behaviorwriting indian blaming whole country instead individual japan comparatively diverse society country less diverse population typically unwelcoming foreigners last least expat must understand behavior gives bad name country hence respect understand foreign culture think understood term pajeets specific group kinda interesting different perceptions different realities daryl davis know person blamed indian could neighbouring country pio east africanfijianwest indian pedofile uk cases wish days return well dont know id say south koreans mainland chinese people far xenophobic people japan preconceived notions observe customs respect tend accommodating moreso japanese people strict standards society foreigners arent aware show mess status quo get annoyed habitual people quite xenophobic yes hyperbolic say worst world israelis also xenophobic many gulf arabs saw shower indian restaurant restroom ny dont know intended mostly indians frequent would guys happy saw sign outside specifically called dalits unclean disgusting racism cool glorious nippon thats nice hear dutch person love netherlands definitely seen little bit racism wife deals rather actually much desi features im roughly scandinavian tall dont think dutch people realize indian origin small things like people talk nicely sometimes even dutch know little bit tend give shorter abrupt answers things together make eye contact basically ignore altogether dont think necessarily purposefully still happens nonetheless say constitutes anything minority interactions overall dutch people progressive accommodating people world maybe directness gets misconstrued racism even think genuinely cant take people flout norms makes deeply uncomfortable japan thats done basically interrupts peace harmony community dont mind foreigners respectful unfortunately many foreigners intentionally go japan messed things dont bother follow cultural norms japanese get jaded regarding foreigners pretty quickly whaaaaaaaaaaaaaattttttttt way educated thought considerate others high school teacher used say literate educated sorry hear wife gets treated like may well racism theres plenty going well could racism low expectations people thinking going hassle bridge cultural language gap based looks could also regular old dont like kind type racism working totally agree civics studies teaching non existent schools naturally indians less civic people already well india dont need leave financial security variety reasons example fell victim american dream young im permanent resident us way dream idk thread appeared reddit feed let know japs slur like nigger see mean well please call japanese way indians spit like fing everywhere worst behaviour without teaching basic public manners right kindergarten well like forever people lack civic sense idea used believe educated vs thats case diwali cops called people lighting fireworks night inconsiderate sure diwali try celebrate quite hours reason shouldnt either ive heard japan really racist spitting public come yaar thats meant homeless people sure thats true nyc near niagara falls didnt see homeless people dont follow rules good etiquettes expect follow outside second never bank account wallet ah japnese drink alcohol beyond capacity puke sleep tokyo roads night also culture read south park japanese accent lol would done nothing wrong act stupid face heat ive travel quite lot tell sometimes embarrassing identified indian known lack mannerism gawking women like meat talking loudly restaurants letting kids run around yelling talking loudly phones cinema halls poor hygiene list go idea government putting enough emphasis learning mannerism japan taught schools heck even clean classrooms part discipline interesting reminds video japanese person refers problem elderly drunk middleaged japanese men found infrequently urinating public places googled video mrs eatshttpswwwyoutubecomwatchvbawiihe seems responses similar sign less confrontational compared directly addressing offender certainly understand wishing prevent anyone public urination conclusion individuals every part world deciding pee wrong places problem nations recognise perhaps stfu ur moral brigading coz im indian doesnt mean similar anything billion random indians people shit alone represent u dont need take burden u also represent indian murderers dacoits rapists etc peeing outdoors japan completely culturally acceptable long people japanese western european countries strict rules discrimination put everyone one basket tick checkbox get country canada prime example poor failed immigration system taking people bulk conduct test see fit mix society lol posters racist af specifically mention indian children could simply said thing without specifying race even know kids indian could anywhere indian subcontinent weird shit japan incredibly racist monocultural largely result policy isolationism centuries strict societal norms accept people acting outside norms people japanese calling somebody race often simple easy way identify person also lot signs japanese telling people bad behaviour warning people certain things etc etc change happen accept need change people india like refuse accept something wrong hence never change could atleast try respect ways hate generalize indians properly taught lookout others let alone respect india everyone behaves like cutthroat world many dont bother shake move abroad im saying dont understand circumstances made us scramble everything doesnt stay way indians taught okay cut lines take want treat others however like live canada see first hand country people hold door mile away bit sad see indians behave exactly used back home every person considered threat existence sadly time changes general perspective towards indians treat waiters like shit dirty hotel room airbnb urinate spit public mind business slowly chipping away entire culture probably true thats bad way generalizing group eg japanese people conservative xenophobic racist people world outwardly polite stuck pretentious given world war never apologized chinese hate passionately reason meant backpackers looking visit niagara falls without hotel reservations isnt japan extremely racist heard scared dark skinned people general first guy sanghi accusing anything please google bjp urinating moot ah savvy investor joke calling society like japan civilized dont live india also dont behave like bogan live free world people make choices really trying school people adopting social score like china think democracy two wrongs make right people behave way doesnt give japanese right racist tone complaint also discuss racism bias brown person face comments treatment persons action representation entire nation race person issue putting westerners high pedestal change comment think entire society goody good also determines whats good change bad simply pointing scientific inaccuracy statement pee bad environment well u havent looked pm biggest dick around one asking change culture fact countries people admire culture want learn purely talking behavior public recent example switzerland indian lady thought playing candy crush loud mobile speaker public train cool ask use headphone shut see people around fuming making remarks clueless asked ever travel indian trains perfectly normal billions one person thing mention extrapolated accounts thousands people lets accept dont public etiquettes get treatment claim like indians therefore embarrassed feel need change many like many like others classic chinese tourists terrible thats pure wrong judge chinese tourists based behavior disagreeing general etiquette generalizing whole country calling racism also incorrectthe post rude racist tone better ways resolve issue perhaps better etiquette calling also feeling embarrassed someones behaviour plain stupid person owns action categorising people buckets creating bias eventually leads racism cook apartments cold countries windows closed outer wear picks lot smell problem put jackets closet away kitchen ok realise try correct dont saw recent instagram video cars senior advocates judges delhi high court maybe supreme court punjabi guy comments saying makes k per month delivering pizza uber better judges lifestyle india im canada id give judge im india political influence immunity comes judge civil service witnessed believed amount hate clouding mind hope find help soon people japan often prioritize cleanliness follow public etiquette maintain discipline public spaces people india lack hell thats one reasons dont even give citizenship countriescitizens need canada tbh uncivilised behaviour time high may offensive others dont know japanese people systematic wont even cross road unless red light even road empty noone around india behave someone watching difference culture either bad indians much systematic may look like much restricting japanese thing may look uncivilised slipper shot people vishwaguru nation dont climb post lol dont climb post lol idea says chinese tourists terrible ever heard cant add much respect opinion truly trust generalizing people country im saying etiquette problem solved acknowledge get better videsh jake kya ho jata hai logo ko sala yaha itna acha dikhate hai apne aapko par bahar jate hi gawarpana bahar aajata hai logo ka deport karo salo ko dont blame food blame fuckin hygiene dirty rotten scumbag ive saying ages indians need learn morals ethics humanity people tend forget since mostly see japanese culture lens popular media japan continues massively racist nice engrish defending peeing outdoors think bit karen move tell kids play communal space like bc fuck even playing great momentum know indians get bad rap sticking genuinely believe lot hate comes racism seen person group australian tourists super loud restaurant group indian people sitting next asked keep saying large majority indian expats perfect trust get lot flak shit whiter counterparts nipponese dont know english bother write english nipponese wod use google translator write indian languages besides english nenu canada vachi yrs aithundi nenu vachinappudu konni chinna pockets lo desi gallu undevallu mostly sikulollu vallalo chalavaraku nd gen nenu proper thellolla asians areas lo undevanni digina kpthalo edho kotha janma ethinattu anipinchedi telugu leka hindi vadu kanipiste annai ani jai chiranjeeva cinema laga emotional ga palakarinchukune vallam past years lo ikkada vipareethamga india nunchi janalu diguthunnaru okkosari nenu canada lo ne unnana anipistundi chillar chesi pardobbaru road meeda traffic sense ledu india style competition annitlo lines break chestaru manners public etiquette bochu kuda ledu eppudu phone pattukoni selfiela gola road pakkana chettu ni kuda vadalaru selfie kosam bus stops ninda desi students amazonlo uberlo taxi migilina delivery vallu motham manolle road meeda litter start aindi inka ememi chudalo indians get much hate idiots mukhyamga ee punjabi sale gallu aa lathkor music andariki vinipinchalane doola endo artham kadhu headphones pettukinna kavalani pakkodiki vinipinchela pettukuntaru public places lo inka car unte vallani evvaru aapaleru thats women cant pee standing maybe downvoted smell racism bit may indian responsible mentioned deeds poster casually throw dirt indians whole indians tell indians north eastern part india cook regional food respect indian culture went restaurant family hour ago people next us sitting cross legged chairs totally understand japan matured country population demographics lean towards older side means many children around make level raucous small children age many people develop dislike loud noise uncivil subjective behavior indians going country first time natural seem uncivilized many developed countries indians tend loud general cause grow noisy environments beeping car horns much noise general majority places outside sensitivity surrounding noise lack gets diminished natural happen evolving society go growing pains get already see transformations happening among diaspora visited countries lived sometime half billion people uplift going take time thing people stopped working hard thanks social media think everyone deserves easy money iphones audis gucci prada etc ruined peoples mind materialism another issue lies indians sex addicts perverts dont leave chance ask sex whether india canada research believe education prioritised lack proper education caused havoc today wonder people must living inside house inside clean outside dirty indian logic ones asking go home sit pee go home stand pee go home cant wait till go home yes importanttho discussion abt whether indian man civilized society like japan told india japan urinating outdoors crimeits people like india still acheived swatcch barathi also man tho calling fat completely wrong yeah common making onion masala fry base delicious indian cooking mom used make hotplate patio summer garage winter otherwise whole house clothes smell parents dont care us young people trying fit rest society gave huge damn agreed lets forget ugly american tourist spring break mexico like dantes inferno make excuses mostly come poor rural villages live abject poverty manners low list youre trying make enough money feed family western society far richer average mist lifes needs met person tries rise man become gentleman opinion sensible comment japs arent quite welcoming often resort closet racism towards foreigners even white people granted country rules reason country unable attract immigrants economy steep decline know could random south asian urinating public also children climbing poles rough housing natural could easily made generic statement engage behaviours instead pointing community parents teaching climb poles nothing wrong kids playing kids things exactly written indian children playing rough hosing isnt done jap kid immigrant friendly country would put generic message inform parents directly paint target backs indian kids reason nobody wants settle japan even young japanese bunch old prudes hanging onto outdated formalities feedback japan follows ive seen quite blatant statements like actually going comment old japanese guys ive seen peeing pretty blatantly sidestreets relatively common sure next time someone india would put post saying kids caste community jumping benches climbing walls unsettling entire nation filled elderly people xenophobic behaviour go nation would run youngsters pretty soon except said caste belongs land indians japan behave place go ok logic would ok south indians show kind racism towards north indians home state children playing lets call spade spade guy urinating moron building security putting racist messages clubbing childrens play issues indians wont pissed first place im saying understand japanese social behaviour different expecting adapt indian behaviour audacious hence reaction natural expecting adapt indian behaviour audacious expecting adapt mean way conflict resolution without sounding crass honest think japan needs immigrants real bad running working age population fast scary old people short term thinking thats driving people genuinely want settle country kind behaviour isnt directed indians even towards europeans americans like prohibiting entry restaurants public spaces foreigners try understanding doesnt make correct even pov japan rigid culture driven oldies thats incompatible st century sensibilities need adapt fast die arguing government people change want see seen yes india along great deal asian countries much uncivilised think biggest struggle must things like keeping sandals public driving dont know feel indian person urinated park person crime need stereotype whole damn country yes issue india making generalisations helps one need call indian indian person would say urinate public outcry completely justified honestly dont give damn foreigners indians think indians think important think follow rules appearances comes civil respecting local culture think okay indian children bit loud playful literally see nothing wrong children develop motor skills actionandconsequence learning dont like micromanaging children fact dont like japanese stand children running hallway bad know children little loud naughty dont see bad thing normal setting unless lives literally danger dont think wrong stop children well children yet think important teach children crossing line extra understand entrance playground agree climbing post could dangerous dont know feel tag think solution easy ask go playground yes agree dont like broad generalisations also dont like civilised sense coz word lot colonial baggage sense superiority absolutely despise mindset cultural difference indian cultural norms impact sorry thank reserved actually mean sorry thank bumping someone isnt big issue culturally speaking thats indians dont say sorry thank dont think saying sorry makes less civilised ive seen happen sometimes india abroad especially airports maybe population numbers queue american college day touching mostly happens temples thats due logistical nightmares people stopping see idolgod time ive seen people rush indian metros letting people ive seen american metro personally hate spitting public avoid unless absolutely necessary hate paan lot indians spit psychoactive addiction thats hard stop ive seen americans spit road ive seen many americans also put volume cars drive neighbourhood cultures uncivilised extent culture perfect japanese society lot flaws know high suicide rates loneliness epidemics dont think right denounce culture country something collective individual breaks role gross oh badwhen rome obey know totally respect rules culture live blend instead causing troubles others totally himachali extreme spice eater friends told deserves vice versa sab chalta hai attitude ruins others live thier community alienates nativee culture yeah agree age group matters moreover community live associate affects ability adapt sab chalta hai attitude wait whaaaaaa could lol still funny live canada always tell family friends represent india important mindful outside elevator driving mall workplace anywhere doesnt take much effort behave like part societies becomes habit basic idea aware actions respect people think perspective unfortunately indians lack awareness anything non indian would say address seen racism top jingoism among indians culture best love india indians ashamed coming country uncivilized indians unfair blame indians post extremely racists man definitely nit civilised nit indians whole japan uncivilized reference japans brutality chinese korean women world war ii called civilised societies wars forcing millions without toilets refugee camps man must taking piss second thing children playing serious maybe healthy animated kids like play even upset japanese sensibilities japan reputation really xenophobic society hallmark civilised society arent even talking pm stop inserting politics everywhere discussion something type people info rishi immigrant hes british citizen birth theres difference yes nd generation desi immigrant please keep politics aside see canada full illiterate sick minded people go simply showing fulfilling dreams sx foreigner get pr tell wrong canada doomed reread comment youd see specifically mentioned civilised sense developed nations didnt say universal civilised sense complain indians driving wrong side road say driving carefully everyone else tell indian smokers smoke public ignore men ignore maleprotagonists porn movies much deeply feeling sorry maybe seen parts developed nations didnt talk habits talked mass right havent seen parts developed nations know punks indians almost everyone soon enter lift society people looking phones loud music buses trains sometimes even aeroplanes first need shed cultural superiority better anyone else respect cultures even nyc let kids run rampant apartment building lobby youll get heat children dont get rampage everywhere time buddy looks like havent heard line catch young need teach young age start difficult child grows see things around pick happened kid would say kindergarten years spent teaching basic manners etiquettes civil behaviour people rude loud inconsiderate atleast found india soft spoken polite think dance head indians need taught things instead concerned abt useless things like history language etc another one see random signs like dont throw cigarette butts balcony things obvious posted lobby ur place always written four languages never calling single group thats pretty terrible building post arent upper class upper class middle people dress nice speak high level english attitude giving bhav middle class dont manners behave foreign country especially japan pro follower systematic discipline life individuals type people india behaving bad like want know bo mate cant teach self control toddler big parks toilets small ones dont best way avoid get toilet leaving kids kids accidents happen kid older bush wee parent two kids replying done point toddlers ones peeing road seen kids come house pee road simply taught western state india stating name fear offending people effort teach made seen men brag abt privilege man lived worked gulf made money back leading retired life india contrary many women find peeing town attitude lots acquaintances canada locals dont give much bhaav indian immigrants locals means european settlers centuries ago real natives totally sidelined proud fellow indians point time body odour ive seen americansboth northern southern europeans spit public clear throats thats problem nd one stupid japanese robots smh like inside someones property outside ones property ideally outside everyones property heart lack civic sense shared understood responsibility keeping ones surroundings clean benefits much benefits everyone things change funny thing tell ppl throw food wrappers car theyll say india thats things work yep point rationalize oh already dirty anyway food wrapperchips packetplastic bag isnt going damage grand scheme things unfortunate way ive gotten people stop shame picking trying reason gotten nowhere concept privacy giving space absent visited ind last year went watch movie one malls movie starts mom talking kids loudly shes living room ask stay quiet movie started reply dont understand kids certain resentment country go like bring hyper nationalism challenged japan go weekends see called civilised society drunk pissing street alleys passing vomit dont even start pervs subways india needs teach people civil sense nationalism still dont care happens ft home find jarring trash urination various things calmly accepted jethabhai pissing outdoors japan bro chill small instances types behaviors super rare indians abroad especially us live us indian people educated civilized good contributor society indians super low crime rates compared ethnicities know might weird indians abroad especially thailand indians wherever go largely peaceful follow rules stereotype indians foreigners largely driven social media biased media wrong portrayal indians popular media etc doesnt mean foreigner pissing openly parks bro took post rnewsentence two things wtf wrong english lmao second one brutal like cmon kids kids gon na feel guilt something control reading god knows kids make fun judge also people dont see problematic blatantly call someone race post public like problem could mailed personally talked personally post notices referring indian guy kinda seems sad maybe im wrong thats feel anyone whos victim hitandrun japan doesnt know culprit start posting japanese driver hit broke rules anyone finds japanese person please report lets see yellow monkeys react culture emulate ashamed indian god please next time give birth japan",
    "light_cleaned_title": "Do you think people leaving from India to overseas need to learn how to behave in civilized societies like the one in Japan?",
    "light_cleaned_selftext": "As said in the heading, wished our country men /women can be more civil and respect local culture. (Japan in this case) Respect is earned!!! You need to respect to earn respect.",
    "light_cleaned_comments": "Whip their ass already! Oh my god this is rough. Lived in ur for 5 years but never saw such notice targeting specific community. This is tip of the iceberg, just look for nichannel What is **Post?** in **\"**do not climb the post\" is it compound or some barrier between ground and plant soil. This is shit is so incredibly racist wtf This is what you get when you disrespect their county and culture How is this racist? They are calling out specifically who the perpetrator is with details of the unacceptable behavior. Without knowing the name, how else are they supposed to call out the perpetrators if not using the national identity? How is it, racist? When in Rome... Absolutely! These idiots give a bad name to all of us and create a stereotype (and continue to prove the stereotype) But not respecting a country's rules is okay? Imagine the outrage if a Japanese person walks into a temple with their shoes on? [I wrote this comment for which i was downvoted, ](https://www.reddit.com/k97q0dp?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2) but the posters here are correct. Indians are filthy by nature, they consider their house to be clean and disciplined no matter what but show true colours outside. Then show arrogancy, insecurity and cry racism which we about to see in the threads. They don't need to call out \"Indian\" specifically. That's just agenda-pushing. They can just say \"The man in a border pattern, backpack, please stop urinating\" or \"To dads and moms, this entrance is not a playground\". It can absolutely be a general warning. I agree many Indians go abroad and refuse to acclimatize to the environment there, but this shit is just plain racism. Lots of Indians who immigrate aren't interested at all in learning about local customs or changing their ways. Sad reality. I don't know why you are being downvoted. Why mention Indian man when they can just say the man who is breaking the rules. Again with the Indian parents, just write parents. Can't call these stereotypes, they are a reality. Majority of Indians aren't taught about hygiene since childhood. By looking at the first picture it seems they are describing jethalal from tmkoc Indians generally have poor behaviour and Indian kids are even worse because of laad pyar from grandparents in our society there are kids all day playing in the stairs of the building. [Something like this.](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTLyX3i3czGqsUorZGcrTbrxaVdaNh2jEPlvw&usqp=CAU) They go there and want to change people there like them, instead of changing. This is too much, they shouldn’t have mentioned “Indian”. I understand the point you are thinking that how will they address if they don’t specify but that doesn’t give anyone the right to generalize everyone What this does is create hatred for all other rule abiding Indian looking people from the locals. This is how attacks in the name of hate take shape. Good guys will always be punished with things like this Not racist, its the reality. I think its only the Indians in their community who behave like absolute shitholes. Now you can't just blame the entire community for how a certain people behaved. Not urinating here and there has nothing to do with local customs. It's phucking civic sense, the most basic of basic ones. Asses must be whipped for these types of ppl. These individuals are among the group of Indians who migrate primarily for financial reasons, they place everything else in the backseat and do not bother about it, just chalta hai attitude.. they unintentionally put india down every where they live I have seen some scums like this in my life That's definitely a stool for someone... Just Kidding, sad to see people not teaching manners, atleast from those educated and top society people. So they actually think notices can reform Indians' behaviour? 🤣 Yes, we do. I have seen enough to agree with this. Might be a smaller portion among us but nobody wants to take a chance after a bad experience. Many people behave weirdly when they move abroad. One of my friend (girl) who was studying in a US university decided to go to bar with her other Indian friend and US friends. An Indian fellow approached her for dance and she denied. Now he started verbally abusing her, her other Indian friend said you can complain to the bar owner but no one even understands what he is trying to say. They went to another place. Some Indians don’t even have manners and follow rules in their own country, then they go abroad and do the same. They need to learn to be civil in India as well in abroad. Don't disrespect their culture then. Goes for all nations. It should humiliate them enough to want to change. That’s the aim. Call me a hater (I wish I didn’t have to be) but it saddens me that people like these get to move abroad and pursue great opportunities. There are so many people that I see nowadays moving to HK, UK, Australia, etc. who are the most disgusting, ill-mannered people ever and it pains me that I’m still stuck here and they’re out there embarrassing the South East Asian diaspora and India 🥲 How they even get in and not get kicked out is beyond me While learning the norms of other countries is necessary, I think labelling communities like this is racist and dangerous. It generalises an entire community based on the actions of a few. Such notices should be taken down immediately But then, if I scold my kid won't that affect his self-confidence. Won't that lead to suppression of his feelings. Won't that make my kid a wimp. Our 1000 year old culture and civilization has become great by urinating here and there and showing our dominance and by jumping like monkeys. Don't these Japs know that, don't they? How dare they say such insulting things to us. We will boycott their movies and cripple their economy. They don't know, \"Mera baap kaun hai\". Don't expect civil etiquette from Indians when they were never taught these things from the very start. In this country there is this \"are sb chalta hai\" wala attitude and Indians carry this wherever they go. They refuse to learn local customs and blame others when they get uncomfortable. Where ever you go Indians will be Indians. Oh! this is an attack against our cultural heritage. What a man can do when his bladders are full? Let it burst. Those racist Japanese. They are stifling the freedom of our kids to play and make happy sounds. Such a cruelty. Nothing wrong with kids playing. Kids will do such things - Japan is notorious for having a culture of being too formal / obedient. There is a stereotype of \"salaryman\" there - people who work 16 hours a day, never say no to their boss and drop dead when they're 50. Yes urination in public place is not ok - especially in a country where public toilets are easily found. does south east asia mean only india or there are countries in it too. For that. They need to have shame. Just look around you man, do you think majority of the Indian uncles and aunties have shame? ✨embarrassing✨ exactly shit parent make shit adults. Did you forget a /s? From my personal experience, i believe that young adults(17-22yrs) who go abroad are very much easily adjusted to the environment and the cultural practices, but the people who go abroad after that age (mostly master students and working professionals) are stuck to the indian idea of things and do not care or choose to ignore cultural practices followed in the region. I am by no way saying that this is a general norm, there are exceptions everywhere. But these are the people whose incidents are highlighted by social media and a general bad name for indians is generated. PS: This refers only to Indians living abroad and not tourists. Sadly no. All they do is put the rest of us Indians to shame. right in puranas and veda people used to urinate on nearby plant so it can get nitrogen and grow, westerns dont know how advanced our thinking were /s Lmao fr People who usually who go abroad are from the affluent sections of society (read \"upper\" caste) who are entitled af. They bring their attitudes and cultures along with them when they move to other countries. That's why you still see casteism with immigrated Indians abroad. This is obviously to defame Indians. /s Oh God, disgusting & shameful! I hate the ones who urinate in India itself. Like can't you hold it in until you're home? Women have smaller bladder and we do it. What's the *ghamand* with these men?!! When I used to live in Bangalore , I used to walk in the nearby park Every evening after work for 1 hour. Lot of parents used to come with their kids. I have seen these parents making the kids urinate in the park . These were good educated folks , they looked very rich. I used to stay in HSR so it's a techy area. I used to wonder what these people are teaching their kids ? That it is okay to urinate in public? How is this correct. Parents are supposed to teach to respect the environment but here they are teaching them to urinate wherever they want even in a nice park. Such is the sad state of Indians. Call me whatever but Indians are the most uncivil and dirty people on the planet. Indians are Disgusting. The parents don't even teach manners in the USA, it's sad I will be so embarrassed l won't show up from the next day. Fucking shithole and shitty people. Our modern do you think Japan is!! Targetting people by the race who lives in the same building shows how racists they are. They could have just mention their name or appartment no. Or probably just talked to them directly. nichannel? That’s a postbox They might be referring to an actual post. Like a pillar The requests are valid but the form isn't. Reeks discrimination. stfu Jus FYI - south east Asia doesn't include India. India is a part of the South Asian region Yeah so weird to see people defend this, imagine if we were living elsewhere and faced racism due to flyers like this for what someone else did even though we have never behaved poorly! I'm sorry, but you seem to belong to the type being pointed out in the first poster. The fact that you have to be called out like this is HUGE. It's expected that when you come to a new place you learn their ways. Having to be told like this is shameful and disgusting! We have to teach the lesson this foreigners who visit in India. Get ready to fuck this foreigners These aren't highly complex complicated things, but basic things and manners. This is taught in schools iirc but people just don't follow. This has nothing to do with caste lol. Are you personally taking the guarantee that a person who's not from the \"upper\" caste as you term it would not show attitude whilst abroad? 2chan? How can I find translated posts? first one is fine. but the 2nd notice about children playing looks like a pretty common whatsapp notice of any gated society in India also.... English seekh le pehle foreigners ko fuck baad mein karliyo Go to foreign country. Mark territory. Assert dominance. This is a win. Page not found. I've never urinated outside or in any park, I swear. I'm laughing at their unrealistic expectation that Indians, who could neither reform themselves nor be reformed by their schools, teachers, parents, or society over 2 1/2 decades on average, will reform through passive notices. Those people are either rich or intelligent/skilled, even if they lack civic sense Japan is not as nice as it looks, they have cultural differences with everyone else but it is slightly better if you are a white guy. I am conflicted with this. I do completely agree that if you are moving overseas, you should learn about the culture and customs and adhere to them as much as possible. On the other hand, I mean it's kids. It's not always possible to control all their behaviours. Anyone who has kids will understand this. If they aren't telling their kids off at all, fair. But I have seen plenty of Japanese kids act a fool as well. There's no reason to call out the race of people in this scenario. I would rather have Indians living in India behaving in a civilized way. Feeling piraud Indian arm... India comes in south Asia, along with nepal, sri lanka, pakistan, bhutan, etc. SEA consist of thailand, vietnam, philippines, singapore, indonesia, etc. Not exactly. Most people are concerned with personal hygiene but... public hygiene, that's just a shitshow here. Littering is not even frowned upon by most. Please try to call out anyone you notice littering in public places, I have managed to change some people, mostly friends of mine, for the better in this regard. Japan is racist as shit towards any foreigners. This really shows their culture and manners. Instead of talking to the guy directly, they created these racist posters and stick them around. I agree with your sentiment. And yes I do call out people if I see them throwing thrash in public spaces. I recently started college and some people are absolutel a holes. And I make sure I call them out. I also managed to change my friends. Also, Happy cake day. India and Japan are on 2 different planets A guy who urinates in park deserve to be humiliate. Don't defend the criminals. lol I'm wondering how civilized a society is that can be so blatantly racist. That note is clearly racist and uncalled for. They could've called out the person without involving their nationality. If they can't identify the individual then how do they know they are Indian? If they can, then why not take it up with the offenders directly? What kind of 'civilized society' points a finger at a whole country of billions over an offence done by a couple of people? That's why I like Hawaii very much They take their lack of manners with them to these countries. Even if some of them do, it’s only in those countries for a short stint. Once they’re back in India, they’re back to behaving like they’ve got zero respect for any kind of rules. Who is teaching civilization to India, India is the only county which continued culture and it's civilization from thousands of years unlike Babylon or Westernization is not civilization, because we had a massive population, some people judge all indians by observing few reckless people.People has to realize, we have great civilization and we are not implementing by our laziness and busy life style. WTF is ‘the man who gained weight’ can’t stop laughing at what’s going through the mind of the person who created this notice ?? Just understand this when someone moves abroad they are not called by caste or by what name they call god. The person is Indian once he/she goes out of India. Casteism among Indians only exists in India not outside of India. Of course whichever country one goes to they should follow the how things work in that country I mean it's a local custom in India to urinate on the streets 😭 Japan me toh sudhar jao My observations of Indians behavior when traveling abroad : 1. Treating airplanes like a roadways bus. No one waiting for the airplane to be stationary in the parking bay and waiting for the seat belt sign to be off. Everyone stands up. Kids running havoc on aisles . In one case a kid threw warm shahi paneer like a cricket ball only to land on a foreign guy dressed in a business suit 2. Bargaining like hell in showrooms causing a lot of embarrassment. Not ready to pay the display price . 3. Exceptionally loud talking when the same message can be delivered while talking softly . Not being aware of the immediate social environment. 4. Absolute lack of personal hygiene and a general disregard for it. Not sanitizing gym equipments after each use , poor toilet manners, not cleaning up after themselves , not clearing used cutlery crockery at the cafes and leaving them on the table . 5. Some fellow men have a problem of consistent staring and ogling at white girls, no matter where. In public transport , on the street , on the beach . Location doesn’t matter. Expressions are worst if there is a group of men who are into this kind of voyeur/ perverted behavior . 6. Not willing to read and understand the local rules 7. Using phones while watching movies in theaters. Feel free to add to the list so we can all learn and reflect fr i crossed 2 people urinating on walls behind a dumpster while coming back from college This is only going to become more common. When you see videos of Indians doing shitty things in Brampton or Southall on Instagram, there are on an average 400 comments from India defending them. We are going to become more brazen with our disgusting attitude, and more and more of that 'model immigrant' reputation is going to crumble in the coming years. Last 2-3 months ago when I was in the UK, i went to a beach for a walk and there were signs of no swimming or going into the water. I saw an Indian family (i know from where they were based on their language and accent) going into the sea for a swim. They broke the rules and moreover there are unwritten rules like do not throw trash on the beach or in the sea. I saw them doing that as well. So when someone non Indian sees this, they think that all Indians are like that but in fact not every Indian is like that. OP, Could you explain why this is being shared in r/India, considering the minimal likelihood of its members either residing in Japan or desiring to relocate there? I'm sure all of us can feel bad and correct our course of action but I don't think it has any actionable component tied to it. what can be done about it? less than 0.01% people in this sub want to ever go to Japan and let their kids jump on the fucking post. If a survey results in over 100 affirmative responses, in jest, I might consider an outrageous act at Marine Drive with a live stream on Instagram. Just a light-hearted remark though. Same old approach - find issues with the complainant instead of addressing the issue at hand. The 2ch forum/textboard. It's an anonymous board with usually a lot of ultra conservative/xenophobic users, many of whom participate it various forms of \"activism\". I believe 4chan was inspired by 2ch. Pretty North Indian attitude which we see in south India as well Indians are stubborn. Adult-babies, if you will. Like islam You have not met Telugu people in US. Everything operates within caste among them This may not affect that shameless man, but it will affect Indians who have done nothing wrong. From their perspective, Notices like this spread on their SNS which in turn act as warnings to various communities/societies of the risks of allowing Indians to live amongst them. Basically giving Indians a bad name. Their culture is usually very non-confrontational, so they only do stuff this when they want to do as much damage as possible. and one more thing any parent would agree with that - kids running in park is not a sign of a civilised society and if it ever is then perhaps the very claim seems dubious to me one more thing, if you ever are interested in civilised societies please read more about how japanese soldiers treated Korean matured adult women called \"comfort woman\" make sure you let your wife or your sister see [this](https://youtube.com/shorts/K1U3CaM4db0?si=S0-4__sdteEeW_RF) and then let me know how civilised Japanese society is. That being said I have great respect for them.But sorry, the kids running with \"high momentum\" is an overkill. Last but not the least, let the kids run [man](https://youtu.be/TmhoSj3wkDM?si=qB1896hn4Xap7-UR). I have met some Tamils in France i do agree but the point being at least an Indian Tamil never discriminated with me for being from other parts of India like Bihar, UP, Assam, etc. I have no idea of people who migrated there more than 15-20 years ago. This is why I don't make any friends here in India, nor anywhere. It is better to live alone and process life in a calm manner, which majority of Indians don't do. They deserve this. Not all, but many individuals, similar to the OP, tend to \"conform\" rather than think independently. Instead of steering conversations rationally, they unfortunately often accept whatever they are told without critical analysis. #SlaveMentality So public urination is an Indian custom? 🤭 do you mean 4Chan? Yeah 4chan is the en counterpart of 2chan which is Japanese Okay, this is racist. They can make this announcements without mentioning race and it won't make a difference. YES! Never conform! Piss on the streets! Full Support! /s piss mat Kar bhai Lekin baccho ko.khelne de mene kab kaha piss in my post padhna seekh le lodhu So it's the bhartiya culture to urinate in public? 🤭💀 Had to scroll all the way down to find this post. It is true though. I'd wager you'd correct someone that it is Islamic rape gangs in UK and not Indian rape gangs. this feels very xenophobic to me why constantly refer to their nationality instead of their name or house number? you have access to security footage but don’t know their name? this is pretty ignorant. casteism is definitely a problem outside India. Notably in [Silicon Valley](https://www.wired.com/story/trapped-in-silicon-valleys-hidden-caste-system/), where most Indians are educated and earning well. It's common knowledge that Japanese are very racist towards Indians so it's kinda expected that this will be the language used there. However, there's no reason to excuse the misbehaviour. Both sides in this case need to get better. I'm from the Netherlands and live one street away from the local small Hindu temple. I have to say: Indian immigrants are nice. They tend to be very polite and hard working. I often see a bunch of men in their 20's and 30's playing cricket in the park, looks kinda wholesome. Once a year they hold a festival at the temple, with music and a food market. That's the time for me to get some Indian snacks. Don't be so strict on yourselves: you're good people. Japan is a deeply racist and xenophobic country. That being said, Indian really need to learn how to behave Basically Indians who migrate to first world countries with their third world culture. This won't change within a generation or two. Change has to start here at home. It's shameful knowing half of the people in the country behave like hooligans and teach their children the same thing. Be better people I have lived in Japan almost my adult life. I don’t think Japan is racist. I am sure it is less racist than India, I have lived in many Indian states, I face less racism in Japan compared to India Ok let me comment on each point fairly. 1. This is a fairly universal behaviour. Not including Shahi paneer cases lol but literally no nationality waits for the plane to park. Also, it's about proper instructions from the flight crew. I have been in many Indian flights and if instructed no one get the f up. 2. I have never seen this in Germany. Indians here are model citizens. Like we have the money to pay for anything. 3. This might be true for some Indians especially while on mobile phones on public transport. 4. This is just bonkers. Never seen anything like am Indian dude not disinfecting the equipment. Either everyone does it or no one does it. It depends on the gym's culture and areas of the gym. In my gym, only cardio area is disinfected. Never encountered anyone except teens who would leave their coffee cups on the table. 5. This again is universal 'man' behaviour. 6. Again universal tourist behaviour. 7. I don't watch that many movies at the cinema, but I didn't notice the race and the person doing it in the cinema. Inn logon ko onsite kaun bhej raha??? While Indians do have issues and we should introspect it. But try to substitute any other community with Indians, don't you feel there is racism in those posters, specially the second one. Those maybe Sri Lankan refugees too who moved to Netherlands in the 80 s and 90s and the kids may have been educated in Netherlands too. Netherlands has a good population of SL tamils... The Japanese should learn grammar first We don't know what dick they might have sucked to get there 😂 South Asians especially Indians, Bangladeshis and Pakis along with Chinese are notorious for bringing their practices from home countries abroad. South Asians are one of the worst offenders when it comes to petty offences like Jay walking, littering and flouting rules. But that doesn’t justify shit like that, you can’t imagine this in a western country. You can’t collectively name a nationality of 1.4B for acts of few uncivilised idiots. Japan and South Korea are known for their xenophobic racist attitudes, Japan loves to blame others collectively until it comes to apologising for WW2 crimes then you could see them being all individualistic and how they aren’t responsible, it was their ancestors. 😂 Feelingg paraud indiann.. Aussie here. But also lived and worked in many parts of India over two decades. Speaking from Sydney experience we have a huge Indian community, some centralised around a few great foodie suburbs, others spread out over established suburbs. I don't believe there has ever been any complaints of the type to which the OP has referred - resident or tourist. I think the \"problem\" is hugely overblown in certain other monocultural countries. And reflects a certain bias against foreigners, especially in some other Asian countries. South Asians are a very welcome addition to the mix in Australia, though I speak from mainly Sydney experience. Don't let these other isolated incidents take the headlines. Japan is racist, says the casteists. Target the person not his nationality, ethnicity and race. How’s this different from calling Osama a Muslim terrorist man. The last 4 letters of your username suit you perfectly. I wouldn’t hit Indians too hard.. Japanese are the most xenophobic and racist bunch of people I have known.. while they are outwardly polite they hate your guts if you are an outsider be it white or black or Indian Ah okay okay. I just generally see people using the term ‘SEA diaspora’ everywhere, so I used it here. Thanks for letting me know! If you're gonna live at Japan you gotta follow their rules. Same if someone comes to India. Japanese are real serious about their culture and all unlike Indians. Open air defecation is definitely an Indian custom Calling out a bunch of idiots by their Nationality isn’t Racism ? Immigrants from underdeveloped countries are less civil and it’s a known fact, you don’t see western countries calling out people like this. Imagine the backlash if they did this to black people in US. Get your head out of your Japanese master’s ass, ww2 is long gone man Jap lost it. Public urination is common in India because of a lack of public toilets and a lack of care for the environment. The first one can change depending where you go. The second one, if the person does not care, there is nothing to be done. Thanks, On another note the first 5 would never suit you 😎👍 lol, address the problem. :-) this is not racism. If it came to racism, it’s because of this act. Who in right senses publicly urinate and defecate. What do you mean we can't do how we please? That's how we've always been, we're Indians. /s This is blatant racism, especially the second notice. Shame on the Japanese Some aunties do, for sure Indian uncles however might be an entirely different species, maybe I'll know in a few years if I go bald, grow a belly, a shitty stache and make jingoistic comments to mask my insecurities I know, but I've talked to them: they're Indian and/or of Indian descent. >lack of care for the environment. Urine is biodegradable. What harm will it cause to the environment? No, if you understand Japanese society, you will understand what they said is not racism. It’s not India, you have to live within the rules, this is a rule based society. Even for kids there are rules. Getting kids to wee in parks is kind of acceptable outside India as well. Children don't have the self control. Of course it is the last option if there are no bathrooms nearby. Corpses are also biodegradable. What harm will they cause to the environment? What’s more, I bet ¥ 1 million that the sort of Indians who pull this kind of shit, will be the first one to take umbrage if a foreigner doesn’t follow some Indian custom, in India. Then it will be like “you’re in India, you must respect the local culture”. In short they’re nothing but Indian supremacists. Running wild is not acceptable in Japan, even for locals. Why do you think they called out Indians, because only Indian parents are letting that happen that building. I had to smile reading this. First of all, your post title implies that India is not a civilised society… I don’t think that’s true. Second, it’s extremely weird to single out one nationality for doing something wrong. That’s racist. I live in Germany and most Indians I meet here are quite nice. Germany has A LOT of rules for everything and everyone, and the peer pressure from society will make sure everyone subconsciously starts following these rules. Some of these rules are explicitly written somewhere, like “put your dog on leash”, or “no noise after 2200”, but the most important rules are actually implicit: let the elderly sit on the bus. don’t stand in the corridors of public transportation. don’t stand next to a free seat blocking it, use a “Warentrenner” in the supermarket to separate your groceries from the next person’s, don’t cut the queue, etc. Like, if I am about to throw trash on the street, I won’t do it because even if there’s no one on the street watching me, I have this sense of doom that some aunty will come and start screaming at me for it. It’s a sense of righteousness and climate awareness that has been instilled in me since childhood and I simply can’t. As a European, I also don’t throw stuff on the street in India, no matter how normalised it is. In my experience, Indian immigrants to Germany are amongst the most law-abiding people. They’re super scared of doing things the wrong way. Precisely because they seek acceptance from society and are scared of being judged / rejected. Ironically, peeing in public in Germany is something people do if it’s in nature and away from the crowd. It’s technically illegal but I’ve seen people pee in hardly secluded places after drinking. Since drinking is part of German culture, so is peeing. 😂 You are right. Corpses don't cause any harm to the environment. In fact they help the environment by providing nutrients to plants. Well, it takes one to know one (bigot) We pretty much excel in all forms of bigotry from petty material comparison to evils like caste/gender based violence. Doesn't mean that Japs aren't the most Xenobhobic lot in the whole world You can take an Indian out of India but... And now the parents and the pee guy will cry Raaaccciiiiisssmmmm saaaaar Media will do their usual song and dance. Japanese authority will be called and threaten to apologise. Jaishankar will issue his tight slap The same old thing It's about the conditioning that Indian parents are giving to kids that , public urination is fine .. btw I have seen adults do it as well . Post the rules and don't target a community. This is racism if they are targeting a community. Care for the environment? I think urinating in garden or tress actually help the environment 🤔 Also, Japan is a very discriminatory nation. This is not about India, these guys are drunk and don't have manners, happens all over the world You my friend has never been to Soho London on Saturday night. People do crazy shit in urban areas, urinating in public is definitely wrong but that doesn’t give anyone right to identity them with their race. How much do you hate yourself to defend some low life Japanese man who put that poster out there against your own identity? Defending racism against your race is the worst you can stoop down. Even culturally aware Japanese would agree using ‘Indian’ was unnecessary besides Japanese can’t really distinguish between Indians and other South Asian how do they know their ethnicity? You will never be Japanese mate you are always brown skinned man, get a life. Caring for your environment does not only mean \"take care of trees, plants and animals\" but it also has the more literal meaning of taking care of the area around you. Which means keeping it clean and beautiful. You are comparing to a party street with residential place, give me a break True, especially in Japan where there are toilets are regular intervals. Yeah, environment is the wrong word. Lack of care for cleanliness and hygiene is probably what they meant. My cats pee all over my house, so expand that to the outside world, humans peeing all over the place. Heck, there's a stretch of pavement nearby which everyone avoids walking on because it's covered in pee stains. It's the circle of life 🎶 Yeah, lots of arrogant people like my father, who get angry when they're told not to disturb others. bherund bejatti hai bhai, I agree hum log ko bahar hi nahi, apne desh mai bhi sudharne jaroorat hai. not supporting 'em but quite the opposite Yeah this seems to potray their prejudice. This is such a racist and insensitive way to call them out tho. This is how Indians behave in my country. I feel we have regressed socially by accepting third world scums. Main question: \"Is there a bathroom nearby?\" No? Then it's the fault of whoever built and maintains the place........ All animals including humans pee and defecate. If you want the human animals to only do that in toilets to be neat or whatever, then you've got to provide bathrooms st sufficient intervals. Same for dustbins. Yeah, poles and pillars are sometimes referred to as posts \"boycott their movies\" Indian anime fans be like: haha, no True Don't worry about being a model immigrant, the locals are crappy too How many clean toilets did the park have ? We Indians don't learn about local cultures within the country (when relocating to other states), learning a foreign culture is far fetched. You are living in your rich upper class shell. If you need to pee or shit, there is nothing wrong with it, it's absurd that is considered dirty. Which board No, it depends a lot. Certain people are arrogant and entitled. Heavy overlap with being conservative and crappy in other ways (sexism, homophobia, racism etc.) It's their country. I don't blame them for calling out Indians and making a strong statement. We have to agree with some of it. We have no sense of personal space We have no respect We have no manners We feel we don't have the need to respect or follow someone elses culture or way of living even though we migrated. We dont want to follow rules (traffic or non traffic) We dont even make a half Hearted attempt at learning the language or interacting with locals We only prefer to hang out with other indians We are racist We are sexist We are misogynistic We are homophobic We are openly jealous and gossip about everybodys life and their lifestyle. Add to this if u have some more 😂😂🤣 How do you know Indian and not any other south-Asian country? That second notice about children is creepy and menacing Japanese people would never behave in such a disgusting manner. This is typical Indian behaviour so of course they are going to refer to the dirty person by race. Lord ,another day another post on Indians outside india. Yawn. Bad apples everywhere. Accept and move on. Yeah, he was feeling insecure and needed to mark his territory..........just like my cats 😂 It's their country. Respect their rules and their culture or leave. Piss is not dirty technically, does not habour bacteria, mostly minerals and nitrates, pissing into soil helps the plants. Good to know you do not consider urine as dirty. I will make sure to help out your environment by urinating in your bedroom daily. Japan is pretty outspoken I've heard Southeast Asians taking the brunt of the racism mostly since they're more then Indians there. In that case they're raising awareness that maybe Indians should not be let inside their country. And, (I'm not Indian nor Japanese) how the fuck do they know that the phantom pisser is actually an Indian? Yes, they need to learn manners and leave the religion and caste shit in India. Pretty sure that's a poem. What's wrong with discrimination? It's their country they don't want dirty Indians in their country. In my experience Indians are mostly cowards. I once saw an Indian man littering in Australia and kicked him in the leg - I might have given him a large bruise. If more Indians did this to the uncivilised Indians then India would change and become a better country. You are welcome to use my garden!! There is difference between urinating in soil Vs other areas, here we are talking about garden which I believe have soil You sound like an uneducated idiot. Please never travel to Japan if you cannot respect their culture. Might get downvoted for this but I am gonna say it anyway. This summer my husband and I decided to book airbnb in one of the beautiful town in Italy. The host was so much sceptical to accept my booking because she had a very bad experience with one of the indians who left her house so dirty. I went to one the parks in london where there was a group of indians tourists casually throwing their snacks wrappers in the park. They think it is their own country where they can throw garbage anywhere.Most indians dont know about basic hygiene. They dont care about public property at all. I just wonder how these people must be living inside their own house. Ar ![gif](giphy|oudLetMk6WF3i) I get about the urinating part but the kids,whats the problem in them playing around,I don't get it am I missing something? Prime example: CANADA 🙂 Which is why we stood out. This attitude is going to be absolutely problematic for us in the future. People in India need to learn manners (most of it) even if they are in India .. The place it is posted is an apartment provided by Japanese government in a subsidized rates to all, mainly to elderly society. There are some rules about making noise and kids playing. There are designated place like parks and ground for kids to play and Japanese kids don’t play inside the apartment blocks or in the halls that too late night So when kids playing they make noises which basically a nuisance to others. The place it is posted is an apartment provided by Japanese government in a subsidized rates to all, mainly to elderly society. There are some rules about making noise and kids playing. There are designated place like parks and ground for kids to play and Japanese kids don’t play inside the apartment blocks or in the halls that too late night So when kids playing they make noises which basically a nuisance to others. Japanese are very racist people. I have heard that most of South East Asia is very racist and xenophobic. Maybe those Indians were asshole but that statement is also deragatory Thank you for the insight. Wait a minute, none of the commentators here have seen men in their 40s or 50s standing and pissing in public ? That too riding on their bike, stop along the road and piss on somebody's private property without a care in the world. If you're doing in your home without a worry for 20 or 30 years, how in the world will this dipshit attitude change if you move abroad ? Still wondering why foreigners complain about smelly India and smelly Indians ? And maybe the sub will explode, but really get a grip soaking your hair in mustard oil (atleast while you're in public places) It stinks from a mile and it has \"Indian\" plastered all over. It is racism. Whoever wrote the message felt the need to point out the ethnicity of the person urinating and the ethnicity of the children. These details don't really contribute to the probelm being addressed. Urine is Urine, Indian or Japanese. The person urinating obviously knows who he is. I'm assuming that the person writing the message is against all people urinating outside, not just Indians. Mentioning their nationality serves no purpose other that associating 'Indian' with 'Urinates outside'. Same shit is tolerated in India..lol. No civic sense in India. 1. Why are we ashamed of someone’s actions? One person doesn’t represent entire nation. There are good and bad people everywhere. So we should stop feeling embarrassed of someone else’s action. 2. Instead of discussing the post reeks of racism we are diving and blaming the so called Indian person, is wrong! Stand up for the community like black people do. Same message could be conveyed in a better fashion by choosing good words.. it shows how deep rooted systemic racism is in Japan. Assuming only our race is notorious of actions is false . I’ve seen many whites making their kids pee at park on trees or bushes.. Now people may argue Indians are racist - not all Indians are ! And nobody deserves to be treated in humiliating way these children could be from any nation theyre constantly adding the adjective indian like an insult almost True colours. What a horrible thing to say you are talking like you live in japan. Someone better inform the Japanese, urinating in public is a fundamental right in India. No it's not okay to train children to pee and shit in the open . That is why we need toilets , if there are no toilets , then Indians have to work on getting toilets built , Indian agencies build parks without toilets exactly because of this mindset that peeing and shitting in the park is absolutely okay . It is a societal issue and hence the authorities are least concerned also. It is gross and abused to shit and pee in a park.Abroad , if you have a dog , then you have to scrap up the excreta of the dog. That is a civilized society, not saying things like it's okay to shit in public. This is exactly what I am referring that Indians are uncivilized. Yeah the Indian people in the post are definitely in the wrong. I do know that such people exist but the posters themselves are racist. Just call out an individual for bad behaviour. Say \"this idiot lives here who does these bad things\". But they had to go out of their way and make it clear that it's an 'Indian'. I have plenty of Indian friends living in Japan who are living a great life and are loved by the locals and don't do anything problematic and put effort into learning the local norms. Yes , but why are parks in India designed without toilets ? Because of the Indian attitude -why need a toilet, people will pass urine along the wall of the park. It is the culture of anything can be done without consequence is what is being highlighted here. And why is that so ? Why parks are designed without toilets ? Because those who designed it did not see the need for it. Why ? Because we have the habit of peeing in open and toilet seems unnecessary. It is the culture that is being discussed here , that anything can be done , shitting , peeing without consequences. People lose their inhibitions when in another country. There's no one to correct them and not many ways for their friends or family to know about their misdeeds. Agree They have clearly seen this guy do it. That's why they are describing his physique and clothing as well. Aah, of course, there is a distinctive Indian clothing in Japan, and a distinctly Indian physique. WTF are you talking about? this is just racist. the need to mention specific community let alone the shaming It's Japan kawaii anime hentai uwu. They would never be racist! The hacker? I find it strange in this thread that there's more foreigners defending Indians than Indians defending their own. Wtf? Dude are you an idiot? Imagine that you live in an apartment. Now a few people from Germany come and occupy a 4-5 flats in your building. Since, it's a new developement there's excitement in the building that there are new people in the building from Germany (because word spreads that way). Now you saw one of them do this. How are you gonna describe them in the poster? One poor way is to write - To the german who urinates, has gotten fat recently, wears check shirt and backpack, stop pissing. That's what those guys did. Japanese are racist no doubt but Indians have a very bad attitude towards learning civic sense. absolutely arigato yamete kudasai yamero shiro oni ryuhei momotaro “The man who gained weight” ?! Now that’s just water boarding level shit! Indian meanwhile: I was watering and fertilizing your plants. These children could be Pakistani or Bengali or Sri Lankan. We as Indians will instead fight them saying that they should be more accepting or something 🙄 Thank you. You've proved a point, you've gone for the ad hominem argument. Last resort. Attack the person posting, don't address the argument. And WTF do fat Germans in lederhosen have to do with this discussion? Have rest, reflect on your silly post. Don't bother replying, I've blocked you. Majority of Indians don't have the civilised sense of developed nations. Examples: 1. Not saying sorry if they collide with you (while both are walking). 2. Standing so close to you in a queue that their bellies touch your body. I find it very irritating, but it's better than not queuing up at all. 3. Spitting in public, clearing throat in public. Yuck! 🤢🤢🤮🤮 4. Playing phones loudly in public. Again!! This is not a 'INDIAN' problem, its a human problem. Can you tell me from which country you belong? I am making a guess that you are from E Asia. Yeah bro, in India everyone makes sure that when they are urinating in public they do it in soil. Totally not on pavements and against the side of the road or anything. wow i said the same thing and got downvoted on a previous thread, lol , yea we seee the same in UK. A man spat inside the train just before leaving the train, We have bins inside train near the train door , it was just disgusting seeing all the red stain on the bins. like just go home or near a tree not inside a train. Could it be the effects of brain drain? I can imagine the people being rude and untidy in India are not your best and brightest. And the Indians in the Netherlands are, for a large part, highly educated people who were headhunted for specialized jobs. What if they dont know who they are and which room the live in how do they then describe them ? went to japan had the best time dint face any racisms , lived with friends in a village , met old japanese people who were very intrested in india and life in india, but i dont live there so couldnt say much. you just need to be a bit civil I know they’re doing it in good faith and I think it’s very kind of them to defend Indians but I think it’s because they don’t actively live in india and don’t see the shit show that we regularly see living in India. It's not exactly brain drain, it's more like an inverse of brain drain. The less educated yet rich (usually family wealth) are leaving the country more. They go to Australia, Canada, etc. where the barrier to entry is lower. You rarely see people from countries generally with low number of immigrants and stereotyped as racist acting racist to Indians online (ex. Russia, Czechia, Serbia, etc.). Let's all be racist to black people because African countries are bad to live in! I'm gonna say the n-word! Don't think the need to not build toilets has anything to do with peeing outside. The guys who plan and MPs who approve generally don't give a damn about the people There is nothing racist in pointing out facts. If a person of any race is filthy AF then they need to be called out. nahh UK is far worse Yes, call out the person not the race. Don't try justifying defecating publically, it's uncivilized behavior WTF, exporting #PeeGate to Japan! /s Some India students have been rationing the food distributed by the govt for the homeless there. Nothing is more shameful than that. >migrate primarily for financial reasons, Who doesn't? Exactly, the urge to mention the nationality of people whose behavior is offensive, is pretty typically racist behavior. Im pretty sure if it was a drunk Japanese person, no nationality would have been mentioned here. Here in Germany, I have often noticed that the nationality of the accused is rarely ever mentioned unless its necessary to be mentioned for context. Here the intention seems to be to add to the existing xenophobia and not actually solve the problem. That dude is revealing his fetish for the world to see xdddd What the fuck is going on here? There's a guy with piss fetish in above comments and then there's this one with corpse fetish. Next kya hoga? There are many Indians who have no sense of etiquettes. Many in my close circle often complain the way Indians behave abroad. I don’t understand how are you guys defending such racist shit. Where is the proof that the behaviour listed is actually from an Indian ? Are all brown people Indian ? I have been to America where I have been mistaken for a Mexican. If my kid is energised and is playing, he / she will play. Fucking big woop, deal with it. Stop being so inferior, always apologetic, always sorry. We apply for visas they accept and with that they accept what’s going to come with it. It’s not fucking North Korean. Japanese racist pigs getting all the support from “yes sir” “yes madam” “please take my soul and my ass if you will “ people. Rub it and get on with it. When majority people from a specific race are only known to cause nuisance and change the way other people live then it’s understandable that they will give fuck all about being “nice”. There is a limit to everything and in many cases stereotypes exist for a reason. Necrophilia Are you Japanese? \"Playing tag with tremendous momentum\" wtf are they trying to say here?? 😭 Okay, listen for me a moment. Even if this is done by an indian and it is absolutely not ok and this behaviour must be condemned. Isn’t posting this in this tone quite explicitly racist and xenophobic of Japan? Don't vilify something which are default bodily functions. Provide the options like clean free toilets before passing judgement Japan is an extremely racist country. They hate everyone other than themselves, especially Indians because of the whole tech spotlight shift thing. Be it cultural, economical or something very basic like repairs, the bias is very visible. They are good at being racist and acting like they are not. It is cultural. But oh no Japan did nothing wrong, the nanjing massacre, unit 731 and tons of other things are not real. Look into the anime waifu's eyes and forget it all lmaoo FYI,most African countries,except the ones that are in an active conflict,are better places to live than in India.Atleast they have unpolluted nature and a friendly culture. >When majority people from a specific race Lol did you even read my comment? If there are 40 Indian families and 3 Indian families are causing issues then is it right to be racist like that? Indians being a visible minority will have to face the \"association bias\". i.e. \"I saw this Indian guy do something bad so you're like him too.\" White people who cause issues in bars a lot don't deal with this. Japanese bars somtimes don't allow white people in. But they tell them only \"Foreigners not allowed\" not \"Americans not allowed\" or \"Indians not allowed\" or something. The same way they could have just said \"Foreign residents are causing problems\" instead of singling out Indians. It's for you to decide whether discrimination is wrong or not (obviously you won't care for my personal opinion that discrimination of any kind is wrong) Nobody wants dirty humans, anywhere (obviously you don't care for the kind of heinous crimes Japanese themselves do in their own country or for that matter any person of any origin anywhere) Bruh I have seen two moms giggling and talking with each other while their three vile children formed a noose two puppies' neck and hanged them on a pole in park. Hygiene is a baseline that they have ignored eons ago. For them Indian Bangladeshi Pakistani and srilankan all are Indians. This was on full display this past Diwali weekend. Saw dozens of families enjoying the public waterfront near my apartment, lighting fireworks, diyas, etc. Next day (as expected), trash all along the waterfront. Couldn’t take a step without stepping on used fireworks. Why move to a clean area if you’re going to trash it every chance you get? And not to mention teaching your kids the same shit. He is living there...in his mind...with his harem of waifus Indians are getting a lot of hate everywhere abroad and it is bound to happen. India has world’s youngest population which is eager to go abroad. Other countries have ageing population and they need immigrants. As Indians are going abroad in very large numbers, a percentage of them will not follow rules, offend people of other culture and so on. Canada has no countrywise cap, so any number of Indians can come in if they have enough points for PR. Apart from this you have student population who also come to try for PR eventually. No I'm Indian (Gujarati). waifus.... lol The vast vast majority of South Asian looking people in Japan are Indians. Usually in IT. Assuming they are Indians is probably 99% correct. If someone came to India and urinated in a temple on one of the idols do you honestly think most Indians wouldn't get violent? You might even do it. Here is a scenario: If you are not from the south, the people in my state tend to call your brainless vadaks and don't want them here. Obviosuly my state is better compared to other states in terms of education, hygiene and economy. So I should call you brainless right? as an american, i’m not trying to roast you Indians but holy shit, this behavior is the exact same in the US a lot of resentment you all get is because you clearly don’t give a shit about our culture or trying to assimilate, it’s rude as hell Sometimes im ashamed to be an Indian… I wouldn’t blame their entire ethnicity and put up posters saying “Look, a CHINESE man did this” (And stuff like that does happen, increasing hate against anyone of east Asian ethnicity in India) especially when racism against Indians is so high in many countries. Personal hygiene is limited to baths. Men especially . No grooming, terrible body odor, etc. my brother earns in 6 figures, but stinks like a pig and zero manscaping. But his attitude when I point this out is basically my Lyf my rulz. F**k, of all the countries to show your 3rd class behaviour! Moving to one of the cleanest and most disciplined countries in the world -- and then urinating outside! Do you honestly think all Indians are civilised? I never said we are all uncivilised. Sterotyping is normal. It is finding patterns in groups of people that are often rooted in reality. This very sub says things about my people (Gujarati) all the time - and you know what? A lot of those sterotypes about Gujaratis are true. Places like Japan and Korea have a reputation for being xenophobic. Stop taking offence for every little thing that is happening at any part of the world. I’m glad they’re being shamed, particularly the urinator, fcuk that guy, put up his photo on posters. Funny thing, there are tons of Japanese people who pee on streets. Sometimes property owners post their pictures in public to shame them. Yes. A bunch of H1B’s over here in the US who are now green card holders are insane. The most racist interactions I’ve ever had at work is from these Indians. They have their residency and now their true colors come out. In my community, my family is sort of alienated because we are not from the same part of India (not from the South). We’ve lived here for over 20 years yet we’re starred at like we’re aliens. In addition, they have terrible etiquette. Let their children run amok in the streets with cars pretending like it’s India. It’s getting bad because it’s giving us a bad name in general. Lol how can one find one's origin just by looking My Indonesian members of my group confused people from gulf countries and neighbouring India with Indians But anyway you can see how vaguely (in poor English)/informally their notice is written, it seems a rant/vent of any security manager Lol how can one find one's origin just by looking My Indonesian members of my group confused people from gulf countries and neighbouring India with Indians But anyway you can see how vaguely (in poor English)/informally their notice is written, it seems a rant/vent of any security manager The first one is understandable still the second one definitely is. Also it's japan these societies have a PhD in racism. I had an interaction with one and she kinda opened my eyes, it's society mirrors ours and most of Asia, where problems with colourism and racial homogeneity exist.Western people have struggled with racism and tried to address it head on..... Asian cultures have never even acknowledged it's existence in their societies. The second notice is a matter of cultural difference. Some norms in Japanese society are pedantic compared to a neutral baseline. #Before you have a big trouble ![gif](giphy|YoOM0hliors7cLsgmk|downsized) What jethalal doing in Japan? I would add people who wear extremely stinky socks, jackets and get on public transport. For people who sweat a lot, or for people who play sports, sweaty socks stink in a day. When a person's stuff (noise, smell, body part) enters the personal space of others, it's rude. Most Indians who travel to western countries don’t deserve the quality of life there. I have seen indians embarrassing themselves multiple times. Urinating in parks , making terrible loud noises for diwali , blaring loud punjabi music, i am not even sure how these entitled prics are even allowed to immigrate to a different country. Most Indian folks for the same reason never want to stay in Indians filled neighbourhood in western world. You go to a costco you see the line of Indian folks abusing the return policy and standing in lines to return back used items in bad condition saying they are damaged The worse of the pack is the folks in Thailand , oh my god the kind of haggling , cheap negotiation tactics and harassment these men do in Thailand is simply disgusting Terrible Canada I agree with you but I have to be fair here. Indians don't realise that they have BO. I have seen a lot of my friends who have BO and they don't anything about it. I don't consider it their fault as no one tells them about it. Our food plays a major role in that. Agree. I am not talking about BO. When we cook in apartments of cold countries with windows closed, our outer wear picks up a lot of smell. We don't wash socks every day. For sweaty people, it would stink very bad in a week. I know my colleagues who traveled with just 2 pairs of socks for a month long trip. I didn't know of this bad habit. Sounds stinky. Canada is filled up with illiterate brats who are almost good for nothing, who just went their to show off and nothing else. Ik i will be criticised for this statement, but telling this from first hand experience. As few friends from my own group are there. Who couldn’t achieve anything in India and cried always. There they are doing shitty jobs and are happy with that lol. Trust me, I am in the UK, and it’s 100x better than Canada. Is this some kind of kink? To shame yourself and put yourself down? That is the most racist shit I’ve seen in a while and we’re all just like “fair enough.” NO. Not fair enough. This is why people think they can walk all over us. It’s cause they know that we would rather send one of our own to the chopping block before ever thinking about uniting I have to disagree with the second image , there is nothing “uncivilized” with kids playing about. The urinator should be jailed for a day with a fine though NANI?? The amount on reckless Punjabis I've seen in Canada is outrageous tho >These individuals are among the group of Indians who migrate primarily for financial reasons Japan doesn't pay much for IT. What other reasons do people migrate for? Obviously japanophiles would be more observant of local norms. >they unintentionally put india down every where they live I have seen some scums like this in my life I think thats why the term \"Pajeets\" is used more often Before we start blaming ourselves, this notice smells racism behavior:Writing Indian. Blaming whole country instead of individual. Japan is comparatively not a diverse society. Any country with less diverse population will typically be unwelcoming to foreigners. Last but not least expat must understand that their behavior gives bad name to country hence respect and understand the foreign culture I think i understood the term Pajeets for this specific group. Kinda interesting Different Perceptions Different Realities \\~Daryl Davis How do we know the person being blamed is Indian. He could be from any neighbouring country or a PIO (East African/Fijian/West Indian). Pedofile in the UK cases :( i wish the 2011-2013 days return Well, I don't know about the most. I'd say that South Koreans and Mainland Chinese people are far more xenophobic. People in Japan have preconceived notions, but if you observe their customs and respect them, then they tend to be very accommodating. It's moreso that Japanese people have very strict standards in their own society, and when foreigners who aren't aware of that show up and mess up the status quo, they get annoyed, as they are very habitual people. They are quite xenophobic, yes, but it's hyperbolic to say they are the worst in the world. Israelis are also very xenophobic, and so are many Gulf Arabs. Once I saw \"Do NOT shower here\" in an indian restaurant restroom in NY. Don't know who it was intended for. But mostly indians frequent there. Would you guys be happy if you saw a sign outside that specifically called out Dalits for being unclean and disgusting? Is racism only cool when glorious nippon does it? That's nice to hear from a Dutch person. I love the Netherlands, but I have definitely seen a little bit of racism over there. My wife deals with it rather than me actually, as she has much more \"Desi\" features (I'm roughly 40% Scandinavian, and I am very tall, so I don't think Dutch people realize I am of Indian origin). Just small things, like people will talk to me nicely (sometimes even in Dutch, of which I know a little bit), but they tend to give her shorter, more abrupt answers to things, or when we're together, they will only make eye contact with me and will basically ignore her altogether. I don't think they necessarily do this purposefully, but it still happens nonetheless. Not to say that constitutes anything other than a minority of interactions. Overall, Dutch people are some of the most progressive, accommodating people in the world. Maybe it's directness that gets misconstrued as racism? It's not even about that. I think they genuinely can't take it when people flout the norms. It makes them deeply uncomfortable, because in Japan, that's just not done. It basically interrupts the peace and harmony of their community. They don't mind foreigners who are respectful, but unfortunately, many foreigners intentionally go to Japan to do messed up things or they don't bother to follow the cultural norms, so Japanese get jaded regarding foreigners pretty quickly. Whaaaaaaaaaaaaaattttttttt........... It's just about the way we are educated. We are not thought to be considerate to others. As my high school teacher used to say, we are literate but not educated. Sorry to hear your wife gets treated like that. It may very well be racism, there's plenty of that going on as well. It could be 'racism of low expectations', with people thinking it's going to be more of a hassle to bridge the cultural and language gap based on her looks. Or it could also be the regular old 'we don't like your kind here' type of racism. We're working on it! I totally agree Civics studies or teaching is non existent in schools. So naturally some Indians are less civic. There are people who are already well off in India and don’t need to leave for financial security but they do that for a variety of reasons. For example, I fell victim to the American dream when I was very young, and now I’m a permanent resident in the U.S. and on my way to that dream. Idk why this thread appeared in my reddit feed but here I am. Just to let you know that 'Japs' is a slur just like Nigger. I can see that you mean well but please call them Japanese. The way Indians spit like fing everywhere🤦‍♂️. Worst behaviour. Without teaching these basic public manners right from the kindergarten, we'll be like this forever. Our people lack civic sense and I have no idea why. I used to believe this is being educated vs not but that’s not the case. This Diwali there were cops called on people lighting fireworks at 2am in the night. How inconsiderate can you be? Sure it is Diwali, try to celebrate it before quite hours. If you cannot by any reason, you shouldn’t doing it at 2am either. I've heard that Japan is really racist. But spitting in public? Come on yaar... That’s meant for homeless people. I am not sure that's true. It was not NYC. It was near Niagara Falls. I didn't see any homeless people there. We don’t follow rules or good etiquettes here, how do you expect them to follow outside. The second 5 are never in my bank account or wallet 💀 Ah Japnese drink alcohol beyond capacity and puke sleep on tokyo roads at night is this also in their culture then I read this in a south park japanese accent lol I would have done the same. Nothing wrong. Act stupid, then face the heat. I’ve travel quite a lot and I can tell you it is sometimes very embarrassing to be identified as Indian. We are known for lack of mannerism, gawking at women like meat, talking loudly in restaurants, letting kids run around yelling, talking loudly on phones in cinema halls, poor hygiene, the list can go on. I have no idea why government is not putting enough emphasis on learning mannerism. In Japan this is taught in schools, heck they even clean their own classrooms as part of discipline. Interesting, reminds me of a video where a Japanese person refers to a problem with elderly or drunk middle-aged Japanese men who can be found (infrequently) urinating in public places - googled it and it was [this video by Mrs Eats](https://www.youtube.com/watch?v=b_aW4-2iihE). It seems the responses are similar, the sign is less confrontational compared to directly addressing the offender, and I can certainly understand wishing to prevent anyone from public urination. My own conclusion is that there are individuals in every part of the world who are deciding to pee in all the wrong places, a problem that all nations can recognise perhaps? Stfu with ur moral brigading. Just coz I'm Indian doesn't mean I am similar to or have anything to do with the billion random Indians. People do shit. They alone represent themselves. U don't need to take that burden. Or do u also represent all the Indian murderers, dacoits, rapists, etc Peeing outdoors in Japan is completely culturally acceptable. As long as the people doing it are Japanese It’s because most western and European countries have strict rules against discrimination, they put everyone in one basket and all you have to do is tick a checkbox to get in the country. Canada is prime example of a poor and failed immigration system. They are taking people in bulk and conduct no test to see if they are fit to mix with the society. Lol, these posters are as racist af. Why did they have to specifically mention indian children. Could they simply have not said the same thing without specifying the race. How did they even know the kids were indian? Could they not have been anywhere from the indian subcontinent? Weird shit Japan is incredibly racist and monocultural. Largely as a result of a policy of isolationism for centuries. They have very strict societal norms, and do not accept people acting outside of those norms. As most people are japanese, calling somebody by their race is often just a simple and easy way of identify who the person is. There will also be a lot of signs, on japanese, telling people off for bad behaviour, warning people not to do certain things, etc etc. Change can only happen if we accept there is a need for change. Most people in India are like you and refuse to accept that there is something wrong and hence we never change. You could atleast try and respect their ways. I hate to generalize, but Indians are not properly taught to lookout for others, let alone respect. In India, everyone behaves like it is a cutthroat world and many just don't bother to shake that off when they move abroad. I'm not saying that I don't understand our circumstances which made us to scramble for everything, but it doesn't have to stay that way. Indians are not taught that it is not okay to cut lines, take what you want and treat others however you like. I live in Canada where I see this first hand. In a country where people hold the door for you from a mile away, it is a bit sad to see Indians behave exactly how they used to back home where every other person is considered a threat to your very existence. Sadly, over time this changes the general perspective towards Indians. When you treat waiters like shit, when you dirty a hotel room or an Airbnb, when you urinate or spit in public and when you just 'mind your own business' , you are slowly chipping away at an entire culture. While it is probably true, that's a very bad way of generalizing a group. E.g - Japanese people are the most conservative, xenophobic and racist people in the world. They are outwardly polite but most stuck up and pretentious, given what they did in world war 2 but never apologized for it. Chinese hate them passionately for a reason. Then it’s meant for backpackers looking to visit Niagara Falls without hotel reservations. Isn't Japan extremely racist? Heard they were just scared of dark skinned people in general. The first guy is a Sanghi. 100% Before accusing me of anything, please Google \"bjp urinating\". No that was moot Ah a savvy investor. The joke here is calling a society like Japan civilized I don’t live in India and also don’t behave like bogan. We live in a free world and people make their choices, so really what can you do! Are you trying to school people by adopting social score like china has? You think it’s democracy ? Two wrongs cannot make a right.. some people behave the way they do! That doesn’t give Japanese right to have racist tone to their complaint. Why not also discuss racism and bias a brown person has to face because of such comments and treatment? Any persons action should not be representation of entire nation or race - its person issue! You are putting westerners to a very high pedestal by your change comment. You think their entire society is goody good? Also who determines what’s a good change and bad? I was simply pointing out the scientific inaccuracy of the statement that pee is bad for the environment. well then u haven’t looked at who is the PM then… he itself is the biggest dick around No one is asking to change our culture. In fact in most countries people admire our culture and want to learn more. I am purely talking about behavior in Public. As a recent example when I was in Switzerland there was this Indian lady who thought playing candy crush with loud mobile speaker in a public train is cool. I had to ask her to use headphone or shut it down as I can see people around were fuming and making remarks. She was clueless as to why I asked her to do that because if you ever travel in Indian trains this is perfectly normal. We are in billions so this ‘one person’ thing you mention when extrapolated accounts to thousands of people. Let’s accept it we don’t have public etiquettes and this is why we get such treatment. You claim that you are not like other Indians and therefore are embarrassed and feel the need for change. And there are many like you and there will be many like others. This is classic all Chinese tourists are terrible - are they? That’s pure wrong to judge all Chinese tourists based off their behavior. I am not disagreeing to general etiquette, but generalizing to whole country and not calling out racism is also incorrect.The post has very rude and racist tone, there are better ways to resolve the issue perhaps better etiquette on calling out too. Also feeling embarrassed of someone’s behaviour is plain stupid. A person owns their action- categorising people in buckets is creating bias which eventually leads to racism >When we cook in apartments of cold countries with windows closed, our outer wear picks up a lot of smell. I had this problem. Put the jackets in the closet and away from the kitchen. It's ok to realise and try to correct but most don't. This. I saw a recent Instagram video of a cars of senior advocates and judges of Delhi High court or maybe supreme court. Some Punjabi guy in the comments were saying he makes 7K$ per month delivering pizza and Uber which is better than the judges lifestyle in India. I'm in Canada, I'd give this up to be a judge I'm India. The political influence and immunity that comes with being a judge or any civil service has to be witnessed to be believed The amount of hate clouding your mind. Hope you find help soon. People in Japan often prioritize cleanliness, follow public etiquette, and maintain discipline in public spaces which most people in India lack. Hell, that's the one of the reasons they don't even give citizenship to other countries'citizens. We need these in Canada tbh. Uncivilised behaviour is at all time high. this may be offensive to others but for those who dont know japanese people are very systematic they wont even cross road unless its a red light even if the road is empty and noone is around. while in india you only behave when someone is watching. the difference in culture is there. either is not bad but for indians these much systematic may look like too much restricting while for a japanese this thing may look uncivilised. It is slipper shot to the people of Vishwaguru nation. Don't climb the post lol Don't climb the post lol I have no idea who says Chinese tourists are terrible or ever heard of it so can’t add much. I respect your opinion, truly do. But trust me it is not generalizing when 1000’s of people from the same country do it. All I’m saying is, we do have an etiquette problem and this can only be solved if we acknowledge it and get better. Videsh Jake kya ho jata hai in logo ko, sala yaha to itna acha dikhate hai apne aapko par bahar jate hi gawarpana bahar aajata hai in logo ka. Deport Karo salo ko. Don't blame the food.. Blame your fuckin hygiene you dirty rotten scumbag !! I've been saying this for ages. Indians need to learn about morals, ethics and humanity! People tend to forget this, since they mostly see Japanese culture through a lens of popular media. But Japan, has been, and continues to be, massively racist. Nice Engrish. Not defending the peeing outdoors but I think it's a bit of a Karen move to tell kids not to play in a communal space. Like bc what the fuck even is playing with great momentum. I know Indians get a bad rap for sticking out, but I genuinely believe that a lot of hate comes out of racism. Seen this in person, where a group of Australian tourists were being super loud in a restaurant I was at but a group of Indian people sitting next to them were asked to keep it down. Not saying that a large majority of Indian expats are perfect, but trust me, we get a lot more flak for shit than our whiter counterparts Nipponese don't know English. Why did they bother to write this in English. If I was a Nipponese I wod use Google translator write that out in all indian languages besides English. Nenu Canada vachi 20 yrs aithundi. Nenu vachinappudu konni chinna pockets lo desi gallu undevallu mostly Sikulollu. Vallalo chalavaraku 2nd gen. Nenu proper thellolla & asians areas lo undevanni. Digina kpthalo edho kotha janma ethinattu anipinchedi. Telugu leka Hindi vadu kanipiste annai ani jai chiranjeeva cinema laga emotional ga palakarinchukune vallam. Past 5 years lo ikkada vipareethamga India nunchi janalu diguthunnaru. Okkosari nenu canada lo ne unnana anipistundi. Chillar chesi pardobbaru. Road meeda traffic sense ledu, India style competition annitlo, lines break chestaru, manners public etiquette bochu kuda ledu, eppudu phone pattukoni selfiela gola road pakkana chettu ni kuda vadalaru selfie kosam, bus stops ninda desi students, amazonlo uberlo taxi migilina delivery vallu motham manolle. Road meeda litter start aindi inka ememi chudalo. This is why Indians get so much hate because of these idiots. Mukhyamga ee punjabi sale gallu aa lathkor music andariki vinipinchalane doola endo artham kadhu. Headphones pettukinna kavalani pakkodiki vinipinchela pettukuntaru public places lo. Inka car unte vallani evvaru aapaleru. That's only because women can't pee while standing. I maybe downvoted for this... but this does smell of racism, a bit. There may be an Indian out there who is responsible for the mentioned deeds but the Poster does casually throw dirt on Indians as a whole. These are the same Indians who tell Indians from north eastern part of India to not cook their regional food and respect Indian culture. I went to a restaurant with family about an hour ago and the people next to us were sitting cross legged on the chairs. Totally. You have to understand Japan is very matured country and their population demographics lean towards more older side. That means not many children around to make level of raucous that small children do. With age many people develop dislike for loud noise and uncivil (subjective) behavior. Indians going out of country first time are natural to seem uncivilized in many developed countries, Indians tend to be loud in general cause they grow up in noisy environments of beeping car horns and too much noise in general majority of places outside. Their sensitivity of surrounding noise or lack there of gets diminished and it’s natural to happen, It’s a evolving society will have to go through some growing pains but they will get there. I already see transformations happening among the diaspora who has visited other countries or lived in them for sometime. But when we have half a billion people to uplift it’s going to take time. Thing is. People have stopped working hard. Thanks to social media, they think everyone deserves easy money. iPhones, Audis, Gucci, Prada etc have ruined people’s mind with materialism. And another issue that lies with Indians is, they are sex addicts, or perverts and don’t leave a chance to ask for sex whether be in India or Canada. After some research I believe, Education has to be prioritised. Lack of PROPER education caused this havoc today. >I just wonder how these people must be living inside their own house. inside is clean. outside is dirty. - indian logic No one's asking you to go home and sit & pee. Go home and stand and pee only, but go home. Why can't you wait till you go home? yes, it is important...tho the discussion should not be abt whether its an indian man in civilized society like japan should be told off... India or japan him urinating outdoors is a crime...its because of people like him why india has still not acheived swatcch barath.....i am also against that man tho calling him fat was completely wrong Yeah this is common when making the onion masala fry which is the base of most delicious indian cooking. My mom used to make it on a hotplate on the patio in the summer and in the garage in the winter. Otherwise the whole house and all the clothes in it will smell. The parents dont care, but us young people trying to fit in with the rest of society gave a huge damn about it. Agreed let's not forget about the ugly American tourist. Spring break in Mexico is like Dantes Inferno. Not to make excuses for them, but they mostly come from poor rural villages and live in abject poverty. Manners are low on the list when you're trying to make enough money to feed your family. Western society is far richer on the average and mist of life's needs are met. Then a person tries to rise from being just a man to become a gentleman. Just my opinion. A very sensible comment Japs aren't quite welcoming, and often resort to closet racism towards foreigners, even the white people. Granted, it's their country, and their rules, but there is a reason why the country is unable to attract immigrants and their economy is in a steep decline. For all we know, it could have been a random south asian who was urinating in public. Also, children climbing up poles or rough housing is natural. They could have easily made a generic statement not to engage in these behaviours, instead of pointing out to the community, as if its the parents teaching them to climb poles. >Nothing wrong with kids playing. Kids will do such things - Exactly. And it's written as Indian children, as if playing and rough hosing isn't done by a Jap kid. In a more immigrant friendly country, they would put up a generic message or inform the parents directly. Not paint a target on the backs of Indian kids. There is a reason nobody wants to settle down in Japan, not even the young Japanese. Bunch of old prudes hanging onto outdated formalities. Feedback from Japan is as follows No I've not seen quite such blatant statements like this, and I was actually going to comment about old Japanese guys I've seen peeing pretty blatantly on side-streets being relatively common. Sure. Next time, someone in India would put up a post saying that kids from so and so caste/ community are jumping on benches or climbing up walls. If that is unsettling, then so is this The entire nation is filled up with elderly people. If this xenophobic behaviour is to go by, the nation would run out of youngsters pretty soon. Except that said caste belongs to this land not the Indians in japan. Behave in the place you go. Ok. By this logic , would you be ok if south Indians show this kind of racism towards North Indians in their home state? And that too over children playing? Let's call spade a spade. The guy urinating is a moron. So is the building security putting up racist messages and clubbing it with children's play issues. Indians won't be pissed about any of this in first place. I'm just saying I can understand those Japanese, their social behaviour is different, expecting them to adapt to Indian behaviour is audacious, hence this reaction was natural. >expecting them to adapt to Indian behaviour is audacious, I am not expecting them to adapt. I only mean that there is a way of conflict resolution without sounding crass. To be honest, I think Japan needs immigrants real bad. They are running out of working age population so fast that it's scary. It is just old people doing short term thinking that's driving out people who genuinely want to settle down in their country. This kind of behaviour isn't just directed to Indians , but even towards Europeans and Americans. Like them prohibiting entry to restaurants and public spaces for foreigners. You can try understanding them, but that doesn't make it correct even from their POV. Japan has a rigid culture driven by oldies that's incompatible with 21st century sensibilities. They need to adapt fast or die out. You should be arguing about this to the government and the people, not me I have been the change that I want to see, and I have not seen it Yes 100% India (along with a great deal of Asian countries) is very much uncivilised, I think the biggest struggle must be things like keeping sandals on in public and driving. I don't know how to feel about this. If an Indian person urinated in the park, then it's that PERSON who did that crime. So, no need to stereotype the whole damn country. Yes, there is an issue in India but making generalisations helps no one. So, there is no need to call out the \"INDIAN.\" To the Indian person, I would say to not urinate in public. The outcry is completely justified. I honestly don't give a damn about what foreigners or other Indians think about Indians. I think it's more important to think about WHY you should follow the rules more than appearances. When it comes to being civil and respecting local culture, I think it's okay to be yourself. So if Indian children are a bit loud or playful, then I literally see nothing wrong with that. Children develop motor skills and action-and-consequence learning. I don't like how they are micro-managing children. In fact, I don't like the Japanese stand on \"Children running in the hallway being bad.\" I know children can be a little loud and naughty, but I don't see that as a bad thing in a normal setting. Unless their lives are literally in danger, I don't think it's wrong to stop children from, well, being children. Yet, I think it's important to teach children about \"crossing the line\" and not being too extra. I understand that the entrance is not a playground. I agree with not climbing the post because that could be dangerous. But, I don't know how I feel about the tag. I think the solution is easy just ask them to go to the playground. Yes, I agree I don't like broad generalisations. I also don't like \"Civilised Sense\" coz that word has a lot of colonial baggage and sense of superiority. I absolutely despise this mindset. 1. This is just a cultural difference. Indian cultural norms have more impact for sorry and thank you, so they are reserved for when you actually mean sorry and thank you. So, bumping into someone isn't a big issue, culturally speaking, so that's why some Indians don't say sorry or thank you. I don't think not saying sorry makes you less \"civilised.\" 2. I've seen this happen sometimes in India and abroad, especially in airports. Maybe, this is because of population numbers. I was a queue at an American college the other day, and they were touching each other. This mostly happens in temples and that's due to logistical nightmares and people stopping to see the idol/god for more time. I've seen people rush out of Indian metros not letting people out, and I've seen the same in an American metro. 3. I personally hate spitting in public and will avoid it unless absolutely necessary. I hate paan a lot, which is why most Indians spit. It's a psycho-active addiction, so that's why it's hard to stop it. I've seen Americans spit on the road too. 4. I've seen so many Americans do this. They also put 100000% volume on their cars and drive down the neighbourhood. All cultures are \"uncivilised\" to some extent. No culture is perfect. Japanese society has a lot of flaws, you know with high suicide rates and loneliness epidemics. So, I don't think it's right to denounce a culture, country or something collective when an individual breaks a role or is being gross. Oh this is bad..when in Rome, obey you know 🤦🏻‍♀️ Totally, they should respect rules of the culture they live in and blend instead of causing troubles to others Totally. Being a himachali and extreme spice eater my friends have told me this 😂😂😂 This deserves 🍰 And vice versa No its more of Sab chalta hai attitude which ruins for others Its more of they live with thier own community which alienates from nativee of that culture 😂😂😂 Yeah agree. Age group matters here too. Moreover the community they live in and associate with affects their ability to adapt Again, sab chalta hai attitude Wait whaaaaaa 😂😂😂 Could be lol, still funny I live in Canada and I always tell my family and friends that we represent India and it's very important to be mindful of that when we are outside. In the elevator, when driving, in the mall, at the workplace or anywhere. It doesn't take too much effort to behave like a part of these societies. It becomes a habit after a while. The basic idea is to be aware of your actions and respect other people and think from their perspective. Unfortunately Indians lack this awareness and anything a non Indian would say to address this is seen as racism. On top of that there is this jingoism among Indians that they and their culture is the best and what not. I love India and most Indians but I am ashamed to be coming from the same country as these uncivilized \"Indians\". It is unfair to blame Indians for this. Both the post are extremely racists. That man definitely nit civilised but nit all of the Indians. And whole of Japan was uncivilized in reference to Japan's brutality against the Chinese and Korean women before world war II. So called all civilised societies are in wars forcing millions without toilets in refugee camps... That man must have been taking the piss, the second thing with children playing is not that serious. Maybe it's healthy to have animated kids that like to play, even if it upset Japanese sensibilities. Japan has the reputation of being a really Xenophobic society, that not the hallmark of a civilised society. We aren’t even talking about PM. Stop inserting POLITICS everywhere. The discussion is something about the type of people. And for your info, Rishi is not an immigrant, he’s a British Citizen by birth. There’s a difference. Yes he is 2nd generation desi. But not an immigrant. So, please keep politics aside and see. Canada is full of illiterate and sick minded people, who just go simply for showing off, fulfilling their dreams of having s*x with a foreigner, get PR. Tell me if I am wrong. Canada is doomed If you re-read my comment you'd see that I have specifically mentioned civilised sense of *developed nations*. I didn't say universal civilised sense 1. When I complain to Indians about driving on the wrong side of the road they say I should be driving carefully and everyone else is doing it. When I tell some of the Indian smokers to not smoke in public they ignore me as men ignore male-protagonists in porn movies. So much for deeply feeling sorry. 2. Maybe you have seen. I have not to parts of developed nations I have been to. 3.I didn't talk about your habits, I talked about the mass. Right? 4. Again, I haven't seen this in the parts of developed nations I have been to. I do know that there are punks who do it, but with Indians it's with almost everyone. As soon as I enter the lift of my society people are looking at their phones with loud music on, in buses, trains, and sometimes even in aeroplanes. First they need to shed this cultural superiority they have. We are not better than anyone else. Respect all cultures! Even in NYC is you let kids run rampant in an apartment building lobby you'll get heat for it. Children don't get to rampage everywhere all the time Buddy looks like you haven't heard the line \"catch them young.\" You need to teach them at young age to start with. Then too it's difficult as when the child grows up they see things around them and pick them up. Happened with my kid! I would say that the kindergarten years should be spent in teaching them basic manners, etiquettes and civil behaviour. People are rude, loud, and inconsiderate. Atleast I have found that all over India. And if you are soft spoken and polite they think they dance over your head. We Indians need to be taught these things but instead are concerned Abt useless things like history, language, ......etc Another one : I see random signs like \"don't throw cigarette butts from the balcony\" and other things which SHOULD be obvious posted up in the lobby of my UR place, but it's always written in four languages and never calling out a single group. That's pretty terrible of them in that building in that post... Aren't that upper class, upper class middle people who dress nice speak 🗣️ high level English and have attitude not giving bhav to other middle class? They don't have manners to behave in foreign country especially Japan who is pro follower of systematic discipline life? Which individuals type people from India behaving bad like this? Want to know BO? Mate, you can't teach self control to a toddler. Big parks have toilets, small ones don't. The best way to avoid is to get them to the toilet before leaving but kids are kids and accidents happen. My kid is older now and does not have a \"bush wee\" any more. As a parent to two kids I am replying it can be done at some point. Toddlers are not the only ones peeing on the road. I have seen kids come out of the house and pee on the road simply because they have been taught so! I was in Western state of India! Not stating the name in fear of offending people. The effort to teach itself is not made! I have seen men brag Abt this privilege. This man who lived and worked in gulf made money and is now back leading a retired life in India. On the contrary how many women do you find peeing all over the town! It's to do with the attitude. I have lots of acquaintances in Canada. The \"locals\" don't give much bhaav to Indian immigrants. (Locals means the European settlers from a few centuries ago, the real natives are totally sidelined) I am not proud of my fellow Indians at this point of time Body odour I’ve seen Americans(both northern and southern), Europeans spit in public and clear their throats. So that’s a you problem ! 2nd one is stupid. Japanese robots smh More like \"Inside is someone's property, outside is no one's property\". Ideally it should be \"outside is _everyone's_ property\" which is the heart of why there is a lack of civic sense. When there is a shared and understood responsibility that keeping one's surroundings clean benefits _them_ as much as it benefits everyone, things will change. funny thing is when i tell ppl to not throw food wrappers out of the car they''ll say \"this is india, thats how things work here\" . Yep, because at that point they rationalize it with \"Oh, it's already dirty anyway, so my food wrapper/chips packet/plastic bag isn't going to damage it in the grand scheme of things\". It's unfortunate, the only way I've gotten people to stop is to shame them into picking up after themselves, because trying to reason with them has gotten nowhere. Concept of privacy and giving space is absent there. Visited Ind last year, went to watch a movie in one of the malls, movie starts and this mom talking to her kids loudly as if she’s in her living room. I ask her to stay quiet as the movie has started, her reply “don’t you understand they are my kids” They have a certain resentment about the country they go to and like to bring their hyper nationalism when challenged. Been to Japan. Just go out on weekends and you will see so called “civilised society “ drunk pissing on street and alleys same. Passing out in their own vomit. And don’t even start on pervs on subways India needs to teach its people civil sense. For all this nationalism - you still don't care what happens 5 ft from your home. I find that jarring. Trash, urination and various other things are calmly accepted. Jethabhai is out pissing outdoors in Japan? Bro chill, There are small instances. These types of behaviors are super rare by Indians abroad especially the U.S. I live in the U.S and Indian people here are educated, civilized and a good contributor to the society. Indians here have super low crime rates compared to other ethnicities. I know there might be some weird Indians abroad especially in Thailand but, Indians wherever they go are largely peaceful and follow the rules. The stereotype against Indians by foreigners is largely driven by social media, biased media, wrong portrayal of Indians in popular media etc. That doesn't mean a foreigner should be pissing openly in the parks! bro took the post from r/newsentence two things:- 1) wtf is wrong with the english here lmao 2) second one is brutal, like c'mon those are kids. Those kids are gonna feel guilt for something they had no control over, after reading it, god knows if the other kids make fun of them or judge them. also people don't see but it's problematic to blatantly just call someone by their race and post it on public, like if they had a problem they could have mailed personally or talked personally but to post notices and referring to them as \"that indian guy\" kinda seems sad. Maybe i'm wrong but that's just how i feel. Anyone who's been a victim of a hit-and-run in Japan and doesn't know the culprit should start posting, 'The Japanese driver who hit me broke all the rules, and if anyone finds that japanese person, please report.' Let's see how these yellow monkeys react to that. What culture does not emulate this? I am ashamed of being indian. God please next time give birth to me in Japan!"
}