{
    "id": "188dryx",
    "title": "'Must work 3 shifts': Narayana Murthy's proposal for infra sector employees",
    "url": "https://www.indiatoday.in/business/story/infosys-co-founder-narayana-murthy-proposses-3-shifts-for-infrastructure-sector-employees-after-70-hour-workweek-suggestion-2469415-2023-11-30",
    "selftext": "Is this real life shitposting?",
    "flair": "Policy/Economy",
    "score": 324,
    "num_comments": 105,
    "created_utc": 1701442365.0,
    "convurl": "https://external-preview.redd.it/oZBicoGEjjh1lkjTFNku4uSIhEwog1gSR25OMhyTMtI.jpg?auto=webp&s=b43196e6d00e2aaec9dac18ffea1454d448c1adb",
    "comments": [
        "Here’s what Murthy said.\n\nRegarding infrastructure, he urged the government to expedite projects like the Bengaluru metro and emphasized the need for three-shift work in the sector.\n\n\"People in those infrastructure industries must work three shifts, they should not work just one shift...come at 11 am and then go at 5 pm. At least on the Electronic City road, that is what I see, I may be completely wrong,\" Murthy said.\n\n\"But in other nations that have high aspirations people work two shifts. I would return around midnight (when abroad), and I have seen people working as if they are going to disappear tomorrow morning. I cannot vouch for three shifts, but I can definitely vouch for two shifts,” he noted.\n\n\"We want to be better than all those countries. Why don't we say our people - work three shifts? Ask them what are their requirements to complete the stretch by their workers in three shifts - provide that. If we do that, I have no doubt that why India cannot grow faster than China,\" Murthy added.\n\nYeh desh ke buddhe sathiya gaye hai, is all I have to say.",
        "he is desperate to enter into biggboss house",
        "Both him nd his wife should stop giving  advices  .Nd his reasoning everytime  has been \" Make India a great country \" .Bc hume  Ghar chalana hein Desh khe liye ek Instagram  model chuna Huan hein",
        "Just jerk off onto the piles of money you've already earned and burn them Murthy ji, leave us peasants alone. We work to survive.",
        "Ye jab bhi muh kholta hai toh Hagg kyu deta hai",
        "Sathiya nahi gaya they are setting a new narrative as the service industry is moving to a small asian country. And infoys is loosing in this race",
        "Infosys refuses to pay night shift allowances to employees if the number of days worked off hours is less than the number defined by their policy. \n\nBefore giving any dumbass suggestions, he should fix all the crap that is happening in the company that he built from scratch.",
        "I have lived in us for over a decade and also worked at wipro after i graduated(similar toxic culture to infosys)…most people in us don’t work two FULL time shifts…they are two separate part time jobs amouting to 40 hours per week…companies here also pay overtime… the mcdonalds workers here receive better benefits than software engineers at infosys..if you want people to work more hours, better learn to pay overtime..slimy old fart.",
        "hahahahahahha",
        "3*6 hours shifts = 18 hours \n\n+6 hours of sleep  \n\n= 24 hours \n\nForget workers being humans with family and kids or time for relaxation. They won’t even have time to shit peacefully, is life worth it if you can’t even take a dump peacefully without hurry of work ? \n\nIf NM Is referring to 3 shifts with different workers question is who is willing to pay that much ? Be a role model and hire 3x manpower to the work that’s being fed to 1 person in Infosys.",
        "Either you didn’t you understand what he said or you are an x infosys",
        "Don't see anything wrong with what he says. The only aspect preventing three shifts are labor laws .",
        "I know he is idiot but may be he meant that we should have 3 shifts. 3 people -3 shifts",
        "Reddit pe kya kar raha hai ja kaam pe lag 3rd shift shuru hui",
        "Because I am in first shift :-)",
        "Someone shut him up please",
        "Log off and get back to work, peasant.",
        "Trying to have peaceful weekend. This senile needs to shut the fuck up. Really. Ffs.",
        "But why are in reddit during your 3rd shift, peasant. India is not developed because of people like u",
        "He's looking for slaves not employees.",
        "Budhdha sathiya gaya hai.",
        "Extra pay milega kya? So many will be willing to work if they pay extra money for extra work hours.",
        "Iska mu todo pls",
        "If it is 3 different people working in 3 different shifts then ok. If single person then this person has really lost his marbles.",
        "Why can't more people work less hours. If others are not capable just train them. We have many unemployed people in all the sectors.",
        "Suck mah dick",
        "I read through it and this is what he mean. First paragraph mentions NM wants government to speed up the infra with 3 shifts and next he mentions how he saw people abroad working 2 shifts and Indians should work 3.\n\nIt’s either 1 person working 3 shifts or multiple individuals working 3 shifts. \n\nBoth doesn’t make sense with time, labour welfare and cost constraints. \n\nNM is not speaking rocket science and I have no affiliation with Infosys. Im sorry that you are dense.",
        "What's wrong with this chacha",
        "I think he means there should be 3shits running. Not individuals working 3 shifts each. Poor wording from him",
        "He is not saying for each worker to work 3 shifts. Rather that infrastructure work should continue for the whole day with 3 shifts of workers. That makes perfect sense actually and in fact I am surprised that is not the case already.\n\nI know people are pissed off with him about the 70hr comment but at least try to understand what he is saying.",
        "Pay for three shifts then, _bitch_",
        "Fuck this guy. He’s outdated.",
        "Why cant he just drop dead and stop wasting oxygen",
        "TF is wrong with him?",
        "Narayan murthy is our apna sasta sathyagaya hua Jeff bezos",
        "He probably didn't mean same person to do three shifts and just meant the work should continue even at night.",
        "lol😂😂",
        "Why is he still talking.",
        "I mean his logic has merit, higher productivity at lower prices is India's only competitive edge.\n\nNo one has to follow his logic but that is another matter. The problem with billionaires is they are always willing to sacrifice others in the crusade of achieving so called 'greatness'. \n\nIn other words, a lot of people will die, but its a sacrifice he is willing to make.",
        "Among all the other nonsense he says (70 hours work week), this actually is not too bad or wrong. He is not saying same worker person to work in three shifts, but different workers. Infra projects need velocity to finish and not them lag forever as those projects create massive traffic jams, dusty disruptions - so sooner they can be finished better, even if it means working in multiple shifts and keep work going 24/7",
        "tbf, i have thought this too. A lot of factories and stuff should have atleast two shifts. There are plenty of people to employ so wages for another shift would be the same price but you could be a lot more productive. \n\nThe thing is these employers don't need three shifts. 3 shifts make sense when you have employees working 8 hour days. But so many people here are working 12 hrs or more",
        "Right, yeah 👍🏽  It is a tiny bit confusing though 🤦🏾‍♂️😆",
        "This guy is 77 years old, at that age brain stops working properly. He should stop speaking and we should stop taking him seriously.",
        "Stop posting about this asshole.",
        "Bhaiya patriotism ka extra display nahi karega to iski sachayi saamne aa jayegi. \n\nFrom we must work more to make India a great country it will become \"I want people to be paid less for more work so I get more profits\"",
        "He should donate all the money to the country, considering how much he gives patriotic gyaan.",
        "Well the underlying assumption is that the manpower cannot produce anything valuable. \n\nMost of Indias technology sector does outsourcing work for other countries. The net effect is that we don’t really build anything of value for ourselves. We don’t value labor, not spend money skill and quality of service. It’s always a race to the cheapest bottom that makes most businesses unsustainable or drain the lives out of their employees. \n\nTo be honest, it’s only when real innovation and advancement comes through that we see pockets of our economy changing. Things that come to mind:\n\n1. E-bikes\n\n2. Fintech stack\n\nBut this shouldn’t be where it ends, we need to push everything from fundamental sciences to advanced engineering to novel economic models to really do better. Don’t let capitalism alone define how we need to survive.",
        "Why are you even amplifying this? Buddha sathiya gaya hai.",
        "But in other nations that have high aspirations people work two shifts. I would return around midnight (when abroad), and I have seen people working as if they are going to disappear tomorrow morning. I cannot vouch for three shifts, but I can definitely vouch for two shifts,” he noted.\n\nFor people who say he is talking about 3 people 3 shifts",
        "Senile old fool",
        "He can go fuck himself, or outsource it to someone to do that all three shifts",
        "He obviously means there should be 3 shifts of workers so that infra work goes on 24 hrs- Assuming that the same people will work 24 hrs is just stupid.",
        "I’m pretty sure he means put 3 sets of people in 3 shifts to finish work faster. \n\nNo one should work for 18 hours a day, that’s too much to ask.",
        "Mairan.",
        "I'm curious, what country is this?",
        "He has a dildo up his ass so he's rolling his eyes 24/7",
        "I think WFH would solve a bunch of the Infra Problems on its own. Although that would hurt the support staff’s employment employed at office campuses.",
        "So they wanna turn this country into S.korea or Japan with depressed suicidal people.",
        "Basically...buddha satiya gaya hai",
        "If it’s 3 people, why do they need to work in three different shifts? Three is also quite an odd number. Dual income makes sense.",
        "Can I work 5 shifts?",
        "A retired tech-billionaire sneezes and the media catches a cold!",
        "why does his face look like he is constipated for ages and trying to get shit out? oh well he is full of shit, so when he talks...",
        "\\*losing",
        "Sir u can work ur 3 shifts in ur coffin.",
        "for eternity.",
        "What's wrong with his eyes 🤔",
        "Already working 3 shifts... But are they willing to give allowance?",
        "Let me translate: You peasants must slave away your lives so that us billionaires and our kids could live more comfortably and suck every ounce of your souls.",
        "Not like that. Say they have 3 shifts and max people that can work in an area is say 100. So 3 shifts means total 300 people working and 100 at a time.",
        "Clearly you have switched off your brain",
        "3 shifts workday means 8hr per worker per day * 3 workers. Making the work i.e construction on 24 hrs..\nIt's not very hard to understand that. Idk how you came to this weird 3*6 hrs shit.",
        "I know it's fashionable to shit on Murthy lately and for good reason. In this case, though, he's referring to 3 shifts with different people in infra projects. That's implied. It is how it works in heavy industries. Nothing controversial here.",
        "STFU!",
        "Phillipines, if I am not wrong.",
        "All he wants to see is productivity so 3 shifts by different people would oppose his views.",
        "Wisdom doesn’t always come with Age.",
        "We should Thanos him and people who agree with him",
        "Narayan Saar clearly has dementia at this point. And who the F is this jobless to keep interviewing him?",
        "“I may be completely wrong”.\n\nNo, you ARE wrong and don’t understand the fundamental reasons why infrastructure projects are never completed on time.",
        "Why does this guy who is a billionaire need to say downright insane shit for publicity what does he even get from this.",
        "Eyes are too humble to be straight 🤷",
        "Nah murthy is desi Elon Musk .",
        "I regularly travel on ORR past 10pm and still see metro work going on. What 5 pm is this guy talking about?"
    ],
    "cleaned_text": "must work shifts narayana murthys proposal infra sector employees real life shitposting ",
    "cleaned_title": "must work shifts narayana murthys proposal infra sector employees",
    "cleaned_selftext": "real life shitposting",
    "cleaned_comments": "heres murthy said regarding infrastructure urged government expedite projects like bengaluru metro emphasized need threeshift work sector people infrastructure industries must work three shifts work one shiftcome go pm least electronic city road see may completely wrong murthy said nations high aspirations people work two shifts would return around midnight abroad seen people working going disappear tomorrow morning vouch three shifts definitely vouch two shifts noted want better countries dont say people work three shifts ask requirements complete stretch workers three shifts provide doubt india grow faster china murthy added yeh desh ke buddhe sathiya gaye hai say desperate enter biggboss house nd wife stop giving advices nd reasoning everytime make india great country bc hume ghar chalana hein desh khe liye ek instagram model chuna huan hein jerk onto piles money youve already earned burn murthy ji leave us peasants alone work survive ye jab bhi muh kholta hai toh hagg kyu deta hai sathiya nahi gaya setting new narrative service industry moving small asian country infoys loosing race infosys refuses pay night shift allowances employees number days worked hours less number defined policy giving dumbass suggestions fix crap happening company built scratch lived us decade also worked wipro graduatedsimilar toxic culture infosysmost people us dont work two full time shiftsthey two separate part time jobs amouting hours per weekcompanies also pay overtime mcdonalds workers receive better benefits software engineers infosysif want people work hours better learn pay overtimeslimy old fart hahahahahahha hours shifts hours hours sleep hours forget workers humans family kids time relaxation wont even time shit peacefully life worth cant even take dump peacefully without hurry work nm referring shifts different workers question willing pay much role model hire x manpower work thats fed person infosys either didnt understand said x infosys dont see anything wrong says aspect preventing three shifts labor laws know idiot may meant shifts people shifts reddit pe kya kar raha hai ja kaam pe lag rd shift shuru hui first shift someone shut please log get back work peasant trying peaceful weekend senile needs shut fuck really ffs reddit rd shift peasant india developed people like u hes looking slaves employees budhdha sathiya gaya hai extra pay milega kya many willing work pay extra money extra work hours iska mu todo pls different people working different shifts ok single person person really lost marbles cant people work less hours others capable train many unemployed people sectors suck mah dick read mean first paragraph mentions nm wants government speed infra shifts next mentions saw people abroad working shifts indians work either person working shifts multiple individuals working shifts doesnt make sense time labour welfare cost constraints nm speaking rocket science affiliation infosys im sorry dense whats wrong chacha think means shits running individuals working shifts poor wording saying worker work shifts rather infrastructure work continue whole day shifts workers makes perfect sense actually fact surprised case already know people pissed hr comment least try understand saying pay three shifts bitch fuck guy hes outdated cant drop dead stop wasting oxygen tf wrong narayan murthy apna sasta sathyagaya hua jeff bezos probably didnt mean person three shifts meant work continue even night lol still talking mean logic merit higher productivity lower prices indias competitive edge one follow logic another matter problem billionaires always willing sacrifice others crusade achieving called greatness words lot people die sacrifice willing make among nonsense says hours work week actually bad wrong saying worker person work three shifts different workers infra projects need velocity finish lag forever projects create massive traffic jams dusty disruptions sooner finished better even means working multiple shifts keep work going tbf thought lot factories stuff atleast two shifts plenty people employ wages another shift would price could lot productive thing employers dont need three shifts shifts make sense employees working hour days many people working hrs right yeah tiny bit confusing though guy years old age brain stops working properly stop speaking stop taking seriously stop posting asshole bhaiya patriotism ka extra display nahi karega iski sachayi saamne aa jayegi must work make india great country become want people paid less work get profits donate money country considering much gives patriotic gyaan well underlying assumption manpower produce anything valuable indias technology sector outsourcing work countries net effect dont really build anything value dont value labor spend money skill quality service always race cheapest bottom makes businesses unsustainable drain lives employees honest real innovation advancement comes see pockets economy changing things come mind ebikes fintech stack shouldnt ends need push everything fundamental sciences advanced engineering novel economic models really better dont let capitalism alone define need survive even amplifying buddha sathiya gaya hai nations high aspirations people work two shifts would return around midnight abroad seen people working going disappear tomorrow morning vouch three shifts definitely vouch two shifts noted people say talking people shifts senile old fool go fuck outsource someone three shifts obviously means shifts workers infra work goes hrs assuming people work hrs stupid im pretty sure means put sets people shifts finish work faster one work hours day thats much ask mairan im curious country dildo ass hes rolling eyes think wfh would solve bunch infra problems although would hurt support staffs employment employed office campuses wan na turn country skorea japan depressed suicidal people basicallybuddha satiya gaya hai people need work three different shifts three also quite odd number dual income makes sense work shifts retired techbillionaire sneezes media catches cold face look like constipated ages trying get shit oh well full shit talks losing sir u work ur shifts ur coffin eternity whats wrong eyes already working shifts willing give allowance let translate peasants must slave away lives us billionaires kids could live comfortably suck every ounce souls like say shifts max people work area say shifts means total people working time clearly switched brain shifts workday means hr per worker per day workers making work ie construction hrs hard understand idk came weird hrs shit know fashionable shit murthy lately good reason case though hes referring shifts different people infra projects thats implied works heavy industries nothing controversial stfu phillipines wrong wants see productivity shifts different people would oppose views wisdom doesnt always come age thanos people agree narayan saar clearly dementia point f jobless keep interviewing may completely wrong wrong dont understand fundamental reasons infrastructure projects never completed time guy billionaire need say downright insane shit publicity even get eyes humble straight nah murthy desi elon musk regularly travel orr past pm still see metro work going pm guy talking",
    "light_cleaned_title": "'Must work 3 shifts': Narayana Murthy's proposal for infra sector employees",
    "light_cleaned_selftext": "Is this real life shitposting?",
    "light_cleaned_comments": "Here’s what Murthy said. Regarding infrastructure, he urged the government to expedite projects like the Bengaluru metro and emphasized the need for three-shift work in the sector. \"People in those infrastructure industries must work three shifts, they should not work just one shift...come at 11 am and then go at 5 pm. At least on the Electronic City road, that is what I see, I may be completely wrong,\" Murthy said. \"But in other nations that have high aspirations people work two shifts. I would return around midnight (when abroad), and I have seen people working as if they are going to disappear tomorrow morning. I cannot vouch for three shifts, but I can definitely vouch for two shifts,” he noted. \"We want to be better than all those countries. Why don't we say our people - work three shifts? Ask them what are their requirements to complete the stretch by their workers in three shifts - provide that. If we do that, I have no doubt that why India cannot grow faster than China,\" Murthy added. Yeh desh ke buddhe sathiya gaye hai, is all I have to say. he is desperate to enter into biggboss house Both him nd his wife should stop giving advices .Nd his reasoning everytime has been \" Make India a great country \" .Bc hume Ghar chalana hein Desh khe liye ek Instagram model chuna Huan hein Just jerk off onto the piles of money you've already earned and burn them Murthy ji, leave us peasants alone. We work to survive. Ye jab bhi muh kholta hai toh Hagg kyu deta hai Sathiya nahi gaya they are setting a new narrative as the service industry is moving to a small asian country. And infoys is loosing in this race Infosys refuses to pay night shift allowances to employees if the number of days worked off hours is less than the number defined by their policy. Before giving any dumbass suggestions, he should fix all the crap that is happening in the company that he built from scratch. I have lived in us for over a decade and also worked at wipro after i graduated(similar toxic culture to infosys)…most people in us don’t work two FULL time shifts…they are two separate part time jobs amouting to 40 hours per week…companies here also pay overtime… the mcdonalds workers here receive better benefits than software engineers at infosys..if you want people to work more hours, better learn to pay overtime..slimy old fart. hahahahahahha 3*6 hours shifts = 18 hours +6 hours of sleep = 24 hours Forget workers being humans with family and kids or time for relaxation. They won’t even have time to shit peacefully, is life worth it if you can’t even take a dump peacefully without hurry of work ? If NM Is referring to 3 shifts with different workers question is who is willing to pay that much ? Be a role model and hire 3x manpower to the work that’s being fed to 1 person in Infosys. Either you didn’t you understand what he said or you are an x infosys Don't see anything wrong with what he says. The only aspect preventing three shifts are labor laws . I know he is idiot but may be he meant that we should have 3 shifts. 3 people -3 shifts Reddit pe kya kar raha hai ja kaam pe lag 3rd shift shuru hui Because I am in first shift :-) Someone shut him up please Log off and get back to work, peasant. Trying to have peaceful weekend. This senile needs to shut the fuck up. Really. Ffs. But why are in reddit during your 3rd shift, peasant. India is not developed because of people like u He's looking for slaves not employees. Budhdha sathiya gaya hai. Extra pay milega kya? So many will be willing to work if they pay extra money for extra work hours. Iska mu todo pls If it is 3 different people working in 3 different shifts then ok. If single person then this person has really lost his marbles. Why can't more people work less hours. If others are not capable just train them. We have many unemployed people in all the sectors. Suck mah dick I read through it and this is what he mean. First paragraph mentions NM wants government to speed up the infra with 3 shifts and next he mentions how he saw people abroad working 2 shifts and Indians should work 3. It’s either 1 person working 3 shifts or multiple individuals working 3 shifts. Both doesn’t make sense with time, labour welfare and cost constraints. NM is not speaking rocket science and I have no affiliation with Infosys. Im sorry that you are dense. What's wrong with this chacha I think he means there should be 3shits running. Not individuals working 3 shifts each. Poor wording from him He is not saying for each worker to work 3 shifts. Rather that infrastructure work should continue for the whole day with 3 shifts of workers. That makes perfect sense actually and in fact I am surprised that is not the case already. I know people are pissed off with him about the 70hr comment but at least try to understand what he is saying. Pay for three shifts then, _bitch_ Fuck this guy. He’s outdated. Why cant he just drop dead and stop wasting oxygen TF is wrong with him? Narayan murthy is our apna sasta sathyagaya hua Jeff bezos He probably didn't mean same person to do three shifts and just meant the work should continue even at night. lol😂😂 Why is he still talking. I mean his logic has merit, higher productivity at lower prices is India's only competitive edge. No one has to follow his logic but that is another matter. The problem with billionaires is they are always willing to sacrifice others in the crusade of achieving so called 'greatness'. In other words, a lot of people will die, but its a sacrifice he is willing to make. Among all the other nonsense he says (70 hours work week), this actually is not too bad or wrong. He is not saying same worker person to work in three shifts, but different workers. Infra projects need velocity to finish and not them lag forever as those projects create massive traffic jams, dusty disruptions - so sooner they can be finished better, even if it means working in multiple shifts and keep work going 24/7 tbf, i have thought this too. A lot of factories and stuff should have atleast two shifts. There are plenty of people to employ so wages for another shift would be the same price but you could be a lot more productive. The thing is these employers don't need three shifts. 3 shifts make sense when you have employees working 8 hour days. But so many people here are working 12 hrs or more Right, yeah 👍🏽 It is a tiny bit confusing though 🤦🏾‍♂️😆 This guy is 77 years old, at that age brain stops working properly. He should stop speaking and we should stop taking him seriously. Stop posting about this asshole. Bhaiya patriotism ka extra display nahi karega to iski sachayi saamne aa jayegi. From we must work more to make India a great country it will become \"I want people to be paid less for more work so I get more profits\" He should donate all the money to the country, considering how much he gives patriotic gyaan. Well the underlying assumption is that the manpower cannot produce anything valuable. Most of Indias technology sector does outsourcing work for other countries. The net effect is that we don’t really build anything of value for ourselves. We don’t value labor, not spend money skill and quality of service. It’s always a race to the cheapest bottom that makes most businesses unsustainable or drain the lives out of their employees. To be honest, it’s only when real innovation and advancement comes through that we see pockets of our economy changing. Things that come to mind: 1. E-bikes 2. Fintech stack But this shouldn’t be where it ends, we need to push everything from fundamental sciences to advanced engineering to novel economic models to really do better. Don’t let capitalism alone define how we need to survive. Why are you even amplifying this? Buddha sathiya gaya hai. But in other nations that have high aspirations people work two shifts. I would return around midnight (when abroad), and I have seen people working as if they are going to disappear tomorrow morning. I cannot vouch for three shifts, but I can definitely vouch for two shifts,” he noted. For people who say he is talking about 3 people 3 shifts Senile old fool He can go fuck himself, or outsource it to someone to do that all three shifts He obviously means there should be 3 shifts of workers so that infra work goes on 24 hrs- Assuming that the same people will work 24 hrs is just stupid. I’m pretty sure he means put 3 sets of people in 3 shifts to finish work faster. No one should work for 18 hours a day, that’s too much to ask. Mairan. I'm curious, what country is this? He has a dildo up his ass so he's rolling his eyes 24/7 I think WFH would solve a bunch of the Infra Problems on its own. Although that would hurt the support staff’s employment employed at office campuses. So they wanna turn this country into S.korea or Japan with depressed suicidal people. Basically...buddha satiya gaya hai If it’s 3 people, why do they need to work in three different shifts? Three is also quite an odd number. Dual income makes sense. Can I work 5 shifts? A retired tech-billionaire sneezes and the media catches a cold! why does his face look like he is constipated for ages and trying to get shit out? oh well he is full of shit, so when he talks... \\*losing Sir u can work ur 3 shifts in ur coffin. for eternity. What's wrong with his eyes 🤔 Already working 3 shifts... But are they willing to give allowance? Let me translate: You peasants must slave away your lives so that us billionaires and our kids could live more comfortably and suck every ounce of your souls. Not like that. Say they have 3 shifts and max people that can work in an area is say 100. So 3 shifts means total 300 people working and 100 at a time. Clearly you have switched off your brain 3 shifts workday means 8hr per worker per day * 3 workers. Making the work i.e construction on 24 hrs.. It's not very hard to understand that. Idk how you came to this weird 3*6 hrs shit. I know it's fashionable to shit on Murthy lately and for good reason. In this case, though, he's referring to 3 shifts with different people in infra projects. That's implied. It is how it works in heavy industries. Nothing controversial here. STFU! Phillipines, if I am not wrong. All he wants to see is productivity so 3 shifts by different people would oppose his views. Wisdom doesn’t always come with Age. We should Thanos him and people who agree with him Narayan Saar clearly has dementia at this point. And who the F is this jobless to keep interviewing him? “I may be completely wrong”. No, you ARE wrong and don’t understand the fundamental reasons why infrastructure projects are never completed on time. Why does this guy who is a billionaire need to say downright insane shit for publicity what does he even get from this. Eyes are too humble to be straight 🤷 Nah murthy is desi Elon Musk . I regularly travel on ORR past 10pm and still see metro work going on. What 5 pm is this guy talking about?"
}