{
    "id": "1duy8mj",
    "title": "Jio Unlimited 5G scam",
    "url": "https://i.redd.it/y1jbjyo4kfad1.png",
    "selftext": "What a total scam. Not even Google is opening on 5G. Regretting porting my number to Jio from Airtel.",
    "flair": "Rant / Vent",
    "score": 329,
    "num_comments": 114,
    "created_utc": 1720067616.0,
    "convurl": "https://i.redd.it/y1jbjyo4kfad1.png",
    "comments": [
        "network really depends on location ,atleast jio gives actual unlimited data in 5g unlike 300gb limit on airtel",
        "Same with airtel it shows 5g+ in network but it uses my 4g data all the time and then i get used 100% data msg even with a 5g network and unlimited 5g plan these suckers need some tight authority to put them in their place",
        "Jio doesn't give assurance on indoor connectivity. If you are in a densely populated area you are ducked",
        "They all are scam and we all are paying now hiked prices for sub par 4G at best speeds. What we have here is not true 5G but guess what noone can do anything about it even the ruling party/govt won't intervene because they are all bribed in the name of \"Donations\". We in the end we are all fucked and we are sole reason behind it.\nThere is no competition just a cartel of 2-3 companies who are having the best time of their lives.",
        "what a joke",
        "Do you have prepaid or postpaid. Prepaid connections are usually deprioritised when the bandwidth starts getting constrained. That’s the reason there are fewer call drops and better speeds on postpaid connections. More over most networks also have a priority assigned based on postpaid plan. More you pay less congestion you face. And this practice is not just practiced in India but all overseas the world",
        "I never upgraded for 4g because of this reason or even upgraded from my 200 mbps internet at home.",
        "I completely agree! Jio 5G is a complete scam. I switched back to Jio based on a recommendation of a dumb friend and had so many issues in calls/net connectivity…etc. VI 4G is much better. Now, I am thinking should I go back to VI or choose Airtel?",
        "I'm porting to BSNL",
        "Dear Jio, humko jeene do,\n\n5G keliye pay kiya tho 5G speeds milne do.",
        "I've got 599 plan and sometimes there is no sign of data but I restart the phone then it works back",
        "Not its not a scam. I am getting 600 mbps inside my home everyday. If you don't like the network you should change it.",
        "The VI 4g speeds are crazy good.... Not kidding... I've seen 80mbps on VI.... Much faster than my fiber....\nBut calls are.... Let's not talk about that.",
        "bsnl mein 4g hi nahi hai dhang se , forget shit 5g",
        "Whether people use 5G or not they are gonna pay the \"5G price\" from now onwards.",
        "It has to do with infrastructure. India has a huge population but doesn't have the infrastructure to support it. What happens when 700 people connect to a tower that can only support 250? Network and speed issues. The supply pipeline is constrained but the demand isn't. Demand is actually growing.",
        "Is there any source for this information in relation to india where I can read more about this?",
        "I use Airtel and Jio and in my experience - Airtel 5G is more reliable in urban areas. I very rarely get better 5G connectivity on Jio over Airtel.",
        "Serious question: is their connectivity better than Jio and Airtel? \n\nI WFH so connectivity is important. If that is good, I'd rather support a business that offers good connectivity at a reasonable rate than these money hungry bozos.",
        "I am still on a 4G pixel 4a. Never really wanted more speed from my internet.",
        "🦆",
        "It actually depends on your region. In some areas, one network performs better in other areas some other. Basically, it is about infrastructure, if say Airtel has 1 tower in your area and 500 people are using it at the same time, you will have issues. And if say Jio has 2 towers in the same area and 500 people are using it as well, you will not have issues.",
        "https://www.airtel.in/blog/postpaid/prepaid-vs-postpaid-speed-which-is-faster/#:~:text=Deprioritization%20can%20affect%20your%20prepaid,when%20network%20is%20extremely%20busy.",
        "People have to understand its location based. But both are not true 5G airtel and Jjo",
        "Jio internet speed is a scam. High latency, High ms when playing games. Live stream buffers a lot. Can't open some sites. Airtel on the other hand may charge more then jio but they have much better connectivity then jio.",
        "There was an article about how our world class infrastructure is not world class. Be it private or public, consumer is promised moon and given peanuts. But ask and cajoled them to be proud of the peanut and to boast that peanut is indeed moon.\n\nMobile speed is one thing. Another is railway - have you travelled recently to feel the new world class railways. If you have driven extensively to know that at many stretches of the new highways, driving at the legal limit of 120km is not safe at all.\n\nIt is not that maintaining customer centric focus is impossible. Oldies would know that when Flipkart started, they were brilliant in customer focus. Amazon is still maintaining some credential. Some couriers like BlueDart is still good.\n\nBut over the period greed for money and fame spoils the customer centric approach.",
        "I get 200mbps on airtel 5G",
        "Jio sucks",
        "Ghar pr router lga h. Call ke liye chahiye bs",
        "https://preview.redd.it/zt8flwe7xfad1.jpeg?width=1179&format=pjpg&auto=webp&s=e4870e9df3928a0fcddfb2a9842276f4ab9575d1\n\nThis is what i am getting using airtel at my place",
        "I'm clocking close to 350 Mbps on Jio 5G in Bengaluru. I get these speeds in many areas, it really depends on the population density of the area you're living and the obstructions between your house and the tower.",
        "For me Jio has worked soo well. Like none of the other providers come close. I consistently get good 5g speeds though not crazy (30/40 mbps) and the calls never drop though I don’t like their international roaming plans, seems kidney expensive",
        "This is crazy fast dude. I get 400 Mbps in my area",
        "True. Just happy I avoided the scam early on. Besides company be bill bhrana unka issue >:)",
        "Exactly my point.\nSirf call & UPI chahiye bas.\nBaaki saare kaam Ghar k WiFi se kar lengein",
        "Idk guys. I got 300 Mbps in Vapi with Airtel 5g. I get 250 Mbps with Airtel in vadodara. But jio didn't even run properly in Vapi. I get 400+ Mbps with jio in vadodara.\n\n\nSo I guess, it really depends on your area.",
        "Mera bsnl ka 3g 4g jaisa chalta hai 😎",
        "where do you live?",
        "5g itself is a scam. Spectrum can't handle indoors lol. Get fiber & call it a day.",
        "If you have an airtel sim, they will disable it some day then they will give you a new 5g sim. It so infuriating, mine was disabled on a Friday night",
        "Check the network first somehow. In my area BSNL hasn't been working good from last 6 months. Frequent call drops.",
        "They’re charging for everyone - so it’s their responsibility to provide good service to each user",
        "Use the net monitor app and switch to NR only. You will experience the true 5G speed but only caveat is call drops. I easily get 400-500 Mbps. I have even surrendered my wifi. I connected my secondary phone with the router and I use that for my house. I have already stacked up plans for 3 years so I will be able to use 5G for a year at just 2545 a year.",
        "Use airtel postpaid 599 mai 2 sim chl jyegi 😎",
        "Well they are kinda right. Network load affects the speed, they are pushing high internet speeds through their towers but the load is high so the internet speed will get slow. Try checking at 3-4 AM and see if there is any difference. Solution to this is to have more towers but the there is regulations on mobile tower based upon SAR values. Or install 5nm wave towers but then the same problem arise they have to use multiple 5nm towers which is not feasible in country as populated as India. Have some fibre internet install on your home and switch to basic handset data plan.",
        "Send ss of https://speed.cloudflare.com",
        "Really? I get 4g/5g randomly. They offered me to\nUpgrade to 5G when it came\nOur first I just told them fuck off (I got airtel as well)",
        "https://preview.redd.it/byn25il34gad1.jpeg?width=1080&format=pjpg&auto=webp&s=8a4abb6e4e0d68883cd678ac8dd8721f285ced01",
        "JIO 5G Sucks it’s the worst , better stick to JIO 4G",
        "If speed depends upon area, then price should too",
        "Us",
        "https://preview.redd.it/sjd12htp5gad1.png?width=1080&format=pjpg&auto=webp&s=9c13b44097721d4cde630d15c13f627a8fc44546\n\nJIO 5G for me....",
        "Yes, I was not defending them. I was sharing why the issues exist and chances are they are gonna stay this way for a long time. The network providers are going to stick with their set plan of expanding infrastructure and therefore, some areas will have better network and others will not. Demand is a huge factor, and the companies would align with providing a baseline instead of focusing on each and every region. They will try to expand into more regions instead upgrading their infrastructure in an established region.",
        "https://preview.redd.it/abkf2xl86gad1.png?width=1080&format=pjpg&auto=webp&s=d0f9ed84802dca10c90d5ef8ffca0b48107c3e28\n\nJio 5g in Delhi inside my room. You probably don't have a good 5g phone or 5g tower connectivity in your area.",
        "lol this is not a jio scam. This is India telco scam.",
        "Bhai, ghar se bahar nahi nikloge kya kabhi?",
        "OP is introvert.",
        "He he",
        "Based.",
        "https://preview.redd.it/ku5dd0vw7gad1.png?width=864&format=pjpg&auto=webp&s=4d401dfa1c2a280884f4d2a9d615841dad0beccf\n\nThis is what I'm getting in NCR",
        "https://preview.redd.it/odm0vq4y7gad1.jpeg?width=1080&format=pjpg&auto=webp&s=10215a40a0cda17449e75cdda39865d89e492ff1\n\nJio 5G in Tier 3 city",
        "I have a 5G phone but I still went ahead with the less priced yearly plan coz I wfh and wifi fulfils all my needs and second is Jio 5G is just a symbol here and for some reason airtel uses my 4g data pack while running 5G internet",
        "+1\n\nPeople resort to Fast (by Netflix) to show the higher than average speed which complies with companies, meanwhile anyone can set a server for Ookla and show pretty much false instead of real world metrics including latency which was 1ms for my local ISP but in day-to-day usage it would be 60ms.",
        "Get a broadband connection like from Airtel (Xstream Fibre), mobile data is for checking notifications but not to rely your entire internet usage on it is the best advice I can give to Indians starting to get exposure with internet consumption.",
        "I get 700 MBPS in a tier 2 city and about 500-600 at my home in a small town.",
        "https://preview.redd.it/7i4deq4x9gad1.png?width=1008&format=pjpg&auto=webp&s=5b02d6629f30284a4580f2b5ddb3432b092f3b1f\n\nJust because something doesn't work for you doesn't make it a scam.",
        "What is the signal strength on your device?",
        "I am on Vi 4G and I got 4 Mb upload and 5 Mb download speed. And it's minimum speed sometimes it can touch 10 Mb",
        "Did you complain to Jio?",
        "Did you complain to Jio?",
        "Airtel 5g NSA does. Because it's is NSA it penetrate inside the house. While in jio I get no signal inside house.",
        "Even though they have known about such issues for few years (for both 4G and 5G) but they will just watch the show without any action to reduce the traffic congestion.",
        "Yes they did disable my sim, and my father's sim as well. Not on the same day though, it's pretty random",
        "India will never have the best, until America exists. Sad truth.",
        "SpaceX India me jaldi aaja bhai. Ye log humko pagal bana rahe hai mc ke bacche",
        "Depends on your location.",
        "Dam man crazy",
        "I mean its not just me but couple of my friends are also facing the same problem. I called them though and they are saying that it will be resolved in coming days.",
        "https://preview.redd.it/6ozyaoxjggad1.jpeg?width=1179&format=pjpg&auto=webp&s=3b8b2e681181c716c72f7d96e2c3d4d8bba2805b",
        "I get 400",
        "Jio 5G is fast on my side, I get 1.2Gbps on good days, doesn't go below 300. All this in a village!",
        "https://preview.redd.it/r12cuozcigad1.jpeg?width=1170&format=pjpg&auto=webp&s=3711dd6b1ed80bb2c4631c804c7ca2c74ebab1f5\n\nJio 5G",
        "How is this surprising? The same thing happened when we got 3G and then later, when we got 4G.\n\nAlways assume one less \"G\" when opting for these connections in their infancy.",
        "Did you try downloading something and max it would give you only 40 mbps. They manipulate these speed testers",
        "Last checked, Ambani family was into an year long wedding shoot. No time for your little data issues. \n\n\nSeriously, dude, why would you believe that Biz house? It's all has been scam from day one.",
        "i am getting on jio 5g 500 mbps and upload upto 50 mbps and sometime 70 or 80 mbps but download remains good and i live in ahmedabad",
        "That's great! By the way, which city are you in?",
        "Airtel has already started throttling 4g. Ever since they started 5g, I've been getting poor connectivity on 4g.",
        "I get 500 mbps on Jio. Doing a couple of speed tests once exhausted my data xD.",
        "Your download speed also depends on the server you are downloading from/website bandwidth as well fyi.",
        "I have AirTag at home jio at office AirTal is good overall on other hand jii is 500 Mbps plan and 70% times it speed is less then 200 and government website takes hell of a time to open on jio don’t know why on airtal there is no such issue",
        "you know right? That you download files in mega bytes per second and this speed testers show speed in mega bits per second \nAnd also download speed also depends on where are you downloading it from.",
        "I had jio Airfiber connection and it's getting worst daily I have around 50-60 disconnection and when try to contact customer care they won't even understand the issue, I am fed up with Jio service these days.\nThis is why law says Monopoly in business is very bad for consumers.",
        "Lmao I get around 900 mbps to 1 gbps on Jio 5g in my area. It works flawlessly.",
        "Yah. But still, do anyone care more higher speeds on telecom when they can have fiber in homes ?\n\n\nThe only reason I have a sim is to have connectivity everywhere while outside. Not because of 4g or 5g just to watch 4k content on my mobile lol.",
        "Before price hike it was more economical than fibre. You can have calling and data at fiber speed. It saved lot of ? money for me about a year.",
        "Fiber is infact miles cheaper than any telecom btw. There are broadbands who provide just the Internet without any OTT packs & DTH. You can check them out.\n\n\nAgain, those who use mobile internet probably never care about high speed internet. It's just an idea of the privileged people.",
        "I get 300+mbps. Where do you live? ",
        "https://preview.redd.it/x0sutxyuugad1.png?width=1440&format=pjpg&auto=webp&s=553c6845d44b09da1be689a65be1f759a18716ab\n\nIt depends on the location, I get great speeds from jio!",
        "What does america has to do here?",
        "https://preview.redd.it/21wcay8ewgad1.jpeg?width=1220&format=pjpg&auto=webp&s=139164e58cedbefbd50682f3350b96612bb82ed5\n\nLocation specific, i stay in rural area.",
        "Yeah that’s true. This is why we need PSU like BSNL to ensure that everyone has access to basic network while not ripping people off",
        "Idk man, my father is getting an incredible speed. Check if your network settings and everything else is fine.",
        "cause it depends on the 5g bands your phone can support and what's available in your area, i get around 600 mbps with jio, my phone has a 8+ gen 1 which supports all bands",
        "#This.",
        "Jio services are well-known to have sub par quality \n\nSaying that you probably might be in bad location plus their network is overloaded as they got greedy n allowed as many as people to use their network which is unable to provide the service they promised",
        "Monopoly over technology and money which is the root of growth & dev.",
        "This is the issue with 4G and 5G wave",
        "Currently getting 240 Mbps in a building that has comparatively less network. It's probably a you problem and not a scam.",
        "Though no Indian telco is great when it comes to Internet, Airtel is the best. I never understand why someone would use Jio if they have the choice.",
        "https://preview.redd.it/ozgcbuk93had1.png?width=1084&format=pjpg&auto=webp&s=564a47d779abe09d5258fba70b07c628bc78cbf9\n\nJio 5G in Tier 2 City (Vadodara) while sitting in a room.",
        "But it doesn't affect china or Russia",
        "https://preview.redd.it/1lk5o9xgahad1.jpeg?width=1080&format=pjpg&auto=webp&s=1b4101fdcf8400c75ab9eeac80c00bc263dcb03c\n\nWhy is online gaming poor",
        "In this current world order, you either be subservient to the US & prosper under it or it'll make a rival/enemy out of you & beat you. \n\nFirst fatten the pig, then slaughter it. In 1990's that's what they did with China, fattened it & used it to supress Japan, that was about to overtake US in economic growth. Now that the pig is fattened, it is ready for slaughter. Japan didn't get slaughtered because they were subservient.\n\nNow the US is using India & fattening us. In future, if India still sticks to it's non-allignment policy & grows too big, we will also automatically be targeted like present China.\n\nAnyone who grows too much, is on the radar of the US & the US will use all it's strength to weaken them so they dont surpass it. It will form coalitions & surround your country from all sides using groupism, it will use the media & everything else - basically FSD - full spectrum dominance, a form of hyrbid warfare strategy that is their military doctrine.\n\nRussia was given a chance to be subservient, instead of disintegration, but they refused it after 2007. Till 2007, Putin was in good terms with the US & there even was a G8 & the west thought Russia wasn't a threat anymore. Now the next weakening plan which began in 2014 will make sure they disintegrate within the next 100 years because there's tons of resources once the ice melts in siberia & a power hungry capitalistic country with high levels of consumption cannot rule the planet without it's hands on the world's biggest source of natural resources.  Russia will also be the bread basket of the world once the ice in siberia melts. \n\nAs for India, in future, if we toe the line- we will prosper or else we will be neutralized using a weakened china & a upcoming pakistan. Kashmir is the next Ukraine/Taiwan/Gaza. Also India is going to be a country with almost 2bn population, severe water crisis & lots of money. So it'll be a complex geopolitical situation. The whole plan of India & Pak partition was well thought, so that we don't become a future force to reckon with."
    ],
    "cleaned_text": "jio unlimited g scam total scam even google opening g regretting porting number jio airtel ",
    "cleaned_title": "jio unlimited g scam",
    "cleaned_selftext": "total scam even google opening g regretting porting number jio airtel",
    "cleaned_comments": "network really depends location atleast jio gives actual unlimited data g unlike gb limit airtel airtel shows g network uses g data time get used data msg even g network unlimited g plan suckers need tight authority put place jio doesnt give assurance indoor connectivity densely populated area ducked scam paying hiked prices sub par g best speeds true g guess noone anything even ruling partygovt wont intervene bribed name donations end fucked sole reason behind competition cartel companies best time lives joke prepaid postpaid prepaid connections usually deprioritised bandwidth starts getting constrained thats reason fewer call drops better speeds postpaid connections networks also priority assigned based postpaid plan pay less congestion face practice practiced india overseas world never upgraded g reason even upgraded mbps internet home completely agree jio g complete scam switched back jio based recommendation dumb friend many issues callsnet connectivityetc vi g much better thinking go back vi choose airtel im porting bsnl dear jio humko jeene g keliye pay kiya tho g speeds milne ive got plan sometimes sign data restart phone works back scam getting mbps inside home everyday dont like network change vi g speeds crazy good kidding ive seen mbps vi much faster fiber calls lets talk bsnl mein g hi nahi hai dhang se forget shit g whether people use g gon na pay g price onwards infrastructure india huge population doesnt infrastructure support happens people connect tower support network speed issues supply pipeline constrained demand isnt demand actually growing source information relation india read use airtel jio experience airtel g reliable urban areas rarely get better g connectivity jio airtel serious question connectivity better jio airtel wfh connectivity important good id rather support business offers good connectivity reasonable rate money hungry bozos still g pixel never really wanted speed internet actually depends region areas one network performs better areas basically infrastructure say airtel tower area people using time issues say jio towers area people using well issues people understand location based true g airtel jjo jio internet speed scam high latency high ms playing games live stream buffers lot cant open sites airtel hand may charge jio much better connectivity jio article world class infrastructure world class private public consumer promised moon given peanuts ask cajoled proud peanut boast peanut indeed moon mobile speed one thing another railway travelled recently feel new world class railways driven extensively know many stretches new highways driving legal limit km safe maintaining customer centric focus impossible oldies would know flipkart started brilliant customer focus amazon still maintaining credential couriers like bluedart still good period greed money fame spoils customer centric approach get mbps airtel g jio sucks ghar pr router lga h call ke liye chahiye bs getting using airtel place im clocking close mbps jio g bengaluru get speeds many areas really depends population density area youre living obstructions house tower jio worked soo well like none providers come close consistently get good g speeds though crazy mbps calls never drop though dont like international roaming plans seems kidney expensive crazy fast dude get mbps area true happy avoided scam early besides company bill bhrana unka issue exactly point sirf call upi chahiye bas baaki saare kaam ghar k wifi se kar lengein idk guys got mbps vapi airtel g get mbps airtel vadodara jio didnt even run properly vapi get mbps jio vadodara guess really depends area mera bsnl ka g g jaisa chalta hai live g scam spectrum cant handle indoors lol get fiber call day airtel sim disable day give new g sim infuriating mine disabled friday night check network first somehow area bsnl hasnt working good last months frequent call drops theyre charging everyone responsibility provide good service user use net monitor app switch nr experience true g speed caveat call drops easily get mbps even surrendered wifi connected secondary phone router use house already stacked plans years able use g year year use airtel postpaid mai sim chl jyegi well kinda right network load affects speed pushing high internet speeds towers load high internet speed get slow try checking see difference solution towers regulations mobile tower based upon sar values install nm wave towers problem arise use multiple nm towers feasible country populated india fibre internet install home switch basic handset data plan send ss really get gg randomly offered upgrade g came first told fuck got airtel well jio g sucks worst better stick jio g speed depends upon area price us jio g yes defending sharing issues exist chances gon na stay way long time network providers going stick set plan expanding infrastructure therefore areas better network others demand huge factor companies would align providing baseline instead focusing every region try expand regions instead upgrading infrastructure established region jio g delhi inside room probably dont good g phone g tower connectivity area lol jio scam india telco scam bhai ghar se bahar nahi nikloge kya kabhi op introvert based im getting ncr jio g tier city g phone still went ahead less priced yearly plan coz wfh wifi fulfils needs second jio g symbol reason airtel uses g data pack running g internet people resort fast netflix show higher average speed complies companies meanwhile anyone set server ookla show pretty much false instead real world metrics including latency ms local isp daytoday usage would ms get broadband connection like airtel xstream fibre mobile data checking notifications rely entire internet usage best advice give indians starting get exposure internet consumption get mbps tier city home small town something doesnt work doesnt make scam signal strength device vi g got mb upload mb download speed minimum speed sometimes touch mb complain jio complain jio airtel g nsa nsa penetrate inside house jio get signal inside house even though known issues years g g watch show without action reduce traffic congestion yes disable sim fathers sim well day though pretty random india never best america exists sad truth spacex india jaldi aaja bhai ye log humko pagal bana rahe hai mc ke bacche depends location dam man crazy mean couple friends also facing problem called though saying resolved coming days get jio g fast side get gbps good days doesnt go village jio g surprising thing happened got g later got g always assume one less g opting connections infancy try downloading something max would give mbps manipulate speed testers last checked ambani family year long wedding shoot time little data issues seriously dude would believe biz house scam day one getting jio g mbps upload upto mbps sometime mbps download remains good live ahmedabad thats great way city airtel already started throttling g ever since started g ive getting poor connectivity g get mbps jio couple speed tests exhausted data xd download speed also depends server downloading fromwebsite bandwidth well fyi airtag home jio office airtal good overall hand jii mbps plan times speed less government website takes hell time open jio dont know airtal issue know right download files mega bytes per second speed testers show speed mega bits per second also download speed also depends downloading jio airfiber connection getting worst daily around disconnection try contact customer care wont even understand issue fed jio service days law says monopoly business bad consumers lmao get around mbps gbps jio g area works flawlessly yah still anyone care higher speeds telecom fiber homes reason sim connectivity everywhere outside g g watch k content mobile lol price hike economical fibre calling data fiber speed saved lot money year fiber infact miles cheaper telecom btw broadbands provide internet without ott packs dth check use mobile internet probably never care high speed internet idea privileged people get mbps live depends location get great speeds jio america location specific stay rural area yeah thats true need psu like bsnl ensure everyone access basic network ripping people idk man father getting incredible speed check network settings everything else fine cause depends g bands phone support whats available area get around mbps jio phone gen supports bands jio services wellknown sub par quality saying probably might bad location plus network overloaded got greedy n allowed many people use network unable provide service promised monopoly technology money root growth dev issue g g wave currently getting mbps building comparatively less network probably problem scam though indian telco great comes internet airtel best never understand someone would use jio choice jio g tier city vadodara sitting room doesnt affect china russia online gaming poor current world order either subservient us prosper itll make rivalenemy beat first fatten pig slaughter thats china fattened used supress japan overtake us economic growth pig fattened ready slaughter japan didnt get slaughtered subservient us using india fattening us future india still sticks nonallignment policy grows big also automatically targeted like present china anyone grows much radar us us use strength weaken dont surpass form coalitions surround country sides using groupism use media everything else basically fsd full spectrum dominance form hyrbid warfare strategy military doctrine russia given chance subservient instead disintegration refused till putin good terms us even g west thought russia wasnt threat anymore next weakening plan began make sure disintegrate within next years theres tons resources ice melts siberia power hungry capitalistic country high levels consumption rule planet without hands worlds biggest source natural resources russia also bread basket world ice siberia melts india future toe line prosper else neutralized using weakened china upcoming pakistan kashmir next ukrainetaiwangaza also india going country almost bn population severe water crisis lots money itll complex geopolitical situation whole plan india pak partition well thought dont become future force reckon",
    "light_cleaned_title": "Jio Unlimited 5G scam",
    "light_cleaned_selftext": "What a total scam. Not even Google is opening on 5G. Regretting porting my number to Jio from Airtel.",
    "light_cleaned_comments": "network really depends on location ,atleast jio gives actual unlimited data in 5g unlike 300gb limit on airtel Same with airtel it shows 5g+ in network but it uses my 4g data all the time and then i get used 100% data msg even with a 5g network and unlimited 5g plan these suckers need some tight authority to put them in their place Jio doesn't give assurance on indoor connectivity. If you are in a densely populated area you are ducked They all are scam and we all are paying now hiked prices for sub par 4G at best speeds. What we have here is not true 5G but guess what noone can do anything about it even the ruling party/govt won't intervene because they are all bribed in the name of \"Donations\". We in the end we are all fucked and we are sole reason behind it. There is no competition just a cartel of 2-3 companies who are having the best time of their lives. what a joke Do you have prepaid or postpaid. Prepaid connections are usually deprioritised when the bandwidth starts getting constrained. That’s the reason there are fewer call drops and better speeds on postpaid connections. More over most networks also have a priority assigned based on postpaid plan. More you pay less congestion you face. And this practice is not just practiced in India but all overseas the world I never upgraded for 4g because of this reason or even upgraded from my 200 mbps internet at home. I completely agree! Jio 5G is a complete scam. I switched back to Jio based on a recommendation of a dumb friend and had so many issues in calls/net connectivity…etc. VI 4G is much better. Now, I am thinking should I go back to VI or choose Airtel? I'm porting to BSNL Dear Jio, humko jeene do, 5G keliye pay kiya tho 5G speeds milne do. I've got 599 plan and sometimes there is no sign of data but I restart the phone then it works back Not its not a scam. I am getting 600 mbps inside my home everyday. If you don't like the network you should change it. The VI 4g speeds are crazy good.... Not kidding... I've seen 80mbps on VI.... Much faster than my fiber.... But calls are.... Let's not talk about that. bsnl mein 4g hi nahi hai dhang se , forget shit 5g Whether people use 5G or not they are gonna pay the \"5G price\" from now onwards. It has to do with infrastructure. India has a huge population but doesn't have the infrastructure to support it. What happens when 700 people connect to a tower that can only support 250? Network and speed issues. The supply pipeline is constrained but the demand isn't. Demand is actually growing. Is there any source for this information in relation to india where I can read more about this? I use Airtel and Jio and in my experience - Airtel 5G is more reliable in urban areas. I very rarely get better 5G connectivity on Jio over Airtel. Serious question: is their connectivity better than Jio and Airtel? I WFH so connectivity is important. If that is good, I'd rather support a business that offers good connectivity at a reasonable rate than these money hungry bozos. I am still on a 4G pixel 4a. Never really wanted more speed from my internet. 🦆 It actually depends on your region. In some areas, one network performs better in other areas some other. Basically, it is about infrastructure, if say Airtel has 1 tower in your area and 500 people are using it at the same time, you will have issues. And if say Jio has 2 towers in the same area and 500 people are using it as well, you will not have issues. People have to understand its location based. But both are not true 5G airtel and Jjo Jio internet speed is a scam. High latency, High ms when playing games. Live stream buffers a lot. Can't open some sites. Airtel on the other hand may charge more then jio but they have much better connectivity then jio. There was an article about how our world class infrastructure is not world class. Be it private or public, consumer is promised moon and given peanuts. But ask and cajoled them to be proud of the peanut and to boast that peanut is indeed moon. Mobile speed is one thing. Another is railway - have you travelled recently to feel the new world class railways. If you have driven extensively to know that at many stretches of the new highways, driving at the legal limit of 120km is not safe at all. It is not that maintaining customer centric focus is impossible. Oldies would know that when Flipkart started, they were brilliant in customer focus. Amazon is still maintaining some credential. Some couriers like BlueDart is still good. But over the period greed for money and fame spoils the customer centric approach. I get 200mbps on airtel 5G Jio sucks Ghar pr router lga h. Call ke liye chahiye bs This is what i am getting using airtel at my place I'm clocking close to 350 Mbps on Jio 5G in Bengaluru. I get these speeds in many areas, it really depends on the population density of the area you're living and the obstructions between your house and the tower. For me Jio has worked soo well. Like none of the other providers come close. I consistently get good 5g speeds though not crazy (30/40 mbps) and the calls never drop though I don’t like their international roaming plans, seems kidney expensive This is crazy fast dude. I get 400 Mbps in my area True. Just happy I avoided the scam early on. Besides company be bill bhrana unka issue >:) Exactly my point. Sirf call & UPI chahiye bas. Baaki saare kaam Ghar k WiFi se kar lengein Idk guys. I got 300 Mbps in Vapi with Airtel 5g. I get 250 Mbps with Airtel in vadodara. But jio didn't even run properly in Vapi. I get 400+ Mbps with jio in vadodara. So I guess, it really depends on your area. Mera bsnl ka 3g 4g jaisa chalta hai 😎 where do you live? 5g itself is a scam. Spectrum can't handle indoors lol. Get fiber & call it a day. If you have an airtel sim, they will disable it some day then they will give you a new 5g sim. It so infuriating, mine was disabled on a Friday night Check the network first somehow. In my area BSNL hasn't been working good from last 6 months. Frequent call drops. They’re charging for everyone - so it’s their responsibility to provide good service to each user Use the net monitor app and switch to NR only. You will experience the true 5G speed but only caveat is call drops. I easily get 400-500 Mbps. I have even surrendered my wifi. I connected my secondary phone with the router and I use that for my house. I have already stacked up plans for 3 years so I will be able to use 5G for a year at just 2545 a year. Use airtel postpaid 599 mai 2 sim chl jyegi 😎 Well they are kinda right. Network load affects the speed, they are pushing high internet speeds through their towers but the load is high so the internet speed will get slow. Try checking at 3-4 AM and see if there is any difference. Solution to this is to have more towers but the there is regulations on mobile tower based upon SAR values. Or install 5nm wave towers but then the same problem arise they have to use multiple 5nm towers which is not feasible in country as populated as India. Have some fibre internet install on your home and switch to basic handset data plan. Send ss of Really? I get 4g/5g randomly. They offered me to Upgrade to 5G when it came Our first I just told them fuck off (I got airtel as well) JIO 5G Sucks it’s the worst , better stick to JIO 4G If speed depends upon area, then price should too Us JIO 5G for me.... Yes, I was not defending them. I was sharing why the issues exist and chances are they are gonna stay this way for a long time. The network providers are going to stick with their set plan of expanding infrastructure and therefore, some areas will have better network and others will not. Demand is a huge factor, and the companies would align with providing a baseline instead of focusing on each and every region. They will try to expand into more regions instead upgrading their infrastructure in an established region. Jio 5g in Delhi inside my room. You probably don't have a good 5g phone or 5g tower connectivity in your area. lol this is not a jio scam. This is India telco scam. Bhai, ghar se bahar nahi nikloge kya kabhi? OP is introvert. He he Based. This is what I'm getting in NCR Jio 5G in Tier 3 city I have a 5G phone but I still went ahead with the less priced yearly plan coz I wfh and wifi fulfils all my needs and second is Jio 5G is just a symbol here and for some reason airtel uses my 4g data pack while running 5G internet +1 People resort to Fast (by Netflix) to show the higher than average speed which complies with companies, meanwhile anyone can set a server for Ookla and show pretty much false instead of real world metrics including latency which was 1ms for my local ISP but in day-to-day usage it would be 60ms. Get a broadband connection like from Airtel (Xstream Fibre), mobile data is for checking notifications but not to rely your entire internet usage on it is the best advice I can give to Indians starting to get exposure with internet consumption. I get 700 MBPS in a tier 2 city and about 500-600 at my home in a small town. Just because something doesn't work for you doesn't make it a scam. What is the signal strength on your device? I am on Vi 4G and I got 4 Mb upload and 5 Mb download speed. And it's minimum speed sometimes it can touch 10 Mb Did you complain to Jio? Did you complain to Jio? Airtel 5g NSA does. Because it's is NSA it penetrate inside the house. While in jio I get no signal inside house. Even though they have known about such issues for few years (for both 4G and 5G) but they will just watch the show without any action to reduce the traffic congestion. Yes they did disable my sim, and my father's sim as well. Not on the same day though, it's pretty random India will never have the best, until America exists. Sad truth. SpaceX India me jaldi aaja bhai. Ye log humko pagal bana rahe hai mc ke bacche Depends on your location. Dam man crazy I mean its not just me but couple of my friends are also facing the same problem. I called them though and they are saying that it will be resolved in coming days. I get 400 Jio 5G is fast on my side, I get 1.2Gbps on good days, doesn't go below 300. All this in a village! Jio 5G How is this surprising? The same thing happened when we got 3G and then later, when we got 4G. Always assume one less \"G\" when opting for these connections in their infancy. Did you try downloading something and max it would give you only 40 mbps. They manipulate these speed testers Last checked, Ambani family was into an year long wedding shoot. No time for your little data issues. Seriously, dude, why would you believe that Biz house? It's all has been scam from day one. i am getting on jio 5g 500 mbps and upload upto 50 mbps and sometime 70 or 80 mbps but download remains good and i live in ahmedabad That's great! By the way, which city are you in? Airtel has already started throttling 4g. Ever since they started 5g, I've been getting poor connectivity on 4g. I get 500 mbps on Jio. Doing a couple of speed tests once exhausted my data xD. Your download speed also depends on the server you are downloading from/website bandwidth as well fyi. I have AirTag at home jio at office AirTal is good overall on other hand jii is 500 Mbps plan and 70% times it speed is less then 200 and government website takes hell of a time to open on jio don’t know why on airtal there is no such issue you know right? That you download files in mega bytes per second and this speed testers show speed in mega bits per second And also download speed also depends on where are you downloading it from. I had jio Airfiber connection and it's getting worst daily I have around 50-60 disconnection and when try to contact customer care they won't even understand the issue, I am fed up with Jio service these days. This is why law says Monopoly in business is very bad for consumers. Lmao I get around 900 mbps to 1 gbps on Jio 5g in my area. It works flawlessly. Yah. But still, do anyone care more higher speeds on telecom when they can have fiber in homes ? The only reason I have a sim is to have connectivity everywhere while outside. Not because of 4g or 5g just to watch 4k content on my mobile lol. Before price hike it was more economical than fibre. You can have calling and data at fiber speed. It saved lot of ? money for me about a year. Fiber is infact miles cheaper than any telecom btw. There are broadbands who provide just the Internet without any OTT packs & DTH. You can check them out. Again, those who use mobile internet probably never care about high speed internet. It's just an idea of the privileged people. I get 300+mbps. Where do you live? It depends on the location, I get great speeds from jio! What does america has to do here? Location specific, i stay in rural area. Yeah that’s true. This is why we need PSU like BSNL to ensure that everyone has access to basic network while not ripping people off Idk man, my father is getting an incredible speed. Check if your network settings and everything else is fine. cause it depends on the 5g bands your phone can support and what's available in your area, i get around 600 mbps with jio, my phone has a 8+ gen 1 which supports all bands #This. Jio services are well-known to have sub par quality Saying that you probably might be in bad location plus their network is overloaded as they got greedy n allowed as many as people to use their network which is unable to provide the service they promised Monopoly over technology and money which is the root of growth & dev. This is the issue with 4G and 5G wave Currently getting 240 Mbps in a building that has comparatively less network. It's probably a you problem and not a scam. Though no Indian telco is great when it comes to Internet, Airtel is the best. I never understand why someone would use Jio if they have the choice. Jio 5G in Tier 2 City (Vadodara) while sitting in a room. But it doesn't affect china or Russia Why is online gaming poor In this current world order, you either be subservient to the US & prosper under it or it'll make a rival/enemy out of you & beat you. First fatten the pig, then slaughter it. In 1990's that's what they did with China, fattened it & used it to supress Japan, that was about to overtake US in economic growth. Now that the pig is fattened, it is ready for slaughter. Japan didn't get slaughtered because they were subservient. Now the US is using India & fattening us. In future, if India still sticks to it's non-allignment policy & grows too big, we will also automatically be targeted like present China. Anyone who grows too much, is on the radar of the US & the US will use all it's strength to weaken them so they dont surpass it. It will form coalitions & surround your country from all sides using groupism, it will use the media & everything else - basically FSD - full spectrum dominance, a form of hyrbid warfare strategy that is their military doctrine. Russia was given a chance to be subservient, instead of disintegration, but they refused it after 2007. Till 2007, Putin was in good terms with the US & there even was a G8 & the west thought Russia wasn't a threat anymore. Now the next weakening plan which began in 2014 will make sure they disintegrate within the next 100 years because there's tons of resources once the ice melts in siberia & a power hungry capitalistic country with high levels of consumption cannot rule the planet without it's hands on the world's biggest source of natural resources. Russia will also be the bread basket of the world once the ice in siberia melts. As for India, in future, if we toe the line- we will prosper or else we will be neutralized using a weakened china & a upcoming pakistan. Kashmir is the next Ukraine/Taiwan/Gaza. Also India is going to be a country with almost 2bn population, severe water crisis & lots of money. So it'll be a complex geopolitical situation. The whole plan of India & Pak partition was well thought, so that we don't become a future force to reckon with."
}