{
    "id": "15bpp0o",
    "title": "Instagram reels have become a nuisance and started a silent endemic in this nation. What is going on?",
    "url": "https://www.reddit.com/gallery/15bpp0o",
    "selftext": "Never have I ever thought that every morning I will wake up and read the news of a death or a crime, with the motive being Instagram reels?! \nThere was this video of a woman getting swept away in Mumbai while her children were filming the couple. \nNow this Karnataka video is getting viral. \nThen yesterday, there was this bizarre West Bengal couple. \nThis is taken the shape of an endemic. \nWhat is even going on?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690526692.0,
    "convurl": "https://i.redd.it/g09vmiprjneb1.png",
    "comments": [
        "One word. Validation.",
        "One less idiot to worry about. /s",
        "Oh yeah. Ofc. \nBut yaar matlab validation>>>> life. \nOh God.",
        "One? Ab toh number roz bad jaata hain. \nClassic case of Darwin Award.",
        "Natural selection /s",
        "Badte jae aur, ye reelers are nuisance to the society /s",
        "Anyone watches JoeyBToonz on YT? He takes on Tiktoker & Reelers. He has been striked by YT many times. We need someone on YT making fun of them till they realize that it’s embarrassing.",
        "Thats basically human nature. The desire to be popular, liked by others. Earlier it used to just be your local area. Now due to the internet, its way larger.",
        "Second word. Unemployment.",
        "Reels better at population control than condoms.🫡",
        "Idiots have been doing stupid things and dying for ages. Before there were smartphones, people still died doing stupid stunts just for kicks. Instagram has just made sure we hear about it. Earlier, if someone slipped in a waterfall and died in the Himalayas, then someone living in Kerala won't hear the news and vice versa. Now, with these deaths being captured on phone and going viral online, plus with the 24 hour negative news cycle, it just makes the whole thing more widely known.",
        "For india it's reels, for the rest of the world it's tiktok. The gates are open, there's no going back.",
        "Except for the passerby who died because of the bike stunt. That biker, if alive, should be hanged.",
        "Bruh what is even happening, this reel shit is coming at a great cost to our nation 🤦. Yes sometimes it's embarrassing at times to see people shoot reels like this but pulling off dangerous stuff to entertain or seek validation now that's really messed up",
        "third word stupid",
        "That's the moment you ban the service nation wide.",
        "There is a reason they are called Instagram Influenzas.",
        "Darwin theory of natural selection",
        "People are now selling kids for an iPhone!! So we have moved on from selling kidney jokes?",
        "Who sells their baby for a phone!? Like damn! Instagram can be run even in trash phones 💀 they just needed an excuse to sell their baby that's what",
        "Ye waterfall wale ka video dekha mai at r/darwinawards",
        "This! Call it a version of survivorship bias on steroids due to how easily it is to make/get news these days.",
        "Instuenza",
        "Who is buying the baby 👶 🤔",
        "Darwin Award winners right here, folks.",
        "Insta has fucked up pristine places too. From being great places to bein trash dumps in under 3 days.",
        "Sabko Happening life jeena hai. Pata nahi kyun.",
        "Maybe these media houses are trying to ban instagram in India.",
        "Whole yt community made fun of tiktokers for so long,nothing happened",
        "google child trafficking",
        "N imagine some of these mfs are invited to open shops and like that,\nUnnecessary glam to dumbasses",
        "That too for an iPhone 8",
        "One more thing. There is a bias in the way news is served to you. The more you click on an article, the more you’ll get similar articles.\n\nReels has become an endemic. But considering your sample size and the data that google feeds you is not unbiased.",
        "\"Only thing they influence is natural selection\"   -- JoeyBToonz",
        "That's natural selection at work. That's how mother nature removes dumb genes from the genepool.",
        "Third word. Clout/fame",
        "Insta was a better place before reels were introduced.",
        "It's also technically one word",
        "This is why I don't use instagram",
        "Came to say this.. these apps are enforcing the law of natural selection",
        "There was a great Vox video about it. Having the exact co-ordinates is terrible for unknown places.",
        "Darwin Awards",
        "They just removed the knee",
        "its because we are a generation who wants to be a video creator not software or civil engineer being famous is more valuable than being intelligent times are changing we want to be liked by people we don't know rather than liked by people we know \n\nwelcome to youth apocalypse",
        "Bruh, you're writing this comment itself for validation, right? Otherwise, you'd keep your thoughts in your mind.\n\nValidation is an applicable generic answer for too many questions.",
        "And that is NATURAL SELECTION.\n\nPeople are so starved for attention, validation & half the time those so called \"reels\" just look lame with zoom in zoom out, shaking effect for no reason.",
        "Correction: don't blame the app, blame the dumbfuckery of people.",
        "Off course…. \nWhat’s will we do with “life”, We just need likes and comments….",
        "Holy hell",
        "How else you gonna control the population?",
        "Once a wise man said \" The matrix is trying to control your mind. It's trying to make you weak. Taking control off of yourself\".",
        "Fourth word. Darwin.",
        "What?",
        "Only problem is that it could endanger others due to stupid bike, car stunts",
        "The thing used to be the same with selfies when smartphones became accessible.",
        "Zeroth word: Dopamine addiction.",
        "I sometimes wonder \n\nAre news is even real? \n\nI mean WHO TF!! SELLS THEIR 8 MONTH OLD KID FOR AN I PHONE!!!!!!",
        "Us writing comments on reddit is for 'validation' as well. So we can see the upvotes, replies from others, get some attention, etc.\n\nMost things we do is for validation",
        "clout is one helluva drug",
        "Oh well, this is the beginning of Blackmirror: Nosedive. I was pretty addicted to reels, I'm glad I understood early and left the platform for good.",
        "The person must be a maniac. He/she can get more money by showing kids personal life in YouTube.",
        "It's generational decay that's going on.",
        "The real endemic started when everyone was given access to cheap and fast internet. We're just starting to witness the effects.",
        "Nope, defination of validation being used by you is wrong.",
        "natural selection",
        "fifth word. chutiyapa",
        "Just let Darwin's theory do its work ...",
        "Good. Revised natural selection. People with zero survival instinct and a hunger for clout deserve this",
        "Stupid people do stupid shit, Instagram has nothing to do with it.",
        "Validation on a platform where others don't even know who I am, nor do I know who they are?",
        "Natural selection",
        "Tiktok garbage has move on to Instagram and YouTube shorts. If we could start a petition to ban Instagram reels and YouTube shorts(feature) maybe it will do.",
        "Yup. That's how human psychology works. We even choose our anonymous usernames for a slight validation. Even reddit upvotes give the sort of same validation and instant gratification as any other social media.",
        "https://www.youtube.com/watch?v=Itjc14Fm-gs",
        "I chose the first username they showed. Am I not human?",
        "well iphone prices are increased /s",
        "Darwin awards recipients. Hope that atleast they kill only themselves without affecting anyone else.",
        "When we write a comment, we are doing it to validate our thoughts with others and see what others think about it.",
        "Natural selection",
        "Par uske liye toh pahle IIT clear karke piolet banna padega",
        "I'm simply saying even that becomes a factor of hunting validation. It's not a protocol or rule. \n\nWe are content creators as well since we are publishing/uploading our comments, getting upvotes, views, replies. Just that our content is on a very small scale and anonymous.",
        "If you view from such a micro pov. Then every object around you seems to claim a life.",
        "Same thing happened when instagram selfies were becoming popular and the same thing also happened when Pokemon Go was released. The problem is the idiots not the technology.",
        "I wish everyone could get this reference haha.",
        "CarryMinati ka naam suna hai? Pura tiktok gira diya bhai ne akele.",
        "Ab woh wise man jail me hai. Chutyo ka example mat de.",
        "Reels are going to destroy an entire generation and India can't lose any more people.  The thing is India has the auntie culture where they love gossip and love filling their minds with low quality information to have something to gossip about with other aunties.  So reels will fit perfectly here.  Bad info, fake news, incomplete stories to gossip about and pretend to be worldly.",
        "they can always get new one /s",
        "Not the compilation of news we need but...",
        "\"Give a man a fish, and you feed him for a day...\"",
        "Sixth word. Loda Lassun",
        "This kind of thing is bound to happen and repeat. Most of us have amnesia, lest we forget the pandemic of selfies. When selfies became a thing for the first time, there were similar reports of deaths/accidents in clicking the most daring and different selfies. The same shit happened with TikTok, which the Indian Government banned. Death and accidents. Then YouTube came up with shorts, and IG reels have taken over too.\n\nPeople will do anything to flow with the trend and up the game, even if it means having a meal of your puke and shit with pee as the drink of choice. And before anyone does this, please do not do this, this is a joke.",
        "Natural selection",
        "Seventh word: idiots",
        "Teach a man to fuck and his iPhone needs are set for life",
        "Nation? I would say the world tbh",
        "Nope, it gets worse, apparently the father had tried to sell their 7 yr old daughter previously but the deal fell through. Basically a couple of addicts, switch the idea of phone/reel with drugs and it makes sense.",
        "Dhoni ko tribute bhi dena padega",
        "Reels is not the problem, people doing stupid stuff on reels/for reels is the problem",
        "OP Please google the word endemic",
        "One word natural selection, now only people can see these easily.",
        "Natural selection.",
        "Yes, people were doing such things earlier, but they were not trying to imitate others on such a large scale which is made possible by these platforms. People do things without knowing the risks involved in it. 'Blue whale' wouldn't have spread earlier. So these platforms should take measures to stop such things.",
        "No, the beti bech aur ameer ho meme just got revivee",
        "Same vibe as \"guns don't kill people, people kill people\"",
        "Natural selection",
        "I’m sorry but the selling 8 year old one is funny xD",
        "Eighth word : Retards.",
        "Darwin must be proud",
        "Natural selection",
        "Ninth word: Depression",
        "On the one hand, you feel bad that young people are needlessly getting hurt/dying. On the other, you toast Darwin and move on",
        "Tenth word: india",
        "https://preview.redd.it/94wi2p0repeb1.jpeg?width=1280&format=pjpg&auto=webp&s=b7ae40902541fa76e530a192dd80dafd02232cf6",
        "Social media validation is all many seek. Psychology says this is communicable.",
        "This is my favourite. I was checking in the comment if someone has already said it. I see all this as dumb guy leaving the world to make it a better place. RIP all those who died. You all made a great example for all the other who would follow. \n\n&#x200B;\n\nNow, before anyone starts getting angry, I am just joking. (unless I am not)",
        "Social media, smartphones, and internet— the poisoned chalice being easily available to everyone nowadays is the catalyst. Narcissism is the reason. People want quick self gratification, and they will do anything for it. As a result, some end up being total nuisance to others and rarely (if ever) learn the lesson, some, unfortunately learn it in the most expensive way possible. \n\nAs long as technology keeps catering to people’s narcissism, this will go on.",
        "\"Insta-death\"",
        "yep. before reels it was selfies",
        "This feels like r/2asia4u",
        "r/darwinawards",
        "It did, then reels came along.",
        "Such degenerates don't even deserve to live",
        "Eleventh word: Cccombo Brrreaker",
        "Natural selection at it’s peak",
        "What even was blue whale",
        "Kya hai ye? Fr??",
        "Yep. That is how it works and I understood it years ago. \nWhenever I sign up on any social media, I curately search for things I like. My social media is full of fitness, anatomy, physiotherapy, dermatology, experiements and pranks stuff.\nI don't even see a single political or religious content anymore from any country at all unless I specifically search for it which I only do like once a month, so not enough for algorithms to start throwing me that kind of content.\n\nTrust me life is easier atleast when I'm on the phone that way",
        "Ek do baari videos dekhi h uski. Bhot bolta h bhai woh. Aisa kya kia usne ki tikok gira dia?",
        "Eleventh word : China",
        "God is improvising, As modern science is capable of making vaccine and cure for complex viruses and diseases but not for reels and tiktok kind of crap.",
        "As long as these brainless idiots bring harm to themselves, it is all fine. But in the process, if an innocent gets hurt or dies (a news above), then fck these idiots and they should be tried under sections of murder (i.e. if they are alive after doing those stunts)",
        "The bigger issue is that you are wasting an incredible amount of time scrolling through this shit. Social media causes issues but it's not magic. Stuff like this has always happened, you're just being bombarded by it instead of more important matters",
        "Natural Selection",
        "People were being stupid before the reels and internet too. Reels has given people an additional reason to be stupid and internet has given us access to their stupidity.",
        "Eleventh word: Free Internet",
        "Jio was a mistake",
        "They picked insta reels over their child!?!?!",
        "Social media is one of the worst things that has happened to humans.",
        "No. just no. this is a tale old as time. yall think that our anestors did not do stupid shit just for shits and giggles? what is really telling is that it is National news when someone falls",
        "Darwin Award Candidates.",
        "https://theprint.in/opinion/how-instagram-reels-is-a-mirror-to-modern-casteism-in-india/639955/?amp\n\n\nIt's making you feel down because many commoners have migrated from tiktok to reels.\n\nThis is nothing but elitism",
        "To be considered unemployed you need to be looking for a job but can’t find one. I don’t think these people are even looking",
        "Natural selection",
        "Twelvth Word: Moh Maya",
        "You call that nuisance , I call that natural selection.",
        "Fourteenth word: common sense",
        "Natural selection",
        "Never been on any social media except Twitter and Reddit; this Insta thing always scared the shit out of me 🥲",
        "All thanks to those youtube videos “Ghar baithe kamaye laakho sirf reels/shorts se” plus the dirt cheap internet.",
        "Lol “don’t blame the guns, blame the people”\n\nForget that Instagram SHOULD be blamed for dark patterns",
        "Hiw the f do you sell a baby? Sarojini mai to nahi hota and it has nearly everything.",
        "Its two words",
        "Banaya tha ek video, woh takedown hogya lekin fir bhi mil jayega. Uska latest wala jarur dekhna, accha banaya hai.",
        "I think words 5-8 sums it up perfectly"
    ],
    "cleaned_text": "instagram reels become nuisance started silent endemic nation going never ever thought every morning wake read news death crime motive instagram reels video woman getting swept away mumbai children filming couple karnataka video getting viral yesterday bizarre west bengal couple taken shape endemic even going ",
    "cleaned_title": "instagram reels become nuisance started silent endemic nation going",
    "cleaned_selftext": "never ever thought every morning wake read news death crime motive instagram reels video woman getting swept away mumbai children filming couple karnataka video getting viral yesterday bizarre west bengal couple taken shape endemic even going",
    "cleaned_comments": "one word validation one less idiot worry oh yeah ofc yaar matlab validation life oh god one ab toh number roz bad jaata hain classic case darwin award natural selection badte jae aur ye reelers nuisance society anyone watches joeybtoonz yt takes tiktoker reelers striked yt many times need someone yt making fun till realize embarrassing thats basically human nature desire popular liked others earlier used local area due internet way larger second word unemployment reels better population control condoms idiots stupid things dying ages smartphones people still died stupid stunts kicks instagram made sure hear earlier someone slipped waterfall died himalayas someone living kerala wont hear news vice versa deaths captured phone going viral online plus hour negative news cycle makes whole thing widely known india reels rest world tiktok gates open theres going back except passerby died bike stunt biker alive hanged bruh even happening reel shit coming great cost nation yes sometimes embarrassing times see people shoot reels like pulling dangerous stuff entertain seek validation thats really messed third word stupid thats moment ban service nation wide reason called instagram influenzas darwin theory natural selection people selling kids iphone moved selling kidney jokes sells baby phone like damn instagram run even trash phones needed excuse sell baby thats ye waterfall wale ka video dekha mai rdarwinawards call version survivorship bias steroids due easily makeget news days instuenza buying baby darwin award winners right folks insta fucked pristine places great places bein trash dumps days sabko happening life jeena hai pata nahi kyun maybe media houses trying ban instagram india whole yt community made fun tiktokers longnothing happened google child trafficking n imagine mfs invited open shops like unnecessary glam dumbasses iphone one thing bias way news served click article youll get similar articles reels become endemic considering sample size data google feeds unbiased thing influence natural selection joeybtoonz thats natural selection work thats mother nature removes dumb genes genepool third word cloutfame insta better place reels introduced also technically one word dont use instagram came say apps enforcing law natural selection great vox video exact coordinates terrible unknown places darwin awards removed knee generation wants video creator software civil engineer famous valuable intelligent times changing want liked people dont know rather liked people know welcome youth apocalypse bruh youre writing comment validation right otherwise youd keep thoughts mind validation applicable generic answer many questions natural selection people starved attention validation half time called reels look lame zoom zoom shaking effect reason correction dont blame app blame dumbfuckery people course whats life need likes comments holy hell else gon na control population wise man said matrix trying control mind trying make weak taking control fourth word darwin problem could endanger others due stupid bike car stunts thing used selfies smartphones became accessible zeroth word dopamine addiction sometimes wonder news even real mean tf sells month old kid phone us writing comments reddit validation well see upvotes replies others get attention etc things validation clout one helluva drug oh well beginning blackmirror nosedive pretty addicted reels im glad understood early left platform good person must maniac heshe get money showing kids personal life youtube generational decay thats going real endemic started everyone given access cheap fast internet starting witness effects nope defination validation used wrong natural selection fifth word chutiyapa let darwins theory work good revised natural selection people zero survival instinct hunger clout deserve stupid people stupid shit instagram nothing validation platform others dont even know know natural selection tiktok garbage move instagram youtube shorts could start petition ban instagram reels youtube shortsfeature maybe yup thats human psychology works even choose anonymous usernames slight validation even reddit upvotes give sort validation instant gratification social media chose first username showed human well iphone prices increased darwin awards recipients hope atleast kill without affecting anyone else write comment validate thoughts others see others think natural selection par uske liye toh pahle iit clear karke piolet banna padega im simply saying even becomes factor hunting validation protocol rule content creators well since publishinguploading comments getting upvotes views replies content small scale anonymous view micro pov every object around seems claim life thing happened instagram selfies becoming popular thing also happened pokemon go released problem idiots technology wish everyone could get reference haha carryminati ka naam suna hai pura tiktok gira diya bhai ne akele ab woh wise man jail hai chutyo ka example mat de reels going destroy entire generation india cant lose people thing india auntie culture love gossip love filling minds low quality information something gossip aunties reels fit perfectly bad info fake news incomplete stories gossip pretend worldly always get new one compilation news need give man fish feed day sixth word loda lassun kind thing bound happen repeat us amnesia lest forget pandemic selfies selfies became thing first time similar reports deathsaccidents clicking daring different selfies shit happened tiktok indian government banned death accidents youtube came shorts ig reels taken people anything flow trend game even means meal puke shit pee drink choice anyone please joke natural selection seventh word idiots teach man fuck iphone needs set life nation would say world tbh nope gets worse apparently father tried sell yr old daughter previously deal fell basically couple addicts switch idea phonereel drugs makes sense dhoni ko tribute bhi dena padega reels problem people stupid stuff reelsfor reels problem op please google word endemic one word natural selection people see easily natural selection yes people things earlier trying imitate others large scale made possible platforms people things without knowing risks involved blue whale wouldnt spread earlier platforms take measures stop things beti bech aur ameer ho meme got revivee vibe guns dont kill people people kill people natural selection im sorry selling year old one funny xd eighth word retards darwin must proud natural selection ninth word depression one hand feel bad young people needlessly getting hurtdying toast darwin move tenth word india social media validation many seek psychology says communicable favourite checking comment someone already said see dumb guy leaving world make better place rip died made great example would follow xb anyone starts getting angry joking unless social media smartphones internet poisoned chalice easily available everyone nowadays catalyst narcissism reason people want quick self gratification anything result end total nuisance others rarely ever learn lesson unfortunately learn expensive way possible long technology keeps catering peoples narcissism go instadeath yep reels selfies feels like rasiau rdarwinawards reels came along degenerates dont even deserve live eleventh word cccombo brrreaker natural selection peak even blue whale kya hai ye fr yep works understood years ago whenever sign social media curately search things like social media full fitness anatomy physiotherapy dermatology experiements pranks stuff dont even see single political religious content anymore country unless specifically search like month enough algorithms start throwing kind content trust life easier atleast im phone way ek baari videos dekhi h uski bhot bolta h bhai woh aisa kya kia usne ki tikok gira dia eleventh word china god improvising modern science capable making vaccine cure complex viruses diseases reels tiktok kind crap long brainless idiots bring harm fine process innocent gets hurt dies news fck idiots tried sections murder ie alive stunts bigger issue wasting incredible amount time scrolling shit social media causes issues magic stuff like always happened youre bombarded instead important matters natural selection people stupid reels internet reels given people additional reason stupid internet given us access stupidity eleventh word free internet jio mistake picked insta reels child social media one worst things happened humans tale old time yall think anestors stupid shit shits giggles really telling national news someone falls darwin award candidates making feel many commoners migrated tiktok reels nothing elitism considered unemployed need looking job cant find one dont think people even looking natural selection twelvth word moh maya call nuisance call natural selection fourteenth word common sense natural selection never social media except twitter reddit insta thing always scared shit thanks youtube videos ghar baithe kamaye laakho sirf reelsshorts se plus dirt cheap internet lol dont blame guns blame people forget instagram blamed dark patterns hiw f sell baby sarojini mai nahi hota nearly everything two words banaya tha ek video woh takedown hogya lekin fir bhi mil jayega uska latest wala jarur dekhna accha banaya hai think words sums perfectly",
    "light_cleaned_title": "Instagram reels have become a nuisance and started a silent endemic in this nation. What is going on?",
    "light_cleaned_selftext": "Never have I ever thought that every morning I will wake up and read the news of a death or a crime, with the motive being Instagram reels?! There was this video of a woman getting swept away in Mumbai while her children were filming the couple. Now this Karnataka video is getting viral. Then yesterday, there was this bizarre West Bengal couple. This is taken the shape of an endemic. What is even going on?",
    "light_cleaned_comments": "One word. Validation. One less idiot to worry about. /s Oh yeah. Ofc. But yaar matlab validation>>>> life. Oh God. One? Ab toh number roz bad jaata hain. Classic case of Darwin Award. Natural selection /s Badte jae aur, ye reelers are nuisance to the society /s Anyone watches JoeyBToonz on YT? He takes on Tiktoker & Reelers. He has been striked by YT many times. We need someone on YT making fun of them till they realize that it’s embarrassing. Thats basically human nature. The desire to be popular, liked by others. Earlier it used to just be your local area. Now due to the internet, its way larger. Second word. Unemployment. Reels better at population control than condoms.🫡 Idiots have been doing stupid things and dying for ages. Before there were smartphones, people still died doing stupid stunts just for kicks. Instagram has just made sure we hear about it. Earlier, if someone slipped in a waterfall and died in the Himalayas, then someone living in Kerala won't hear the news and vice versa. Now, with these deaths being captured on phone and going viral online, plus with the 24 hour negative news cycle, it just makes the whole thing more widely known. For india it's reels, for the rest of the world it's tiktok. The gates are open, there's no going back. Except for the passerby who died because of the bike stunt. That biker, if alive, should be hanged. Bruh what is even happening, this reel shit is coming at a great cost to our nation 🤦. Yes sometimes it's embarrassing at times to see people shoot reels like this but pulling off dangerous stuff to entertain or seek validation now that's really messed up third word stupid That's the moment you ban the service nation wide. There is a reason they are called Instagram Influenzas. Darwin theory of natural selection People are now selling kids for an iPhone!! So we have moved on from selling kidney jokes? Who sells their baby for a phone!? Like damn! Instagram can be run even in trash phones 💀 they just needed an excuse to sell their baby that's what Ye waterfall wale ka video dekha mai at r/darwinawards This! Call it a version of survivorship bias on steroids due to how easily it is to make/get news these days. Instuenza Who is buying the baby 👶 🤔 Darwin Award winners right here, folks. Insta has fucked up pristine places too. From being great places to bein trash dumps in under 3 days. Sabko Happening life jeena hai. Pata nahi kyun. Maybe these media houses are trying to ban instagram in India. Whole yt community made fun of tiktokers for so long,nothing happened google child trafficking N imagine some of these mfs are invited to open shops and like that, Unnecessary glam to dumbasses That too for an iPhone 8 One more thing. There is a bias in the way news is served to you. The more you click on an article, the more you’ll get similar articles. Reels has become an endemic. But considering your sample size and the data that google feeds you is not unbiased. \"Only thing they influence is natural selection\" -- JoeyBToonz That's natural selection at work. That's how mother nature removes dumb genes from the genepool. Third word. Clout/fame Insta was a better place before reels were introduced. It's also technically one word This is why I don't use instagram Came to say this.. these apps are enforcing the law of natural selection There was a great Vox video about it. Having the exact co-ordinates is terrible for unknown places. Darwin Awards They just removed the knee its because we are a generation who wants to be a video creator not software or civil engineer being famous is more valuable than being intelligent times are changing we want to be liked by people we don't know rather than liked by people we know welcome to youth apocalypse Bruh, you're writing this comment itself for validation, right? Otherwise, you'd keep your thoughts in your mind. Validation is an applicable generic answer for too many questions. And that is NATURAL SELECTION. People are so starved for attention, validation & half the time those so called \"reels\" just look lame with zoom in zoom out, shaking effect for no reason. Correction: don't blame the app, blame the dumbfuckery of people. Off course…. What’s will we do with “life”, We just need likes and comments…. Holy hell How else you gonna control the population? Once a wise man said \" The matrix is trying to control your mind. It's trying to make you weak. Taking control off of yourself\". Fourth word. Darwin. What? Only problem is that it could endanger others due to stupid bike, car stunts The thing used to be the same with selfies when smartphones became accessible. Zeroth word: Dopamine addiction. I sometimes wonder Are news is even real? I mean WHO TF!! SELLS THEIR 8 MONTH OLD KID FOR AN I PHONE!!!!!! Us writing comments on reddit is for 'validation' as well. So we can see the upvotes, replies from others, get some attention, etc. Most things we do is for validation clout is one helluva drug Oh well, this is the beginning of Blackmirror: Nosedive. I was pretty addicted to reels, I'm glad I understood early and left the platform for good. The person must be a maniac. He/she can get more money by showing kids personal life in YouTube. It's generational decay that's going on. The real endemic started when everyone was given access to cheap and fast internet. We're just starting to witness the effects. Nope, defination of validation being used by you is wrong. natural selection fifth word. chutiyapa Just let Darwin's theory do its work ... Good. Revised natural selection. People with zero survival instinct and a hunger for clout deserve this Stupid people do stupid shit, Instagram has nothing to do with it. Validation on a platform where others don't even know who I am, nor do I know who they are? Natural selection Tiktok garbage has move on to Instagram and YouTube shorts. If we could start a petition to ban Instagram reels and YouTube shorts(feature) maybe it will do. Yup. That's how human psychology works. We even choose our anonymous usernames for a slight validation. Even reddit upvotes give the sort of same validation and instant gratification as any other social media. I chose the first username they showed. Am I not human? well iphone prices are increased /s Darwin awards recipients. Hope that atleast they kill only themselves without affecting anyone else. When we write a comment, we are doing it to validate our thoughts with others and see what others think about it. Natural selection Par uske liye toh pahle IIT clear karke piolet banna padega I'm simply saying even that becomes a factor of hunting validation. It's not a protocol or rule. We are content creators as well since we are publishing/uploading our comments, getting upvotes, views, replies. Just that our content is on a very small scale and anonymous. If you view from such a micro pov. Then every object around you seems to claim a life. Same thing happened when instagram selfies were becoming popular and the same thing also happened when Pokemon Go was released. The problem is the idiots not the technology. I wish everyone could get this reference haha. CarryMinati ka naam suna hai? Pura tiktok gira diya bhai ne akele. Ab woh wise man jail me hai. Chutyo ka example mat de. Reels are going to destroy an entire generation and India can't lose any more people. The thing is India has the auntie culture where they love gossip and love filling their minds with low quality information to have something to gossip about with other aunties. So reels will fit perfectly here. Bad info, fake news, incomplete stories to gossip about and pretend to be worldly. they can always get new one /s Not the compilation of news we need but... \"Give a man a fish, and you feed him for a day...\" Sixth word. Loda Lassun This kind of thing is bound to happen and repeat. Most of us have amnesia, lest we forget the pandemic of selfies. When selfies became a thing for the first time, there were similar reports of deaths/accidents in clicking the most daring and different selfies. The same shit happened with TikTok, which the Indian Government banned. Death and accidents. Then YouTube came up with shorts, and IG reels have taken over too. People will do anything to flow with the trend and up the game, even if it means having a meal of your puke and shit with pee as the drink of choice. And before anyone does this, please do not do this, this is a joke. Natural selection Seventh word: idiots Teach a man to fuck and his iPhone needs are set for life Nation? I would say the world tbh Nope, it gets worse, apparently the father had tried to sell their 7 yr old daughter previously but the deal fell through. Basically a couple of addicts, switch the idea of phone/reel with drugs and it makes sense. Dhoni ko tribute bhi dena padega Reels is not the problem, people doing stupid stuff on reels/for reels is the problem OP Please google the word endemic One word natural selection, now only people can see these easily. Natural selection. Yes, people were doing such things earlier, but they were not trying to imitate others on such a large scale which is made possible by these platforms. People do things without knowing the risks involved in it. 'Blue whale' wouldn't have spread earlier. So these platforms should take measures to stop such things. No, the beti bech aur ameer ho meme just got revivee Same vibe as \"guns don't kill people, people kill people\" Natural selection I’m sorry but the selling 8 year old one is funny xD Eighth word : Retards. Darwin must be proud Natural selection Ninth word: Depression On the one hand, you feel bad that young people are needlessly getting hurt/dying. On the other, you toast Darwin and move on Tenth word: india Social media validation is all many seek. Psychology says this is communicable. This is my favourite. I was checking in the comment if someone has already said it. I see all this as dumb guy leaving the world to make it a better place. RIP all those who died. You all made a great example for all the other who would follow. &#x200B; Now, before anyone starts getting angry, I am just joking. (unless I am not) Social media, smartphones, and internet— the poisoned chalice being easily available to everyone nowadays is the catalyst. Narcissism is the reason. People want quick self gratification, and they will do anything for it. As a result, some end up being total nuisance to others and rarely (if ever) learn the lesson, some, unfortunately learn it in the most expensive way possible. As long as technology keeps catering to people’s narcissism, this will go on. \"Insta-death\" yep. before reels it was selfies This feels like r/2asia4u r/darwinawards It did, then reels came along. Such degenerates don't even deserve to live Eleventh word: Cccombo Brrreaker Natural selection at it’s peak What even was blue whale Kya hai ye? Fr?? Yep. That is how it works and I understood it years ago. Whenever I sign up on any social media, I curately search for things I like. My social media is full of fitness, anatomy, physiotherapy, dermatology, experiements and pranks stuff. I don't even see a single political or religious content anymore from any country at all unless I specifically search for it which I only do like once a month, so not enough for algorithms to start throwing me that kind of content. Trust me life is easier atleast when I'm on the phone that way Ek do baari videos dekhi h uski. Bhot bolta h bhai woh. Aisa kya kia usne ki tikok gira dia? Eleventh word : China God is improvising, As modern science is capable of making vaccine and cure for complex viruses and diseases but not for reels and tiktok kind of crap. As long as these brainless idiots bring harm to themselves, it is all fine. But in the process, if an innocent gets hurt or dies (a news above), then fck these idiots and they should be tried under sections of murder (i.e. if they are alive after doing those stunts) The bigger issue is that you are wasting an incredible amount of time scrolling through this shit. Social media causes issues but it's not magic. Stuff like this has always happened, you're just being bombarded by it instead of more important matters Natural Selection People were being stupid before the reels and internet too. Reels has given people an additional reason to be stupid and internet has given us access to their stupidity. Eleventh word: Free Internet Jio was a mistake They picked insta reels over their child!?!?! Social media is one of the worst things that has happened to humans. No. just no. this is a tale old as time. yall think that our anestors did not do stupid shit just for shits and giggles? what is really telling is that it is National news when someone falls Darwin Award Candidates. It's making you feel down because many commoners have migrated from tiktok to reels. This is nothing but elitism To be considered unemployed you need to be looking for a job but can’t find one. I don’t think these people are even looking Natural selection Twelvth Word: Moh Maya You call that nuisance , I call that natural selection. Fourteenth word: common sense Natural selection Never been on any social media except Twitter and Reddit; this Insta thing always scared the shit out of me 🥲 All thanks to those youtube videos “Ghar baithe kamaye laakho sirf reels/shorts se” plus the dirt cheap internet. Lol “don’t blame the guns, blame the people” Forget that Instagram SHOULD be blamed for dark patterns Hiw the f do you sell a baby? Sarojini mai to nahi hota and it has nearly everything. Its two words Banaya tha ek video, woh takedown hogya lekin fir bhi mil jayega. Uska latest wala jarur dekhna, accha banaya hai. I think words 5-8 sums it up perfectly"
}