{
    "id": "15cox5g",
    "title": "Balaji - Two gods with the same name?",
    "url": "https://www.reddit.com/r/india/comments/15cox5g/balaji_two_gods_with_the_same_name/",
    "selftext": "I have long realized that Hindu gods and godesses have different names in different parts of the country, but the other day I was bowled over when a cousin said he was going to *Mehandipur Balaji Temple* for Hanuman. \n\nI had always thought Balaji was synonymous with Venkateswara (and even [Wikipedia concurs](https://en.wikipedia.org/wiki/Venkateswara) )- \"The deity is referred to as 'Balaji' by north Indians.\" Balaji also happens to be a common first name for boys/men in the South. \n\nAnd then there is Balaji in the form of 'Bala' Hanuman. \n\nWonder if there are other similar gods and goddesses' names I am not aware of?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690626470.0,
    "convurl": "https://external-preview.redd.it/w2lDHUzce_xL8X_O6gBfmNiPDR14rMIdFApW0BDq6Xk.jpg?auto=webp&s=7c6b22100e0446eba571e8c73aaba7886ba310d6",
    "comments": [
        "I wonder what Balaji chips are named after?",
        "The founder's favorite grandson named Balaji ;-)"
    ],
    "cleaned_text": "balaji two gods name long realized hindu gods godesses different names different parts country day bowled cousin said going mehandipur balaji temple hanuman always thought balaji synonymous venkateswara even wikipedia concurshttpsenwikipediaorgwikivenkateswara deity referred balaji north indians balaji also happens common first name boysmen south balaji form bala hanuman wonder similar gods goddesses names aware ",
    "cleaned_title": "balaji two gods name",
    "cleaned_selftext": "long realized hindu gods godesses different names different parts country day bowled cousin said going mehandipur balaji temple hanuman always thought balaji synonymous venkateswara even wikipedia concurshttpsenwikipediaorgwikivenkateswara deity referred balaji north indians balaji also happens common first name boysmen south balaji form bala hanuman wonder similar gods goddesses names aware",
    "cleaned_comments": "wonder balaji chips named founders favorite grandson named balaji",
    "light_cleaned_title": "Balaji - Two gods with the same name?",
    "light_cleaned_selftext": "I have long realized that Hindu gods and godesses have different names in different parts of the country, but the other day I was bowled over when a cousin said he was going to *Mehandipur Balaji Temple* for Hanuman. I had always thought Balaji was synonymous with Venkateswara (and even [Wikipedia concurs](https://en.wikipedia.org/wiki/Venkateswara) )- \"The deity is referred to as 'Balaji' by north Indians.\" Balaji also happens to be a common first name for boys/men in the South. And then there is Balaji in the form of 'Bala' Hanuman. Wonder if there are other similar gods and goddesses' names I am not aware of?",
    "light_cleaned_comments": "I wonder what Balaji chips are named after? The founder's favorite grandson named Balaji ;-)"
}