{
    "id": "gc7b69",
    "title": "Aarogya Setu : 45 organizations and more than 100 prominent individuals push back against the coercion",
    "url": "https://www.reddit.com/r/india/comments/gc7b69/aarogya_setu_45_organizations_and_more_than_100/",
    "selftext": "### \n\n[Aarogya Setu : 45 organizations and more than 100 prominent individuals push back against the coercion](https://preview.redd.it/wxbtlsgq2dw41.png?width=795&amp;format=png&amp;auto=webp&amp;s=22adb4fb68a1d632655b5fc954e91a3284a0d0c2)\n\n[**Help IFF fight mass surveillance. Fund our work**](https://internetfreedom.in/donate/)**!**\n\n### Tl;dr\n\nToday, we sent a[ joint representation](https://drive.google.com/file/d/1ELi-Q9FG-eapNFEzVeuJqTROFFrUflT3/view?usp=sharing) to the Prime Minister's Office that is endorsed by 45 organisations and more than 100 individuals against the mandatory use of the Aarogya Setu App dated May 1, 2020. This joint representation becomes all the more urgent given yesterday's [direction by the Home Ministry](https://drive.google.com/file/d/1wXzfI9uPv0Qr4YZBKXwk_1Z1M2skYfzl/view?usp=sharing) for the mandatory use of Aarogya Setu and for it's \"100% coverage\" especially in all workplaces. Violation of this direction can lead to criminal penalties thereby Aarogya Setu now not only impacts the data privacy of workers, or can lead to risks of exclusion and misidentification, a person not having it on their phone can also be charged with a criminal offence. This marks a dramatic and clear shift in government policy on Aarogya Setu from, \"encouragement\" towards coercion and increases the legitimacy of the demands articulated by the joint representation.\n\n### A joint representation co-signed by 45 organisations and more than 100 people\n\nIn [yesterday's post](https://internetfreedom.in/workers-privacy-during-covid-19/) we released a joint representation signed by 37 organisations and 75 individuals against mandating the use of the Aarogya Setu on workers. After we opened it for further sign-ons this number has grown to 45 organisations and more than 100 individuals who have expressed solidarity against the mandatory imposition of Aarogya Setu on workers. The endorsements are from a broad swathe of Indian society including trade unions, people's movements, digital rights organizations, public health experts, former civil servants and bureaucrats, activists, academics, technologists, journalists, lawyers etc. \n\nA copy of the [joint representation](https://drive.google.com/open?id=1ELi-Q9FG-eapNFEzVeuJqTROFFrUflT3) was sent today with a covering letter to the Prime Minister's Office with a copy to Ministry of Home Affairs and other central government ministries. \n\nTo this we attached [a covering letter](https://drive.google.com/file/d/1RR3tBnJCSkQvSDp0uVcMQr6C2RILgqg4/view?usp=sharing) dated May 2, 2020 which further notes with concern yesterday evening's development of the issuance of Order No 40-3/2020-DM-I(A) has been issued on May 1, 2020 around 6:00 PM by the Ministry of Home Affairs requiring mandatory installation of Aarogya Setu. This goes against the core demands of the joint representation which is attached to this covering letter. \n\n### Aarogya Setu : Not only mandatory but also criminal penalties\n\nThe Order No 40-3/2020-DM-I(A), which has been issued under Section 10(2)(I) of the Disaster Management Act, 2005 mandates for the mandatory installation and operation of Aarogya Setu in two specific ways:\n\n1. First, after classification of the districts into three zones, for the Red (Hotspots) Zones, a further sub-classification has been made for, “*containment zones*”. As per the Order under Section 3(iii), “*The local authority shall ensure 100% coverage of Aarogya Setu app among the residents of Containment Zones*”.\n2. Second, at Para 15(i) further reference is made for, “*all the district magistrates*” to, “*strictly enforce the lockdown measures*” for, “*public and workplaces, as specified in Annexure I*”. This direction extends to all three zones. Annexure I further states at Point No. 15 that, “*Use of Aarogya Setu app shall be made mandatory for all employees, both private and public. It shall be responsibility of the Head of the respective Organisations to ensure 100% coverage of this app among employees*”.\n\nPresently here are no exceptions or conditionality provided in these directions which place emphasis on 100% coverage in effect meaning total and complete mandatory installation of Aarogya Setu for all workers, all across the country. The order further indicates criminal penalties for non-compliance in Paragraph No. 16 that states, “*Any person violating these lockdown measures and the National Directives for Covid-19 Management will be liable to be proceeded against as per the provision of Section 51 to 60 of the Disaster Management Act, 2005, besides legal action under Section 188 of the IPC and other legal provisions as applicable*”. The specific provision that may be attracted for prosecution under the Disaster Management Act, 2005 is Section 51(b) that provides for a maximum punishment of up to 1 year for disobedience, and 2 years when such actions may lead to a loss of life. The penalty for conviction under Section 188 of the IPC extends to 6 months imprisonment.\n\nHence, the mandatory imposition of Aarogya Setu is not only an issue of data privacy but second order harms which spring from it now includes loss of urban mobility, use of public spaces and transit, livelihood and personal liberty for millions of Indians all over India. Specially those without smartphones devices given the lack of any exemption categories. \n\n### Intention for further action\n\nWe at IFF in continuation of this Joint Representation dated May 1, 2020 and through this covering letter have requested specific review of Order No 40-3/2020-DM-I(A) and will also be shortly reaching out to each one of the co-signees and collaborators urging them to send individual letters of concern as much as examine further advocacy actions against this grave breach.\n\nWe also remain open to any suggestions and advice on what we can do better, or different not only through our collaborators, but even members of the public. We invite you to write to us, or discuss these issues over at the [Internet Freedom Forum](https://forum.internetfreedom.in/).\n\nAs stated before we at IFF will continue conducting public advocacy, awareness especially through digital media as well as continue to engage pro-actively with all government institutions on the issues concerning Aarogya Setu. This includes representations, RTI requests as well as other legal remedies which may be examined at an appropriate stage in consultation with IFF's legal team and several lawyers who continue to volunteer thier time and labour towards protecting fundamental rights. \n\nWe remain committed working with more organisations and individuals to broaden the scope and improve the impact of interventions around Aarogya Setu. Please do feel free to reach out to us. \n\n### Important Documents\n\n1. Finalized Joint Representation dated 01.05.2020 sent to the Government with the list of signatories ([link](https://drive.google.com/file/d/1ELi-Q9FG-eapNFEzVeuJqTROFFrUflT3/view?usp=sharing))\n2. Covering letter dated dated 02.05.2020 sent to the Government ([link](https://drive.google.com/file/d/1RR3tBnJCSkQvSDp0uVcMQr6C2RILgqg4/view?usp=sharing))\n3. Public call for endorsements on May Day against the mandatory imposition of Aarogya Setu ([link](https://internetfreedom.in/workers-privacy-during-covid-19/))\n4. Comparative Analysis of Aarogya Setu ([link](https://internetfreedom.in/is-aarogya-setu-privacy-first-nope-but-it-could-be-if-the-government-wanted/))\n5. Working Paper on Privacy Concerns on Technological Responses to COVID-19 in India ([link](https://internetfreedom.in/a-comprehensive-look-at-covid-surveillance-and-privacy-in-india/))",
    "flair": "Policy/Economy",
    "score": 1268,
    "num_comments": 221,
    "created_utc": 1588429535,
    "convurl": "https://b.thumbs.redditmedia.com/xWsdT2Uth4xP91iHd5iKBni7M3QcapBvi_rrhq7w4ik.jpg",
    "comments": [
        "Good work! Those who haven't, [should check out their forum](https://forum.internetfreedom.in/) where you can have discourse on this and similar Internet/Tech issues in the country with likeminded people.",
        "Thank you! It’s more a community development space where we envision that IFF Staff can chat with our supporters and volunteers. This will help us remain accountable, honest but also effective. Many great ideas come from the wider public sphere through collectives.",
        "But without setu we are sitting ducks /s. How can India protect itself without invasive contact tracing?",
        "1/ There is growing dispute on the utility of contact tracing by itself. Especially when it is not integrated and placed within a public health strategy. As per RTI responses received by us the Ministry of Health has no role and neither is consulted on Aarogya Setu. \n\n2/ Contact tracing can be done while maintaining privacy protections and also ensuring there is no mission/scope creep. This is through placing clear legal limits. At present this does not exist (the privacy policy is a one sided, unenforceable contract that can be changed at any time). \n\nWe have made about 14 recommendations in our working paper specifically on Aarogya Setu. I encourage you to take some time on Sunday (it's quite long) and go through it!",
        "why aren't you guys pushing for open source of it?\n\nSince it could be a useful tool for sure, just open source it so that tech folks can audit it and give us facts. **not opinions** !",
        "We have been advocating this since the start of our public advocacy.\n\n1. Quoting from [our analysis of the App](https://internetfreedom.in/is-aarogya-setu-privacy-first-nope-but-it-could-be-if-the-government-wanted/) : \"The only information we have of the app is its frontend and its rather  pedestrian Terms of Service (TOS) and Privacy Policy. Other projects  release as much information as possible in pursuit of transparency. This  may include an accompanying manifesto, technical specifications,  general FAQs, and even its source code.\"\n2. The [working paper](https://internetfreedom.in/a-comprehensive-look-at-covid-surveillance-and-privacy-in-india/) has about 14 recommendations for government. For instance making it open source without having legal limits on its intended use will keep it open to function creep.\n\nBoth these links are in the post above.",
        "I have been living under a rock. Is it illegal to not install the app?",
        "Yes, \n\n1/ if you are in a containment zone. \n\n2/ if you have to go to work. \n\nIf you don't you run the risk of going to jail. As an employee and an employer. Longer explanation in the post above.",
        "Awesome. Again I appreciate your efforts but usually keeping the message simple just like supreme leader helps to reach the mass. \nIt's a simple message - \"Government has nothing to hide. So let's ask them o open source and be transparent'. \n\nNow thag message can potentially go to the masses vs sophisticated tech terms which me and u can comprehend. \n\nLet's learn from the supreme leader. Keep the message simple and stupid. Am sure we will get lot more people educated thag way.",
        "Sorry to be blunt, but most of the signatories are activists/artists/political groups which have little understanding of technology - whether it is software or epidemiology. \n\nThese guys cannot be considered legimate authority on this issue.\n\nIn the quest to get larger number of signatories, every tom-dick-and-harry has had a go.",
        "Appears so. Although I have no Idea how it does not breach any fundamental rights",
        "Thank you for the work that has gone into this.\nBut to be honest, are you hopeful the govt. will even take these points into consideration?\n\nI know this isn't the first instance where you have stepped up but I'm not sure how your past experiences have been and whether we can hope to get even a \"we'll think about it\" response.",
        "Excellent work. If it was not for groups like yours we would have lost our privacy a couple of years back.",
        "Well, it's not modi's decision. Is it ? \nThere are people who work above the likes of modi sort of in all countries who have real power. One who controls everything.\nSimilar things does happen in every country.",
        "Thanks! We have limited resources to implement graphics and video which are usually effective ways of reaching more people but are putting more of them towards it as we receive support. You can check out our instagram for more direct messaging. [https://www.instagram.com/p/B-9vMbNJToe/](https://www.instagram.com/p/B-9vMbNJToe/)",
        "1/ We have to work in good faith but with caution. IFF always engages with government in the hope that they reciprocate. While realistic assessment is that they might now., we step up on an escalation matrix. \n\n2/ Our past interventions on disclosure of the vaahan database, disclosure of lists of persons in quarantine and the social media communication hub have been public victories in recent times. This has been not our individual effort but through alliances and collectives. There are many more private victories. \n\n3/ The nature of all our work is towards medium to long term change. We are receiving greater support and our community is growing (based on raw metrics of website visits, social media engagement and growth in organic, grassroots donors). Today we need to accelerate this and that is a challenge. All of us hope we keep receiving your support which is essential in times like this.",
        "Thank you, its really motivating to hear these words.",
        "1/ We first reached out to labor unions and made the demand list in Hindi (linked in our previous blogpost). This was followed up by active inputs by one union which even gave us suggestions. \n\n2/ The joint representation is on the basis of a larger working paper that is developed over a period of time. That was also sent to these organizations. Many of them come from the grassroots and understand the risks of exclusion due to technology due to felt experience. \n\n3/ The signatories in the organizations include digital rights groups. We also to be frank find your comment on activists to be generalized and unfair. It disparages their work and experience. \n\n4/ The list of individuals includes former civil servants including those which served at high positions including at the Ministry of Electronics and IT.",
        "Open sourcing client doesnt matter. It's the data on the servers that's going to be misused.",
        "Data has become an important source for governments. The more personal information they can get, the better strategies they can put up for the elections.  \nFor eg (even though it’s irrelevant): Cambridge Analytica. It was a medium to push propaganda. \n\nThank you so much. Our country is lacking very important and essential data protection bill. Organisation like IFF help us a lot.",
        "Thank you for fighting the good fight  [u/InternetFreedomIn](https://www.reddit.com/user/InternetFreedomIn/) ! Have donated to you before and will do so again. You're gonna need it more than ever in this dire situation.\n\nEdit: how can I get my name added to the joint representation you mentioned in the first part of the post?",
        "Again me and u understand. Not the masses whose privacy we fighting for. They don't know what's a client, what's a server... \n\nLet's try and make complex terms simple just like the supreme leader does. He takes a complex problem like corona and says light a candle but from home. The latter is his objective but the former is the simplicity. \n\nAgain it's not a critique. It's how I figured to counter him. Make it KISS (keep it simple stupid). Just like that masses will light the 🕯️ for their data privacy.",
        "What about people who don't use a smart device?",
        "You can't unfortunately (we already sent it to government) but can quote tweet on twitter and help get the word out. Also, drop us an endorsement at over [policy@internetfreedom.in](mailto:policy@internetfreedom.in) . We will add you to the email-list of people who endorsed this representation, keep you updated... and the way things are going there may be more avenues for collaborative action where we will need everyone to chip in.\n\nAlso, thank you for your generosity -- you are right we need to widebase and grow our number of donors and members. For those who join the team -- we love you 3000.",
        "&gt;Thanks! We have limited resources to implement graphics and video which are usually effective ways of reaching more people but are putting more of them towards it as we receive support. You can check out our instagram for more direct messaging. \n\nPosting this again since our reply may have been removed as it was an instagram link. \n\n\"Thanks! We have limited resources to implement graphics and video which  are usually effective ways of reaching more people but are putting more  of them towards it as we receive support. You can check out our  instagram for more direct messaging.\" For finding our page just search for it as, \"Internet Freedom Foundation\" in your favorite, privacy friendly search engine!",
        "Thank you, there is a fascinating book on this called, \"Seeing like the state\". We hope you enjoy reading it.",
        ".",
        "Time to pull out Lumia windows phone from drawer.",
        "okay the french researcher who exposed multiple loopholes in m-aadhar application is now working on Arogya app. https://twitter.com/fs0c131y/status/1256601511716696064?s=20",
        "There are no exemption categories at present and this is a massive cause for concern. We do not have any clear answer for this.",
        "What the fuck did I just read",
        "I don't understand why you people are protesting this move. You do some great work, nothing against that, but right now, if you're going to work or are residing in a red zone, having the app in your phone helps the gov. in monitoring, which is kinda required right now. Of course , the source code can be shared but is it really your priority? Convince me otherwise (if you want to)",
        "Download the app, and put extreme battery optimisations on it.",
        "Indians will hand over their rights and privileges to this government with the thunderous clacking of their utensils.",
        "Is Vaahan database no longer publicly searchable?",
        "Good idea. I will get my Nokia E6-00 out.",
        "&gt; Open sourcing client doesnt matter. It's the data on the servers that's going to be misused.\n\nBoth are important. At the same time, the fucking government has no business tracking all our movements from point A to point B to point X.\n\nThis virus has given them carte blanche to introduce new regulations that will put virtual collars and dog tags on the necks of all the residents of this shitstain of a country.",
        "BC agar baki jagah chutiyap chal raha hai toh chalne do, yahan kyun chutiyapa lana hai",
        "I hear you. Will do ma level best to educate. Coming froma startup I knw how it feels to run on limited resources. Don't give up which I know y'all won't. Eventually this is gonna awaken. It's time to find the simple message like govts do.",
        "Like we said full results will come in the medium to long term. We managed an incremental victory with the partial concealment of names. Link to newsreport below. \n\n1/ The intervention : https://internetfreedom.in/we-have-written-to-government-asking-them-to-stop-risks-of-misuse-of-government-datasets/\n\n2/ Ministry's response : https://economictimes.indiatimes.com/news/economy/policy/transport-ministry-to-partially-conceal-names-of-vehicle-owners-on-vahan-database/articleshow/74338287.cms?from=mdr",
        "This is ridiculous. What if I do not own a smartphone?",
        "Go democracy go? We rather like the chant of, \"No surveillance, no\".",
        "As we explained it applies to two categories. In the second category it applies to all workplaces -- all over the country. Not only those in the red zones. Not only IT parks or lawyer's offices, but small go-downs, the unorganised small workshops we see spread all across our country in small towns... basically everywhere. And, if you do not have the app installed you can be criminally prosecuted. \n\nAs an organisation whose mission is to protect constitutional rights this coercion does not square with our values.",
        "Thank you for your good work!",
        "As we stated there are no exclusion categories. The language places focus on the contrary by stating and we quote, \"100% coverage\".",
        "Cause such things won't back off so easy,one way or another it'll bound to happen. The roots extend internationally.\nThe modi is just a tip of iceberg. Just a face for public. He's guilty but pure evil is hidden from public view.",
        "I appreciate your constructive criticism! Kudos!👍",
        "It won't resonate with the masses, who have no understanding of privacy in the physical world as we know it (*lajja* is not privacy) and absolutely no understanding of privacy in the digital world. The first step to obtain physical privacy is an understanding of personal space, and that does not exist in India.\n\nThe worst part is KISS does not work for philosophically technical concepts like these, and when conceited ministers argue towards the more basal instincts of the masses and change the narrative to \"it's food or it's privacy, make your choice\" they turn public opinion against all those who actually think about the long term development of this country. The failure to understand that losing power to a higher authority makes it extremely hard to get it back is also a major cause. All the social progress we've seen around the world, where the people obtained rights from the government, took decades if not centuries to spread wide.\n\nThis government essentially uses the lessons from Lenin or Mao's revolutions, except for a different cause.\n\nBut then I am innately pessimistic about this country and have been for the past several years, so don't mind my rambling.",
        "I support freedom of internet and right to privacy. But what is your take on combating Covid19 if there is no contact tracing? \n(Given the fact that contact tracing is the only means to trace the spread)\nI genuinely am concerned about the challange we face as we compromise right to privacy, but what is the \"solution\"? How to trace?",
        "Even though you're down voted, I second your views!👍\n(Also I appreciate the reply)",
        "I have similar values, but, as I said , if you're going to work OR are residing in a red zone, you need to be monitored as the no. of cases from now on won't increase uniformly but in small bursts, for example ,someone gets infected and comes to work he can cause multiple transmissions, and that's why the gov. is making it mandatory to download the app. I'm a medical personnel, so I can attest to it that it will actually help to prevent that burst of a few hundred new patients if we get the info early and are able to quarantine the people that came in contact (data which we will be getting from the app). As for the part of the criminal prosecution, I'm no expert, but imo it's only going to be enforced if you're adamant in not downloading it, which won't be happening for the common person. As for the privacy issues..... If you read all the documents, it doesn't really send out any private info that can't be accessed normally. Also , in a pandemic, cooperation is key.",
        "Again. \n\nThe installation of the App is mandatory for workplaces in all zones -- not only in the containment zones which are within red zones.",
        "Samsung Guru 1200 get back to work",
        "Please go through this detailed working paper here : https://internetfreedom.in/a-comprehensive-look-at-covid-surveillance-and-privacy-in-india/\n\nSpecifically the 14 recommendations for contact tracing (if any) on Aarogya Setu start from Page 72 at Para 83.",
        "Thank you! We will be resilient.",
        "What are you on about?",
        "This app does not work on rooted phones. I will be showing anyone if they ask for it.",
        "I'm willing to carry a Galaxy S20 that government gives me for free with this app installed. Or they can install it on my Nokia 3310.",
        "Just letting people know that to not fall for such easy tricks, the guy pronounces donald as doland and you think he's mastermind behind all this ?\nNah, he's just a actor to always stay in focus as a distraction where the real mastermind is someone who we don't even know yet.\nMudi is just a cover , a mask.",
        "More on this here : [https://www.reddit.com/r/india/comments/g8bbxl/legal\\_notice\\_to\\_becil\\_for\\_its\\_tender\\_to\\_procure/](https://www.reddit.com/r/india/comments/g8bbxl/legal_notice_to_becil_for_its_tender_to_procure/)",
        "Then we fundamentally disagree :)",
        "&gt; Again me and u understand. Not the masses whose privacy we fighting for. They don't know what's a client, what's a server...\n\n&gt; It's a simple message - \"Government has nothing to hide. So let's ask them o open source and be transparent'.\n\nThe hole in this argument is that the govt. will just open source the client, and say we open sourced it. And then you will be at a loss explaining what's backend what's frontend to the masses!",
        "I trust my data with 1Mg and Makemytrip.",
        "This is what happens when ppl lose their minds due to quarantine",
        "No I mean this literally blew me away. I was not aware the problem has reached a scale like this",
        "You are not making sense. If the data is going to be misused, there is no benefit to open sourcing. The question of whether it is simple or complex does not arise. Plus what do the masses understand what is open source and how it is transparent?",
        "Freedom 251!!!",
        "u/InternetFreedomIn I have a doubt. What if I am not going to work (I am just student who has online classes) and I am not living in a containment zone, is it still illegal to not install the Aarogya Setu app? Also by containment zones do they mean only red zones or something else?",
        "It's not a problem, it's **fear-mongering**\n\nIf you go through the privacy policy of the app, you'll know!\n\nNow, these ppl aren't believing the privacy policy of Arogya setu, but they'll believe the privacy policy of Facebook google who have been proved to be providing data to NSA (PRISM project)",
        "Why isn't anyone talking about this?\n\nNot even the mainstream media is covering this topic",
        "Does seem like a nice move by the Modi government... Bringing the aid of technology during these times",
        "With PRISM project too",
        "&gt;someone gets infected and comes to work he can cause multiple transmissions, and that's why the gov. is making it mandatory to download the app. I'm a medical personnel, so I can attest to it that it will actually help to prevent that burst of a few hundred new patients if we get the info early and are able to quarantine the people that came in contact (data which we will be getting from the app)\n\nHow will the data be collected from the app ? Can you explain in detail.",
        "As a tech-noob, I have a question. I don't know how open source works so forgive me if its a stupid question. Can't they just put the good code (which doesn't show any data-stealing) available online and use the bad code(which steals the data) for the app?",
        "Sure. Will check it out.",
        "Open source basically tells the code &amp; its functions, so whatever the app is doing with your info or devices can be seen",
        "u/InternetFreedomIn How can I volunteer to your work ?   \nLet me know.",
        "Govt: Keh diya na ... bas keh diya! \n\nNo matter what petition you put forth, nothing is going to change sadly. Covid19 has become a nice excuse to implement  authoritarian control in most countries. Mass surveillance, imprisonment of critics and so on.",
        "Did you know they are the one who made the app (1mg, makemytrip)",
        "Sort of, cause i know a person like our PM won't reach at his current position only on his own. He definitely has allies who always at his disposal to do his A to Z job for him. \nHe's not some high IQ high functioning sociopath who knows every shit, but instead complete opposite of it.\n\nThink practically, guy isn't even much formally educated to be as smart as being portrayed and presented. It's all a well acting with good script.",
        "Might want to reach out to https://twitter.com/fs0c131y by twitter or his protonmail address : fs0c131y@protonmail.com .  \nHe was the French Security researcher who disclosed Aadhar data being publicly accessible via google, and has found several bugs relating to Aadhar.  \n  \nElliot is a pseudonym.  \nAadhar profiles can still be accessed by googling on some private firm websites and a few public ones. I checked today and **found a forest department website having someones Aadhar**.  \nHe currently has indexed a list of updated [covid-19 tracker apps on github](https://github.com/fs0c131y/covid19-tracker-apps)  \n\nIt'll be worth mentioning that Aarogya setu has been made mandatory, and reverse-engineering the app is [a violation of ToC](https://sflc.in/our-concerns-aarogya-setu-app)  \n\"“...You agree that you will not tamper with, reverse-engineer or otherwise use the App for any purpose for which it was not intended including, but not limited to, accessing information about registered users stored in the App, identifying or attempting to identify other registered users or gaining or attempting to gain access to the cloud database of the Service.\"",
        "What we can do about this ?",
        "I am going to bring back my lumia 535 . Fuck this shit",
        "Glad someone actually fought back. These Governments think we will bow to their use of our data by manipulating us at these dark times. I don't think the government is straight with their agendas. \nIf they were the PM would directly intervined the Ruccus spread by the media. A big no to their draconic agendas. \nIt's not just about us but the safety of our young ones who can not ask for justice or know what it is.",
        "If organizations doesn't have a work profile (MDM) they are already in breach of privacy of the user. Having BYOD at workplace could lead to some serious threats to organizations. Having an app by government is the last thing they want to worry about. I work as a security researcher before back slash please research thoroughly.",
        "That's the dick of government poking the people and inseminating our thoughts.",
        "It's always going to be an excuse of implementing for the greater good. Only they know the good which is a greater bad.",
        "Okay, so all I wanted to do was give you a normal, tech noob, everyday guy's opinion. You replied to all my comments and you basically repeated what I already said in my comment, adding no new info. I wanted to understand what you meant by all the tech stuff like servers and clients and the info the gov. might get and how it might actually affect me, as all the info you're giving is already  there with the gov. (Licenses and aadhar cards and what not). I like debates as they lead to a full knowledge of the topic ( for and against) , but you have not given me anything worthwhile or even an argument.\n\nAlso \"\" does this mean that a false positive entails that I cannot use public transport and go to work or leave the city to visit friends?\"\" {From the link}, it's lockdown , you're not supposed to be going anywhere.\n\nAgain,i wasn't trying to pick a fight, but was looking for a good conversation.\n\nSo After getting downvoted a lot , this noob shall go away. Peace out.",
        "Open sourcing of the app wont help, why? There is no way you can make sure the open sourced source version is indeed running at the backend, you have to go by their words or rely on expensive auditors. Who will pay for them?  Open sourcing critical apps like these could lead to serious security disasters, for instance if the app has a critical bug which is not caught by the dev team and someone with malicious intent discovers it and exploit it in the wild, who will you blame then government? Everyone in security industry accepts the fact that no system is 100% secure and there is a possibility of vulnerabilities in every system out there. Realese of such critical source code is beyond imagination. At most we can request is for an external auditor to audit the app and that's it. Asking for source code is foolishness and nothing else.",
        "Time to switch to nokia 1100",
        "Through contact tracing, as soon as we get the info that a person developed the symptoms and is tested +ve, we can then go and check all the people that the said person had contact with , and we can immediately quarantine them, preventing further spread of the virus.",
        "Its possible. But if we know source code and how it should work. We can reverse engineer it and compare to see if there are any mishandling. But also main concern is data collection and since it is stored remotely in a government facility, there is hardly any way to ensure compliance there.",
        "As a citizen we should do everything in our power to protect our country",
        "u/internetfreedomin does the app work with A DNS / VPN on? \n\nCould you then *hypothetically* be charged for using a DNS or VPN?",
        "If I install this app and then uninstalled it, will i go to jail ?  Also is it mandatory to put real name in the profile?",
        "What is contact tracing? How does the app accomplish it? \n\n&gt;we get the info that a person developed the symptoms\n\nI read a report from Europe that almost 81% of positive cases (in lockdown) caught during testing were asymptomatic and were undergoing routine testing.",
        "&gt; \"it's food or it's privacy, make your choice\" they turn public opinion against all those who actually think about the long term development of this country.\n\nTHIS",
        "What to do if one does not have a smart phone? Or even a dumb phone. I am one of those who do not carry a smart phone with me.",
        "Thx for the great efforts guys!",
        "Could you explain what this will do? I'm supposed to go to work Monday onwards and I don't want to risk getting beaten up by goons",
        "Great effort. I am in it.",
        "When did this campaign start? Is it possible to for me to add my signature now?",
        "bhand chod kya kr rhi hai ye govment?!",
        "100% of what? Indians, smartphones?",
        "Rooted phone here with magisk installed. It works now. The initial version didn't but after the latest update it has started working.",
        "The battery optimisation will prevent it from running in the background. Therefore it won't collect any location data in the background.\n\nIf you are using Android, download the app to be safe (from police and BJP goons, not from coronavirus) . Then it is your choice to grant it the location permission or not. Your choice, your getting beaten up by police ka risk ( My advice is to ' Enable location only when using the app' option.\n\nThen as the final step, go to the settings&gt;apps&gt;arogya setu . Here, restrict battery, disable autostart, and force stop ( force stop kills/ terminates the app)\n\nNever open the app again, and you are safe.",
        "Be ready to get beaten up by ABVP/ Police \n\n:)",
        "Or just use an iPhone",
        "That app feels so creepy with all the information it asks for",
        "And what about the move to make arogya Setu a pre-installed program on our phones? This is more dangerous. \"Ungli pakdaao toh haath hi pakad lete hai\". \nCOVID-19 is giving the govt an opportunity to get into mass surveillance and they are taking full advantage of it. We must not let them succeed.\n\nThe country owes you awesome people a lot. I am one of the \"radicals\" amongst my friends who is trying to wake people to the truth about mass surveillance. It's easy to be tagged as leftist or BJP hater on these topics and be shut down by the loud idiots. \nUnfortunately only a few like us understand and have to fight for the rights of the simpletons who see everything through a political lense. Appreciate your efforts and I urge my fellow like minded people to donate to the cause if they can.",
        "Interesting. Thanks man.",
        "India is becoming more like china",
        "Ah shit. That was my only probable excuse. Now, I'll just have to disable the playstore and act dumb.",
        "No, you don't have to install it. This govt decision cannot be legally enforced.",
        "Thanks for this guys. Quite a detailed take. Rights and privacy shouldn't come and go when it's convenient. They should be constants, like a lighthouse in the midst of a storm.",
        "Hi. Let me explain how the contact tracing apps are supposed to work. They are supposed to work and store data offline.  If a person has been infected, health officials will open the app and upload to servers.\n\nConstant location pinging to insecure servers, is not contact tracing. It is just short of full-blown surveillance. imagine, 50 million people, their location being sent every 30 secs.",
        "This is something that should be noted. This is a major reason why banks dont seem to use Open sourced languages and libraries for any of their software  and are still sticking with freakin Java( Atleast some people from some famous banks told me so ).\n\nAlthough open source looks like a better thing for security in long term, it is a disaster for the security in short term like this.",
        "What are we supposed to do now? Install the app or do we have any other option as of now?",
        "You seem well read in Arogya Setu's privacy policy. Please put up a post refuting these claims.",
        "Prime Time on NDTV India had a discussion about this two days back IIRC",
        "Uhh Google already does it though with Google Maps. By default, it has Location History on, which stores a record of your location data. Google says that there's a delete setting but I'm wary of that considering it's part of the PRISM program",
        "Should have begun your comment with this, wouldn't have garnered the downvotes haha",
        "My Nokia 8110 4G agrees. They can port it, buy me a phone or stfu.",
        "Before quoting the 'PRISM Program' everywhere, learn the basics.\n\nIs Google Maps a contact tracing app? No. It is a navigation app, which would be shit without location permissions. Location History can be turned off in a few clicks. You see Google sending you to jail for that?\n\nIf you don't trust that they delete the data, then you shouldn't use them.",
        "Security by obscurity? Really?",
        "What happens if you have a dumbphone? What happens if you don't have a phone at all?",
        "RIP privacy",
        "Using DNS or VPN won’t do anything. The apps collects location data and contact tracing. VPN and DNS would just change the route through which this data reaches their servers but not the hide the data itself.",
        "It's available on iphone too. #1 in health &amp; fitness catagory of Apple app Store",
        "No. It's available on iphone too. #1 in health &amp; fitness catagory of Apple app Store",
        "&gt;Happy cake day!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "Shouldn't this be doable for the arogya setu app as well?\n\nhttps://twitter.com/matthewrdev/status/1254336105203200000?s=19\n\nEdit:\n\nThe Twitter thread is basically about an Australian mobile developer who downloaded and decompiled the source code of the CovidSafe app and found that it was clean.\n\nThe CovidSafe app in Australia is of similar nature and the Australian govt. didn't open source it.",
        "Lol, install it and just disable permission if you are paranoid about privacy.",
        "I am too broke to buy phone. Feel free to mail me one modi",
        "Yeah man, that's the best idea!",
        "Oh ok, but I am just a student, I care more about not going to jail. The information they can collect from me will be me always trying to do calculus or learning to code... (I am a student what morec an they get out of me, lol!)\n\nThat is why I was concerned... thanks for clearing it up!",
        "After that so many scams happened accross country...",
        "Is there any website or a page which explains all of it? I want to forward in WhatsApp",
        "Instead of doing all these gymnastics, make a better app.",
        "Our data are already lost. I am sure half of us are in Instagram and going through all the click baits. The app does track your location and Bluetooth to ensure which devices you went close to. There should be an awareness of which is right and which is wrong. I think you people still have no clue about the severity of corona. Only if they can pin down all the people contacted with the infected, the spreading could slow down. I see this as a huge accomplishment. Data security is a lie, you should know that. If you ever used google AdSense and Facebook ads you would know these. Have a look at them. You will share all your data with Google and Facebook but not for the nation huh. Lol. Also, even if they steal the data i wouldn't care, nation has better things to be worried of. Corona &gt; privacy, period.",
        "When I click on privacy policy it leads to \"Error 403: Forbidden\"\n\nThat is for government to know only?",
        "Its not irrelevant. It is completely in the context.",
        "It is declared illegal to reverse engineer Arogya setu.",
        "Could you please upload the slides somewhere downloadable?",
        "Thanks for fighting for us.",
        "Use web version of it, root android phone and install micro g if you need Google stuff. It's possible not to be tracked, use browsers which are barebone.",
        "James C Scott is the boss. My personal favourite is The Art of Not Being Governed.",
        "My old Nokia 3310 is ready.",
        "It's cute that u think u haven't already. Google and Facebook literally know ur personality to an extent.",
        "IMO, all software projects developed using tax payer money should be open source.",
        "Have you even read what the OP post says or are you here to bless me with your unsolicited wisdom?",
        "Haha , i just wrote what went in my mind. Didn't mind the downvotes.",
        "You should start make arrangements on how your family is going to live after you die.",
        "That makes this even more suspicious.",
        "Open source request as public official messaging. \n\n\"Govt ko kyon janna hai ki aap kab sandaas gaye, kab cigarette khareede\" as whatsapp forward.",
        "\"Privacy is a myth\". It's those people who agree to this statement are fighting back now. They will happily buy smartphone of Chinese make that are known to be spying for their govt (a foreign govt). But they won't install a simple app made by their own govt which has been praised by intergovernmental organisations and is aimed at helping the government fight back a pandemic. A democracy is a rule of the people where people don't support their rulers even for a good cause. Irony or hypocrisy?",
        "I'll tell the government I only have a keypad phone. Let's see how they install it there.",
        "I was just replying to ur comment on how u thought u 'were' going to lose ur privacy 2 years ago.  \n    \nWake up, bro. Or atleast read up on some snowden files and some smartphone privacy articles. It's a fallacy that ur data is private.",
        "Nothing is paranoia ~~if it involves this govt~~ about privacy",
        "&gt;In the quest to get larger number of signatories, every tom-dick-and-harry has had a go.\n\nYep, there's a \"cashless consumer\" in that list. Like wtf IFF?",
        "what a way to get upvotes fam",
        "can someone clear this up for me.. this app completely relys on user to give the correct answers to questions, say someone knowingly/unknowingly answers the questions wrongly to get the desired result? what then?\n\nalso say i am an individual who actually has problem and diagnose through app, is there any feed back mechanism where it triggers some sort of notification to near by health authority to help them!? i think it should be that way.. but it doesn't seem so..",
        "That's wrong, they can't force us.",
        "I'll happily go back to the old Nokia phone days than download this shit.\n\n AI + GPS tagging + BJP IT Cell = Humnoid Andh Bhakth.",
        "Are your masters so impatient to win another election round? Are they so scared that they have to send you out of all people to troll on the internet?",
        "I am all for the internet freedom. But this seems like a good criteria to make it mandatory. People in containment zone and people going out to work should install this app. They are at high risk of being infected and it is in benefit of people crossing paths with them to know about it. And they can always uninstall it after the lockdown ends and corona situation is stable.",
        "No one is saying there are NO benefits, people just want reasonable data privacy / legal guardrails in place before mandating usage. \n\nGuardrails are especially needed given there’s significant mission &amp; scope creep — the app now has payments, telemedicine etc in addition to contact tracing. \n\nPlus given that there are no exclusions allowed, what are people without a smartphone supposed to do?\n\nWhat about potential loopholes in contact tracing where the app cannot track human-surface interactions? Or interactions with infected but asymptomatic people, and so on. \n\n\nYou’re right in saying that the app itself, theoretically, is useful. But we need to be vigilant and make sure sufficient guardrails are put in place so no one can misuse / abuse the system even in the future.",
        "Nah",
        "Well one thing others can do is report and drop the app's ratings on play store. Not much but a step.",
        "What basics are you talking about? Yes, Google doesn't outright jail you, but if you're on the CIA's list for whatever reason (terrorist, left wing President of a Latin American country against big oil), it's forced to give any data that's traceable to you to US Intelligence. \n\nYes, Google Maps is not a contract tracing app, and no, even contract tracing apps \"would be shit without location permissions\". Location History and contact tracing work on the same principles. \n\n&gt;If you don't trust that they delete the data, then you shouldn't use them.\n\nWow. What other viable alternative do I have to Google services, with the same quality and ease-of-use, that isn't in bed with the Pentagon?",
        "&gt;their rulers\n\nI like how some Indians are eager to elevate their governments to a position of monarchy.\n\nThese politicians do not rule us, they govern us. We do not serve them, they serve us.\n\nAlso, stop believing the government is some angelic entity that can do no wrong.",
        "\n\nActual Privacy Policy:\n1. Data is stored on a server operated &amp; managed by Government.\n2. All info uploaded is deleted (even from the server) after 45 days of uploading. \n3. All data is encrypted before being uploaded\n4. User has to give consent for providing data\n\n\nSo, i think there is no need to panic. Prove me wrong",
        "&gt;Sort of, cause i know a person like our PM won't reach at his current position only on his own.\n\nEh. Not at all. Our PM lacks intelligence and knowledge about many subject areas. But he understands politics very well.\n\nMoreover, you're right that he's not orchestrating everything. But this illuminati and international allies is just bullshit. He has a dedicated team of PR agency and IT cell workers who are deep into data analysis and churn out stuff to sway people.\n\nThis is of course not planned and organized by PM. But he gives the vision and his chamchas below handle the rest of the stuff.\n\nI'm unable to locate links to that article now but it was previously exposed by many independent media outlets like Scroll and Quartz.\n\nThe company has a very peculiar name and has roots in Gujarat starting as some completely unrelated NGO on women empowerment. That is the social media engine or the \"Cambridge Analytica\" of India.\n\nIf you watch the documentary The Great Hack (on Netflix which is about Cambridge Analytica), there is a portion were they show countries CA has operated for elections and 2014 Indian Elections is one of them. This was a practice ground for CA before they implemented their mind-bending social media manipulation during 2016 Trump elections in which Trump won.\n\nIt'll be naive to say that something big across the world like an Illuminati is orchestrating all of this. Maybe it's true but the idea of that is so far-fetched especially because there are much stronger evidence of stuff being planned and executed within India.",
        "This is true for all the apps.",
        "Fixed?",
        "Do you guys just upvote anything that is anti-government?",
        "I really don't know much about illuminati and stuff, all I'm saying is he's not a mastermind but just a another puppet with a role to play.\nAnd same is with other countries.",
        "Health and Fitness? NANI",
        "So very many terrible things have started with the \"greater good\" argument. No, we do not need *surveillance*. We need *awareness*. They're two very different things. It's one thing to honestly, transparently release an app with a complete rundown of what it does and why it would be advantageous to install it. It's another thing entirely to *command* a population to \"install it or else\", and even worse when there's no transparency and no redressal of concerns.",
        "What if I go off the grid. Bye bye Reddit? Can they still jail me??",
        "LMAO is this serious ? I got a notification from my college to install this app.",
        "Hey any of you dumb smart assholes know how this app works \n\nTry searching for privacy- preserving contact tracing\n\nFor you dumb lazy to search anything try watching this video on YouTube  https://youtu.be/EgIg90cFRVw\n\nAny edited to app",
        "here is the thing, if the opensource the client, \n\ni can for example\n\n1. view what all is configured to send to server and if it is valid or not. \n2.  build a client  (APK) from the code myself and put a alert and add a send me everything that the app sends to server. \n3. host this self built apk's for other to use for those privacy concerned.\n\n&amp;#x200B;\n\nright now to achieve, that i need to use wireshare and see at encrypted data.",
        "Hiding information is significant part of information security. Source code is something which is considered as a core of a product. We block open ports and disable banners from service response becausewe don't want to leak information, and it is not opinion it is industry standard.",
        "Working as in working to find out more flaws or literally working with the devs?",
        "This is arogya setu astra dude - sudarshan chakra of Mahabharata giving power to kill all suspected.",
        "I am out on on old blackberry. It's damn safe.",
        "There are no masters of mine. The problem with people who consider themselves to be the only knowledgeable people on the planet is that they get buried under their own hypocrisy. I am a person who supports the government and not the party. You being an informed voter (which I assume, you are) have the right to change the government and I will still support the government and NOT the party. But people like you have become so blind by hatred towards one particular political party that you see everyone through the lens of same hatred and every pro-government individual is either a troll or a brainwashed idiot for you. The same kind of attitude was seen back in 2013-14 when the Indian mass elevated one particular individual to the rank of a saviour. But you people are born with a thick skull never to let sense enter your mind.",
        "There is a slight difference between governing and serving. In a democracy, people elect a government and they govern the people. But, they don't serve the people. At least, not the sense that the spirit of governing as has been laid out in the Constitution is compromised. \n\nAnd every support for something done by the government is not an eagerness to elevate the government to a position of monarchy. Every staunch believer of the Constitution would disagree with even the idea of it. But the Indian mass seems to have forgotten that they can still show some support to the govt without worshipping the individuals who hold the office of the govt or can still oppose the govt without being blinded by hatred towards the same individuals.\n\nI do not know what angels are. So I would like to neither believe or disbelieve that govt is one of them. But can the govt do wrong? Yes, it can. Is there any inherent problem with the app being discussed? Well, I would say there are apprehensions about the misuse of data which is why, it is important to back it by a legislation (or a ruling by the judiciary). This will limit the scope of the data usage by the government and hence, will help protect people from their personal data being misused. But, the option for the government to use such data for the benefit of the general public (such as to slow down the spread of a pandemic) should be kept open, imo. And this is the only reason I support the app. So stop accusing people of being eager to elevate the government to a position of monarchy. Be reasonable in both support or opposition. In either case, there is no place for stupidity.",
        "Guys any clarity on if or not its gonna be pre installed on devices in the future ?",
        "Is it illegal to not download it ?",
        "Idk",
        "I mean rights are not optional – that they should apply and the standards to which they should apply do not change with the situation. \n\nIn addition, given this govt's history, a platform like this is almost impossible to repeal / improve / fix later. Look at aadhaar. \n\nI understand the importance of contact tracing, but we're not talking about ONLY that. Neither are we talking about _an_ app that could do this, we're talking about THIS particular one, and the fact that the government is using all of its might behind pushing it.\n\nDoes anyone here really feel like they'll make changes once they have 200-300-400 Million downloads?",
        "I would like to thank you in Triggering me to Login into my Account and rant about how stupid you guys can be.\n\nYou guys talk about Privacy but I can assure you 99.99% of Ppl in the list:  use Default Search Engine as Google, Use Facebook, Twitter, Instagram and Snapchat and post your Whole life there. Use Chinese Android Devices which all come with their Own Sets of Bloatware and tracking which most of you dont bother to turn off/Disbale. You Guys use Youtube and Sell you Data, You guys Use Google and sell you loaction, Email data, Drive, Contacts, Search History, Browsing Habits, Device Habits and Etc. Use Windows 10 with all Telemetry on: selling your Data to Microsoft,  Use amazon/Flipkart: You are selling your Shopping habits and needs there. You Use Chrome as you default Browser, You are selling more of your Privacy. So guys in these list dont have any rights to talk about Privacy at all. Many of them can be Reverse Google Search and we will get detailed Info About them floating on Internet. \n\nIf you want to even start considering getting any Sort of Privacy, then Use: Linux, Android With Gapps, ProtonEmail/Tutonat/etc, No social Media, invidio, No Online Shopping/Account, Use Firefox with Blown Privacy setting On it, Get A God-Dammed AdBlocker + make it more powerful by adding lists to further Curb your Privacy and I keep on going. \n\n&amp;#x200B;\n\nSo please dont talk abt Privacy when all of you have already sold your Data and when the Government is doing something abt Trying to get much better Data to analyze Covid Patients so to avoid False +ve to reduce time and risks. Seriously, This is plain old Stupid beyond Measures. If Gov Dont do anything, you guys will rant that India Doesnt do anything, If Gov does anything then you speak against it. \n\nIf you are asking Gov to Open Source apps, then go and ask big Cooperates to Open Source thier Apps and see what you get in reply.",
        "Mwonuse",
        "The virus is not going to go away anytime soon, and Governments will have to open up the economies, whether two weeks later, or two months later. Will this app be mandated for everyone then?\n\nThis is a huge privacy issue. As someone who doesn't even share his Aadhaar, my only option would then be to not to go to work and work from home if forced to install this app.\n\n1. While I may have that choice, the majority don't.\n2. It is an encroachment of my fundamental rights as I will have to choose between privacy and freedom of movement\n3. What are the legal safeguards preventing misuse of the surveillance data collected by the app?\n4. Where is this extremely sensitive data being stored and is the technology used sophisticated enough to prevent the attempts to hack this data?",
        "&gt;  use Default Search Engine as Google, Use Facebook, Twitter, Instagram and Snapchat and post your Whole life there.\n\nYawn. I don't use those. So am I allowed to be critical of this? Also, did you just compare an entity that has a police force which is known to arrest people at will, with entities that don't? \n\nYou seem to not understand the meaning of *consent*. If people consent to give their data to Instagram, that's their business. They're being stupid in my opinion, but again that's their business. The govt though is coercing people to install an app that will be spying on them. I would have the same objection if the govt forced me to install Instagram. I agree that Arogya Setu has a positive use at this point in time, but nobody knows how long the data will be retained and who it will be sold to. Sure the govt has given assurances, but the same govt has also told the Supreme Court earlier that the citizens of this country have no right to privacy. When that is the officially stated position of the govt, it is quite rational to be deeply skeptical of its commitment to privacy. We have no way to verify that they will actually delete the data after 45 days, no way to verify that private players will not be given access to the data. \n\n\n&gt; If Gov Dont do anything, you guys will rant that India Doesnt do anything, If Gov does anything then you speak against it. \n\nThe govt can do many things. They could have ramped up testing earlier for instance. They could have refused visas to the Tabhligi Jamaat when it was known that they were coming from Covid-affected countries. They could have taken action between 16 Mar-23 Mar when the Delhi Police station was right opposite the Markaz where thousands were congregating. \n\nEven now, I wager there are several things the govt can do instead of wasting the time, efforts and fuel of the Air Force to shower flowers. \n\n\n&gt; If you are asking Gov to Open Source apps, then go and ask big Cooperates to Open Source thier Apps and see what you get in reply.\n\nAgain a false equivalence. The corporates that keep their source proprietary, are doing so to preserve their competitive advantage. The govt has no need to do that.",
        "How do you verify that those points are being followed? And what legal recourse do you have if they are not? \n\nThis is not an idle question btw - this govt has in the past told the Supreme Court that Indian citizens have no right to privacy. So I see no reason to simply trust that they will keep their word and not simply change the rules once they have the data.",
        "&gt; Well, I would say there are apprehensions about the misuse of data which is why, it is important to back it by a legislation (or a ruling by the judiciary). This will limit the scope of the data usage by the government and hence, will help protect people from their personal data being misused.\n\nHas this actually been done? If not, what assurance do we have that a govt which believes that Indian citizens have no right to privacy, will bring in any such legislation? \n\nThis is not a reflexive refusal to cooperate with the govt, as much as it is that the Indian govt has repeatedly shown a disrespect for people's privacy and a lack of seriousness on data security. The govt is asking for a level of trust on personal data that for many citizens, it has not earned.",
        "&gt; People should worry about the greater cause rather than wasting their energy over talking about how making an app mandatory is an infringement on their rights\n\nThe problem with this argument is that once the app is installed and the data collection begins, then the genie is out of the bottle and people have no control what the govt does with the data. And therefore the govt has no incentive to protect privacy. Especially this govt has in the past even denied that people have any right to privacy, so on what basis can they be trusted to use the data for the intended purpose? \n\nFor this reason, the implementation of legal and technological safeguards cannot be an afterthought. It has to go hand-in-hand. And it cannot simply be a verbal assurance by Ravi Shankar Prasad, it has to be law and there has to be legal recourse that citizens can take against the govt if the govt breaches this trust.",
        "First of all, everyone in their mother who owns a Xiaomi is obviously infuriated about this and there are going to be sanctions on it no doubt.\n\nSecond of all, a person can be criminally charged for not installing the setu app.\n\nData is the new currency and people should be free to choose how they use it. As far as data is concerned, I'm obviously going to choose Google because of their security and fuck facebook for not even salting or encrypting the passwords, but the government of India is on a whole new level on their aadhar card data leaks and that's why I'm not going to share my data with people who can't even acknowledge that their security needs some serious reworks.",
        "I am not questioning the opposition. I'm questioning the ground for opposition. Coercion I shouldn't be the issue as far as the purpose is maintaining public health or public order or similar grounds on which the government is empowered to act. The apprehensions about apparent misuse of data and ways of checking it should be the ground rather than ranting about govt cannot force people to download. They are the government, they can force. Grounds for such action should be reasonable. \n\nHas this been done? No it has not been done (or so it appears till now, kindly enlighten me if otherwise) which is why I highlighted the point and which is why I support a judicial action for the same. I'm opposed to people making an issue out of coercion every time the govt tries to do something mandatory in order to serve a higher purpose. Hope you get my point.",
        "No. Any person owning a Xiaomi should NOT necessarily get infuriated and start accusing people of worshipping an individual which he doesn't. But that's another story which we should leave behind.\n\nShould people be free to use data in whichever way they need? In a purely commercial sense, yes (currency is commercial perspective). From a purely security perspective, yes. From a governance perspective, it is debatable. If the government can ensure that they can provide adequate security to the data they collect, they can collect it for better governance (and better governance only). Which is why, I am opposed the idea of questioning their way of using the app for controlling the pandemic. I am opposed to people who try to make an issue out of coercion every time the GoI wants to make something mandatory for better governance.\n\nHowever, data security is of course, a serious issue which is why I support a judicial action in that regard. Either the court will direct them to maintain proper data security standards and back the app by a legislation which will prevent them from misusing the data ot they should do it themselves.",
        "Horny girls are only supposed to take out their bras. Don’t think too much 🤮😀",
        "And that's why people are asking/demanding for better privacy laws in India because it just might be useful from a governance perspective, but it also also might just be extremely dangerous to say the least from a citizen's perspective.\n\nIMO, before they ask (or in this case, force) their citizens to give them a new type of data which exposes them even more, they should learn to correctly handle and protect the existing data which they already have.\n\nAnother inherent flaw of the system is that if people know they're being tracked, they can easily just leave their devices at home and nobody would even know the difference.\n\nJust imagine in a dystopian future where you're forced to wear a GPS tracking watch which reports your medical status for \"your own benefit\". Would you like the idea of having a dog collar on your neck knowing that the government knows everything you do and it's illegal to tell them that it's none of their business?\n\nIf the groundwork isn't laid out this second, then everything would just be meaningless as India would be the next China or Russia where free speech gets you killed.\n\nAfter the e-cigarette ban, it's clear that they don't give two fucks about whether their citizens die or not. All they're really interested in is vote grabbing to stay in power. Their biggest threat is for people to think for themselves the extent of damage they can do for their own benefit.\n\nI'm sure you've read about hospitals refusing patients, cops beating the living shit out of people until the literally die and workers walking thousands of kilometres just to go back to their homes and are dying in the process because of starvation or exhaustion. Even children aren't spared from this.\n\nSo, the definition of governance is different for them as it is to us. For them? Governance means control and the security of their power. For us? It means our safety and rights to be humans instead of being treated like dogs with a collar to their neck.\n\nLike the BJP has already used services like Cambridge Analytica to win elections and now they're the party who has the majority control in the Parliament. It's not just BJP, it's all these new governments who've popped out of the woodwork in the last half of the decade by using targeted advertisements and using their social media \"influence\" to basically snatch all the votes by dirtying up the opposition party's politicians despite being just as devious as them.\n\nIt's like the pot calling the kettle black. The BJP called the Congress government totally corrupt, which they were, but the BJP aren't no saints neither. They've literally made corruption legal with the whole electoral bonds bullshit. So no, that's why the government first has to earn my trust before I blindly trust them again.\n\nFuck me once? Shame on you. Fuck me twice? Shame on me.",
        "Heh, i am continuously using the 625 since 2013.",
        "&gt;\tNo it has not been done (or so it appears till now, kindly enlighten me if otherwise)\n\nHow would we even know what has and hasn't been done? This is the issue with zero transparency and zero safeguards in case of a breach. \n\nAlso your line of thinking is flawed where personal data is concerned. Because even if it isn't being done now, once the data is with the govt you don't know where it will be used in the future. What's more, the nature of data and analytics is such that you might not even be able to imagine what uses it could be put to in future. \n\nFor example if before 2016 somebody told you that Facebook would be used to spread fake news in a targeted manner to manipulate elections, would you have believed it? The data for that was not collected instantly, it has been built up over time, before anybody knew that is what it would be used for. \n\nAnd with regards to a higher purpose, it is trivial for the govt to create a higher purpose for any action. For example Internet surveillance can be justified for the higher purpose of preventing child pornography, as many countries are doing. Higher purpose should not be treated as a blank check for the govt.\n\nEDIT: the [T&amp;C](https://static.swaraksha.gov.in/tnc/) of the app states the following: \n\n&gt;\tYou agree and acknowledge that the Government of India will not be liable for any claims in relation to the use of the App, including but not limited to (a) your inability to access or use the App or the Services; (b) the failure of the App or the Services to accurately identify persons in your proximity who have tested positive to COVID-19; (c) the accuracy of the information provided by the App or the Services as to whether the persons you have come in contact with in fact been infected by COVID-19; (d) **any unauthorised access to your information** or modification thereof.\n\nSo note what the govt is saying: they are not responsible if the app is inaccurate (and this defeats its very purpose) and they are also not responsible if your personal data is accessed by people who are not authorized to do so. Is there any doubt left on how opaque this is and how it is trivial for the govt to use it for surveillance?\n\nIt also begs the question that if the organization that is forcing everybody to install and use this app and provide their data, if this organization isn't responsible to ensure that the data is accessed by authorised people, then who on earth **is** responsible for it? Who else could possibly be responsible for it?",
        "Yeah. You forget Facebook, Google+ Scandal.. and the fact that you have been using 1 single account on Reddit for past 9 Years with so much activity speaks volume regarding you privacy concerns. So you are not qualified. \n\nAnd then What about their consent with Xiamoi and Chinese Manufacturers.  They dont seem to form a parade and ask them to do anything. And lastly, the amount of tracking a website does without your permission is very insane which users dont have an idea abt. \n\nAnd why would government need to sell your data?\nSeriously, a private firm has way more possibility to sell your data then a Government. And Government is keeping it proprietary so that it doesn't get abused. The Government could sell the whole app model to other Govt and make money out of it. \n\nAnd why people are so hung up on ramping up testing. As if government is just gonna make Testing kits out of thin air and for free. Here, People know how to make kide like a factory only. and Seriously, then expect  from Government subsidy to feed their mouths and etcetra.\n\nIts the most idiotic thing to say. Instead of Testing random people who are not gonna get infected, testing ppl based on their contacts Would increase the efficiency by a lot margin and less losses of life.\n\n you as a no one, might not know, but when there is no medicine, the best way to fight this disease is to keep people motivated, to give the, hope and support. By doing all kinds of things like this gives people a sense of belonging and hope. You might not know this but someone close by had COVID and he told me how when he heard all the Sounds on that day made him more hopeful for his life. (And Fuel is dirt cheap by the way now). \n\n And abt whole Markaz thing, Dont even get me started. \nI'm sure If even write anything you guys would jump the Gun and call me Right-Wing and shit not(And Possible Ban). We all know what how much such minorities would have heed the call of local police. they were not allowed to even start the whole gathering in first place, but they did. And in the End a threat of Commandos got them out.",
        "Yes. As we feared the NOIDA Authorities made this very, very clear. https://internetfreedom.in/we-contest-the-noida-authorities-direction-that-may-make-aarogya-setu-a-path-to-jail/",
        "Not yet. We are going to file RTIs even though getting really evasive responses till now.",
        "1/ Actual privacy policy is a one-sided contract that can be updated at any time. This privacy policy has actually been updated after we released our working paper to address the most obvious flaws. \n\n2/ The privacy policy does not link to any enforcement framework or permanence. We do not have a data protection law and there is no legislative basis (which limits its purpose or data retention) for such limits. Hence, any future changes in this privacy policy wont be a problem. \n\n3/ You are being asked to trust, but not verify. There is little to no transparency even till today who is building this app, who has access to the data and with whom and how it is shared. It's fine if you feel comfortable installing it, but surely this should not be made mandatory for others under the risk of them being sent to jail.",
        "It is mandatory for people even outside containment zone. For instance in Noida. https://internetfreedom.in/we-contest-the-noida-authorities-direction-that-may-make-aarogya-setu-a-path-to-jail/",
        "You said ? \n\nhttps://internetfreedom.in/we-contest-the-noida-authorities-direction-that-may-make-aarogya-setu-a-path-to-jail/",
        "How is jailing people for not installing this application a, \"good cause\" ? \n\nhttps://internetfreedom.in/we-contest-the-noida-authorities-direction-that-may-make-aarogya-setu-a-path-to-jail/",
        "Hmm.. let us check internally. You are right we should not be locking our infographics behind any social media platform. Give us some time to implement this at a systems level.",
        "We have filed RTIs but replies are evasive. Will try to get more information on this.",
        "We were under really tight timelines. There have been some learnings for us on how to do this in future. Will give more lead time and reach out more actively for encouraging a larger number and diversity of sign-ons.",
        "Thank you!",
        "Yay! Thank you!",
        "The app is meant for maintaining public order and for containing the spread of a pandemic (public health). There can be reasonable punishments for not cooperating with the authorities. Nothing wrong in that. Don't make an unnecessary issue out of it. Also, do read the new guidelines on how the data can be used.",
        "Well it's your job to know what has been done or not been done before you make an issue out of it. My thinking may be flawed but your thought is not thought at all that says, \"We don't know what has been done or not\" but still intends to convince people with confidence that what has been done will result in their misery and it's easy to demonize the govt. Also do check out the new guidelines on how the data can be used so that next time someone asks to enlighten him about it you don't come out with a vague answer and still accuse that person of having a flawed thought process.\n\nAlso, this is for maintaining public order and for containing spread of a pandemic (public health). There can be compulsion from the authorities for ensuring compliance and there can be reasonable punishment for that. This is all constitutional. So stop making an unnecessary issue out of it. Just because you don't intend to comply, it doesn't mean the govt is acting unconstitutionally."
    ],
    "cleaned_text": "aarogya setu organizations prominent individuals push back coercion aarogya setu organizations prominent individuals push back coercionhttpspreviewredditwxbtlsgqdwpngwidthampformatpngampautowebpampsadbfbadbfceaadc help iff fight mass surveillance fund workhttpsinternetfreedomindonate tldr today sent joint representationhttpsdrivegooglecomfiledeliqfgeapnfezveujqtroffrufltviewuspsharing prime ministers office endorsed organisations individuals mandatory use aarogya setu app dated may joint representation becomes urgent given yesterdays direction home ministryhttpsdrivegooglecomfiledwxzfiupvqryzbkxwkzmskyfzlviewuspsharing mandatory use aarogya setu coverage especially workplaces violation direction lead criminal penalties thereby aarogya setu impacts data privacy workers lead risks exclusion misidentification person phone also charged criminal offence marks dramatic clear shift government policy aarogya setu encouragement towards coercion increases legitimacy demands articulated joint representation joint representation cosigned organisations people yesterdays posthttpsinternetfreedominworkersprivacyduringcovid released joint representation signed organisations individuals mandating use aarogya setu workers opened signons number grown organisations individuals expressed solidarity mandatory imposition aarogya setu workers endorsements broad swathe indian society including trade unions peoples movements digital rights organizations public health experts former civil servants bureaucrats activists academics technologists journalists lawyers etc copy joint representationhttpsdrivegooglecomopenideliqfgeapnfezveujqtroffruflt sent today covering letter prime ministers office copy ministry home affairs central government ministries attached covering letterhttpsdrivegooglecomfiledrrtbnjcskqvsdpuvcmqrcrilgqgviewuspsharing dated may notes concern yesterday evenings development issuance order dmia issued may around pm ministry home affairs requiring mandatory installation aarogya setu goes core demands joint representation attached covering letter aarogya setu mandatory also criminal penalties order dmia issued section disaster management act mandates mandatory installation operation aarogya setu two specific ways first classification districts three zones red hotspots zones subclassification made containment zones per order section iii local authority shall ensure coverage aarogya setu app among residents containment zones second para reference made district magistrates strictly enforce lockdown measures public workplaces specified annexure direction extends three zones annexure states point use aarogya setu app shall made mandatory employees private public shall responsibility head respective organisations ensure coverage app among employees presently exceptions conditionality provided directions place emphasis coverage effect meaning total complete mandatory installation aarogya setu workers across country order indicates criminal penalties noncompliance paragraph states person violating lockdown measures national directives covid management liable proceeded per provision section disaster management act besides legal action section ipc legal provisions applicable specific provision may attracted prosecution disaster management act section b provides maximum punishment year disobedience years actions may lead loss life penalty conviction section ipc extends months imprisonment hence mandatory imposition aarogya setu issue data privacy second order harms spring includes loss urban mobility use public spaces transit livelihood personal liberty millions indians india specially without smartphones devices given lack exemption categories intention action iff continuation joint representation dated may covering letter requested specific review order dmia also shortly reaching one cosignees collaborators urging send individual letters concern much examine advocacy actions grave breach also remain open suggestions advice better different collaborators even members public invite write us discuss issues internet freedom forumhttpsforuminternetfreedomin stated iff continue conducting public advocacy awareness especially digital media well continue engage proactively government institutions issues concerning aarogya setu includes representations rti requests well legal remedies may examined appropriate stage consultation iffs legal team several lawyers continue volunteer thier time labour towards protecting fundamental rights remain committed working organisations individuals broaden scope improve impact interventions around aarogya setu please feel free reach us important documents finalized joint representation dated sent government list signatories linkhttpsdrivegooglecomfiledeliqfgeapnfezveujqtroffrufltviewuspsharing covering letter dated dated sent government linkhttpsdrivegooglecomfiledrrtbnjcskqvsdpuvcmqrcrilgqgviewuspsharing public call endorsements may day mandatory imposition aarogya setu linkhttpsinternetfreedominworkersprivacyduringcovid comparative analysis aarogya setu linkhttpsinternetfreedominisaarogyasetuprivacyfirstnopebutitcouldbeifthegovernmentwanted working paper privacy concerns technological responses covid india linkhttpsinternetfreedominacomprehensivelookatcovidsurveillanceandprivacyinindia ",
    "cleaned_title": "aarogya setu organizations prominent individuals push back coercion",
    "cleaned_selftext": "aarogya setu organizations prominent individuals push back coercionhttpspreviewredditwxbtlsgqdwpngwidthampformatpngampautowebpampsadbfbadbfceaadc help iff fight mass surveillance fund workhttpsinternetfreedomindonate tldr today sent joint representationhttpsdrivegooglecomfiledeliqfgeapnfezveujqtroffrufltviewuspsharing prime ministers office endorsed organisations individuals mandatory use aarogya setu app dated may joint representation becomes urgent given yesterdays direction home ministryhttpsdrivegooglecomfiledwxzfiupvqryzbkxwkzmskyfzlviewuspsharing mandatory use aarogya setu coverage especially workplaces violation direction lead criminal penalties thereby aarogya setu impacts data privacy workers lead risks exclusion misidentification person phone also charged criminal offence marks dramatic clear shift government policy aarogya setu encouragement towards coercion increases legitimacy demands articulated joint representation joint representation cosigned organisations people yesterdays posthttpsinternetfreedominworkersprivacyduringcovid released joint representation signed organisations individuals mandating use aarogya setu workers opened signons number grown organisations individuals expressed solidarity mandatory imposition aarogya setu workers endorsements broad swathe indian society including trade unions peoples movements digital rights organizations public health experts former civil servants bureaucrats activists academics technologists journalists lawyers etc copy joint representationhttpsdrivegooglecomopenideliqfgeapnfezveujqtroffruflt sent today covering letter prime ministers office copy ministry home affairs central government ministries attached covering letterhttpsdrivegooglecomfiledrrtbnjcskqvsdpuvcmqrcrilgqgviewuspsharing dated may notes concern yesterday evenings development issuance order dmia issued may around pm ministry home affairs requiring mandatory installation aarogya setu goes core demands joint representation attached covering letter aarogya setu mandatory also criminal penalties order dmia issued section disaster management act mandates mandatory installation operation aarogya setu two specific ways first classification districts three zones red hotspots zones subclassification made containment zones per order section iii local authority shall ensure coverage aarogya setu app among residents containment zones second para reference made district magistrates strictly enforce lockdown measures public workplaces specified annexure direction extends three zones annexure states point use aarogya setu app shall made mandatory employees private public shall responsibility head respective organisations ensure coverage app among employees presently exceptions conditionality provided directions place emphasis coverage effect meaning total complete mandatory installation aarogya setu workers across country order indicates criminal penalties noncompliance paragraph states person violating lockdown measures national directives covid management liable proceeded per provision section disaster management act besides legal action section ipc legal provisions applicable specific provision may attracted prosecution disaster management act section b provides maximum punishment year disobedience years actions may lead loss life penalty conviction section ipc extends months imprisonment hence mandatory imposition aarogya setu issue data privacy second order harms spring includes loss urban mobility use public spaces transit livelihood personal liberty millions indians india specially without smartphones devices given lack exemption categories intention action iff continuation joint representation dated may covering letter requested specific review order dmia also shortly reaching one cosignees collaborators urging send individual letters concern much examine advocacy actions grave breach also remain open suggestions advice better different collaborators even members public invite write us discuss issues internet freedom forumhttpsforuminternetfreedomin stated iff continue conducting public advocacy awareness especially digital media well continue engage proactively government institutions issues concerning aarogya setu includes representations rti requests well legal remedies may examined appropriate stage consultation iffs legal team several lawyers continue volunteer thier time labour towards protecting fundamental rights remain committed working organisations individuals broaden scope improve impact interventions around aarogya setu please feel free reach us important documents finalized joint representation dated sent government list signatories linkhttpsdrivegooglecomfiledeliqfgeapnfezveujqtroffrufltviewuspsharing covering letter dated dated sent government linkhttpsdrivegooglecomfiledrrtbnjcskqvsdpuvcmqrcrilgqgviewuspsharing public call endorsements may day mandatory imposition aarogya setu linkhttpsinternetfreedominworkersprivacyduringcovid comparative analysis aarogya setu linkhttpsinternetfreedominisaarogyasetuprivacyfirstnopebutitcouldbeifthegovernmentwanted working paper privacy concerns technological responses covid india linkhttpsinternetfreedominacomprehensivelookatcovidsurveillanceandprivacyinindia",
    "cleaned_comments": "good work havent check forumhttpsforuminternetfreedomin discourse similar internettech issues country likeminded people thank community development space envision iff staff chat supporters volunteers help us remain accountable honest also effective many great ideas come wider public sphere collectives without setu sitting ducks india protect without invasive contact tracing growing dispute utility contact tracing especially integrated placed within public health strategy per rti responses received us ministry health role neither consulted aarogya setu contact tracing done maintaining privacy protections also ensuring missionscope creep placing clear legal limits present exist privacy policy one sided unenforceable contract changed time made recommendations working paper specifically aarogya setu encourage take time sunday quite long go arent guys pushing open source since could useful tool sure open source tech folks audit give us facts opinions advocating since start public advocacy quoting analysis apphttpsinternetfreedominisaarogyasetuprivacyfirstnopebutitcouldbeifthegovernmentwanted information app frontend rather pedestrian terms service tos privacy policy projects release much information possible pursuit transparency may include accompanying manifesto technical specifications general faqs even source code working paperhttpsinternetfreedominacomprehensivelookatcovidsurveillanceandprivacyinindia recommendations government instance making open source without legal limits intended use keep open function creep links post living rock illegal install app yes containment zone go work dont run risk going jail employee employer longer explanation post awesome appreciate efforts usually keeping message simple like supreme leader helps reach mass simple message government nothing hide lets ask open source transparent thag message potentially go masses vs sophisticated tech terms u comprehend lets learn supreme leader keep message simple stupid sure get lot people educated thag way sorry blunt signatories activistsartistspolitical groups little understanding technology whether software epidemiology guys considered legimate authority issue quest get larger number signatories every tomdickandharry go appears although idea breach fundamental rights thank work gone honest hopeful govt even take points consideration know isnt first instance stepped im sure past experiences whether hope get even well think response excellent work groups like would lost privacy couple years back well modis decision people work likes modi sort countries real power one controls everything similar things happen every country thanks limited resources implement graphics video usually effective ways reaching people putting towards receive support check instagram direct messaging httpswwwinstagramcompbvmbnjtoehttpswwwinstagramcompbvmbnjtoe work good faith caution iff always engages government hope reciprocate realistic assessment might step escalation matrix past interventions disclosure vaahan database disclosure lists persons quarantine social media communication hub public victories recent times individual effort alliances collectives many private victories nature work towards medium long term change receiving greater support community growing based raw metrics website visits social media engagement growth organic grassroots donors today need accelerate challenge us hope keep receiving support essential times like thank really motivating hear words first reached labor unions made demand list hindi linked previous blogpost followed active inputs one union even gave us suggestions joint representation basis larger working paper developed period time also sent organizations many come grassroots understand risks exclusion due technology due felt experience signatories organizations include digital rights groups also frank find comment activists generalized unfair disparages work experience list individuals includes former civil servants including served high positions including ministry electronics open sourcing client doesnt matter data servers thats going misused data become important source governments personal information get better strategies put elections eg even though irrelevant cambridge analytica medium push propaganda thank much country lacking important essential data protection bill organisation like iff help us lot thank fighting good fight uinternetfreedominhttpswwwredditcomuserinternetfreedomin donated youre gon na need ever dire situation edit get name added joint representation mentioned first part post u understand masses whose privacy fighting dont know whats client whats server lets try make complex terms simple like supreme leader takes complex problem like corona says light candle home latter objective former simplicity critique figured counter make kiss keep simple stupid like masses light data privacy people dont use smart device cant unfortunately already sent government quote tweet twitter help get word also drop us endorsement policyinternetfreedominmailtopolicyinternetfreedomin add emaillist people endorsed representation keep updated way things going may avenues collaborative action need everyone chip also thank generosity right need widebase grow number donors members join team love gtthanks limited resources implement graphics video usually effective ways reaching people putting towards receive support check instagram direct messaging posting since reply may removed instagram link thanks limited resources implement graphics video usually effective ways reaching people putting towards receive support check instagram direct messaging finding page search internet freedom foundation favorite privacy friendly search engine thank fascinating book called seeing like state hope enjoy reading time pull lumia windows phone drawer okay french researcher exposed multiple loopholes maadhar application working arogya app exemption categories present massive cause concern clear answer fuck read dont understand people protesting move great work nothing right youre going work residing red zone app phone helps gov monitoring kinda required right course source code shared really priority convince otherwise want download app put extreme battery optimisations indians hand rights privileges government thunderous clacking utensils vaahan database longer publicly searchable good idea get nokia e gt open sourcing client doesnt matter data servers thats going misused important time fucking government business tracking movements point point b point x virus given carte blanche introduce new regulations put virtual collars dog tags necks residents shitstain country bc agar baki jagah chutiyap chal raha hai toh chalne yahan kyun chutiyapa lana hai hear level best educate coming froma startup knw feels run limited resources dont give know yall wont eventually gon na awaken time find simple message like govts like said full results come medium long term managed incremental victory partial concealment names link newsreport intervention ministrys response ridiculous smartphone go democracy go rather like chant surveillance explained applies two categories second category applies workplaces country red zones parks lawyers offices small godowns unorganised small workshops see spread across country small towns basically everywhere app installed criminally prosecuted organisation whose mission protect constitutional rights coercion square values thank good work stated exclusion categories language places focus contrary stating quote coverage cause things wont back easyone way another itll bound happen roots extend internationally modi tip iceberg face public hes guilty pure evil hidden public view appreciate constructive criticism kudos wont resonate masses understanding privacy physical world know lajja privacy absolutely understanding privacy digital world first step obtain physical privacy understanding personal space exist india worst part kiss work philosophically technical concepts like conceited ministers argue towards basal instincts masses change narrative food privacy make choice turn public opinion actually think long term development country failure understand losing power higher authority makes extremely hard get back also major cause social progress weve seen around world people obtained rights government took decades centuries spread wide government essentially uses lessons lenin maos revolutions except different cause innately pessimistic country past several years dont mind rambling support freedom internet right privacy take combating covid contact tracing given fact contact tracing means trace spread genuinely concerned challange face compromise right privacy solution trace even though youre voted second views also appreciate reply similar values said youre going work residing red zone need monitored cases wont increase uniformly small bursts example someone gets infected comes work cause multiple transmissions thats gov making mandatory download app im medical personnel attest actually help prevent burst hundred new patients get info early able quarantine people came contact data getting app part criminal prosecution im expert imo going enforced youre adamant downloading wont happening common person privacy issues read documents doesnt really send private info cant accessed normally also pandemic cooperation key installation app mandatory workplaces zones containment zones within red zones samsung guru get back work please go detailed working paper specifically recommendations contact tracing aarogya setu start page para thank resilient app work rooted phones showing anyone ask im willing carry galaxy government gives free app installed install nokia letting people know fall easy tricks guy pronounces donald doland think hes mastermind behind nah hes actor always stay focus distraction real mastermind someone dont even know yet mudi cover mask httpswwwredditcomrindiacommentsgbbxllegalnoticetobecilforitstendertoprocurehttpswwwredditcomrindiacommentsgbbxllegalnoticetobecilforitstendertoprocure fundamentally disagree gt u understand masses whose privacy fighting dont know whats client whats server gt simple message government nothing hide lets ask open source transparent hole argument govt open source client say open sourced loss explaining whats backend whats frontend masses trust data mg makemytrip happens ppl lose minds due quarantine mean literally blew away aware problem reached scale like making sense data going misused benefit open sourcing question whether simple complex arise plus masses understand open source transparent freedom uinternetfreedomin doubt going work student online classes living containment zone still illegal install aarogya setu app also containment zones mean red zones something else problem fearmongering go privacy policy app youll know ppl arent believing privacy policy arogya setu theyll believe privacy policy facebook google proved providing data nsa prism project isnt anyone talking even mainstream media covering topic seem like nice move modi government bringing aid technology times prism project gtsomeone gets infected comes work cause multiple transmissions thats gov making mandatory download app im medical personnel attest actually help prevent burst hundred new patients get info early able quarantine people came contact data getting app data collected app explain detail technoob question dont know open source works forgive stupid question cant put good code doesnt show datastealing available online use bad codewhich steals data app sure check open source basically tells code amp functions whatever app info devices seen uinternetfreedomin volunteer work let know govt keh diya na bas keh diya matter petition put forth nothing going change sadly covid become nice excuse implement authoritarian control countries mass surveillance imprisonment critics know one made app mg makemytrip sort cause know person like pm wont reach current position definitely allies always disposal z job hes high iq high functioning sociopath knows every shit instead complete opposite think practically guy isnt even much formally educated smart portrayed presented well acting good script might want reach twitter protonmail address fscyprotonmailcom french security researcher disclosed aadhar data publicly accessible via google found several bugs relating aadhar elliot pseudonym aadhar profiles still accessed googling private firm websites public ones checked today found forest department website someones aadhar currently indexed list updated covid tracker apps githubhttpsgithubcomfscycovidtrackerapps itll worth mentioning aarogya setu made mandatory reverseengineering app violation tochttpssflcinourconcernsaarogyasetuapp agree tamper reverseengineer otherwise use app purpose intended including limited accessing information registered users stored app identifying attempting identify registered users gaining attempting gain access cloud database service going bring back lumia fuck shit glad someone actually fought back governments think bow use data manipulating us dark times dont think government straight agendas pm would directly intervined ruccus spread media big draconic agendas us safety young ones ask justice know organizations doesnt work profile mdm already breach privacy user byod workplace could lead serious threats organizations app government last thing want worry work security researcher back slash please research thoroughly thats dick government poking people inseminating thoughts always going excuse implementing greater good know good greater bad okay wanted give normal tech noob everyday guys opinion replied comments basically repeated already said comment adding new info wanted understand meant tech stuff like servers clients info gov might get might actually affect info youre giving already gov licenses aadhar cards like debates lead full knowledge topic given anything worthwhile even argument also mean false positive entails use public transport go work leave city visit friends link lockdown youre supposed going anywhere againi wasnt trying pick fight looking good conversation getting downvoted lot noob shall go away peace open sourcing app wont help way make sure open sourced source version indeed running backend go words rely expensive auditors pay open sourcing critical apps like could lead serious security disasters instance app critical bug caught dev team someone malicious intent discovers exploit wild blame government everyone security industry accepts fact system secure possibility vulnerabilities every system realese critical source code beyond imagination request external auditor audit app thats asking source code foolishness nothing else time switch nokia contact tracing soon get info person developed symptoms tested go check people said person contact immediately quarantine preventing spread virus possible know source code work reverse engineer compare see mishandling also main concern data collection since stored remotely government facility hardly way ensure compliance citizen everything power protect country uinternetfreedomin app work dns vpn could hypothetically charged using dns vpn install app uninstalled go jail also mandatory put real name profile contact tracing app accomplish gtwe get info person developed symptoms read report europe almost positive cases lockdown caught testing asymptomatic undergoing routine testing gt food privacy make choice turn public opinion actually think long term development country one smart phone even dumb phone one carry smart phone thx great efforts guys could explain im supposed go work monday onwards dont want risk getting beaten goons great effort campaign start possible add signature bhand chod kya kr rhi hai ye govment indians smartphones rooted phone magisk installed works initial version didnt latest update started working battery optimisation prevent running background therefore wont collect location data background using android download app safe police bjp goons coronavirus choice grant location permission choice getting beaten police ka risk advice enable location using app option final step go settingsgtappsgtarogya setu restrict battery disable autostart force stop force stop kills terminates app never open app safe ready get beaten abvp police use iphone app feels creepy information asks move make arogya setu preinstalled program phones dangerous ungli pakdaao toh haath hi pakad lete hai covid giving govt opportunity get mass surveillance taking full advantage must let succeed country owes awesome people lot one radicals amongst friends trying wake people truth mass surveillance easy tagged leftist bjp hater topics shut loud idiots unfortunately like us understand fight rights simpletons see everything political lense appreciate efforts urge fellow like minded people donate cause interesting thanks man india becoming like china ah shit probable excuse ill disable playstore act dumb dont install govt decision legally enforced thanks guys quite detailed take rights privacy shouldnt come go convenient constants like lighthouse midst storm hi let explain contact tracing apps supposed work supposed work store data offline person infected health officials open app upload servers constant location pinging insecure servers contact tracing short fullblown surveillance imagine million people location sent every secs something noted major reason banks dont seem use open sourced languages libraries software still sticking freakin java atleast people famous banks told although open source looks like better thing security long term disaster security short term like supposed install app option seem well read arogya setus privacy policy please put post refuting claims prime time ndtv india discussion two days back iirc uhh google already though google maps default location history stores record location data google says theres delete setting im wary considering part prism program begun comment wouldnt garnered downvotes haha nokia g agrees port buy phone stfu quoting prism program everywhere learn basics google maps contact tracing app navigation app would shit without location permissions location history turned clicks see google sending jail dont trust delete data shouldnt use security obscurity really happens dumbphone happens dont phone rip privacy using dns vpn wont anything apps collects location data contact tracing vpn dns would change route data reaches servers hide data available iphone health amp fitness catagory apple app store available iphone health amp fitness catagory apple app store gthappy cake day shouldnt doable arogya setu app well edit twitter thread basically australian mobile developer downloaded decompiled source code covidsafe app found clean covidsafe app australia similar nature australian govt didnt open source lol install disable permission paranoid privacy broke buy phone feel free mail one modi yeah man thats best idea oh ok student care going jail information collect always trying calculus learning code student morec get lol concerned thanks clearing many scams happened accross country website page explains want forward whatsapp instead gymnastics make better app data already lost sure half us instagram going click baits app track location bluetooth ensure devices went close awareness right wrong think people still clue severity corona pin people contacted infected spreading could slow see huge accomplishment data security lie know ever used google adsense facebook ads would know look share data google facebook nation huh lol also even steal data wouldnt care nation better things worried corona gt privacy period click privacy policy leads error forbidden government know irrelevant completely context declared illegal reverse engineer arogya setu could please upload slides somewhere downloadable thanks fighting us use web version root android phone install micro g need google stuff possible tracked use browsers barebone james c scott boss personal favourite art governed old nokia ready cute u think u havent already google facebook literally know ur personality extent imo software projects developed using tax payer money open source even read op post says bless unsolicited wisdom haha wrote went mind didnt mind downvotes start make arrangements family going live die makes even suspicious open source request public official messaging govt ko kyon janna hai ki aap kab sandaas gaye kab cigarette khareede whatsapp forward privacy myth people agree statement fighting back happily buy smartphone chinese make known spying govt foreign govt wont install simple app made govt praised intergovernmental organisations aimed helping government fight back pandemic democracy rule people people dont support rulers even good cause irony hypocrisy ill tell government keypad phone lets see install replying ur comment u thought u going lose ur privacy years ago wake bro atleast read snowden files smartphone privacy articles fallacy ur data private nothing paranoia involves govt privacy gtin quest get larger number signatories every tomdickandharry go yep theres cashless consumer list like wtf iff way get upvotes fam someone clear app completely relys user give correct answers questions say someone knowinglyunknowingly answers questions wrongly get desired result also say individual actually problem diagnose app feed back mechanism triggers sort notification near health authority help think way doesnt seem thats wrong cant force us ill happily go back old nokia phone days download shit ai gps tagging bjp cell humnoid andh bhakth masters impatient win another election round scared send people troll internet internet freedom seems like good criteria make mandatory people containment zone people going work install app high risk infected benefit people crossing paths know always uninstall lockdown ends corona situation stable one saying benefits people want reasonable data privacy legal guardrails place mandating usage guardrails especially needed given theres significant mission amp scope creep app payments telemedicine etc addition contact tracing plus given exclusions allowed people without smartphone supposed potential loopholes contact tracing app track humansurface interactions interactions infected asymptomatic people youre right saying app theoretically useful need vigilant make sure sufficient guardrails put place one misuse abuse system even future nah well one thing others report drop apps ratings play store much step basics talking yes google doesnt outright jail youre cias list whatever reason terrorist left wing president latin american country big oil forced give data thats traceable us intelligence yes google maps contract tracing app even contract tracing apps would shit without location permissions location history contact tracing work principles gtif dont trust delete data shouldnt use wow viable alternative google services quality easeofuse isnt bed pentagon gttheir rulers like indians eager elevate governments position monarchy politicians rule us govern us serve serve us also stop believing government angelic entity wrong actual privacy policy data stored server operated amp managed government info uploaded deleted even server days uploading data encrypted uploaded user give consent providing data think need panic prove wrong gtsort cause know person like pm wont reach current position eh pm lacks intelligence knowledge many subject areas understands politics well moreover youre right hes orchestrating everything illuminati international allies bullshit dedicated team pr agency cell workers deep data analysis churn stuff sway people course planned organized pm gives vision chamchas handle rest stuff im unable locate links article previously exposed many independent media outlets like scroll quartz company peculiar name roots gujarat starting completely unrelated ngo women empowerment social media engine cambridge analytica india watch documentary great hack netflix cambridge analytica portion show countries ca operated elections indian elections one practice ground ca implemented mindbending social media manipulation trump elections trump itll naive say something big across world like illuminati orchestrating maybe true idea farfetched especially much stronger evidence stuff planned executed within india true apps fixed guys upvote anything antigovernment really dont know much illuminati stuff im saying hes mastermind another puppet role play countries health fitness nani many terrible things started greater good argument need surveillance need awareness theyre two different things one thing honestly transparently release app complete rundown would advantageous install another thing entirely command population install else even worse theres transparency redressal concerns go grid bye bye reddit still jail lmao serious got notification college install app hey dumb smart assholes know app works try searching privacy preserving contact tracing dumb lazy search anything try watching video youtube edited app thing opensource client example view configured send server valid build client apk code put alert add send everything app sends server host self built apks use privacy concerned ampxb right achieve need use wireshare see encrypted data hiding information significant part information security source code something considered core product block open ports disable banners service response becausewe dont want leak information opinion industry standard working working find flaws literally working devs arogya setu astra dude sudarshan chakra mahabharata giving power kill suspected old blackberry damn safe masters mine problem people consider knowledgeable people planet get buried hypocrisy person supports government party informed voter assume right change government still support government party people like become blind hatred towards one particular political party see everyone lens hatred every progovernment individual either troll brainwashed idiot kind attitude seen back indian mass elevated one particular individual rank saviour people born thick skull never let sense enter mind slight difference governing serving democracy people elect government govern people dont serve people least sense spirit governing laid constitution compromised every support something done government eagerness elevate government position monarchy every staunch believer constitution would disagree even idea indian mass seems forgotten still show support govt without worshipping individuals hold office govt still oppose govt without blinded hatred towards individuals know angels would like neither believe disbelieve govt one govt wrong yes inherent problem app discussed well would say apprehensions misuse data important back legislation ruling judiciary limit scope data usage government hence help protect people personal data misused option government use data benefit general public slow spread pandemic kept open imo reason support app stop accusing people eager elevate government position monarchy reasonable support opposition either case place stupidity guys clarity gon na pre installed devices future illegal download idk mean rights optional apply standards apply change situation addition given govts history platform like almost impossible repeal improve fix later look aadhaar understand importance contact tracing talking neither talking app could talking particular one fact government using might behind pushing anyone really feel like theyll make changes million downloads would like thank triggering login account rant stupid guys guys talk privacy assure ppl list use default search engine google use facebook twitter instagram snapchat post whole life use chinese android devices come sets bloatware tracking dont bother turn offdisbale guys use youtube sell data guys use google sell loaction email data drive contacts search history browsing habits device habits etc use windows telemetry selling data microsoft use amazonflipkart selling shopping habits needs use chrome default browser selling privacy guys list dont rights talk privacy many reverse google search get detailed info floating internet want even start considering getting sort privacy use linux android gapps protonemailtutonatetc social media invidio online shoppingaccount use firefox blown privacy setting get goddammed adblocker make powerful adding lists curb privacy keep going ampxb please dont talk abt privacy already sold data government something abt trying get much better data analyze covid patients avoid false reduce time risks seriously plain old stupid beyond measures gov dont anything guys rant india doesnt anything gov anything speak asking gov open source apps go ask big cooperates open source thier apps see get reply mwonuse virus going go away anytime soon governments open economies whether two weeks later two months later app mandated everyone huge privacy issue someone doesnt even share aadhaar option would go work work home forced install app may choice majority dont encroachment fundamental rights choose privacy freedom movement legal safeguards preventing misuse surveillance data collected app extremely sensitive data stored technology used sophisticated enough prevent attempts hack data gt use default search engine google use facebook twitter instagram snapchat post whole life yawn dont use allowed critical also compare entity police force known arrest people entities dont seem understand meaning consent people consent give data instagram thats business theyre stupid opinion thats business govt though coercing people install app spying would objection govt forced install instagram agree arogya setu positive use point time nobody knows long data retained sold sure govt given assurances govt also told supreme court earlier citizens country right privacy officially stated position govt quite rational deeply skeptical commitment privacy way verify actually delete data days way verify private players given access data gt gov dont anything guys rant india doesnt anything gov anything speak govt many things could ramped testing earlier instance could refused visas tabhligi jamaat known coming covidaffected countries could taken action mar mar delhi police station right opposite markaz thousands congregating even wager several things govt instead wasting time efforts fuel air force shower flowers gt asking gov open source apps go ask big cooperates open source thier apps see get reply false equivalence corporates keep source proprietary preserve competitive advantage govt need verify points followed legal recourse idle question btw govt past told supreme court indian citizens right privacy see reason simply trust keep word simply change rules data gt well would say apprehensions misuse data important back legislation ruling judiciary limit scope data usage government hence help protect people personal data misused actually done assurance govt believes indian citizens right privacy bring legislation reflexive refusal cooperate govt much indian govt repeatedly shown disrespect peoples privacy lack seriousness data security govt asking level trust personal data many citizens earned gt people worry greater cause rather wasting energy talking making app mandatory infringement rights problem argument app installed data collection begins genie bottle people control govt data therefore govt incentive protect privacy especially govt past even denied people right privacy basis trusted use data intended purpose reason implementation legal technological safeguards afterthought go handinhand simply verbal assurance ravi shankar prasad law legal recourse citizens take govt govt breaches trust first everyone mother owns xiaomi obviously infuriated going sanctions doubt second person criminally charged installing setu app data new currency people free choose use far data concerned im obviously going choose google security fuck facebook even salting encrypting passwords government india whole new level aadhar card data leaks thats im going share data people cant even acknowledge security needs serious reworks questioning opposition im questioning ground opposition coercion shouldnt issue far purpose maintaining public health public order similar grounds government empowered act apprehensions apparent misuse data ways checking ground rather ranting govt force people download government force grounds action reasonable done done appears till kindly enlighten otherwise highlighted point support judicial action im opposed people making issue coercion every time govt tries something mandatory order serve higher purpose hope get point person owning xiaomi necessarily get infuriated start accusing people worshipping individual doesnt thats another story leave behind people free use data whichever way need purely commercial sense yes currency commercial perspective purely security perspective yes governance perspective debatable government ensure provide adequate security data collect collect better governance better governance opposed idea questioning way using app controlling pandemic opposed people try make issue coercion every time goi wants make something mandatory better governance however data security course serious issue support judicial action regard either court direct maintain proper data security standards back app legislation prevent misusing data ot horny girls supposed take bras dont think much thats people askingdemanding better privacy laws india might useful governance perspective also also might extremely dangerous say least citizens perspective imo ask case force citizens give new type data exposes even learn correctly handle protect existing data already another inherent flaw system people know theyre tracked easily leave devices home nobody would even know difference imagine dystopian future youre forced wear gps tracking watch reports medical status benefit would like idea dog collar neck knowing government knows everything illegal tell none business groundwork isnt laid second everything would meaningless india would next china russia free speech gets killed ecigarette ban clear dont give two fucks whether citizens die theyre really interested vote grabbing stay power biggest threat people think extent damage benefit im sure youve read hospitals refusing patients cops beating living shit people literally die workers walking thousands kilometres go back homes dying process starvation exhaustion even children arent spared definition governance different us governance means control security power us means safety rights humans instead treated like dogs collar neck like bjp already used services like cambridge analytica win elections theyre party majority control parliament bjp new governments whove popped woodwork last half decade using targeted advertisements using social media influence basically snatch votes dirtying opposition partys politicians despite devious like pot calling kettle black bjp called congress government totally corrupt bjp arent saints neither theyve literally made corruption legal whole electoral bonds bullshit thats government first earn trust blindly trust fuck shame fuck twice shame heh continuously using since gt done appears till kindly enlighten otherwise would even know hasnt done issue zero transparency zero safeguards case breach also line thinking flawed personal data concerned even isnt done data govt dont know used future whats nature data analytics might even able imagine uses could put future example somebody told facebook would used spread fake news targeted manner manipulate elections would believed data collected instantly built time anybody knew would used regards higher purpose trivial govt create higher purpose action example internet surveillance justified higher purpose preventing child pornography many countries higher purpose treated blank check govt edit tampchttpsstaticswarakshagovintnc app states following gt agree acknowledge government india liable claims relation use app including limited inability access use app services b failure app services accurately identify persons proximity tested positive covid c accuracy information provided app services whether persons come contact fact infected covid unauthorised access information modification thereof note govt saying responsible app inaccurate defeats purpose also responsible personal data accessed people authorized doubt left opaque trivial govt use surveillance also begs question organization forcing everybody install use app provide data organization isnt responsible ensure data accessed authorised people earth responsible else could possibly responsible yeah forget facebook google scandal fact using single account reddit past years much activity speaks volume regarding privacy concerns qualified consent xiamoi chinese manufacturers dont seem form parade ask anything lastly amount tracking website without permission insane users dont idea abt would government need sell data seriously private firm way possibility sell data government government keeping proprietary doesnt get abused government could sell whole app model govt make money people hung ramping testing government gon na make testing kits thin air free people know make kide like factory seriously expect government subsidy feed mouths etcetra idiotic thing say instead testing random people gon na get infected testing ppl based contacts would increase efficiency lot margin less losses life one might know medicine best way fight disease keep people motivated give hope support kinds things like gives people sense belonging hope might know someone close covid told heard sounds day made hopeful life fuel dirt cheap way abt whole markaz thing dont even get started im sure even write anything guys would jump gun call rightwing shit notand possible ban know much minorities would heed call local police allowed even start whole gathering first place end threat commandos got yes feared noida authorities made clear yet going file rtis even though getting really evasive responses till actual privacy policy onesided contract updated time privacy policy actually updated released working paper address obvious flaws privacy policy link enforcement framework permanence data protection law legislative basis limits purpose data retention limits hence future changes privacy policy wont problem asked trust verify little transparency even till today building app access data shared fine feel comfortable installing surely made mandatory others risk sent jail mandatory people even outside containment zone instance noida said jailing people installing application good cause hmm let us check internally right locking infographics behind social media platform give us time implement systems level filed rtis replies evasive try get information really tight timelines learnings us future give lead time reach actively encouraging larger number diversity signons thank yay thank app meant maintaining public order containing spread pandemic public health reasonable punishments cooperating authorities nothing wrong dont make unnecessary issue also read new guidelines data used well job know done done make issue thinking may flawed thought thought says dont know done still intends convince people confidence done result misery easy demonize govt also check new guidelines data used next time someone asks enlighten dont come vague answer still accuse person flawed thought process also maintaining public order containing spread pandemic public health compulsion authorities ensuring compliance reasonable punishment constitutional stop making unnecessary issue dont intend comply doesnt mean govt acting unconstitutionally",
    "light_cleaned_title": "Aarogya Setu : 45 organizations and more than 100 prominent individuals push back against the coercion",
    "light_cleaned_selftext": "### [Aarogya Setu : 45 organizations and more than 100 prominent individuals push back against the coercion](https://preview.redd.it/wxbtlsgq2dw41.png?width=795&amp;format=png&amp;auto=webp&amp;s=22adb4fb68a1d632655b5fc954e91a3284a0d0c2) [**Help IFF fight mass surveillance. Fund our work**](https://internetfreedom.in/donate/)**!** ### Tl;dr Today, we sent a[ joint representation](https://drive.google.com/file/d/1ELi-Q9FG-eapNFEzVeuJqTROFFrUflT3/view?usp=sharing) to the Prime Minister's Office that is endorsed by 45 organisations and more than 100 individuals against the mandatory use of the Aarogya Setu App dated May 1, 2020. This joint representation becomes all the more urgent given yesterday's [direction by the Home Ministry](https://drive.google.com/file/d/1wXzfI9uPv0Qr4YZBKXwk_1Z1M2skYfzl/view?usp=sharing) for the mandatory use of Aarogya Setu and for it's \"100% coverage\" especially in all workplaces. Violation of this direction can lead to criminal penalties thereby Aarogya Setu now not only impacts the data privacy of workers, or can lead to risks of exclusion and misidentification, a person not having it on their phone can also be charged with a criminal offence. This marks a dramatic and clear shift in government policy on Aarogya Setu from, \"encouragement\" towards coercion and increases the legitimacy of the demands articulated by the joint representation. ### A joint representation co-signed by 45 organisations and more than 100 people In [yesterday's post](https://internetfreedom.in/workers-privacy-during-covid-19/) we released a joint representation signed by 37 organisations and 75 individuals against mandating the use of the Aarogya Setu on workers. After we opened it for further sign-ons this number has grown to 45 organisations and more than 100 individuals who have expressed solidarity against the mandatory imposition of Aarogya Setu on workers. The endorsements are from a broad swathe of Indian society including trade unions, people's movements, digital rights organizations, public health experts, former civil servants and bureaucrats, activists, academics, technologists, journalists, lawyers etc. A copy of the [joint representation](https://drive.google.com/open?id=1ELi-Q9FG-eapNFEzVeuJqTROFFrUflT3) was sent today with a covering letter to the Prime Minister's Office with a copy to Ministry of Home Affairs and other central government ministries. To this we attached [a covering letter](https://drive.google.com/file/d/1RR3tBnJCSkQvSDp0uVcMQr6C2RILgqg4/view?usp=sharing) dated May 2, 2020 which further notes with concern yesterday evening's development of the issuance of Order No 40-3/2020-DM-I(A) has been issued on May 1, 2020 around 6:00 PM by the Ministry of Home Affairs requiring mandatory installation of Aarogya Setu. This goes against the core demands of the joint representation which is attached to this covering letter. ### Aarogya Setu : Not only mandatory but also criminal penalties The Order No 40-3/2020-DM-I(A), which has been issued under Section 10(2)(I) of the Disaster Management Act, 2005 mandates for the mandatory installation and operation of Aarogya Setu in two specific ways: 1. First, after classification of the districts into three zones, for the Red (Hotspots) Zones, a further sub-classification has been made for, “*containment zones*”. As per the Order under Section 3(iii), “*The local authority shall ensure 100% coverage of Aarogya Setu app among the residents of Containment Zones*”. 2. Second, at Para 15(i) further reference is made for, “*all the district magistrates*” to, “*strictly enforce the lockdown measures*” for, “*public and workplaces, as specified in Annexure I*”. This direction extends to all three zones. Annexure I further states at Point No. 15 that, “*Use of Aarogya Setu app shall be made mandatory for all employees, both private and public. It shall be responsibility of the Head of the respective Organisations to ensure 100% coverage of this app among employees*”. Presently here are no exceptions or conditionality provided in these directions which place emphasis on 100% coverage in effect meaning total and complete mandatory installation of Aarogya Setu for all workers, all across the country. The order further indicates criminal penalties for non-compliance in Paragraph No. 16 that states, “*Any person violating these lockdown measures and the National Directives for Covid-19 Management will be liable to be proceeded against as per the provision of Section 51 to 60 of the Disaster Management Act, 2005, besides legal action under Section 188 of the IPC and other legal provisions as applicable*”. The specific provision that may be attracted for prosecution under the Disaster Management Act, 2005 is Section 51(b) that provides for a maximum punishment of up to 1 year for disobedience, and 2 years when such actions may lead to a loss of life. The penalty for conviction under Section 188 of the IPC extends to 6 months imprisonment. Hence, the mandatory imposition of Aarogya Setu is not only an issue of data privacy but second order harms which spring from it now includes loss of urban mobility, use of public spaces and transit, livelihood and personal liberty for millions of Indians all over India. Specially those without smartphones devices given the lack of any exemption categories. ### Intention for further action We at IFF in continuation of this Joint Representation dated May 1, 2020 and through this covering letter have requested specific review of Order No 40-3/2020-DM-I(A) and will also be shortly reaching out to each one of the co-signees and collaborators urging them to send individual letters of concern as much as examine further advocacy actions against this grave breach. We also remain open to any suggestions and advice on what we can do better, or different not only through our collaborators, but even members of the public. We invite you to write to us, or discuss these issues over at the [Internet Freedom Forum](https://forum.internetfreedom.in/). As stated before we at IFF will continue conducting public advocacy, awareness especially through digital media as well as continue to engage pro-actively with all government institutions on the issues concerning Aarogya Setu. This includes representations, RTI requests as well as other legal remedies which may be examined at an appropriate stage in consultation with IFF's legal team and several lawyers who continue to volunteer thier time and labour towards protecting fundamental rights. We remain committed working with more organisations and individuals to broaden the scope and improve the impact of interventions around Aarogya Setu. Please do feel free to reach out to us. ### Important Documents 1. Finalized Joint Representation dated 01.05.2020 sent to the Government with the list of signatories ([link](https://drive.google.com/file/d/1ELi-Q9FG-eapNFEzVeuJqTROFFrUflT3/view?usp=sharing)) 2. Covering letter dated dated 02.05.2020 sent to the Government ([link](https://drive.google.com/file/d/1RR3tBnJCSkQvSDp0uVcMQr6C2RILgqg4/view?usp=sharing)) 3. Public call for endorsements on May Day against the mandatory imposition of Aarogya Setu ([link](https://internetfreedom.in/workers-privacy-during-covid-19/)) 4. Comparative Analysis of Aarogya Setu ([link](https://internetfreedom.in/is-aarogya-setu-privacy-first-nope-but-it-could-be-if-the-government-wanted/)) 5. Working Paper on Privacy Concerns on Technological Responses to COVID-19 in India ([link](https://internetfreedom.in/a-comprehensive-look-at-covid-surveillance-and-privacy-in-india/))",
    "light_cleaned_comments": "Good work! Those who haven't, [should check out their forum](https://forum.internetfreedom.in/) where you can have discourse on this and similar Internet/Tech issues in the country with likeminded people. Thank you! It’s more a community development space where we envision that IFF Staff can chat with our supporters and volunteers. This will help us remain accountable, honest but also effective. Many great ideas come from the wider public sphere through collectives. But without setu we are sitting ducks /s. How can India protect itself without invasive contact tracing? 1/ There is growing dispute on the utility of contact tracing by itself. Especially when it is not integrated and placed within a public health strategy. As per RTI responses received by us the Ministry of Health has no role and neither is consulted on Aarogya Setu. 2/ Contact tracing can be done while maintaining privacy protections and also ensuring there is no mission/scope creep. This is through placing clear legal limits. At present this does not exist (the privacy policy is a one sided, unenforceable contract that can be changed at any time). We have made about 14 recommendations in our working paper specifically on Aarogya Setu. I encourage you to take some time on Sunday (it's quite long) and go through it! why aren't you guys pushing for open source of it? Since it could be a useful tool for sure, just open source it so that tech folks can audit it and give us facts. **not opinions** ! We have been advocating this since the start of our public advocacy. 1. Quoting from [our analysis of the App](https://internetfreedom.in/is-aarogya-setu-privacy-first-nope-but-it-could-be-if-the-government-wanted/) : \"The only information we have of the app is its frontend and its rather pedestrian Terms of Service (TOS) and Privacy Policy. Other projects release as much information as possible in pursuit of transparency. This may include an accompanying manifesto, technical specifications, general FAQs, and even its source code.\" 2. The [working paper](https://internetfreedom.in/a-comprehensive-look-at-covid-surveillance-and-privacy-in-india/) has about 14 recommendations for government. For instance making it open source without having legal limits on its intended use will keep it open to function creep. Both these links are in the post above. I have been living under a rock. Is it illegal to not install the app? Yes, 1/ if you are in a containment zone. 2/ if you have to go to work. If you don't you run the risk of going to jail. As an employee and an employer. Longer explanation in the post above. Awesome. Again I appreciate your efforts but usually keeping the message simple just like supreme leader helps to reach the mass. It's a simple message - \"Government has nothing to hide. So let's ask them o open source and be transparent'. Now thag message can potentially go to the masses vs sophisticated tech terms which me and u can comprehend. Let's learn from the supreme leader. Keep the message simple and stupid. Am sure we will get lot more people educated thag way. Sorry to be blunt, but most of the signatories are activists/artists/political groups which have little understanding of technology - whether it is software or epidemiology. These guys cannot be considered legimate authority on this issue. In the quest to get larger number of signatories, every tom-dick-and-harry has had a go. Appears so. Although I have no Idea how it does not breach any fundamental rights Thank you for the work that has gone into this. But to be honest, are you hopeful the govt. will even take these points into consideration? I know this isn't the first instance where you have stepped up but I'm not sure how your past experiences have been and whether we can hope to get even a \"we'll think about it\" response. Excellent work. If it was not for groups like yours we would have lost our privacy a couple of years back. Well, it's not modi's decision. Is it ? There are people who work above the likes of modi sort of in all countries who have real power. One who controls everything. Similar things does happen in every country. Thanks! We have limited resources to implement graphics and video which are usually effective ways of reaching more people but are putting more of them towards it as we receive support. You can check out our instagram for more direct messaging. [https://www.instagram.com/p/B-9vMbNJToe/](https://www.instagram.com/p/B-9vMbNJToe/) 1/ We have to work in good faith but with caution. IFF always engages with government in the hope that they reciprocate. While realistic assessment is that they might now., we step up on an escalation matrix. 2/ Our past interventions on disclosure of the vaahan database, disclosure of lists of persons in quarantine and the social media communication hub have been public victories in recent times. This has been not our individual effort but through alliances and collectives. There are many more private victories. 3/ The nature of all our work is towards medium to long term change. We are receiving greater support and our community is growing (based on raw metrics of website visits, social media engagement and growth in organic, grassroots donors). Today we need to accelerate this and that is a challenge. All of us hope we keep receiving your support which is essential in times like this. Thank you, its really motivating to hear these words. 1/ We first reached out to labor unions and made the demand list in Hindi (linked in our previous blogpost). This was followed up by active inputs by one union which even gave us suggestions. 2/ The joint representation is on the basis of a larger working paper that is developed over a period of time. That was also sent to these organizations. Many of them come from the grassroots and understand the risks of exclusion due to technology due to felt experience. 3/ The signatories in the organizations include digital rights groups. We also to be frank find your comment on activists to be generalized and unfair. It disparages their work and experience. 4/ The list of individuals includes former civil servants including those which served at high positions including at the Ministry of Electronics and IT. Open sourcing client doesnt matter. It's the data on the servers that's going to be misused. Data has become an important source for governments. The more personal information they can get, the better strategies they can put up for the elections. For eg (even though it’s irrelevant): Cambridge Analytica. It was a medium to push propaganda. Thank you so much. Our country is lacking very important and essential data protection bill. Organisation like IFF help us a lot. Thank you for fighting the good fight [u/InternetFreedomIn](https://www.reddit.com/user/InternetFreedomIn/) ! Have donated to you before and will do so again. You're gonna need it more than ever in this dire situation. Edit: how can I get my name added to the joint representation you mentioned in the first part of the post? Again me and u understand. Not the masses whose privacy we fighting for. They don't know what's a client, what's a server... Let's try and make complex terms simple just like the supreme leader does. He takes a complex problem like corona and says light a candle but from home. The latter is his objective but the former is the simplicity. Again it's not a critique. It's how I figured to counter him. Make it KISS (keep it simple stupid). Just like that masses will light the 🕯️ for their data privacy. What about people who don't use a smart device? You can't unfortunately (we already sent it to government) but can quote tweet on twitter and help get the word out. Also, drop us an endorsement at over [policy@internetfreedom.in](mailto:policy@internetfreedom.in) . We will add you to the email-list of people who endorsed this representation, keep you updated... and the way things are going there may be more avenues for collaborative action where we will need everyone to chip in. Also, thank you for your generosity -- you are right we need to widebase and grow our number of donors and members. For those who join the team -- we love you 3000. &gt;Thanks! We have limited resources to implement graphics and video which are usually effective ways of reaching more people but are putting more of them towards it as we receive support. You can check out our instagram for more direct messaging. Posting this again since our reply may have been removed as it was an instagram link. \"Thanks! We have limited resources to implement graphics and video which are usually effective ways of reaching more people but are putting more of them towards it as we receive support. You can check out our instagram for more direct messaging.\" For finding our page just search for it as, \"Internet Freedom Foundation\" in your favorite, privacy friendly search engine! Thank you, there is a fascinating book on this called, \"Seeing like the state\". We hope you enjoy reading it. . Time to pull out Lumia windows phone from drawer. okay the french researcher who exposed multiple loopholes in m-aadhar application is now working on Arogya app. There are no exemption categories at present and this is a massive cause for concern. We do not have any clear answer for this. What the fuck did I just read I don't understand why you people are protesting this move. You do some great work, nothing against that, but right now, if you're going to work or are residing in a red zone, having the app in your phone helps the gov. in monitoring, which is kinda required right now. Of course , the source code can be shared but is it really your priority? Convince me otherwise (if you want to) Download the app, and put extreme battery optimisations on it. Indians will hand over their rights and privileges to this government with the thunderous clacking of their utensils. Is Vaahan database no longer publicly searchable? Good idea. I will get my Nokia E6-00 out. &gt; Open sourcing client doesnt matter. It's the data on the servers that's going to be misused. Both are important. At the same time, the fucking government has no business tracking all our movements from point A to point B to point X. This virus has given them carte blanche to introduce new regulations that will put virtual collars and dog tags on the necks of all the residents of this shitstain of a country. BC agar baki jagah chutiyap chal raha hai toh chalne do, yahan kyun chutiyapa lana hai I hear you. Will do ma level best to educate. Coming froma startup I knw how it feels to run on limited resources. Don't give up which I know y'all won't. Eventually this is gonna awaken. It's time to find the simple message like govts do. Like we said full results will come in the medium to long term. We managed an incremental victory with the partial concealment of names. Link to newsreport below. 1/ The intervention : 2/ Ministry's response : This is ridiculous. What if I do not own a smartphone? Go democracy go? We rather like the chant of, \"No surveillance, no\". As we explained it applies to two categories. In the second category it applies to all workplaces -- all over the country. Not only those in the red zones. Not only IT parks or lawyer's offices, but small go-downs, the unorganised small workshops we see spread all across our country in small towns... basically everywhere. And, if you do not have the app installed you can be criminally prosecuted. As an organisation whose mission is to protect constitutional rights this coercion does not square with our values. Thank you for your good work! As we stated there are no exclusion categories. The language places focus on the contrary by stating and we quote, \"100% coverage\". Cause such things won't back off so easy,one way or another it'll bound to happen. The roots extend internationally. The modi is just a tip of iceberg. Just a face for public. He's guilty but pure evil is hidden from public view. I appreciate your constructive criticism! Kudos!👍 It won't resonate with the masses, who have no understanding of privacy in the physical world as we know it (*lajja* is not privacy) and absolutely no understanding of privacy in the digital world. The first step to obtain physical privacy is an understanding of personal space, and that does not exist in India. The worst part is KISS does not work for philosophically technical concepts like these, and when conceited ministers argue towards the more basal instincts of the masses and change the narrative to \"it's food or it's privacy, make your choice\" they turn public opinion against all those who actually think about the long term development of this country. The failure to understand that losing power to a higher authority makes it extremely hard to get it back is also a major cause. All the social progress we've seen around the world, where the people obtained rights from the government, took decades if not centuries to spread wide. This government essentially uses the lessons from Lenin or Mao's revolutions, except for a different cause. But then I am innately pessimistic about this country and have been for the past several years, so don't mind my rambling. I support freedom of internet and right to privacy. But what is your take on combating Covid19 if there is no contact tracing? (Given the fact that contact tracing is the only means to trace the spread) I genuinely am concerned about the challange we face as we compromise right to privacy, but what is the \"solution\"? How to trace? Even though you're down voted, I second your views!👍 (Also I appreciate the reply) I have similar values, but, as I said , if you're going to work OR are residing in a red zone, you need to be monitored as the no. of cases from now on won't increase uniformly but in small bursts, for example ,someone gets infected and comes to work he can cause multiple transmissions, and that's why the gov. is making it mandatory to download the app. I'm a medical personnel, so I can attest to it that it will actually help to prevent that burst of a few hundred new patients if we get the info early and are able to quarantine the people that came in contact (data which we will be getting from the app). As for the part of the criminal prosecution, I'm no expert, but imo it's only going to be enforced if you're adamant in not downloading it, which won't be happening for the common person. As for the privacy issues..... If you read all the documents, it doesn't really send out any private info that can't be accessed normally. Also , in a pandemic, cooperation is key. Again. The installation of the App is mandatory for workplaces in all zones -- not only in the containment zones which are within red zones. Samsung Guru 1200 get back to work Please go through this detailed working paper here : Specifically the 14 recommendations for contact tracing (if any) on Aarogya Setu start from Page 72 at Para 83. Thank you! We will be resilient. What are you on about? This app does not work on rooted phones. I will be showing anyone if they ask for it. I'm willing to carry a Galaxy S20 that government gives me for free with this app installed. Or they can install it on my Nokia 3310. Just letting people know that to not fall for such easy tricks, the guy pronounces donald as doland and you think he's mastermind behind all this ? Nah, he's just a actor to always stay in focus as a distraction where the real mastermind is someone who we don't even know yet. Mudi is just a cover , a mask. More on this here : [https://www.reddit.com/r/india/comments/g8bbxl/legal\\_notice\\_to\\_becil\\_for\\_its\\_tender\\_to\\_procure/](https://www.reddit.com/r/india/comments/g8bbxl/legal_notice_to_becil_for_its_tender_to_procure/) Then we fundamentally disagree :) &gt; Again me and u understand. Not the masses whose privacy we fighting for. They don't know what's a client, what's a server... &gt; It's a simple message - \"Government has nothing to hide. So let's ask them o open source and be transparent'. The hole in this argument is that the govt. will just open source the client, and say we open sourced it. And then you will be at a loss explaining what's backend what's frontend to the masses! I trust my data with 1Mg and Makemytrip. This is what happens when ppl lose their minds due to quarantine No I mean this literally blew me away. I was not aware the problem has reached a scale like this You are not making sense. If the data is going to be misused, there is no benefit to open sourcing. The question of whether it is simple or complex does not arise. Plus what do the masses understand what is open source and how it is transparent? Freedom 251!!! u/InternetFreedomIn I have a doubt. What if I am not going to work (I am just student who has online classes) and I am not living in a containment zone, is it still illegal to not install the Aarogya Setu app? Also by containment zones do they mean only red zones or something else? It's not a problem, it's **fear-mongering** If you go through the privacy policy of the app, you'll know! Now, these ppl aren't believing the privacy policy of Arogya setu, but they'll believe the privacy policy of Facebook google who have been proved to be providing data to NSA (PRISM project) Why isn't anyone talking about this? Not even the mainstream media is covering this topic Does seem like a nice move by the Modi government... Bringing the aid of technology during these times With PRISM project too &gt;someone gets infected and comes to work he can cause multiple transmissions, and that's why the gov. is making it mandatory to download the app. I'm a medical personnel, so I can attest to it that it will actually help to prevent that burst of a few hundred new patients if we get the info early and are able to quarantine the people that came in contact (data which we will be getting from the app) How will the data be collected from the app ? Can you explain in detail. As a tech-noob, I have a question. I don't know how open source works so forgive me if its a stupid question. Can't they just put the good code (which doesn't show any data-stealing) available online and use the bad code(which steals the data) for the app? Sure. Will check it out. Open source basically tells the code &amp; its functions, so whatever the app is doing with your info or devices can be seen u/InternetFreedomIn How can I volunteer to your work ? Let me know. Govt: Keh diya na ... bas keh diya! No matter what petition you put forth, nothing is going to change sadly. Covid19 has become a nice excuse to implement authoritarian control in most countries. Mass surveillance, imprisonment of critics and so on. Did you know they are the one who made the app (1mg, makemytrip) Sort of, cause i know a person like our PM won't reach at his current position only on his own. He definitely has allies who always at his disposal to do his A to Z job for him. He's not some high IQ high functioning sociopath who knows every shit, but instead complete opposite of it. Think practically, guy isn't even much formally educated to be as smart as being portrayed and presented. It's all a well acting with good script. Might want to reach out to by twitter or his protonmail address : fs0c131y@protonmail.com . He was the French Security researcher who disclosed Aadhar data being publicly accessible via google, and has found several bugs relating to Aadhar. Elliot is a pseudonym. Aadhar profiles can still be accessed by googling on some private firm websites and a few public ones. I checked today and **found a forest department website having someones Aadhar**. He currently has indexed a list of updated [covid-19 tracker apps on github](https://github.com/fs0c131y/covid19-tracker-apps) It'll be worth mentioning that Aarogya setu has been made mandatory, and reverse-engineering the app is [a violation of ToC](https://sflc.in/our-concerns-aarogya-setu-app) \"“...You agree that you will not tamper with, reverse-engineer or otherwise use the App for any purpose for which it was not intended including, but not limited to, accessing information about registered users stored in the App, identifying or attempting to identify other registered users or gaining or attempting to gain access to the cloud database of the Service.\" What we can do about this ? I am going to bring back my lumia 535 . Fuck this shit Glad someone actually fought back. These Governments think we will bow to their use of our data by manipulating us at these dark times. I don't think the government is straight with their agendas. If they were the PM would directly intervined the Ruccus spread by the media. A big no to their draconic agendas. It's not just about us but the safety of our young ones who can not ask for justice or know what it is. If organizations doesn't have a work profile (MDM) they are already in breach of privacy of the user. Having BYOD at workplace could lead to some serious threats to organizations. Having an app by government is the last thing they want to worry about. I work as a security researcher before back slash please research thoroughly. That's the dick of government poking the people and inseminating our thoughts. It's always going to be an excuse of implementing for the greater good. Only they know the good which is a greater bad. Okay, so all I wanted to do was give you a normal, tech noob, everyday guy's opinion. You replied to all my comments and you basically repeated what I already said in my comment, adding no new info. I wanted to understand what you meant by all the tech stuff like servers and clients and the info the gov. might get and how it might actually affect me, as all the info you're giving is already there with the gov. (Licenses and aadhar cards and what not). I like debates as they lead to a full knowledge of the topic ( for and against) , but you have not given me anything worthwhile or even an argument. Also \"\" does this mean that a false positive entails that I cannot use public transport and go to work or leave the city to visit friends?\"\" {From the link}, it's lockdown , you're not supposed to be going anywhere. Again,i wasn't trying to pick a fight, but was looking for a good conversation. So After getting downvoted a lot , this noob shall go away. Peace out. Open sourcing of the app wont help, why? There is no way you can make sure the open sourced source version is indeed running at the backend, you have to go by their words or rely on expensive auditors. Who will pay for them? Open sourcing critical apps like these could lead to serious security disasters, for instance if the app has a critical bug which is not caught by the dev team and someone with malicious intent discovers it and exploit it in the wild, who will you blame then government? Everyone in security industry accepts the fact that no system is 100% secure and there is a possibility of vulnerabilities in every system out there. Realese of such critical source code is beyond imagination. At most we can request is for an external auditor to audit the app and that's it. Asking for source code is foolishness and nothing else. Time to switch to nokia 1100 Through contact tracing, as soon as we get the info that a person developed the symptoms and is tested +ve, we can then go and check all the people that the said person had contact with , and we can immediately quarantine them, preventing further spread of the virus. Its possible. But if we know source code and how it should work. We can reverse engineer it and compare to see if there are any mishandling. But also main concern is data collection and since it is stored remotely in a government facility, there is hardly any way to ensure compliance there. As a citizen we should do everything in our power to protect our country u/internetfreedomin does the app work with A DNS / VPN on? Could you then *hypothetically* be charged for using a DNS or VPN? If I install this app and then uninstalled it, will i go to jail ? Also is it mandatory to put real name in the profile? What is contact tracing? How does the app accomplish it? &gt;we get the info that a person developed the symptoms I read a report from Europe that almost 81% of positive cases (in lockdown) caught during testing were asymptomatic and were undergoing routine testing. &gt; \"it's food or it's privacy, make your choice\" they turn public opinion against all those who actually think about the long term development of this country. THIS What to do if one does not have a smart phone? Or even a dumb phone. I am one of those who do not carry a smart phone with me. Thx for the great efforts guys! Could you explain what this will do? I'm supposed to go to work Monday onwards and I don't want to risk getting beaten up by goons Great effort. I am in it. When did this campaign start? Is it possible to for me to add my signature now? bhand chod kya kr rhi hai ye govment?! 100% of what? Indians, smartphones? Rooted phone here with magisk installed. It works now. The initial version didn't but after the latest update it has started working. The battery optimisation will prevent it from running in the background. Therefore it won't collect any location data in the background. If you are using Android, download the app to be safe (from police and BJP goons, not from coronavirus) . Then it is your choice to grant it the location permission or not. Your choice, your getting beaten up by police ka risk ( My advice is to ' Enable location only when using the app' option. Then as the final step, go to the settings&gt;apps&gt;arogya setu . Here, restrict battery, disable autostart, and force stop ( force stop kills/ terminates the app) Never open the app again, and you are safe. Be ready to get beaten up by ABVP/ Police :) Or just use an iPhone That app feels so creepy with all the information it asks for And what about the move to make arogya Setu a pre-installed program on our phones? This is more dangerous. \"Ungli pakdaao toh haath hi pakad lete hai\". COVID-19 is giving the govt an opportunity to get into mass surveillance and they are taking full advantage of it. We must not let them succeed. The country owes you awesome people a lot. I am one of the \"radicals\" amongst my friends who is trying to wake people to the truth about mass surveillance. It's easy to be tagged as leftist or BJP hater on these topics and be shut down by the loud idiots. Unfortunately only a few like us understand and have to fight for the rights of the simpletons who see everything through a political lense. Appreciate your efforts and I urge my fellow like minded people to donate to the cause if they can. Interesting. Thanks man. India is becoming more like china Ah shit. That was my only probable excuse. Now, I'll just have to disable the playstore and act dumb. No, you don't have to install it. This govt decision cannot be legally enforced. Thanks for this guys. Quite a detailed take. Rights and privacy shouldn't come and go when it's convenient. They should be constants, like a lighthouse in the midst of a storm. Hi. Let me explain how the contact tracing apps are supposed to work. They are supposed to work and store data offline. If a person has been infected, health officials will open the app and upload to servers. Constant location pinging to insecure servers, is not contact tracing. It is just short of full-blown surveillance. imagine, 50 million people, their location being sent every 30 secs. This is something that should be noted. This is a major reason why banks dont seem to use Open sourced languages and libraries for any of their software and are still sticking with freakin Java( Atleast some people from some famous banks told me so ). Although open source looks like a better thing for security in long term, it is a disaster for the security in short term like this. What are we supposed to do now? Install the app or do we have any other option as of now? You seem well read in Arogya Setu's privacy policy. Please put up a post refuting these claims. Prime Time on NDTV India had a discussion about this two days back IIRC Uhh Google already does it though with Google Maps. By default, it has Location History on, which stores a record of your location data. Google says that there's a delete setting but I'm wary of that considering it's part of the PRISM program Should have begun your comment with this, wouldn't have garnered the downvotes haha My Nokia 8110 4G agrees. They can port it, buy me a phone or stfu. Before quoting the 'PRISM Program' everywhere, learn the basics. Is Google Maps a contact tracing app? No. It is a navigation app, which would be shit without location permissions. Location History can be turned off in a few clicks. You see Google sending you to jail for that? If you don't trust that they delete the data, then you shouldn't use them. Security by obscurity? Really? What happens if you have a dumbphone? What happens if you don't have a phone at all? RIP privacy Using DNS or VPN won’t do anything. The apps collects location data and contact tracing. VPN and DNS would just change the route through which this data reaches their servers but not the hide the data itself. It's available on iphone too. #1 in health &amp; fitness catagory of Apple app Store No. It's available on iphone too. #1 in health &amp; fitness catagory of Apple app Store &gt;Happy cake day!!!!!!!!!!!!!!!!!!!!!!!!!!!! Shouldn't this be doable for the arogya setu app as well? Edit: The Twitter thread is basically about an Australian mobile developer who downloaded and decompiled the source code of the CovidSafe app and found that it was clean. The CovidSafe app in Australia is of similar nature and the Australian govt. didn't open source it. Lol, install it and just disable permission if you are paranoid about privacy. I am too broke to buy phone. Feel free to mail me one modi Yeah man, that's the best idea! Oh ok, but I am just a student, I care more about not going to jail. The information they can collect from me will be me always trying to do calculus or learning to code... (I am a student what morec an they get out of me, lol!) That is why I was concerned... thanks for clearing it up! After that so many scams happened accross country... Is there any website or a page which explains all of it? I want to forward in WhatsApp Instead of doing all these gymnastics, make a better app. Our data are already lost. I am sure half of us are in Instagram and going through all the click baits. The app does track your location and Bluetooth to ensure which devices you went close to. There should be an awareness of which is right and which is wrong. I think you people still have no clue about the severity of corona. Only if they can pin down all the people contacted with the infected, the spreading could slow down. I see this as a huge accomplishment. Data security is a lie, you should know that. If you ever used google AdSense and Facebook ads you would know these. Have a look at them. You will share all your data with Google and Facebook but not for the nation huh. Lol. Also, even if they steal the data i wouldn't care, nation has better things to be worried of. Corona &gt; privacy, period. When I click on privacy policy it leads to \"Error 403: Forbidden\" That is for government to know only? Its not irrelevant. It is completely in the context. It is declared illegal to reverse engineer Arogya setu. Could you please upload the slides somewhere downloadable? Thanks for fighting for us. Use web version of it, root android phone and install micro g if you need Google stuff. It's possible not to be tracked, use browsers which are barebone. James C Scott is the boss. My personal favourite is The Art of Not Being Governed. My old Nokia 3310 is ready. It's cute that u think u haven't already. Google and Facebook literally know ur personality to an extent. IMO, all software projects developed using tax payer money should be open source. Have you even read what the OP post says or are you here to bless me with your unsolicited wisdom? Haha , i just wrote what went in my mind. Didn't mind the downvotes. You should start make arrangements on how your family is going to live after you die. That makes this even more suspicious. Open source request as public official messaging. \"Govt ko kyon janna hai ki aap kab sandaas gaye, kab cigarette khareede\" as whatsapp forward. \"Privacy is a myth\". It's those people who agree to this statement are fighting back now. They will happily buy smartphone of Chinese make that are known to be spying for their govt (a foreign govt). But they won't install a simple app made by their own govt which has been praised by intergovernmental organisations and is aimed at helping the government fight back a pandemic. A democracy is a rule of the people where people don't support their rulers even for a good cause. Irony or hypocrisy? I'll tell the government I only have a keypad phone. Let's see how they install it there. I was just replying to ur comment on how u thought u 'were' going to lose ur privacy 2 years ago. Wake up, bro. Or atleast read up on some snowden files and some smartphone privacy articles. It's a fallacy that ur data is private. Nothing is paranoia ~~if it involves this govt~~ about privacy &gt;In the quest to get larger number of signatories, every tom-dick-and-harry has had a go. Yep, there's a \"cashless consumer\" in that list. Like wtf IFF? what a way to get upvotes fam can someone clear this up for me.. this app completely relys on user to give the correct answers to questions, say someone knowingly/unknowingly answers the questions wrongly to get the desired result? what then? also say i am an individual who actually has problem and diagnose through app, is there any feed back mechanism where it triggers some sort of notification to near by health authority to help them!? i think it should be that way.. but it doesn't seem so.. That's wrong, they can't force us. I'll happily go back to the old Nokia phone days than download this shit. AI + GPS tagging + BJP IT Cell = Humnoid Andh Bhakth. Are your masters so impatient to win another election round? Are they so scared that they have to send you out of all people to troll on the internet? I am all for the internet freedom. But this seems like a good criteria to make it mandatory. People in containment zone and people going out to work should install this app. They are at high risk of being infected and it is in benefit of people crossing paths with them to know about it. And they can always uninstall it after the lockdown ends and corona situation is stable. No one is saying there are NO benefits, people just want reasonable data privacy / legal guardrails in place before mandating usage. Guardrails are especially needed given there’s significant mission &amp; scope creep — the app now has payments, telemedicine etc in addition to contact tracing. Plus given that there are no exclusions allowed, what are people without a smartphone supposed to do? What about potential loopholes in contact tracing where the app cannot track human-surface interactions? Or interactions with infected but asymptomatic people, and so on. You’re right in saying that the app itself, theoretically, is useful. But we need to be vigilant and make sure sufficient guardrails are put in place so no one can misuse / abuse the system even in the future. Nah Well one thing others can do is report and drop the app's ratings on play store. Not much but a step. What basics are you talking about? Yes, Google doesn't outright jail you, but if you're on the CIA's list for whatever reason (terrorist, left wing President of a Latin American country against big oil), it's forced to give any data that's traceable to you to US Intelligence. Yes, Google Maps is not a contract tracing app, and no, even contract tracing apps \"would be shit without location permissions\". Location History and contact tracing work on the same principles. &gt;If you don't trust that they delete the data, then you shouldn't use them. Wow. What other viable alternative do I have to Google services, with the same quality and ease-of-use, that isn't in bed with the Pentagon? &gt;their rulers I like how some Indians are eager to elevate their governments to a position of monarchy. These politicians do not rule us, they govern us. We do not serve them, they serve us. Also, stop believing the government is some angelic entity that can do no wrong. Actual Privacy Policy: 1. Data is stored on a server operated &amp; managed by Government. 2. All info uploaded is deleted (even from the server) after 45 days of uploading. 3. All data is encrypted before being uploaded 4. User has to give consent for providing data So, i think there is no need to panic. Prove me wrong &gt;Sort of, cause i know a person like our PM won't reach at his current position only on his own. Eh. Not at all. Our PM lacks intelligence and knowledge about many subject areas. But he understands politics very well. Moreover, you're right that he's not orchestrating everything. But this illuminati and international allies is just bullshit. He has a dedicated team of PR agency and IT cell workers who are deep into data analysis and churn out stuff to sway people. This is of course not planned and organized by PM. But he gives the vision and his chamchas below handle the rest of the stuff. I'm unable to locate links to that article now but it was previously exposed by many independent media outlets like Scroll and Quartz. The company has a very peculiar name and has roots in Gujarat starting as some completely unrelated NGO on women empowerment. That is the social media engine or the \"Cambridge Analytica\" of India. If you watch the documentary The Great Hack (on Netflix which is about Cambridge Analytica), there is a portion were they show countries CA has operated for elections and 2014 Indian Elections is one of them. This was a practice ground for CA before they implemented their mind-bending social media manipulation during 2016 Trump elections in which Trump won. It'll be naive to say that something big across the world like an Illuminati is orchestrating all of this. Maybe it's true but the idea of that is so far-fetched especially because there are much stronger evidence of stuff being planned and executed within India. This is true for all the apps. Fixed? Do you guys just upvote anything that is anti-government? I really don't know much about illuminati and stuff, all I'm saying is he's not a mastermind but just a another puppet with a role to play. And same is with other countries. Health and Fitness? NANI So very many terrible things have started with the \"greater good\" argument. No, we do not need *surveillance*. We need *awareness*. They're two very different things. It's one thing to honestly, transparently release an app with a complete rundown of what it does and why it would be advantageous to install it. It's another thing entirely to *command* a population to \"install it or else\", and even worse when there's no transparency and no redressal of concerns. What if I go off the grid. Bye bye Reddit? Can they still jail me?? LMAO is this serious ? I got a notification from my college to install this app. Hey any of you dumb smart assholes know how this app works Try searching for privacy- preserving contact tracing For you dumb lazy to search anything try watching this video on YouTube Any edited to app here is the thing, if the opensource the client, i can for example 1. view what all is configured to send to server and if it is valid or not. 2. build a client (APK) from the code myself and put a alert and add a send me everything that the app sends to server. 3. host this self built apk's for other to use for those privacy concerned.  right now to achieve, that i need to use wireshare and see at encrypted data. Hiding information is significant part of information security. Source code is something which is considered as a core of a product. We block open ports and disable banners from service response becausewe don't want to leak information, and it is not opinion it is industry standard. Working as in working to find out more flaws or literally working with the devs? This is arogya setu astra dude - sudarshan chakra of Mahabharata giving power to kill all suspected. I am out on on old blackberry. It's damn safe. There are no masters of mine. The problem with people who consider themselves to be the only knowledgeable people on the planet is that they get buried under their own hypocrisy. I am a person who supports the government and not the party. You being an informed voter (which I assume, you are) have the right to change the government and I will still support the government and NOT the party. But people like you have become so blind by hatred towards one particular political party that you see everyone through the lens of same hatred and every pro-government individual is either a troll or a brainwashed idiot for you. The same kind of attitude was seen back in 2013-14 when the Indian mass elevated one particular individual to the rank of a saviour. But you people are born with a thick skull never to let sense enter your mind. There is a slight difference between governing and serving. In a democracy, people elect a government and they govern the people. But, they don't serve the people. At least, not the sense that the spirit of governing as has been laid out in the Constitution is compromised. And every support for something done by the government is not an eagerness to elevate the government to a position of monarchy. Every staunch believer of the Constitution would disagree with even the idea of it. But the Indian mass seems to have forgotten that they can still show some support to the govt without worshipping the individuals who hold the office of the govt or can still oppose the govt without being blinded by hatred towards the same individuals. I do not know what angels are. So I would like to neither believe or disbelieve that govt is one of them. But can the govt do wrong? Yes, it can. Is there any inherent problem with the app being discussed? Well, I would say there are apprehensions about the misuse of data which is why, it is important to back it by a legislation (or a ruling by the judiciary). This will limit the scope of the data usage by the government and hence, will help protect people from their personal data being misused. But, the option for the government to use such data for the benefit of the general public (such as to slow down the spread of a pandemic) should be kept open, imo. And this is the only reason I support the app. So stop accusing people of being eager to elevate the government to a position of monarchy. Be reasonable in both support or opposition. In either case, there is no place for stupidity. Guys any clarity on if or not its gonna be pre installed on devices in the future ? Is it illegal to not download it ? Idk I mean rights are not optional – that they should apply and the standards to which they should apply do not change with the situation. In addition, given this govt's history, a platform like this is almost impossible to repeal / improve / fix later. Look at aadhaar. I understand the importance of contact tracing, but we're not talking about ONLY that. Neither are we talking about _an_ app that could do this, we're talking about THIS particular one, and the fact that the government is using all of its might behind pushing it. Does anyone here really feel like they'll make changes once they have 200-300-400 Million downloads? I would like to thank you in Triggering me to Login into my Account and rant about how stupid you guys can be. You guys talk about Privacy but I can assure you 99.99% of Ppl in the list: use Default Search Engine as Google, Use Facebook, Twitter, Instagram and Snapchat and post your Whole life there. Use Chinese Android Devices which all come with their Own Sets of Bloatware and tracking which most of you dont bother to turn off/Disbale. You Guys use Youtube and Sell you Data, You guys Use Google and sell you loaction, Email data, Drive, Contacts, Search History, Browsing Habits, Device Habits and Etc. Use Windows 10 with all Telemetry on: selling your Data to Microsoft, Use amazon/Flipkart: You are selling your Shopping habits and needs there. You Use Chrome as you default Browser, You are selling more of your Privacy. So guys in these list dont have any rights to talk about Privacy at all. Many of them can be Reverse Google Search and we will get detailed Info About them floating on Internet. If you want to even start considering getting any Sort of Privacy, then Use: Linux, Android With Gapps, ProtonEmail/Tutonat/etc, No social Media, invidio, No Online Shopping/Account, Use Firefox with Blown Privacy setting On it, Get A God-Dammed AdBlocker + make it more powerful by adding lists to further Curb your Privacy and I keep on going.  So please dont talk abt Privacy when all of you have already sold your Data and when the Government is doing something abt Trying to get much better Data to analyze Covid Patients so to avoid False +ve to reduce time and risks. Seriously, This is plain old Stupid beyond Measures. If Gov Dont do anything, you guys will rant that India Doesnt do anything, If Gov does anything then you speak against it. If you are asking Gov to Open Source apps, then go and ask big Cooperates to Open Source thier Apps and see what you get in reply. Mwonuse The virus is not going to go away anytime soon, and Governments will have to open up the economies, whether two weeks later, or two months later. Will this app be mandated for everyone then? This is a huge privacy issue. As someone who doesn't even share his Aadhaar, my only option would then be to not to go to work and work from home if forced to install this app. 1. While I may have that choice, the majority don't. 2. It is an encroachment of my fundamental rights as I will have to choose between privacy and freedom of movement 3. What are the legal safeguards preventing misuse of the surveillance data collected by the app? 4. Where is this extremely sensitive data being stored and is the technology used sophisticated enough to prevent the attempts to hack this data? &gt; use Default Search Engine as Google, Use Facebook, Twitter, Instagram and Snapchat and post your Whole life there. Yawn. I don't use those. So am I allowed to be critical of this? Also, did you just compare an entity that has a police force which is known to arrest people at will, with entities that don't? You seem to not understand the meaning of *consent*. If people consent to give their data to Instagram, that's their business. They're being stupid in my opinion, but again that's their business. The govt though is coercing people to install an app that will be spying on them. I would have the same objection if the govt forced me to install Instagram. I agree that Arogya Setu has a positive use at this point in time, but nobody knows how long the data will be retained and who it will be sold to. Sure the govt has given assurances, but the same govt has also told the Supreme Court earlier that the citizens of this country have no right to privacy. When that is the officially stated position of the govt, it is quite rational to be deeply skeptical of its commitment to privacy. We have no way to verify that they will actually delete the data after 45 days, no way to verify that private players will not be given access to the data. &gt; If Gov Dont do anything, you guys will rant that India Doesnt do anything, If Gov does anything then you speak against it. The govt can do many things. They could have ramped up testing earlier for instance. They could have refused visas to the Tabhligi Jamaat when it was known that they were coming from Covid-affected countries. They could have taken action between 16 Mar-23 Mar when the Delhi Police station was right opposite the Markaz where thousands were congregating. Even now, I wager there are several things the govt can do instead of wasting the time, efforts and fuel of the Air Force to shower flowers. &gt; If you are asking Gov to Open Source apps, then go and ask big Cooperates to Open Source thier Apps and see what you get in reply. Again a false equivalence. The corporates that keep their source proprietary, are doing so to preserve their competitive advantage. The govt has no need to do that. How do you verify that those points are being followed? And what legal recourse do you have if they are not? This is not an idle question btw - this govt has in the past told the Supreme Court that Indian citizens have no right to privacy. So I see no reason to simply trust that they will keep their word and not simply change the rules once they have the data. &gt; Well, I would say there are apprehensions about the misuse of data which is why, it is important to back it by a legislation (or a ruling by the judiciary). This will limit the scope of the data usage by the government and hence, will help protect people from their personal data being misused. Has this actually been done? If not, what assurance do we have that a govt which believes that Indian citizens have no right to privacy, will bring in any such legislation? This is not a reflexive refusal to cooperate with the govt, as much as it is that the Indian govt has repeatedly shown a disrespect for people's privacy and a lack of seriousness on data security. The govt is asking for a level of trust on personal data that for many citizens, it has not earned. &gt; People should worry about the greater cause rather than wasting their energy over talking about how making an app mandatory is an infringement on their rights The problem with this argument is that once the app is installed and the data collection begins, then the genie is out of the bottle and people have no control what the govt does with the data. And therefore the govt has no incentive to protect privacy. Especially this govt has in the past even denied that people have any right to privacy, so on what basis can they be trusted to use the data for the intended purpose? For this reason, the implementation of legal and technological safeguards cannot be an afterthought. It has to go hand-in-hand. And it cannot simply be a verbal assurance by Ravi Shankar Prasad, it has to be law and there has to be legal recourse that citizens can take against the govt if the govt breaches this trust. First of all, everyone in their mother who owns a Xiaomi is obviously infuriated about this and there are going to be sanctions on it no doubt. Second of all, a person can be criminally charged for not installing the setu app. Data is the new currency and people should be free to choose how they use it. As far as data is concerned, I'm obviously going to choose Google because of their security and fuck facebook for not even salting or encrypting the passwords, but the government of India is on a whole new level on their aadhar card data leaks and that's why I'm not going to share my data with people who can't even acknowledge that their security needs some serious reworks. I am not questioning the opposition. I'm questioning the ground for opposition. Coercion I shouldn't be the issue as far as the purpose is maintaining public health or public order or similar grounds on which the government is empowered to act. The apprehensions about apparent misuse of data and ways of checking it should be the ground rather than ranting about govt cannot force people to download. They are the government, they can force. Grounds for such action should be reasonable. Has this been done? No it has not been done (or so it appears till now, kindly enlighten me if otherwise) which is why I highlighted the point and which is why I support a judicial action for the same. I'm opposed to people making an issue out of coercion every time the govt tries to do something mandatory in order to serve a higher purpose. Hope you get my point. No. Any person owning a Xiaomi should NOT necessarily get infuriated and start accusing people of worshipping an individual which he doesn't. But that's another story which we should leave behind. Should people be free to use data in whichever way they need? In a purely commercial sense, yes (currency is commercial perspective). From a purely security perspective, yes. From a governance perspective, it is debatable. If the government can ensure that they can provide adequate security to the data they collect, they can collect it for better governance (and better governance only). Which is why, I am opposed the idea of questioning their way of using the app for controlling the pandemic. I am opposed to people who try to make an issue out of coercion every time the GoI wants to make something mandatory for better governance. However, data security is of course, a serious issue which is why I support a judicial action in that regard. Either the court will direct them to maintain proper data security standards and back the app by a legislation which will prevent them from misusing the data ot they should do it themselves. Horny girls are only supposed to take out their bras. Don’t think too much 🤮😀 And that's why people are asking/demanding for better privacy laws in India because it just might be useful from a governance perspective, but it also also might just be extremely dangerous to say the least from a citizen's perspective. IMO, before they ask (or in this case, force) their citizens to give them a new type of data which exposes them even more, they should learn to correctly handle and protect the existing data which they already have. Another inherent flaw of the system is that if people know they're being tracked, they can easily just leave their devices at home and nobody would even know the difference. Just imagine in a dystopian future where you're forced to wear a GPS tracking watch which reports your medical status for \"your own benefit\". Would you like the idea of having a dog collar on your neck knowing that the government knows everything you do and it's illegal to tell them that it's none of their business? If the groundwork isn't laid out this second, then everything would just be meaningless as India would be the next China or Russia where free speech gets you killed. After the e-cigarette ban, it's clear that they don't give two fucks about whether their citizens die or not. All they're really interested in is vote grabbing to stay in power. Their biggest threat is for people to think for themselves the extent of damage they can do for their own benefit. I'm sure you've read about hospitals refusing patients, cops beating the living shit out of people until the literally die and workers walking thousands of kilometres just to go back to their homes and are dying in the process because of starvation or exhaustion. Even children aren't spared from this. So, the definition of governance is different for them as it is to us. For them? Governance means control and the security of their power. For us? It means our safety and rights to be humans instead of being treated like dogs with a collar to their neck. Like the BJP has already used services like Cambridge Analytica to win elections and now they're the party who has the majority control in the Parliament. It's not just BJP, it's all these new governments who've popped out of the woodwork in the last half of the decade by using targeted advertisements and using their social media \"influence\" to basically snatch all the votes by dirtying up the opposition party's politicians despite being just as devious as them. It's like the pot calling the kettle black. The BJP called the Congress government totally corrupt, which they were, but the BJP aren't no saints neither. They've literally made corruption legal with the whole electoral bonds bullshit. So no, that's why the government first has to earn my trust before I blindly trust them again. Fuck me once? Shame on you. Fuck me twice? Shame on me. Heh, i am continuously using the 625 since 2013. &gt; No it has not been done (or so it appears till now, kindly enlighten me if otherwise) How would we even know what has and hasn't been done? This is the issue with zero transparency and zero safeguards in case of a breach. Also your line of thinking is flawed where personal data is concerned. Because even if it isn't being done now, once the data is with the govt you don't know where it will be used in the future. What's more, the nature of data and analytics is such that you might not even be able to imagine what uses it could be put to in future. For example if before 2016 somebody told you that Facebook would be used to spread fake news in a targeted manner to manipulate elections, would you have believed it? The data for that was not collected instantly, it has been built up over time, before anybody knew that is what it would be used for. And with regards to a higher purpose, it is trivial for the govt to create a higher purpose for any action. For example Internet surveillance can be justified for the higher purpose of preventing child pornography, as many countries are doing. Higher purpose should not be treated as a blank check for the govt. EDIT: the [T&amp;C](https://static.swaraksha.gov.in/tnc/) of the app states the following: &gt; You agree and acknowledge that the Government of India will not be liable for any claims in relation to the use of the App, including but not limited to (a) your inability to access or use the App or the Services; (b) the failure of the App or the Services to accurately identify persons in your proximity who have tested positive to COVID-19; (c) the accuracy of the information provided by the App or the Services as to whether the persons you have come in contact with in fact been infected by COVID-19; (d) **any unauthorised access to your information** or modification thereof. So note what the govt is saying: they are not responsible if the app is inaccurate (and this defeats its very purpose) and they are also not responsible if your personal data is accessed by people who are not authorized to do so. Is there any doubt left on how opaque this is and how it is trivial for the govt to use it for surveillance? It also begs the question that if the organization that is forcing everybody to install and use this app and provide their data, if this organization isn't responsible to ensure that the data is accessed by authorised people, then who on earth **is** responsible for it? Who else could possibly be responsible for it? Yeah. You forget Facebook, Google+ Scandal.. and the fact that you have been using 1 single account on Reddit for past 9 Years with so much activity speaks volume regarding you privacy concerns. So you are not qualified. And then What about their consent with Xiamoi and Chinese Manufacturers. They dont seem to form a parade and ask them to do anything. And lastly, the amount of tracking a website does without your permission is very insane which users dont have an idea abt. And why would government need to sell your data? Seriously, a private firm has way more possibility to sell your data then a Government. And Government is keeping it proprietary so that it doesn't get abused. The Government could sell the whole app model to other Govt and make money out of it. And why people are so hung up on ramping up testing. As if government is just gonna make Testing kits out of thin air and for free. Here, People know how to make kide like a factory only. and Seriously, then expect from Government subsidy to feed their mouths and etcetra. Its the most idiotic thing to say. Instead of Testing random people who are not gonna get infected, testing ppl based on their contacts Would increase the efficiency by a lot margin and less losses of life. you as a no one, might not know, but when there is no medicine, the best way to fight this disease is to keep people motivated, to give the, hope and support. By doing all kinds of things like this gives people a sense of belonging and hope. You might not know this but someone close by had COVID and he told me how when he heard all the Sounds on that day made him more hopeful for his life. (And Fuel is dirt cheap by the way now). And abt whole Markaz thing, Dont even get me started. I'm sure If even write anything you guys would jump the Gun and call me Right-Wing and shit not(And Possible Ban). We all know what how much such minorities would have heed the call of local police. they were not allowed to even start the whole gathering in first place, but they did. And in the End a threat of Commandos got them out. Yes. As we feared the NOIDA Authorities made this very, very clear. Not yet. We are going to file RTIs even though getting really evasive responses till now. 1/ Actual privacy policy is a one-sided contract that can be updated at any time. This privacy policy has actually been updated after we released our working paper to address the most obvious flaws. 2/ The privacy policy does not link to any enforcement framework or permanence. We do not have a data protection law and there is no legislative basis (which limits its purpose or data retention) for such limits. Hence, any future changes in this privacy policy wont be a problem. 3/ You are being asked to trust, but not verify. There is little to no transparency even till today who is building this app, who has access to the data and with whom and how it is shared. It's fine if you feel comfortable installing it, but surely this should not be made mandatory for others under the risk of them being sent to jail. It is mandatory for people even outside containment zone. For instance in Noida. You said ? How is jailing people for not installing this application a, \"good cause\" ? Hmm.. let us check internally. You are right we should not be locking our infographics behind any social media platform. Give us some time to implement this at a systems level. We have filed RTIs but replies are evasive. Will try to get more information on this. We were under really tight timelines. There have been some learnings for us on how to do this in future. Will give more lead time and reach out more actively for encouraging a larger number and diversity of sign-ons. Thank you! Yay! Thank you! The app is meant for maintaining public order and for containing the spread of a pandemic (public health). There can be reasonable punishments for not cooperating with the authorities. Nothing wrong in that. Don't make an unnecessary issue out of it. Also, do read the new guidelines on how the data can be used. Well it's your job to know what has been done or not been done before you make an issue out of it. My thinking may be flawed but your thought is not thought at all that says, \"We don't know what has been done or not\" but still intends to convince people with confidence that what has been done will result in their misery and it's easy to demonize the govt. Also do check out the new guidelines on how the data can be used so that next time someone asks to enlighten him about it you don't come out with a vague answer and still accuse that person of having a flawed thought process. Also, this is for maintaining public order and for containing spread of a pandemic (public health). There can be compulsion from the authorities for ensuring compliance and there can be reasonable punishment for that. This is all constitutional. So stop making an unnecessary issue out of it. Just because you don't intend to comply, it doesn't mean the govt is acting unconstitutionally."
}