{
    "id": "1f0squ5",
    "title": "Inflation and Bottom Up Growth",
    "url": "https://www.reddit.com/r/india/comments/1f0squ5/inflation_and_bottom_up_growth/",
    "selftext": "**Prologue**\n\nI have always felt that the Hindi term \"mahangaee\" is a more apt term than inflation. Mahangaee, which means costliness or dearness, captures that things have become more expensive than one's salary increase or aamdani.\n\n**The Auto Ride**\n\nA few days ago, I was in an auto describing inflation versus salary increments to my better half. When she seemed to be getting it, I asked the Auto guy how much he made in 2014. He thought for a while and said about ₹500 a day after deductions. Then I asked him how much he earned now and he responded about ₹800 per day. Then I asked him about \"mahangayee\" and he went on a rant for 5 minutes.\n\nAt the end of his rant, I told him that 90% of Indians were in this situation, while the likes of Adani and Ambani had become richer.\n\n*Exhibit 1:*\n\n[References for the top 10&#37; and bottom 90&#37;](https://preview.redd.it/qdutajzm4skd1.jpg?width=1600&format=pjpg&auto=webp&s=58c8a179618441a0a659999885a16c8ce7899a06)\n\n**Trickle Down**\n\nI asked the auto driver, Dev, if he knew of any country where the rich enabled the nation's poor to have a better life and he said no.\n\nExactly! (I exclaimed) in a country of 140 crore people, if you do not do the job at the low pay, then they will find someone else to do it.\n\nAnd if the government is in their pocket (I continued), then although Crude oil prices have come down from their high of 2014, the benefit has not been passed to the consumer, enabling the likes of Ambani to grow richer and spend ₹5000 crores on his son's wedding. Dev complained about the increase in recharge at this point.\n\n**Bottom Up**\n\nOn the other hand (I informed Dev) if the poor had more money, they could spend - on biscuits, phones and even maybe 2-wheelers. If the poor do not have money, consumption will decline, and eventually, there will be no demand for factories to keep producing.\n\n**Conclusion**\n\nThe sustainable path to making a country rich is by making its people better off.\n\n**Epilogue**\n\n*A simple 8-minute discussion can help people see the light. Please, help spread the word. It will not work wonders in a single day. But just like the movie Inception, it will germinate and grow into an idea.*",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1724579360.0,
    "convurl": "https://b.thumbs.redditmedia.com/LOtV8sgl0HoJaFmSC-8F2c7X2q4RUN1YVU5Kkd8LJnY.jpg",
    "comments": [
        "All of this always comes down to over population. The country is too damn overcrowded and the resources are so damn limited along with its inequal distribution (for obvious reason). Then there is fact that we have a goverment equivalent to a puppet of large corporations while we ourselves slave away in similar corporation and then pay taxes for the same goverement run by the corporations for our own \"development\" which is siphoned of from these corporations. We don't even realise that we support capitalism and monopoly just because its dressed as \"nationalism\" lmao"
    ],
    "cleaned_text": "inflation bottom growth prologue always felt hindi term mahangaee apt term inflation mahangaee means costliness dearness captures things become expensive ones salary increase aamdani auto ride days ago auto describing inflation versus salary increments better half seemed getting asked auto guy much made thought said day deductions asked much earned responded per day asked mahangayee went rant minutes end rant told indians situation likes adani ambani become richer exhibit references top bottom httpspreviewredditqdutajzmskdjpgwidthformatpjpgautowebpscaaaaccea trickle asked auto driver dev knew country rich enabled nations poor better life said exactly exclaimed country crore people job low pay find someone else government pocket continued although crude oil prices come high benefit passed consumer enabling likes ambani grow richer spend crores sons wedding dev complained increase recharge point bottom hand informed dev poor money could spend biscuits phones even maybe wheelers poor money consumption decline eventually demand factories keep producing conclusion sustainable path making country rich making people better epilogue simple minute discussion help people see light please help spread word work wonders single day like movie inception germinate grow idea ",
    "cleaned_title": "inflation bottom growth",
    "cleaned_selftext": "prologue always felt hindi term mahangaee apt term inflation mahangaee means costliness dearness captures things become expensive ones salary increase aamdani auto ride days ago auto describing inflation versus salary increments better half seemed getting asked auto guy much made thought said day deductions asked much earned responded per day asked mahangayee went rant minutes end rant told indians situation likes adani ambani become richer exhibit references top bottom httpspreviewredditqdutajzmskdjpgwidthformatpjpgautowebpscaaaaccea trickle asked auto driver dev knew country rich enabled nations poor better life said exactly exclaimed country crore people job low pay find someone else government pocket continued although crude oil prices come high benefit passed consumer enabling likes ambani grow richer spend crores sons wedding dev complained increase recharge point bottom hand informed dev poor money could spend biscuits phones even maybe wheelers poor money consumption decline eventually demand factories keep producing conclusion sustainable path making country rich making people better epilogue simple minute discussion help people see light please help spread word work wonders single day like movie inception germinate grow idea",
    "cleaned_comments": "always comes population country damn overcrowded resources damn limited along inequal distribution obvious reason fact goverment equivalent puppet large corporations slave away similar corporation pay taxes goverement run corporations development siphoned corporations dont even realise support capitalism monopoly dressed nationalism lmao",
    "light_cleaned_title": "Inflation and Bottom Up Growth",
    "light_cleaned_selftext": "**Prologue** I have always felt that the Hindi term \"mahangaee\" is a more apt term than inflation. Mahangaee, which means costliness or dearness, captures that things have become more expensive than one's salary increase or aamdani. **The Auto Ride** A few days ago, I was in an auto describing inflation versus salary increments to my better half. When she seemed to be getting it, I asked the Auto guy how much he made in 2014. He thought for a while and said about ₹500 a day after deductions. Then I asked him how much he earned now and he responded about ₹800 per day. Then I asked him about \"mahangayee\" and he went on a rant for 5 minutes. At the end of his rant, I told him that 90% of Indians were in this situation, while the likes of Adani and Ambani had become richer. *Exhibit 1:* [References for the top 10&#37; and bottom 90&#37;](https://preview.redd.it/qdutajzm4skd1.jpg?width=1600&format=pjpg&auto=webp&s=58c8a179618441a0a659999885a16c8ce7899a06) **Trickle Down** I asked the auto driver, Dev, if he knew of any country where the rich enabled the nation's poor to have a better life and he said no. Exactly! (I exclaimed) in a country of 140 crore people, if you do not do the job at the low pay, then they will find someone else to do it. And if the government is in their pocket (I continued), then although Crude oil prices have come down from their high of 2014, the benefit has not been passed to the consumer, enabling the likes of Ambani to grow richer and spend ₹5000 crores on his son's wedding. Dev complained about the increase in recharge at this point. **Bottom Up** On the other hand (I informed Dev) if the poor had more money, they could spend - on biscuits, phones and even maybe 2-wheelers. If the poor do not have money, consumption will decline, and eventually, there will be no demand for factories to keep producing. **Conclusion** The sustainable path to making a country rich is by making its people better off. **Epilogue** *A simple 8-minute discussion can help people see the light. Please, help spread the word. It will not work wonders in a single day. But just like the movie Inception, it will germinate and grow into an idea.*",
    "light_cleaned_comments": "All of this always comes down to over population. The country is too damn overcrowded and the resources are so damn limited along with its inequal distribution (for obvious reason). Then there is fact that we have a goverment equivalent to a puppet of large corporations while we ourselves slave away in similar corporation and then pay taxes for the same goverement run by the corporations for our own \"development\" which is siphoned of from these corporations. We don't even realise that we support capitalism and monopoly just because its dressed as \"nationalism\" lmao"
}