{
    "id": "16pyau9",
    "title": "Have you guys tried any Sex toys from the Sangya Project? Need Reviews.",
    "url": "https://www.reddit.com/r/india/comments/16pyau9/have_you_guys_tried_any_sex_toys_from_the_sangya/",
    "selftext": "Looking to buy a vibrator for my girlfriend. How reliable are they? Should I go for COD or Pay online?  \nI am looking to buy [Sangya 1](https://sangyaproject.com/products/sangya-1) or [Sangya 39 Plus](https://sangyaproject.com/products/sangya-39-plus) .  \n\n\nOr would you suggest something else?\n\n ",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695455196.0,
    "convurl": "https://external-preview.redd.it/TtXW4O872WPkPeaDEwOYe2OZqsfJ7_iae0IQEyP8u1g.jpg?auto=webp&s=4162e2e4835086e4ab9a2c3526b7d8dab2d008a0",
    "comments": [
        "Pay online. Use MyMuse Breeze! Beer vib, IMO.",
        "Tf do people buy these for their gf? Your D doesn't works or what?",
        "I can say you can check out manzuri and imbesharam both are verified and have ordered stuff from them (I am a guy ) currently 25%off sale on imbesharam.\nManzuri's has a good collection of female products and iambeshram is the biggest adults toys seller but prices are a bit high.",
        "Sangya project is safe and reliable. You can pay online. I ordered one toy too months ago. There weren't any issues. And the quality of the toy is very good for the price. If the product fits your need, I would say just go for it.",
        "Hello! I'm more than happy to help with any doubts here:) The sangya 1 is a great toy. It's the first made in india vibrator and we give a 1 yr warranty on it. The sangya 39 plus is our best seller and we give a 3 month warranty on it.",
        "Does Ajay Devgn use it? What about Shah rukh Khan? Or Akshay Kumar? or Deepika? Tiger Shroff?",
        "They are supporters of Make in India initiative so the probability is high!",
        "Possibility, you meant.",
        "No, probability:)",
        "💀 hampe to girlfriend hi nah hai",
        "so you mean, the chance of them buying your stuff is same as their not buying your stuff? 1/2 and 1/2?",
        "Yes",
        "This is tangential but needs to be said. \n\nWhile I have no problem with selling sex toys, what I think is not ethical is to sell supplements with pseudoscientific \"evidence\" (actually 'pseudoscientific evidence' is an oxymoron), e.g., the following from their website:\n\n1. [https://sangyaproject.com/products/sangya-male-libido-supplement](https://sangyaproject.com/products/sangya-male-libido-supplement)\n2. [https://sangyaproject.com/products/sangya-female-libido-supplement](https://sangyaproject.com/products/sangya-female-libido-supplement)\n3. [https://sangyaproject.com/products/sangya-uti-support](https://sangyaproject.com/products/sangya-uti-support)\n4. [https://sangyaproject.com/products/sangya-pms-and-period-support](https://sangyaproject.com/products/sangya-pms-and-period-support)\n\nRead the following article from Harvard Medical School regarding supplements efficacy in libido:\n\n [https://www.health.harvard.edu/staying-healthy/can-supplements-save-your-sex-life#:\\~:text=They%27ll%20tempt%20you%20with%20their%20marketing%20promises%2C%20but%20beware%20the%20dangers%20hidden%20within](https://www.health.harvard.edu/staying-healthy/can-supplements-save-your-sex-life#:~:text=They%27ll%20tempt%20you%20with%20their%20marketing%20promises%2C%20but%20beware%20the%20dangers%20hidden%20within).\n\nI do not know about the scientific evidence of last two products, but I have an intuition that they are also pseudoscientific because of the ['Appeal to nature' fallacy](https://en.wikipedia.org/wiki/Appeal_to_nature#:~:text=Some%20popular%20examples%20of%20the%20appeal%20to%20nature%20can%20be%20found%20on%20labels%20and%20advertisements%20for%20food%2C%20clothing%2C%20alternative%20herbal%20remedies%2C%20and%20many%20other%20areas) that is implicit in their description.\n\nBe careful, folks!\n\nThis company needs to be extremely careful and responsible before selling dubious products.\n\nAlso, we all need to hold these companies accountable for their business ethics.",
        "High possibility entails high probability. So, both terms will do in the first comment.\n\nIn the second comment, you did the same mistake that you accused u/sangyaproject of doing: conflating probability with possibility; since these two probabilities/possibilites are not equal, they =/= 1/2.",
        "These post kinda looks like promotional",
        "Check IMB’s Trustpilot one star responses. One guy complained about not getting his order on time so they thought it appropriate to just doxx him by putting his entire address and phone number online. \n\nBe very very careful before giving them your information.",
        "Am I the only one who thought about call of duty?",
        "I have no idea why mods deleted my comment, what I stated was public knowledge. Anyone can go to IMB’s Trustpilot score and find the review in which they themselves posted a customer’s full address and phone number when the customer complained about something.",
        "Paying online is safe for a company such as the Sangya Project. Just a woman’s input - if your girlfriend is experienced with toys, Sangya 39 would be good. Otherwise it will be too overwhelming.",
        "And some of the responses too",
        "Thank you. God bless you.",
        "Do they  provide products in discreet packaging ?",
        "Do they provide products in discreet packaging?",
        "Manzuri's yes iambeshram yes it's just a plain cardboard box with just shipping details and a bill copy.",
        "I just use my fingers .",
        "Take whichever one, they’re both just sex toys. \n\nI find the entire Sangya product offering very run of the mill and unrelatable.  \n\nThe company and their cofos give off a very annoying woke vibe IMO. On the one hand; their posts are all about sexual awareness and literacy but in reality all they’re just trying to do is peddle sex toys and get better sales. I don’t see any representation of differently abled, realistic body types and there’s barely any information that is actually helpful to sexual partners. Guide me to have better, more pleasurable sex with my partner was supposed to be their MO but now - just seems like any other sex toy store. \n\nMoreover, almost every SM post is just attention seeking about “hey, trauma is here, read this post about my/our trauma intertwined with saaax suxxx”. If Every single post is about trauma this and trauma that - it’s quite unrelatable to me. There could be an entire demographic that it appeals to, I don’t know but It’s quite mindless given their post frequency. I’ve not been traumatised or assaulted physically, I’m sorry. But what do you want me to - go seek trauma so that I can also start screaming about it. \n\nMoreover, the personal handles of the founders is quite annoying as well. Very attention seeking; full of labels and shares like “I am this label meme, lols” - it’s just very strange. A person should not need to keep reinforcing labels at every chance they get to feel special; like does even the minutest extra attention provide so much validation? I have no idea. And basis the vibe I see; I can guarantee that they’ve self diagnosed with labels because reasons.",
        "Will try to do better.   \n\n\nOn the personal note: Anything mental health related is diagnosed by doctors :)",
        "They are good you can buy",
        "Don't buy. They have a 3 month warranty period & after that no accountability. And it's priced also higher.",
        "I didn’t buy..\nThanks!",
        "Sangya project is a scam. It was so expensive and it stopped working in a few months. When I requested for a repair, they said they don’t provide repairs and that it’s not advised to go repair it outside because it might be hazardous. They only have 3 months of warranty.",
        "Which product is it that you ordered?"
    ],
    "cleaned_text": "guys tried sex toys sangya project need reviews looking buy vibrator girlfriend reliable go cod pay online looking buy sangya httpssangyaprojectcomproductssangya sangya plushttpssangyaprojectcomproductssangyaplus would suggest something else ",
    "cleaned_title": "guys tried sex toys sangya project need reviews",
    "cleaned_selftext": "looking buy vibrator girlfriend reliable go cod pay online looking buy sangya httpssangyaprojectcomproductssangya sangya plushttpssangyaprojectcomproductssangyaplus would suggest something else",
    "cleaned_comments": "pay online use mymuse breeze beer vib imo tf people buy gf doesnt works say check manzuri imbesharam verified ordered stuff guy currently sale imbesharam manzuris good collection female products iambeshram biggest adults toys seller prices bit high sangya project safe reliable pay online ordered one toy months ago werent issues quality toy good price product fits need would say go hello im happy help doubts sangya great toy first made india vibrator give yr warranty sangya plus best seller give month warranty ajay devgn use shah rukh khan akshay kumar deepika tiger shroff supporters make india initiative probability high possibility meant probability hampe girlfriend hi nah hai mean chance buying stuff buying stuff yes tangential needs said problem selling sex toys think ethical sell supplements pseudoscientific evidence actually pseudoscientific evidence oxymoron eg following website httpssangyaprojectcomproductssangyamalelibidosupplementhttpssangyaprojectcomproductssangyamalelibidosupplement httpssangyaprojectcomproductssangyafemalelibidosupplementhttpssangyaprojectcomproductssangyafemalelibidosupplement httpssangyaprojectcomproductssangyautisupporthttpssangyaprojectcomproductssangyautisupport httpssangyaprojectcomproductssangyapmsandperiodsupporthttpssangyaprojectcomproductssangyapmsandperiodsupport read following article harvard medical school regarding supplements efficacy libido httpswwwhealthharvardedustayinghealthycansupplementssaveyoursexlifetexttheylltemptyouwiththeirmarketingpromisescbutbewarethedangershiddenwithinhttpswwwhealthharvardedustayinghealthycansupplementssaveyoursexlifetexttheylltemptyouwiththeirmarketingpromisescbutbewarethedangershiddenwithin know scientific evidence last two products intuition also pseudoscientific appeal nature fallacyhttpsenwikipediaorgwikiappealtonaturetextsomepopularexamplesoftheappealtonaturecanbefoundonlabelsandadvertisementsforfoodcclothingcalternativeherbalremediescandmanyotherareas implicit description careful folks company needs extremely careful responsible selling dubious products also need hold companies accountable business ethics high possibility entails high probability terms first comment second comment mistake accused usangyaproject conflating probability possibility since two probabilitiespossibilites equal post kinda looks like promotional check imbs trustpilot one star responses one guy complained getting order time thought appropriate doxx putting entire address phone number online careful giving information one thought call duty idea mods deleted comment stated public knowledge anyone go imbs trustpilot score find review posted customers full address phone number customer complained something paying online safe company sangya project womans input girlfriend experienced toys sangya would good otherwise overwhelming responses thank god bless provide products discreet packaging provide products discreet packaging manzuris yes iambeshram yes plain cardboard box shipping details bill copy use fingers take whichever one theyre sex toys find entire sangya product offering run mill unrelatable company cofos give annoying woke vibe imo one hand posts sexual awareness literacy reality theyre trying peddle sex toys get better sales dont see representation differently abled realistic body types theres barely information actually helpful sexual partners guide better pleasurable sex partner supposed mo seems like sex toy store moreover almost every sm post attention seeking hey trauma read post myour trauma intertwined saaax suxxx every single post trauma trauma quite unrelatable could entire demographic appeals dont know quite mindless given post frequency ive traumatised assaulted physically im sorry want go seek trauma also start screaming moreover personal handles founders quite annoying well attention seeking full labels shares like label meme lols strange person need keep reinforcing labels every chance get feel special like even minutest extra attention provide much validation idea basis vibe see guarantee theyve self diagnosed labels reasons try better personal note anything mental health related diagnosed doctors good buy dont buy month warranty period accountability priced also higher didnt buy thanks sangya project scam expensive stopped working months requested repair said dont provide repairs advised go repair outside might hazardous months warranty product ordered",
    "light_cleaned_title": "Have you guys tried any Sex toys from the Sangya Project? Need Reviews.",
    "light_cleaned_selftext": "Looking to buy a vibrator for my girlfriend. How reliable are they? Should I go for COD or Pay online? I am looking to buy [Sangya 1](https://sangyaproject.com/products/sangya-1) or [Sangya 39 Plus](https://sangyaproject.com/products/sangya-39-plus) . Or would you suggest something else?",
    "light_cleaned_comments": "Pay online. Use MyMuse Breeze! Beer vib, IMO. Tf do people buy these for their gf? Your D doesn't works or what? I can say you can check out manzuri and imbesharam both are verified and have ordered stuff from them (I am a guy ) currently 25%off sale on imbesharam. Manzuri's has a good collection of female products and iambeshram is the biggest adults toys seller but prices are a bit high. Sangya project is safe and reliable. You can pay online. I ordered one toy too months ago. There weren't any issues. And the quality of the toy is very good for the price. If the product fits your need, I would say just go for it. Hello! I'm more than happy to help with any doubts here:) The sangya 1 is a great toy. It's the first made in india vibrator and we give a 1 yr warranty on it. The sangya 39 plus is our best seller and we give a 3 month warranty on it. Does Ajay Devgn use it? What about Shah rukh Khan? Or Akshay Kumar? or Deepika? Tiger Shroff? They are supporters of Make in India initiative so the probability is high! Possibility, you meant. No, probability:) 💀 hampe to girlfriend hi nah hai so you mean, the chance of them buying your stuff is same as their not buying your stuff? 1/2 and 1/2? Yes This is tangential but needs to be said. While I have no problem with selling sex toys, what I think is not ethical is to sell supplements with pseudoscientific \"evidence\" (actually 'pseudoscientific evidence' is an oxymoron), e.g., the following from their website: 1. [https://sangyaproject.com/products/sangya-male-libido-supplement](https://sangyaproject.com/products/sangya-male-libido-supplement) 2. [https://sangyaproject.com/products/sangya-female-libido-supplement](https://sangyaproject.com/products/sangya-female-libido-supplement) 3. [https://sangyaproject.com/products/sangya-uti-support](https://sangyaproject.com/products/sangya-uti-support) 4. [https://sangyaproject.com/products/sangya-pms-and-period-support](https://sangyaproject.com/products/sangya-pms-and-period-support) Read the following article from Harvard Medical School regarding supplements efficacy in libido: [https://www.health.harvard.edu/staying-healthy/can-supplements-save-your-sex-life#:\\~:text=They%27ll%20tempt%20you%20with%20their%20marketing%20promises%2C%20but%20beware%20the%20dangers%20hidden%20within](https://www.health.harvard.edu/staying-healthy/can-supplements-save-your-sex-life#:~:text=They%27ll%20tempt%20you%20with%20their%20marketing%20promises%2C%20but%20beware%20the%20dangers%20hidden%20within). I do not know about the scientific evidence of last two products, but I have an intuition that they are also pseudoscientific because of the ['Appeal to nature' fallacy](https://en.wikipedia.org/wiki/Appeal_to_nature#:~:text=Some%20popular%20examples%20of%20the%20appeal%20to%20nature%20can%20be%20found%20on%20labels%20and%20advertisements%20for%20food%2C%20clothing%2C%20alternative%20herbal%20remedies%2C%20and%20many%20other%20areas) that is implicit in their description. Be careful, folks! This company needs to be extremely careful and responsible before selling dubious products. Also, we all need to hold these companies accountable for their business ethics. High possibility entails high probability. So, both terms will do in the first comment. In the second comment, you did the same mistake that you accused u/sangyaproject of doing: conflating probability with possibility; since these two probabilities/possibilites are not equal, they =/= 1/2. These post kinda looks like promotional Check IMB’s Trustpilot one star responses. One guy complained about not getting his order on time so they thought it appropriate to just doxx him by putting his entire address and phone number online. Be very very careful before giving them your information. Am I the only one who thought about call of duty? I have no idea why mods deleted my comment, what I stated was public knowledge. Anyone can go to IMB’s Trustpilot score and find the review in which they themselves posted a customer’s full address and phone number when the customer complained about something. Paying online is safe for a company such as the Sangya Project. Just a woman’s input - if your girlfriend is experienced with toys, Sangya 39 would be good. Otherwise it will be too overwhelming. And some of the responses too Thank you. God bless you. Do they provide products in discreet packaging ? Do they provide products in discreet packaging? Manzuri's yes iambeshram yes it's just a plain cardboard box with just shipping details and a bill copy. I just use my fingers . Take whichever one, they’re both just sex toys. I find the entire Sangya product offering very run of the mill and unrelatable. The company and their cofos give off a very annoying woke vibe IMO. On the one hand; their posts are all about sexual awareness and literacy but in reality all they’re just trying to do is peddle sex toys and get better sales. I don’t see any representation of differently abled, realistic body types and there’s barely any information that is actually helpful to sexual partners. Guide me to have better, more pleasurable sex with my partner was supposed to be their MO but now - just seems like any other sex toy store. Moreover, almost every SM post is just attention seeking about “hey, trauma is here, read this post about my/our trauma intertwined with saaax suxxx”. If Every single post is about trauma this and trauma that - it’s quite unrelatable to me. There could be an entire demographic that it appeals to, I don’t know but It’s quite mindless given their post frequency. I’ve not been traumatised or assaulted physically, I’m sorry. But what do you want me to - go seek trauma so that I can also start screaming about it. Moreover, the personal handles of the founders is quite annoying as well. Very attention seeking; full of labels and shares like “I am this label meme, lols” - it’s just very strange. A person should not need to keep reinforcing labels at every chance they get to feel special; like does even the minutest extra attention provide so much validation? I have no idea. And basis the vibe I see; I can guarantee that they’ve self diagnosed with labels because reasons. Will try to do better. On the personal note: Anything mental health related is diagnosed by doctors :) They are good you can buy Don't buy. They have a 3 month warranty period & after that no accountability. And it's priced also higher. I didn’t buy.. Thanks! Sangya project is a scam. It was so expensive and it stopped working in a few months. When I requested for a repair, they said they don’t provide repairs and that it’s not advised to go repair it outside because it might be hazardous. They only have 3 months of warranty. Which product is it that you ordered?"
}