{
    "id": "17c60dj",
    "title": "Delhi is the only city in India which comes in the top 10 cities with best metro connectivity. Now with RRTS Connectivity all the people in the NCR region and the suburbs can easily zip past the traffic jams. Mumbai has to learn from Delhi and try to implement at least 5% of what Delhi has.",
    "url": "https://www.reddit.com/r/india/comments/17c60dj/delhi_is_the_only_city_in_india_which_comes_in/",
    "selftext": "Delhi’s public already enjoy one of the best public transport system in India and even the world. \n\nThe metro train gives comfort and a route to float above the congested roads and toxic weather that we have in India.\n\nMumbai on the other hand has a super humid climate with mostly hot weather and nil to minimal cool weather in the winters. The city is chocking with lack of any modern public transport infrastructure. \n\nThe Red and Yellow lines which were inaugurated only travel from the northern suburbs till Andheri. Andheri has Mumbai’s only East- West public rail transport facility. \n\nAs long as you want to go from North to south you can use the overcrowded cattle class Suburban trains in Mumbai but good luck if you want to travel in the  East- West direction. \n\nEven though they opened some metro lines, none connect to either major railway junctions other than Andheri and none connect to any airport. \n\nPeople were using Uber Bike, Ola Bikes as auto goons used to overcharge to the airport and the government made sure to shut it down. \n\nDelhi people are lucky to have Flavorful tasty food which isn’t overpriced like Mumbai, Indian’s best public transport Infrastructure and somewhat affordable rent when compared to the ugly, outdated and overpriced housing market of Mumbai. \n\nAfter paying so much in taxes and deserves to at least have some form of rapid and modern rail system \n\nhttps://www.hindustantimes.com/india-news/pm-modi-inaugurates-delhi-ghaziabad-meerut-rrts-corridor-101697775589684-amp.html",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697789358.0,
    "convurl": "https://external-preview.redd.it/kqvdaizA-RvFI0cbSLdmx7rZd2EtKNSfYme2c5mOH-M.jpg?auto=webp&s=e3eb07c2b9bc67cd86831c68ddc13e056ed912b7",
    "comments": [
        "Mumbai simply has no land which Delhi NCR has in abundance.\n\nPlus, Delhi does not get enough credit for planning and designing its newer areas. Something amiss in pretty much every Indian city barring Chandigarh. Bangalore being the worst\n\nDelhi NCR is wayyyyy ahead of all metros in infra and mobility. Absolutely no comparison.",
        ">,Mumbai simply has no land which Delhi NCR has in abundance.\n\nDelhi metro is either elevated or runs underground. There were evictions before metro construction. Have you ever been to Delhi?",
        "Disclaimer: I last lived in Mumbai in 2018, maybe things are different now.\n\nThe way Mumbai is structured is highly problematic. There is absolutely no excuse for all offices to be concentrated in a select few regions (usually in the south) and have a large population commute for hours everyday. I remember how in the morning southbound trains were fully crowded and northbound trains were practically empty, by Mumbai standards. The suburbs have a sizeable population to allow for development of workplaces, but it keeps the prices inflated in the southern parts of the city.\n\nMoreover, I feel the average Mumbaikar was expected to tolerate horrid infrastucture and its consequences. Stampedes in crowded trains & stations? Someone died by drowning during a flood? Don't worry, that's the \"SPIRIT OF MUMBAI\".",
        "Only city bus service is drawback, otherwise it could have been 100%"
    ],
    "cleaned_text": "delhi city india comes top cities best metro connectivity rrts connectivity people ncr region suburbs easily zip past traffic jams mumbai learn delhi try implement least delhi delhis public already enjoy one best public transport system india even world metro train gives comfort route float congested roads toxic weather india mumbai hand super humid climate mostly hot weather nil minimal cool weather winters city chocking lack modern public transport infrastructure red yellow lines inaugurated travel northern suburbs till andheri andheri mumbais east west public rail transport facility long want go north south use overcrowded cattle class suburban trains mumbai good luck want travel east west direction even though opened metro lines none connect either major railway junctions andheri none connect airport people using uber bike ola bikes auto goons used overcharge airport government made sure shut delhi people lucky flavorful tasty food isnt overpriced like mumbai indians best public transport infrastructure somewhat affordable rent compared ugly outdated overpriced housing market mumbai paying much taxes deserves least form rapid modern rail system ",
    "cleaned_title": "delhi city india comes top cities best metro connectivity rrts connectivity people ncr region suburbs easily zip past traffic jams mumbai learn delhi try implement least delhi",
    "cleaned_selftext": "delhis public already enjoy one best public transport system india even world metro train gives comfort route float congested roads toxic weather india mumbai hand super humid climate mostly hot weather nil minimal cool weather winters city chocking lack modern public transport infrastructure red yellow lines inaugurated travel northern suburbs till andheri andheri mumbais east west public rail transport facility long want go north south use overcrowded cattle class suburban trains mumbai good luck want travel east west direction even though opened metro lines none connect either major railway junctions andheri none connect airport people using uber bike ola bikes auto goons used overcharge airport government made sure shut delhi people lucky flavorful tasty food isnt overpriced like mumbai indians best public transport infrastructure somewhat affordable rent compared ugly outdated overpriced housing market mumbai paying much taxes deserves least form rapid modern rail system",
    "cleaned_comments": "mumbai simply land delhi ncr abundance plus delhi get enough credit planning designing newer areas something amiss pretty much every indian city barring chandigarh bangalore worst delhi ncr wayyyyy ahead metros infra mobility absolutely comparison mumbai simply land delhi ncr abundance delhi metro either elevated runs underground evictions metro construction ever delhi disclaimer last lived mumbai maybe things different way mumbai structured highly problematic absolutely excuse offices concentrated select regions usually south large population commute hours everyday remember morning southbound trains fully crowded northbound trains practically empty mumbai standards suburbs sizeable population allow development workplaces keeps prices inflated southern parts city moreover feel average mumbaikar expected tolerate horrid infrastucture consequences stampedes crowded trains stations someone died drowning flood dont worry thats spirit mumbai city bus service drawback otherwise could",
    "light_cleaned_title": "Delhi is the only city in India which comes in the top 10 cities with best metro connectivity. Now with RRTS Connectivity all the people in the NCR region and the suburbs can easily zip past the traffic jams. Mumbai has to learn from Delhi and try to implement at least 5% of what Delhi has.",
    "light_cleaned_selftext": "Delhi’s public already enjoy one of the best public transport system in India and even the world. The metro train gives comfort and a route to float above the congested roads and toxic weather that we have in India. Mumbai on the other hand has a super humid climate with mostly hot weather and nil to minimal cool weather in the winters. The city is chocking with lack of any modern public transport infrastructure. The Red and Yellow lines which were inaugurated only travel from the northern suburbs till Andheri. Andheri has Mumbai’s only East- West public rail transport facility. As long as you want to go from North to south you can use the overcrowded cattle class Suburban trains in Mumbai but good luck if you want to travel in the East- West direction. Even though they opened some metro lines, none connect to either major railway junctions other than Andheri and none connect to any airport. People were using Uber Bike, Ola Bikes as auto goons used to overcharge to the airport and the government made sure to shut it down. Delhi people are lucky to have Flavorful tasty food which isn’t overpriced like Mumbai, Indian’s best public transport Infrastructure and somewhat affordable rent when compared to the ugly, outdated and overpriced housing market of Mumbai. After paying so much in taxes and deserves to at least have some form of rapid and modern rail system",
    "light_cleaned_comments": "Mumbai simply has no land which Delhi NCR has in abundance. Plus, Delhi does not get enough credit for planning and designing its newer areas. Something amiss in pretty much every Indian city barring Chandigarh. Bangalore being the worst Delhi NCR is wayyyyy ahead of all metros in infra and mobility. Absolutely no comparison. >,Mumbai simply has no land which Delhi NCR has in abundance. Delhi metro is either elevated or runs underground. There were evictions before metro construction. Have you ever been to Delhi? Disclaimer: I last lived in Mumbai in 2018, maybe things are different now. The way Mumbai is structured is highly problematic. There is absolutely no excuse for all offices to be concentrated in a select few regions (usually in the south) and have a large population commute for hours everyday. I remember how in the morning southbound trains were fully crowded and northbound trains were practically empty, by Mumbai standards. The suburbs have a sizeable population to allow for development of workplaces, but it keeps the prices inflated in the southern parts of the city. Moreover, I feel the average Mumbaikar was expected to tolerate horrid infrastucture and its consequences. Stampedes in crowded trains & stations? Someone died by drowning during a flood? Don't worry, that's the \"SPIRIT OF MUMBAI\". Only city bus service is drawback, otherwise it could have been 100%"
}