{
    "id": "13k2x31",
    "title": "Which is the best toothpaste to be used?",
    "url": "https://www.reddit.com/r/india/comments/13k2x31/which_is_the_best_toothpaste_to_be_used/",
    "selftext": "I am trying to improve the general stuff I consume. I found this guide on toothpaste selection but no toothpaste manufacturer seems to list the concentration. Anyone here who has done the research or knows about it. I think the section on fluoride, abrasives and SLS is the most relevant. [How to choose the best toothpaste](https://www.india.com/lifestyle/how-to-choose-the-best-toothpaste-for-oral-wellness-expert-shares-tips-5273295/) . Please note for children fluoride requirements are lower (<1000 ppm).",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 3,
    "created_utc": 1684332713.0,
    "convurl": "https://external-preview.redd.it/cBLUqIXomAqtdacakdHwZc3UMRW4NLVRstar1ekwMnU.jpg?auto=webp&v=enabled&s=0d0901246c0e84dc3f582df127679e44430537a3",
    "comments": [
        "Dentists tell me: use any decent toothpaste. Most of the benefit of brushing is due to the mechanical cleaning action it causes, so if your brushing technique is okay, you’ll be fine.\n\nPut another way, poor brushing technique + great toothpaste = poor results.\n\n* Make sure you gently massage your gums\n* Circular movements\n* If in doubt, ask a dentist\n\nIn many cases, fluoridated toothpastes are useful. But it’s less useful if you have eg a fluoridated water supply. Ask your dentist!\n\nSometimes your dentist can even prescribe medicated toothpaste with extra fluoride if it’s clinically necessary.\n\nIncidentally, visiting a trusted dentist regularly is one of the best ways to ensure your dental health is okay.",
        "Don't know about toothpaste but electric toothbrush and water flosser are great."
    ],
    "cleaned_text": "best toothpaste used trying improve general stuff consume found guide toothpaste selection toothpaste manufacturer seems list concentration anyone done research knows think section fluoride abrasives sls relevant choose best toothpastehttpswwwindiacomlifestylehowtochoosethebesttoothpastefororalwellnessexpertsharestips please note children fluoride requirements lower ppm ",
    "cleaned_title": "best toothpaste used",
    "cleaned_selftext": "trying improve general stuff consume found guide toothpaste selection toothpaste manufacturer seems list concentration anyone done research knows think section fluoride abrasives sls relevant choose best toothpastehttpswwwindiacomlifestylehowtochoosethebesttoothpastefororalwellnessexpertsharestips please note children fluoride requirements lower ppm",
    "cleaned_comments": "dentists tell use decent toothpaste benefit brushing due mechanical cleaning action causes brushing technique okay youll fine put another way poor brushing technique great toothpaste poor results make sure gently massage gums circular movements doubt ask dentist many cases fluoridated toothpastes useful less useful eg fluoridated water supply ask dentist sometimes dentist even prescribe medicated toothpaste extra fluoride clinically necessary incidentally visiting trusted dentist regularly one best ways ensure dental health okay dont know toothpaste electric toothbrush water flosser great",
    "light_cleaned_title": "Which is the best toothpaste to be used?",
    "light_cleaned_selftext": "I am trying to improve the general stuff I consume. I found this guide on toothpaste selection but no toothpaste manufacturer seems to list the concentration. Anyone here who has done the research or knows about it. I think the section on fluoride, abrasives and SLS is the most relevant. [How to choose the best toothpaste](https://www.india.com/lifestyle/how-to-choose-the-best-toothpaste-for-oral-wellness-expert-shares-tips-5273295/) . Please note for children fluoride requirements are lower (<1000 ppm).",
    "light_cleaned_comments": "Dentists tell me: use any decent toothpaste. Most of the benefit of brushing is due to the mechanical cleaning action it causes, so if your brushing technique is okay, you’ll be fine. Put another way, poor brushing technique + great toothpaste = poor results. * Make sure you gently massage your gums * Circular movements * If in doubt, ask a dentist In many cases, fluoridated toothpastes are useful. But it’s less useful if you have eg a fluoridated water supply. Ask your dentist! Sometimes your dentist can even prescribe medicated toothpaste with extra fluoride if it’s clinically necessary. Incidentally, visiting a trusted dentist regularly is one of the best ways to ensure your dental health is okay. Don't know about toothpaste but electric toothbrush and water flosser are great."
}