{
    "id": "17gs07b",
    "title": "Why everyone's mad about china's new map",
    "url": "https://youtu.be/WpQQOQ__1ok?t=5m15s",
    "selftext": "So this is the way i had to find out that china has been occupying our territories. I know there was a border conflict between india and china a while ago but i did anticipate that it was this bad and it's worse that i had to find out about it through international media. Most indian news outlets are a disgrace and should be ashamed. Keeping the public uninformed is a disservice to indians and makes them by far one of the most anti-nationals.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1698309963.0,
    "convurl": "https://external-preview.redd.it/qLWYxzevvKak3fDmkQsj5cp4BrrPqe4CbD4lQgbxBPg.jpg?auto=webp&s=6eab902fe7f22314b56158432b725b47bab14080",
    "comments": [
        "China is playing soft power politics game. Just look at the mess they have created in South China Sea region. As someone belonging from NE it angers me everyday to think they are enroaching east Bhutan lands and trying to cut off NE from India. And all of these bs just for their \"historical chinese areas\".",
        "I have got a feeling like we are on a collision course with China. I hope the Indian govt and millitary stays prepared. If they somehow occupy Taiwan they will surely atleast try to occupy their other territorial claims also.",
        "Wont be prepared until the next decade ends",
        "Maybe,maybe not. The fact is if US isn’t able to stop china from occupying Taiwan, then we shouldn’t think of depending on them. Then again we aren’t(and will never be) as helpless as Taiwan is. Personally I don’t think china will get into a full time conflict with india for at least another decade",
        "India china relations is like Russia Ukrainian relations"
    ],
    "cleaned_text": "everyones mad chinas new map way find china occupying territories know border conflict india china ago anticipate bad worse find international media indian news outlets disgrace ashamed keeping public uninformed disservice indians makes far one antinationals ",
    "cleaned_title": "everyones mad chinas new map",
    "cleaned_selftext": "way find china occupying territories know border conflict india china ago anticipate bad worse find international media indian news outlets disgrace ashamed keeping public uninformed disservice indians makes far one antinationals",
    "cleaned_comments": "china playing soft power politics game look mess created south china sea region someone belonging ne angers everyday think enroaching east bhutan lands trying cut ne india bs historical chinese areas got feeling like collision course china hope indian govt millitary stays prepared somehow occupy taiwan surely atleast try occupy territorial claims also wont prepared next decade ends maybemaybe fact us isnt able stop china occupying taiwan shouldnt think depending arentand never helpless taiwan personally dont think china get full time conflict india least another decade india china relations like russia ukrainian relations",
    "light_cleaned_title": "Why everyone's mad about china's new map",
    "light_cleaned_selftext": "So this is the way i had to find out that china has been occupying our territories. I know there was a border conflict between india and china a while ago but i did anticipate that it was this bad and it's worse that i had to find out about it through international media. Most indian news outlets are a disgrace and should be ashamed. Keeping the public uninformed is a disservice to indians and makes them by far one of the most anti-nationals.",
    "light_cleaned_comments": "China is playing soft power politics game. Just look at the mess they have created in South China Sea region. As someone belonging from NE it angers me everyday to think they are enroaching east Bhutan lands and trying to cut off NE from India. And all of these bs just for their \"historical chinese areas\". I have got a feeling like we are on a collision course with China. I hope the Indian govt and millitary stays prepared. If they somehow occupy Taiwan they will surely atleast try to occupy their other territorial claims also. Wont be prepared until the next decade ends Maybe,maybe not. The fact is if US isn’t able to stop china from occupying Taiwan, then we shouldn’t think of depending on them. Then again we aren’t(and will never be) as helpless as Taiwan is. Personally I don’t think china will get into a full time conflict with india for at least another decade India china relations is like Russia Ukrainian relations"
}