{
    "id": "1fp213u",
    "title": "We are the 5th largest economy and would become the 3rd largest in next 5 years.  Compare ourselves even with 10th largest economy. How abysmal our percapita is. How far we've to go to be on par with even say a Brazil or China.",
    "url": "https://i.redd.it/tpl537oxwxqd1.jpeg",
    "selftext": "\nSource : https://x.com/dmuthuk/status/1838795598868418732?s=46\n\nWe are the 5th largest economy and would become the 3rd largest in next 5 years.  Compare ourselves even with 10th largest economy. How abysmal our percapita is. How far we've to go to be on par with even say a Brazil or China.\n",
    "flair": "Rant / Vent",
    "score": 23,
    "num_comments": 20,
    "created_utc": 1727263417.0,
    "convurl": "https://i.redd.it/tpl537oxwxqd1.jpeg",
    "comments": [
        "Now exclude the top 1% from our GDP",
        "Why are you copying D Muthu verbatim?",
        "Well there’s no way to resolve the population problem. \n\nUnless there’s a new plague./s",
        "Too much population and too much theft from ultra rich. \n\nUltra-rich is not playing it fair. They get govt backing. But people like us who have small businesses get trampled by all of these laws, fees, banking limitations, and all that stuff.",
        "Don’t forget the corruption",
        "We need Thanos /s",
        "It’s because we cannot grab land of citizens and build infrastructure like China. We cannot steal western tech and produce products, we are not a dictatorial state. But in the long run democracy provides more checks and balances and better growth. You can get jailed for you private messages criticizing the leadership in China. Here people say anything they want against modi.",
        "Everyone crying about population ffs. It's a NATURAL part of development process of any country! It declines as education and awareness increases, currently out TFR is 2.01, below the \"replacement rate\" of 2.1. So please, it's not the \"fault\" of our population, it's the government's inability to provide meaningful jobs outside of agriculture.",
        ">How far we've to go to be on par with even say a Brazil or China.\n\nWe need to increase our share in manufacturing for that. But looking at current trends it's not happening",
        "We need to reduce our population to around 8 crores. There’s simply no other way. India is too diverse, stupid and behind to improve GDP per capita.\n\nIndia neither has the resources to make you rich by default (middle eastern countries), nor does it have the government direction towards competitiveness and innovation (US, China), and we certainly shouldn’t look at colonising other countries to loot wealth (EU).\n\nThe only way is to reduce our population to match our productivity and resources. Thankfully TFR is falling rapidly, with some more government support of reducing TFR below 1 and we should be good.",
        "It will be even worse if we remove tata reliance and adani family.",
        "Dont see the percapita change drastically in coming decades. Close to 30% of population do not join workforce. White collared and urban population become employable only at 22years upwards. We do not spend enough to uplift ourselves, be it in education or research. Japan might collapse altogether. And we might end up in 4th gdp in 4 years.",
        "You will be surprised to realise that government is nothing but people. People nominate the leaders in the government. You want better government, vote for better leaders, as simple as that.\n\n  \n\n\nAnd when population increases, everything becomes a rat race and people lose empathy, morals and ethics, focusing only on getting ahead of that person beside them through any means. So, population does matter.",
        "Because we are a country of fake data and fake poors.",
        "Once again, that's okay. Identity politics is a part of politics. India is the largest, and one of the rarest cases of surviving third world democracies. It's only \\~77 years old as a democracy. Narrow politics prevails in youth stages of democracy. Narrow mindsets, conservatism is present, but have faith, time will help us evolve to more rational beings :)",
        ">population does matter\n\nNot in the way you're implying. Our country's population is young, and is primed to be put to good use in the country or outside. A working population is a resource, just like oil, or minerals. You're thinking of it in narrow terms of \"if there are too many people, there is more competition for jobs\" but you're not considering how much upkeep such a population requires, how many teachers, school staff, colleges and professors, auxiliary staff, doctors, nurses, civil engineers to expand the infrastructure needed to support the population, law enforcement, government employees, bank and postal employees, not to mention agriculture, transport and storage services are needed for such a massive population. These are where the jobs are for everyone, and this is where the government has to focus on expanding the capabilities of these departments and hiring qualified personnel based on local needs.\n\nOur population is only a burden because our leaders have failed to address its needs and nurture it, utilize it the way it was meant to be used, using the population for its own good and build something great from it.\n\nNo, now we have a population bursting at the seams, with the elite few squandering them for their own personal gain and everyone else laboring under them with the threat of being easily replaceable hanging over their heads because the status quo is beneficial to those in power, why would they want anything to change.",
        "It's too bad you can't sell garbage from the street, that would make everyone millionaires.  Sometimes I play a game where I search a random street view in India and you win by finding a 360 view with no visible trash.  Haven't won the game yet",
        "True. Downvoted for telling the truth. *sigh*",
        "You want your fellow innocent countrymen to die ??? Left wing ideologies have brainwashed you such a limit that you don’t consider Indian lives having any value..",
        "China directs towards innovation,, what a joke. They steal tech and give it to their startups. You want our government to steal western tech???",
        "At least their government is competent enough to steal tech. Our babus can’t even steal tech to make a bullock cart.\n\nAnd Chinese tech is now way ahead of every other country maybe except US. They have their in-house software for everything. Just go to their cities and see once how well their stuff is integrated.\n\nMeanwhile our country just keeps on chest thumping UPI UPI UPI which is not even that convenient. Way worse than tap to pay using Apple Pay, Google wallet or Alipay.\n\nAnd yes, I want our government to steal tech. At least we’ll see some progress that way. Just look at government websites. They’d be considered outdated in 1998.",
        "Thats a very educated take. Our constitutional protections of intellectual property and personal freedom should be thrown out, they are useless",
        "Yep, it’s not like you can criticise the government freely even in India. If you’re big enough the government will fuck you over. Same with media, no freedom.\n\nI’d rather be in a prosperous nation with clean air, god tier infrastructure, low taxes, cheap goods and good wages than to have stupid shit like freedom of speech and be piss poor.",
        "Are you 10 or something? Can you not see the sarcastic indicator at the end of the sentence? Did they not teach you humour in whatever political wing you belong to?",
        "Our agriculture labour constitutes majority of population to an extent any small increase in their per capita will impact entire country’s per capita. According to you, if govt was able to provide meaningful jobs in agriculture, we would have been in much better position. The low per capita shows that even they are not doing very well. \n\nWith current population and replacement rates, it will be decades before we will have 2 digit per capita rank. I.e a new generation."
    ],
    "cleaned_text": "th largest economy would become rd largest next years compare even th largest economy abysmal percapita far weve go par even say brazil china source th largest economy would become rd largest next years compare even th largest economy abysmal percapita far weve go par even say brazil china ",
    "cleaned_title": "th largest economy would become rd largest next years compare even th largest economy abysmal percapita far weve go par even say brazil china",
    "cleaned_selftext": "source th largest economy would become rd largest next years compare even th largest economy abysmal percapita far weve go par even say brazil china",
    "cleaned_comments": "exclude top gdp copying muthu verbatim well theres way resolve population problem unless theres new plagues much population much theft ultra rich ultrarich playing fair get govt backing people like us small businesses get trampled laws fees banking limitations stuff dont forget corruption need thanos grab land citizens build infrastructure like china steal western tech produce products dictatorial state long run democracy provides checks balances better growth get jailed private messages criticizing leadership china people say anything want modi everyone crying population ffs natural part development process country declines education awareness increases currently tfr replacement rate please fault population governments inability provide meaningful jobs outside agriculture far weve go par even say brazil china need increase share manufacturing looking current trends happening need reduce population around crores theres simply way india diverse stupid behind improve gdp per capita india neither resources make rich default middle eastern countries government direction towards competitiveness innovation us china certainly shouldnt look colonising countries loot wealth eu way reduce population match productivity resources thankfully tfr falling rapidly government support reducing tfr good even worse remove tata reliance adani family dont see percapita change drastically coming decades close population join workforce white collared urban population become employable years upwards spend enough uplift education research japan might collapse altogether might end th gdp years surprised realise government nothing people people nominate leaders government want better government vote better leaders simple population increases everything becomes rat race people lose empathy morals ethics focusing getting ahead person beside means population matter country fake data fake poors thats okay identity politics part politics india largest one rarest cases surviving third world democracies years old democracy narrow politics prevails youth stages democracy narrow mindsets conservatism present faith time help us evolve rational beings population matter way youre implying countrys population young primed put good use country outside working population resource like oil minerals youre thinking narrow terms many people competition jobs youre considering much upkeep population requires many teachers school staff colleges professors auxiliary staff doctors nurses civil engineers expand infrastructure needed support population law enforcement government employees bank postal employees mention agriculture transport storage services needed massive population jobs everyone government focus expanding capabilities departments hiring qualified personnel based local needs population burden leaders failed address needs nurture utilize way meant used using population good build something great population bursting seams elite squandering personal gain everyone else laboring threat easily replaceable hanging heads status quo beneficial power would want anything change bad cant sell garbage street would make everyone millionaires sometimes play game search random street view india win finding view visible trash havent game yet true downvoted telling truth sigh want fellow innocent countrymen die left wing ideologies brainwashed limit dont consider indian lives value china directs towards innovation joke steal tech give startups want government steal western tech least government competent enough steal tech babus cant even steal tech make bullock cart chinese tech way ahead every country maybe except us inhouse software everything go cities see well stuff integrated meanwhile country keeps chest thumping upi upi upi even convenient way worse tap pay using apple pay google wallet alipay yes want government steal tech least well see progress way look government websites theyd considered outdated thats educated take constitutional protections intellectual property personal freedom thrown useless yep like criticise government freely even india youre big enough government fuck media freedom id rather prosperous nation clean air god tier infrastructure low taxes cheap goods good wages stupid shit like freedom speech piss poor something see sarcastic indicator end sentence teach humour whatever political wing belong agriculture labour constitutes majority population extent small increase per capita impact entire countrys per capita according govt able provide meaningful jobs agriculture would much better position low per capita shows even well current population replacement rates decades digit per capita rank ie new generation",
    "light_cleaned_title": "We are the 5th largest economy and would become the 3rd largest in next 5 years. Compare ourselves even with 10th largest economy. How abysmal our percapita is. How far we've to go to be on par with even say a Brazil or China.",
    "light_cleaned_selftext": "Source : We are the 5th largest economy and would become the 3rd largest in next 5 years. Compare ourselves even with 10th largest economy. How abysmal our percapita is. How far we've to go to be on par with even say a Brazil or China.",
    "light_cleaned_comments": "Now exclude the top 1% from our GDP Why are you copying D Muthu verbatim? Well there’s no way to resolve the population problem. Unless there’s a new plague./s Too much population and too much theft from ultra rich. Ultra-rich is not playing it fair. They get govt backing. But people like us who have small businesses get trampled by all of these laws, fees, banking limitations, and all that stuff. Don’t forget the corruption We need Thanos /s It’s because we cannot grab land of citizens and build infrastructure like China. We cannot steal western tech and produce products, we are not a dictatorial state. But in the long run democracy provides more checks and balances and better growth. You can get jailed for you private messages criticizing the leadership in China. Here people say anything they want against modi. Everyone crying about population ffs. It's a NATURAL part of development process of any country! It declines as education and awareness increases, currently out TFR is 2.01, below the \"replacement rate\" of 2.1. So please, it's not the \"fault\" of our population, it's the government's inability to provide meaningful jobs outside of agriculture. >How far we've to go to be on par with even say a Brazil or China. We need to increase our share in manufacturing for that. But looking at current trends it's not happening We need to reduce our population to around 8 crores. There’s simply no other way. India is too diverse, stupid and behind to improve GDP per capita. India neither has the resources to make you rich by default (middle eastern countries), nor does it have the government direction towards competitiveness and innovation (US, China), and we certainly shouldn’t look at colonising other countries to loot wealth (EU). The only way is to reduce our population to match our productivity and resources. Thankfully TFR is falling rapidly, with some more government support of reducing TFR below 1 and we should be good. It will be even worse if we remove tata reliance and adani family. Dont see the percapita change drastically in coming decades. Close to 30% of population do not join workforce. White collared and urban population become employable only at 22years upwards. We do not spend enough to uplift ourselves, be it in education or research. Japan might collapse altogether. And we might end up in 4th gdp in 4 years. You will be surprised to realise that government is nothing but people. People nominate the leaders in the government. You want better government, vote for better leaders, as simple as that. And when population increases, everything becomes a rat race and people lose empathy, morals and ethics, focusing only on getting ahead of that person beside them through any means. So, population does matter. Because we are a country of fake data and fake poors. Once again, that's okay. Identity politics is a part of politics. India is the largest, and one of the rarest cases of surviving third world democracies. It's only \\~77 years old as a democracy. Narrow politics prevails in youth stages of democracy. Narrow mindsets, conservatism is present, but have faith, time will help us evolve to more rational beings :) >population does matter Not in the way you're implying. Our country's population is young, and is primed to be put to good use in the country or outside. A working population is a resource, just like oil, or minerals. You're thinking of it in narrow terms of \"if there are too many people, there is more competition for jobs\" but you're not considering how much upkeep such a population requires, how many teachers, school staff, colleges and professors, auxiliary staff, doctors, nurses, civil engineers to expand the infrastructure needed to support the population, law enforcement, government employees, bank and postal employees, not to mention agriculture, transport and storage services are needed for such a massive population. These are where the jobs are for everyone, and this is where the government has to focus on expanding the capabilities of these departments and hiring qualified personnel based on local needs. Our population is only a burden because our leaders have failed to address its needs and nurture it, utilize it the way it was meant to be used, using the population for its own good and build something great from it. No, now we have a population bursting at the seams, with the elite few squandering them for their own personal gain and everyone else laboring under them with the threat of being easily replaceable hanging over their heads because the status quo is beneficial to those in power, why would they want anything to change. It's too bad you can't sell garbage from the street, that would make everyone millionaires. Sometimes I play a game where I search a random street view in India and you win by finding a 360 view with no visible trash. Haven't won the game yet True. Downvoted for telling the truth. *sigh* You want your fellow innocent countrymen to die ??? Left wing ideologies have brainwashed you such a limit that you don’t consider Indian lives having any value.. China directs towards innovation,, what a joke. They steal tech and give it to their startups. You want our government to steal western tech??? At least their government is competent enough to steal tech. Our babus can’t even steal tech to make a bullock cart. And Chinese tech is now way ahead of every other country maybe except US. They have their in-house software for everything. Just go to their cities and see once how well their stuff is integrated. Meanwhile our country just keeps on chest thumping UPI UPI UPI which is not even that convenient. Way worse than tap to pay using Apple Pay, Google wallet or Alipay. And yes, I want our government to steal tech. At least we’ll see some progress that way. Just look at government websites. They’d be considered outdated in 1998. Thats a very educated take. Our constitutional protections of intellectual property and personal freedom should be thrown out, they are useless Yep, it’s not like you can criticise the government freely even in India. If you’re big enough the government will fuck you over. Same with media, no freedom. I’d rather be in a prosperous nation with clean air, god tier infrastructure, low taxes, cheap goods and good wages than to have stupid shit like freedom of speech and be piss poor. Are you 10 or something? Can you not see the sarcastic indicator at the end of the sentence? Did they not teach you humour in whatever political wing you belong to? Our agriculture labour constitutes majority of population to an extent any small increase in their per capita will impact entire country’s per capita. According to you, if govt was able to provide meaningful jobs in agriculture, we would have been in much better position. The low per capita shows that even they are not doing very well. With current population and replacement rates, it will be decades before we will have 2 digit per capita rank. I.e a new generation."
}