{
    "id": "16zh8e4",
    "title": "ED should not be vindictive; must act with utmost fairness: Supreme Court",
    "url": "https://i.redd.it/d7qrxgl875sb1.jpg",
    "selftext": "Source: https://twitter.com/barandbench/status/1709472902033318199?t=0Mj4X6yHuQMZXVR7c0A6Ww&s=19",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696406417.0,
    "convurl": "https://i.redd.it/d7qrxgl875sb1.jpg",
    "comments": [
        "Bar and Bench is not a good source",
        "Why ?",
        "They post posts like this for every observation and observations are not orders. Comments made by the judge during the hearing have no impact on the order. \n\nEven the live tweets of the cases by Bar and Bench makes things seem very different than live tweets by LiveLaw, for example.",
        "They never claimed it in their orders. Its the lawyer's fault for misunderstanding where there was none.",
        "The country today runs on WhatsApp forwards and Bar and Bench gives them exactly that. Headlines based on oral comments and posts made on clickbaity headlines. \n\nFollow the same case on live tweets on Bar and Bench and a secondary source and you will see the difference in how the hearing went.",
        "Why are you looking at its Twitter ? I never use Bar and Bench Twitter. Only the main page. Anyone stupid enough to look at its Twitter to get news deserves to be a victim of fake news"
    ],
    "cleaned_text": "ed vindictive must act utmost fairness supreme court source ",
    "cleaned_title": "ed vindictive must act utmost fairness supreme court",
    "cleaned_selftext": "source",
    "cleaned_comments": "bar bench good source post posts like every observation observations orders comments made judge hearing impact order even live tweets cases bar bench makes things seem different live tweets livelaw example never claimed orders lawyers fault misunderstanding none country today runs whatsapp forwards bar bench gives exactly headlines based oral comments posts made clickbaity headlines follow case live tweets bar bench secondary source see difference hearing went looking twitter never use bar bench twitter main page anyone stupid enough look twitter get news deserves victim fake news",
    "light_cleaned_title": "ED should not be vindictive; must act with utmost fairness: Supreme Court",
    "light_cleaned_selftext": "Source:",
    "light_cleaned_comments": "Bar and Bench is not a good source Why ? They post posts like this for every observation and observations are not orders. Comments made by the judge during the hearing have no impact on the order. Even the live tweets of the cases by Bar and Bench makes things seem very different than live tweets by LiveLaw, for example. They never claimed it in their orders. Its the lawyer's fault for misunderstanding where there was none. The country today runs on WhatsApp forwards and Bar and Bench gives them exactly that. Headlines based on oral comments and posts made on clickbaity headlines. Follow the same case on live tweets on Bar and Bench and a secondary source and you will see the difference in how the hearing went. Why are you looking at its Twitter ? I never use Bar and Bench Twitter. Only the main page. Anyone stupid enough to look at its Twitter to get news deserves to be a victim of fake news"
}