{
    "id": "17x77uw",
    "title": "The ITLF (Kuki-Zo Organisation in Manipur) declares \"self-rule\"",
    "url": "https://www.reddit.com/r/india/comments/17x77uw/the_itlf_kukizo_organisation_in_manipur_declares/",
    "selftext": "The ITLF has declared \"self-rule\" with the Kuki-Zo community having a separate government with a separate Chief Minister. \nIts General Secretary said the following:\n\"We don't care if the Centre does not recognise us. \nThe Kuki-Zo people have been 'hurt' by the remarks of the Union Home Minister calling them 'illegal immigrants '\". \nThe Kuki-Zo People have a vision of congregating areas where their people live (Manipur, Mizoram, Chin district of Myanmar and Chittagong hills of Bangladesh) and create a separate nation for themselves.\n\nIs this Constitutionally legal?\n\nSource: https://www.indiatoday.in/india/story/manipur-violence-update-kuki-meitei-communities-clash-self-ruled-separate-administration-dead-injured-2463594-2023-11-16",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1700196271.0,
    "convurl": "https://external-preview.redd.it/jIkI0hOn9ZTEQobOWqjKNAe8sV0R6IEQteZTShcBLQY.jpg?auto=webp&s=9ac3955cbd3adcc1fc6830a351646d150e977c99",
    "comments": [],
    "cleaned_text": "itlf kukizo organisation manipur declares selfrule itlf declared selfrule kukizo community separate government separate chief minister general secretary said following dont care centre recognise us kukizo people hurt remarks union home minister calling illegal immigrants kukizo people vision congregating areas people live manipur mizoram chin district myanmar chittagong hills bangladesh create separate nation constitutionally legal source ",
    "cleaned_title": "itlf kukizo organisation manipur declares selfrule",
    "cleaned_selftext": "itlf declared selfrule kukizo community separate government separate chief minister general secretary said following dont care centre recognise us kukizo people hurt remarks union home minister calling illegal immigrants kukizo people vision congregating areas people live manipur mizoram chin district myanmar chittagong hills bangladesh create separate nation constitutionally legal source",
    "cleaned_comments": "",
    "light_cleaned_title": "The ITLF (Kuki-Zo Organisation in Manipur) declares \"self-rule\"",
    "light_cleaned_selftext": "The ITLF has declared \"self-rule\" with the Kuki-Zo community having a separate government with a separate Chief Minister. Its General Secretary said the following: \"We don't care if the Centre does not recognise us. The Kuki-Zo people have been 'hurt' by the remarks of the Union Home Minister calling them 'illegal immigrants '\". The Kuki-Zo People have a vision of congregating areas where their people live (Manipur, Mizoram, Chin district of Myanmar and Chittagong hills of Bangladesh) and create a separate nation for themselves. Is this Constitutionally legal? Source:",
    "light_cleaned_comments": ""
}