{
    "id": "1feg3w1",
    "title": "Karnataka invites eight states to discuss ‘unfair’ devolution of taxes by the Union government",
    "url": "https://www.deccanherald.com/india/karnataka/karnataka-invites-eight-states-to-discuss-unfair-devolution-3186877",
    "selftext": "> Siddaramaiah has reached out to chief ministers of Kerala, Tamil Nadu, Andhra Pradesh, Telangana, Punjab, Haryana, Maharashtra and Gujarat. The last three states have the BJP in government.",
    "flair": "Policy/Economy",
    "score": 109,
    "num_comments": 17,
    "created_utc": 1726076192.0,
    "convurl": "https://external-preview.redd.it/oQUo_qgnGhL8lVkxp6YzoqrrLnlcGFJmu5Um7rpSrss.jpg?auto=webp&s=e186c7ea3f13559fbb0c761bc42d9d661cd311fd",
    "comments": [
        "Nice...atleast the southern states try",
        "That’s the purpose of taxes. They should be used where they are needed more. For an analogy, People with income less than 5 lacs dont pay direct tax, someone who pays direct tax cant claim that govt spending on non direct tax paying citizens is unfair. Free ration and subsidies are given mostly to the people who don’t even  pay direct taxes. Thats not unfair for someone paying direct taxes, its just how the tax money should be spent.",
        "True but 1000s of crores goes to pockets of babus under the pretext of development projects, where is actual development?",
        "Fair, I’m from Bihar and I’m tired of the way that state is managed. People need to take some accountability, you get what you vote for. The caste politics and corruption in that state is rancid, why shouldn’t states that have managed their money properly get more benefits. This isn’t to say that the state shouldn’t get help, but I really think since regional disparity is increasing, allocation should be turned more capitalistic. Five developing states IMF type loans from the centre, have better oversight on the projects they’re being used for. ",
        "using it under the pretext of where it is needed more without any certainty of the benefits or time period or attempts to improve the situation is simply dumb, certainly unfair, unproductive and those that support it without any preconditions are no different from the free loading beneficiaries.",
        "Real development happens around Cabinet Ministers house and other important officials.\n\n  \nRest of us are like ants to them where barely anything changes.",
        "Gujarat laughs in the corner.",
        "I guess earning quotas are not being met.",
        "Silly thought - Reorganize rajya sabha based on Per Capita revenue rather than population.",
        "Yeah this was big before state elections. Finally they're talking about it. Tbh I'm also tired of such tweets \"we are feeding you\". Also have been called begger, unthankful, and whatnot.",
        "the problem with that line of thinking is that you are absolving the government from all accountability related to fiscal mgmt.. there are much bigger problems in governance that should be fixed before I would even think of trusting the government with fiscal mgmt"
    ],
    "cleaned_text": "karnataka invites eight states discuss unfair devolution taxes union government siddaramaiah reached chief ministers kerala tamil nadu andhra pradesh telangana punjab haryana maharashtra gujarat last three states bjp government ",
    "cleaned_title": "karnataka invites eight states discuss unfair devolution taxes union government",
    "cleaned_selftext": "siddaramaiah reached chief ministers kerala tamil nadu andhra pradesh telangana punjab haryana maharashtra gujarat last three states bjp government",
    "cleaned_comments": "niceatleast southern states try thats purpose taxes used needed analogy people income less lacs dont pay direct tax someone pays direct tax cant claim govt spending non direct tax paying citizens unfair free ration subsidies given mostly people dont even pay direct taxes thats unfair someone paying direct taxes tax money spent true crores goes pockets babus pretext development projects actual development fair im bihar im tired way state managed people need take accountability get vote caste politics corruption state rancid shouldnt states managed money properly get benefits isnt say state shouldnt get help really think since regional disparity increasing allocation turned capitalistic five developing states imf type loans centre better oversight projects theyre used using pretext needed without certainty benefits time period attempts improve situation simply dumb certainly unfair unproductive support without preconditions different free loading beneficiaries real development happens around cabinet ministers house important officials rest us like ants barely anything changes gujarat laughs corner guess earning quotas met silly thought reorganize rajya sabha based per capita revenue rather population yeah big state elections finally theyre talking tbh im also tired tweets feeding also called begger unthankful whatnot problem line thinking absolving government accountability related fiscal mgmt much bigger problems governance fixed would even think trusting government fiscal mgmt",
    "light_cleaned_title": "Karnataka invites eight states to discuss ‘unfair’ devolution of taxes by the Union government",
    "light_cleaned_selftext": "> Siddaramaiah has reached out to chief ministers of Kerala, Tamil Nadu, Andhra Pradesh, Telangana, Punjab, Haryana, Maharashtra and Gujarat. The last three states have the BJP in government.",
    "light_cleaned_comments": "Nice...atleast the southern states try That’s the purpose of taxes. They should be used where they are needed more. For an analogy, People with income less than 5 lacs dont pay direct tax, someone who pays direct tax cant claim that govt spending on non direct tax paying citizens is unfair. Free ration and subsidies are given mostly to the people who don’t even pay direct taxes. Thats not unfair for someone paying direct taxes, its just how the tax money should be spent. True but 1000s of crores goes to pockets of babus under the pretext of development projects, where is actual development? Fair, I’m from Bihar and I’m tired of the way that state is managed. People need to take some accountability, you get what you vote for. The caste politics and corruption in that state is rancid, why shouldn’t states that have managed their money properly get more benefits. This isn’t to say that the state shouldn’t get help, but I really think since regional disparity is increasing, allocation should be turned more capitalistic. Five developing states IMF type loans from the centre, have better oversight on the projects they’re being used for. using it under the pretext of where it is needed more without any certainty of the benefits or time period or attempts to improve the situation is simply dumb, certainly unfair, unproductive and those that support it without any preconditions are no different from the free loading beneficiaries. Real development happens around Cabinet Ministers house and other important officials. Rest of us are like ants to them where barely anything changes. Gujarat laughs in the corner. I guess earning quotas are not being met. Silly thought - Reorganize rajya sabha based on Per Capita revenue rather than population. Yeah this was big before state elections. Finally they're talking about it. Tbh I'm also tired of such tweets \"we are feeding you\". Also have been called begger, unthankful, and whatnot. the problem with that line of thinking is that you are absolving the government from all accountability related to fiscal mgmt.. there are much bigger problems in governance that should be fixed before I would even think of trusting the government with fiscal mgmt"
}