{
    "id": "1dai5vo",
    "title": "Shame you Flipkart...",
    "url": "https://www.reddit.com/gallery/1dai5vo",
    "selftext": "I can't believe how they allow it, every shoe on sale are costlier than the marked price except size 10, 11 shoes \n\nFor once i thought about buying shoes from online; never again...",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1717785307.0,
    "convurl": "https://i.redd.it/0ehfzwxm175d1.jpg",
    "comments": [
        "Well, first of all it has nothing to do with Flipkart. The prices are marked by the sellers. \n\nSecondly, even the brand stores themselves have different pricing for different sizes and colours. \n\nDuring sales, only the unsold and not so common sizes (and sometimes weird colours) of that particular shoes are sold at great discounts. Why would anyone sell any product for a discount, if it’s demand is ever increasing?",
        "Supply and demand nhi padha kya Bhai kabhi",
        "Flipkart is displaying the discount price, even in the product page, at least tell me that it's for xl. \n\nAnyway lesson learnt."
    ],
    "cleaned_text": "shame flipkart cant believe allow every shoe sale costlier marked price except size shoes thought buying shoes online never ",
    "cleaned_title": "shame flipkart",
    "cleaned_selftext": "cant believe allow every shoe sale costlier marked price except size shoes thought buying shoes online never",
    "cleaned_comments": "well first nothing flipkart prices marked sellers secondly even brand stores different pricing different sizes colours sales unsold common sizes sometimes weird colours particular shoes sold great discounts would anyone sell product discount demand ever increasing supply demand nhi padha kya bhai kabhi flipkart displaying discount price even product page least tell xl anyway lesson learnt",
    "light_cleaned_title": "Shame you Flipkart...",
    "light_cleaned_selftext": "I can't believe how they allow it, every shoe on sale are costlier than the marked price except size 10, 11 shoes For once i thought about buying shoes from online; never again...",
    "light_cleaned_comments": "Well, first of all it has nothing to do with Flipkart. The prices are marked by the sellers. Secondly, even the brand stores themselves have different pricing for different sizes and colours. During sales, only the unsold and not so common sizes (and sometimes weird colours) of that particular shoes are sold at great discounts. Why would anyone sell any product for a discount, if it’s demand is ever increasing? Supply and demand nhi padha kya Bhai kabhi Flipkart is displaying the discount price, even in the product page, at least tell me that it's for xl. Anyway lesson learnt."
}