{
    "id": "12bas01",
    "title": "Does anyone have any idea of the PM Cares fund?",
    "url": "https://www.reddit.com/r/india/comments/12bas01/does_anyone_have_any_idea_of_the_pm_cares_fund/",
    "selftext": "ONGC donates Rs. 100 crore in the background of surge in Covid cases: https://www.livemint.com/companies/news/ongc-contributes-100-crore-to-pm-cares-fund-to-fight-covid-19-and-h3n2-virus-surge-in-india-11680334173449.html\n\n\nThe whole timeline of the fund is skewed. \n\nAround 10,000 crore were collected, 68% of which is unspent. \n\nThen, the fact that a great amount of this money came from Company's Corporate Social Responsibility targets and from Public Sector Banks. The salaries of Government employees was taken mandatorily, even from the Armed Forces service persons.\n\nThe state objective of buying medical equipments (ventilators) and setting up oxygen cylinder plants was barely fulfilled. Before it was, the ventilators were marked subpar in quality and many of them had broken down early. \n\nThe issue of ownership is a stressful one. The govt. has issued different replies to the RTIs - not govt controlled or majorly financed and then the opposite. Or, the RTI doesn't apply since it is outside lieu of Govt.\n\nhttps://indianexpress.com/article/cities/delhi/pm-cares-fund-public-authority-rti-act-centre-delhi-high-court-8414937/\n\nThen, there are provisions of auditing which were initially missing and then fulfilled by a party with conjoined interests. \n\nIt goes on and on. There is, perhaps, still one suit pending in Delhi HC. \n\nThere is also the matter that the message to donate did come from the authorities. Also, the matter of foreign contribution which was a considerable reversal in policy.\n\nThe fund does submit annual reports. At this moment, what all causes Gov to not open up the files to public scrutiny? (If this is all for good use)\n\nWhy are more people not pushing on this issues since a lot of these concern constitutionality?",
    "flair": "Politics",
    "score": 160,
    "num_comments": 27,
    "created_utc": 1680589114.0,
    "convurl": "https://external-preview.redd.it/6iKQnnisHI8-XY9fCAi8_LV2CK_pfpo8o9uMRBr6oes.jpg?auto=webp&v=enabled&s=626bc804656a4e846efbd883c3e9c014606e250a",
    "comments": [
        "You just reminded me of the website https://pmcares.fund/ that went viral.",
        "Can't find any oil anywhere, but hands away funds meant to find it. Fucking morons",
        "People have been pushing on this issue just not from mainstream media and the issue died because there is no way of making progress especially when the judiciary is with the government. So internet media knew the limits of this case so as long as people like you are suspicious of this case, those reports have served their purpose. Because once you start questioning, it is just a short walk from there, to understand that the government is evading democratic accountability to cover up the mishandling of the PM CARE fund. You will have to make a few assumptions to reach that conclusion though. For instance, if the fund itself is designed in such a way that it is outside the bounds of any investigative institutions, RTI, or auditory mandates then you can assume that the government was planning to mishandle the funds. At this point, it is not even the government, it is Modi's private fund that he mishandled.\n\nAlso what might be unconstitutional is not necessarily illegal. So if the fund is designed that way then it is not a bug. it's a feature that the government was willing to use to its advantage.\n\n&#x200B;\n\nEdit: Also just understand so far we did not have such a case where a prime minister is using his office to make a private fund, so it was always legal, it is just that no one thought of actually doing it until now.",
        "This is what happens when you have a loser opposition not pressing on the issues that would actually matter and give them an edge",
        "Not under RTI jurisdiction.",
        "Please get the name right it's \"PM DOES NOT CARE FUND \"",
        "PM doesn't give a fuck fund you mean..",
        "Fund collection gets bombarded becaus the tax regime is designed in such a manner that businessed find it very attractive to deposit their CSR amount. At the same time, people with the highest deposits dont give a flying fuck about social responsibility, hence while they are aware about how its not wisely spent or not spent at all, they dont find it a priority to take action about it. After all fighting the government is a waste of energy at most of the time. This being an opinion based on most businesses, not all.\n\nMostly people who do care about social responsibility do charity first hand, never via NGO’s and NPO’s.",
        "I am discovering it now, the helll...",
        "In plain words, if the people know that the shit is wrong, they just know and spread its word unintentionally without being able to stop it. Also if we know it's too late to do anything now because never has there been a law for private pm funds to be illegal. This was a new scheme of Mudi scamming people. \n\nI checked the wiki entry and the first paragraph says it's unclear how mudiji manages this much fund privately.\n\nSo much for sticking that long ass bearded face on PM cares posters and images a few years back. We had the hints this fund was donated to PM for his personal needs and not for contingency needs.",
        "Cannot manage personal financial expenses and are here for fantasy calculation.",
        "the game is nicely made too",
        "Thank you for the free money!",
        "More like Care for PM fund",
        "pm cares fund is utilized for nobel social causes such as adani bachao jan andolan and mla's in distress collective. Of course details about this are obfuscated but you can make sure the money is used for good causes.",
        "This is the topic mr gandhi should have focused on instead of Adani",
        "PM cares ‘about his party’ fund."
    ],
    "cleaned_text": "anyone idea pm cares fund ongc donates rs crore background surge covid cases whole timeline fund skewed around crore collected unspent fact great amount money came companys corporate social responsibility targets public sector banks salaries government employees taken mandatorily even armed forces service persons state objective buying medical equipments ventilators setting oxygen cylinder plants barely fulfilled ventilators marked subpar quality many broken early issue ownership stressful one govt issued different replies rtis govt controlled majorly financed opposite rti doesnt apply since outside lieu govt provisions auditing initially missing fulfilled party conjoined interests goes perhaps still one suit pending delhi hc also matter message donate come authorities also matter foreign contribution considerable reversal policy fund submit annual reports moment causes gov open files public scrutiny good use people pushing issues since lot concern constitutionality ",
    "cleaned_title": "anyone idea pm cares fund",
    "cleaned_selftext": "ongc donates rs crore background surge covid cases whole timeline fund skewed around crore collected unspent fact great amount money came companys corporate social responsibility targets public sector banks salaries government employees taken mandatorily even armed forces service persons state objective buying medical equipments ventilators setting oxygen cylinder plants barely fulfilled ventilators marked subpar quality many broken early issue ownership stressful one govt issued different replies rtis govt controlled majorly financed opposite rti doesnt apply since outside lieu govt provisions auditing initially missing fulfilled party conjoined interests goes perhaps still one suit pending delhi hc also matter message donate come authorities also matter foreign contribution considerable reversal policy fund submit annual reports moment causes gov open files public scrutiny good use people pushing issues since lot concern constitutionality",
    "cleaned_comments": "reminded website went viral cant find oil anywhere hands away funds meant find fucking morons people pushing issue mainstream media issue died way making progress especially judiciary government internet media knew limits case long people like suspicious case reports served purpose start questioning short walk understand government evading democratic accountability cover mishandling pm care fund make assumptions reach conclusion though instance fund designed way outside bounds investigative institutions rti auditory mandates assume government planning mishandle funds point even government modis private fund mishandled also might unconstitutional necessarily illegal fund designed way bug feature government willing use advantage xb edit also understand far case prime minister using office make private fund always legal one thought actually happens loser opposition pressing issues would actually matter give edge rti jurisdiction please get name right pm care fund pm doesnt give fuck fund mean fund collection gets bombarded becaus tax regime designed manner businessed find attractive deposit csr amount time people highest deposits dont give flying fuck social responsibility hence aware wisely spent spent dont find priority take action fighting government waste energy time opinion based businesses mostly people care social responsibility charity first hand never via ngos npos discovering helll plain words people know shit wrong know spread word unintentionally without able stop also know late anything never law private pm funds illegal new scheme mudi scamming people checked wiki entry first paragraph says unclear mudiji manages much fund privately much sticking long ass bearded face pm cares posters images years back hints fund donated pm personal needs contingency needs manage personal financial expenses fantasy calculation game nicely made thank free money like care pm fund pm cares fund utilized nobel social causes adani bachao jan andolan mlas distress collective course details obfuscated make sure money used good causes topic mr gandhi focused instead adani pm cares party fund",
    "light_cleaned_title": "Does anyone have any idea of the PM Cares fund?",
    "light_cleaned_selftext": "ONGC donates Rs. 100 crore in the background of surge in Covid cases: The whole timeline of the fund is skewed. Around 10,000 crore were collected, 68% of which is unspent. Then, the fact that a great amount of this money came from Company's Corporate Social Responsibility targets and from Public Sector Banks. The salaries of Government employees was taken mandatorily, even from the Armed Forces service persons. The state objective of buying medical equipments (ventilators) and setting up oxygen cylinder plants was barely fulfilled. Before it was, the ventilators were marked subpar in quality and many of them had broken down early. The issue of ownership is a stressful one. The govt. has issued different replies to the RTIs - not govt controlled or majorly financed and then the opposite. Or, the RTI doesn't apply since it is outside lieu of Govt. Then, there are provisions of auditing which were initially missing and then fulfilled by a party with conjoined interests. It goes on and on. There is, perhaps, still one suit pending in Delhi HC. There is also the matter that the message to donate did come from the authorities. Also, the matter of foreign contribution which was a considerable reversal in policy. The fund does submit annual reports. At this moment, what all causes Gov to not open up the files to public scrutiny? (If this is all for good use) Why are more people not pushing on this issues since a lot of these concern constitutionality?",
    "light_cleaned_comments": "You just reminded me of the website that went viral. Can't find any oil anywhere, but hands away funds meant to find it. Fucking morons People have been pushing on this issue just not from mainstream media and the issue died because there is no way of making progress especially when the judiciary is with the government. So internet media knew the limits of this case so as long as people like you are suspicious of this case, those reports have served their purpose. Because once you start questioning, it is just a short walk from there, to understand that the government is evading democratic accountability to cover up the mishandling of the PM CARE fund. You will have to make a few assumptions to reach that conclusion though. For instance, if the fund itself is designed in such a way that it is outside the bounds of any investigative institutions, RTI, or auditory mandates then you can assume that the government was planning to mishandle the funds. At this point, it is not even the government, it is Modi's private fund that he mishandled. Also what might be unconstitutional is not necessarily illegal. So if the fund is designed that way then it is not a bug. it's a feature that the government was willing to use to its advantage. &#x200B; Edit: Also just understand so far we did not have such a case where a prime minister is using his office to make a private fund, so it was always legal, it is just that no one thought of actually doing it until now. This is what happens when you have a loser opposition not pressing on the issues that would actually matter and give them an edge Not under RTI jurisdiction. Please get the name right it's \"PM DOES NOT CARE FUND \" PM doesn't give a fuck fund you mean.. Fund collection gets bombarded becaus the tax regime is designed in such a manner that businessed find it very attractive to deposit their CSR amount. At the same time, people with the highest deposits dont give a flying fuck about social responsibility, hence while they are aware about how its not wisely spent or not spent at all, they dont find it a priority to take action about it. After all fighting the government is a waste of energy at most of the time. This being an opinion based on most businesses, not all. Mostly people who do care about social responsibility do charity first hand, never via NGO’s and NPO’s. I am discovering it now, the helll... In plain words, if the people know that the shit is wrong, they just know and spread its word unintentionally without being able to stop it. Also if we know it's too late to do anything now because never has there been a law for private pm funds to be illegal. This was a new scheme of Mudi scamming people. I checked the wiki entry and the first paragraph says it's unclear how mudiji manages this much fund privately. So much for sticking that long ass bearded face on PM cares posters and images a few years back. We had the hints this fund was donated to PM for his personal needs and not for contingency needs. Cannot manage personal financial expenses and are here for fantasy calculation. the game is nicely made too Thank you for the free money! More like Care for PM fund pm cares fund is utilized for nobel social causes such as adani bachao jan andolan and mla's in distress collective. Of course details about this are obfuscated but you can make sure the money is used for good causes. This is the topic mr gandhi should have focused on instead of Adani PM cares ‘about his party’ fund."
}