{
    "id": "1ho28ol",
    "title": "DigiYatra Wrapped",
    "url": "https://www.reddit.com/gallery/1ho28ol",
    "selftext": "I noticed the DigiYatra Wrapped feature recently, and it made me pause—not because I wanted to see my travel history, but because I couldn’t figure out how they’d even make a “Wrapped” video if they claim to have no data.\n\nThe app says they don’t store any user data, which feels like a clever way to address privacy concerns. It’s an interesting approach. If they really don’t store data, they could’ve technically used local data on the app (like travel timestamps or airport visits) to generate a Wrapped without saving anything on servers. But realistically, apps like this probably wouldn’t invest time or money into building that kind of local-only data processing—it’s just not how most systems are designed, especially when the focus is on scaling or analytics.\n\nWhat’s also interesting is their privacy policy. It mentions that data could be used for things like product improvements or surveys. Some of the data they collect, like contact details or audio-visual info, doesn’t seem super relevant to just verifying your face at the airport. It does make me wonder how well this aligns with the idea of “minimal data collection.”\n\nThat said, the Wrapped feature is a pretty smart idea. Whether it’s 100% accurate or just a way to address privacy concerns, it’s definitely making people think more about how apps handle data.\n\nWhat do you think? Could they have made a Wrapped using just local data, or is this more about managing how people perceive privacy?",
    "flair": "Policy/Economy",
    "score": 236,
    "num_comments": 37,
    "created_utc": 1735377984.0,
    "convurl": "https://i.redd.it/5c8obunp5k9e1.jpg",
    "comments": [
        "Heh.. An Indian company pushed by the current gov to store our documents doesn't store any data.. Heh",
        "Kitna badiya jumla hai.",
        "A data privacy expert would be able to answer this batter but I have listened to the Amit Varma podcast with the man who consulted with the GOI on creating Aadhar and DigiYatra. He has written 2 books about data privacy laws and is the foinder of one of the biggest law firms in India. It's a long episode (The Seen and teh Unseen usually has long episodes) but worth listening to atleast in 1.5x as a start. [Episode 360: Rahul Matthan Seeks the Protocol (18 Dec 2023)](https://seenunseen.in/episodes/2023/12/18/episode-360-rahul-matthan-seeks-the-protocol/)",
        "Aagaye PR aur promotion wale 14 idhar bhi. This post is clearly a promotion. Im reporting.",
        "Screw digiyatra, am not giving shit to anybody.",
        "Chut!y@ hai kya",
        "Kar lo",
        "What exactly is this feature?",
        "Bro.. did you even read the post description?\n\nWhat kind of PR team highlights potential shortcomings?",
        "Have you not seen that post where a company was firing employees because they were stressed? Turns out even that was a PR stunt.",
        "I don’t see any feature. It’s just a video that plays at the start that talks about a ‘Wrapped’ feature and then says “we couldn’t find anything because we don’t store your data, here’s to more private flights in 2025”.",
        "Love the show, thanks for sharing this.",
        "No way, they just dont have the budget or the engineering team to work on the customised analytics. But surely they track your move.",
        "Internet Freedom Foundation have been tracking DigiYatra since it's inception and raised red flags over its deceptive data collection and security measures. Check their instagram",
        "unless you are at a pathologist. and your doctor prescribed a test",
        "You lack basic comprehension and critical thinking if you still think this after reading the entire write up",
        "\"You can have my stool sample when you pry it from my cold, dead hands!\"",
        "I still believe it is a promotion event like the yes madaam incident. These days any pr is good pr.",
        "If people actually fall for this PR BS it’s just sad",
        "at that point, they can get a more fresh sample from your autopsy",
        "P.S. I am not endorsing the application in any manner (I thought it was obvious and as normal people I can just share my observations).",
        "Laura yatra",
        "Didn't you see the video?\n\nThe Wrapped feature doesn't show any of your flights. It just says 'zero' for everyone and claims its because they don't store any data.",
        "Rich. Especially after the [new and old digiyatra app fiasco](https://www.thehindu.com/sci-tech/technology/digi-yatra-foundation-drops-app-maker-after-data-breach/article68093722.ece) - DataEvolve or some such, which was the original vendor, was a one person company run by some IPS family kid, and hosted off his private cloud. The same dude was arrested for making a scam chalan app.",
        "koi iss sub walo ko aake bolenga aapki mummy kisi ke sath bhaag gayi ye log tab bhi bolenge PR hai, jumla hai,  mOdI sHoUlD rEsIgN",
        "Exactly. For me the single biggest red flag is how they practically beg you to use Digi Yatra, and the lengths they go to to make the process easier for Digi Yatra users - multiple lanes at the entrance, multiple lanes at Security.  \n\nI refuse to believe that a sarkari agency would do this purely out of the goodness of their hearts, given how in our country sarkari agencies usually take immense pleasure in making lives as miserable as possible for citizens.",
        "They are clearly saying they don’t save data centrally. It is distributed among many data centers.",
        "Haan Haan, samajh gaye. Centrally located nahi hai. Hamara data Bahut jagah rakha hua hai.",
        "I think you might be confusing Digiyatra with Digilocker.",
        "And still, likes of mallyas and modis will flee!",
        "What is DigiYatra ?",
        "I try to avoid accepting cookies for privacy and geolocation reasons. You have no idea how many people in the Dark Web currently have your phone number, email address, and even home address.",
        "Here's the thing, the cloud, SaaS and platform business models are inherently flawed. Whenever the user is the product, you can't have privacy. When you pay INR 200 for a service, using that productized service is costing you 6X what you pay. Such architecture based services can't be privacy conscious also because they are dependent on some degree of omni-channel promotional mechanics. Which as it turns out are also a foundation pillar of platform business models to function.",
        "Um, why is your stool in your hands???",
        "silly doubt: what is the risk of using DigiYatra? What kind of data will they have access to if one uses it? And what can be done with that? (Not like our data isn’t already with the government- aadhaar pan etc)\nPlease educate me on this. Thank you!",
        "Bro what did you expect by not posting mudiji criticism post? Dare not post anything other than vishwaguru criticism here else it will be reported /s",
        "Digiyatra is the company that had to reissue its own app as it lost the app and the data earlier. Who knows where that data is now. No wonder you get spam and scam calls now.\n\nNope, not using it.",
        "Raita jaise phaila hua hai. LOL",
        "We don't have any privacy laws, it's exhausting how backwards we are with our data freedom and privacy. And the govt doesn't care because it ultimately benefits them. \n\nI'm so sick and tired of these shenanigans that these companies are able to pull off.\n\nI'm so sick of having to share my personal cell number for every little damn thing. I hope this bullshit comes to an end.",
        "data will be shared even for some other purposes, check twitter",
        "New update: The government may authorise the Income Tax department to look at DY data and identify frequent flyers and then make their assertions. This is getting too out of hand - this entire wrapped thing now sure seems more like a gimmick",
        "New update: The government may authorise the Income Tax department to look at DY data and identify frequent flyers and then make their assertions. This is getting too out of hand - this entire wrapped thing now sure seems more like a gimmick",
        "New update: The government may authorise the Income Tax department to look at DY data and identify frequent flyers and then make their assertions. This is getting too out of hand - this entire wrapped thing now sure seems more like a gimmick."
    ],
    "cleaned_text": "digiyatra wrapped noticed digiyatra wrapped feature recently made pausenot wanted see travel history couldnt figure theyd even make wrapped video claim data app says dont store user data feels like clever way address privacy concerns interesting approach really dont store data couldve technically used local data app like travel timestamps airport visits generate wrapped without saving anything servers realistically apps like probably wouldnt invest time money building kind localonly data processingits systems designed especially focus scaling analytics whats also interesting privacy policy mentions data could used things like product improvements surveys data collect like contact details audiovisual info doesnt seem super relevant verifying face airport make wonder well aligns idea minimal data collection said wrapped feature pretty smart idea whether accurate way address privacy concerns definitely making people think apps handle data think could made wrapped using local data managing people perceive privacy ",
    "cleaned_title": "digiyatra wrapped",
    "cleaned_selftext": "noticed digiyatra wrapped feature recently made pausenot wanted see travel history couldnt figure theyd even make wrapped video claim data app says dont store user data feels like clever way address privacy concerns interesting approach really dont store data couldve technically used local data app like travel timestamps airport visits generate wrapped without saving anything servers realistically apps like probably wouldnt invest time money building kind localonly data processingits systems designed especially focus scaling analytics whats also interesting privacy policy mentions data could used things like product improvements surveys data collect like contact details audiovisual info doesnt seem super relevant verifying face airport make wonder well aligns idea minimal data collection said wrapped feature pretty smart idea whether accurate way address privacy concerns definitely making people think apps handle data think could made wrapped using local data managing people perceive privacy",
    "cleaned_comments": "heh indian company pushed current gov store documents doesnt store data heh kitna badiya jumla hai data privacy expert would able answer batter listened amit varma podcast man consulted goi creating aadhar digiyatra written books data privacy laws foinder one biggest law firms india long episode seen teh unseen usually long episodes worth listening atleast x start episode rahul matthan seeks protocol dec httpsseenunseeninepisodesepisoderahulmatthanseekstheprotocol aagaye pr aur promotion wale idhar bhi post clearly promotion im reporting screw digiyatra giving shit anybody chuty hai kya kar lo exactly feature bro even read post description kind pr team highlights potential shortcomings seen post company firing employees stressed turns even pr stunt dont see feature video plays start talks wrapped feature says couldnt find anything dont store data heres private flights love show thanks sharing way dont budget engineering team work customised analytics surely track move internet freedom foundation tracking digiyatra since inception raised red flags deceptive data collection security measures check instagram unless pathologist doctor prescribed test lack basic comprehension critical thinking still think reading entire write stool sample pry cold dead hands still believe promotion event like yes madaam incident days pr good pr people actually fall pr bs sad point get fresh sample autopsy ps endorsing application manner thought obvious normal people share observations laura yatra didnt see video wrapped feature doesnt show flights says zero everyone claims dont store data rich especially new old digiyatra app fiascohttpswwwthehinducomscitechtechnologydigiyatrafoundationdropsappmakerafterdatabreacharticleece dataevolve original vendor one person company run ips family kid hosted private cloud dude arrested making scam chalan app koi iss sub walo ko aake bolenga aapki mummy kisi ke sath bhaag gayi ye log tab bhi bolenge pr hai jumla hai modi resign exactly single biggest red flag practically beg use digi yatra lengths go make process easier digi yatra users multiple lanes entrance multiple lanes security refuse believe sarkari agency would purely goodness hearts given country sarkari agencies usually take immense pleasure making lives miserable possible citizens clearly saying dont save data centrally distributed among many data centers haan haan samajh gaye centrally located nahi hai hamara data bahut jagah rakha hua hai think might confusing digiyatra digilocker still likes mallyas modis flee digiyatra try avoid accepting cookies privacy geolocation reasons idea many people dark web currently phone number email address even home address heres thing cloud saas platform business models inherently flawed whenever user product cant privacy pay inr service using productized service costing x pay architecture based services cant privacy conscious also dependent degree omnichannel promotional mechanics turns also foundation pillar platform business models function um stool hands silly doubt risk using digiyatra kind data access one uses done like data isnt already government aadhaar pan etc please educate thank bro expect posting mudiji criticism post dare post anything vishwaguru criticism else reported digiyatra company reissue app lost app data earlier knows data wonder get spam scam calls nope using raita jaise phaila hua hai lol dont privacy laws exhausting backwards data freedom privacy govt doesnt care ultimately benefits im sick tired shenanigans companies able pull im sick share personal cell number every little damn thing hope bullshit comes end data shared even purposes check twitter new update government may authorise income tax department look dy data identify frequent flyers make assertions getting hand entire wrapped thing sure seems like gimmick new update government may authorise income tax department look dy data identify frequent flyers make assertions getting hand entire wrapped thing sure seems like gimmick new update government may authorise income tax department look dy data identify frequent flyers make assertions getting hand entire wrapped thing sure seems like gimmick",
    "light_cleaned_title": "DigiYatra Wrapped",
    "light_cleaned_selftext": "I noticed the DigiYatra Wrapped feature recently, and it made me pause—not because I wanted to see my travel history, but because I couldn’t figure out how they’d even make a “Wrapped” video if they claim to have no data. The app says they don’t store any user data, which feels like a clever way to address privacy concerns. It’s an interesting approach. If they really don’t store data, they could’ve technically used local data on the app (like travel timestamps or airport visits) to generate a Wrapped without saving anything on servers. But realistically, apps like this probably wouldn’t invest time or money into building that kind of local-only data processing—it’s just not how most systems are designed, especially when the focus is on scaling or analytics. What’s also interesting is their privacy policy. It mentions that data could be used for things like product improvements or surveys. Some of the data they collect, like contact details or audio-visual info, doesn’t seem super relevant to just verifying your face at the airport. It does make me wonder how well this aligns with the idea of “minimal data collection.” That said, the Wrapped feature is a pretty smart idea. Whether it’s 100% accurate or just a way to address privacy concerns, it’s definitely making people think more about how apps handle data. What do you think? Could they have made a Wrapped using just local data, or is this more about managing how people perceive privacy?",
    "light_cleaned_comments": "Heh.. An Indian company pushed by the current gov to store our documents doesn't store any data.. Heh Kitna badiya jumla hai. A data privacy expert would be able to answer this batter but I have listened to the Amit Varma podcast with the man who consulted with the GOI on creating Aadhar and DigiYatra. He has written 2 books about data privacy laws and is the foinder of one of the biggest law firms in India. It's a long episode (The Seen and teh Unseen usually has long episodes) but worth listening to atleast in 1.5x as a start. [Episode 360: Rahul Matthan Seeks the Protocol (18 Dec 2023)](https://seenunseen.in/episodes/2023/12/18/episode-360-rahul-matthan-seeks-the-protocol/) Aagaye PR aur promotion wale 14 idhar bhi. This post is clearly a promotion. Im reporting. Screw digiyatra, am not giving shit to anybody. Chut!y@ hai kya Kar lo What exactly is this feature? Bro.. did you even read the post description? What kind of PR team highlights potential shortcomings? Have you not seen that post where a company was firing employees because they were stressed? Turns out even that was a PR stunt. I don’t see any feature. It’s just a video that plays at the start that talks about a ‘Wrapped’ feature and then says “we couldn’t find anything because we don’t store your data, here’s to more private flights in 2025”. Love the show, thanks for sharing this. No way, they just dont have the budget or the engineering team to work on the customised analytics. But surely they track your move. Internet Freedom Foundation have been tracking DigiYatra since it's inception and raised red flags over its deceptive data collection and security measures. Check their instagram unless you are at a pathologist. and your doctor prescribed a test You lack basic comprehension and critical thinking if you still think this after reading the entire write up \"You can have my stool sample when you pry it from my cold, dead hands!\" I still believe it is a promotion event like the yes madaam incident. These days any pr is good pr. If people actually fall for this PR BS it’s just sad at that point, they can get a more fresh sample from your autopsy P.S. I am not endorsing the application in any manner (I thought it was obvious and as normal people I can just share my observations). Laura yatra Didn't you see the video? The Wrapped feature doesn't show any of your flights. It just says 'zero' for everyone and claims its because they don't store any data. Rich. Especially after the [new and old digiyatra app fiasco](https://www.thehindu.com/sci-tech/technology/digi-yatra-foundation-drops-app-maker-after-data-breach/article68093722.ece) - DataEvolve or some such, which was the original vendor, was a one person company run by some IPS family kid, and hosted off his private cloud. The same dude was arrested for making a scam chalan app. koi iss sub walo ko aake bolenga aapki mummy kisi ke sath bhaag gayi ye log tab bhi bolenge PR hai, jumla hai, mOdI sHoUlD rEsIgN Exactly. For me the single biggest red flag is how they practically beg you to use Digi Yatra, and the lengths they go to to make the process easier for Digi Yatra users - multiple lanes at the entrance, multiple lanes at Security. I refuse to believe that a sarkari agency would do this purely out of the goodness of their hearts, given how in our country sarkari agencies usually take immense pleasure in making lives as miserable as possible for citizens. They are clearly saying they don’t save data centrally. It is distributed among many data centers. Haan Haan, samajh gaye. Centrally located nahi hai. Hamara data Bahut jagah rakha hua hai. I think you might be confusing Digiyatra with Digilocker. And still, likes of mallyas and modis will flee! What is DigiYatra ? I try to avoid accepting cookies for privacy and geolocation reasons. You have no idea how many people in the Dark Web currently have your phone number, email address, and even home address. Here's the thing, the cloud, SaaS and platform business models are inherently flawed. Whenever the user is the product, you can't have privacy. When you pay INR 200 for a service, using that productized service is costing you 6X what you pay. Such architecture based services can't be privacy conscious also because they are dependent on some degree of omni-channel promotional mechanics. Which as it turns out are also a foundation pillar of platform business models to function. Um, why is your stool in your hands??? silly doubt: what is the risk of using DigiYatra? What kind of data will they have access to if one uses it? And what can be done with that? (Not like our data isn’t already with the government- aadhaar pan etc) Please educate me on this. Thank you! Bro what did you expect by not posting mudiji criticism post? Dare not post anything other than vishwaguru criticism here else it will be reported /s Digiyatra is the company that had to reissue its own app as it lost the app and the data earlier. Who knows where that data is now. No wonder you get spam and scam calls now. Nope, not using it. Raita jaise phaila hua hai. LOL We don't have any privacy laws, it's exhausting how backwards we are with our data freedom and privacy. And the govt doesn't care because it ultimately benefits them. I'm so sick and tired of these shenanigans that these companies are able to pull off. I'm so sick of having to share my personal cell number for every little damn thing. I hope this bullshit comes to an end. data will be shared even for some other purposes, check twitter New update: The government may authorise the Income Tax department to look at DY data and identify frequent flyers and then make their assertions. This is getting too out of hand - this entire wrapped thing now sure seems more like a gimmick New update: The government may authorise the Income Tax department to look at DY data and identify frequent flyers and then make their assertions. This is getting too out of hand - this entire wrapped thing now sure seems more like a gimmick New update: The government may authorise the Income Tax department to look at DY data and identify frequent flyers and then make their assertions. This is getting too out of hand - this entire wrapped thing now sure seems more like a gimmick."
}