{
    "id": "1aqgyp7",
    "title": "Dog assaulted @vetic pet clinic thane Mumbai",
    "url": "https://www.reddit.com/gallery/1aqgyp7",
    "selftext": "Guys you may have seen this video gone viral on internet. This video is of 2 pet groomers assaulting a dog to look cool. @thetatva has shared their video on Instagram. Bhai log mumbai ki janta se appeal hai ki ye dono jahan bhi dikhe please chalte fir tere inpe repat/chaante/laat/ghuse/danda/thapki jo mile ek br jarur maare. \n1st image is of that video\n2nd image is of culprits\n3rd image is one of the main accuse.(account has been  deactivated now)",
    "flair": "Crime",
    "score": 94,
    "num_comments": 25,
    "created_utc": 1707894421.0,
    "convurl": "https://i.redd.it/vxfur9dy2iic1.jpg",
    "comments": [
        "Give them the same treatment.\n\nTie them up and put them inside a closed room with some dogs.\nPossibly with Pitbulls ,rotties, Belgian malinois",
        "His profile says Animal lovers. Irony died a 1000 times here.",
        "confused 'f' with 'c' in the word",
        "Things people do for goddamn clout",
        "He was arrested yesterday.",
        "Maybe he was offered a bag of rice for this assault, well who knows",
        "Irony is he has written dog lover on his insta bio",
        "Dog lover or dog abuser, psycopath. People should beat him to that extend ki next time kisi ko pareshn krne sey phele 100 bar soche.",
        "Both of them were arrested yesterday fortunately ",
        "What can be done to these people? Current law isn’t good enough for them",
        "Bring rot is too deep, only an asteroid can save us.",
        "And they would be released probably with a fine of ₹50 and a warning. That’s how poor the laws are in India for animal cruelty.",
        "Animal abuse deserves severe penalties.",
        "Shooting range should be an option for a punishment.",
        "What is this bag of rice? I hear this in every Indian sub but don't know what exactly it means",
        "Sybar bulling",
        "Why do these people exist ? How are they made ? Like how can you be so hateful to assault a harmless dog who has done nothing wrong ?",
        "It's used to mock people who convert from Hinduism to Christianity. They assume it's over a bag of rice. Simultaneously equating their religion's worth to a bag of rice.",
        "Oh thanks for the explanation bro",
        "Please someone beat the fuck out of these guys !!!!!",
        "That's like a pedophile saying they love teaching kids.",
        "Batao Thane walo ek group bana Kai ise pelne chale kya"
    ],
    "cleaned_text": "dog assaulted vetic pet clinic thane mumbai guys may seen video gone viral internet video pet groomers assaulting dog look cool thetatva shared video instagram bhai log mumbai ki janta se appeal hai ki ye dono jahan bhi dikhe please chalte fir tere inpe repatchaantelaatghusedandathapki jo mile ek br jarur maare st image video nd image culprits rd image one main accuseaccount deactivated ",
    "cleaned_title": "dog assaulted vetic pet clinic thane mumbai",
    "cleaned_selftext": "guys may seen video gone viral internet video pet groomers assaulting dog look cool thetatva shared video instagram bhai log mumbai ki janta se appeal hai ki ye dono jahan bhi dikhe please chalte fir tere inpe repatchaantelaatghusedandathapki jo mile ek br jarur maare st image video nd image culprits rd image one main accuseaccount deactivated",
    "cleaned_comments": "give treatment tie put inside closed room dogs possibly pitbulls rotties belgian malinois profile says animal lovers irony died times confused f c word things people goddamn clout arrested yesterday maybe offered bag rice assault well knows irony written dog lover insta bio dog lover dog abuser psycopath people beat extend ki next time kisi ko pareshn krne sey phele bar soche arrested yesterday fortunately done people current law isnt good enough bring rot deep asteroid save us would released probably fine warning thats poor laws india animal cruelty animal abuse deserves severe penalties shooting range option punishment bag rice hear every indian sub dont know exactly means sybar bulling people exist made like hateful assault harmless dog done nothing wrong used mock people convert hinduism christianity assume bag rice simultaneously equating religions worth bag rice oh thanks explanation bro please someone beat fuck guys thats like pedophile saying love teaching kids batao thane walo ek group bana kai ise pelne chale kya",
    "light_cleaned_title": "Dog assaulted @vetic pet clinic thane Mumbai",
    "light_cleaned_selftext": "Guys you may have seen this video gone viral on internet. This video is of 2 pet groomers assaulting a dog to look cool. @thetatva has shared their video on Instagram. Bhai log mumbai ki janta se appeal hai ki ye dono jahan bhi dikhe please chalte fir tere inpe repat/chaante/laat/ghuse/danda/thapki jo mile ek br jarur maare. 1st image is of that video 2nd image is of culprits 3rd image is one of the main accuse.(account has been deactivated now)",
    "light_cleaned_comments": "Give them the same treatment. Tie them up and put them inside a closed room with some dogs. Possibly with Pitbulls ,rotties, Belgian malinois His profile says Animal lovers. Irony died a 1000 times here. confused 'f' with 'c' in the word Things people do for goddamn clout He was arrested yesterday. Maybe he was offered a bag of rice for this assault, well who knows Irony is he has written dog lover on his insta bio Dog lover or dog abuser, psycopath. People should beat him to that extend ki next time kisi ko pareshn krne sey phele 100 bar soche. Both of them were arrested yesterday fortunately What can be done to these people? Current law isn’t good enough for them Bring rot is too deep, only an asteroid can save us. And they would be released probably with a fine of ₹50 and a warning. That’s how poor the laws are in India for animal cruelty. Animal abuse deserves severe penalties. Shooting range should be an option for a punishment. What is this bag of rice? I hear this in every Indian sub but don't know what exactly it means Sybar bulling Why do these people exist ? How are they made ? Like how can you be so hateful to assault a harmless dog who has done nothing wrong ? It's used to mock people who convert from Hinduism to Christianity. They assume it's over a bag of rice. Simultaneously equating their religion's worth to a bag of rice. Oh thanks for the explanation bro Please someone beat the fuck out of these guys !!!!! That's like a pedophile saying they love teaching kids. Batao Thane walo ek group bana Kai ise pelne chale kya"
}