{
    "id": "1gdcpeo",
    "title": " Support My Petition to Legalize ADHD Treatments in India! ",
    "url": "https://www.reddit.com/r/india/comments/1gdcpeo/support_my_petition_to_legalize_adhd_treatments/",
    "selftext": "I’m reaching out to share an important petition aimed at legalizing amphetamines for medical use, particularly for those of us living with ADHD in India. Many people struggle with traditional medications that don't provide adequate relief, and amphetamines have been proven effective in managing symptoms.\n\n**Why This Matters:**\n\n* **Personal Struggles:** Many of us are facing daily challenges due to ineffective treatments. It's time we have access to medications that can truly help us improve our quality of life.\n* **Global Precedent:** Countries like the US and Canada have recognized the benefits of amphetamines for ADHD and established regulated frameworks for their use. India can follow suit!\n* **Economic and Social Benefits:** Legalization can lead to better regulations, reduce illegal drug trafficking, and empower patients with more treatment options.\n\nI encourage you to read and support the petition. Every signature counts, and together, we can advocate for better treatment options for those suffering from ADHD.\n\n>[https://chng.it/H58d86W5YZ](https://chng.it/H58d86W5YZ)",
    "flair": "Law & Courts",
    "score": 7,
    "num_comments": 8,
    "created_utc": 1730040720.0,
    "convurl": "https://external-preview.redd.it/YkBw9o1zPtkt6Yz2fbDBmJPOYZXts9mnxtaln8DE3uk.jpg?auto=webp&s=fb66cc9c22bafa0fc8a9f723a0411a207d9d0ba7",
    "comments": [
        "!remindme in four days.",
        "I will be messaging you in 4 days on [**2024-10-31 15:05:14 UTC**](http://www.wolframalpha.com/input/?i=2024-10-31%2015:05:14%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1gdcpeo/support_my_petition_to_legalize_adhd_treatments/lu0n283/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1gdcpeo%2Fsupport_my_petition_to_legalize_adhd_treatments%2Flu0n283%2F%5D%0A%0ARemindMe%21%202024-10-31%2015%3A05%3A14%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201gdcpeo)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        "Seriously man this government is bonkers",
        "Signed it",
        "Much needed . Please sign as much",
        "Signed and shared, I suffer from OCD and ADHD myself, its just that other the depression there is no awareness against these. People look at me like I spoke some alien words when I say the terms."
    ],
    "cleaned_text": "support petition legalize adhd treatments india im reaching share important petition aimed legalizing amphetamines medical use particularly us living adhd india many people struggle traditional medications dont provide adequate relief amphetamines proven effective managing symptoms matters personal struggles many us facing daily challenges due ineffective treatments time access medications truly help us improve quality life global precedent countries like us canada recognized benefits amphetamines adhd established regulated frameworks use india follow suit economic social benefits legalization lead better regulations reduce illegal drug trafficking empower patients treatment options encourage read support petition every signature counts together advocate better treatment options suffering adhd httpschngithdwyzhttpschngithdwyz ",
    "cleaned_title": "support petition legalize adhd treatments india",
    "cleaned_selftext": "im reaching share important petition aimed legalizing amphetamines medical use particularly us living adhd india many people struggle traditional medications dont provide adequate relief amphetamines proven effective managing symptoms matters personal struggles many us facing daily challenges due ineffective treatments time access medications truly help us improve quality life global precedent countries like us canada recognized benefits amphetamines adhd established regulated frameworks use india follow suit economic social benefits legalization lead better regulations reduce illegal drug trafficking empower patients treatment options encourage read support petition every signature counts together advocate better treatment options suffering adhd httpschngithdwyzhttpschngithdwyz",
    "cleaned_comments": "remindme four days messaging days utchttpwwwwolframalphacominputiutctolocaltime remind linkhttpswwwredditcomrindiacommentsgdcpeosupportmypetitiontolegalizeadhdtreatmentsluncontext click linkhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessagebhttpsaffwwwredditcomfrfindiafcommentsfgdcpeofsupportmypetitiontolegalizeadhdtreatmentsflunfdaaremindmeaautc send pm also reminded reduce spam parent commenter delete message hide othershttpswwwredditcommessagecomposetoremindmebotsubjectdeletecommentmessagedeletegdcpeo infohttpswwwredditcomrremindmebotcommentsebkoremindmebotinfovcustomhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessageblinkormessageinsidesquarebracketsdaaremindmetimeperiodhereyour remindershttpswwwredditcommessagecomposetoremindmebotsubjectlistofremindersmessagemyremindersfeedbackhttpswwwredditcommessagecomposetowatchfulsubjectremindmebotfeedback seriously man government bonkers signed much needed please sign much signed shared suffer ocd adhd depression awareness people look like spoke alien words say terms",
    "light_cleaned_title": "Support My Petition to Legalize ADHD Treatments in India!",
    "light_cleaned_selftext": "I’m reaching out to share an important petition aimed at legalizing amphetamines for medical use, particularly for those of us living with ADHD in India. Many people struggle with traditional medications that don't provide adequate relief, and amphetamines have been proven effective in managing symptoms. **Why This Matters:** * **Personal Struggles:** Many of us are facing daily challenges due to ineffective treatments. It's time we have access to medications that can truly help us improve our quality of life. * **Global Precedent:** Countries like the US and Canada have recognized the benefits of amphetamines for ADHD and established regulated frameworks for their use. India can follow suit! * **Economic and Social Benefits:** Legalization can lead to better regulations, reduce illegal drug trafficking, and empower patients with more treatment options. I encourage you to read and support the petition. Every signature counts, and together, we can advocate for better treatment options for those suffering from ADHD. >[https://chng.it/H58d86W5YZ](https://chng.it/H58d86W5YZ)",
    "light_cleaned_comments": "!remindme in four days. I will be messaging you in 4 days on [**2024-10-31 15:05:14 UTC**](http://www.wolframalpha.com/input/?i=2024-10-31%2015:05:14%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1gdcpeo/support_my_petition_to_legalize_adhd_treatments/lu0n283/?context=3) [**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1gdcpeo%2Fsupport_my_petition_to_legalize_adhd_treatments%2Flu0n283%2F%5D%0A%0ARemindMe%21%202024-10-31%2015%3A05%3A14%20UTC) to send a PM to also be reminded and to reduce spam. ^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201gdcpeo) ***** |[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)| |-|-|-|-| Seriously man this government is bonkers Signed it Much needed . Please sign as much Signed and shared, I suffer from OCD and ADHD myself, its just that other the depression there is no awareness against these. People look at me like I spoke some alien words when I say the terms."
}