{
    "id": "15ipx47",
    "title": "Older IIMs kept in dark, Govt gets say in their affairs via the new",
    "url": "https://indianexpress.com/article/education/older-iims-kept-in-dark-govt-gets-say-in-their-affairs-via-the-new-8877281/",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Findianexpress.com%2Farticle%2Feducation%2Folder-iims-kept-in-dark-govt-gets-say-in-their-affairs-via-the-new-8877281%2F",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691223534.0,
    "convurl": "https://external-preview.redd.it/z-KSuthRAnyakK46vQGVqhznOTNelqmLXLMWcrIQVv4.jpg?auto=webp&s=f42c0d88ec963798a49f5b8164e244a1a8174fba",
    "comments": [
        ">The Indian Express has learnt that assent for the amendments — these include making the President a Visitor to the institutes, with the power to appoint the Chairperson of the Board of Governors — was taken on September 14 last year at a meeting attended by Directors of the newer IIMs. Directors of the older IIMs in Ahmedabad, Bangalore, Calcutta, Indore, Lucknow and Kozhikode were not invited to the huddle.\n\n>The Directors of two older IIMs told The Indian Express that they were not consulted before the amendments were laid out."
    ],
    "cleaned_text": "older iims kept dark govt gets say affairs via new  ",
    "cleaned_title": "older iims kept dark govt gets say affairs via new",
    "cleaned_selftext": "",
    "cleaned_comments": "indian express learnt assent amendments include making president visitor institutes power appoint chairperson board governors taken september last year meeting attended directors newer iims directors older iims ahmedabad bangalore calcutta indore lucknow kozhikode invited huddle directors two older iims told indian express consulted amendments laid",
    "light_cleaned_title": "Older IIMs kept in dark, Govt gets say in their affairs via the new",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">The Indian Express has learnt that assent for the amendments — these include making the President a Visitor to the institutes, with the power to appoint the Chairperson of the Board of Governors — was taken on September 14 last year at a meeting attended by Directors of the newer IIMs. Directors of the older IIMs in Ahmedabad, Bangalore, Calcutta, Indore, Lucknow and Kozhikode were not invited to the huddle. >The Directors of two older IIMs told The Indian Express that they were not consulted before the amendments were laid out."
}