{
    "id": "15vhwjm",
    "title": "What to do when after getting scammed?",
    "url": "https://www.reddit.com/r/india/comments/15vhwjm/what_to_do_when_after_getting_scammed/",
    "selftext": "Someone I know got scammed from a telegram group. He wasted >20 lacs by transferring to several bank accounts.\n\nThis scam is similar to https://www.indiatoday.in/technology/news/story/man-joins-telegram-group-to-start-part-time-job-but-ends-up-losing-rs-31-lakh-from-bank-account-2410920-2023-07-24\n\nI asked him to do and FIR or report online on cyber crime, but he is afraid his parents might get to know. Is there any way to get back the money? Or it's a lost cause?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692455735.0,
    "convurl": "https://external-preview.redd.it/s9WKyJBTol6kP3KSARmEQuw4EcMdjXppzR8Dc9o1oAM.jpg?auto=webp&s=80bd1bfedf54513e4b39da40b71eab4f9d05e89b",
    "comments": [
        "Police only .. recent case was published in newspaper where similar happened and they were able to catch the perpetrators, not all. \n\nDespite them transferring money to multiple bank accounts in and around China, Europe and others, decent/some money was able to be recovered.\n\nCheck Google about article .. simply put , FIR !",
        "regret regret regret",
        "Idiots",
        "I once got a WhatsApp msg from such a scammer. First thing I did was Google \"YouTube video like scam\". Then I saw an article where a guy was duped 24 lakh. I took screenshot of the conversation and emailed it to the police."
    ],
    "cleaned_text": "getting scammed someone know got scammed telegram group wasted lacs transferring several bank accounts scam similar asked fir report online cyber crime afraid parents might get know way get back money lost cause ",
    "cleaned_title": "getting scammed",
    "cleaned_selftext": "someone know got scammed telegram group wasted lacs transferring several bank accounts scam similar asked fir report online cyber crime afraid parents might get know way get back money lost cause",
    "cleaned_comments": "police recent case published newspaper similar happened able catch perpetrators despite transferring money multiple bank accounts around china europe others decentsome money able recovered check google article simply put fir regret regret regret idiots got whatsapp msg scammer first thing google youtube video like scam saw article guy duped lakh took screenshot conversation emailed police",
    "light_cleaned_title": "What to do when after getting scammed?",
    "light_cleaned_selftext": "Someone I know got scammed from a telegram group. He wasted >20 lacs by transferring to several bank accounts. This scam is similar to I asked him to do and FIR or report online on cyber crime, but he is afraid his parents might get to know. Is there any way to get back the money? Or it's a lost cause?",
    "light_cleaned_comments": "Police only .. recent case was published in newspaper where similar happened and they were able to catch the perpetrators, not all. Despite them transferring money to multiple bank accounts in and around China, Europe and others, decent/some money was able to be recovered. Check Google about article .. simply put , FIR ! regret regret regret Idiots I once got a WhatsApp msg from such a scammer. First thing I did was Google \"YouTube video like scam\". Then I saw an article where a guy was duped 24 lakh. I took screenshot of the conversation and emailed it to the police."
}