{
    "id": "1dd926d",
    "title": "Urgent: Stop Illegal Demolition of My House",
    "url": "https://www.reddit.com/r/india/comments/1dd926d/urgent_stop_illegal_demolition_of_my_house/",
    "selftext": "TL;DR: A corrupt builder, with political backing, is illegally demolishing homes in Mumbai Sai Nagar Bhandup. Despite ongoing legal battles and activist support, the demolition continues. We need media attention and public support to stop this injustice.\n\nOur homes in Sai Nagar Bhandup (Mumbai) are under threat due to an illegal and politically influenced demolition. A corrupt builder, Atul Shirodkar, supported by MLA Sunil Raut, has initiated this demolition despite not having clear land titles or fulfilling agreements with original owners. Government agencies like SRA and the police are allegedly ignoring the issue due to political pressure. Prominent activist Anjali Damania is fighting against this injustice, but we need more support to stop the demolition and protect our community.\n\n* The builder lacks clear titles and agreements are unfulfilled.\n* Partial demolitions are creating unsafe conditions.\n* Government agencies and the police are allegedly compromised.\n* Anjali Damania is advocating for us, but we need broader support.\n\nI am feeling really helpless.\n\nIf possible, Please share this story, involve media, and reach out to prominent figures who can help stop this unlawful demolition. Our homes and community depend on it.\n\nRecent tweets by Anjali Damania with Proof of demolition and forceful eviction.\n\n[https://x.com/anjali\\_damania/status/1800221679123337612](https://x.com/anjali_damania/status/1800221679123337612)",
    "flair": "Crime",
    "score": 378,
    "num_comments": 31,
    "created_utc": 1718094116,
    "convurl": "https://external-preview.redd.it/ii5UA4yRaYDPIggMlIza-dUsgeP2-wiy3XigwndvPrk.jpg?auto=webp&s=afc653ee66a218dde28ae37cc6a29e062d096f8d",
    "comments": [
        "https://preview.redd.it/9q8y8phbow5d1.jpeg?width=1600&format=pjpg&auto=webp&s=e7b40957c5e38be05976bed6384369df4c406476\n\n\n\nDemolition Site\n\nHow can people live in such rubble ? In Monsoon it will create hell, water logging, electric wires",
        "What can public do? Approach the court and get a stay order.",
        "Yes right but the time is of crucial importance.\n\nComplain is already pending in AGRC (SRA Court) but officials there are compromised due to money and political pressure.\n\nAGRC order can be challenged in High Court but that will take months.\n\nMeanwhile they will keep on demolishing as many houses as they can so that others will start evacuating due to unlivable surrounding.",
        "Crosspost to legaladviceindia",
        "Cfbr",
        "done, thanks",
        "This is going to be a long battle OP. Hope you get things your way.",
        ":(",
        "None of us here have money to fight expensive legal battle against ultra rich builder.\n\nThough, we will try to fight till end to what our resources permit.",
        "AFAIK Sai Nagar Bhandup is a slum. Are you sure you are the owner of the land?   \nConsidering that the builder is clearing the land without obtaining proper possession of it, what makes your claim to the land any more legitimate than that of the builder? Both of you seem to be illegally occupying land.",
        "Sorry you are going through this, does the builder provide any compensation or new house or paying for the land?",
        "No compensation for house owners. It is daylight robbery.\n\nOriginal land owner is cheated too.",
        "So builder has all proper legal documents and ownership? Do you have any proof of him cheating? This seems way one sided story",
        "Sai nagar is not slum per say, builder is projecting it as a slum. (There could be some encroachments but the majority has ownership)\n\nThere was a private land lord of the property who has made agreement with builder to sell the land in 2007. People living there have purchased the property from original owner and been living there since 35-40 years.\n\nBuilder did not pay the land owner the agreed sum of money and effectively bought plot of 18000 sq mt, by paying a meagre 89 lakhs. House owners are kept in dark and did not get any compensation despite being owner. They were never made a party in the agreement. \n\nOriginal owner passed away in 2017 and his family is now going to High Court as well against the builder for not paying agreed sum of money (2 Cr in 2007).\n\nThe reason builder is highlighting this property as slum because he can bypass paying owners and can give very small area in newly built structure (~280 Sqft).\n\nBuilder is exploiting poor people who are not educated and united. In fact some people have corroborated with builder in return of material favours. (Money, Extra Flat etc)",
        "Now this gets complicated. Technically you may have never had possession and it may have been a verbal contract with money exchanged with the original owner and it was never registered with the transfer of the ownership deed.\n\nIf you guys have the land ownership deed, the court should listen to you. If not, its very bad luck where you got duped by the original owner.",
        "Legal notice from owner's family (1)\n\nhttps://preview.redd.it/lvqdr3fdvx5d1.jpeg?width=719&format=pjpg&auto=webp&s=e2cbe2dc01b6c320cd8683ff1aeeabe91bd2e7d8",
        "Legal notice from owner's family (2)\n\nhttps://preview.redd.it/tyuv28dkvx5d1.jpeg?width=720&format=pjpg&auto=webp&s=4c016c92278d2c1fa9d7fec25093fb1bf3b222aa",
        "Legal notice from owner's family (2)\n\nhttps://preview.redd.it/41mpcnjmvx5d1.jpeg?width=720&format=pjpg&auto=webp&s=4177fe030b3257d5d437c6c2ba93de3ecf723f8b",
        "Nope, there's registered agreement and ownership deed along with index 2.\n\nCity civil court has already ruled that builder do not have complete ownership of the land.",
        "Builder is not compliant when it comes to ownership and document, rather he has very shaddy past.\n\nFrom the above tweet\n\n>Atul Shirodkar from Nagpur, who has not only looted innocent home buyers in First City project, but is now trying to usurp a plot of 18000 sq mt, by paying a meagre 89 lakh ? Do we even get a 2 BHK in Bhandup for 89 lakh? The plot belongs to innocent middle class people.  They are NOT ENCHROACHERS or TENANTS, but are OWNERS. \n\n>In his office at Mihan, Atul Shirodkar was accused of stealing electricity from MSEDCL. Now with the help of MLA Sunil Raut, he is spreading panic, terrorising and illegally demolishing chawl at Sainagar Chawl Bhandup. How do people fight? No police help, no help from SRA, all are working only under political pressure.\n\nSources :\n\nhttps://timesofindia.indiatimes.com/city/nagpur/power-theft-detected-at-reatox-builders-in-mihan/articleshow/14279823.cms\n\nhttps://www.nagpurtoday.in/promoters-of-first-city-booked-for-cheating/01060911\n\nhttps://www.nagpurtoday.in/first-city-mihan-why-the-haste-to-come-to-the-builders-rescue-mr-c-m-and-mr-gadkari/02092105",
        "That's what happens, when people are voting for corrupt parties like Shivsena.\n\nHopefully OP can get stay order asap",
        "This is what is the alternative to BJP. These Shiv Shena fucks are like this only. That's how they came up in the 80s too.",
        "Seedha writ petition in High Court",
        "Bump. Hope you get the media attention for this.",
        "Unless you are able to afford influential lawyers who can get immediate hearings you don’t have any chance of immediate justice",
        "Not a legal advise:\nThese are the options you have.\nFile a petition in High Court against demolition. \nFile a private complaint report to District Judge for inaction by Police of not filing FIR against the builders. Battle is going to be long, but it has to be done. Consult a  lawyer.",
        "Please approach the High Court ASAP.",
        "Comedy gold, right here.\n\n\n\n\nI saw another post regarding the demolition of a property related to the Pune teens family and people on this sub were getting wet over that demolition.\n\n\n\n\nA few minutes later I find this post and people are sympathizing with the OP.\n\n\n\n\nGuys please don't be hypocrites, bulldozer justice is no justice. We need systemic fixes to how the building codes are enforced and for this to happen in a clear and transparent manner. Absent this we can keep playing stupid games and winning stupid prizes.",
        "You are completely misunderstanding the situation.\n\nWe are legitimate owners who have been sacrificed on pretext of SRA development.",
        "Was your house constructed after getting proper authorization from the Municipal Corporation? If not, you're shit out of luck.",
        "Do you have an update???"
    ],
    "cleaned_text": "urgent stop illegal demolition house tldr corrupt builder political backing illegally demolishing homes mumbai sai nagar bhandup despite ongoing legal battles activist support demolition continues need media attention public support stop injustice homes sai nagar bhandup mumbai threat due illegal politically influenced demolition corrupt builder atul shirodkar supported mla sunil raut initiated demolition despite clear land titles fulfilling agreements original owners government agencies like sra police allegedly ignoring issue due political pressure prominent activist anjali damania fighting injustice need support stop demolition protect community builder lacks clear titles agreements unfulfilled partial demolitions creating unsafe conditions government agencies police allegedly compromised anjali damania advocating us need broader support feeling really helpless possible please share story involve media reach prominent figures help stop unlawful demolition homes community depend recent tweets anjali damania proof demolition forceful eviction httpsxcomanjalidamaniastatushttpsxcomanjalidamaniastatus ",
    "cleaned_title": "urgent stop illegal demolition house",
    "cleaned_selftext": "tldr corrupt builder political backing illegally demolishing homes mumbai sai nagar bhandup despite ongoing legal battles activist support demolition continues need media attention public support stop injustice homes sai nagar bhandup mumbai threat due illegal politically influenced demolition corrupt builder atul shirodkar supported mla sunil raut initiated demolition despite clear land titles fulfilling agreements original owners government agencies like sra police allegedly ignoring issue due political pressure prominent activist anjali damania fighting injustice need support stop demolition protect community builder lacks clear titles agreements unfulfilled partial demolitions creating unsafe conditions government agencies police allegedly compromised anjali damania advocating us need broader support feeling really helpless possible please share story involve media reach prominent figures help stop unlawful demolition homes community depend recent tweets anjali damania proof demolition forceful eviction httpsxcomanjalidamaniastatushttpsxcomanjalidamaniastatus",
    "cleaned_comments": "demolition site people live rubble monsoon create hell water logging electric wires public approach court get stay order yes right time crucial importance complain already pending agrc sra court officials compromised due money political pressure agrc order challenged high court take months meanwhile keep demolishing many houses others start evacuating due unlivable surrounding crosspost legaladviceindia cfbr done thanks going long battle op hope get things way none us money fight expensive legal battle ultra rich builder though try fight till end resources permit afaik sai nagar bhandup slum sure owner land considering builder clearing land without obtaining proper possession makes claim land legitimate builder seem illegally occupying land sorry going builder provide compensation new house paying land compensation house owners daylight robbery original land owner cheated builder proper legal documents ownership proof cheating seems way one sided story sai nagar slum per say builder projecting slum could encroachments majority ownership private land lord property made agreement builder sell land people living purchased property original owner living since years builder pay land owner agreed sum money effectively bought plot sq mt paying meagre lakhs house owners kept dark get compensation despite owner never made party agreement original owner passed away family going high court well builder paying agreed sum money cr reason builder highlighting property slum bypass paying owners give small area newly built structure sqft builder exploiting poor people educated united fact people corroborated builder return material favours money extra flat etc gets complicated technically may never possession may verbal contract money exchanged original owner never registered transfer ownership deed guys land ownership deed court listen bad luck got duped original owner legal notice owners family legal notice owners family legal notice owners family nope theres registered agreement ownership deed along index city civil court already ruled builder complete ownership land builder compliant comes ownership document rather shaddy past tweet atul shirodkar nagpur looted innocent home buyers first city project trying usurp plot sq mt paying meagre lakh even get bhk bhandup lakh plot belongs innocent middle class people enchroachers tenants owners office mihan atul shirodkar accused stealing electricity msedcl help mla sunil raut spreading panic terrorising illegally demolishing chawl sainagar chawl bhandup people fight police help help sra working political pressure sources thats happens people voting corrupt parties like shivsena hopefully op get stay order asap alternative bjp shiv shena fucks like thats came seedha writ petition high court bump hope get media attention unless able afford influential lawyers get immediate hearings dont chance immediate justice legal advise options file petition high court demolition file private complaint report district judge inaction police filing fir builders battle going long done consult lawyer please approach high court asap comedy gold right saw another post regarding demolition property related pune teens family people sub getting wet demolition minutes later find post people sympathizing op guys please dont hypocrites bulldozer justice justice need systemic fixes building codes enforced happen clear transparent manner absent keep playing stupid games winning stupid prizes completely misunderstanding situation legitimate owners sacrificed pretext sra development house constructed getting proper authorization municipal corporation youre shit luck update",
    "light_cleaned_title": "Urgent: Stop Illegal Demolition of My House",
    "light_cleaned_selftext": "TL;DR: A corrupt builder, with political backing, is illegally demolishing homes in Mumbai Sai Nagar Bhandup. Despite ongoing legal battles and activist support, the demolition continues. We need media attention and public support to stop this injustice. Our homes in Sai Nagar Bhandup (Mumbai) are under threat due to an illegal and politically influenced demolition. A corrupt builder, Atul Shirodkar, supported by MLA Sunil Raut, has initiated this demolition despite not having clear land titles or fulfilling agreements with original owners. Government agencies like SRA and the police are allegedly ignoring the issue due to political pressure. Prominent activist Anjali Damania is fighting against this injustice, but we need more support to stop the demolition and protect our community. * The builder lacks clear titles and agreements are unfulfilled. * Partial demolitions are creating unsafe conditions. * Government agencies and the police are allegedly compromised. * Anjali Damania is advocating for us, but we need broader support. I am feeling really helpless. If possible, Please share this story, involve media, and reach out to prominent figures who can help stop this unlawful demolition. Our homes and community depend on it. Recent tweets by Anjali Damania with Proof of demolition and forceful eviction. [https://x.com/anjali\\_damania/status/1800221679123337612](https://x.com/anjali_damania/status/1800221679123337612)",
    "light_cleaned_comments": "Demolition Site How can people live in such rubble ? In Monsoon it will create hell, water logging, electric wires What can public do? Approach the court and get a stay order. Yes right but the time is of crucial importance. Complain is already pending in AGRC (SRA Court) but officials there are compromised due to money and political pressure. AGRC order can be challenged in High Court but that will take months. Meanwhile they will keep on demolishing as many houses as they can so that others will start evacuating due to unlivable surrounding. Crosspost to legaladviceindia Cfbr done, thanks This is going to be a long battle OP. Hope you get things your way. :( None of us here have money to fight expensive legal battle against ultra rich builder. Though, we will try to fight till end to what our resources permit. AFAIK Sai Nagar Bhandup is a slum. Are you sure you are the owner of the land? Considering that the builder is clearing the land without obtaining proper possession of it, what makes your claim to the land any more legitimate than that of the builder? Both of you seem to be illegally occupying land. Sorry you are going through this, does the builder provide any compensation or new house or paying for the land? No compensation for house owners. It is daylight robbery. Original land owner is cheated too. So builder has all proper legal documents and ownership? Do you have any proof of him cheating? This seems way one sided story Sai nagar is not slum per say, builder is projecting it as a slum. (There could be some encroachments but the majority has ownership) There was a private land lord of the property who has made agreement with builder to sell the land in 2007. People living there have purchased the property from original owner and been living there since 35-40 years. Builder did not pay the land owner the agreed sum of money and effectively bought plot of 18000 sq mt, by paying a meagre 89 lakhs. House owners are kept in dark and did not get any compensation despite being owner. They were never made a party in the agreement. Original owner passed away in 2017 and his family is now going to High Court as well against the builder for not paying agreed sum of money (2 Cr in 2007). The reason builder is highlighting this property as slum because he can bypass paying owners and can give very small area in newly built structure (~280 Sqft). Builder is exploiting poor people who are not educated and united. In fact some people have corroborated with builder in return of material favours. (Money, Extra Flat etc) Now this gets complicated. Technically you may have never had possession and it may have been a verbal contract with money exchanged with the original owner and it was never registered with the transfer of the ownership deed. If you guys have the land ownership deed, the court should listen to you. If not, its very bad luck where you got duped by the original owner. Legal notice from owner's family (1) Legal notice from owner's family (2) Legal notice from owner's family (2) Nope, there's registered agreement and ownership deed along with index 2. City civil court has already ruled that builder do not have complete ownership of the land. Builder is not compliant when it comes to ownership and document, rather he has very shaddy past. From the above tweet >Atul Shirodkar from Nagpur, who has not only looted innocent home buyers in First City project, but is now trying to usurp a plot of 18000 sq mt, by paying a meagre 89 lakh ? Do we even get a 2 BHK in Bhandup for 89 lakh? The plot belongs to innocent middle class people. They are NOT ENCHROACHERS or TENANTS, but are OWNERS. >In his office at Mihan, Atul Shirodkar was accused of stealing electricity from MSEDCL. Now with the help of MLA Sunil Raut, he is spreading panic, terrorising and illegally demolishing chawl at Sainagar Chawl Bhandup. How do people fight? No police help, no help from SRA, all are working only under political pressure. Sources : That's what happens, when people are voting for corrupt parties like Shivsena. Hopefully OP can get stay order asap This is what is the alternative to BJP. These Shiv Shena fucks are like this only. That's how they came up in the 80s too. Seedha writ petition in High Court Bump. Hope you get the media attention for this. Unless you are able to afford influential lawyers who can get immediate hearings you don’t have any chance of immediate justice Not a legal advise: These are the options you have. File a petition in High Court against demolition. File a private complaint report to District Judge for inaction by Police of not filing FIR against the builders. Battle is going to be long, but it has to be done. Consult a lawyer. Please approach the High Court ASAP. Comedy gold, right here. I saw another post regarding the demolition of a property related to the Pune teens family and people on this sub were getting wet over that demolition. A few minutes later I find this post and people are sympathizing with the OP. Guys please don't be hypocrites, bulldozer justice is no justice. We need systemic fixes to how the building codes are enforced and for this to happen in a clear and transparent manner. Absent this we can keep playing stupid games and winning stupid prizes. You are completely misunderstanding the situation. We are legitimate owners who have been sacrificed on pretext of SRA development. Was your house constructed after getting proper authorization from the Municipal Corporation? If not, you're shit out of luck. Do you have an update???"
}