{
    "id": "18ezxdg",
    "title": "13 year old house help Stripped, Beaten, Bitten By Dogs, Locked Up At Gurugram Home",
    "url": "https://www.ndtv.com/india-news/teen-help-stripped-beaten-bitten-by-dogs-locked-up-at-gurugram-home-4649868",
    "selftext": "All for 9000 rupees per month",
    "flair": "Crime",
    "score": 155,
    "num_comments": 21,
    "created_utc": 1702200715.0,
    "convurl": "https://external-preview.redd.it/yfEmvE6vJ63No5nA6hvlckTtb_oUO186lhyyynMzYM8.jpg?auto=webp&s=64b913a75dc6f2bf4cba072379044de170e52864",
    "comments": [
        "Isn't it crime?, I hope both family gets good time jail.",
        "Now even dogs?",
        "Wait 13 year old house help? How that is allowed?",
        "Everyone trying to outdo UP",
        "Kya madarchod log hai",
        "Yogi to demolish the house helps house in 3....2.....",
        "Some literal monsters live amongst us!!!",
        "Undiagnosed mental illness. This is just sick.",
        "You do know that some people do things that aren't 'allowed', don't you?",
        "Yeah unfortunately!",
        "Criminal offence",
        "Nope name is Sharma not going to happen",
        "Motherfuckers!!! Each and every adult members of that family should be put behind bars for life. Half of the assets seized/ auctioned to compensate the victim. Just make a mfkin example of them. This is slavery and definitely not a single and isolated instance.",
        "When will the bulldozer demolish the home will it be telecasted live want to see them suffer",
        "Why FIR against only the home owner and his 2 sons. What about the women of the house who beat the girl with rod and hammer.",
        "Is the victim a cow? If the answer is no, Yogiji don't care.",
        "I mean Shashi Sharma is the women of the house/ home owner from the writing"
    ],
    "cleaned_text": "year old house help stripped beaten bitten dogs locked gurugram home rupees per month ",
    "cleaned_title": "year old house help stripped beaten bitten dogs locked gurugram home",
    "cleaned_selftext": "rupees per month",
    "cleaned_comments": "isnt crime hope family gets good time jail even dogs wait year old house help allowed everyone trying outdo kya madarchod log hai yogi demolish house helps house literal monsters live amongst us undiagnosed mental illness sick know people things arent allowed dont yeah unfortunately criminal offence nope name sharma going happen motherfuckers every adult members family put behind bars life half assets seized auctioned compensate victim make mfkin example slavery definitely single isolated instance bulldozer demolish home telecasted live want see suffer fir home owner sons women house beat girl rod hammer victim cow answer yogiji dont care mean shashi sharma women house home owner writing",
    "light_cleaned_title": "13 year old house help Stripped, Beaten, Bitten By Dogs, Locked Up At Gurugram Home",
    "light_cleaned_selftext": "All for 9000 rupees per month",
    "light_cleaned_comments": "Isn't it crime?, I hope both family gets good time jail. Now even dogs? Wait 13 year old house help? How that is allowed? Everyone trying to outdo UP Kya madarchod log hai Yogi to demolish the house helps house in 3....2..... Some literal monsters live amongst us!!! Undiagnosed mental illness. This is just sick. You do know that some people do things that aren't 'allowed', don't you? Yeah unfortunately! Criminal offence Nope name is Sharma not going to happen Motherfuckers!!! Each and every adult members of that family should be put behind bars for life. Half of the assets seized/ auctioned to compensate the victim. Just make a mfkin example of them. This is slavery and definitely not a single and isolated instance. When will the bulldozer demolish the home will it be telecasted live want to see them suffer Why FIR against only the home owner and his 2 sons. What about the women of the house who beat the girl with rod and hammer. Is the victim a cow? If the answer is no, Yogiji don't care. I mean Shashi Sharma is the women of the house/ home owner from the writing"
}