{
    "id": "162i7ub",
    "title": "Is this true?",
    "url": "https://i.redd.it/rsnpo634flkb1.png",
    "selftext": "Is this true? And if it indeed is, how will this affect the world?",
    "flair": "Politics",
    "score": 82,
    "num_comments": 23,
    "created_utc": 1693115995.0,
    "convurl": "https://i.redd.it/rsnpo634flkb1.png",
    "comments": [
        "This will end up as another scam.\n\nThey are just paying what converts from INR to Saudi Riyal. The conversation fee they can always increase in the internal books, guess that's tough when paying with dollars.",
        "Its UAE not Saudi. UAE accepts Indian Rupee because it is a big trading partner of India. \n\nThey have mainly two uses for Indian Rupee. \n\n1) Agricultural goods \n\n2) Indian refinery",
        "It won't have much affect, INR is very tightly controlled and UAE(and other oil producing nations) will mostly take INR for amounts equal to what they can spend on buying Indian goods.\n\nIt saves both countries some foreign exchange fee(which can be significant when dealing with Billions) but with the way India has handled INR in the past no country is keeping significant reserves of same.",
        "Just wait and watch bitvh",
        "Demo has made nations like Bhutan and Nepal also dump rupees",
        "As far as I know the oil is priced in USD and payment is made in INR.",
        "Yeah, I mean why would anyone want to hold a currency that can be made useless on wishes of a single person.\n\nIt might have been fine if they actually helped the countries holding INR but instead they fucked up that also.\n\nAnd still haven't learnt the lesson, the 2K note recall is similarly stupid. Plenty of foreign exchanges are facing issues changing those notes.\n\nNo wonder INR is treated like shit even in countries with significant Indian tourists.",
        "Relax champ. No need for this abusive language.\n\nI work in oil trading business here in the UAE. Very recently ADNOC and other oil companies in UAE approached us saying they are ready to sell in Rupee because of government focus on importing food from India as well as sending Emirati crude to India to be refined. \n\nSince our trade with them is very deep, they have use for Indian rupee. Thats why they accept it. Its not replacing the dollar, nor is it a scam.",
        "I am not saying that it doesn't make sense. I am just saying that knowing how BJP operates, they will find out a way to make extra money out of this.",
        "Doesn’t mean anything. To be a reserve currency, you must completely open up your economy. India will never do that. USD is and will remain the reserve currency for the foreseeable future. This purchase is nothing on a global scale.",
        "If BJP wanted to siphon funds from IndianOil Corp. There are much easier way to do it rather than doing it from the spot trade books. \n\nI dont like BJP either but not everything is about them.",
        "People said same about Rafael",
        "Rafael is not the same buddy. \n\nDo I really have to explain the difference between a multi-national oil company that completes million dollar transactions on the daily vs.. \n\nBuying a one-time purchase of fighter jets + SLA agreements.",
        "Indian rupees are like hot potatoes, no one holds on to them. Fickle and temperamental policy making, volatility, etc mean that  UAE will use this to offset some immediate payments. They aren't going to store it.",
        "No country is going to want to hold INR after all the shitshows since 2018",
        "Rafale horse is dead and buried. Beating it countless times will not magically make it alive. Even RaGa has stopped mentioning Rafale",
        "Unlike Russia Dubai has some use for the rupee.\n\nAlot of our trade with one of our bigger trading partner , Pakistan is routed via Dubai so the importers in Dubai exporting to Pakistan can settle trade in rupee.\n\nDubai also needs the rupee as it's an important hub both for Indian trade and labour.\n\nBut based on my limited reading and trends they will probably use the rupee after putting what they can put to use will probably use it to purchase either USD or US treasury bills which will make the dollar stronger .\n\nSo all in all its a big nothing burger.",
        "US: looks like Saudi needs some democracy.",
        "it won't matter how India handles INR cause the money is in the banks you don't get hard money in such transactions   \nOnly thing that will impact it will exchange rate of inr",
        "for people saying it does not mean anything ?   \nget some idea of how it works and what problem it is solving \n\nIndia has no aim as of now to fight with the dollar directly and it can not even sustain such a fight. India is simply trying to save its foreign reserve and gather more investments from other nations by trading in rupees and not dollar. Most of the nation we are trading with we have a trade deficit which helps in bring more investment rather than investment going in other countries."
    ],
    "cleaned_text": "true true indeed affect world ",
    "cleaned_title": "true",
    "cleaned_selftext": "true indeed affect world",
    "cleaned_comments": "end another scam paying converts inr saudi riyal conversation fee always increase internal books guess thats tough paying dollars uae saudi uae accepts indian rupee big trading partner india mainly two uses indian rupee agricultural goods indian refinery wont much affect inr tightly controlled uaeand oil producing nations mostly take inr amounts equal spend buying indian goods saves countries foreign exchange feewhich significant dealing billions way india handled inr past country keeping significant reserves wait watch bitvh demo made nations like bhutan nepal also dump rupees far know oil priced usd payment made inr yeah mean would anyone want hold currency made useless wishes single person might fine actually helped countries holding inr instead fucked also still havent learnt lesson k note recall similarly stupid plenty foreign exchanges facing issues changing notes wonder inr treated like shit even countries significant indian tourists relax champ need abusive language work oil trading business uae recently adnoc oil companies uae approached us saying ready sell rupee government focus importing food india well sending emirati crude india refined since trade deep use indian rupee thats accept replacing dollar scam saying doesnt make sense saying knowing bjp operates find way make extra money doesnt mean anything reserve currency must completely open economy india never usd remain reserve currency foreseeable future purchase nothing global scale bjp wanted siphon funds indianoil corp much easier way rather spot trade books dont like bjp either everything people said rafael rafael buddy really explain difference multinational oil company completes million dollar transactions daily vs buying onetime purchase fighter jets sla agreements indian rupees like hot potatoes one holds fickle temperamental policy making volatility etc mean uae use offset immediate payments arent going store country going want hold inr shitshows since rafale horse dead buried beating countless times magically make alive even raga stopped mentioning rafale unlike russia dubai use rupee alot trade one bigger trading partner pakistan routed via dubai importers dubai exporting pakistan settle trade rupee dubai also needs rupee important hub indian trade labour based limited reading trends probably use rupee putting put use probably use purchase either usd us treasury bills make dollar stronger big nothing burger us looks like saudi needs democracy wont matter india handles inr cause money banks dont get hard money transactions thing impact exchange rate inr people saying mean anything get idea works problem solving india aim fight dollar directly even sustain fight india simply trying save foreign reserve gather investments nations trading rupees dollar nation trading trade deficit helps bring investment rather investment going countries",
    "light_cleaned_title": "Is this true?",
    "light_cleaned_selftext": "Is this true? And if it indeed is, how will this affect the world?",
    "light_cleaned_comments": "This will end up as another scam. They are just paying what converts from INR to Saudi Riyal. The conversation fee they can always increase in the internal books, guess that's tough when paying with dollars. Its UAE not Saudi. UAE accepts Indian Rupee because it is a big trading partner of India. They have mainly two uses for Indian Rupee. 1) Agricultural goods 2) Indian refinery It won't have much affect, INR is very tightly controlled and UAE(and other oil producing nations) will mostly take INR for amounts equal to what they can spend on buying Indian goods. It saves both countries some foreign exchange fee(which can be significant when dealing with Billions) but with the way India has handled INR in the past no country is keeping significant reserves of same. Just wait and watch bitvh Demo has made nations like Bhutan and Nepal also dump rupees As far as I know the oil is priced in USD and payment is made in INR. Yeah, I mean why would anyone want to hold a currency that can be made useless on wishes of a single person. It might have been fine if they actually helped the countries holding INR but instead they fucked up that also. And still haven't learnt the lesson, the 2K note recall is similarly stupid. Plenty of foreign exchanges are facing issues changing those notes. No wonder INR is treated like shit even in countries with significant Indian tourists. Relax champ. No need for this abusive language. I work in oil trading business here in the UAE. Very recently ADNOC and other oil companies in UAE approached us saying they are ready to sell in Rupee because of government focus on importing food from India as well as sending Emirati crude to India to be refined. Since our trade with them is very deep, they have use for Indian rupee. Thats why they accept it. Its not replacing the dollar, nor is it a scam. I am not saying that it doesn't make sense. I am just saying that knowing how BJP operates, they will find out a way to make extra money out of this. Doesn’t mean anything. To be a reserve currency, you must completely open up your economy. India will never do that. USD is and will remain the reserve currency for the foreseeable future. This purchase is nothing on a global scale. If BJP wanted to siphon funds from IndianOil Corp. There are much easier way to do it rather than doing it from the spot trade books. I dont like BJP either but not everything is about them. People said same about Rafael Rafael is not the same buddy. Do I really have to explain the difference between a multi-national oil company that completes million dollar transactions on the daily vs.. Buying a one-time purchase of fighter jets + SLA agreements. Indian rupees are like hot potatoes, no one holds on to them. Fickle and temperamental policy making, volatility, etc mean that UAE will use this to offset some immediate payments. They aren't going to store it. No country is going to want to hold INR after all the shitshows since 2018 Rafale horse is dead and buried. Beating it countless times will not magically make it alive. Even RaGa has stopped mentioning Rafale Unlike Russia Dubai has some use for the rupee. Alot of our trade with one of our bigger trading partner , Pakistan is routed via Dubai so the importers in Dubai exporting to Pakistan can settle trade in rupee. Dubai also needs the rupee as it's an important hub both for Indian trade and labour. But based on my limited reading and trends they will probably use the rupee after putting what they can put to use will probably use it to purchase either USD or US treasury bills which will make the dollar stronger . So all in all its a big nothing burger. US: looks like Saudi needs some democracy. it won't matter how India handles INR cause the money is in the banks you don't get hard money in such transactions Only thing that will impact it will exchange rate of inr for people saying it does not mean anything ? get some idea of how it works and what problem it is solving India has no aim as of now to fight with the dollar directly and it can not even sustain such a fight. India is simply trying to save its foreign reserve and gather more investments from other nations by trading in rupees and not dollar. Most of the nation we are trading with we have a trade deficit which helps in bring more investment rather than investment going in other countries."
}