{
    "id": "1fgfqov",
    "title": "Harry Potter and the Lenskart Trap.",
    "url": "https://www.reddit.com/r/india/comments/1fgfqov/harry_potter_and_the_lenskart_trap/",
    "selftext": "Finally getting the time to post this. This is about my experience with Lenskart's absolutely horrible customer support. This is going to be a long one.\n\nTL;DR: Always return. Never Exchange from Lenskart.  \n  \nOn 5th Aug, I ordered two frames from the Harry Potter Collection from Lenskart Studio ([here](https://www.lenskart.com/eyeglasses/collections/harry-potter-collection.html?pageCount=1)). I was really looking forward to these frames and their accessories. They were quite pricey but I wanted to buy something for myself. My salary got credited and I ordered them straightaway from their app.  \n  \nA few days later they get delivered. Excited, I unboxed them and to my surprise only one of them came with the advertised case and cloth. The other was delivered with their standard soft case and cloth, with the lenses not having the correct power as I had put in.   \n  \nThe one that did have the correct case and cloth, had another issue. It had a loose left hinge. Not the left hinge itself but where it connects to the front face of the frame. It didn't feel solid or durable and wiggled a lottt!.\n\nI decided to keep the correct frame, it looked good and had the right accessories but still request a new one for it was defected. Here's the mistake I did, I exchanged the one I wanted to keep and returned the other one.  \n  \nPro tip:  NEVER EVER EXCHANGE ON LENSKART. ALWAYS RETURN. Below is why.\n\nFew days later I get the exchanged frame, but to my absolute surprise, it was the exact same frame. It had the same wiggle issue. Even the box it came in was the exact same. What I also found out is you cannot return an exchanged frame. You can only exchange it again, and you cannot even exchange after the 2nd time.\n\nI was going to travel to Gurgaon after few days, so I decided to go to the store this time. I went to a Lenskart store, told them what had happened, they said only an exchange is possible so I had to place an exchange again. And specifically told them I want the exact same accessories that came with it.  \n\nGuess what happened. I got called to the store, they showed me the frame and it had the same issue. Not only that, they even sent back the accessories that came with it. So I was down a frame and the custom accessories. I literally lost my money on them. The store manager said they'll look into it personally, told me  they will mark it as 'Handover'. They said they'll either get a new one or get this one repaired. I can't even connect to their customer service, their app chat support is downright awful and doesn't show my current orders. \n\nI will probably go today to collect it the supposedly \"correct frame\", will update here. Also posting this on twitter to get lenskart look into this. ",
    "flair": "Rant / Vent",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1726294607.0,
    "convurl": "https://external-preview.redd.it/GFgPutXRscyRoA5a6NcQon0I1dPAXetNTElc7_GyZ3E.jpg?auto=webp&s=90c6ba7e79c0cafce3cf2b0a176c40f22b52a81e",
    "comments": [],
    "cleaned_text": "harry potter lenskart trap finally getting time post experience lenskarts absolutely horrible customer support going long one tldr always return never exchange lenskart th aug ordered two frames harry potter collection lenskart studio herehttpswwwlenskartcomeyeglassescollectionsharrypottercollectionhtmlpagecount really looking forward frames accessories quite pricey wanted buy something salary got credited ordered straightaway app days later get delivered excited unboxed surprise one came advertised case cloth delivered standard soft case cloth lenses correct power put one correct case cloth another issue loose left hinge left hinge connects front face frame didnt feel solid durable wiggled lottt decided keep correct frame looked good right accessories still request new one defected heres mistake exchanged one wanted keep returned one pro tip never ever exchange lenskart always return days later get exchanged frame absolute surprise exact frame wiggle issue even box came exact also found return exchanged frame exchange even exchange nd time going travel gurgaon days decided go store time went lenskart store told happened said exchange possible place exchange specifically told want exact accessories came guess happened got called store showed frame issue even sent back accessories came frame custom accessories literally lost money store manager said theyll look personally told mark handover said theyll either get new one get one repaired cant even connect customer service app chat support downright awful doesnt show current orders probably go today collect supposedly correct frame update also posting twitter get lenskart look ",
    "cleaned_title": "harry potter lenskart trap",
    "cleaned_selftext": "finally getting time post experience lenskarts absolutely horrible customer support going long one tldr always return never exchange lenskart th aug ordered two frames harry potter collection lenskart studio herehttpswwwlenskartcomeyeglassescollectionsharrypottercollectionhtmlpagecount really looking forward frames accessories quite pricey wanted buy something salary got credited ordered straightaway app days later get delivered excited unboxed surprise one came advertised case cloth delivered standard soft case cloth lenses correct power put one correct case cloth another issue loose left hinge left hinge connects front face frame didnt feel solid durable wiggled lottt decided keep correct frame looked good right accessories still request new one defected heres mistake exchanged one wanted keep returned one pro tip never ever exchange lenskart always return days later get exchanged frame absolute surprise exact frame wiggle issue even box came exact also found return exchanged frame exchange even exchange nd time going travel gurgaon days decided go store time went lenskart store told happened said exchange possible place exchange specifically told want exact accessories came guess happened got called store showed frame issue even sent back accessories came frame custom accessories literally lost money store manager said theyll look personally told mark handover said theyll either get new one get one repaired cant even connect customer service app chat support downright awful doesnt show current orders probably go today collect supposedly correct frame update also posting twitter get lenskart look",
    "cleaned_comments": "",
    "light_cleaned_title": "Harry Potter and the Lenskart Trap.",
    "light_cleaned_selftext": "Finally getting the time to post this. This is about my experience with Lenskart's absolutely horrible customer support. This is going to be a long one. TL;DR: Always return. Never Exchange from Lenskart. On 5th Aug, I ordered two frames from the Harry Potter Collection from Lenskart Studio ([here](https://www.lenskart.com/eyeglasses/collections/harry-potter-collection.html?pageCount=1)). I was really looking forward to these frames and their accessories. They were quite pricey but I wanted to buy something for myself. My salary got credited and I ordered them straightaway from their app. A few days later they get delivered. Excited, I unboxed them and to my surprise only one of them came with the advertised case and cloth. The other was delivered with their standard soft case and cloth, with the lenses not having the correct power as I had put in. The one that did have the correct case and cloth, had another issue. It had a loose left hinge. Not the left hinge itself but where it connects to the front face of the frame. It didn't feel solid or durable and wiggled a lottt!. I decided to keep the correct frame, it looked good and had the right accessories but still request a new one for it was defected. Here's the mistake I did, I exchanged the one I wanted to keep and returned the other one. Pro tip: NEVER EVER EXCHANGE ON LENSKART. ALWAYS RETURN. Below is why. Few days later I get the exchanged frame, but to my absolute surprise, it was the exact same frame. It had the same wiggle issue. Even the box it came in was the exact same. What I also found out is you cannot return an exchanged frame. You can only exchange it again, and you cannot even exchange after the 2nd time. I was going to travel to Gurgaon after few days, so I decided to go to the store this time. I went to a Lenskart store, told them what had happened, they said only an exchange is possible so I had to place an exchange again. And specifically told them I want the exact same accessories that came with it. Guess what happened. I got called to the store, they showed me the frame and it had the same issue. Not only that, they even sent back the accessories that came with it. So I was down a frame and the custom accessories. I literally lost my money on them. The store manager said they'll look into it personally, told me they will mark it as 'Handover'. They said they'll either get a new one or get this one repaired. I can't even connect to their customer service, their app chat support is downright awful and doesn't show my current orders. I will probably go today to collect it the supposedly \"correct frame\", will update here. Also posting this on twitter to get lenskart look into this.",
    "light_cleaned_comments": ""
}