{
    "id": "152otb4",
    "title": "Loans with Government schemes and MSME LOANS",
    "url": "https://v.redd.it/5m3bbq03oncb1",
    "selftext": "We are dealing All kind of loans  pan india locations ( All Manufacturer industries, Service industries, All trading industries, All salaried personal loans). Any kind of finance help your companies. Kindly contact with us.\nRegards \n8527482266 \nMarketing@bankbrick.com \nWww.bankbrick.com\n#business #smallbusiness #faridabad #delhi #gurugram #india #marketing #digitalbanking #entrepreneur #sales #helpinghands #noida #ghaziabaad #palwal #Noida #entrepreneur #ca #bankingindustry #smallindustries\n #facebookreels #facebookvideo #instagram #Twitter #mojo #Youtube #youth #youtubeindia",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1689656454.0,
    "convurl": "https://external-preview.redd.it/C3T3OX41TeCdl2vRcVz7nXnJmUD3bTpWbwIOz-XdvZo.png?format=pjpg&auto=webp&s=b63658166976871f6c628010385d5bd51382bb50",
    "comments": [],
    "cleaned_text": "loans government schemes msme loans dealing kind loans pan india locations manufacturer industries service industries trading industries salaried personal loans kind finance help companies kindly contact us regards marketingbankbrickcom business smallbusiness faridabad delhi gurugram india marketing digitalbanking entrepreneur sales helpinghands noida ghaziabaad palwal noida entrepreneur ca bankingindustry smallindustries facebookreels facebookvideo instagram twitter mojo youtube youth youtubeindia ",
    "cleaned_title": "loans government schemes msme loans",
    "cleaned_selftext": "dealing kind loans pan india locations manufacturer industries service industries trading industries salaried personal loans kind finance help companies kindly contact us regards marketingbankbrickcom business smallbusiness faridabad delhi gurugram india marketing digitalbanking entrepreneur sales helpinghands noida ghaziabaad palwal noida entrepreneur ca bankingindustry smallindustries facebookreels facebookvideo instagram twitter mojo youtube youth youtubeindia",
    "cleaned_comments": "",
    "light_cleaned_title": "Loans with Government schemes and MSME LOANS",
    "light_cleaned_selftext": "We are dealing All kind of loans pan india locations ( All Manufacturer industries, Service industries, All trading industries, All salaried personal loans). Any kind of finance help your companies. Kindly contact with us. Regards 8527482266 Marketing@bankbrick.com Www.bankbrick.com #business #smallbusiness #faridabad #delhi #gurugram #india #marketing #digitalbanking #entrepreneur #sales #helpinghands #noida #ghaziabaad #palwal #Noida #entrepreneur #ca #bankingindustry #smallindustries #facebookreels #facebookvideo #instagram #Twitter #mojo #Youtube #youth #youtubeindia",
    "light_cleaned_comments": ""
}