{
    "id": "157zdpy",
    "title": "Online gaming: Navigating the GST burden | The India Story",
    "url": "https://www.reddit.com/r/india/comments/157zdpy/online_gaming_navigating_the_gst_burden_the_india/",
    "selftext": "[https://www.youtube.com/watch?v=BkaRkQR9XVQ](https://www.youtube.com/watch?v=BkaRkQR9XVQ)\n\n**The right decision or a great example of uninformed policymaking?**\n\nThe GST council said that they will be imposing a 28% uniform tax on all online games where wagering or entry ticket format is involved. This means if there was an online chess tournament that you wanted to enter, you would have to pay 28% tax of your deposit and in case there was a prize money that you won, you would also pay 30% TDS on that (this was already there).\n\n**What is happening?**\n\n1. This essentially shifts the tax liability from the gaming company or platform to the gamer.\n2. Now the gamer essentially pays 28% tax on the entry amount and TDS on the winning.\n3. This is in addition to the Income and capital gains tax to be filed during ITR.\n4. This actually makes gaming competitions more expensive. Affects young and poor gamers disproportionately.\n5. Calculation for a Chess or FIFA tournament under new GST plan: Entry Fee is Rs. 100. Gamer A pays 128. Gamer B pays the same amount. Total pool is 200. Gamer A wins the match and gets 200-20 (organizer fee) = 180. Pays 30% TDS which makes it 180-54=Rs 126. This is less than he paid for the tournament entry. Earlier the GST was totally to be paid by the company/platform. Using only 2 people to clarify the tax burden on one gamer.\n6. This is essentially the tax meant for gambling, lottery and horse racing. Blows my mind that I have to pay the same to play an esports or an gaming tournament.\n7. In addition, a 20% TCS on international credit card transaction to be imposed soon (was 5% till now), which will make purchasing games online more expensive.\n\n**What is the Govt saying**\n\n1. Ministry of IT was working on a framework to separate games like Chess and eSports from gambling by creating SRBs that would identify permissible vs non-permissible games. MOS Rajeev Chandrasekhar says he will speak with the GST council about it.\n2. GST Council is saying that they don't care about permissible vs non-permissible games. 28% will be across the board on deposit value to be paid by the gamer.\n\n**What is the big question?** \n\nIt is clear that there should be separate tax brackets for games like chess and let's say gambling (roulette, etc) and separate rules for betting (cricket betting, etc). This has been the position of the IT Ministry too. The question:  \nQ: Why is it becoming increasingly clear that policymakers make arbitrary decisions when it comes to things like gaming, emerging technology, etc? Or is it a lack of understanding or general apathy towards youth interests/issues - for example the disappearing playgrounds from cities and urban areas?",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690170656.0,
    "convurl": "https://external-preview.redd.it/DnJs5P2Oy6im1Z5Bj4IiM4yTBXysYq8xdFFZjs9jbdw.jpg?auto=webp&s=81baf481368ded73154e69da705bfd8450e8a5b1",
    "comments": [],
    "cleaned_text": "online gaming navigating gst burden india story httpswwwyoutubecomwatchvbkarkqrxvqhttpswwwyoutubecomwatchvbkarkqrxvq right decision great example uninformed policymaking gst council said imposing uniform tax online games wagering entry ticket format involved means online chess tournament wanted enter would pay tax deposit case prize money would also pay tds already happening essentially shifts tax liability gaming company platform gamer gamer essentially pays tax entry amount tds winning addition income capital gains tax filed itr actually makes gaming competitions expensive affects young poor gamers disproportionately calculation chess fifa tournament new gst plan entry fee rs gamer pays gamer b pays amount total pool gamer wins match gets organizer fee pays tds makes rs less paid tournament entry earlier gst totally paid companyplatform using people clarify tax burden one gamer essentially tax meant gambling lottery horse racing blows mind pay play esports gaming tournament addition tcs international credit card transaction imposed soon till make purchasing games online expensive govt saying ministry working framework separate games like chess esports gambling creating srbs would identify permissible vs nonpermissible games mos rajeev chandrasekhar says speak gst council gst council saying dont care permissible vs nonpermissible games across board deposit value paid gamer big question clear separate tax brackets games like chess lets say gambling roulette etc separate rules betting cricket betting etc position ministry question q becoming increasingly clear policymakers make arbitrary decisions comes things like gaming emerging technology etc lack understanding general apathy towards youth interestsissues example disappearing playgrounds cities urban areas ",
    "cleaned_title": "online gaming navigating gst burden india story",
    "cleaned_selftext": "httpswwwyoutubecomwatchvbkarkqrxvqhttpswwwyoutubecomwatchvbkarkqrxvq right decision great example uninformed policymaking gst council said imposing uniform tax online games wagering entry ticket format involved means online chess tournament wanted enter would pay tax deposit case prize money would also pay tds already happening essentially shifts tax liability gaming company platform gamer gamer essentially pays tax entry amount tds winning addition income capital gains tax filed itr actually makes gaming competitions expensive affects young poor gamers disproportionately calculation chess fifa tournament new gst plan entry fee rs gamer pays gamer b pays amount total pool gamer wins match gets organizer fee pays tds makes rs less paid tournament entry earlier gst totally paid companyplatform using people clarify tax burden one gamer essentially tax meant gambling lottery horse racing blows mind pay play esports gaming tournament addition tcs international credit card transaction imposed soon till make purchasing games online expensive govt saying ministry working framework separate games like chess esports gambling creating srbs would identify permissible vs nonpermissible games mos rajeev chandrasekhar says speak gst council gst council saying dont care permissible vs nonpermissible games across board deposit value paid gamer big question clear separate tax brackets games like chess lets say gambling roulette etc separate rules betting cricket betting etc position ministry question q becoming increasingly clear policymakers make arbitrary decisions comes things like gaming emerging technology etc lack understanding general apathy towards youth interestsissues example disappearing playgrounds cities urban areas",
    "cleaned_comments": "",
    "light_cleaned_title": "Online gaming: Navigating the GST burden | The India Story",
    "light_cleaned_selftext": "[https://www.youtube.com/watch?v=BkaRkQR9XVQ](https://www.youtube.com/watch?v=BkaRkQR9XVQ) **The right decision or a great example of uninformed policymaking?** The GST council said that they will be imposing a 28% uniform tax on all online games where wagering or entry ticket format is involved. This means if there was an online chess tournament that you wanted to enter, you would have to pay 28% tax of your deposit and in case there was a prize money that you won, you would also pay 30% TDS on that (this was already there). **What is happening?** 1. This essentially shifts the tax liability from the gaming company or platform to the gamer. 2. Now the gamer essentially pays 28% tax on the entry amount and TDS on the winning. 3. This is in addition to the Income and capital gains tax to be filed during ITR. 4. This actually makes gaming competitions more expensive. Affects young and poor gamers disproportionately. 5. Calculation for a Chess or FIFA tournament under new GST plan: Entry Fee is Rs. 100. Gamer A pays 128. Gamer B pays the same amount. Total pool is 200. Gamer A wins the match and gets 200-20 (organizer fee) = 180. Pays 30% TDS which makes it 180-54=Rs 126. This is less than he paid for the tournament entry. Earlier the GST was totally to be paid by the company/platform. Using only 2 people to clarify the tax burden on one gamer. 6. This is essentially the tax meant for gambling, lottery and horse racing. Blows my mind that I have to pay the same to play an esports or an gaming tournament. 7. In addition, a 20% TCS on international credit card transaction to be imposed soon (was 5% till now), which will make purchasing games online more expensive. **What is the Govt saying** 1. Ministry of IT was working on a framework to separate games like Chess and eSports from gambling by creating SRBs that would identify permissible vs non-permissible games. MOS Rajeev Chandrasekhar says he will speak with the GST council about it. 2. GST Council is saying that they don't care about permissible vs non-permissible games. 28% will be across the board on deposit value to be paid by the gamer. **What is the big question?** It is clear that there should be separate tax brackets for games like chess and let's say gambling (roulette, etc) and separate rules for betting (cricket betting, etc). This has been the position of the IT Ministry too. The question: Q: Why is it becoming increasingly clear that policymakers make arbitrary decisions when it comes to things like gaming, emerging technology, etc? Or is it a lack of understanding or general apathy towards youth interests/issues - for example the disappearing playgrounds from cities and urban areas?",
    "light_cleaned_comments": ""
}