{
    "id": "173ejrx",
    "title": "Holy Cows (VIDEO): How the plight of holy cows is used to radicalise teenagers in small-town India",
    "url": "https://www.reddit.com/r/india/comments/173ejrx/holy_cows_video_how_the_plight_of_holy_cows_is/",
    "selftext": "[https://aeon.co/videos/how-the-plight-of-holy-cows-is-used-to-radicalise-teenagers-in-small-town-india](https://aeon.co/videos/how-the-plight-of-holy-cows-is-used-to-radicalise-teenagers-in-small-town-india)\n\n>Since becoming India’s prime minister in 2014, Narendra Modi has been the figurehead of the nation’s shift away from secular pluralism and towards Hindu nationalism. This transformation has been accompanied by a major uptick in violence against religious minorities by Hindu extremists, and especially towards the Muslims who represent the country’s largest religious minority. In his disquieting documentary/narrative film *Holy Cowboys*, the Indian director Varun Chopra transports viewers to small-town India, where Hindu nationalist extremism most often proliferates. Combining observational documentary filmmaking with some scripted sequences, Chopra charts how a group of teenage boys slide into the grips of violent ideology, guided by leaders of a local extremist group and fuelled by the Hindu belief that cows are sacred. Through his subtle and sometimes shocking portrait, Chopra offers a penetrating look at the manner in which nearly any kind of violent extremist movement spreads – the fervent belief that not acting is the greatest moral wrong.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696811510.0,
    "convurl": "https://external-preview.redd.it/lbktl-PpS6D2D92d3UlDMtpfGsKq7JULKUC_KD63rOo.jpg?auto=webp&s=8a17f63e685f45056586073cae9aff4dc9222c0b",
    "comments": [
        "Saved it to watch later. Thank You."
    ],
    "cleaned_text": "holy cows video plight holy cows used radicalise teenagers smalltown india httpsaeoncovideoshowtheplightofholycowsisusedtoradicaliseteenagersinsmalltownindiahttpsaeoncovideoshowtheplightofholycowsisusedtoradicaliseteenagersinsmalltownindia since becoming indias prime minister narendra modi figurehead nations shift away secular pluralism towards hindu nationalism transformation accompanied major uptick violence religious minorities hindu extremists especially towards muslims represent countrys largest religious minority disquieting documentarynarrative film holy cowboys indian director varun chopra transports viewers smalltown india hindu nationalist extremism often proliferates combining observational documentary filmmaking scripted sequences chopra charts group teenage boys slide grips violent ideology guided leaders local extremist group fuelled hindu belief cows sacred subtle sometimes shocking portrait chopra offers penetrating look manner nearly kind violent extremist movement spreads fervent belief acting greatest moral wrong ",
    "cleaned_title": "holy cows video plight holy cows used radicalise teenagers smalltown india",
    "cleaned_selftext": "httpsaeoncovideoshowtheplightofholycowsisusedtoradicaliseteenagersinsmalltownindiahttpsaeoncovideoshowtheplightofholycowsisusedtoradicaliseteenagersinsmalltownindia since becoming indias prime minister narendra modi figurehead nations shift away secular pluralism towards hindu nationalism transformation accompanied major uptick violence religious minorities hindu extremists especially towards muslims represent countrys largest religious minority disquieting documentarynarrative film holy cowboys indian director varun chopra transports viewers smalltown india hindu nationalist extremism often proliferates combining observational documentary filmmaking scripted sequences chopra charts group teenage boys slide grips violent ideology guided leaders local extremist group fuelled hindu belief cows sacred subtle sometimes shocking portrait chopra offers penetrating look manner nearly kind violent extremist movement spreads fervent belief acting greatest moral wrong",
    "cleaned_comments": "saved watch later thank",
    "light_cleaned_title": "Holy Cows (VIDEO): How the plight of holy cows is used to radicalise teenagers in small-town India",
    "light_cleaned_selftext": "[https://aeon.co/videos/how-the-plight-of-holy-cows-is-used-to-radicalise-teenagers-in-small-town-india](https://aeon.co/videos/how-the-plight-of-holy-cows-is-used-to-radicalise-teenagers-in-small-town-india) >Since becoming India’s prime minister in 2014, Narendra Modi has been the figurehead of the nation’s shift away from secular pluralism and towards Hindu nationalism. This transformation has been accompanied by a major uptick in violence against religious minorities by Hindu extremists, and especially towards the Muslims who represent the country’s largest religious minority. In his disquieting documentary/narrative film *Holy Cowboys*, the Indian director Varun Chopra transports viewers to small-town India, where Hindu nationalist extremism most often proliferates. Combining observational documentary filmmaking with some scripted sequences, Chopra charts how a group of teenage boys slide into the grips of violent ideology, guided by leaders of a local extremist group and fuelled by the Hindu belief that cows are sacred. Through his subtle and sometimes shocking portrait, Chopra offers a penetrating look at the manner in which nearly any kind of violent extremist movement spreads – the fervent belief that not acting is the greatest moral wrong.",
    "light_cleaned_comments": "Saved it to watch later. Thank You."
}