{
    "id": "1ac85on",
    "title": "**Tragedy Strikes: Man Loses Both Legs Due to Negligence at Daya Basti Railway Station**",
    "url": "https://www.reddit.com/gallery/1ac85on",
    "selftext": "\n\nOn the 16th of January, a routine train journey turned into a nightmare for a 55-year-old man and his family as they traveled from Gujarat to Delhi. The fateful moment unfolded at Daya Basti railway station when the train unexpectedly made an unscheduled stop. Seizing the opportunity to disembark, the man approached the train door with his family and belongings, unaware of the impending danger lurking nearby.\n\nAmidst the chaos of the unscheduled stop, a group of snatchers targeted the man, attempting to wrestle away his bag. In the struggle that ensued, the man lost his balance and tragically fell onto the tracks, where the unforgiving wheels of the train severed both his legs. Shockingly, instead of rushing to his aid, bystanders chose to document the horrific scene on their smartphones, prioritizing sensationalism over compassion.\n\nAdding to the distressing ordeal, the authorities entrusted with ensuring public safety, including the CRPF and local police, failed to intervene effectively. Despite the desperate pleas of the man's son, Kamal, for assistance, help was nowhere to be found. Even the basic request for a stretcher was met with callous indifference from railway workers, who callously cited bureaucratic regulations, claiming the stretcher could not leave the confines of the station.\n\nLeft with no other recourse, Kamal turned to his landlord for help, illustrating the heartbreaking reality of a system that failed to respond promptly in a moment of crisis. Eventually, through sheer determination and the assistance of compassionate individuals, the injured man was transported to a nearby hospital before being referred to Sir Ganga Ram Hospital in Karol Bagh, New Delhi, for urgent medical attention.\n\nThis harrowing incident serves as a stark reminder of the dire consequences of negligence and apathy within our public institutions. The failure of bystanders to offer assistance in a time of need, coupled with the inadequate response from authorities, highlights systemic flaws that must be addressed urgently. Every individual deserves the assurance of safety and support, especially during moments of vulnerability.\n\nAs the community grapples with the aftermath of this tragedy, it is imperative that accountability is upheld, and measures are implemented to prevent such incidents from recurring. Let this serve as a rallying cry for justice, empathy, and solidarity in the face of adversity. Together, we must strive to create a society where compassion triumphs over indifference and where every life is valued and protected. #JusticeForVictim #Negligence #RailwaySafety #HelpInNeed #CommunitySupport",
    "flair": "Crime",
    "score": 98,
    "num_comments": 15,
    "created_utc": 1706352054.0,
    "convurl": "https://i.redd.it/3h517nypoyec1.jpg",
    "comments": [
        "May the snatchers be caught and rot in jail and then in hell.",
        "Holy shit....our news me ghanta aayega bas .....",
        "Pls share his bank details, only we can do some charity",
        "Delhi police said the snatcher is minor, they won't be able to take actions to it.",
        "Exactly bro, till it happens with ones",
        "Surely check dm",
        "I'm a student of prosthetic and orthotics can help him by providing a pair artificial leg and which will help him get back to his daily life",
        "Sad story but the chatgpt text 🤢",
        "Can't type it all kinda frustrating, gpt helps in sometimes",
        "That would be so sweet of you, i will send the victim's son phone nuyou maye contact him",
        "https://preview.redd.it/mfxfme9tg0fc1.jpeg?width=900&format=pjpg&auto=webp&s=2915dd1a4f89aa0b4a094243abb8eeab62a37f91\n\nWould this help in verifying the source?",
        "\ntheres atleast 50 such incidents per year as far as i am aware, there should be a precautionary system in place to avoid such incidents, maybe some sensor be placed near the platform gap of the train, which could alert the driver if there is some issue, it's a pretty easy modification, and can be easily done on older trains too, I don't know why the railway ministry and irctc have been so ignorant towards such incidents.",
        "Exactly, all this make in india and all new tech things india is adopting. What will mater to that?"
    ],
    "cleaned_text": "tragedy strikes man loses legs due negligence daya basti railway station th january routine train journey turned nightmare yearold man family traveled gujarat delhi fateful moment unfolded daya basti railway station train unexpectedly made unscheduled stop seizing opportunity disembark man approached train door family belongings unaware impending danger lurking nearby amidst chaos unscheduled stop group snatchers targeted man attempting wrestle away bag struggle ensued man lost balance tragically fell onto tracks unforgiving wheels train severed legs shockingly instead rushing aid bystanders chose document horrific scene smartphones prioritizing sensationalism compassion adding distressing ordeal authorities entrusted ensuring public safety including crpf local police failed intervene effectively despite desperate pleas mans son kamal assistance help nowhere found even basic request stretcher met callous indifference railway workers callously cited bureaucratic regulations claiming stretcher could leave confines station left recourse kamal turned landlord help illustrating heartbreaking reality system failed respond promptly moment crisis eventually sheer determination assistance compassionate individuals injured man transported nearby hospital referred sir ganga ram hospital karol bagh new delhi urgent medical attention harrowing incident serves stark reminder dire consequences negligence apathy within public institutions failure bystanders offer assistance time need coupled inadequate response authorities highlights systemic flaws must addressed urgently every individual deserves assurance safety support especially moments vulnerability community grapples aftermath tragedy imperative accountability upheld measures implemented prevent incidents recurring let serve rallying cry justice empathy solidarity face adversity together must strive create society compassion triumphs indifference every life valued protected justiceforvictim negligence railwaysafety helpinneed communitysupport ",
    "cleaned_title": "tragedy strikes man loses legs due negligence daya basti railway station",
    "cleaned_selftext": "th january routine train journey turned nightmare yearold man family traveled gujarat delhi fateful moment unfolded daya basti railway station train unexpectedly made unscheduled stop seizing opportunity disembark man approached train door family belongings unaware impending danger lurking nearby amidst chaos unscheduled stop group snatchers targeted man attempting wrestle away bag struggle ensued man lost balance tragically fell onto tracks unforgiving wheels train severed legs shockingly instead rushing aid bystanders chose document horrific scene smartphones prioritizing sensationalism compassion adding distressing ordeal authorities entrusted ensuring public safety including crpf local police failed intervene effectively despite desperate pleas mans son kamal assistance help nowhere found even basic request stretcher met callous indifference railway workers callously cited bureaucratic regulations claiming stretcher could leave confines station left recourse kamal turned landlord help illustrating heartbreaking reality system failed respond promptly moment crisis eventually sheer determination assistance compassionate individuals injured man transported nearby hospital referred sir ganga ram hospital karol bagh new delhi urgent medical attention harrowing incident serves stark reminder dire consequences negligence apathy within public institutions failure bystanders offer assistance time need coupled inadequate response authorities highlights systemic flaws must addressed urgently every individual deserves assurance safety support especially moments vulnerability community grapples aftermath tragedy imperative accountability upheld measures implemented prevent incidents recurring let serve rallying cry justice empathy solidarity face adversity together must strive create society compassion triumphs indifference every life valued protected justiceforvictim negligence railwaysafety helpinneed communitysupport",
    "cleaned_comments": "may snatchers caught rot jail hell holy shitour news ghanta aayega bas pls share bank details charity delhi police said snatcher minor wont able take actions exactly bro till happens ones surely check dm im student prosthetic orthotics help providing pair artificial leg help get back daily life sad story chatgpt text cant type kinda frustrating gpt helps sometimes would sweet send victims son phone nuyou maye contact would help verifying source theres atleast incidents per year far aware precautionary system place avoid incidents maybe sensor placed near platform gap train could alert driver issue pretty easy modification easily done older trains dont know railway ministry irctc ignorant towards incidents exactly make india new tech things india adopting mater",
    "light_cleaned_title": "**Tragedy Strikes: Man Loses Both Legs Due to Negligence at Daya Basti Railway Station**",
    "light_cleaned_selftext": "On the 16th of January, a routine train journey turned into a nightmare for a 55-year-old man and his family as they traveled from Gujarat to Delhi. The fateful moment unfolded at Daya Basti railway station when the train unexpectedly made an unscheduled stop. Seizing the opportunity to disembark, the man approached the train door with his family and belongings, unaware of the impending danger lurking nearby. Amidst the chaos of the unscheduled stop, a group of snatchers targeted the man, attempting to wrestle away his bag. In the struggle that ensued, the man lost his balance and tragically fell onto the tracks, where the unforgiving wheels of the train severed both his legs. Shockingly, instead of rushing to his aid, bystanders chose to document the horrific scene on their smartphones, prioritizing sensationalism over compassion. Adding to the distressing ordeal, the authorities entrusted with ensuring public safety, including the CRPF and local police, failed to intervene effectively. Despite the desperate pleas of the man's son, Kamal, for assistance, help was nowhere to be found. Even the basic request for a stretcher was met with callous indifference from railway workers, who callously cited bureaucratic regulations, claiming the stretcher could not leave the confines of the station. Left with no other recourse, Kamal turned to his landlord for help, illustrating the heartbreaking reality of a system that failed to respond promptly in a moment of crisis. Eventually, through sheer determination and the assistance of compassionate individuals, the injured man was transported to a nearby hospital before being referred to Sir Ganga Ram Hospital in Karol Bagh, New Delhi, for urgent medical attention. This harrowing incident serves as a stark reminder of the dire consequences of negligence and apathy within our public institutions. The failure of bystanders to offer assistance in a time of need, coupled with the inadequate response from authorities, highlights systemic flaws that must be addressed urgently. Every individual deserves the assurance of safety and support, especially during moments of vulnerability. As the community grapples with the aftermath of this tragedy, it is imperative that accountability is upheld, and measures are implemented to prevent such incidents from recurring. Let this serve as a rallying cry for justice, empathy, and solidarity in the face of adversity. Together, we must strive to create a society where compassion triumphs over indifference and where every life is valued and protected. #JusticeForVictim #Negligence #RailwaySafety #HelpInNeed #CommunitySupport",
    "light_cleaned_comments": "May the snatchers be caught and rot in jail and then in hell. Holy shit....our news me ghanta aayega bas ..... Pls share his bank details, only we can do some charity Delhi police said the snatcher is minor, they won't be able to take actions to it. Exactly bro, till it happens with ones Surely check dm I'm a student of prosthetic and orthotics can help him by providing a pair artificial leg and which will help him get back to his daily life Sad story but the chatgpt text 🤢 Can't type it all kinda frustrating, gpt helps in sometimes That would be so sweet of you, i will send the victim's son phone nuyou maye contact him Would this help in verifying the source? theres atleast 50 such incidents per year as far as i am aware, there should be a precautionary system in place to avoid such incidents, maybe some sensor be placed near the platform gap of the train, which could alert the driver if there is some issue, it's a pretty easy modification, and can be easily done on older trains too, I don't know why the railway ministry and irctc have been so ignorant towards such incidents. Exactly, all this make in india and all new tech things india is adopting. What will mater to that?"
}