{
    "id": "17e4v8z",
    "title": "10% holding 70% wealth portrays a wrong picture",
    "url": "https://www.reddit.com/r/india/comments/17e4v8z/10_holding_70_wealth_portrays_a_wrong_picture/",
    "selftext": "This basically paints a picture that rest of 90% is extremely poor. That's not the case. This statement doesn't take into the account the city/town/village people are living in.\n\nAccording to [this](https://www.statista.com/statistics/275378/largest-cities-in-india/), there are 10 Cr people living in Delhi, Mumbai, Chennai, Kolkata, Bangalore and Hyderabad combined. This means that roughly 7% of our population lives in tier-1 cities where cost of living for an average professional can go 30-40k per month (even higher), whereas in tier-2 cities this cost reduces to 20-25k per month for an individual and even lower for tier-3 cities or villages.\n\nIt is natural that people living in tier-1 cities will be earning a higher amount of salary (and therefore higher savings in absolute terms too) but that doesn't mean they're richer than tier-2 or tier-3 population if both of them never decide to switch places. If you have 30-40k salary in village, you can live as luxurious life as possible there.\n\nI think a much better metric would be to take a ratio of their cost of living to their income.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698012842.0,
    "convurl": "https://external-preview.redd.it/E7e_Cg5utDrRPQ8MQKvRhGC0Lx0L6PfmATi6uV-64kU.jpg?auto=webp&s=e7c471b52a1f89deab58fba67c1dd7c5065916f2",
    "comments": [
        "90% of India is poor tho.",
        "Idk why most Indians have this false notion that everyone in India has money but everyone just hides it. Do you think people like to live like shit cause it’s their hobby? \n\nLet me pop the bubble for you. \n1 in 5 Indians can’t even read in 1 language. \n50% of Indians don’t even have smartphone.\nDue to malnutrition, average male height in India is 5’5”",
        ">If you have 30-40k salary in village, you can live as luxurious life as possible there.\n\nAnd how do you propose that a villager gets 30k salary?",
        ">If you have 30-40k salary in village, you can live as luxurious life as possible there.\n\nAnd how do you propose that a villager gets 30k salary?"
    ],
    "cleaned_text": "holding wealth portrays wrong picture basically paints picture rest extremely poor thats case statement doesnt take account citytownvillage people living according thishttpswwwstatistacomstatisticslargestcitiesinindia cr people living delhi mumbai chennai kolkata bangalore hyderabad combined means roughly population lives tier cities cost living average professional go k per month even higher whereas tier cities cost reduces k per month individual even lower tier cities villages natural people living tier cities earning higher amount salary therefore higher savings absolute terms doesnt mean theyre richer tier tier population never decide switch places k salary village live luxurious life possible think much better metric would take ratio cost living income ",
    "cleaned_title": "holding wealth portrays wrong picture",
    "cleaned_selftext": "basically paints picture rest extremely poor thats case statement doesnt take account citytownvillage people living according thishttpswwwstatistacomstatisticslargestcitiesinindia cr people living delhi mumbai chennai kolkata bangalore hyderabad combined means roughly population lives tier cities cost living average professional go k per month even higher whereas tier cities cost reduces k per month individual even lower tier cities villages natural people living tier cities earning higher amount salary therefore higher savings absolute terms doesnt mean theyre richer tier tier population never decide switch places k salary village live luxurious life possible think much better metric would take ratio cost living income",
    "cleaned_comments": "india poor tho idk indians false notion everyone india money everyone hides think people like live like shit cause hobby let pop bubble indians cant even read language indians dont even smartphone due malnutrition average male height india k salary village live luxurious life possible propose villager gets k salary k salary village live luxurious life possible propose villager gets k salary",
    "light_cleaned_title": "10% holding 70% wealth portrays a wrong picture",
    "light_cleaned_selftext": "This basically paints a picture that rest of 90% is extremely poor. That's not the case. This statement doesn't take into the account the city/town/village people are living in. According to [this](https://www.statista.com/statistics/275378/largest-cities-in-india/), there are 10 Cr people living in Delhi, Mumbai, Chennai, Kolkata, Bangalore and Hyderabad combined. This means that roughly 7% of our population lives in tier-1 cities where cost of living for an average professional can go 30-40k per month (even higher), whereas in tier-2 cities this cost reduces to 20-25k per month for an individual and even lower for tier-3 cities or villages. It is natural that people living in tier-1 cities will be earning a higher amount of salary (and therefore higher savings in absolute terms too) but that doesn't mean they're richer than tier-2 or tier-3 population if both of them never decide to switch places. If you have 30-40k salary in village, you can live as luxurious life as possible there. I think a much better metric would be to take a ratio of their cost of living to their income.",
    "light_cleaned_comments": "90% of India is poor tho. Idk why most Indians have this false notion that everyone in India has money but everyone just hides it. Do you think people like to live like shit cause it’s their hobby? Let me pop the bubble for you. 1 in 5 Indians can’t even read in 1 language. 50% of Indians don’t even have smartphone. Due to malnutrition, average male height in India is 5’5” >If you have 30-40k salary in village, you can live as luxurious life as possible there. And how do you propose that a villager gets 30k salary? >If you have 30-40k salary in village, you can live as luxurious life as possible there. And how do you propose that a villager gets 30k salary?"
}