{
    "id": "14jkqyp",
    "title": "Road to 2024 | Opposition unity: It may come down to three states, UP, West Bengal, Punjab",
    "url": "https://indianexpress.com/article/political-pulse/road-to-2024-opposition-unity-up-west-bengal-punjab-8686918/",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Findianexpress.com%2Farticle%2Fpolitical-pulse%2Froad-to-2024-opposition-unity-up-west-bengal-punjab-8686918%2F",
    "flair": "Politics",
    "score": 16,
    "num_comments": 23,
    "created_utc": 1687794174.0,
    "convurl": "https://external-preview.redd.it/fqF3f0NkHm3uFl247Ng1AB3VQMTMpRx1g3gCI-VQB24.jpg?auto=webp&v=enabled&s=124987d50a5e8bfe8e3492965565613ba8f739bd",
    "comments": [
        "I think BJP workers will have a mini celebration on the day Rahul is confirmed as the challenger to modi for 2024 . Sad but true .",
        "There is no direct competition for Modi given the propaganda machinery at his disposal but among the opposition leaders Rahul Gandhi is the best known and most liked. If he was that irrelevant as the BJP loyalists think then he wouldn’t be target no 1 for BJP and the same loyalists. No opposition leader is besmirched by BJP as much as Rahul Gandhi. The BJP loyalists wanted Tharoor as the leader of the opposition, when Kharge was backed they sniggered and called it a mistake. Yet look how wrong it has been proven. Personally i hope Congress runs a campaign on the promises that matter the most, MSP, caste census, revival of the dying MNREGA program, resurgence of Indian railways ( even with VB launches, Railways has gone down the drain) etc. A campaign with a clear message and focus on BJP’s anti incumbency.",
        "In UP Cong must do alliance to minimise the damage BJP will inflict. In WB and Punjab, they don’t need an alliance, just fight alone. In WB particularly, if they align with TMC then they will absorb all of TMC’s anti incumbency factor and BJP will get all the anti Mamata votes. It’s better for Cong to keep their alliance with LF intact take Mamata head on and go for the 40 percent plus anti Mamata votes. BJP has very little voter base in WB and a weak organisation compared to other parties, they can be relegated to 3rd spot easily behind Left + Cong alliance.",
        "People want Tharoor as the Leader because he's actually competent. I would've voted for him in a heartbeat if he were the congress president instead of some old Gandhi family fanboy.\n\n> Railways has gone down the drain \n\nHow so? the railways look better than ever. Multiple stations are being redeveloped. VBs are a huge improvement and are gonna be the standard soon. Elevated tracks are being built as well for speed. How is the railways declining?",
        "Lol idiots like you are the sole reason they're in power.",
        "Tharoor lacks the stomach for a fight, Kharge doesn’t. Tharoor is to Congress what  Jaishankar is to BJP. A politician with a polished English speaking pedigree, but Jaishankar will never be president of BJP and neither should Tharoor be. I call bs on anyone who says they will vote for Congress if someone like Tharoor is elected president 😂😂",
        "Dude high end trains like VB are specialised for a niche category and they’re barely a slight improvement on existing express trains just a shinier and glossier versions. The condition of 3AC in most trains is deplorable, even 5 years back it was good. I can’t even travel below 2AC now. Sleeper class has become the new general compartment. Many trains that were closed during the pandemic haven’t returned to the tracks or following a regular schedule. Again i say just cause something is shiny doesn’t mean it’s valuable. GoI needs to invest heavily in improving facilities for lower and middle income passengers who are majority train users. That segment is getting ignored.",
        "I would vote for Jaishankar if he was BJP prez and Tharoor if he became Congress Prez. they're both capable professionals. \n\nBoth of them are better than some old gandhi puppet who made his own son an MLA .",
        "Then you’re an exception. It’s very simple when your opponent wants to pick your party’s president they aren’t doing it cause they want a fair competition, they’re doing it cause they feel they’ll be easy to handle. I can guarantee you the recent boost in electoral profile that Cong has got with wins in Himachal & Karnataka wouldn’t be possible without Kharge as president. His appointment is probably the best decision Congress has made in the last decade.",
        ">  a slight improvement on existing express trains just a shinier and glossier versions \n\nWhat? VBs are much faster, they reduced the travel time in many cases and even with poor curved tracks run at an average of 83 KM/s which is significantly faster than most indian trains and they have a safer indigenously developed braking system. \n\nthere are plans to introduce sleeper VBs, chair car VBs and Vande Metro.  \n\nIt's also completely different from regular indian trains that have a single engine, every single VB coach has it's own engine. a design comparable to Mumbai locals, except the locals are nowhere as fast. \n\nas of now, they are still niche. but 400 more are planned within the next 3 years plus introducing stuff like this is important, it may not be useful now but it will set a good precedent for the future especially considering that the govt is paralleling improving the tracks as well so that the train speed increases.",
        "People in my village don't even know who is Tharoor.",
        "You should compare the travel time of VBs with Shatabdis. The difference is barely noticeable. Maybe it’s the tracks but fact is VBs aren’t a major leap forward travel time wise compared to a shatabdi. \n\nAs for future plans we will see when it happens but as of now Railway service absolutely sucks. Don’t believe me, try travelling by a sleeper coach or 3 AC now. You’ll find out.\n\nAlso the Kavach program the much touted anti collision system that GoI has promoted. They’ve barely implemented it, less than 2 percent implementation. Yet they’re focusing so much on PR.",
        "Congress will find less than zero success in Bengal siding against TMC , like any other party would. You probably do not live here and have little to no idea as to why people have still kept her in power.\n\nThat is exactly what congress tried during the last state elections and along with it's coalition came in third behind a bjp by a margin soo large, that only TMC could secure a comparably larger margin surpassing BJP in turn.\n\nThere is no success for a party in Bengal currently siding against the TMC. Anyone stating otherwise either does not reside in Bengal or has absolutely no idea what they are talking about.",
        "Dude i’m a Bengali and a voter of WB. So let me put it this way, in WB there are two types of voters, pro mamata & anti mamata. Pro mamata voters obliviously vote TMC, anti mamata voters are scattered among Cong, Left, BJP with BJP being primary opposition on paper for now as per 2021 VS. But BJP has no natural voter base, most BJP voters are disgruntled Left & Cong voters who suffered after 2016 election loss, they again suffered at the hands of TMC in 2021 election loss. Right now mostly are undecided. In the last municipal elections in 2021 BJP came in 3rd to left front, even though left front barely put in an effort. In the last 1 year both left and Cong have regrouped significantly and right now are in good steed. BJP is strong only in Jangalmahal area and North Bengal, for rest their organisation has collapsed. If in upcoming panchayat elections Left & Cong do well then BJP will lose even more voters. TMC has massive anti incumbency and if Cong ally with TMC( left will never ally with them) they will absorb that anti incumbency, plain and simple. Stop judging current political situation with 2021 VS. That was a wave election and that wave is a puddle now with BJP’s loss.\n\nEdit: check the nominations list and see who are the primary opposition to TMC in the upcoming panchayat elections district wise. You’ll have an idea which party is at what stage.",
        "Your entire argument becomes completely pointless the moment you realise the number people voting for TMC, regardless of their love for the party itself, completely overwhelm those that simply hate the party because of Mamata in numbers. Compared to those in in favour of TMC the anti Mamata group is insignificant. Panchayat elections should not even be brought into these arguments. There is no reason for Congress to stand in the elections against TMC again when siding with them will guarantee them either of Punjab or WB. Victory and territory is the foremost priority for them right now. Details like anti incumbency can ve addressed after gaining significant success next General Elections.\n\nI agree with you saying Congress is more favourable currently compared to BJP. Seems like the appeal for Rahul Gandhi is more than ever before. Regardless of who Congress makes the mistake of siding with, no time like now to pass BJP in Bengal as the runner party. Something they will most certainly regret absolutely is not taking ANY kind of appropriate action now when the time was arguably best in years in Bengal.",
        "There are only 21 shatabdis in India. There are 400 Vande Bharats planned for the 3 next years alone and already 18 currently working. The scale at which work is being planned by the current govt is far better than the previous govt who set up a measly 21 shatabdis in 70 years of governance. \n\nI travel by 3AC every other week and that too, my trips are usually 20-23 hours. I really don't see anything worse than how it was pre 2014. \n\n2% implementation is 1,455 KM of tracks. Do you think it'll be easy to install it 100% in the most extensive railway network in the world? Even a developed country would require years of planning and manpower to accomplish this.",
        "Vande Bharat has a niche customer base. With the ticket prices I can guarantee you it would be useless to 90 percent of the long distance passengers. So you can beat the Vande Bharat drum all you want. Primary focus should be improving low cost train services not rolling out premium trains. Buddy 10 years back i could travel in a sleeper relatively comfortably and I frequently did for 6-7 hour trips, can’t even do that nowadays, it’s that bad. The Rajasthan-Howrah route has less trains now then it had 10 years back, that’s a fact. You can go on about Vande Bharat all you want, really doesn’t matter, cause it’s like saying we have less unemployment cause sales of IPhone has increased, there is no actual correlation.\n\nI agree it would take time & effort to implement kavach program completely so maybe do less PR on it or wait till at-least 50 percent completion.",
        "There is a solid 40-45 percent anti Mamata voter base, that is for the taking, if Cong allies with TMC Cong will lose out on that share cause anyone who allies with TMC won’t get a single vote from that pot. With the best hope being LF getting majority of the pot. \n\nAnd panchayat elections do matter. There is a reason Mamata Banerjee is campaigning for a panchayat elections for the first time since becoming CM, she knows it’s importance. This election has the potential to change the political landscape of WB, just like in 2018 when sheer level of political brutality from TMC and left front’s inaction made BJP the primary opposition in WB. Left front is on the rise, even BJP has sensed it that’s why they are running around HC to have the election cancelled cause if Left does well they’ll lose vote share.\n\nLast but not least TMC has made it clear that they want Cong to step aside from elections in WB altogether and let TMC fight alone, that’s something will not be acceptable to WB Congress leadership and rightly so. I doubt TMC will give up their organisation in Malda, Murshidabad & Dinajpur area. Heck they even lured in ex-Congress MLA Byron Biswas. TMC isn’t trustworthy at all. And aligning with TMC will help in Punjab? 😂😂 that’s just laughable. I doubt anyone gives a sh!t about TMC in Punjab.\n\nImo Cong + Left fight together with TMC being the main opponent, push BJP to no 3. That will be the best result for everyone involved.",
        "Dude is just a tiktok warrior with a smug punch able face. \n\nTharoor worked for the UN, and contested elections"
    ],
    "cleaned_text": "road opposition unity may come three states west bengal punjab  ",
    "cleaned_title": "road opposition unity may come three states west bengal punjab",
    "cleaned_selftext": "",
    "cleaned_comments": "think bjp workers mini celebration day rahul confirmed challenger modi sad true direct competition modi given propaganda machinery disposal among opposition leaders rahul gandhi best known liked irrelevant bjp loyalists think wouldnt target bjp loyalists opposition leader besmirched bjp much rahul gandhi bjp loyalists wanted tharoor leader opposition kharge backed sniggered called mistake yet look wrong proven personally hope congress runs campaign promises matter msp caste census revival dying mnrega program resurgence indian railways even vb launches railways gone drain etc campaign clear message focus bjps anti incumbency cong must alliance minimise damage bjp inflict wb punjab dont need alliance fight alone wb particularly align tmc absorb tmcs anti incumbency factor bjp get anti mamata votes better cong keep alliance lf intact take mamata head go percent plus anti mamata votes bjp little voter base wb weak organisation compared parties relegated rd spot easily behind left cong alliance people want tharoor leader hes actually competent wouldve voted heartbeat congress president instead old gandhi family fanboy railways gone drain railways look better ever multiple stations redeveloped vbs huge improvement gon na standard soon elevated tracks built well speed railways declining lol idiots like sole reason theyre power tharoor lacks stomach fight kharge doesnt tharoor congress jaishankar bjp politician polished english speaking pedigree jaishankar never president bjp neither tharoor call bs anyone says vote congress someone like tharoor elected president dude high end trains like vb specialised niche category theyre barely slight improvement existing express trains shinier glossier versions condition ac trains deplorable even years back good cant even travel ac sleeper class become new general compartment many trains closed pandemic havent returned tracks following regular schedule say cause something shiny doesnt mean valuable goi needs invest heavily improving facilities lower middle income passengers majority train users segment getting ignored would vote jaishankar bjp prez tharoor became congress prez theyre capable professionals better old gandhi puppet made son mla youre exception simple opponent wants pick partys president arent cause want fair competition theyre cause feel theyll easy handle guarantee recent boost electoral profile cong got wins himachal karnataka wouldnt possible without kharge president appointment probably best decision congress made last decade slight improvement existing express trains shinier glossier versions vbs much faster reduced travel time many cases even poor curved tracks run average kms significantly faster indian trains safer indigenously developed braking system plans introduce sleeper vbs chair car vbs vande metro also completely different regular indian trains single engine every single vb coach engine design comparable mumbai locals except locals nowhere fast still niche planned within next years plus introducing stuff like important may useful set good precedent future especially considering govt paralleling improving tracks well train speed increases people village dont even know tharoor compare travel time vbs shatabdis difference barely noticeable maybe tracks fact vbs arent major leap forward travel time wise compared shatabdi future plans see happens railway service absolutely sucks dont believe try travelling sleeper coach ac youll find also kavach program much touted anti collision system goi promoted theyve barely implemented less percent implementation yet theyre focusing much pr congress find less zero success bengal siding tmc like party would probably live little idea people still kept power exactly congress tried last state elections along coalition came third behind bjp margin soo large tmc could secure comparably larger margin surpassing bjp turn success party bengal currently siding tmc anyone stating otherwise either reside bengal absolutely idea talking dude im bengali voter wb let put way wb two types voters pro mamata anti mamata pro mamata voters obliviously vote tmc anti mamata voters scattered among cong left bjp bjp primary opposition paper per vs bjp natural voter base bjp voters disgruntled left cong voters suffered election loss suffered hands tmc election loss right mostly undecided last municipal elections bjp came rd left front even though left front barely put effort last year left cong regrouped significantly right good steed bjp strong jangalmahal area north bengal rest organisation collapsed upcoming panchayat elections left cong well bjp lose even voters tmc massive anti incumbency cong ally tmc left never ally absorb anti incumbency plain simple stop judging current political situation vs wave election wave puddle bjps loss edit check nominations list see primary opposition tmc upcoming panchayat elections district wise youll idea party stage entire argument becomes completely pointless moment realise number people voting tmc regardless love party completely overwhelm simply hate party mamata numbers compared favour tmc anti mamata group insignificant panchayat elections even brought arguments reason congress stand elections tmc siding guarantee either punjab wb victory territory foremost priority right details like anti incumbency addressed gaining significant success next general elections agree saying congress favourable currently compared bjp seems like appeal rahul gandhi ever regardless congress makes mistake siding time like pass bjp bengal runner party something certainly regret absolutely taking kind appropriate action time arguably best years bengal shatabdis india vande bharats planned next years alone already currently working scale work planned current govt far better previous govt set measly shatabdis years governance travel ac every week trips usually hours really dont see anything worse pre implementation km tracks think itll easy install extensive railway network world even developed country would require years planning manpower accomplish vande bharat niche customer base ticket prices guarantee would useless percent long distance passengers beat vande bharat drum want primary focus improving low cost train services rolling premium trains buddy years back could travel sleeper relatively comfortably frequently hour trips cant even nowadays bad rajasthanhowrah route less trains years back thats fact go vande bharat want really doesnt matter cause like saying less unemployment cause sales iphone increased actual correlation agree would take time effort implement kavach program completely maybe less pr wait till atleast percent completion solid percent anti mamata voter base taking cong allies tmc cong lose share cause anyone allies tmc wont get single vote pot best hope lf getting majority pot panchayat elections matter reason mamata banerjee campaigning panchayat elections first time since becoming cm knows importance election potential change political landscape wb like sheer level political brutality tmc left fronts inaction made bjp primary opposition wb left front rise even bjp sensed thats running around hc election cancelled cause left well theyll lose vote share last least tmc made clear want cong step aside elections wb altogether let tmc fight alone thats something acceptable wb congress leadership rightly doubt tmc give organisation malda murshidabad dinajpur area heck even lured excongress mla byron biswas tmc isnt trustworthy aligning tmc help punjab thats laughable doubt anyone gives sht tmc punjab imo cong left fight together tmc main opponent push bjp best result everyone involved dude tiktok warrior smug punch able face tharoor worked un contested elections",
    "light_cleaned_title": "Road to 2024 | Opposition unity: It may come down to three states, UP, West Bengal, Punjab",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "I think BJP workers will have a mini celebration on the day Rahul is confirmed as the challenger to modi for 2024 . Sad but true . There is no direct competition for Modi given the propaganda machinery at his disposal but among the opposition leaders Rahul Gandhi is the best known and most liked. If he was that irrelevant as the BJP loyalists think then he wouldn’t be target no 1 for BJP and the same loyalists. No opposition leader is besmirched by BJP as much as Rahul Gandhi. The BJP loyalists wanted Tharoor as the leader of the opposition, when Kharge was backed they sniggered and called it a mistake. Yet look how wrong it has been proven. Personally i hope Congress runs a campaign on the promises that matter the most, MSP, caste census, revival of the dying MNREGA program, resurgence of Indian railways ( even with VB launches, Railways has gone down the drain) etc. A campaign with a clear message and focus on BJP’s anti incumbency. In UP Cong must do alliance to minimise the damage BJP will inflict. In WB and Punjab, they don’t need an alliance, just fight alone. In WB particularly, if they align with TMC then they will absorb all of TMC’s anti incumbency factor and BJP will get all the anti Mamata votes. It’s better for Cong to keep their alliance with LF intact take Mamata head on and go for the 40 percent plus anti Mamata votes. BJP has very little voter base in WB and a weak organisation compared to other parties, they can be relegated to 3rd spot easily behind Left + Cong alliance. People want Tharoor as the Leader because he's actually competent. I would've voted for him in a heartbeat if he were the congress president instead of some old Gandhi family fanboy. > Railways has gone down the drain How so? the railways look better than ever. Multiple stations are being redeveloped. VBs are a huge improvement and are gonna be the standard soon. Elevated tracks are being built as well for speed. How is the railways declining? Lol idiots like you are the sole reason they're in power. Tharoor lacks the stomach for a fight, Kharge doesn’t. Tharoor is to Congress what Jaishankar is to BJP. A politician with a polished English speaking pedigree, but Jaishankar will never be president of BJP and neither should Tharoor be. I call bs on anyone who says they will vote for Congress if someone like Tharoor is elected president 😂😂 Dude high end trains like VB are specialised for a niche category and they’re barely a slight improvement on existing express trains just a shinier and glossier versions. The condition of 3AC in most trains is deplorable, even 5 years back it was good. I can’t even travel below 2AC now. Sleeper class has become the new general compartment. Many trains that were closed during the pandemic haven’t returned to the tracks or following a regular schedule. Again i say just cause something is shiny doesn’t mean it’s valuable. GoI needs to invest heavily in improving facilities for lower and middle income passengers who are majority train users. That segment is getting ignored. I would vote for Jaishankar if he was BJP prez and Tharoor if he became Congress Prez. they're both capable professionals. Both of them are better than some old gandhi puppet who made his own son an MLA . Then you’re an exception. It’s very simple when your opponent wants to pick your party’s president they aren’t doing it cause they want a fair competition, they’re doing it cause they feel they’ll be easy to handle. I can guarantee you the recent boost in electoral profile that Cong has got with wins in Himachal & Karnataka wouldn’t be possible without Kharge as president. His appointment is probably the best decision Congress has made in the last decade. > a slight improvement on existing express trains just a shinier and glossier versions What? VBs are much faster, they reduced the travel time in many cases and even with poor curved tracks run at an average of 83 KM/s which is significantly faster than most indian trains and they have a safer indigenously developed braking system. there are plans to introduce sleeper VBs, chair car VBs and Vande Metro. It's also completely different from regular indian trains that have a single engine, every single VB coach has it's own engine. a design comparable to Mumbai locals, except the locals are nowhere as fast. as of now, they are still niche. but 400 more are planned within the next 3 years plus introducing stuff like this is important, it may not be useful now but it will set a good precedent for the future especially considering that the govt is paralleling improving the tracks as well so that the train speed increases. People in my village don't even know who is Tharoor. You should compare the travel time of VBs with Shatabdis. The difference is barely noticeable. Maybe it’s the tracks but fact is VBs aren’t a major leap forward travel time wise compared to a shatabdi. As for future plans we will see when it happens but as of now Railway service absolutely sucks. Don’t believe me, try travelling by a sleeper coach or 3 AC now. You’ll find out. Also the Kavach program the much touted anti collision system that GoI has promoted. They’ve barely implemented it, less than 2 percent implementation. Yet they’re focusing so much on PR. Congress will find less than zero success in Bengal siding against TMC , like any other party would. You probably do not live here and have little to no idea as to why people have still kept her in power. That is exactly what congress tried during the last state elections and along with it's coalition came in third behind a bjp by a margin soo large, that only TMC could secure a comparably larger margin surpassing BJP in turn. There is no success for a party in Bengal currently siding against the TMC. Anyone stating otherwise either does not reside in Bengal or has absolutely no idea what they are talking about. Dude i’m a Bengali and a voter of WB. So let me put it this way, in WB there are two types of voters, pro mamata & anti mamata. Pro mamata voters obliviously vote TMC, anti mamata voters are scattered among Cong, Left, BJP with BJP being primary opposition on paper for now as per 2021 VS. But BJP has no natural voter base, most BJP voters are disgruntled Left & Cong voters who suffered after 2016 election loss, they again suffered at the hands of TMC in 2021 election loss. Right now mostly are undecided. In the last municipal elections in 2021 BJP came in 3rd to left front, even though left front barely put in an effort. In the last 1 year both left and Cong have regrouped significantly and right now are in good steed. BJP is strong only in Jangalmahal area and North Bengal, for rest their organisation has collapsed. If in upcoming panchayat elections Left & Cong do well then BJP will lose even more voters. TMC has massive anti incumbency and if Cong ally with TMC( left will never ally with them) they will absorb that anti incumbency, plain and simple. Stop judging current political situation with 2021 VS. That was a wave election and that wave is a puddle now with BJP’s loss. Edit: check the nominations list and see who are the primary opposition to TMC in the upcoming panchayat elections district wise. You’ll have an idea which party is at what stage. Your entire argument becomes completely pointless the moment you realise the number people voting for TMC, regardless of their love for the party itself, completely overwhelm those that simply hate the party because of Mamata in numbers. Compared to those in in favour of TMC the anti Mamata group is insignificant. Panchayat elections should not even be brought into these arguments. There is no reason for Congress to stand in the elections against TMC again when siding with them will guarantee them either of Punjab or WB. Victory and territory is the foremost priority for them right now. Details like anti incumbency can ve addressed after gaining significant success next General Elections. I agree with you saying Congress is more favourable currently compared to BJP. Seems like the appeal for Rahul Gandhi is more than ever before. Regardless of who Congress makes the mistake of siding with, no time like now to pass BJP in Bengal as the runner party. Something they will most certainly regret absolutely is not taking ANY kind of appropriate action now when the time was arguably best in years in Bengal. There are only 21 shatabdis in India. There are 400 Vande Bharats planned for the 3 next years alone and already 18 currently working. The scale at which work is being planned by the current govt is far better than the previous govt who set up a measly 21 shatabdis in 70 years of governance. I travel by 3AC every other week and that too, my trips are usually 20-23 hours. I really don't see anything worse than how it was pre 2014. 2% implementation is 1,455 KM of tracks. Do you think it'll be easy to install it 100% in the most extensive railway network in the world? Even a developed country would require years of planning and manpower to accomplish this. Vande Bharat has a niche customer base. With the ticket prices I can guarantee you it would be useless to 90 percent of the long distance passengers. So you can beat the Vande Bharat drum all you want. Primary focus should be improving low cost train services not rolling out premium trains. Buddy 10 years back i could travel in a sleeper relatively comfortably and I frequently did for 6-7 hour trips, can’t even do that nowadays, it’s that bad. The Rajasthan-Howrah route has less trains now then it had 10 years back, that’s a fact. You can go on about Vande Bharat all you want, really doesn’t matter, cause it’s like saying we have less unemployment cause sales of IPhone has increased, there is no actual correlation. I agree it would take time & effort to implement kavach program completely so maybe do less PR on it or wait till at-least 50 percent completion. There is a solid 40-45 percent anti Mamata voter base, that is for the taking, if Cong allies with TMC Cong will lose out on that share cause anyone who allies with TMC won’t get a single vote from that pot. With the best hope being LF getting majority of the pot. And panchayat elections do matter. There is a reason Mamata Banerjee is campaigning for a panchayat elections for the first time since becoming CM, she knows it’s importance. This election has the potential to change the political landscape of WB, just like in 2018 when sheer level of political brutality from TMC and left front’s inaction made BJP the primary opposition in WB. Left front is on the rise, even BJP has sensed it that’s why they are running around HC to have the election cancelled cause if Left does well they’ll lose vote share. Last but not least TMC has made it clear that they want Cong to step aside from elections in WB altogether and let TMC fight alone, that’s something will not be acceptable to WB Congress leadership and rightly so. I doubt TMC will give up their organisation in Malda, Murshidabad & Dinajpur area. Heck they even lured in ex-Congress MLA Byron Biswas. TMC isn’t trustworthy at all. And aligning with TMC will help in Punjab? 😂😂 that’s just laughable. I doubt anyone gives a sh!t about TMC in Punjab. Imo Cong + Left fight together with TMC being the main opponent, push BJP to no 3. That will be the best result for everyone involved. Dude is just a tiktok warrior with a smug punch able face. Tharoor worked for the UN, and contested elections"
}