{
    "id": "15azocr",
    "title": "India will be in top 3 economies of the world!",
    "url": "https://www.reddit.com/r/india/comments/15azocr/india_will_be_in_top_3_economies_of_the_world/",
    "selftext": "As guaranteed by our PM that India will in top 3 economies in the world which is at 6th right now. Dont you guys think that we should talk about per capita GDP instead of overall. Same is with China its second largest economies but the per capita is lower than even the following countries on that list.\n\n&#x200B;\n\nhttps://preview.redd.it/4t123iz8wheb1.png?width=913&format=png&auto=webp&s=410ac9321ffb303644d96289b2c7a48fd9c92599",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690458257.0,
    "convurl": "https://b.thumbs.redditmedia.com/XJF3VeYD1Rx20k_Bx_gHDGVtnZQYJohEWsMu5u4ZAsY.jpg",
    "comments": [
        "It’s fifth right now. We have overtaken UK.",
        "Remember, 5$ trillion economy by 2024-25. I guess, it got pushed back 5 more years.\n\nhttps://thewire.in/economy/five-trillion-dollar-economy-india",
        "You should really watch Hera Pheri 2. That had a similar scheme as well.",
        "GDP tells you the global value of the country. It also tells you how much economic power a country has to bully other countries. \n\nFor example Luxembourg has a GDP per capita over a 100,000$ but can be replaced overnight if need be and drop their GDP to 0. The same cant be done to china india or even Bangladesh. Because of the value of services they bring in to the world also kNown as GDP. \n\nSo yes, GDP per capita is an important metric to check the economic progress of the country. But GDP is more important figure Because it directly correlates to the power a country has.",
        " 2 years of COVID. I think we can reach there by 2026-27",
        "Bullshit to the next level",
        "GDP per capita is related to the overall GDP.\n\n\nLet's understand it with the help of a simple formula:\n\nGDP PER CAPITA = TOTAL POPULATION/ REAL GDP\n\nThis formula gives you the real per capita income (not adjusted). So, for the per capita income to increase, it is important for the GDP to increase because both of these terms are correlated. However, if we factor in the inequality/ discriminatory income distribution, it would definitely make an impact but it would be of a really small level.\n\n\nIn conclusion, if we really want to increase the per capita income, it is important for the Real GDP (GDP of the whole nation) to increase after considering the fact that we have a huge population.",
        "Also that's probably the average GDP per capita that is skewed by the ultra rich. The median would say something else.",
        "If we try, we can double the population one more time and become #1",
        "How would Median make much difference from Mean? Just curious",
        "Mean is the average of the whole, which is again a false representation. Median takes the average of the middle value(s) arranged in ascending or descending order, so it's fairer.",
        "Okay, but is likely to be similar to mean or no? \n\nNot a statistician, but have heard median makes more sense, not sure how.",
        "https://youtu.be/mk8tOD0t8M0",
        "Thanks.",
        "In simple terms the basic salaries of 90% of people might be from rs.10k to rs.50k (assuming only for this math), but if the top 10% makes multiples lakhs or crores in a month then it will look like all Indians are making a lakh per month if we add everyone's salary and divide by population. \n\nSo that's why it's not a good representation because if you were to randomly pick a person from the country there is 90% chance you'll pick someone not making that best amount of salary which we got from average calculation. Median is basically the exact middle value if we arrange all salaries in ascending order which is irrelevant from what the top 10% makes."
    ],
    "cleaned_text": "india top economies world guaranteed pm india top economies world th right dont guys think talk per capita gdp instead overall china second largest economies per capita lower even following countries list xb ",
    "cleaned_title": "india top economies world",
    "cleaned_selftext": "guaranteed pm india top economies world th right dont guys think talk per capita gdp instead overall china second largest economies per capita lower even following countries list xb",
    "cleaned_comments": "fifth right overtaken uk remember trillion economy guess got pushed back years really watch hera pheri similar scheme well gdp tells global value country also tells much economic power country bully countries example luxembourg gdp per capita replaced overnight need drop gdp cant done china india even bangladesh value services bring world also known gdp yes gdp per capita important metric check economic progress country gdp important figure directly correlates power country years covid think reach bullshit next level gdp per capita related overall gdp lets understand help simple formula gdp per capita total population real gdp formula gives real per capita income adjusted per capita income increase important gdp increase terms correlated however factor inequality discriminatory income distribution would definitely make impact would really small level conclusion really want increase per capita income important real gdp gdp whole nation increase considering fact huge population also thats probably average gdp per capita skewed ultra rich median would say something else try double population one time become would median make much difference mean curious mean average whole false representation median takes average middle values arranged ascending descending order fairer okay likely similar mean statistician heard median makes sense sure thanks simple terms basic salaries people might rsk rsk assuming math top makes multiples lakhs crores month look like indians making lakh per month add everyones salary divide population thats good representation randomly pick person country chance youll pick someone making best amount salary got average calculation median basically exact middle value arrange salaries ascending order irrelevant top makes",
    "light_cleaned_title": "India will be in top 3 economies of the world!",
    "light_cleaned_selftext": "As guaranteed by our PM that India will in top 3 economies in the world which is at 6th right now. Dont you guys think that we should talk about per capita GDP instead of overall. Same is with China its second largest economies but the per capita is lower than even the following countries on that list. &#x200B;",
    "light_cleaned_comments": "It’s fifth right now. We have overtaken UK. Remember, 5$ trillion economy by 2024-25. I guess, it got pushed back 5 more years. You should really watch Hera Pheri 2. That had a similar scheme as well. GDP tells you the global value of the country. It also tells you how much economic power a country has to bully other countries. For example Luxembourg has a GDP per capita over a 100,000$ but can be replaced overnight if need be and drop their GDP to 0. The same cant be done to china india or even Bangladesh. Because of the value of services they bring in to the world also kNown as GDP. So yes, GDP per capita is an important metric to check the economic progress of the country. But GDP is more important figure Because it directly correlates to the power a country has. 2 years of COVID. I think we can reach there by 2026-27 Bullshit to the next level GDP per capita is related to the overall GDP. Let's understand it with the help of a simple formula: GDP PER CAPITA = TOTAL POPULATION/ REAL GDP This formula gives you the real per capita income (not adjusted). So, for the per capita income to increase, it is important for the GDP to increase because both of these terms are correlated. However, if we factor in the inequality/ discriminatory income distribution, it would definitely make an impact but it would be of a really small level. In conclusion, if we really want to increase the per capita income, it is important for the Real GDP (GDP of the whole nation) to increase after considering the fact that we have a huge population. Also that's probably the average GDP per capita that is skewed by the ultra rich. The median would say something else. If we try, we can double the population one more time and become #1 How would Median make much difference from Mean? Just curious Mean is the average of the whole, which is again a false representation. Median takes the average of the middle value(s) arranged in ascending or descending order, so it's fairer. Okay, but is likely to be similar to mean or no? Not a statistician, but have heard median makes more sense, not sure how. Thanks. In simple terms the basic salaries of 90% of people might be from rs.10k to rs.50k (assuming only for this math), but if the top 10% makes multiples lakhs or crores in a month then it will look like all Indians are making a lakh per month if we add everyone's salary and divide by population. So that's why it's not a good representation because if you were to randomly pick a person from the country there is 90% chance you'll pick someone not making that best amount of salary which we got from average calculation. Median is basically the exact middle value if we arrange all salaries in ascending order which is irrelevant from what the top 10% makes."
}