{
    "id": "15jmavx",
    "title": "LG UHD TV Backlight bleeding. Is this normal?",
    "url": "https://www.reddit.com/gallery/15jmavx",
    "selftext": "I purchased this LG 65-inch 4K TV last week from an offline store. The 4K content looks fantastic, however, when watching anything dark, I notice horrible backlight bleeding all around the screen and the contrast is also pretty bad. Is this normal behavior for an IPS panel, or should I request a refund? My old Sony TV also had an IPS panel, but it had no issues like this AFAIK. I'm not sure how refunds or returns work since I bought it from an offline store. Any help would be appreciated.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691317655.0,
    "convurl": "https://i.redd.it/5trfadaqvggb1.png",
    "comments": [
        "This is a result of flex in the panel while transporting and installation of the TV.   When you use the Tv it will warm up and the heat will cause it to readjust on its own.\n\nUse it for sometime and if it doesn solve within 2-3 weeks contact the store and ask for replacement. I got mine replaced.",
        "This would trigger me a lot",
        "Agreed. It normally takes 1-2 weeks to fully adapt. Anything more than that, replace it under warranty.",
        "Unpopular method ...but I actually did a cloth wipe on my TV panel with gentle pressure. It reduced the bleed drastically for me. \nUse this method at your own risk tho."
    ],
    "cleaned_text": "lg uhd tv backlight bleeding normal purchased lg inch k tv last week offline store k content looks fantastic however watching anything dark notice horrible backlight bleeding around screen contrast also pretty bad normal behavior ips panel request refund old sony tv also ips panel issues like afaik im sure refunds returns work since bought offline store help would appreciated ",
    "cleaned_title": "lg uhd tv backlight bleeding normal",
    "cleaned_selftext": "purchased lg inch k tv last week offline store k content looks fantastic however watching anything dark notice horrible backlight bleeding around screen contrast also pretty bad normal behavior ips panel request refund old sony tv also ips panel issues like afaik im sure refunds returns work since bought offline store help would appreciated",
    "cleaned_comments": "result flex panel transporting installation tv use tv warm heat cause readjust use sometime solve within weeks contact store ask replacement got mine replaced would trigger lot agreed normally takes weeks fully adapt anything replace warranty unpopular method actually cloth wipe tv panel gentle pressure reduced bleed drastically use method risk tho",
    "light_cleaned_title": "LG UHD TV Backlight bleeding. Is this normal?",
    "light_cleaned_selftext": "I purchased this LG 65-inch 4K TV last week from an offline store. The 4K content looks fantastic, however, when watching anything dark, I notice horrible backlight bleeding all around the screen and the contrast is also pretty bad. Is this normal behavior for an IPS panel, or should I request a refund? My old Sony TV also had an IPS panel, but it had no issues like this AFAIK. I'm not sure how refunds or returns work since I bought it from an offline store. Any help would be appreciated.",
    "light_cleaned_comments": "This is a result of flex in the panel while transporting and installation of the TV. When you use the Tv it will warm up and the heat will cause it to readjust on its own. Use it for sometime and if it doesn solve within 2-3 weeks contact the store and ask for replacement. I got mine replaced. This would trigger me a lot Agreed. It normally takes 1-2 weeks to fully adapt. Anything more than that, replace it under warranty. Unpopular method ...but I actually did a cloth wipe on my TV panel with gentle pressure. It reduced the bleed drastically for me. Use this method at your own risk tho."
}