{
    "id": "13a397b",
    "title": "What were these islands north of Saurashtra and how did they disappear ?",
    "url": "https://www.reddit.com/r/india/comments/13a397b/what_were_these_islands_north_of_saurashtra_and/",
    "selftext": "First, greetings to you all and thanks for the time you give to read this post and, fortunately, answer me if you can.\n\nSo, to expose my question, in multiple depictions of ancient Inda (at the time of Alexander the Great campaigns, at least), north of Saurashtra there are two islands. However, in maps from the modern era to modern satellite maps show no islands, and instead, a territory entirely part of the continent.\n\nMy question, thus, is what were these islands ? Did they really exist ? And if they did, how did they \"rejoin\" with the continent ?\n\n(I highlighted the islands on a map that showed them)\n\nhttps://preview.redd.it/ovrldp8v7aya1.jpg?width=800&format=pjpg&auto=webp&v=enabled&s=2eb7759fc6f0397b0eaed318f294acb2eb2a6717",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 5,
    "created_utc": 1683409749.0,
    "convurl": "https://b.thumbs.redditmedia.com/81Qp35rAniinuoFydjTCivd6oyZoJGFhqSrxxHdZM8o.jpg",
    "comments": [
        "Are you sure it isn't a printing error?",
        "https://www.reddit.com/r/india/comments/12acxri/why_is_kutch_shown_as_an_island_in_historical/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button",
        "No, Kutch used to be an island before",
        "Ah thank you !"
    ],
    "cleaned_text": "islands north saurashtra disappear first greetings thanks time give read post fortunately answer expose question multiple depictions ancient inda time alexander great campaigns least north saurashtra two islands however maps modern era modern satellite maps show islands instead territory entirely part continent question thus islands really exist rejoin continent highlighted islands map showed ",
    "cleaned_title": "islands north saurashtra disappear",
    "cleaned_selftext": "first greetings thanks time give read post fortunately answer expose question multiple depictions ancient inda time alexander great campaigns least north saurashtra two islands however maps modern era modern satellite maps show islands instead territory entirely part continent question thus islands really exist rejoin continent highlighted islands map showed",
    "cleaned_comments": "sure isnt printing error kutch used island ah thank",
    "light_cleaned_title": "What were these islands north of Saurashtra and how did they disappear ?",
    "light_cleaned_selftext": "First, greetings to you all and thanks for the time you give to read this post and, fortunately, answer me if you can. So, to expose my question, in multiple depictions of ancient Inda (at the time of Alexander the Great campaigns, at least), north of Saurashtra there are two islands. However, in maps from the modern era to modern satellite maps show no islands, and instead, a territory entirely part of the continent. My question, thus, is what were these islands ? Did they really exist ? And if they did, how did they \"rejoin\" with the continent ? (I highlighted the islands on a map that showed them)",
    "light_cleaned_comments": "Are you sure it isn't a printing error? No, Kutch used to be an island before Ah thank you !"
}