{
    "id": "1600yzf",
    "title": "Unveiling the Tip of the Iceberg: Exploring India's Education System Through a Critical Lens",
    "url": "https://www.reddit.com/r/india/comments/1600yzf/unveiling_the_tip_of_the_iceberg_exploring_indias/",
    "selftext": "I came across a YouTube video ([https://www.youtube.com/watch?v=ycJa0--QL-Y](https://www.youtube.com/watch?v=ycJa0--QL-Y)) that delves into the shortcomings of India's education system. While the video raises valid points, it seems to only scratch the surface, leaving the much deeper complexities of the Indian education system unexplored. The issue runs far deeper than what's portrayed in the video, prompting the question: Why hasn't more substantial action been taken to address these systemic concerns?\n\nCould it be that the education system is entrenched in corruption, rendering it difficult to enact meaningful change? Or is the prevailing sentiment that if something isn't visibly broken, there's no need to fix it? The video hints at the grim reality where students either pass through the system or succumb to it. \n\nI invite a discussion in the comments about this pressing topic. It's possible that sharing this information might lead to a breakthrough. I have firsthand experience from both government and private schools, providing a wealth of insight. However, delving into these details might be fruitless, given the complexity of the issue.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692881142.0,
    "convurl": "https://external-preview.redd.it/vcHj9AUBi2njRDsTeaExawS7rPRBO5fxfoamQFtWILE.jpg?auto=webp&s=d2de478c6d5dbc9599d0bfd14674baa6944a1e16",
    "comments": [
        "Not another one.. ([https://www.youtube.com/watch?v=gAa03r\\_Wgv0](https://www.youtube.com/watch?v=gAa03r_Wgv0))",
        "The video in your post is pretty useless. There are too many complexities in the current educating system that he didn't touch upon and there is virtually no insight present.\n\nPersonally, I've found the people's fixation on elite institutions to be a severe flaw in the perception of our education system. Ravish Kumar once did a brilliant video on a college in Bihar where there were more than a thousand students but only 2 faculty members. Unless we fix this ground reality, the system at large will remain broken and dysfunctional.",
        "I disagree with the video. The key problem is the teacher-student ratio and lack of govt investment in the primary education system post-independence. We still pay shitty salaries to the primary teachers who have set out to create the foundation of children. Unfortunately, NEP is another blunder in making. It's designed to provide quality education only to those who have $$$$. Middle-class and poor won't be able to get any benefits out of NEP as govt is pushing education to private hands. NEP is just a clone of the US education system, but we don't have any infrastructure in the govt schools."
    ],
    "cleaned_text": "unveiling tip iceberg exploring indias education system critical lens came across youtube video httpswwwyoutubecomwatchvycjaqlyhttpswwwyoutubecomwatchvycjaqly delves shortcomings indias education system video raises valid points seems scratch surface leaving much deeper complexities indian education system unexplored issue runs far deeper whats portrayed video prompting question hasnt substantial action taken address systemic concerns could education system entrenched corruption rendering difficult enact meaningful change prevailing sentiment something isnt visibly broken theres need fix video hints grim reality students either pass system succumb invite discussion comments pressing topic possible sharing information might lead breakthrough firsthand experience government private schools providing wealth insight however delving details might fruitless given complexity issue ",
    "cleaned_title": "unveiling tip iceberg exploring indias education system critical lens",
    "cleaned_selftext": "came across youtube video httpswwwyoutubecomwatchvycjaqlyhttpswwwyoutubecomwatchvycjaqly delves shortcomings indias education system video raises valid points seems scratch surface leaving much deeper complexities indian education system unexplored issue runs far deeper whats portrayed video prompting question hasnt substantial action taken address systemic concerns could education system entrenched corruption rendering difficult enact meaningful change prevailing sentiment something isnt visibly broken theres need fix video hints grim reality students either pass system succumb invite discussion comments pressing topic possible sharing information might lead breakthrough firsthand experience government private schools providing wealth insight however delving details might fruitless given complexity issue",
    "cleaned_comments": "another one httpswwwyoutubecomwatchvgaarwgvhttpswwwyoutubecomwatchvgaarwgv video post pretty useless many complexities current educating system didnt touch upon virtually insight present personally ive found peoples fixation elite institutions severe flaw perception education system ravish kumar brilliant video college bihar thousand students faculty members unless fix ground reality system large remain broken dysfunctional disagree video key problem teacherstudent ratio lack govt investment primary education system postindependence still pay shitty salaries primary teachers set create foundation children unfortunately nep another blunder making designed provide quality education middleclass poor wont able get benefits nep govt pushing education private hands nep clone us education system dont infrastructure govt schools",
    "light_cleaned_title": "Unveiling the Tip of the Iceberg: Exploring India's Education System Through a Critical Lens",
    "light_cleaned_selftext": "I came across a YouTube video ([https://www.youtube.com/watch?v=ycJa0--QL-Y](https://www.youtube.com/watch?v=ycJa0--QL-Y)) that delves into the shortcomings of India's education system. While the video raises valid points, it seems to only scratch the surface, leaving the much deeper complexities of the Indian education system unexplored. The issue runs far deeper than what's portrayed in the video, prompting the question: Why hasn't more substantial action been taken to address these systemic concerns? Could it be that the education system is entrenched in corruption, rendering it difficult to enact meaningful change? Or is the prevailing sentiment that if something isn't visibly broken, there's no need to fix it? The video hints at the grim reality where students either pass through the system or succumb to it. I invite a discussion in the comments about this pressing topic. It's possible that sharing this information might lead to a breakthrough. I have firsthand experience from both government and private schools, providing a wealth of insight. However, delving into these details might be fruitless, given the complexity of the issue.",
    "light_cleaned_comments": "Not another one.. ([https://www.youtube.com/watch?v=gAa03r\\_Wgv0](https://www.youtube.com/watch?v=gAa03r_Wgv0)) The video in your post is pretty useless. There are too many complexities in the current educating system that he didn't touch upon and there is virtually no insight present. Personally, I've found the people's fixation on elite institutions to be a severe flaw in the perception of our education system. Ravish Kumar once did a brilliant video on a college in Bihar where there were more than a thousand students but only 2 faculty members. Unless we fix this ground reality, the system at large will remain broken and dysfunctional. I disagree with the video. The key problem is the teacher-student ratio and lack of govt investment in the primary education system post-independence. We still pay shitty salaries to the primary teachers who have set out to create the foundation of children. Unfortunately, NEP is another blunder in making. It's designed to provide quality education only to those who have $$$$. Middle-class and poor won't be able to get any benefits out of NEP as govt is pushing education to private hands. NEP is just a clone of the US education system, but we don't have any infrastructure in the govt schools."
}