{
    "id": "1d7r1tk",
    "title": "The pains of wanting books that are not published in India (ft. flipkart piraters, and review suppresing)",
    "url": "https://www.reddit.com/gallery/1d7r1tk",
    "selftext": "Situation: I'd read Ann Liang's 'If you could see the sun' in pdf in January (long live zlib), but I'd liked it enough that I was eyeing on buying it in physical copy. Turns out, her books are not published in India, and the imported versions are priced on average about 800rs. Lowest I could find was on bookswagon for about 550rs (not anymore). I'm a broke student, so I decided to wait a couple of months.\n\nRecently however, I happened to see a deal on Flipkart; 3 books by the author for 800rs. It is, in theory, a great deal. The seller reviews were at 4.5 stars. Ofc, it is a bit unbelievable, and I knew it was a gamble, but I decided to buy anyway.\n\nI failed the gamble lol.\n\nIn the mail came 3 'books', though they are more just fancy printouts. These people who've tried to counterfeit them haven't even tried. The back covers of all 3 books are pixelated. In one book, at the end of every chapter is a black line, and in some chapters that black line is Oceanofpdf.com underlined. In another book, you can see the hyperlinks to InDesign file names on the first page. In another, 7 \n\npage numbers would interrupt the reading flow just as demonstrated here, since they cut-copy-pasted even the page numbers. The contents page is very very clearly from an ebook.\n\nThe worst part? I've read the other 2 books now too ('This time it's Real' and 'I hope this doesn't find you') and I loved them both too. I could go on a tangent about why these books appealed to me so much but that's not the point. Now I want original proper copies of them too😭\n\nI called the Flipkart people but they only suggested a return lol. Worst part? the bad review I wrote DID NOT EVEN REFLECT ON THE PRODUCT PAGE. *This* is why the seller has a 4.5 star rating (DelhiBazzar btw, DONT BUY FROM THEM)\n\nPart of me considers if I should just keep these books to have a physical copy, but that really isn't the point isn't it? If I want just some source to read the books from, I could just refer the PDFs of them I have ready access to. The whole point of buying book in print is to support the author, and ofc as a valuable addition to my shelf. And I get that it sounds hypocritical when I spent 800rs on 3 books when clearly the books could've never been that cheap. Art really is a luxury lol. Look at me thinking about supporting artists and writers when I can't even support myself💀\n\nBuying the books in original from a place like bookswagon or Amazon, I can look at spending atleast 2k for all three of them combined. I really don't have that money right now bro. But ig I'll still return these books. I don't want to support these shameless piraters AND my 800rs is valuable. and I'm broke. But I really really like these books :( \n\nIf anyone knows where I can get Ann Liang's books for chea- I mean an affordable price, please let me know(because this work is worth more than that ik). Or if anyone here has her books and would like to sell them I VOLUNTEER TO BUY RAAHHH\n\nAlso, I haven't applied for return yet, but has anyone gotten a refund instead of a return for a similar book fiasco? (I'm being delulu here but I've written so much so I might as well ask) \n\nI also so badly wish that these books were published in India. Ik other book, comic, and manga lovers have similar struggles too, since an imported book is really expensive :(\n\nPFA: fake books proof and Flipkart scamass screenshots ugh\n\nThis was my first Flipkart order and I'm DEFINITELY NEVER BUYING ANYTHING SERIOUS FROM THEM EVER AGAIN ",
    "flair": "Rant / Vent",
    "score": 40,
    "num_comments": 14,
    "created_utc": 1717484646.0,
    "convurl": "https://i.redd.it/hrugx93l7i4d1.png",
    "comments": [
        "What happens if you click the links 😂",
        "it leads you to a state of irritation🤩",
        "This is exactly why collectors save up and buy from reliable sources like Amazon, you knew exactly what you were getting into, greed got the better of you. Try returning the books and asking for a refund, they do give refunds if the books are in original condition and you haven’t broken the spine in yet.",
        "I've started the return process! Definitely will save up for the OG copies",
        "There's really no way to find rare/niche books on a budget in India. If you live in Bangalore, visit Blossom Book House and you might get lucky. If not, your only alternative is to have friends/relatives living in the US. Even with $ prices, (used) books are affordable in the US. Look up your book on ViaLibri, it's a search engine for rare/used books that aggregates results from several used book sellers. Pick your edition, have it shipped to someone in the US, and then have them bring it over when they visit. Sometimes you can find good deals on used books on Amazon US too. I've filled up a fair chunk of my bookshelf with some rare books you can't find anywhere in India using these methods. \n\nAlso, rather than noting down the Flipkart seller's name, take note of the publisher of your bootleg copies. This sort of thing is rampant in India, there's an entire cottage industry of 'publishing houses' that simply download ePubs/PDFs from Project Gutenberg or wherever and print and sell them. Be careful when buying classics too, you'll see this practice there too. Always look up the book's ISBN and cross-check it on Goodreads to see if the edition you're looking at on Flipkart/Amazon has a valid ISBN. Most counterfeiters are too lazy to do their due diligence",
        "This is why I've gone back to visiting brick and mortar bookstores.",
        "Blossom is literally a jungle. It has so much variety, but it only helps if you know where to look, or you're lost. No relatives in the US for me (atleast not anyone close enough).\n\nWill definitely cross check ISBNs before buying, thank you sm for the tip!",
        "I'm a broke student as well and I ordered such books from Instagram stores. Granted, the copies I've received are decent. Only two books as of now (Bride and Forget Me Not) were problematic for me, alignment was wonky, printing was all over the place, size of books were questionable and the fonts were pressed and not spaced enough. Although the rest were fine. The bookstore situation in India is so pathetic, you hardly get good,new , trending books online, even if you do you gotta pay full price, discounts are never seen. I have a few list of Instagram bookstores that do good printings and whenever I want to buy books,I buy from them.",
        "But the decently printed copies would still be counterfeit no? I have no problem reading these books in this copy either, but it just feels wrong. \n\nThis was less asking for solutions and more of a rant. When authors sign to big publishers like puffin and Simon and Schuster, ofc it will be different from then partnering with a smaller publisher local to them. But with those bigger publishers, they actually legitimately print copies in india, and we can get them for between 250 to 450 rupees. And you're right about the book scene here, it's more illegal copies of the same 10 tiktok famous books than an actually good and vast collection of books. I'm fine paying full price but full price PLUS shipping costs makes for very expensive books. Let's just go and cry in a corner😭\n\nPlease do share the names of any instagram sellers who sell imported books!",
        "The only Instagram shop that sells imported and legitimate books is The Bibliophile Store. And maybe the TBB box but they take a long time to ship stuff. I ordered a special edition of Fourth Wing from TBB, and I received it after almost 8 months. However,The Bibliophile Store was perfect, took 2 weeks to ship, gave me a but discount, all in all a good experience. They have a good collection as well.",
        "oooh thank you for the recc, will check it out!",
        "Much worse with good textbooks. \n\nPost the DU xerox shop case, publishers are only selling versions tailored for Indian exams. Earlier you would get 'international student' versions with identical text but B&W images, printed on decent quality paper. Now horrible printing on thin, almost-transparent paper, and with sections cut out as they are 'out-of-syllabus'.\n\n[I have compared BSc/MSc-level physics/chemistry/biology textbooks only though]",
        "Zlib is a godsend!",
        "You might give this startup a try, you can request books too.\nhttps://padhegaindia.in/"
    ],
    "cleaned_text": "pains wanting books published india ft flipkart piraters review suppresing situation id read ann liangs could see sun pdf january long live zlib id liked enough eyeing buying physical copy turns books published india imported versions priced average rs lowest could find bookswagon rs anymore im broke student decided wait couple months recently however happened see deal flipkart books author rs theory great deal seller reviews stars ofc bit unbelievable knew gamble decided buy anyway failed gamble lol mail came books though fancy printouts people whove tried counterfeit havent even tried back covers books pixelated one book end every chapter black line chapters black line oceanofpdfcom underlined another book see hyperlinks indesign file names first page another page numbers would interrupt reading flow demonstrated since cutcopypasted even page numbers contents page clearly ebook worst part ive read books time real hope doesnt find loved could go tangent books appealed much thats point want original proper copies called flipkart people suggested return lol worst part bad review wrote even reflect product page seller star rating delhibazzar btw dont buy part considers keep books physical copy really isnt point isnt want source read books could refer pdfs ready access whole point buying book print support author ofc valuable addition shelf get sounds hypocritical spent rs books clearly books couldve never cheap art really luxury lol look thinking supporting artists writers cant even support buying books original place like bookswagon amazon look spending atleast k three combined really dont money right bro ig ill still return books dont want support shameless piraters rs valuable im broke really really like books anyone knows get ann liangs books chea mean affordable price please let knowbecause work worth ik anyone books would like sell volunteer buy raahhh also havent applied return yet anyone gotten refund instead return similar book fiasco im delulu ive written much might well ask also badly wish books published india ik book comic manga lovers similar struggles since imported book really expensive pfa fake books proof flipkart scamass screenshots ugh first flipkart order im definitely never buying anything serious ever ",
    "cleaned_title": "pains wanting books published india ft flipkart piraters review suppresing",
    "cleaned_selftext": "situation id read ann liangs could see sun pdf january long live zlib id liked enough eyeing buying physical copy turns books published india imported versions priced average rs lowest could find bookswagon rs anymore im broke student decided wait couple months recently however happened see deal flipkart books author rs theory great deal seller reviews stars ofc bit unbelievable knew gamble decided buy anyway failed gamble lol mail came books though fancy printouts people whove tried counterfeit havent even tried back covers books pixelated one book end every chapter black line chapters black line oceanofpdfcom underlined another book see hyperlinks indesign file names first page another page numbers would interrupt reading flow demonstrated since cutcopypasted even page numbers contents page clearly ebook worst part ive read books time real hope doesnt find loved could go tangent books appealed much thats point want original proper copies called flipkart people suggested return lol worst part bad review wrote even reflect product page seller star rating delhibazzar btw dont buy part considers keep books physical copy really isnt point isnt want source read books could refer pdfs ready access whole point buying book print support author ofc valuable addition shelf get sounds hypocritical spent rs books clearly books couldve never cheap art really luxury lol look thinking supporting artists writers cant even support buying books original place like bookswagon amazon look spending atleast k three combined really dont money right bro ig ill still return books dont want support shameless piraters rs valuable im broke really really like books anyone knows get ann liangs books chea mean affordable price please let knowbecause work worth ik anyone books would like sell volunteer buy raahhh also havent applied return yet anyone gotten refund instead return similar book fiasco im delulu ive written much might well ask also badly wish books published india ik book comic manga lovers similar struggles since imported book really expensive pfa fake books proof flipkart scamass screenshots ugh first flipkart order im definitely never buying anything serious ever",
    "cleaned_comments": "happens click links leads state irritation exactly collectors save buy reliable sources like amazon knew exactly getting greed got better try returning books asking refund give refunds books original condition havent broken spine yet ive started return process definitely save og copies theres really way find rareniche books budget india live bangalore visit blossom book house might get lucky alternative friendsrelatives living us even prices used books affordable us look book vialibri search engine rareused books aggregates results several used book sellers pick edition shipped someone us bring visit sometimes find good deals used books amazon us ive filled fair chunk bookshelf rare books cant find anywhere india using methods also rather noting flipkart sellers name take note publisher bootleg copies sort thing rampant india theres entire cottage industry publishing houses simply download epubspdfs project gutenberg wherever print sell careful buying classics youll see practice always look books isbn crosscheck goodreads see edition youre looking flipkartamazon valid isbn counterfeiters lazy due diligence ive gone back visiting brick mortar bookstores blossom literally jungle much variety helps know look youre lost relatives us atleast anyone close enough definitely cross check isbns buying thank sm tip im broke student well ordered books instagram stores granted copies ive received decent two books bride forget problematic alignment wonky printing place size books questionable fonts pressed spaced enough although rest fine bookstore situation india pathetic hardly get goodnew trending books online even got ta pay full price discounts never seen list instagram bookstores good printings whenever want buy booksi buy decently printed copies would still counterfeit problem reading books copy either feels wrong less asking solutions rant authors sign big publishers like puffin simon schuster ofc different partnering smaller publisher local bigger publishers actually legitimately print copies india get rupees youre right book scene illegal copies tiktok famous books actually good vast collection books im fine paying full price full price plus shipping costs makes expensive books lets go cry corner please share names instagram sellers sell imported books instagram shop sells imported legitimate books bibliophile store maybe tbb box take long time ship stuff ordered special edition fourth wing tbb received almost months howeverthe bibliophile store perfect took weeks ship gave discount good experience good collection well oooh thank recc check much worse good textbooks post du xerox shop case publishers selling versions tailored indian exams earlier would get international student versions identical text bw images printed decent quality paper horrible printing thin almosttransparent paper sections cut outofsyllabus compared bscmsclevel physicschemistrybiology textbooks though zlib godsend might give startup try request books",
    "light_cleaned_title": "The pains of wanting books that are not published in India (ft. flipkart piraters, and review suppresing)",
    "light_cleaned_selftext": "Situation: I'd read Ann Liang's 'If you could see the sun' in pdf in January (long live zlib), but I'd liked it enough that I was eyeing on buying it in physical copy. Turns out, her books are not published in India, and the imported versions are priced on average about 800rs. Lowest I could find was on bookswagon for about 550rs (not anymore). I'm a broke student, so I decided to wait a couple of months. Recently however, I happened to see a deal on Flipkart; 3 books by the author for 800rs. It is, in theory, a great deal. The seller reviews were at 4.5 stars. Ofc, it is a bit unbelievable, and I knew it was a gamble, but I decided to buy anyway. I failed the gamble lol. In the mail came 3 'books', though they are more just fancy printouts. These people who've tried to counterfeit them haven't even tried. The back covers of all 3 books are pixelated. In one book, at the end of every chapter is a black line, and in some chapters that black line is Oceanofpdf.com underlined. In another book, you can see the hyperlinks to InDesign file names on the first page. In another, 7 page numbers would interrupt the reading flow just as demonstrated here, since they cut-copy-pasted even the page numbers. The contents page is very very clearly from an ebook. The worst part? I've read the other 2 books now too ('This time it's Real' and 'I hope this doesn't find you') and I loved them both too. I could go on a tangent about why these books appealed to me so much but that's not the point. Now I want original proper copies of them too😭 I called the Flipkart people but they only suggested a return lol. Worst part? the bad review I wrote DID NOT EVEN REFLECT ON THE PRODUCT PAGE. *This* is why the seller has a 4.5 star rating (DelhiBazzar btw, DONT BUY FROM THEM) Part of me considers if I should just keep these books to have a physical copy, but that really isn't the point isn't it? If I want just some source to read the books from, I could just refer the PDFs of them I have ready access to. The whole point of buying book in print is to support the author, and ofc as a valuable addition to my shelf. And I get that it sounds hypocritical when I spent 800rs on 3 books when clearly the books could've never been that cheap. Art really is a luxury lol. Look at me thinking about supporting artists and writers when I can't even support myself💀 Buying the books in original from a place like bookswagon or Amazon, I can look at spending atleast 2k for all three of them combined. I really don't have that money right now bro. But ig I'll still return these books. I don't want to support these shameless piraters AND my 800rs is valuable. and I'm broke. But I really really like these books :( If anyone knows where I can get Ann Liang's books for chea- I mean an affordable price, please let me know(because this work is worth more than that ik). Or if anyone here has her books and would like to sell them I VOLUNTEER TO BUY RAAHHH Also, I haven't applied for return yet, but has anyone gotten a refund instead of a return for a similar book fiasco? (I'm being delulu here but I've written so much so I might as well ask) I also so badly wish that these books were published in India. Ik other book, comic, and manga lovers have similar struggles too, since an imported book is really expensive :( PFA: fake books proof and Flipkart scamass screenshots ugh This was my first Flipkart order and I'm DEFINITELY NEVER BUYING ANYTHING SERIOUS FROM THEM EVER AGAIN",
    "light_cleaned_comments": "What happens if you click the links 😂 it leads you to a state of irritation🤩 This is exactly why collectors save up and buy from reliable sources like Amazon, you knew exactly what you were getting into, greed got the better of you. Try returning the books and asking for a refund, they do give refunds if the books are in original condition and you haven’t broken the spine in yet. I've started the return process! Definitely will save up for the OG copies There's really no way to find rare/niche books on a budget in India. If you live in Bangalore, visit Blossom Book House and you might get lucky. If not, your only alternative is to have friends/relatives living in the US. Even with $ prices, (used) books are affordable in the US. Look up your book on ViaLibri, it's a search engine for rare/used books that aggregates results from several used book sellers. Pick your edition, have it shipped to someone in the US, and then have them bring it over when they visit. Sometimes you can find good deals on used books on Amazon US too. I've filled up a fair chunk of my bookshelf with some rare books you can't find anywhere in India using these methods. Also, rather than noting down the Flipkart seller's name, take note of the publisher of your bootleg copies. This sort of thing is rampant in India, there's an entire cottage industry of 'publishing houses' that simply download ePubs/PDFs from Project Gutenberg or wherever and print and sell them. Be careful when buying classics too, you'll see this practice there too. Always look up the book's ISBN and cross-check it on Goodreads to see if the edition you're looking at on Flipkart/Amazon has a valid ISBN. Most counterfeiters are too lazy to do their due diligence This is why I've gone back to visiting brick and mortar bookstores. Blossom is literally a jungle. It has so much variety, but it only helps if you know where to look, or you're lost. No relatives in the US for me (atleast not anyone close enough). Will definitely cross check ISBNs before buying, thank you sm for the tip! I'm a broke student as well and I ordered such books from Instagram stores. Granted, the copies I've received are decent. Only two books as of now (Bride and Forget Me Not) were problematic for me, alignment was wonky, printing was all over the place, size of books were questionable and the fonts were pressed and not spaced enough. Although the rest were fine. The bookstore situation in India is so pathetic, you hardly get good,new , trending books online, even if you do you gotta pay full price, discounts are never seen. I have a few list of Instagram bookstores that do good printings and whenever I want to buy books,I buy from them. But the decently printed copies would still be counterfeit no? I have no problem reading these books in this copy either, but it just feels wrong. This was less asking for solutions and more of a rant. When authors sign to big publishers like puffin and Simon and Schuster, ofc it will be different from then partnering with a smaller publisher local to them. But with those bigger publishers, they actually legitimately print copies in india, and we can get them for between 250 to 450 rupees. And you're right about the book scene here, it's more illegal copies of the same 10 tiktok famous books than an actually good and vast collection of books. I'm fine paying full price but full price PLUS shipping costs makes for very expensive books. Let's just go and cry in a corner😭 Please do share the names of any instagram sellers who sell imported books! The only Instagram shop that sells imported and legitimate books is The Bibliophile Store. And maybe the TBB box but they take a long time to ship stuff. I ordered a special edition of Fourth Wing from TBB, and I received it after almost 8 months. However,The Bibliophile Store was perfect, took 2 weeks to ship, gave me a but discount, all in all a good experience. They have a good collection as well. oooh thank you for the recc, will check it out! Much worse with good textbooks. Post the DU xerox shop case, publishers are only selling versions tailored for Indian exams. Earlier you would get 'international student' versions with identical text but B&W images, printed on decent quality paper. Now horrible printing on thin, almost-transparent paper, and with sections cut out as they are 'out-of-syllabus'. [I have compared BSc/MSc-level physics/chemistry/biology textbooks only though] Zlib is a godsend! You might give this startup a try, you can request books too."
}