{
    "id": "1e5os8h",
    "title": "Got Duped of ₹12000.",
    "url": "https://www.reddit.com/gallery/1e5os8h",
    "selftext": "So guys everyone must have, by now, heard of the post office scam, wherein they send you a message that some parcel of yours is to be delivered but due to some reason the attempt to delivery failed.\nNow generally I am cautious of such scams and make sure that I double check everything, but this time due to some lapses on my part I almost got robbed.\n\nOn 29/06/24 I got a message supposedly from India Post regarding failed delivery attempt on my parcel. \n\nNow why did I believed in that message?\nBecause I have recently got selected in a govt job and I was expecting  delivery of my appointment letter but to my bad luck my father got transferred to a different location(He is also a govt employee, so transfers happen all of a sudden) and i received this message when we shifted to this new city.\n\nNow after receiving this message I clicked on the link and that link took me the page where I had to update my location and I put my new address there. After that they asked me to pay some as a fee,( now as I was already worried about the appointment letter) I put all my card details on that site and tried making payment, received a message that your location has been updated.\n\nBut then I told my siblings about this thing and they said “ post office normally call you whenever delivery fails and they communicate through official route as well” now after listing to this I realised, that I should check on the Internet and now I saw so many people who got similar type of messages and later India post also clarified that no such messages are sent from there side.\n\nAfter reading this I went my banks Application and disabled everything from net banking to Debit card.\nNow on 17-07-2024 I received a message that a tap and pay transaction of ₹ 11850 has been declined and immediately I understood that those people tried to rob money from my account but thank god that nothing happened thanks to my siblings and the bank.\n\nPlease be very careful while using anything online.\nसावधान रहे सतर्क रहे।\n",
    "flair": "Crime",
    "score": 23,
    "num_comments": 17,
    "created_utc": 1721239134.0,
    "convurl": "https://i.redd.it/ycprfffnb4dd1.jpg",
    "comments": [
        "Thanks for the information really useful",
        "bhai link google kar leta .vip is not official domain always check .gov.in. Go some security training",
        "Did your card got stolen or something or they have it in their possession? I mean, how can online transactions be performed using tap and pay? As far as I know, tap and pay only works with physical debit/credit card or an NFC supported smart watch at a POS machine.",
        "card cloning..but that still needs physical card first",
        "block the card immediately and get a new one and CHILL !",
        "Lucky you! This scam has been in news everywhere recently.. being updated is useful.",
        "No, you did not get duped. Could you stop hyping it up?",
        "It happened with me, those useless employees of Post office returned my renewed Debit card to the sender and added a note **\"Address was inappropriate\"**. My whole address was written on that package ( You know bank letter contains the whole address).\n\nThen I asked the post master why did you return my letter when my address was written on it. He replied \" I don't care\"\n\nI paid penalty money to the bank for this stupidity of the Post office.",
        "There are serious leaks with Indiapost. Someone in my family sent me a parcel, I got a text message with very similar content and a URL to rectify the address. Fortunately, I spotted the link right before deciding on clicking it.\n\nMoral of the story - verify the URL before proceeding.\n\nIf it’s through an email click the small arrow or details button right beside the sender to check the source of the email/ sender no matter what the name of the sender says. Mark email as fishing immediately.\n\nFor any other form when link is not visible right click and copy link location or address, paste it on a notepad and check the url.",
        "I got a link and filled it with the choicest vulgar abuses.",
        "Cards don't need to be physically present now, Samsung pay, and similar apps allow you to pay via tap and pay, you just have to add and verify the card once. This would be my guess on what happened here. \n\nMost likely when the OP received OTP to verify the transaction, it would have been actually to verify it to link the card to such app."
    ],
    "cleaned_text": "got duped guys everyone must heard post office scam wherein send message parcel delivered due reason attempt delivery failed generally cautious scams make sure double check everything time due lapses part almost got robbed got message supposedly india post regarding failed delivery attempt parcel believed message recently got selected govt job expecting delivery appointment letter bad luck father got transferred different locationhe also govt employee transfers happen sudden received message shifted new city receiving message clicked link link took page update location put new address asked pay fee already worried appointment letter put card details site tried making payment received message location updated told siblings thing said post office normally call whenever delivery fails communicate official route well listing realised check internet saw many people got similar type messages later india post also clarified messages sent side reading went banks application disabled everything net banking debit card received message tap pay transaction declined immediately understood people tried rob money account thank god nothing happened thanks siblings bank please careful using anything online ",
    "cleaned_title": "got duped",
    "cleaned_selftext": "guys everyone must heard post office scam wherein send message parcel delivered due reason attempt delivery failed generally cautious scams make sure double check everything time due lapses part almost got robbed got message supposedly india post regarding failed delivery attempt parcel believed message recently got selected govt job expecting delivery appointment letter bad luck father got transferred different locationhe also govt employee transfers happen sudden received message shifted new city receiving message clicked link link took page update location put new address asked pay fee already worried appointment letter put card details site tried making payment received message location updated told siblings thing said post office normally call whenever delivery fails communicate official route well listing realised check internet saw many people got similar type messages later india post also clarified messages sent side reading went banks application disabled everything net banking debit card received message tap pay transaction declined immediately understood people tried rob money account thank god nothing happened thanks siblings bank please careful using anything online",
    "cleaned_comments": "thanks information really useful bhai link google kar leta vip official domain always check govin go security training card got stolen something possession mean online transactions performed using tap pay far know tap pay works physical debitcredit card nfc supported smart watch pos machine card cloningbut still needs physical card first block card immediately get new one chill lucky scam news everywhere recently updated useful get duped could stop hyping happened useless employees post office returned renewed debit card sender added note address inappropriate whole address written package know bank letter contains whole address asked post master return letter address written replied dont care paid penalty money bank stupidity post office serious leaks indiapost someone family sent parcel got text message similar content url rectify address fortunately spotted link right deciding clicking moral story verify url proceeding email click small arrow details button right beside sender check source email sender matter name sender says mark email fishing immediately form link visible right click copy link location address paste notepad check url got link filled choicest vulgar abuses cards dont need physically present samsung pay similar apps allow pay via tap pay add verify card would guess happened likely op received otp verify transaction would actually verify link card app",
    "light_cleaned_title": "Got Duped of ₹12000.",
    "light_cleaned_selftext": "So guys everyone must have, by now, heard of the post office scam, wherein they send you a message that some parcel of yours is to be delivered but due to some reason the attempt to delivery failed. Now generally I am cautious of such scams and make sure that I double check everything, but this time due to some lapses on my part I almost got robbed. On 29/06/24 I got a message supposedly from India Post regarding failed delivery attempt on my parcel. Now why did I believed in that message? Because I have recently got selected in a govt job and I was expecting delivery of my appointment letter but to my bad luck my father got transferred to a different location(He is also a govt employee, so transfers happen all of a sudden) and i received this message when we shifted to this new city. Now after receiving this message I clicked on the link and that link took me the page where I had to update my location and I put my new address there. After that they asked me to pay some as a fee,( now as I was already worried about the appointment letter) I put all my card details on that site and tried making payment, received a message that your location has been updated. But then I told my siblings about this thing and they said “ post office normally call you whenever delivery fails and they communicate through official route as well” now after listing to this I realised, that I should check on the Internet and now I saw so many people who got similar type of messages and later India post also clarified that no such messages are sent from there side. After reading this I went my banks Application and disabled everything from net banking to Debit card. Now on 17-07-2024 I received a message that a tap and pay transaction of ₹ 11850 has been declined and immediately I understood that those people tried to rob money from my account but thank god that nothing happened thanks to my siblings and the bank. Please be very careful while using anything online. सावधान रहे सतर्क रहे।",
    "light_cleaned_comments": "Thanks for the information really useful bhai link google kar leta .vip is not official domain always check .gov.in. Go some security training Did your card got stolen or something or they have it in their possession? I mean, how can online transactions be performed using tap and pay? As far as I know, tap and pay only works with physical debit/credit card or an NFC supported smart watch at a POS machine. card cloning..but that still needs physical card first block the card immediately and get a new one and CHILL ! Lucky you! This scam has been in news everywhere recently.. being updated is useful. No, you did not get duped. Could you stop hyping it up? It happened with me, those useless employees of Post office returned my renewed Debit card to the sender and added a note **\"Address was inappropriate\"**. My whole address was written on that package ( You know bank letter contains the whole address). Then I asked the post master why did you return my letter when my address was written on it. He replied \" I don't care\" I paid penalty money to the bank for this stupidity of the Post office. There are serious leaks with Indiapost. Someone in my family sent me a parcel, I got a text message with very similar content and a URL to rectify the address. Fortunately, I spotted the link right before deciding on clicking it. Moral of the story - verify the URL before proceeding. If it’s through an email click the small arrow or details button right beside the sender to check the source of the email/ sender no matter what the name of the sender says. Mark email as fishing immediately. For any other form when link is not visible right click and copy link location or address, paste it on a notepad and check the url. I got a link and filled it with the choicest vulgar abuses. Cards don't need to be physically present now, Samsung pay, and similar apps allow you to pay via tap and pay, you just have to add and verify the card once. This would be my guess on what happened here. Most likely when the OP received OTP to verify the transaction, it would have been actually to verify it to link the card to such app."
}