{
    "id": "wsuqye",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/wsuqye/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 31,
    "num_comments": 43,
    "created_utc": 1660959010,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "I recently watched \"Fight club\" and \"Shutter Island\". And it was awesome, i really liked climax. Please let me know movies of similar genre.",
        "Can try american psycho",
        "Looking for something dark/violence/horror/gore like penny dreadful. Any suggestions?",
        "Better Call Saul finale lived up to expectations.",
        "I’m currently watching Masaba Masaba season 1",
        "The chaser, wailing, i saw the devil, yellow sea, the audition\n\n the gift,",
        "I’m a bit late to it but Spy x Family was a blast!",
        "The sandman is dope ! Go watch it.",
        "If you like Edward Norton then you can try Primal Fear.",
        "Watched *Sita Ramam*. It was great !",
        "If you liked shutter island, you can try dreamhouse, searching",
        "I currently saw DAVE on Disney. It's based on the rapper Lil dicky by the same name. \n\nit's a comedy, but has some depth.",
        "Loved watching Ginny&amp;Georgia recently. Can't wait for the next season.",
        "I have watched couple of tv shows this year and some highly recommended shows are.\n\n1. Sandman (Netflix) - Fantasy\n2. Terminal List (Amazon) - Action\n3. Slow horse (Apple tv+) - Espionage\n4. Jack Ryan (Amazon) - Espionage\n5. Severance (Apple tv+) - Thriller\n6. Reacher (Amazon) - Based on the novel of the same name (You may have seen the Jack reacher movie starring tom cruise). Believe me this show is a 10 times better than the movie, great plot, great action and there is a new season in production. Must check.\n7. Bosch: Legacy (Spin-off/ Sequel) to the Bosch TV series and equally good. I highly recommend this show if you like watching police detective shows.",
        "Who is this hottie? https://i.imgur.com/DMJ7D1y.png",
        "I've been watching Mindhunter on Netflix. The cinematography, the screenplay, the acting is so beautiful, but then they didn't include John Wayne Gacy and I'm f**n angry.",
        "'Orphan: first kill' , was pretty decent..\n\n  \n\n\nAlso, \"Prey\" was really good, great prequel to \"The Predator\"",
        "I watched Thallumaala and it was an absolutely wild ride, Musical/romance/action all in one.",
        "Succession is really good show, easily the top 5 best shows currently running.",
        "The machinist,\nOld boy (korean one),\nGone Girl,\nDonnie Darko,\nThe prestige,\nThe Truman show",
        "Can't believe they pulled it off again!  \nP.S. Got any suggestions for shows now that BCS is over? I don't watch a lot of TV dramas and haven't seen the wire &amp; the sopranos, which one's a better watch for those who appreciate Vince Gilligan's storytelling?",
        "So those of you who saw Jordan Peele's Nope, what do you think it was about?",
        "They're both different from BB and Breaking Bad. Still, watch them both. They're among the greatest shows ever made.",
        "Better Call Saul just ended and imo it is the best show on TV rn. The Bear, Only Murders In The Building are also really good.",
        "Just here to say that John Woo's Hard Boiled (1992) is one of the greatest action movies ever.",
        "Yeah, they've been on my watchlist forever, I still can't decide which one to watch first. BTW I'm not into binging or watching a lot of shows at once, I like to savor every episode, which makes it even harder to decide what to get obsessed with next.",
        "This is going to hurt - [https://www.imdb.com/title/tt8681148/](https://www.imdb.com/title/tt8681148/)\n\nHonestly, they are not lying about it.",
        "&gt;Reacher (Amazon) - Based on the novel of the same name (You may have seen the Jack reacher movie starring tom cruise). Believe me this show is a 10 times better than the movie, great plot, great action and there is a new season in production. Must check.\n\nReally? I've seen a few snippets of the main actor. It looked like god awful terrible cardboard acting!",
        "Endhada ithu type cheythe poori mone",
        "Currently watching the series - \"Only murders in the building\". Can recommend to watch!",
        "Currently loving the \"Drag And Dow foce Podcast\" based around F1. (The host shares my name too lmao) \nHe can be inconsistent some times, but he is good.\nRecommend \"Hungarian GP review\" episode...",
        "Watching old stuff.\nFrasier. \nOffice\nRewatched Fight Club.",
        "Dobaara. Great movie. I don't understand the hate for it in right wing subs but yes.",
        "Please don't judge it based on a few snippets. Are you the kind of person who likes a movie because the the actor is good looking on the poster and it's enticing?? \n\n&amp;#x200B;\n\nThe actor is a lot better than Tom cruise and the action scenes are absolutely brilliant. If you have read the novel, you would get to know that jack reacher is actually a 6ft+ guy with heavy muscle contrary to the movie starred Tom cruise. Give it a try please.",
        "Sherdil. It's a lovely commentary on our society, without trying too hard.",
        "Yeah, that's also great movie, I think I have to watch it again to understand it😂",
        "Okay, thanks for the suggestion, I will watch it soon",
        "\"I will put that on the list\" 🙌😂",
        "Thanks, I will watch them soon🙌😁"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "recently watched fight club shutter island awesome really liked climax please let know movies similar genre try american psycho looking something darkviolencehorrorgore like penny dreadful suggestions better call saul finale lived expectations im currently watching masaba masaba season chaser wailing saw devil yellow sea audition gift im bit late spy x family blast sandman dope go watch like edward norton try primal fear watched sita ramam great liked shutter island try dreamhouse searching currently saw dave disney based rapper lil dicky name comedy depth loved watching ginnyampgeorgia recently cant wait next season watched couple tv shows year highly recommended shows sandman netflix fantasy terminal list amazon action slow horse apple tv espionage jack ryan amazon espionage severance apple tv thriller reacher amazon based novel name may seen jack reacher movie starring tom cruise believe show times better movie great plot great action new season production must check bosch legacy spinoff sequel bosch tv series equally good highly recommend show like watching police detective shows hottie ive watching mindhunter netflix cinematography screenplay acting beautiful didnt include john wayne gacy im fn angry orphan first kill pretty decent also prey really good great prequel predator watched thallumaala absolutely wild ride musicalromanceaction one succession really good show easily top best shows currently running machinist old boy korean one gone girl donnie darko prestige truman show cant believe pulled ps got suggestions shows bcs dont watch lot tv dramas havent seen wire amp sopranos ones better watch appreciate vince gilligans storytelling saw jordan peeles nope think theyre different bb breaking bad still watch theyre among greatest shows ever made better call saul ended imo best show tv rn bear murders building also really good say john woos hard boiled one greatest action movies ever yeah theyve watchlist forever still cant decide one watch first btw im binging watching lot shows like savor every episode makes even harder decide get obsessed next going hurt httpswwwimdbcomtitletthttpswwwimdbcomtitlett honestly lying gtreacher amazon based novel name may seen jack reacher movie starring tom cruise believe show times better movie great plot great action new season production must check really ive seen snippets main actor looked like god awful terrible cardboard acting endhada ithu type cheythe poori mone currently watching series murders building recommend watch currently loving drag dow foce podcast based around f host shares name lmao inconsistent times good recommend hungarian gp review episode watching old stuff frasier office rewatched fight club dobaara great movie dont understand hate right wing subs yes please dont judge based snippets kind person likes movie actor good looking poster enticing ampxb actor lot better tom cruise action scenes absolutely brilliant read novel would get know jack reacher actually ft guy heavy muscle contrary movie starred tom cruise give try please sherdil lovely commentary society without trying hard yeah thats also great movie think watch understand okay thanks suggestion watch soon put list thanks watch soon",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "I recently watched \"Fight club\" and \"Shutter Island\". And it was awesome, i really liked climax. Please let me know movies of similar genre. Can try american psycho Looking for something dark/violence/horror/gore like penny dreadful. Any suggestions? Better Call Saul finale lived up to expectations. I’m currently watching Masaba Masaba season 1 The chaser, wailing, i saw the devil, yellow sea, the audition the gift, I’m a bit late to it but Spy x Family was a blast! The sandman is dope ! Go watch it. If you like Edward Norton then you can try Primal Fear. Watched *Sita Ramam*. It was great ! If you liked shutter island, you can try dreamhouse, searching I currently saw DAVE on Disney. It's based on the rapper Lil dicky by the same name. it's a comedy, but has some depth. Loved watching Ginny&amp;Georgia recently. Can't wait for the next season. I have watched couple of tv shows this year and some highly recommended shows are. 1. Sandman (Netflix) - Fantasy 2. Terminal List (Amazon) - Action 3. Slow horse (Apple tv+) - Espionage 4. Jack Ryan (Amazon) - Espionage 5. Severance (Apple tv+) - Thriller 6. Reacher (Amazon) - Based on the novel of the same name (You may have seen the Jack reacher movie starring tom cruise). Believe me this show is a 10 times better than the movie, great plot, great action and there is a new season in production. Must check. 7. Bosch: Legacy (Spin-off/ Sequel) to the Bosch TV series and equally good. I highly recommend this show if you like watching police detective shows. Who is this hottie? I've been watching Mindhunter on Netflix. The cinematography, the screenplay, the acting is so beautiful, but then they didn't include John Wayne Gacy and I'm f**n angry. 'Orphan: first kill' , was pretty decent.. Also, \"Prey\" was really good, great prequel to \"The Predator\" I watched Thallumaala and it was an absolutely wild ride, Musical/romance/action all in one. Succession is really good show, easily the top 5 best shows currently running. The machinist, Old boy (korean one), Gone Girl, Donnie Darko, The prestige, The Truman show Can't believe they pulled it off again! P.S. Got any suggestions for shows now that BCS is over? I don't watch a lot of TV dramas and haven't seen the wire &amp; the sopranos, which one's a better watch for those who appreciate Vince Gilligan's storytelling? So those of you who saw Jordan Peele's Nope, what do you think it was about? They're both different from BB and Breaking Bad. Still, watch them both. They're among the greatest shows ever made. Better Call Saul just ended and imo it is the best show on TV rn. The Bear, Only Murders In The Building are also really good. Just here to say that John Woo's Hard Boiled (1992) is one of the greatest action movies ever. Yeah, they've been on my watchlist forever, I still can't decide which one to watch first. BTW I'm not into binging or watching a lot of shows at once, I like to savor every episode, which makes it even harder to decide what to get obsessed with next. This is going to hurt - [https://www.imdb.com/title/tt8681148/](https://www.imdb.com/title/tt8681148/) Honestly, they are not lying about it. &gt;Reacher (Amazon) - Based on the novel of the same name (You may have seen the Jack reacher movie starring tom cruise). Believe me this show is a 10 times better than the movie, great plot, great action and there is a new season in production. Must check. Really? I've seen a few snippets of the main actor. It looked like god awful terrible cardboard acting! Endhada ithu type cheythe poori mone Currently watching the series - \"Only murders in the building\". Can recommend to watch! Currently loving the \"Drag And Dow foce Podcast\" based around F1. (The host shares my name too lmao) He can be inconsistent some times, but he is good. Recommend \"Hungarian GP review\" episode... Watching old stuff. Frasier. Office Rewatched Fight Club. Dobaara. Great movie. I don't understand the hate for it in right wing subs but yes. Please don't judge it based on a few snippets. Are you the kind of person who likes a movie because the the actor is good looking on the poster and it's enticing??  The actor is a lot better than Tom cruise and the action scenes are absolutely brilliant. If you have read the novel, you would get to know that jack reacher is actually a 6ft+ guy with heavy muscle contrary to the movie starred Tom cruise. Give it a try please. Sherdil. It's a lovely commentary on our society, without trying too hard. Yeah, that's also great movie, I think I have to watch it again to understand it😂 Okay, thanks for the suggestion, I will watch it soon \"I will put that on the list\" 🙌😂 Thanks, I will watch them soon🙌😁"
}