{
    "id": "18fogbq",
    "title": "SC verdict on abrogation of Article 370 Explained Live: Court directs Centre to restore J&K statehood, conduct assembly elections by September 2024",
    "url": "https://indianexpress.com/article/explained/explained-law/article-370-verdict-supreme-court-explained-live-updates-9061383/",
    "selftext": "\nThis is the victory of democracy. Supreme court, the last bastion of independent legal institution in india in an ever growing powerful political atmosphere of BJP government upheld its integrity today.",
    "flair": "Politics",
    "score": 50,
    "num_comments": 6,
    "created_utc": 1702277200.0,
    "convurl": "https://external-preview.redd.it/T4a4yqEGPwlZKfMBfpn8eITZAOJEeOXPqReQSmKdLhE.jpg?auto=webp&s=d0b001a483ed5a36d8752b7cb7e55fe3c8816856",
    "comments": [
        "Good. With a deadline hopefully the central government will move faster to restore statehood.",
        "if i am not mistaken, deadline is for elections as j&k is UT with legislature. for statehood restoration, SC directed to do it \"as early as possible\""
    ],
    "cleaned_text": "sc verdict abrogation article explained live court directs centre restore jk statehood conduct assembly elections september victory democracy supreme court last bastion independent legal institution india ever growing powerful political atmosphere bjp government upheld integrity today ",
    "cleaned_title": "sc verdict abrogation article explained live court directs centre restore jk statehood conduct assembly elections september",
    "cleaned_selftext": "victory democracy supreme court last bastion independent legal institution india ever growing powerful political atmosphere bjp government upheld integrity today",
    "cleaned_comments": "good deadline hopefully central government move faster restore statehood mistaken deadline elections jk ut legislature statehood restoration sc directed early possible",
    "light_cleaned_title": "SC verdict on abrogation of Article 370 Explained Live: Court directs Centre to restore J&K statehood, conduct assembly elections by September 2024",
    "light_cleaned_selftext": "This is the victory of democracy. Supreme court, the last bastion of independent legal institution in india in an ever growing powerful political atmosphere of BJP government upheld its integrity today.",
    "light_cleaned_comments": "Good. With a deadline hopefully the central government will move faster to restore statehood. if i am not mistaken, deadline is for elections as j&k is UT with legislature. for statehood restoration, SC directed to do it \"as early as possible\""
}