{
    "id": "15is9gf",
    "title": "\"I Am Sorry\": Bombay High Court Judge Announces Resignation In Open Court",
    "url": "https://www.ndtv.com/india-news/i-am-sorry-bombay-high-court-judge-justice-rohit-deo-announces-resignation-in-open-court-4269274/amp/1",
    "selftext": "In 2022, Justice Deo acquitted former Delhi University professor GN Saibaba in an alleged Maoist links case, setting aside the life imprisonment awarded to him and noting that the trial proceedings were null and void in the absence of valid sanction under the Unlawful Activities (Prevention) Act (UAPA).\n\nThe Supreme Court later stayed the order and ordered the Nagpur bench of the High Court to hear the case afresh.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1691231596.0,
    "convurl": "https://external-preview.redd.it/6U21_3vst33i6r2TmtmFuP952FVm9FK8rjHx2QQFtNw.jpg?auto=webp&s=36888f2f61b19835b95297388e917f609e412a11",
    "comments": [],
    "cleaned_text": "sorry bombay high court judge announces resignation open court justice deo acquitted former delhi university professor gn saibaba alleged maoist links case setting aside life imprisonment awarded noting trial proceedings null void absence valid sanction unlawful activities prevention act uapa supreme court later stayed order ordered nagpur bench high court hear case afresh ",
    "cleaned_title": "sorry bombay high court judge announces resignation open court",
    "cleaned_selftext": "justice deo acquitted former delhi university professor gn saibaba alleged maoist links case setting aside life imprisonment awarded noting trial proceedings null void absence valid sanction unlawful activities prevention act uapa supreme court later stayed order ordered nagpur bench high court hear case afresh",
    "cleaned_comments": "",
    "light_cleaned_title": "\"I Am Sorry\": Bombay High Court Judge Announces Resignation In Open Court",
    "light_cleaned_selftext": "In 2022, Justice Deo acquitted former Delhi University professor GN Saibaba in an alleged Maoist links case, setting aside the life imprisonment awarded to him and noting that the trial proceedings were null and void in the absence of valid sanction under the Unlawful Activities (Prevention) Act (UAPA). The Supreme Court later stayed the order and ordered the Nagpur bench of the High Court to hear the case afresh.",
    "light_cleaned_comments": ""
}