{
    "id": "1cjcyq2",
    "title": "Police make arrests in killing of B.C. Sikh activist Hardeep Singh Nijjar | CBC News",
    "url": "https://www.cbc.ca/news/politics/nijjar-killing-arrests-made-1.7192807",
    "selftext": "Looks like a significant breakthrough. It’ll be interesting to see how the police link the arrests to the killing of Nijjar during their briefing today. ",
    "flair": "Crime",
    "score": 23,
    "num_comments": 13,
    "created_utc": 1714753843.0,
    "convurl": "https://external-preview.redd.it/NkBlILiB5aUZLWxU90AgZ9c2waIBgAfsx5g4Xu2_g8U.jpg?auto=webp&s=cd82f8c417e8bba1993cceadef779bcd9a015104",
    "comments": [
        "US arrested an Indian agent, Canada arrested these dudes,and  Australia kicked out Indian spies. Nice job Modi government. What a tactician!",
        "What is BC Sikh in the title? Hope it's not behen ch*d",
        "B.C. Is the province where he lived. British Colombia",
        "I just wish the arrests were done earlier tbh. Gives more credibility before making the accusations.",
        "Maybe Australia and Canada were all waiting for the election.",
        "Modi hai to mumkin hai.",
        "The police said the arrested persons are potentially linked to Lawrence Bishnoi gang but didn't confirmed it. They also said case is not closed and they are doing further investigation if there is an involvement of India.",
        "Why would you think a major news outlet of Canada would write bhenc\\*\\*d to refer to a religion?",
        "I hope they have \"credible\" evidence to back those arrests.",
        "They’re being charged with first degree murder and conspiracy to murder. This is Canada where charges are laid once there’s enough evidence and not india where they’ll first throw you in jail and ask questions later.",
        "He was killed in Jun 23, accusations were made in Sept 23 and arrests made in May 24. The entire timeline of events is less than 1 year. How much more credibility do you want?"
    ],
    "cleaned_text": "police make arrests killing bc sikh activist hardeep singh nijjar cbc news looks like significant breakthrough itll interesting see police link arrests killing nijjar briefing today ",
    "cleaned_title": "police make arrests killing bc sikh activist hardeep singh nijjar cbc news",
    "cleaned_selftext": "looks like significant breakthrough itll interesting see police link arrests killing nijjar briefing today",
    "cleaned_comments": "us arrested indian agent canada arrested dudesand australia kicked indian spies nice job modi government tactician bc sikh title hope behen chd bc province lived british colombia wish arrests done earlier tbh gives credibility making accusations maybe australia canada waiting election modi hai mumkin hai police said arrested persons potentially linked lawrence bishnoi gang didnt confirmed also said case closed investigation involvement india would think major news outlet canada would write bhencd refer religion hope credible evidence back arrests theyre charged first degree murder conspiracy murder canada charges laid theres enough evidence india theyll first throw jail ask questions later killed jun accusations made sept arrests made may entire timeline events less year much credibility want",
    "light_cleaned_title": "Police make arrests in killing of B.C. Sikh activist Hardeep Singh Nijjar | CBC News",
    "light_cleaned_selftext": "Looks like a significant breakthrough. It’ll be interesting to see how the police link the arrests to the killing of Nijjar during their briefing today.",
    "light_cleaned_comments": "US arrested an Indian agent, Canada arrested these dudes,and Australia kicked out Indian spies. Nice job Modi government. What a tactician! What is BC Sikh in the title? Hope it's not behen ch*d B.C. Is the province where he lived. British Colombia I just wish the arrests were done earlier tbh. Gives more credibility before making the accusations. Maybe Australia and Canada were all waiting for the election. Modi hai to mumkin hai. The police said the arrested persons are potentially linked to Lawrence Bishnoi gang but didn't confirmed it. They also said case is not closed and they are doing further investigation if there is an involvement of India. Why would you think a major news outlet of Canada would write bhenc\\*\\*d to refer to a religion? I hope they have \"credible\" evidence to back those arrests. They’re being charged with first degree murder and conspiracy to murder. This is Canada where charges are laid once there’s enough evidence and not india where they’ll first throw you in jail and ask questions later. He was killed in Jun 23, accusations were made in Sept 23 and arrests made in May 24. The entire timeline of events is less than 1 year. How much more credibility do you want?"
}