{
    "id": "168liem",
    "title": "No Question Hour, private members business during September 18-22 special session of Parliament",
    "url": "https://www.thehindu.com/news/national/parliament-session-from-september-18-to-22-without-question-hour-private-members-business-notification/article67263933.ece",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Fwww.thehindu.com%2Fnews%2Fnational%2Fparliament-session-from-september-18-to-22-without-question-hour-private-members-business-notification%2Farticle67263933.ece",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693709337.0,
    "convurl": "https://external-preview.redd.it/h3pYRkFfsQUTG4j8pIi8phK4AtVKFBdJXampUVbVf-Y.jpg?auto=webp&s=44268a510da29ff50c83cd1e0a52b946495fd612",
    "comments": [
        "So it will be a one sided broadcast of supreme leader and will probably table and pass some hugely controversial bill right in time to polarise the atmosphere before next year elections.\n\n  \n\n\nIt could be either UCC or simultaneous election. Or it could be just a session to boast about how India become Supa Powa after G20 summit leadership (which is a cyclical thing) and every member get to be host."
    ],
    "cleaned_text": "question hour private members business september special session parliament  ",
    "cleaned_title": "question hour private members business september special session parliament",
    "cleaned_selftext": "",
    "cleaned_comments": "one sided broadcast supreme leader probably table pass hugely controversial bill right time polarise atmosphere next year elections could either ucc simultaneous election could session boast india become supa powa g summit leadership cyclical thing every member get host",
    "light_cleaned_title": "No Question Hour, private members business during September 18-22 special session of Parliament",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "So it will be a one sided broadcast of supreme leader and will probably table and pass some hugely controversial bill right in time to polarise the atmosphere before next year elections. It could be either UCC or simultaneous election. Or it could be just a session to boast about how India become Supa Powa after G20 summit leadership (which is a cyclical thing) and every member get to be host."
}