{
    "id": "16ykbed",
    "title": "ISI terror module: All 3 arrested accused have BTech degrees",
    "url": "https://m.rediff.com/news/report/isi-terror-module-all-3-arrested-accused-have-btech-degrees/20231003.htm",
    "selftext": "Education alone cannot rid social evils, society has to limit the role of religion in public life and put national interest above religion.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 42,
    "created_utc": 1696313949.0,
    "convurl": "https://external-preview.redd.it/9bGdoAhYKVeNb80UmJ5zsVX7URmY0ttrGUbl9H0JfJc.jpg?auto=webp&s=4ae00632b273c1ba848bed5342654c7adb726583",
    "comments": [
        "Engineers seems to be especially susceptible to religious indoctrination. Even the 9/11 terrorists had educated people and engineers among them.",
        "Bahi yaar isme bhi hindutva jod diya aur koi dusra religion yaad ni aaya",
        "Well I did say the 9/11 thing as well. My point is that Engineering students/grads seem to have a special affinity for religious indoctrination. \n\nBut my cousin is the irl example I do know of so that's what I gave.",
        "Put nationalism above religion - some people of certain  community decline to say vande Matram \n\nMuslim personal law reform ki baat kare to sab sadak par aa jaate he .liberal hindu vsuslim ka angle de dete he. Personal law reform me to equality ke angle se dekhna chaiye na",
        "Engineering bhi common theme he religion bhi par selectively pakda aapne",
        "On the different topic- Desh ke logo ko single identity\n Me Lana hoga na hindu na muslim na uc na st sabke law barabar Karo  . Single identity aa jayegi religion ki taraf Kam bhagenge",
        "Islam keeps insisting their adherents that the earth life is a test to enter heaven or hell... they keep pushing into their minds from young age every week ..\n\nSome people just get sucked into it and since jihad is a sureshot way to heaven ..\n\nThey believe fighting for your religion will give them ticket to heaven....\n\nIt's not about education, economic conditions,social upbringing... once that virus enters into their mind , then nothing can change them",
        "Engineering bhi common theme he religion bhi par selectively pakda aapne\n\nI don't know what you mean. That's literally what I'm saying, Engineering folks have a higher rate of religious indoctrination. I'm not isolating one religion here but I am isolating Engineering as a field here.  \n\nIt seems to be different from other STEM fields somehow in that. ( not that other folks can't be religious extremists but its more common in Engineers.",
        "Reposted as auto mod removed reddit link so posting without it.\n\n>Engineering bhi common theme he religion bhi par selectively pakda aapne\n\nI don't know what you mean. That's literally what I'm saying, Engineering folks have a higher rate of religious indoctrination. I'm not isolating one religion here but I am isolating Engineering as a field here.\n\nIt seems to be different from other STEM fields somehow in that. ( not that other folks can't be religious extremists but its more common in Engineers.\n\n[Are engineers more religious than average faculty?](https://www.amazon.com/Engineers-Jihad-Connection-Extremism-Education/dp/0691145172)\n\nI'm not the only one who sees it\n\nWhy are so many engineers religious? Search for that on reddit.",
        "I would not be surprised even if some doctorates turn out to be \"terrorists\"/\"criminals\". Specialism in one field does not imbue rationalism and skepticism. \n\nAnd nationalism beyond a degree is dangerous too.",
        "Ok",
        ">some people of certain community decline to say vande Matram \n\nRead the book where it came from and you will too.",
        "All folks like you can do is to keep shifting blame and change the focus of the conversation. Terror of all sorts against the nation is deplorable, be it from any religion. They don't deserve to be called Indians and punishment of the highest order should be meted out, without any bias. But people like you definitely would shift the goalposts, isn't it?",
        "The two words \"Muslim Moderates\" are oxymoron and cannot be used together.\n\nReligions like Hinduism has so many branches. I can disregard manu smriti, I can call Puranas fiction and not believe in Vishnu or Shiva, and subscribe to some other values, like few Upanishads and still call myself a Hindu. \n\nIslam on the other hand is very much based on the blind faith on Quran, to accpet the Holy Quran verbatim else face forever the fire of Hell. What you call moderates are those which dont accept some part of Quran which makes them non-muslim.",
        ">Religions like Hinduism has so many branches\n\nSo does Islam.",
        ">  keep shifting blame\n\nLOL wut?\n\nHow am I shifting blame? I'm just pointing out an observation that Engineers seem to have a higher propensity for religious extremism.  \n\nI'm not blaming Engineering here rather just pointing out the co-relation that appears.",
        "So education is not helping now what",
        "There's a certain religion, all around the world that breeds terrorism, extremism and all kinds of shit. But the accepted norm in Liberal circles is to declare that 'terror has no religion'(when it statistically does have one) and look at everything else like education, social status etc. without even entertaining the fact that maybe it's the inherent nature of extremist ideals of the religion that makes it's followers more prone to do these things.",
        "Sure these are children/ grandchildren of illegal immigrants who settled in india in 1971.",
        "There are moderates muslim in India they just don't voice their opinion in fear of orthodox muslim .moderates don't follow Islam strictly but they don'nt want identity crisis  like if I'm not muslim then who so they go with the flow and live life silently.moderate muslim is not good muslim according to principle or belief of Quran .But they are better indian citizen . A bad muslim is good indian citizen",
        "Sufism ibadi ye to bas interpretation he so baad me log karte gaye. aur ye sect Bane hi kyo different interpretation ki kyo political halato ki vajah se baaki kya alag he . Maante to sab prophet Mohammad ko hi. Starting me Jo Islam tha sab agree karte he . To Jo Islam ke starting ke principle par sab agree karte he jihad, raid, single god, heaven 72hoor,polygamy,child marriage . And say Islam is the only true religion . What qualities does Islam have name any. A prophet marrying child, marrying his adopted son wife, treated women like object.and they also say Islam is a peaceful religion. Baaki kabhi kisi aur  religion ke topic PE koi peaceful religion tag ni jodta he . Kuch ko deny karke ke liye ye  keyword add hua he . Islam se jya violent kon sa he. War/battle to pahle bhi hoti thi par battle ke saare rule break kiye Islam ne .",
        "Was wondering if I stumbled upon a different sub while reading comments until I scrolled down to this one. Cleared my doubts, thank you!",
        "How come someone doing a PhD in Islamic principles takes part in such heinous crimes. I thought Islam was supposed to be about peace. /s",
        "> Shahnawaz married Basanti Patel alias Khadeeja Maryam (converted) in Aligarh, UP. After his return from Aligarh, they decided to make some IEDs in Delhi. \n\nThis is scary.",
        " First off, navigating this dialogue while immersed in a nation where Hindutva fervor frequently spills over into violence against minorities, notably Muslims, has its own set of ironies. The substantial acts of terror imposed by right-wing Hindus—mob violence, lynching, assaulting worship places—might raise an eyebrow, don’t you think? Especially when comparing it to the concept that somehow only Muslims conduct “true” acts of terrorism? Is the hypocrisy here not staggeringly apparent?\n\nMoreover, let’s clarify: terrorism, at its core, often springs from political, not religious, wells. Religion, while a potent tool, is often wielded to propel political narratives and objectives into the limelight. For instance, when Bajrang Dal in India antagonizes unmarried couples, or when the TLP in Pakistan descends into chaos over blasphemy incidents, it's not merely a religious act but a performance, orchestrated by political puppeteers seeking to maintain or ascend their power structures, right?\n\nThe Muslim world? It’s been brutally mangled by decades of war and ideological weaponization. It's hardly shocking that seeds of radicalization find fertile ground amidst the wreckage, is it? With the explicit strategies by nations like the US and Saudi Arabia to disseminate Wahhabist ideology, partly documented and declassified, destabilizing the region to siphon resources and influence becomes a clear-cut motive. Remember the overthrow of Mossadegh in Iran, turning a once liberal democracy into a theocratic regime?\n\nContrarily, a glance at nations like Indonesia or Turkey provides a contrasting narrative. Amidst their majority Muslim populations and vibrant religious life, they harbor bustling art scenes and display progressive attitudes, particularly in women’s rights—something that isn’t defined by prudishness or lack of education, clearly visible to anyone who’s visited.\n\nAnd, oh, while we’re at it, should we ignore the U.S., where domestic terrorism, often perpetuated by young, right-wing males, has woven itself into the societal fabric? Or what about the lethal persecution of LGBTQ+ individuals by extremists in Uganda? Should we turn a blind eye to China's explicit oppression of the Tibetans and Uyghurs under the guise of Han supremacy?\n\nTerror and extremism, clearly, don’t wear a single religious or political label. They’re found in idealistic populations, manipulated by individuals who artfully shape this idealism to forge their own paths to power. Claiming otherwise, particularly from within a nation where right-wing Hindu factions demonstrate no hesitation in assaulting and oppressing dissenters, smacks of irony and audacity, don’t you think?",
        "These are terrorists. So are the ones from army and BJP HQ who were leaking secret confidential information to ISI . Just that none of those guys were muslims",
        "What are the chances that 20 years from now they will all be released because no evidence found. Example below\n\nhttps://www.aljazeera.com/amp/news/2021/3/9/127-indian-muslims-charged-with-terror-acquitted-after-19-years",
        "Or… as 9/11 required those folks to learn to fly literal Boeing airplanes, they could not get some high school drop out from a cave in Afghanistan?",
        "Mere college se BTech ki hai toh koi tension nahi, bobm pakka nahi phatega.",
        "Dude there is a significant difference between a traitor and a terrorist..",
        "Did your cousin commit terrorist acts?"
    ],
    "cleaned_text": "isi terror module arrested accused btech degrees education alone rid social evils society limit role religion public life put national interest religion ",
    "cleaned_title": "isi terror module arrested accused btech degrees",
    "cleaned_selftext": "education alone rid social evils society limit role religion public life put national interest religion",
    "cleaned_comments": "engineers seems especially susceptible religious indoctrination even terrorists educated people engineers among bahi yaar isme bhi hindutva jod diya aur koi dusra religion yaad ni aaya well say thing well point engineering studentsgrads seem special affinity religious indoctrination cousin irl example know thats gave put nationalism religion people certain community decline say vande matram muslim personal law reform ki baat kare sab sadak par aa jaate liberal hindu vsuslim ka angle de dete personal law reform equality ke angle se dekhna chaiye na engineering bhi common theme religion bhi par selectively pakda aapne different topic desh ke logo ko single identity lana hoga na hindu na muslim na uc na st sabke law barabar karo single identity aa jayegi religion ki taraf kam bhagenge islam keeps insisting adherents earth life test enter heaven hell keep pushing minds young age every week people get sucked since jihad sureshot way heaven believe fighting religion give ticket heaven education economic conditionssocial upbringing virus enters mind nothing change engineering bhi common theme religion bhi par selectively pakda aapne dont know mean thats literally im saying engineering folks higher rate religious indoctrination im isolating one religion isolating engineering field seems different stem fields somehow folks cant religious extremists common engineers reposted auto mod removed reddit link posting without engineering bhi common theme religion bhi par selectively pakda aapne dont know mean thats literally im saying engineering folks higher rate religious indoctrination im isolating one religion isolating engineering field seems different stem fields somehow folks cant religious extremists common engineers engineers religious average facultyhttpswwwamazoncomengineersjihadconnectionextremismeducationdp im one sees many engineers religious search reddit would surprised even doctorates turn terroristscriminals specialism one field imbue rationalism skepticism nationalism beyond degree dangerous ok people certain community decline say vande matram read book came folks like keep shifting blame change focus conversation terror sorts nation deplorable religion dont deserve called indians punishment highest order meted without bias people like definitely would shift goalposts isnt two words muslim moderates oxymoron used together religions like hinduism many branches disregard manu smriti call puranas fiction believe vishnu shiva subscribe values like upanishads still call hindu islam hand much based blind faith quran accpet holy quran verbatim else face forever fire hell call moderates dont accept part quran makes nonmuslim religions like hinduism many branches islam keep shifting blame lol wut shifting blame im pointing observation engineers seem higher propensity religious extremism im blaming engineering rather pointing corelation appears education helping theres certain religion around world breeds terrorism extremism kinds shit accepted norm liberal circles declare terror religionwhen statistically one look everything else like education social status etc without even entertaining fact maybe inherent nature extremist ideals religion makes followers prone things sure children grandchildren illegal immigrants settled india moderates muslim india dont voice opinion fear orthodox muslim moderates dont follow islam strictly donnt want identity crisis like im muslim go flow live life silentlymoderate muslim good muslim according principle belief quran better indian citizen bad muslim good indian citizen sufism ibadi ye bas interpretation baad log karte gaye aur ye sect bane hi kyo different interpretation ki kyo political halato ki vajah se baaki kya alag maante sab prophet mohammad ko hi starting jo islam tha sab agree karte jo islam ke starting ke principle par sab agree karte jihad raid single god heaven hoorpolygamychild marriage say islam true religion qualities islam name prophet marrying child marrying adopted son wife treated women like objectand also say islam peaceful religion baaki kabhi kisi aur religion ke topic pe koi peaceful religion tag ni jodta kuch ko deny karke ke liye ye keyword add hua islam se jya violent kon sa warbattle pahle bhi hoti thi par battle ke saare rule break kiye islam ne wondering stumbled upon different sub reading comments scrolled one cleared doubts thank come someone phd islamic principles takes part heinous crimes thought islam supposed peace shahnawaz married basanti patel alias khadeeja maryam converted aligarh return aligarh decided make ieds delhi scary first navigating dialogue immersed nation hindutva fervor frequently spills violence minorities notably muslims set ironies substantial acts terror imposed rightwing hindusmob violence lynching assaulting worship placesmight raise eyebrow dont think especially comparing concept somehow muslims conduct true acts terrorism hypocrisy staggeringly apparent moreover lets clarify terrorism core often springs political religious wells religion potent tool often wielded propel political narratives objectives limelight instance bajrang dal india antagonizes unmarried couples tlp pakistan descends chaos blasphemy incidents merely religious act performance orchestrated political puppeteers seeking maintain ascend power structures right muslim world brutally mangled decades war ideological weaponization hardly shocking seeds radicalization find fertile ground amidst wreckage explicit strategies nations like us saudi arabia disseminate wahhabist ideology partly documented declassified destabilizing region siphon resources influence becomes clearcut motive remember overthrow mossadegh iran turning liberal democracy theocratic regime contrarily glance nations like indonesia turkey provides contrasting narrative amidst majority muslim populations vibrant religious life harbor bustling art scenes display progressive attitudes particularly womens rightssomething isnt defined prudishness lack education clearly visible anyone whos visited oh ignore us domestic terrorism often perpetuated young rightwing males woven societal fabric lethal persecution lgbtq individuals extremists uganda turn blind eye chinas explicit oppression tibetans uyghurs guise han supremacy terror extremism clearly dont wear single religious political label theyre found idealistic populations manipulated individuals artfully shape idealism forge paths power claiming otherwise particularly within nation rightwing hindu factions demonstrate hesitation assaulting oppressing dissenters smacks irony audacity dont think terrorists ones army bjp hq leaking secret confidential information isi none guys muslims chances years released evidence found example required folks learn fly literal boeing airplanes could get high school drop cave afghanistan mere college se btech ki hai toh koi tension nahi bobm pakka nahi phatega dude significant difference traitor terrorist cousin commit terrorist acts",
    "light_cleaned_title": "ISI terror module: All 3 arrested accused have BTech degrees",
    "light_cleaned_selftext": "Education alone cannot rid social evils, society has to limit the role of religion in public life and put national interest above religion.",
    "light_cleaned_comments": "Engineers seems to be especially susceptible to religious indoctrination. Even the 9/11 terrorists had educated people and engineers among them. Bahi yaar isme bhi hindutva jod diya aur koi dusra religion yaad ni aaya Well I did say the 9/11 thing as well. My point is that Engineering students/grads seem to have a special affinity for religious indoctrination. But my cousin is the irl example I do know of so that's what I gave. Put nationalism above religion - some people of certain community decline to say vande Matram Muslim personal law reform ki baat kare to sab sadak par aa jaate he .liberal hindu vsuslim ka angle de dete he. Personal law reform me to equality ke angle se dekhna chaiye na Engineering bhi common theme he religion bhi par selectively pakda aapne On the different topic- Desh ke logo ko single identity Me Lana hoga na hindu na muslim na uc na st sabke law barabar Karo . Single identity aa jayegi religion ki taraf Kam bhagenge Islam keeps insisting their adherents that the earth life is a test to enter heaven or hell... they keep pushing into their minds from young age every week .. Some people just get sucked into it and since jihad is a sureshot way to heaven .. They believe fighting for your religion will give them ticket to heaven.... It's not about education, economic conditions,social upbringing... once that virus enters into their mind , then nothing can change them Engineering bhi common theme he religion bhi par selectively pakda aapne I don't know what you mean. That's literally what I'm saying, Engineering folks have a higher rate of religious indoctrination. I'm not isolating one religion here but I am isolating Engineering as a field here. It seems to be different from other STEM fields somehow in that. ( not that other folks can't be religious extremists but its more common in Engineers. Reposted as auto mod removed reddit link so posting without it. >Engineering bhi common theme he religion bhi par selectively pakda aapne I don't know what you mean. That's literally what I'm saying, Engineering folks have a higher rate of religious indoctrination. I'm not isolating one religion here but I am isolating Engineering as a field here. It seems to be different from other STEM fields somehow in that. ( not that other folks can't be religious extremists but its more common in Engineers. [Are engineers more religious than average faculty?](https://www.amazon.com/Engineers-Jihad-Connection-Extremism-Education/dp/0691145172) I'm not the only one who sees it Why are so many engineers religious? Search for that on reddit. I would not be surprised even if some doctorates turn out to be \"terrorists\"/\"criminals\". Specialism in one field does not imbue rationalism and skepticism. And nationalism beyond a degree is dangerous too. Ok >some people of certain community decline to say vande Matram Read the book where it came from and you will too. All folks like you can do is to keep shifting blame and change the focus of the conversation. Terror of all sorts against the nation is deplorable, be it from any religion. They don't deserve to be called Indians and punishment of the highest order should be meted out, without any bias. But people like you definitely would shift the goalposts, isn't it? The two words \"Muslim Moderates\" are oxymoron and cannot be used together. Religions like Hinduism has so many branches. I can disregard manu smriti, I can call Puranas fiction and not believe in Vishnu or Shiva, and subscribe to some other values, like few Upanishads and still call myself a Hindu. Islam on the other hand is very much based on the blind faith on Quran, to accpet the Holy Quran verbatim else face forever the fire of Hell. What you call moderates are those which dont accept some part of Quran which makes them non-muslim. >Religions like Hinduism has so many branches So does Islam. > keep shifting blame LOL wut? How am I shifting blame? I'm just pointing out an observation that Engineers seem to have a higher propensity for religious extremism. I'm not blaming Engineering here rather just pointing out the co-relation that appears. So education is not helping now what There's a certain religion, all around the world that breeds terrorism, extremism and all kinds of shit. But the accepted norm in Liberal circles is to declare that 'terror has no religion'(when it statistically does have one) and look at everything else like education, social status etc. without even entertaining the fact that maybe it's the inherent nature of extremist ideals of the religion that makes it's followers more prone to do these things. Sure these are children/ grandchildren of illegal immigrants who settled in india in 1971. There are moderates muslim in India they just don't voice their opinion in fear of orthodox muslim .moderates don't follow Islam strictly but they don'nt want identity crisis like if I'm not muslim then who so they go with the flow and live life silently.moderate muslim is not good muslim according to principle or belief of Quran .But they are better indian citizen . A bad muslim is good indian citizen Sufism ibadi ye to bas interpretation he so baad me log karte gaye. aur ye sect Bane hi kyo different interpretation ki kyo political halato ki vajah se baaki kya alag he . Maante to sab prophet Mohammad ko hi. Starting me Jo Islam tha sab agree karte he . To Jo Islam ke starting ke principle par sab agree karte he jihad, raid, single god, heaven 72hoor,polygamy,child marriage . And say Islam is the only true religion . What qualities does Islam have name any. A prophet marrying child, marrying his adopted son wife, treated women like object.and they also say Islam is a peaceful religion. Baaki kabhi kisi aur religion ke topic PE koi peaceful religion tag ni jodta he . Kuch ko deny karke ke liye ye keyword add hua he . Islam se jya violent kon sa he. War/battle to pahle bhi hoti thi par battle ke saare rule break kiye Islam ne . Was wondering if I stumbled upon a different sub while reading comments until I scrolled down to this one. Cleared my doubts, thank you! How come someone doing a PhD in Islamic principles takes part in such heinous crimes. I thought Islam was supposed to be about peace. /s > Shahnawaz married Basanti Patel alias Khadeeja Maryam (converted) in Aligarh, UP. After his return from Aligarh, they decided to make some IEDs in Delhi. This is scary. First off, navigating this dialogue while immersed in a nation where Hindutva fervor frequently spills over into violence against minorities, notably Muslims, has its own set of ironies. The substantial acts of terror imposed by right-wing Hindus—mob violence, lynching, assaulting worship places—might raise an eyebrow, don’t you think? Especially when comparing it to the concept that somehow only Muslims conduct “true” acts of terrorism? Is the hypocrisy here not staggeringly apparent? Moreover, let’s clarify: terrorism, at its core, often springs from political, not religious, wells. Religion, while a potent tool, is often wielded to propel political narratives and objectives into the limelight. For instance, when Bajrang Dal in India antagonizes unmarried couples, or when the TLP in Pakistan descends into chaos over blasphemy incidents, it's not merely a religious act but a performance, orchestrated by political puppeteers seeking to maintain or ascend their power structures, right? The Muslim world? It’s been brutally mangled by decades of war and ideological weaponization. It's hardly shocking that seeds of radicalization find fertile ground amidst the wreckage, is it? With the explicit strategies by nations like the US and Saudi Arabia to disseminate Wahhabist ideology, partly documented and declassified, destabilizing the region to siphon resources and influence becomes a clear-cut motive. Remember the overthrow of Mossadegh in Iran, turning a once liberal democracy into a theocratic regime? Contrarily, a glance at nations like Indonesia or Turkey provides a contrasting narrative. Amidst their majority Muslim populations and vibrant religious life, they harbor bustling art scenes and display progressive attitudes, particularly in women’s rights—something that isn’t defined by prudishness or lack of education, clearly visible to anyone who’s visited. And, oh, while we’re at it, should we ignore the U.S., where domestic terrorism, often perpetuated by young, right-wing males, has woven itself into the societal fabric? Or what about the lethal persecution of LGBTQ+ individuals by extremists in Uganda? Should we turn a blind eye to China's explicit oppression of the Tibetans and Uyghurs under the guise of Han supremacy? Terror and extremism, clearly, don’t wear a single religious or political label. They’re found in idealistic populations, manipulated by individuals who artfully shape this idealism to forge their own paths to power. Claiming otherwise, particularly from within a nation where right-wing Hindu factions demonstrate no hesitation in assaulting and oppressing dissenters, smacks of irony and audacity, don’t you think? These are terrorists. So are the ones from army and BJP HQ who were leaking secret confidential information to ISI . Just that none of those guys were muslims What are the chances that 20 years from now they will all be released because no evidence found. Example below Or… as 9/11 required those folks to learn to fly literal Boeing airplanes, they could not get some high school drop out from a cave in Afghanistan? Mere college se BTech ki hai toh koi tension nahi, bobm pakka nahi phatega. Dude there is a significant difference between a traitor and a terrorist.. Did your cousin commit terrorist acts?"
}