{
    "id": "137k3vq",
    "title": "Bangalore Folks - Helping Hands Needed: Supporting a Struggling Nursery Owner",
    "url": "https://www.reddit.com/r/india/comments/137k3vq/bangalore_folks_helping_hands_needed_supporting_a/",
    "selftext": "A couple of months ago, a story was [posted on Twitter](https://twitter.com/akxnksha/status/1632766458341236736) by [user](https://twitter.com/akxnksha). I visited him today, bought a few plants and gave 50 rupees extra as I didn't have change. He broke down in tears and shared his recent struggles with sickness and making ends meet. It was a humbling reminder of the power of kindness and the importance of supporting those in need.\n\nFor folks who couldn't read the linked thread above, summarizing it below.\n\n>*In the bustling streets of Indiranagar, Bangalore, there is an elderly man who sells plants in a small green shack. Despite the vibrant greenery surrounding him, he struggles to make ends meet and provide for himself. The man has no formal education and no job prospects, so he found himself selling plants as a way to survive. However, he faces constant challenges, as people often ask him to leave and he's yelled at on a daily basis.*  \n*Recently, a road reconstruction project near his stall had caused him to be asked to shut down his shop multiple times. Luckily, people from surrounding shops fought for him, and he was allowed to keep his stall on the road. Despite his hardships, the man remains determined to make his business work.*  \n*This is where we come in. Let's support this hardworking man by purchasing some of his lovely collection of indoor and outdoor plants. By doing so, we can help him make ends meet and provide for himself.*\n\nHowever, it's important to note that the man does not have access to UPI or any online payment methods, so please bring cash if you want to help him out. Let's come together and show this man that he's not alone in his struggle.\n\n*I've posted in* r/bangalore *as well, couldn't crosspost here hence reposting.*",
    "flair": "AskIndia",
    "score": 12,
    "num_comments": 1,
    "created_utc": 1683205536.0,
    "convurl": "https://external-preview.redd.it/6exjn5VHke0peGwa9nox6mh6u7FgpCwiwT_IatoD--M.jpg?auto=webp&v=enabled&s=e51d9493ccc697dcc31f30a9b2f40341e6a30ee3",
    "comments": [],
    "cleaned_text": "bangalore folks helping hands needed supporting struggling nursery owner couple months ago story posted twitterhttpstwittercomakxnkshastatus userhttpstwittercomakxnksha visited today bought plants gave rupees extra didnt change broke tears shared recent struggles sickness making ends meet humbling reminder power kindness importance supporting need folks couldnt read linked thread summarizing bustling streets indiranagar bangalore elderly man sells plants small green shack despite vibrant greenery surrounding struggles make ends meet provide man formal education job prospects found selling plants way survive however faces constant challenges people often ask leave hes yelled daily basis recently road reconstruction project near stall caused asked shut shop multiple times luckily people surrounding shops fought allowed keep stall road despite hardships man remains determined make business work come lets support hardworking man purchasing lovely collection indoor outdoor plants help make ends meet provide however important note man access upi online payment methods please bring cash want help lets come together show man hes alone struggle ive posted rbangalore well couldnt crosspost hence reposting ",
    "cleaned_title": "bangalore folks helping hands needed supporting struggling nursery owner",
    "cleaned_selftext": "couple months ago story posted twitterhttpstwittercomakxnkshastatus userhttpstwittercomakxnksha visited today bought plants gave rupees extra didnt change broke tears shared recent struggles sickness making ends meet humbling reminder power kindness importance supporting need folks couldnt read linked thread summarizing bustling streets indiranagar bangalore elderly man sells plants small green shack despite vibrant greenery surrounding struggles make ends meet provide man formal education job prospects found selling plants way survive however faces constant challenges people often ask leave hes yelled daily basis recently road reconstruction project near stall caused asked shut shop multiple times luckily people surrounding shops fought allowed keep stall road despite hardships man remains determined make business work come lets support hardworking man purchasing lovely collection indoor outdoor plants help make ends meet provide however important note man access upi online payment methods please bring cash want help lets come together show man hes alone struggle ive posted rbangalore well couldnt crosspost hence reposting",
    "cleaned_comments": "",
    "light_cleaned_title": "Bangalore Folks - Helping Hands Needed: Supporting a Struggling Nursery Owner",
    "light_cleaned_selftext": "A couple of months ago, a story was [posted on Twitter](https://twitter.com/akxnksha/status/1632766458341236736) by [user](https://twitter.com/akxnksha). I visited him today, bought a few plants and gave 50 rupees extra as I didn't have change. He broke down in tears and shared his recent struggles with sickness and making ends meet. It was a humbling reminder of the power of kindness and the importance of supporting those in need. For folks who couldn't read the linked thread above, summarizing it below. >*In the bustling streets of Indiranagar, Bangalore, there is an elderly man who sells plants in a small green shack. Despite the vibrant greenery surrounding him, he struggles to make ends meet and provide for himself. The man has no formal education and no job prospects, so he found himself selling plants as a way to survive. However, he faces constant challenges, as people often ask him to leave and he's yelled at on a daily basis.* *Recently, a road reconstruction project near his stall had caused him to be asked to shut down his shop multiple times. Luckily, people from surrounding shops fought for him, and he was allowed to keep his stall on the road. Despite his hardships, the man remains determined to make his business work.* *This is where we come in. Let's support this hardworking man by purchasing some of his lovely collection of indoor and outdoor plants. By doing so, we can help him make ends meet and provide for himself.* However, it's important to note that the man does not have access to UPI or any online payment methods, so please bring cash if you want to help him out. Let's come together and show this man that he's not alone in his struggle. *I've posted in* r/bangalore *as well, couldn't crosspost here hence reposting.*",
    "light_cleaned_comments": ""
}