{
    "id": "1agwea9",
    "title": "Cracking the code: How to master UPI fraud management? MintGenie explains | Mint",
    "url": "https://www.livemint.com/money/personal-finance/navigating-and-combatting-upi-frauds-by-mastering-fraud-management-digital-transactions-online-payments-phishing-11706511999468.html",
    "selftext": "*Investigations into UPI frauds reveal a pattern followed by hackers to execute their schemes. Disguising themselves as bank employees, hackers extract basic information, address UPI app-related issues, and convince users to share sensitive data. Scammers may also trick users into downloading apps that provide access to their phones. Once a 9-digit code is provided by the user, scammers gain full access to the victim's UPI application and bank account.*",
    "flair": "Crime",
    "score": 2,
    "num_comments": 1,
    "created_utc": 1706852169.0,
    "convurl": "https://external-preview.redd.it/JNzYwGi3t4U-z-WPQrvfnmBr3EATyrHRlxy_C3zpDO8.jpg?auto=webp&s=5c08eab09b1e85482502b084835c2c4b67ec260a",
    "comments": [],
    "cleaned_text": "cracking code master upi fraud management mintgenie explains mint investigations upi frauds reveal pattern followed hackers execute schemes disguising bank employees hackers extract basic information address upi apprelated issues convince users share sensitive data scammers may also trick users downloading apps provide access phones digit code provided user scammers gain full access victims upi application bank account ",
    "cleaned_title": "cracking code master upi fraud management mintgenie explains mint",
    "cleaned_selftext": "investigations upi frauds reveal pattern followed hackers execute schemes disguising bank employees hackers extract basic information address upi apprelated issues convince users share sensitive data scammers may also trick users downloading apps provide access phones digit code provided user scammers gain full access victims upi application bank account",
    "cleaned_comments": "",
    "light_cleaned_title": "Cracking the code: How to master UPI fraud management? MintGenie explains | Mint",
    "light_cleaned_selftext": "*Investigations into UPI frauds reveal a pattern followed by hackers to execute their schemes. Disguising themselves as bank employees, hackers extract basic information, address UPI app-related issues, and convince users to share sensitive data. Scammers may also trick users into downloading apps that provide access to their phones. Once a 9-digit code is provided by the user, scammers gain full access to the victim's UPI application and bank account.*",
    "light_cleaned_comments": ""
}