{
    "id": "15br373",
    "title": "ISIS Agent (Renowned doctor) caught by NIA in Pune",
    "url": "https://www.reddit.com/r/india/comments/15br373/isis_agent_renowned_doctor_caught_by_nia_in_pune/",
    "selftext": "Is education really a solution? Bcz I always heard and saw while studying that education can solve such issues. Even doctor who studied from BJ medical can be such Terrorist! And now it becomes a question of whom to trust!\n\nLink : https://indianexpress.com/article/cities/mumbai/isis-maharashtra-module-nia-arrest-8863612/",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690531534.0,
    "convurl": "https://external-preview.redd.it/03AeoLwG4SubQTtX3CLx8W06ueaqn2_PpZDlm-G6YUE.jpg",
    "comments": [
        "Better education is the answer. \n\nSTEM degrees lack focus on emotional growth, empathy and in general social problems.",
        "*We are faced with the paradoxical fact that education has become one of the chief obstacles to intelligence and freedom of thought*.\n\n - Bertrand Russell",
        "Govt should ban madarasas which gets foreign funding",
        "Might as well ban religion 🙃",
        "Govt which get votes because of religion based politics will never ban religion",
        "I’m all for banning any kind of institutionalised religious education",
        "Saw this on r/Pune. Idk if it's the same OP but the comments there were horrendous.",
        "I'll beleive when I see conviction in the court of law. I know how NIA operates specially in a BJP ruled state.",
        "Dude!"
    ],
    "cleaned_text": "isis agent renowned doctor caught nia pune education really solution bcz always heard saw studying education solve issues even doctor studied bj medical terrorist becomes question trust link ",
    "cleaned_title": "isis agent renowned doctor caught nia pune",
    "cleaned_selftext": "education really solution bcz always heard saw studying education solve issues even doctor studied bj medical terrorist becomes question trust link",
    "cleaned_comments": "better education answer stem degrees lack focus emotional growth empathy general social problems faced paradoxical fact education become one chief obstacles intelligence freedom thought bertrand russell govt ban madarasas gets foreign funding might well ban religion govt get votes religion based politics never ban religion im banning kind institutionalised religious education saw rpune idk op comments horrendous ill beleive see conviction court law know nia operates specially bjp ruled state dude",
    "light_cleaned_title": "ISIS Agent (Renowned doctor) caught by NIA in Pune",
    "light_cleaned_selftext": "Is education really a solution? Bcz I always heard and saw while studying that education can solve such issues. Even doctor who studied from BJ medical can be such Terrorist! And now it becomes a question of whom to trust! Link :",
    "light_cleaned_comments": "Better education is the answer. STEM degrees lack focus on emotional growth, empathy and in general social problems. *We are faced with the paradoxical fact that education has become one of the chief obstacles to intelligence and freedom of thought*. - Bertrand Russell Govt should ban madarasas which gets foreign funding Might as well ban religion 🙃 Govt which get votes because of religion based politics will never ban religion I’m all for banning any kind of institutionalised religious education Saw this on r/Pune. Idk if it's the same OP but the comments there were horrendous. I'll beleive when I see conviction in the court of law. I know how NIA operates specially in a BJP ruled state. Dude!"
}