{
    "id": "14rw6je",
    "title": "Can Indian police simply bulldoze homes of accused?",
    "url": "https://www.reddit.com/r/india/comments/14rw6je/can_indian_police_simply_bulldoze_homes_of_accused/",
    "selftext": "Saw this headline in The Guardian, and made me wonder - ([Indian police bulldoze home of man accused of urinating on Indigenous youth](https://www.theguardian.com/world/2023/jul/05/indian-police-bulldoze-home-of-man-accused-of-urinating-on-indigenous-youth))\n\nThe public anger in such cases is understandable. But I wonder if Indian police or authorities can simply bulldoze homes of accused?  ",
    "flair": "Law & Courts",
    "score": 446,
    "num_comments": 124,
    "created_utc": 1688613092.0,
    "convurl": "https://external-preview.redd.it/cuXHO7wbWSegqaJrwPKLRIcXwGnhBxsoIU-nmja7spA.jpg?auto=webp&v=enabled&s=feeb7c5ea836fec0609b8ee307ed7597110a85b7",
    "comments": [
        "Depends on the mood.",
        "i believe it was encroached land and the property he built on it was illegal",
        "In a fascist India they can.",
        "His house was bulldozed because it was an illegal encroachment but obviously they acted now because of the public outrage.\n\nPeople want a firm hand ruling them. They want a strong leader. They want swift vengeance.\n\nWe are fucked.",
        "no, but they do it anyway",
        "They can. \nIf you have some construction done which is illegal or on encroached land then they can. \nOr sometimes people live on completely encroached land then they can completely demolish it. Like in the case some dudes put a dog leash in a guy's neck, their complete house was demolished..\nOr in case you have built your house from gaind from criminal activities like in case of Atiq Ahmed then too building can be demolished.\n\nIf they demolish legally constructed part then gov. will have to pay for reconstruction as well as a hefty fine. Also the official who authorised it will have to face a career threat.\n\nGenerally there should be a warning, but there must be some clause which allows them to demolish it immediately.\n\nSee the whole purpose is to send a message to such people that we are tolerating your illegal encroachment but now if you try to extend beyond law then we will demolish it. \nThe reason being that normal court process takes a lot of time and sometimes decades and even then they get out on bail or love good life in jail. So this acts as an instant justice.\n\nNot ideal but surely acts as a deterrent.",
        "Lol India kab se fasist ban gya??",
        "Well man, gov can't just bulldoze anybody's house just like that, imagine the outrage by lawyers, NGO's, Opposition, International Media and activists if gov just randomly went and absolutely destroyed anybody's house. The courts will itself intervene as it will be a severe violation of right to life and the courts have indeed in some cases ordered a stay on demolition, not all though. The modus operandi that the gov uses is \"Bulldozing Encroached Land\" now even to do that you need to give a notice in prior.\n\nThe thing is that the gov or the municipality does indeed have the right to demolish a property if it's illegally build on gov's land. Now the problem of encroachment is so big in India that a lot of people do it in some form or the other, people don't even realize that footpath is also gov's property. The gov has an eye on them but doesn't take any action immediately what it does instead is keep that property as a leverage for the time when you are caught committing a crime. The moment you do so, gov acts swiftly taking your illegal property down as a form of vengeance or \"instant justice\", but even then gov can only take the illegal part down.",
        "There are no clauses that allow the police to demolish houses without a previous investigation and notice. It's pure and simple gundagardi.",
        "> gov acts swiftly taking your illegal property down as a form of vengeance or \"instant justice\", but even then gov can only take the illegal part down.\n\nThis makes sense. But this also means 'lazy' officials are really watching and keeping an account?!",
        "Ofcourse. Officials know everything. They take money for inaction",
        "Anyone who follows what's going on in the country and understands what fascism means, knows when India started turning fascist.\n\nHere is a brief description of fascism (from Wikipedia -\n\n\"Fascism is a far-right, authoritarian, ultranationalist political ideology and movement,[1][2][3] characterized by a dictatorial leader, centralized autocracy, militarism, forcible suppression of opposition, belief in a natural social hierarchy, subordination of individual interests for the perceived good of the nation and race, and strong regimentation of society and the economy.[2][3]\"\n\nJust replace\" centralized autocracy\" with \"electoral autocracy\" and it more or less describes current India.",
        "You're telling me the last 70ish years of trying to establish a rule of law with a democratic government with constitutional democratic institutions have been a complete waste, because people want a Mughal like ruler anyway ?",
        "I've said in one of earlier post on this individual that this person doesn't even deserve water if he's dying but domilishing his house now isn't right either just like domilishing property of earlier accused. One may hang this individual but what's wrong is wrong",
        "I dont think they constantly monitor things like. They only check the background when an issue that has media attention arises.",
        "*Depends upon the religion of the accused",
        "depends on the public outrage",
        "It's the new Gunda raj",
        "They take money for \"action\" too",
        "Aptly put",
        "Sab public ko please karne ke liye hai.  What wrong did the family of an accused do that their home had to be razed?\n\nAur aaj to log pooch bhi rahe Hain. Kal ko Muslims ke Ghar toote they to sab celebrate hi kar rahe they",
        "95% of the homes in India don't do the complete paperwork before and during making a house and that is their vulnerability",
        "No they cannot.\n\nIt is unlawful and illegal and abuse of power.\n\nSadly, this is the norm now.\n\nWe get the country we deserve sadly.\n\nP.S: The process to demolish an establishment/settlement is well settled in law. It lies with municipal/local administration authorities. Demolition is done after following due process viz verification of illegal establishment/settlement, issuing a vacation notice, giving time to vacate etc. Police is just there to ensure no violence occurs. Nowadays in some states Police are doing the demolition through local bodies.",
        "India can bulldoze the homes of Canadians by sending droves of Punjabi villagers over here to “study” “Web App Development”, so why not?",
        "Kahaan ka agenda kahaan jabardasti ghusaed rahe ho?",
        "Its only news when it happens to a hindu I guess. Meanwhile muslims have their homes demolished for any random thing.\n\nHindus in the US celebrating this by bringing one to a New Jersey parade.\n\nhttps://www.nytimes.com/2022/09/25/nyregion/bulldozer-indian-parade-new-jersey.html\n\nHindus in India celebrating it by bringing one to the Indian Independence day parade.\n\nhttps://www.middleeasteye.net/news/us-new-jersey-bulldozer-india-blatant-display-anti-muslim-hate",
        "When courts take 20 years to pass a judgement, it's not a wrong thing to do.",
        "The police and the gov apparatus can and do often take what people would consider unalienable possessions of themselves as in this case. \n\nUltimately the police isn’t so much a force of good but an oppressive arm of the bourgeoisie system. It’s there to defend private property. Try striking in Tata’s TCS building. At the same time they’ll demolish encroachers and squatters because you need to own the land you see- notwithstanding that the benches in the city now have bars, the shelters are few and far between and welfare is in the shitter.",
        "Last time I checked vikas Dubey etc were Hindus, did he changed his religion or what?",
        "This reminds me of the encounter killings. Same logic. That’s tacit , this is open.",
        "Like Kangana’s ? What did the high court say in Kangana case ?",
        "you really thought that the twin towers demolished in Noida were only recently found out to have been constructed on encroached land.",
        "If you’re Hindu Rashtriya what do you even care? Figure your own shit out, bhanchod",
        "If the accused were 'muslims'? Then answer is 'yes'",
        "not sure what kangana's case is about. I'd like to learn",
        "Let me correct the heading.\n\nCan Indian police simply bulldoze \"illegally build\" homes of accused?\n\nThe answer is yes, and a hundred times yes if he/she is a criminal.\n\nImmigrant travelling from one State to another living in a small hut made of plastic, even their house gets bulldoze.\n\nIt hurts but that's the way it is. So nothing to fell bad in seeing the house of criminal getting bulldozed.",
        "Whoever a politician decides to fuck up gets fucked up whatever rapists they want to celebrate get celebrated.\n\nCops are just the useful tools here. They only decisions they make are what couples to harass and how much of their bribes to keep.",
        "feeling cute, might bulldoze a house later idk",
        "In non-metro city areas, Indian police can get away doing anything. They can even counter-urinate on the youth. Indian police is, after all, just a bunch of local Indian dudes.",
        "I often wonder 3 things:\n\n1. How do all these accused whose homes are demolished always live in independent houses that can be easily demolished?\n\n2. If they happen to live in an apartment or a gated community, how will the authorities demolish their houses? Will they demolish the entire apartment thus punishing even the neighbors?\n\n3. The accused might have an aging mother, a tennaged sister, an infant baby at home? Why should they be rendered homeless for the act of their family member? Are we living in North Korea where the entire family is sent to labour camps? \n\nPls enlighten me",
        "You forgot the part where they illegally demolish homes of people protesting the government. Sometimes with fake notices written out to wrong names and not within prescribed timelines",
        "Wouldn't say complete waste, but given the fact sudhir Chaudhary was comparing law in India with law in Saudi Arabia, and still getting viewers says something to me.",
        "Please give a source i would like to know where it happened.",
        "Making money both ways",
        "It was just a cow shed , not his home. They just destroyed what was build on an encroached government land.",
        "It started with the govt demolishing homes of Muslims exclusively. This was cheered on by Hindus since they weren't affected. This has now emboldened the govt and they will now start doing the same to anyone they don't agree with. This is the first time a Hindu has been targeted in this manner.",
        "And pissing on a poor man is a human right🤡",
        "That's why I want to become a IPS.",
        "Yes coz it is a banana republic and morons from all sections of society cheer on vigilance justice.",
        "I thought Hindutva gang would support a brahman pissing on a dalit , they are just following their Dharma.",
        "If you're good you're going to get transferred to a remote village",
        "Afreen Fatima in Allahabad/Prayagraj. \n\nhttps://www.aljazeera.com/amp/news/2022/6/13/act-of-vendetta-afreen-fatima-on-her-house-bulldozed-in-india\n\nShe was involved in some protests, her father was accused of being a “mastermind” behind the protests, the government subsequently bulldozed a house that belonged to her mother alone. A house that they had paid tax to the government for more than 20 years but was somehow now illegal.",
        "Yes they can. Because we're no longer a democracy with a rule of law. Police are now state sponsored vigilantes who can destroy your homes and kill you after making accusations against you. Majority will cheer, as it fails to understand the difference between democracy with a rule of law and majoritarianism with electoral autocracy with vigilantes justice.",
        "Playing both sides so they always come out on top, though ofcourse there's income tax with their own version of that sniper pinned at the officials.",
        "Your belief is immaterial. Was due process of law followed to establish illegality and give the accused a chance to appeal government demolition order in appropriate court?",
        "Except the crime hasn't been proven, and due process of law hasn't been followed before demolition. It's people like you justifying government atrocities that are the problem.",
        "Wonder, this question is being asked too frequently because a BJP lunatic got his illegal encroachments bulldozed. Where was those people's feeling when UP gov was doing the same.  Its a facepalm of their own deeds.",
        "As Thanos said, \"Perfectly Balanced, as all things should be\"",
        "ideally, the officials who are responsible to prevent encroachment should lose their jobs when an encroachment is found but this is india.",
        "Did they follow die process of law, including giving time to appeal the demolition order?",
        "You think it's the officials? Actually its all political people and their votes . People in power don't want to act against such issues hence they never back officers",
        "UP government's enlightenment is on the way.",
        "Really informative.",
        "Backing or no backing but the officers gotta do their jobs right? What we allow or don't allow unofficially is a different thing.",
        "it was reported in the article OP linked.\n\numadbro??",
        "The govt applies the encroachment rule. \nThe govt can’t do that. The person can go to court but the govt will make it sure the case goes on for 100 years.",
        "They can’t do shit to 🅱️ulla’s home if they do something like that because the whole community will rise.  \n\nLmao",
        "> They want swift vengeance.\n\n\\*S*wift justice*, you mean.",
        "Here's what was \"reported in the article OP linked\":\n\n>Authorities also demolished his home, in Madhya Pradesh state, after it was “found to be illegally constructed”, a police officer, Ravinder Verma, told AFP. Local media showed a bulldozer taking apart the roof.\n\nNow, why do you choose to believe the words of the cops? Where do you see due process of law?\n\nThe casteist bigot was caught on video committing a heinous crime. He deserves to be prosecuted and punished according to the law. Other people living in his house may be casteist, too, but they don't deserve to be punished without due process of law proving their crimes.\n\n>umadbro??",
        "Lawyer here. \n\nKind of surprised looking at many comments here that say that the state (through police or municipal corporations) can demolish illegal constructions. \n\nNow I understand that rules vary from state to state, but isn't there a requirement for a pre-demolishing notice/hearing? Not giving a hearing *prima facie* seems unconstitutional to me. And, as far as Delhi laws are concerned, it is illegal to demolish \"permanent\" constructions without giving a show-cause notice.",
        "wow, nice!",
        "Not a lawyer. I think they have to serve a notice and give a chance to prove their legal status. I can tell you that this crap won't happen in my state Kerala. In many states, the law and order is non existent and the judiciary is impotent. People are not even aware of their legal rights.",
        "> local Indian dudes\n\nstate sponsored local indian goons.\n\nFixed that for you.",
        "https://www.google.com/amp/s/indianexpress.com/article/cities/lucknow/up-bulldozers-prayagraj-violence-afreen-fatima-house-7965836/lite/\n\nThis is gives details of the illegal construction and the side of Prayagraj District Authority.\n\nYaar thoda Al Jazeera Kam padha karo. Not even Arabs like it, its propaganda mouthpiece which destabilized the Arab region for over a decade.",
        "[I always look at this, when people talk about justice with passion ](https://youtu.be/KflQjpW6LxA)",
        "cool go protest at the police station in support of the peeing hero.",
        "Wait, there is some misunderstanding.\n\nDemolition of illegal properties and punishment for criminal activities are too different things.\n\nHis property was supposed to be demolished even if he had not done that disgusting crime.",
        "Do you not understand what exactly allowing unofficially refers to here? If they try to do something about issues that political leaders don't want touched, they can get transferred to other departments or remote regions. And this is the approach used for issues that aren't too important to the leaders, mind you. There have been many cases of officers being criminalised or even murdered because they tried to do something that someone didn't want done. It's not even just in India. \n\nWhen you live in the water, there's no point in fighting with the crocodiles - that's the mentality most people have. And when stuff like this happens - people just disappearing or dying because they pissed off the wrong people, it's not as if we as the public rise up in protest until justice is done either. There are still protesters and journalists in jail whom the average person doesn't care about. \n\nPersonally, I do think that if you know the job is too risky for you to do properly, you should quit which people don't usually do under these circumstances (then again, not like our country is teeming with job opportunities exactly). But expecting a few officers to go against the might of a politician without any backing and managing to enact much change is unrealistic. Does happen, but very rare and usually costs them their career or even life.",
        "Missed the point buddy!!",
        "A direction to someone not to do their job or look the other way has to be unofficial only na? Officially, that person has to do his job which is to prevent encroachment. His job is not to follow the verbal illegal orders of politicians. That hardly anyone does it is a different matter. Do you work in the private sector? Everything you described is unofficial but then you ask unofficially here means.",
        "Post 2014 in case u were sleeping for last 9 years or were in hibernation",
        "Well I think counter-urinating seems a just response in this case.",
        "It's being wasted because education system failed to teach democracy in school. Nobody understands how democracy truly works.",
        "They can’t. Legally they would need a court order and also clear grounds for it. Even the municipal authorities right to destroy encroachments only extends to the encroaching part and not the whole structure. The present bulldozer raj is highly illegal by any reasonable legal standard. But the SC continues to look on as usual",
        "Then how do you know?",
        "Hey, idk which type of lawyer you are but I'm asking anyway, Can I get my father arrested for domestic violence and child abuse just based on witness? Without recorded evidence? & Can I hire a lawyer & go to court directly without going to police?",
        "Agreed 💯\nOur local police OC stole my shoe. In fact robbed it. I didn't dare to say anything as he was police lol. My family laughed a lot over this.",
        "Can we add some other publications to this suspect list?",
        "When you buy a house in an advanced country they give you a 20 page contract which states that you now own a piece of land. Bureaucracy isn't all bad.",
        "Don't have to, I woke up already.  \nSo according to you guys everything post 2014 is a mess ?",
        "Still yaar it's not due process of law. \nIn civilised democracy which claims to be, swiftness with which the state moves and demolishes houses is definitely suspicious.\nAlso the way media publicises houses of Muslim perpetrators being demolished shows element of collective punishment (as the al Jazeera article claims) is false in reality. That's why I call AJ as a propaganda mouthpiece.",
        "Because not everyone is stupid.",
        "CNN, Fox, NY Times, WSJ\nIn India would be opindia, sudarshan news, national herald.\n\nThe US ones have done good journalism and still do, but a lot of times they will push the propaganda of the state. \nThey'll also post opinion pieces by people which done by \"I feel that journalism\" like Rana Ayub and Arfa. \nIn India, the ones mentioned here will post some news and will project a bigger image than reality.\n\nAny smart person will not follow anyone of these as news and social media can often act as echo chamber.\nFind out news(from any source, including these too) and then look at facts, read opposing views and then develop your understanding.\n\nAnd engage in debates with opposing views. It's informing and a lot of fun.",
        "Yes, thanks to the RW Oranges who were supporting this shit when it was happening to muslims. \n\nNow fully encouraged and enabled, the police and their overlords feel it totally acceptable for good optics and political brownie points.",
        "Welcome to banana republic!!",
        "Where is the details given here? It mentions the same stuff as the last one and even less so.\n\nIf the plot is on residential zones as opposed to public roads, then by 14years it becomes adversely possessed for the resident according to law. The encroached boundaries become legitimate.",
        "encroached land in residential zones become legitimate if no one complains for 14years",
        "Now explain why the property was not demolished till right after the man linked to bjp literally got caught on camera urinating on a human being. Was bjp protecting him, or did it make up/ discover the illegality when it was looking for something to act tough about, or was it both? Which of these scenarios makes bjp government's actions acceptable to you?",
        "The Prayagraj Development Authority’s (PDA’s) notice to Javed on June 10 said he had constructed a building against the provisions of the Uttar Pradesh Urban Planning and Development Act, 1973. “The construction of 25 x 60 feet was done without getting permission on the ground and first floor,” the notice said.\n\nIt also said Javed was served a notice on May 10 this year with May 24 being fixed as the date of hearing of his reply; it said Javed did not submit any documents and was not present – claims that are denied by Javed’s family members as well as their lawyer Roy.\n\nThe PDA notice served on Saturday said, “On May 25, 2022, the demolition order was passed, and orders were given that you should give information after demolishing the house by June 9, 2022, which you didn’t do. Hence, you are told to vacate the house by June 12, 2022, by 11 am so that action of demolition can be taken.”",
        "Still this doesn't clear the gov. but I also wouldn't go to the limits and that the residents were completely innocent.",
        "Only bjp protests in support of heinous criminals. I'm simply pointing out that your support of the government flouting the laws of the land helps the ruling party destroy our constitutional democracy.",
        "Not a law expert but I m pretty sure gov has to send a prior notice before bulldozing anything. Bcoz if not then it has a HUGE potential of misuse",
        "I did a quick google search and india does have a version of adverse possession so where would that play into this?",
        "India is a country with weak rule of law and low trust in formal justice. Courts are slow, standards of justice are often incongruent with public expectations of justice, and corruption is rampant. In such societies the public often seeks alternative means of enforcing what they perceive as justice.\n\nIn countries and societies where the rule of law is strong and valued by society, people have little reason to seek justice outside of the formal system. Also the principles of the justice system are congruent with peoples beliefs (I.E people and the system are on the same page about due process, capital punishment, or punitive vs rehabilitative justice etc.) This also is a self fulfilling prophecy because if the justice system functions as people expect, they have more reason to believe in it and it’s principles. [You can see an example of this in how it took Canada an entire year of complicated process to seize a Russian plane.](https://www.canada.ca/en/global-affairs/news/2023/06/government-of-canada-orders-seizure-of-russian-registered-cargo-aircraft-at-toronto-pearson-airport.html)\n\nOn the other hand, in societies like India, where trust in the justice system is low, people will seek alternative forms of justice. This can either be through mob justice and kangaroo courts, or by turning to gangsters and other organised crime to perform the roles of the state etc. You can see an example of this in how the Italian mafia performed the role of the state by providing better dispute resolution and security guarantees than the state could. In order to compete with these alternative justice systems, state institutions are incentivised to themselves ignore the rule of law in order to regain public trust. This happens at all levels. Whether it be the cop beating up the suspect in public, or demolition of property before due process, or parading the gangster with a chappal mala in public, or all the way to performing encounter killings. The idea is that the state will then deal with the courts later after the irreversible act is already completed. The public which expects swift justice and action that it does not get from the courts is satisfied. Courts can only offer so much as remedies once they actually hear and deal with the matter. Often courts will criticise the illegal actions of the state or sometimes in extreme situations are able to prosecute officers involved in encounter killings etc, but in most cases there are little remedies available, usually only damages as no equitable remedies are possible for irreversible acts. And this all only happens once the publics attention is shifted to other issues.",
        "There are many homes especially outside of big cities which are unauthorised constructions. Indians love to skirt rules and regulations that way. In most cases, Government doesn’t really know about this because the Government does not have resources to do regular inspections of everyone. Unlike what many posters here seem to believe, the Government is not omniscient.\n\nBut suppose someone comes under intense spotlight as the person in question did, it’s easy for the government to investigate him for all possible violations and take actions against him. In this case, after the incident, they probably found out that he has an unauthorised extension to his home and decided to go and take it down.\n\nThe demolition itself is not connected to his crime. However it is due to his crime that he has come under Government’s radar and they decided to dig deeper and find other violations he was committing.",
        "Just one shoe? From your foot?",
        "No. Both shoe. He claimed them as his. I said no look mines are brand new , I have this mark here as well but he didn't listen  I was 14 and i couldn't say anything in fear 😨",
        "Daddy likes it rough.",
        "Guys, what about the guy that stabbed that girl in Delhi in broad when passerby ignored ? What about his house? Let me guess, the Delhi guy should be from an upper caste/brahmin, lol.",
        "Also they can always justify their action saying something was illegal.\n\nThere is no proportionality. And knowing it’s india , with laws being unclear and hard to understand, and a limited practical compliance or enforcement for building laws, you can always find something illegal",
        "More than 50% of the properties in India are in some way or other illegal build, all thanks to the corrupt system in our country. Do you believe the government can afford to destroy all those properties. But if someone like these guy comes upfront himself to show his stupidity why should the government spare him when they can legally screw him, because if he was only arrested then within a month or two he would have easily gotten out on bail.\n\nRemember Nayak movie of Anil Kapoor, after his one day as CM was over, very next day BMC came to his place and removed the front wall of his house as it was illegally  built two feet ahead on the road, yes that was unethical but still legal. In fact after 1992 Bombay blasts when Dawood ran to Dubai, even his building in Dongri which was illegally built was supposed to be destroyed but because of locality interference BMC had to walk back.",
        "I knew you would focus on the publisher and not the content of that article. Regardless, none of what you said or commented elsewhere took into account the fact that the house was not in Fatima or Javed’s name. So all the alleged notices—which I’m sure we can agree were never actually given, or never given in a proper time — would have been irrelevant and false in the first place.",
        "Uska ghar Gaya, CM ne victim ke pair dho ke maafi maangi",
        "yaar the property wasn't destroyed because of the fact that Afreen Fatima's father resided in it.\n\nrather her father Javed was accused of orchestrating the Pragraj riots.  \n[https://timesofindia.indiatimes.com/city/allahabad/prayagraj-house-of-atala-violence-mastermind-razed/articleshow/92164686.cms](https://timesofindia.indiatimes.com/city/allahabad/prayagraj-house-of-atala-violence-mastermind-razed/articleshow/92164686.cms)\n\n(heavy stone pelting isn't peacefully protesting)  \n[https://www.youtube.com/watch?v=2rjtnsdsUqM](https://www.youtube.com/watch?v=2rjtnsdsUqM)  \nor if you call this as protest then tell that too.   \n\n\nthen the illegal part of the house is quoted here. -   \n\" The Prayagraj Development Authority’s (PDA’s) notice to Javed on June 10 said he had constructed a building against the provisions of the Uttar Pradesh Urban Planning and Development Act, 1973. “The construction of 25 x 60 feet was done without getting permission on the ground and first floor,” the notice said.\n\nIt also said Javed was served a notice on May 10 this year with May 24 being fixed as the date of hearing of his reply; it said Javed did not submit any documents and was not present – claims that are denied by Javed’s family members as well as their lawyer Roy.\n\nThe PDA notice served on Saturday said, “On May 25, 2022, the demolition order was passed, and orders were given that you should give information after demolishing the house by June 9, 2022, which you didn’t do. Hence, you are told to vacate the house by June 12, 2022, by 11 am so that action of demolition can be taken.”  \nSource - [https://indianexpress.com/article/cities/lucknow/up-bulldozers-prayagraj-violence-afreen-fatima-house-7965836/](https://indianexpress.com/article/cities/lucknow/up-bulldozers-prayagraj-violence-afreen-fatima-house-7965836/)\n\naccusations -  alleged he had called for a “bandh” asking people to reach the spot of protests through WhatsApp messages. also no evidence found against afreen but her father claimed that she often gives him suggestions.   \nAlso  -  police claimed recovery of country-made pistols during a search operation at Javed’s residence during the day. “During the search operation, we recovered two country-made pistols, objectionable posters, and several cartridges from the house. We also found documents with objectionable remarks on the court by Javed \n\n&#x200B;\n\nsecondly, the accusation of state-sponsored community punishment by the state is false. the data on this is pretty evident, but then the media representation to the rightist mindset definitely presents an anti-muslim mindset.  I actually across a dataset showing that demolitions are not community specific and ill post the link once i find it. \n\n&#x200B;\n\nThirdly coming to the AJ article, to prove its a propaganda mouth piece.   \n\\-  The demolition came after [days of protests](https://www.aljazeera.com/gallery/2022/6/12/photos-muslims-in-india-stage-protests-over-prophet-comments) by India’s Muslims against the anti-Islam remarks by two members of Prime Minister Narendra Modi’s Bharatiya Janata Party (BJP) earlier this month, triggering a [diplomatic backlash](https://www.aljazeera.com/news/2022/6/7/uae-joins-muslim-nations-in-slamming-india-over-prophet-remarks) against New Delhi.   \nwhat anti islam? even most respected aalims accept it as fact from Hadith.   \n\\-  Adityanath is often dubbed “bulldozer baba” (bulldozer monk) by the local media for his policy of demolishing homes of those who protest against the government. Other states have [followed suit](https://www.aljazeera.com/news/2022/4/20/india-top-court-halts-demolition-drive-in-violence-hit-new-delhi-area) even as lawyers and activists have questioned the policy’s legality.   \nProtest against him or engage in illegal activities/rioting.   \n\\- the article nowhere presents the side of PDA, police, or illegal construction of 25\\*60 ft.   \nit goes on to say that the BJP gov. is anti-Muslim and demolishes their houses on the basis of slight deviation from the norm as a form of community punishment. but in reality these demolitions happen in cases of rioting, crimes like rapes/murder etc and not \"only protesting\".\n\nis that how any journalism is done? - Quote incidents on the basis of a conversation with perpetrators disguised as victims, then w/o questioning or talking to the other side, claim this to be another case of supposed anti-muslim drive by the gov. to suppress them. And to top it off as \"News\". Is this journalism\"   \n\n\nI have also said this above - \" Still yaar it's not due process of law. In civilised democracy which claims to be, swiftness with which the state moves and demolishes houses is definitely suspicious. Also the way media publicises houses of Muslim perpetrators being demolished shows element of collective punishment (as the al Jazeera article claims) is false in reality. That's why I call AJ as a propaganda mouthpiece. \"  \nStill i can go on and on to prove AJ is a propaganda piece but youll have to commit to that debate.",
        ">Do you believe the government can afford to destroy all those properties. \n\n\n>But if someone like these guy comes upfront himself to show his stupidity why should the government spare him when they can legally screw him, because if he was only arrested then within a month or two he would have easily gotten out on bail.\n\nThe point here is that you're justifying the government not following the due process of the law. Even if the construction is illegal, the government needs to give notice, get response, make a decision, give an opportunity to appeal it in a court of law. \n\nOnce you normalise government not following the due process of law, the same tool can be employed against anyone the government doesn't like: critics, activists, protesters, opposed castes, hatred religions,  you name it. \n\nDo you believe the government should have such a huge hanging sword over the heads of \"50%\" of the population?\n\nSince you quote movies a if they were real life: do you think the government should have the power to use the threat of demolition to shut up critics like it did in vengeance against anil kapoor (i have no idea what movie you're talking about)?",
        "Fair enough, suit yourself as you want.\n\nI don't think there's anything wrong with destroying illegal properties of the criminals, for civilians government will offcourse follow the procedure before destroying it.",
        "Lmfao. Multiple state governments have already destroyed houses of people after accusing them of participating in riots without having any evidence to prove that claim. You'll be sitting on judgement on those people also, because the government has declared them to be criminals. \n\nThe government has literally imprisoned lawyers, activists, academics for years accusing them of being naxals after planting ridiculous,  probably fabricated, evidence. Couple of them have died in prison. \n\nYou'll only realize how stupid your support of the government bypassing the due process of law is, if the government comes after you or one of your loved ones. And trust me, the way these fascists are going it's only a matter of time before bulldozer becomes a go to response of the government for any criticism, real or perceived.",
        "As i said before suit yourself as you want.\n\nI voted for the  government which takes strong action against criminals and I'm happy with it, those who are not  can voice out as they are already doing, just don't break the law or else one will pay with his/her illegal properties.",
        ">just don't break the law or else one will pay with his/her illegal properties.\n\nFfs, there are multiple people who have not broken the law and imprisoned by the government. There are multiple people who have been accused by the government of breaking done law without evidence and their houses have been demolished. \n\nNot breaking the law is no guarantee that this government will not harm you. \n\nCongratulations on accepting that you voted for corrupt genocidal bigots who have made a mockery of rule of law to appeal to your bloodlust.",
        "Jai Hind. 🙏",
        "Do you have examples of these propaganda pirces? You've singled out Al Jazeera, Rana Ayyub and Arfa whoever here, so anything from them that's disputable?",
        "again---nothing of what you said even mentions the fact that the house legally had nothing to do with javed or afreen. or why if it were 'illegal' did the city accept taxes for 20 years from it.",
        "In all the other cases where houses were demonstrated, was the perpetrators a legal owner of the house? No. \nOr if you can prove otherwise.\nIn most cases the prepatrators were youth. Most probably the house was legally owned someone older, with the house having some illegal construction or to the extent that the whole house is illegal. \n\nThe state doesn't always crackdowns on illegal houses (completely illigal) or constructions cause not everyone can afford to buy land and build a house at a place of their liking (any person having a job in the city but not enough money to buy a house does this). They build illegal settlements like shags, or slums and reside there. The state understands that India has an a big poor population and if people cant afford to build proper houses so let them survive in illegal settlements as the land is not under any use right now. They don't pay property taxes as that land doesn't belong to them but they do pay other state charges like electricity bills(sometimes even illegal connections are made) or water bills. \nA lot a houses demolished were of this category.\n\nThe state has also cracked down on houses which were paying property taxes (like this case). In this case there might be sometimes there is encroachment, illegal constructions.\nSomebody here or maybe you mentioned about the 14 year rules. Yes that's fine but even that house has to have a building plan is to be passed by gov. where the house owner declares this is the house plan and I won't construct anything other than what's in the plan. In case of any construction done post this phase you again have to take permission from the local authorities (here PDA). \nAs the house is built on legally purchased land they pay property tax, even when the house still has some illegal construction (some 25*60 ft construction was illegal ie. not according to the master plan). They will pay for all other charges too. In most of the cases(50% plus is my guesstimate) houses have some sort of illegal construction. So even with them paying taxes and other connection charges for over 14 years the house can be illegal. \nNow the state generally tolerates these activities because they don't want to knock on every house, check it and then destroy some or whole of the house as it is not harming anyone else also the practice is very rampant. \nWhat the state is not willing to accept is the fact the people causing damage to other properties or engaging in other illegal activities like rioting, terrorism, spreading anti state or nation sentiments. \nThen by the virtue that a person has done something illegal and resides in that house though not legally owned by him/her can be demolished on the pretext that that house has illegal construction. \nThe demolition is a form of instant justice or added punishment by the state for engaging in illegal activities as the court cases will go on years or decades, while the perpetrators will live freely on bail only going to courts for after few months only to get few months or few years or punishment. \n\nThe deterrence to a crime is not how strict the law is, it is how strictly the existing laws are implemented. \nEarlier people would do something illegal and then live a pretty normal life as the court cases could be fought for decades in courts after courts before the tiny speck of justice is delivered. \nIn cases of engaging in illegal activities that state has now started to retaliate with full force of law, inspecting all aspects of that person and try to serve justice.\n\nAfter all this I still don't agree with this way of state action because it is only a patchwork for failure of the state is other in other aspects. \n\nBhai main tujhe itna samjha Raha hoon, agar tumhe lagta hai ye galat hue ek PIL daal do court me. Inhone 10 cr ka case kiya hai na, court me case chalne do, state attorney yahi dalil dega. \nAnd this is not something new this has been going on for years, courts have have mentioned their discontent with the action but said the municipal activities against illegal construction can't be stopped. \nAur aisa bhi nhi hai ki sirf kuch illegal karne valo ke ghar tode jaa rahe hai. Recently prayagraj me hi ek ghar tuta tha jiske baad bahu and saas committed suicide by burning themselves. Illegal kaam karne se state turant action le rahi hai. \nAnd people are happy about it because jo log rules follow kar rahe hai, laws ke Darr se unko dikh raha hai koi galat karne ke baad aise hi free nhi ghum sakta. \nThis was evident by Yogi's re-election(1st re-election in UP). \nAlso state machinery me jitne babus baithte hai, they are not stupid. They'll prefer inaction over making any mistakes (our system is made that way, which i disagree with) If the law didn't provide for legal course for Demolition they won't. Kyuki fir court will force municipality (PDA) to pay that 10cr. \n\nState tolerates a lot of illegal activities of common people like tax evasion, no proper bills, illegal constructions, traffic violations. Ghar banake dekho you'll understand that even after you try to follow all the rules how difficult and costly it gets. Adha Paisa cash me dete hai log, tax bachane ko.\n\nAb samjh aaya toh thik hai varna aap PIL daal sakte hai yaa case ka wait karlo. Result will be the same as I have mentioned."
    ],
    "cleaned_text": "indian police simply bulldoze homes accused saw headline guardian made wonder indian police bulldoze home man accused urinating indigenous youthhttpswwwtheguardiancomworldjulindianpolicebulldozehomeofmanaccusedofurinatingonindigenousyouth public anger cases understandable wonder indian police authorities simply bulldoze homes accused ",
    "cleaned_title": "indian police simply bulldoze homes accused",
    "cleaned_selftext": "saw headline guardian made wonder indian police bulldoze home man accused urinating indigenous youthhttpswwwtheguardiancomworldjulindianpolicebulldozehomeofmanaccusedofurinatingonindigenousyouth public anger cases understandable wonder indian police authorities simply bulldoze homes accused",
    "cleaned_comments": "depends mood believe encroached land property built illegal fascist india house bulldozed illegal encroachment obviously acted public outrage people want firm hand ruling want strong leader want swift vengeance fucked anyway construction done illegal encroached land sometimes people live completely encroached land completely demolish like case dudes put dog leash guys neck complete house demolished case built house gaind criminal activities like case atiq ahmed building demolished demolish legally constructed part gov pay reconstruction well hefty fine also official authorised face career threat generally warning must clause allows demolish immediately see whole purpose send message people tolerating illegal encroachment try extend beyond law demolish reason normal court process takes lot time sometimes decades even get bail love good life jail acts instant justice ideal surely acts deterrent lol india kab se fasist ban gya well man gov cant bulldoze anybodys house like imagine outrage lawyers ngos opposition international media activists gov randomly went absolutely destroyed anybodys house courts intervene severe violation right life courts indeed cases ordered stay demolition though modus operandi gov uses bulldozing encroached land even need give notice prior thing gov municipality indeed right demolish property illegally build govs land problem encroachment big india lot people form people dont even realize footpath also govs property gov eye doesnt take action immediately instead keep property leverage time caught committing crime moment gov acts swiftly taking illegal property form vengeance instant justice even gov take illegal part clauses allow police demolish houses without previous investigation notice pure simple gundagardi gov acts swiftly taking illegal property form vengeance instant justice even gov take illegal part makes sense also means lazy officials really watching keeping account ofcourse officials know everything take money inaction anyone follows whats going country understands fascism means knows india started turning fascist brief description fascism wikipedia fascism farright authoritarian ultranationalist political ideology movement characterized dictatorial leader centralized autocracy militarism forcible suppression opposition belief natural social hierarchy subordination individual interests perceived good nation race strong regimentation society economy replace centralized autocracy electoral autocracy less describes current india youre telling last ish years trying establish rule law democratic government constitutional democratic institutions complete waste people want mughal like ruler anyway ive said one earlier post individual person doesnt even deserve water hes dying domilishing house isnt right either like domilishing property earlier accused one may hang individual whats wrong wrong dont think constantly monitor things like check background issue media attention arises depends upon religion accused depends public outrage new gunda raj take money action aptly put sab public ko please karne ke liye hai wrong family accused home razed aur aaj log pooch bhi rahe hain kal ko muslims ke ghar toote sab celebrate hi kar rahe homes india dont complete paperwork making house vulnerability unlawful illegal abuse power sadly norm get country deserve sadly ps process demolish establishmentsettlement well settled law lies municipallocal administration authorities demolition done following due process viz verification illegal establishmentsettlement issuing vacation notice giving time vacate etc police ensure violence occurs nowadays states police demolition local bodies india bulldoze homes canadians sending droves punjabi villagers study web app development kahaan ka agenda kahaan jabardasti ghusaed rahe ho news happens hindu guess meanwhile muslims homes demolished random thing hindus us celebrating bringing one new jersey parade hindus india celebrating bringing one indian independence day parade courts take years pass judgement wrong thing police gov apparatus often take people would consider unalienable possessions case ultimately police isnt much force good oppressive arm bourgeoisie system defend private property try striking tatas tcs building time theyll demolish encroachers squatters need land see notwithstanding benches city bars shelters far welfare shitter last time checked vikas dubey etc hindus changed religion reminds encounter killings logic thats tacit open like kanganas high court say kangana case really thought twin towers demolished noida recently found constructed encroached land youre hindu rashtriya even care figure shit bhanchod accused muslims answer yes sure kanganas case id like learn let correct heading indian police simply bulldoze illegally build homes accused answer yes hundred times yes heshe criminal immigrant travelling one state another living small hut made plastic even house gets bulldoze hurts thats way nothing fell bad seeing house criminal getting bulldozed whoever politician decides fuck gets fucked whatever rapists want celebrate get celebrated cops useful tools decisions make couples harass much bribes keep feeling cute might bulldoze house later idk nonmetro city areas indian police get away anything even counterurinate youth indian police bunch local indian dudes often wonder things accused whose homes demolished always live independent houses easily demolished happen live apartment gated community authorities demolish houses demolish entire apartment thus punishing even neighbors accused might aging mother tennaged sister infant baby home rendered homeless act family member living north korea entire family sent labour camps pls enlighten forgot part illegally demolish homes people protesting government sometimes fake notices written wrong names within prescribed timelines wouldnt say complete waste given fact sudhir chaudhary comparing law india law saudi arabia still getting viewers says something please give source would like know happened making money ways cow shed home destroyed build encroached government land started govt demolishing homes muslims exclusively cheered hindus since werent affected emboldened govt start anyone dont agree first time hindu targeted manner pissing poor man human right thats want become ips yes coz banana republic morons sections society cheer vigilance justice thought hindutva gang would support brahman pissing dalit following dharma youre good youre going get transferred remote village afreen fatima allahabadprayagraj involved protests father accused mastermind behind protests government subsequently bulldozed house belonged mother alone house paid tax government years somehow illegal yes longer democracy rule law police state sponsored vigilantes destroy homes kill making accusations majority cheer fails understand difference democracy rule law majoritarianism electoral autocracy vigilantes justice playing sides always come top though ofcourse theres income tax version sniper pinned officials belief immaterial due process law followed establish illegality give accused chance appeal government demolition order appropriate court except crime hasnt proven due process law hasnt followed demolition people like justifying government atrocities problem wonder question asked frequently bjp lunatic got illegal encroachments bulldozed peoples feeling gov facepalm deeds thanos said perfectly balanced things ideally officials responsible prevent encroachment lose jobs encroachment found india follow die process law including giving time appeal demolition order think officials actually political people votes people power dont want act issues hence never back officers governments enlightenment way really informative backing backing officers got ta jobs right allow dont allow unofficially different thing reported article op linked umadbro govt applies encroachment rule govt cant person go court govt make sure case goes years cant shit ullas home something like whole community rise lmao want swift vengeance swift justice mean heres reported article op linked authorities also demolished home madhya pradesh state found illegally constructed police officer ravinder verma told afp local media showed bulldozer taking apart roof choose believe words cops see due process law casteist bigot caught video committing heinous crime deserves prosecuted punished according law people living house may casteist dont deserve punished without due process law proving crimes umadbro lawyer kind surprised looking many comments say state police municipal corporations demolish illegal constructions understand rules vary state state isnt requirement predemolishing noticehearing giving hearing prima facie seems unconstitutional far delhi laws concerned illegal demolish permanent constructions without giving showcause notice wow nice lawyer think serve notice give chance prove legal status tell crap wont happen state kerala many states law order non existent judiciary impotent people even aware legal rights local indian dudes state sponsored local indian goons fixed gives details illegal construction side prayagraj district authority yaar thoda al jazeera kam padha karo even arabs like propaganda mouthpiece destabilized arab region decade always look people talk justice passion httpsyoutubekflqjpwlxa cool go protest police station support peeing hero wait misunderstanding demolition illegal properties punishment criminal activities different things property supposed demolished even done disgusting crime understand exactly allowing unofficially refers try something issues political leaders dont want touched get transferred departments remote regions approach used issues arent important leaders mind many cases officers criminalised even murdered tried something someone didnt want done even india live water theres point fighting crocodiles thats mentality people stuff like happens people disappearing dying pissed wrong people public rise protest justice done either still protesters journalists jail average person doesnt care personally think know job risky properly quit people dont usually circumstances like country teeming job opportunities exactly expecting officers go might politician without backing managing enact much change unrealistic happen rare usually costs career even life missed point buddy direction someone job look way unofficial na officially person job prevent encroachment job follow verbal illegal orders politicians hardly anyone different matter work private sector everything described unofficial ask unofficially means post case u sleeping last years hibernation well think counterurinating seems response case wasted education system failed teach democracy school nobody understands democracy truly works cant legally would need court order also clear grounds even municipal authorities right destroy encroachments extends encroaching part whole structure present bulldozer raj highly illegal reasonable legal standard sc continues look usual know hey idk type lawyer im asking anyway get father arrested domestic violence child abuse based witness without recorded evidence hire lawyer go court directly without going police agreed local police oc stole shoe fact robbed didnt dare say anything police lol family laughed lot add publications suspect list buy house advanced country give page contract states piece land bureaucracy isnt bad dont woke already according guys everything post mess still yaar due process law civilised democracy claims swiftness state moves demolishes houses definitely suspicious also way media publicises houses muslim perpetrators demolished shows element collective punishment al jazeera article claims false reality thats call aj propaganda mouthpiece everyone stupid cnn fox ny times wsj india would opindia sudarshan news national herald us ones done good journalism still lot times push propaganda state theyll also post opinion pieces people done feel journalism like rana ayub arfa india ones mentioned post news project bigger image reality smart person follow anyone news social media often act echo chamber find newsfrom source including look facts read opposing views develop understanding engage debates opposing views informing lot fun yes thanks rw oranges supporting shit happening muslims fully encouraged enabled police overlords feel totally acceptable good optics political brownie points welcome banana republic details given mentions stuff last one even less plot residential zones opposed public roads years becomes adversely possessed resident according law encroached boundaries become legitimate encroached land residential zones become legitimate one complains years explain property demolished till right man linked bjp literally got caught camera urinating human bjp protecting make discover illegality looking something act tough scenarios makes bjp governments actions acceptable prayagraj development authoritys pdas notice javed june said constructed building provisions uttar pradesh urban planning development act construction x feet done without getting permission ground first floor notice said also said javed served notice may year may fixed date hearing reply said javed submit documents present claims denied javeds family members well lawyer roy pda notice served saturday said may demolition order passed orders given give information demolishing house june didnt hence told vacate house june action demolition taken still doesnt clear gov also wouldnt go limits residents completely innocent bjp protests support heinous criminals im simply pointing support government flouting laws land helps ruling party destroy constitutional democracy law expert pretty sure gov send prior notice bulldozing anything bcoz huge potential misuse quick google search india version adverse possession would play india country weak rule law low trust formal justice courts slow standards justice often incongruent public expectations justice corruption rampant societies public often seeks alternative means enforcing perceive justice countries societies rule law strong valued society people little reason seek justice outside formal system also principles justice system congruent peoples beliefs ie people system page due process capital punishment punitive vs rehabilitative justice etc also self fulfilling prophecy justice system functions people expect reason believe principles see example took canada entire year complicated process seize russian planehttpswwwcanadacaenglobalaffairsnewsgovernmentofcanadaordersseizureofrussianregisteredcargoaircraftattorontopearsonairporthtml hand societies like india trust justice system low people seek alternative forms justice either mob justice kangaroo courts turning gangsters organised crime perform roles state etc see example italian mafia performed role state providing better dispute resolution security guarantees state could order compete alternative justice systems state institutions incentivised ignore rule law order regain public trust happens levels whether cop beating suspect public demolition property due process parading gangster chappal mala public way performing encounter killings idea state deal courts later irreversible act already completed public expects swift justice action get courts satisfied courts offer much remedies actually hear deal matter often courts criticise illegal actions state sometimes extreme situations able prosecute officers involved encounter killings etc cases little remedies available usually damages equitable remedies possible irreversible acts happens publics attention shifted issues many homes especially outside big cities unauthorised constructions indians love skirt rules regulations way cases government doesnt really know government resources regular inspections everyone unlike many posters seem believe government omniscient suppose someone comes intense spotlight person question easy government investigate possible violations take actions case incident probably found unauthorised extension home decided go take demolition connected crime however due crime come governments radar decided dig deeper find violations committing one shoe foot shoe claimed said look mines brand new mark well didnt listen couldnt say anything fear daddy likes rough guys guy stabbed girl delhi broad passerby ignored house let guess delhi guy upper castebrahmin lol also always justify action saying something illegal proportionality knowing india laws unclear hard understand limited practical compliance enforcement building laws always find something illegal properties india way illegal build thanks corrupt system country believe government afford destroy properties someone like guy comes upfront show stupidity government spare legally screw arrested within month two would easily gotten bail remember nayak movie anil kapoor one day cm next day bmc came place removed front wall house illegally built two feet ahead road yes unethical still legal fact bombay blasts dawood ran dubai even building dongri illegally built supposed destroyed locality interference bmc walk back knew would focus publisher content article regardless none said commented elsewhere took account fact house fatima javeds name alleged noticeswhich im sure agree never actually given never given proper time would irrelevant false first place uska ghar gaya cm ne victim ke pair dho ke maafi maangi yaar property wasnt destroyed fact afreen fatimas father resided rather father javed accused orchestrating pragraj riots httpstimesofindiaindiatimescomcityallahabadprayagrajhouseofatalaviolencemastermindrazedarticleshowcmshttpstimesofindiaindiatimescomcityallahabadprayagrajhouseofatalaviolencemastermindrazedarticleshowcms heavy stone pelting isnt peacefully protesting httpswwwyoutubecomwatchvrjtnsdsuqmhttpswwwyoutubecomwatchvrjtnsdsuqm call protest tell illegal part house quoted prayagraj development authoritys pdas notice javed june said constructed building provisions uttar pradesh urban planning development act construction x feet done without getting permission ground first floor notice said also said javed served notice may year may fixed date hearing reply said javed submit documents present claims denied javeds family members well lawyer roy pda notice served saturday said may demolition order passed orders given give information demolishing house june didnt hence told vacate house june action demolition taken source httpsindianexpresscomarticlecitieslucknowupbulldozersprayagrajviolenceafreenfatimahousehttpsindianexpresscomarticlecitieslucknowupbulldozersprayagrajviolenceafreenfatimahouse accusations alleged called bandh asking people reach spot protests whatsapp messages also evidence found afreen father claimed often gives suggestions also police claimed recovery countrymade pistols search operation javeds residence day search operation recovered two countrymade pistols objectionable posters several cartridges house also found documents objectionable remarks court javed xb secondly accusation statesponsored community punishment state false data pretty evident media representation rightist mindset definitely presents antimuslim mindset actually across dataset showing demolitions community specific ill post link find xb thirdly coming aj article prove propaganda mouth piece demolition came days protestshttpswwwaljazeeracomgalleryphotosmuslimsinindiastageprotestsoverprophetcomments indias muslims antiislam remarks two members prime minister narendra modis bharatiya janata party bjp earlier month triggering diplomatic backlashhttpswwwaljazeeracomnewsuaejoinsmuslimnationsinslammingindiaoverprophetremarks new delhi anti islam even respected aalims accept fact hadith adityanath often dubbed bulldozer baba bulldozer monk local media policy demolishing homes protest government states followed suithttpswwwaljazeeracomnewsindiatopcourthaltsdemolitiondriveinviolencehitnewdelhiarea even lawyers activists questioned policys legality protest engage illegal activitiesrioting article nowhere presents side pda police illegal construction ft goes say bjp gov antimuslim demolishes houses basis slight deviation norm form community punishment reality demolitions happen cases rioting crimes like rapesmurder etc protesting journalism done quote incidents basis conversation perpetrators disguised victims wo questioning talking side claim another case supposed antimuslim drive gov suppress top news journalism also said still yaar due process law civilised democracy claims swiftness state moves demolishes houses definitely suspicious also way media publicises houses muslim perpetrators demolished shows element collective punishment al jazeera article claims false reality thats call aj propaganda mouthpiece still go prove aj propaganda piece youll commit debate believe government afford destroy properties someone like guy comes upfront show stupidity government spare legally screw arrested within month two would easily gotten bail point youre justifying government following due process law even construction illegal government needs give notice get response make decision give opportunity appeal court law normalise government following due process law tool employed anyone government doesnt like critics activists protesters opposed castes hatred religions name believe government huge hanging sword heads population since quote movies real life think government power use threat demolition shut critics like vengeance anil kapoor idea movie youre talking fair enough suit want dont think theres anything wrong destroying illegal properties criminals civilians government offcourse follow procedure destroying lmfao multiple state governments already destroyed houses people accusing participating riots without evidence prove claim youll sitting judgement people also government declared criminals government literally imprisoned lawyers activists academics years accusing naxals planting ridiculous probably fabricated evidence couple died prison youll realize stupid support government bypassing due process law government comes one loved ones trust way fascists going matter time bulldozer becomes go response government criticism real perceived said suit want voted government takes strong action criminals im happy voice already dont break law else one pay hisher illegal properties dont break law else one pay hisher illegal properties ffs multiple people broken law imprisoned government multiple people accused government breaking done law without evidence houses demolished breaking law guarantee government harm congratulations accepting voted corrupt genocidal bigots made mockery rule law appeal bloodlust jai hind examples propaganda pirces youve singled al jazeera rana ayyub arfa whoever anything thats disputable againnothing said even mentions fact house legally nothing javed afreen illegal city accept taxes years cases houses demonstrated perpetrators legal owner house prove otherwise cases prepatrators youth probably house legally owned someone older house illegal construction extent whole house illegal state doesnt always crackdowns illegal houses completely illigal constructions cause everyone afford buy land build house place liking person job city enough money buy house build illegal settlements like shags slums reside state understands india big poor population people cant afford build proper houses let survive illegal settlements land use right dont pay property taxes land doesnt belong pay state charges like electricity billssometimes even illegal connections made water bills lot houses demolished category state also cracked houses paying property taxes like case case might sometimes encroachment illegal constructions somebody maybe mentioned year rules yes thats fine even house building plan passed gov house owner declares house plan wont construct anything whats plan case construction done post phase take permission local authorities pda house built legally purchased land pay property tax even house still illegal construction ft construction illegal ie according master plan pay charges cases plus guesstimate houses sort illegal construction even paying taxes connection charges years house illegal state generally tolerates activities dont want knock every house check destroy whole house harming anyone else also practice rampant state willing accept fact people causing damage properties engaging illegal activities like rioting terrorism spreading anti state nation sentiments virtue person done something illegal resides house though legally owned himher demolished pretext house illegal construction demolition form instant justice added punishment state engaging illegal activities court cases go years decades perpetrators live freely bail going courts months get months years punishment deterrence crime strict law strictly existing laws implemented earlier people would something illegal live pretty normal life court cases could fought decades courts courts tiny speck justice delivered cases engaging illegal activities state started retaliate full force law inspecting aspects person try serve justice still dont agree way state action patchwork failure state aspects bhai main tujhe itna samjha raha hoon agar tumhe lagta hai ye galat hue ek pil daal court inhone cr ka case kiya hai na court case chalne state attorney yahi dalil dega something new going years courts mentioned discontent action said municipal activities illegal construction cant stopped aur aisa bhi nhi hai ki sirf kuch illegal karne valo ke ghar tode jaa rahe hai recently prayagraj hi ek ghar tuta tha jiske baad bahu saas committed suicide burning illegal kaam karne se state turant action le rahi hai people happy jo log rules follow kar rahe hai laws ke darr se unko dikh raha hai koi galat karne ke baad aise hi free nhi ghum sakta evident yogis reelectionst reelection also state machinery jitne babus baithte hai stupid theyll prefer inaction making mistakes system made way disagree law didnt provide legal course demolition wont kyuki fir court force municipality pda pay cr state tolerates lot illegal activities common people like tax evasion proper bills illegal constructions traffic violations ghar banake dekho youll understand even try follow rules difficult costly gets adha paisa cash dete hai log tax bachane ko ab samjh aaya toh thik hai varna aap pil daal sakte hai yaa case ka wait karlo result mentioned",
    "light_cleaned_title": "Can Indian police simply bulldoze homes of accused?",
    "light_cleaned_selftext": "Saw this headline in The Guardian, and made me wonder - ([Indian police bulldoze home of man accused of urinating on Indigenous youth](https://www.theguardian.com/world/2023/jul/05/indian-police-bulldoze-home-of-man-accused-of-urinating-on-indigenous-youth)) The public anger in such cases is understandable. But I wonder if Indian police or authorities can simply bulldoze homes of accused?",
    "light_cleaned_comments": "Depends on the mood. i believe it was encroached land and the property he built on it was illegal In a fascist India they can. His house was bulldozed because it was an illegal encroachment but obviously they acted now because of the public outrage. People want a firm hand ruling them. They want a strong leader. They want swift vengeance. We are fucked. no, but they do it anyway They can. If you have some construction done which is illegal or on encroached land then they can. Or sometimes people live on completely encroached land then they can completely demolish it. Like in the case some dudes put a dog leash in a guy's neck, their complete house was demolished.. Or in case you have built your house from gaind from criminal activities like in case of Atiq Ahmed then too building can be demolished. If they demolish legally constructed part then gov. will have to pay for reconstruction as well as a hefty fine. Also the official who authorised it will have to face a career threat. Generally there should be a warning, but there must be some clause which allows them to demolish it immediately. See the whole purpose is to send a message to such people that we are tolerating your illegal encroachment but now if you try to extend beyond law then we will demolish it. The reason being that normal court process takes a lot of time and sometimes decades and even then they get out on bail or love good life in jail. So this acts as an instant justice. Not ideal but surely acts as a deterrent. Lol India kab se fasist ban gya?? Well man, gov can't just bulldoze anybody's house just like that, imagine the outrage by lawyers, NGO's, Opposition, International Media and activists if gov just randomly went and absolutely destroyed anybody's house. The courts will itself intervene as it will be a severe violation of right to life and the courts have indeed in some cases ordered a stay on demolition, not all though. The modus operandi that the gov uses is \"Bulldozing Encroached Land\" now even to do that you need to give a notice in prior. The thing is that the gov or the municipality does indeed have the right to demolish a property if it's illegally build on gov's land. Now the problem of encroachment is so big in India that a lot of people do it in some form or the other, people don't even realize that footpath is also gov's property. The gov has an eye on them but doesn't take any action immediately what it does instead is keep that property as a leverage for the time when you are caught committing a crime. The moment you do so, gov acts swiftly taking your illegal property down as a form of vengeance or \"instant justice\", but even then gov can only take the illegal part down. There are no clauses that allow the police to demolish houses without a previous investigation and notice. It's pure and simple gundagardi. > gov acts swiftly taking your illegal property down as a form of vengeance or \"instant justice\", but even then gov can only take the illegal part down. This makes sense. But this also means 'lazy' officials are really watching and keeping an account?! Ofcourse. Officials know everything. They take money for inaction Anyone who follows what's going on in the country and understands what fascism means, knows when India started turning fascist. Here is a brief description of fascism (from Wikipedia - \"Fascism is a far-right, authoritarian, ultranationalist political ideology and movement,[1][2][3] characterized by a dictatorial leader, centralized autocracy, militarism, forcible suppression of opposition, belief in a natural social hierarchy, subordination of individual interests for the perceived good of the nation and race, and strong regimentation of society and the economy.[2][3]\" Just replace\" centralized autocracy\" with \"electoral autocracy\" and it more or less describes current India. You're telling me the last 70ish years of trying to establish a rule of law with a democratic government with constitutional democratic institutions have been a complete waste, because people want a Mughal like ruler anyway ? I've said in one of earlier post on this individual that this person doesn't even deserve water if he's dying but domilishing his house now isn't right either just like domilishing property of earlier accused. One may hang this individual but what's wrong is wrong I dont think they constantly monitor things like. They only check the background when an issue that has media attention arises. *Depends upon the religion of the accused depends on the public outrage It's the new Gunda raj They take money for \"action\" too Aptly put Sab public ko please karne ke liye hai. What wrong did the family of an accused do that their home had to be razed? Aur aaj to log pooch bhi rahe Hain. Kal ko Muslims ke Ghar toote they to sab celebrate hi kar rahe they 95% of the homes in India don't do the complete paperwork before and during making a house and that is their vulnerability No they cannot. It is unlawful and illegal and abuse of power. Sadly, this is the norm now. We get the country we deserve sadly. P.S: The process to demolish an establishment/settlement is well settled in law. It lies with municipal/local administration authorities. Demolition is done after following due process viz verification of illegal establishment/settlement, issuing a vacation notice, giving time to vacate etc. Police is just there to ensure no violence occurs. Nowadays in some states Police are doing the demolition through local bodies. India can bulldoze the homes of Canadians by sending droves of Punjabi villagers over here to “study” “Web App Development”, so why not? Kahaan ka agenda kahaan jabardasti ghusaed rahe ho? Its only news when it happens to a hindu I guess. Meanwhile muslims have their homes demolished for any random thing. Hindus in the US celebrating this by bringing one to a New Jersey parade. Hindus in India celebrating it by bringing one to the Indian Independence day parade. When courts take 20 years to pass a judgement, it's not a wrong thing to do. The police and the gov apparatus can and do often take what people would consider unalienable possessions of themselves as in this case. Ultimately the police isn’t so much a force of good but an oppressive arm of the bourgeoisie system. It’s there to defend private property. Try striking in Tata’s TCS building. At the same time they’ll demolish encroachers and squatters because you need to own the land you see- notwithstanding that the benches in the city now have bars, the shelters are few and far between and welfare is in the shitter. Last time I checked vikas Dubey etc were Hindus, did he changed his religion or what? This reminds me of the encounter killings. Same logic. That’s tacit , this is open. Like Kangana’s ? What did the high court say in Kangana case ? you really thought that the twin towers demolished in Noida were only recently found out to have been constructed on encroached land. If you’re Hindu Rashtriya what do you even care? Figure your own shit out, bhanchod If the accused were 'muslims'? Then answer is 'yes' not sure what kangana's case is about. I'd like to learn Let me correct the heading. Can Indian police simply bulldoze \"illegally build\" homes of accused? The answer is yes, and a hundred times yes if he/she is a criminal. Immigrant travelling from one State to another living in a small hut made of plastic, even their house gets bulldoze. It hurts but that's the way it is. So nothing to fell bad in seeing the house of criminal getting bulldozed. Whoever a politician decides to fuck up gets fucked up whatever rapists they want to celebrate get celebrated. Cops are just the useful tools here. They only decisions they make are what couples to harass and how much of their bribes to keep. feeling cute, might bulldoze a house later idk In non-metro city areas, Indian police can get away doing anything. They can even counter-urinate on the youth. Indian police is, after all, just a bunch of local Indian dudes. I often wonder 3 things: 1. How do all these accused whose homes are demolished always live in independent houses that can be easily demolished? 2. If they happen to live in an apartment or a gated community, how will the authorities demolish their houses? Will they demolish the entire apartment thus punishing even the neighbors? 3. The accused might have an aging mother, a tennaged sister, an infant baby at home? Why should they be rendered homeless for the act of their family member? Are we living in North Korea where the entire family is sent to labour camps? Pls enlighten me You forgot the part where they illegally demolish homes of people protesting the government. Sometimes with fake notices written out to wrong names and not within prescribed timelines Wouldn't say complete waste, but given the fact sudhir Chaudhary was comparing law in India with law in Saudi Arabia, and still getting viewers says something to me. Please give a source i would like to know where it happened. Making money both ways It was just a cow shed , not his home. They just destroyed what was build on an encroached government land. It started with the govt demolishing homes of Muslims exclusively. This was cheered on by Hindus since they weren't affected. This has now emboldened the govt and they will now start doing the same to anyone they don't agree with. This is the first time a Hindu has been targeted in this manner. And pissing on a poor man is a human right🤡 That's why I want to become a IPS. Yes coz it is a banana republic and morons from all sections of society cheer on vigilance justice. I thought Hindutva gang would support a brahman pissing on a dalit , they are just following their Dharma. If you're good you're going to get transferred to a remote village Afreen Fatima in Allahabad/Prayagraj. She was involved in some protests, her father was accused of being a “mastermind” behind the protests, the government subsequently bulldozed a house that belonged to her mother alone. A house that they had paid tax to the government for more than 20 years but was somehow now illegal. Yes they can. Because we're no longer a democracy with a rule of law. Police are now state sponsored vigilantes who can destroy your homes and kill you after making accusations against you. Majority will cheer, as it fails to understand the difference between democracy with a rule of law and majoritarianism with electoral autocracy with vigilantes justice. Playing both sides so they always come out on top, though ofcourse there's income tax with their own version of that sniper pinned at the officials. Your belief is immaterial. Was due process of law followed to establish illegality and give the accused a chance to appeal government demolition order in appropriate court? Except the crime hasn't been proven, and due process of law hasn't been followed before demolition. It's people like you justifying government atrocities that are the problem. Wonder, this question is being asked too frequently because a BJP lunatic got his illegal encroachments bulldozed. Where was those people's feeling when UP gov was doing the same. Its a facepalm of their own deeds. As Thanos said, \"Perfectly Balanced, as all things should be\" ideally, the officials who are responsible to prevent encroachment should lose their jobs when an encroachment is found but this is india. Did they follow die process of law, including giving time to appeal the demolition order? You think it's the officials? Actually its all political people and their votes . People in power don't want to act against such issues hence they never back officers UP government's enlightenment is on the way. Really informative. Backing or no backing but the officers gotta do their jobs right? What we allow or don't allow unofficially is a different thing. it was reported in the article OP linked. umadbro?? The govt applies the encroachment rule. The govt can’t do that. The person can go to court but the govt will make it sure the case goes on for 100 years. They can’t do shit to 🅱️ulla’s home if they do something like that because the whole community will rise. Lmao > They want swift vengeance. \\*S*wift justice*, you mean. Here's what was \"reported in the article OP linked\": >Authorities also demolished his home, in Madhya Pradesh state, after it was “found to be illegally constructed”, a police officer, Ravinder Verma, told AFP. Local media showed a bulldozer taking apart the roof. Now, why do you choose to believe the words of the cops? Where do you see due process of law? The casteist bigot was caught on video committing a heinous crime. He deserves to be prosecuted and punished according to the law. Other people living in his house may be casteist, too, but they don't deserve to be punished without due process of law proving their crimes. >umadbro?? Lawyer here. Kind of surprised looking at many comments here that say that the state (through police or municipal corporations) can demolish illegal constructions. Now I understand that rules vary from state to state, but isn't there a requirement for a pre-demolishing notice/hearing? Not giving a hearing *prima facie* seems unconstitutional to me. And, as far as Delhi laws are concerned, it is illegal to demolish \"permanent\" constructions without giving a show-cause notice. wow, nice! Not a lawyer. I think they have to serve a notice and give a chance to prove their legal status. I can tell you that this crap won't happen in my state Kerala. In many states, the law and order is non existent and the judiciary is impotent. People are not even aware of their legal rights. > local Indian dudes state sponsored local indian goons. Fixed that for you. This is gives details of the illegal construction and the side of Prayagraj District Authority. Yaar thoda Al Jazeera Kam padha karo. Not even Arabs like it, its propaganda mouthpiece which destabilized the Arab region for over a decade. [I always look at this, when people talk about justice with passion ](https://youtu.be/KflQjpW6LxA) cool go protest at the police station in support of the peeing hero. Wait, there is some misunderstanding. Demolition of illegal properties and punishment for criminal activities are too different things. His property was supposed to be demolished even if he had not done that disgusting crime. Do you not understand what exactly allowing unofficially refers to here? If they try to do something about issues that political leaders don't want touched, they can get transferred to other departments or remote regions. And this is the approach used for issues that aren't too important to the leaders, mind you. There have been many cases of officers being criminalised or even murdered because they tried to do something that someone didn't want done. It's not even just in India. When you live in the water, there's no point in fighting with the crocodiles - that's the mentality most people have. And when stuff like this happens - people just disappearing or dying because they pissed off the wrong people, it's not as if we as the public rise up in protest until justice is done either. There are still protesters and journalists in jail whom the average person doesn't care about. Personally, I do think that if you know the job is too risky for you to do properly, you should quit which people don't usually do under these circumstances (then again, not like our country is teeming with job opportunities exactly). But expecting a few officers to go against the might of a politician without any backing and managing to enact much change is unrealistic. Does happen, but very rare and usually costs them their career or even life. Missed the point buddy!! A direction to someone not to do their job or look the other way has to be unofficial only na? Officially, that person has to do his job which is to prevent encroachment. His job is not to follow the verbal illegal orders of politicians. That hardly anyone does it is a different matter. Do you work in the private sector? Everything you described is unofficial but then you ask unofficially here means. Post 2014 in case u were sleeping for last 9 years or were in hibernation Well I think counter-urinating seems a just response in this case. It's being wasted because education system failed to teach democracy in school. Nobody understands how democracy truly works. They can’t. Legally they would need a court order and also clear grounds for it. Even the municipal authorities right to destroy encroachments only extends to the encroaching part and not the whole structure. The present bulldozer raj is highly illegal by any reasonable legal standard. But the SC continues to look on as usual Then how do you know? Hey, idk which type of lawyer you are but I'm asking anyway, Can I get my father arrested for domestic violence and child abuse just based on witness? Without recorded evidence? & Can I hire a lawyer & go to court directly without going to police? Agreed 💯 Our local police OC stole my shoe. In fact robbed it. I didn't dare to say anything as he was police lol. My family laughed a lot over this. Can we add some other publications to this suspect list? When you buy a house in an advanced country they give you a 20 page contract which states that you now own a piece of land. Bureaucracy isn't all bad. Don't have to, I woke up already. So according to you guys everything post 2014 is a mess ? Still yaar it's not due process of law. In civilised democracy which claims to be, swiftness with which the state moves and demolishes houses is definitely suspicious. Also the way media publicises houses of Muslim perpetrators being demolished shows element of collective punishment (as the al Jazeera article claims) is false in reality. That's why I call AJ as a propaganda mouthpiece. Because not everyone is stupid. CNN, Fox, NY Times, WSJ In India would be opindia, sudarshan news, national herald. The US ones have done good journalism and still do, but a lot of times they will push the propaganda of the state. They'll also post opinion pieces by people which done by \"I feel that journalism\" like Rana Ayub and Arfa. In India, the ones mentioned here will post some news and will project a bigger image than reality. Any smart person will not follow anyone of these as news and social media can often act as echo chamber. Find out news(from any source, including these too) and then look at facts, read opposing views and then develop your understanding. And engage in debates with opposing views. It's informing and a lot of fun. Yes, thanks to the RW Oranges who were supporting this shit when it was happening to muslims. Now fully encouraged and enabled, the police and their overlords feel it totally acceptable for good optics and political brownie points. Welcome to banana republic!! Where is the details given here? It mentions the same stuff as the last one and even less so. If the plot is on residential zones as opposed to public roads, then by 14years it becomes adversely possessed for the resident according to law. The encroached boundaries become legitimate. encroached land in residential zones become legitimate if no one complains for 14years Now explain why the property was not demolished till right after the man linked to bjp literally got caught on camera urinating on a human being. Was bjp protecting him, or did it make up/ discover the illegality when it was looking for something to act tough about, or was it both? Which of these scenarios makes bjp government's actions acceptable to you? The Prayagraj Development Authority’s (PDA’s) notice to Javed on June 10 said he had constructed a building against the provisions of the Uttar Pradesh Urban Planning and Development Act, 1973. “The construction of 25 x 60 feet was done without getting permission on the ground and first floor,” the notice said. It also said Javed was served a notice on May 10 this year with May 24 being fixed as the date of hearing of his reply; it said Javed did not submit any documents and was not present – claims that are denied by Javed’s family members as well as their lawyer Roy. The PDA notice served on Saturday said, “On May 25, 2022, the demolition order was passed, and orders were given that you should give information after demolishing the house by June 9, 2022, which you didn’t do. Hence, you are told to vacate the house by June 12, 2022, by 11 am so that action of demolition can be taken.” Still this doesn't clear the gov. but I also wouldn't go to the limits and that the residents were completely innocent. Only bjp protests in support of heinous criminals. I'm simply pointing out that your support of the government flouting the laws of the land helps the ruling party destroy our constitutional democracy. Not a law expert but I m pretty sure gov has to send a prior notice before bulldozing anything. Bcoz if not then it has a HUGE potential of misuse I did a quick google search and india does have a version of adverse possession so where would that play into this? India is a country with weak rule of law and low trust in formal justice. Courts are slow, standards of justice are often incongruent with public expectations of justice, and corruption is rampant. In such societies the public often seeks alternative means of enforcing what they perceive as justice. In countries and societies where the rule of law is strong and valued by society, people have little reason to seek justice outside of the formal system. Also the principles of the justice system are congruent with peoples beliefs (I.E people and the system are on the same page about due process, capital punishment, or punitive vs rehabilitative justice etc.) This also is a self fulfilling prophecy because if the justice system functions as people expect, they have more reason to believe in it and it’s principles. [You can see an example of this in how it took Canada an entire year of complicated process to seize a Russian plane.](https://www.canada.ca/en/global-affairs/news/2023/06/government-of-canada-orders-seizure-of-russian-registered-cargo-aircraft-at-toronto-pearson-airport.html) On the other hand, in societies like India, where trust in the justice system is low, people will seek alternative forms of justice. This can either be through mob justice and kangaroo courts, or by turning to gangsters and other organised crime to perform the roles of the state etc. You can see an example of this in how the Italian mafia performed the role of the state by providing better dispute resolution and security guarantees than the state could. In order to compete with these alternative justice systems, state institutions are incentivised to themselves ignore the rule of law in order to regain public trust. This happens at all levels. Whether it be the cop beating up the suspect in public, or demolition of property before due process, or parading the gangster with a chappal mala in public, or all the way to performing encounter killings. The idea is that the state will then deal with the courts later after the irreversible act is already completed. The public which expects swift justice and action that it does not get from the courts is satisfied. Courts can only offer so much as remedies once they actually hear and deal with the matter. Often courts will criticise the illegal actions of the state or sometimes in extreme situations are able to prosecute officers involved in encounter killings etc, but in most cases there are little remedies available, usually only damages as no equitable remedies are possible for irreversible acts. And this all only happens once the publics attention is shifted to other issues. There are many homes especially outside of big cities which are unauthorised constructions. Indians love to skirt rules and regulations that way. In most cases, Government doesn’t really know about this because the Government does not have resources to do regular inspections of everyone. Unlike what many posters here seem to believe, the Government is not omniscient. But suppose someone comes under intense spotlight as the person in question did, it’s easy for the government to investigate him for all possible violations and take actions against him. In this case, after the incident, they probably found out that he has an unauthorised extension to his home and decided to go and take it down. The demolition itself is not connected to his crime. However it is due to his crime that he has come under Government’s radar and they decided to dig deeper and find other violations he was committing. Just one shoe? From your foot? No. Both shoe. He claimed them as his. I said no look mines are brand new , I have this mark here as well but he didn't listen I was 14 and i couldn't say anything in fear 😨 Daddy likes it rough. Guys, what about the guy that stabbed that girl in Delhi in broad when passerby ignored ? What about his house? Let me guess, the Delhi guy should be from an upper caste/brahmin, lol. Also they can always justify their action saying something was illegal. There is no proportionality. And knowing it’s india , with laws being unclear and hard to understand, and a limited practical compliance or enforcement for building laws, you can always find something illegal More than 50% of the properties in India are in some way or other illegal build, all thanks to the corrupt system in our country. Do you believe the government can afford to destroy all those properties. But if someone like these guy comes upfront himself to show his stupidity why should the government spare him when they can legally screw him, because if he was only arrested then within a month or two he would have easily gotten out on bail. Remember Nayak movie of Anil Kapoor, after his one day as CM was over, very next day BMC came to his place and removed the front wall of his house as it was illegally built two feet ahead on the road, yes that was unethical but still legal. In fact after 1992 Bombay blasts when Dawood ran to Dubai, even his building in Dongri which was illegally built was supposed to be destroyed but because of locality interference BMC had to walk back. I knew you would focus on the publisher and not the content of that article. Regardless, none of what you said or commented elsewhere took into account the fact that the house was not in Fatima or Javed’s name. So all the alleged notices—which I’m sure we can agree were never actually given, or never given in a proper time — would have been irrelevant and false in the first place. Uska ghar Gaya, CM ne victim ke pair dho ke maafi maangi yaar the property wasn't destroyed because of the fact that Afreen Fatima's father resided in it. rather her father Javed was accused of orchestrating the Pragraj riots. [https://timesofindia.indiatimes.com/city/allahabad/prayagraj-house-of-atala-violence-mastermind-razed/articleshow/92164686.cms](https://timesofindia.indiatimes.com/city/allahabad/prayagraj-house-of-atala-violence-mastermind-razed/articleshow/92164686.cms) (heavy stone pelting isn't peacefully protesting) [https://www.youtube.com/watch?v=2rjtnsdsUqM](https://www.youtube.com/watch?v=2rjtnsdsUqM) or if you call this as protest then tell that too. then the illegal part of the house is quoted here. - \" The Prayagraj Development Authority’s (PDA’s) notice to Javed on June 10 said he had constructed a building against the provisions of the Uttar Pradesh Urban Planning and Development Act, 1973. “The construction of 25 x 60 feet was done without getting permission on the ground and first floor,” the notice said. It also said Javed was served a notice on May 10 this year with May 24 being fixed as the date of hearing of his reply; it said Javed did not submit any documents and was not present – claims that are denied by Javed’s family members as well as their lawyer Roy. The PDA notice served on Saturday said, “On May 25, 2022, the demolition order was passed, and orders were given that you should give information after demolishing the house by June 9, 2022, which you didn’t do. Hence, you are told to vacate the house by June 12, 2022, by 11 am so that action of demolition can be taken.” Source - [https://indianexpress.com/article/cities/lucknow/up-bulldozers-prayagraj-violence-afreen-fatima-house-7965836/](https://indianexpress.com/article/cities/lucknow/up-bulldozers-prayagraj-violence-afreen-fatima-house-7965836/) accusations - alleged he had called for a “bandh” asking people to reach the spot of protests through WhatsApp messages. also no evidence found against afreen but her father claimed that she often gives him suggestions. Also - police claimed recovery of country-made pistols during a search operation at Javed’s residence during the day. “During the search operation, we recovered two country-made pistols, objectionable posters, and several cartridges from the house. We also found documents with objectionable remarks on the court by Javed &#x200B; secondly, the accusation of state-sponsored community punishment by the state is false. the data on this is pretty evident, but then the media representation to the rightist mindset definitely presents an anti-muslim mindset. I actually across a dataset showing that demolitions are not community specific and ill post the link once i find it. &#x200B; Thirdly coming to the AJ article, to prove its a propaganda mouth piece. \\- The demolition came after [days of protests](https://www.aljazeera.com/gallery/2022/6/12/photos-muslims-in-india-stage-protests-over-prophet-comments) by India’s Muslims against the anti-Islam remarks by two members of Prime Minister Narendra Modi’s Bharatiya Janata Party (BJP) earlier this month, triggering a [diplomatic backlash](https://www.aljazeera.com/news/2022/6/7/uae-joins-muslim-nations-in-slamming-india-over-prophet-remarks) against New Delhi. what anti islam? even most respected aalims accept it as fact from Hadith. \\- Adityanath is often dubbed “bulldozer baba” (bulldozer monk) by the local media for his policy of demolishing homes of those who protest against the government. Other states have [followed suit](https://www.aljazeera.com/news/2022/4/20/india-top-court-halts-demolition-drive-in-violence-hit-new-delhi-area) even as lawyers and activists have questioned the policy’s legality. Protest against him or engage in illegal activities/rioting. \\- the article nowhere presents the side of PDA, police, or illegal construction of 25\\*60 ft. it goes on to say that the BJP gov. is anti-Muslim and demolishes their houses on the basis of slight deviation from the norm as a form of community punishment. but in reality these demolitions happen in cases of rioting, crimes like rapes/murder etc and not \"only protesting\". is that how any journalism is done? - Quote incidents on the basis of a conversation with perpetrators disguised as victims, then w/o questioning or talking to the other side, claim this to be another case of supposed anti-muslim drive by the gov. to suppress them. And to top it off as \"News\". Is this journalism\" I have also said this above - \" Still yaar it's not due process of law. In civilised democracy which claims to be, swiftness with which the state moves and demolishes houses is definitely suspicious. Also the way media publicises houses of Muslim perpetrators being demolished shows element of collective punishment (as the al Jazeera article claims) is false in reality. That's why I call AJ as a propaganda mouthpiece. \" Still i can go on and on to prove AJ is a propaganda piece but youll have to commit to that debate. >Do you believe the government can afford to destroy all those properties. >But if someone like these guy comes upfront himself to show his stupidity why should the government spare him when they can legally screw him, because if he was only arrested then within a month or two he would have easily gotten out on bail. The point here is that you're justifying the government not following the due process of the law. Even if the construction is illegal, the government needs to give notice, get response, make a decision, give an opportunity to appeal it in a court of law. Once you normalise government not following the due process of law, the same tool can be employed against anyone the government doesn't like: critics, activists, protesters, opposed castes, hatred religions, you name it. Do you believe the government should have such a huge hanging sword over the heads of \"50%\" of the population? Since you quote movies a if they were real life: do you think the government should have the power to use the threat of demolition to shut up critics like it did in vengeance against anil kapoor (i have no idea what movie you're talking about)? Fair enough, suit yourself as you want. I don't think there's anything wrong with destroying illegal properties of the criminals, for civilians government will offcourse follow the procedure before destroying it. Lmfao. Multiple state governments have already destroyed houses of people after accusing them of participating in riots without having any evidence to prove that claim. You'll be sitting on judgement on those people also, because the government has declared them to be criminals. The government has literally imprisoned lawyers, activists, academics for years accusing them of being naxals after planting ridiculous, probably fabricated, evidence. Couple of them have died in prison. You'll only realize how stupid your support of the government bypassing the due process of law is, if the government comes after you or one of your loved ones. And trust me, the way these fascists are going it's only a matter of time before bulldozer becomes a go to response of the government for any criticism, real or perceived. As i said before suit yourself as you want. I voted for the government which takes strong action against criminals and I'm happy with it, those who are not can voice out as they are already doing, just don't break the law or else one will pay with his/her illegal properties. >just don't break the law or else one will pay with his/her illegal properties. Ffs, there are multiple people who have not broken the law and imprisoned by the government. There are multiple people who have been accused by the government of breaking done law without evidence and their houses have been demolished. Not breaking the law is no guarantee that this government will not harm you. Congratulations on accepting that you voted for corrupt genocidal bigots who have made a mockery of rule of law to appeal to your bloodlust. Jai Hind. 🙏 Do you have examples of these propaganda pirces? You've singled out Al Jazeera, Rana Ayyub and Arfa whoever here, so anything from them that's disputable? again---nothing of what you said even mentions the fact that the house legally had nothing to do with javed or afreen. or why if it were 'illegal' did the city accept taxes for 20 years from it. In all the other cases where houses were demonstrated, was the perpetrators a legal owner of the house? No. Or if you can prove otherwise. In most cases the prepatrators were youth. Most probably the house was legally owned someone older, with the house having some illegal construction or to the extent that the whole house is illegal. The state doesn't always crackdowns on illegal houses (completely illigal) or constructions cause not everyone can afford to buy land and build a house at a place of their liking (any person having a job in the city but not enough money to buy a house does this). They build illegal settlements like shags, or slums and reside there. The state understands that India has an a big poor population and if people cant afford to build proper houses so let them survive in illegal settlements as the land is not under any use right now. They don't pay property taxes as that land doesn't belong to them but they do pay other state charges like electricity bills(sometimes even illegal connections are made) or water bills. A lot a houses demolished were of this category. The state has also cracked down on houses which were paying property taxes (like this case). In this case there might be sometimes there is encroachment, illegal constructions. Somebody here or maybe you mentioned about the 14 year rules. Yes that's fine but even that house has to have a building plan is to be passed by gov. where the house owner declares this is the house plan and I won't construct anything other than what's in the plan. In case of any construction done post this phase you again have to take permission from the local authorities (here PDA). As the house is built on legally purchased land they pay property tax, even when the house still has some illegal construction (some 25*60 ft construction was illegal ie. not according to the master plan). They will pay for all other charges too. In most of the cases(50% plus is my guesstimate) houses have some sort of illegal construction. So even with them paying taxes and other connection charges for over 14 years the house can be illegal. Now the state generally tolerates these activities because they don't want to knock on every house, check it and then destroy some or whole of the house as it is not harming anyone else also the practice is very rampant. What the state is not willing to accept is the fact the people causing damage to other properties or engaging in other illegal activities like rioting, terrorism, spreading anti state or nation sentiments. Then by the virtue that a person has done something illegal and resides in that house though not legally owned by him/her can be demolished on the pretext that that house has illegal construction. The demolition is a form of instant justice or added punishment by the state for engaging in illegal activities as the court cases will go on years or decades, while the perpetrators will live freely on bail only going to courts for after few months only to get few months or few years or punishment. The deterrence to a crime is not how strict the law is, it is how strictly the existing laws are implemented. Earlier people would do something illegal and then live a pretty normal life as the court cases could be fought for decades in courts after courts before the tiny speck of justice is delivered. In cases of engaging in illegal activities that state has now started to retaliate with full force of law, inspecting all aspects of that person and try to serve justice. After all this I still don't agree with this way of state action because it is only a patchwork for failure of the state is other in other aspects. Bhai main tujhe itna samjha Raha hoon, agar tumhe lagta hai ye galat hue ek PIL daal do court me. Inhone 10 cr ka case kiya hai na, court me case chalne do, state attorney yahi dalil dega. And this is not something new this has been going on for years, courts have have mentioned their discontent with the action but said the municipal activities against illegal construction can't be stopped. Aur aisa bhi nhi hai ki sirf kuch illegal karne valo ke ghar tode jaa rahe hai. Recently prayagraj me hi ek ghar tuta tha jiske baad bahu and saas committed suicide by burning themselves. Illegal kaam karne se state turant action le rahi hai. And people are happy about it because jo log rules follow kar rahe hai, laws ke Darr se unko dikh raha hai koi galat karne ke baad aise hi free nhi ghum sakta. This was evident by Yogi's re-election(1st re-election in UP). Also state machinery me jitne babus baithte hai, they are not stupid. They'll prefer inaction over making any mistakes (our system is made that way, which i disagree with) If the law didn't provide for legal course for Demolition they won't. Kyuki fir court will force municipality (PDA) to pay that 10cr. State tolerates a lot of illegal activities of common people like tax evasion, no proper bills, illegal constructions, traffic violations. Ghar banake dekho you'll understand that even after you try to follow all the rules how difficult and costly it gets. Adha Paisa cash me dete hai log, tax bachane ko. Ab samjh aaya toh thik hai varna aap PIL daal sakte hai yaa case ka wait karlo. Result will be the same as I have mentioned."
}