{
    "id": "1546awq",
    "title": "Hot water issues with the tap",
    "url": "https://www.reddit.com/gallery/1546awq",
    "selftext": "Not even sure if this is the right subreddit for this but here we go. Recently installed Havells Geyser and the  tap has a filter that can be removed( pictures attached). Issue is when I remove the tap, the water flow is good cause no fiker and the hot water flows out really well. When I attach the filter back on, the temperature of the water drastically reduces and it becomes very lukewarm and sometimes even cold. I need the filter to be there cause it filters salt particles and dust. Has anyone experienced this? How is this happening? Should I just replace the tap?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689799286.0,
    "convurl": "https://i.redd.it/1dxhhk9ugzcb1.jpg",
    "comments": [
        "Check with a hardware store, they should likely have a replacement filter. I periodically replace the screw-on filter on my normal taps (bath, kitchen, washbasin etc.) every once in a while after the filter gets clogged. It costs around 10 or 15 rupees a piece.",
        "Thank you. Do you think a faulty filter can reduce the temperature of the water? I will definitely replace it and see if it works. Thanks again.",
        "Logically it seems unlikely but I am not an expert in this :)"
    ],
    "cleaned_text": "hot water issues tap even sure right subreddit go recently installed havells geyser tap filter removed pictures attached issue remove tap water flow good cause fiker hot water flows really well attach filter back temperature water drastically reduces becomes lukewarm sometimes even cold need filter cause filters salt particles dust anyone experienced happening replace tap ",
    "cleaned_title": "hot water issues tap",
    "cleaned_selftext": "even sure right subreddit go recently installed havells geyser tap filter removed pictures attached issue remove tap water flow good cause fiker hot water flows really well attach filter back temperature water drastically reduces becomes lukewarm sometimes even cold need filter cause filters salt particles dust anyone experienced happening replace tap",
    "cleaned_comments": "check hardware store likely replacement filter periodically replace screwon filter normal taps bath kitchen washbasin etc every filter gets clogged costs around rupees piece thank think faulty filter reduce temperature water definitely replace see works thanks logically seems unlikely expert",
    "light_cleaned_title": "Hot water issues with the tap",
    "light_cleaned_selftext": "Not even sure if this is the right subreddit for this but here we go. Recently installed Havells Geyser and the tap has a filter that can be removed( pictures attached). Issue is when I remove the tap, the water flow is good cause no fiker and the hot water flows out really well. When I attach the filter back on, the temperature of the water drastically reduces and it becomes very lukewarm and sometimes even cold. I need the filter to be there cause it filters salt particles and dust. Has anyone experienced this? How is this happening? Should I just replace the tap?",
    "light_cleaned_comments": "Check with a hardware store, they should likely have a replacement filter. I periodically replace the screw-on filter on my normal taps (bath, kitchen, washbasin etc.) every once in a while after the filter gets clogged. It costs around 10 or 15 rupees a piece. Thank you. Do you think a faulty filter can reduce the temperature of the water? I will definitely replace it and see if it works. Thanks again. Logically it seems unlikely but I am not an expert in this :)"
}