{
    "id": "1fxg34c",
    "title": "Flipkart's Predatory Offers Modus of Operandi.",
    "url": "https://www.reddit.com/gallery/1fxg34c",
    "selftext": "Flipkart announces some ridiculously unbelievable offers during the Big Billion Days, like this year's S23 was priced at 38K.\n\nInitially, they promised a next day delivery (see image1). They when you click on the product, still it's next day delivery (refer image 2).\n\nAfter you add to cart, the delivery date gets pushed by more than a week. This is not for just one city, I cross checked with multiple metro pin codes. Please check the subsequent images.\n\nNow after you make the payment, you gotta wait until a week before you get a shipping confirmation.\n\nHere is the catch, after a week they cancel your order without any reason. \n\nSo why is this predatory?\n\nNot all have the previllige of paying using a credit card or have room for making multiple payments across different websites.\n\nThis basically blocks the money and prevents people from buying from other sites with genuine offers.",
    "flair": "Rant / Vent",
    "score": 26,
    "num_comments": 6,
    "created_utc": 1728220055.0,
    "convurl": "https://i.redd.it/05l36rohx4td1.jpg",
    "comments": [
        "Wait until you hear about platform fees, offer handling fees, promise fee, secure packaging fees.",
        "r/fuckflipkart",
        "The Sun would rise in West if Flipkart stopped scamming..",
        "They are just selling refurbished devices but showing them as brand new.",
        "It's frustrating to see companies like Flipkart engage in these shady practices, yet people still wonder why India isn't on par with the West. The problem isn't a lack of effort; it's a lack of vision. Many here work hard, but they aren't thinking smart. There's no drive to create something truly innovative or game-changing, like what Steve Jobs did with Apple. Instead, we keep seeing the same cycle; companies trying to look big with empty promises, like these unbelievable discounts, but failing to deliver real value.\n\nTrue patriotism isn't just about waving a flag or following the crowd; it’s about doing something good for the country by your own effort. Every person’s success matters, like drops of water in a desert. If everyone starts thinking in the right direction, with a vision to genuinely improve things, the collective impact would be monumental. It’s not just about one extraordinary person making headlines; it’s about each of us contributing to something bigger, where every effort counts."
    ],
    "cleaned_text": "flipkarts predatory offers modus operandi flipkart announces ridiculously unbelievable offers big billion days like years priced k initially promised next day delivery see image click product still next day delivery refer image add cart delivery date gets pushed week one city cross checked multiple metro pin codes please check subsequent images make payment got ta wait week get shipping confirmation catch week cancel order without reason predatory previllige paying using credit card room making multiple payments across different websites basically blocks money prevents people buying sites genuine offers ",
    "cleaned_title": "flipkarts predatory offers modus operandi",
    "cleaned_selftext": "flipkart announces ridiculously unbelievable offers big billion days like years priced k initially promised next day delivery see image click product still next day delivery refer image add cart delivery date gets pushed week one city cross checked multiple metro pin codes please check subsequent images make payment got ta wait week get shipping confirmation catch week cancel order without reason predatory previllige paying using credit card room making multiple payments across different websites basically blocks money prevents people buying sites genuine offers",
    "cleaned_comments": "wait hear platform fees offer handling fees promise fee secure packaging fees rfuckflipkart sun would rise west flipkart stopped scamming selling refurbished devices showing brand new frustrating see companies like flipkart engage shady practices yet people still wonder india isnt par west problem isnt lack effort lack vision many work hard arent thinking smart theres drive create something truly innovative gamechanging like steve jobs apple instead keep seeing cycle companies trying look big empty promises like unbelievable discounts failing deliver real value true patriotism isnt waving flag following crowd something good country effort every persons success matters like drops water desert everyone starts thinking right direction vision genuinely improve things collective impact would monumental one extraordinary person making headlines us contributing something bigger every effort counts",
    "light_cleaned_title": "Flipkart's Predatory Offers Modus of Operandi.",
    "light_cleaned_selftext": "Flipkart announces some ridiculously unbelievable offers during the Big Billion Days, like this year's S23 was priced at 38K. Initially, they promised a next day delivery (see image1). They when you click on the product, still it's next day delivery (refer image 2). After you add to cart, the delivery date gets pushed by more than a week. This is not for just one city, I cross checked with multiple metro pin codes. Please check the subsequent images. Now after you make the payment, you gotta wait until a week before you get a shipping confirmation. Here is the catch, after a week they cancel your order without any reason. So why is this predatory? Not all have the previllige of paying using a credit card or have room for making multiple payments across different websites. This basically blocks the money and prevents people from buying from other sites with genuine offers.",
    "light_cleaned_comments": "Wait until you hear about platform fees, offer handling fees, promise fee, secure packaging fees. r/fuckflipkart The Sun would rise in West if Flipkart stopped scamming.. They are just selling refurbished devices but showing them as brand new. It's frustrating to see companies like Flipkart engage in these shady practices, yet people still wonder why India isn't on par with the West. The problem isn't a lack of effort; it's a lack of vision. Many here work hard, but they aren't thinking smart. There's no drive to create something truly innovative or game-changing, like what Steve Jobs did with Apple. Instead, we keep seeing the same cycle; companies trying to look big with empty promises, like these unbelievable discounts, but failing to deliver real value. True patriotism isn't just about waving a flag or following the crowd; it’s about doing something good for the country by your own effort. Every person’s success matters, like drops of water in a desert. If everyone starts thinking in the right direction, with a vision to genuinely improve things, the collective impact would be monumental. It’s not just about one extraordinary person making headlines; it’s about each of us contributing to something bigger, where every effort counts."
}