{
    "id": "1806htl",
    "title": "PM Modi promises fuel price review if BJP wins in Rajasthan | Latest News India - Hindustan Times",
    "url": "https://www.hindustantimes.com/india-news/pm-modi-promises-fuel-price-review-if-bjp-wins-in-rajasthan-101700467138114.html",
    "selftext": ">Addressing a public rally in Pali, Modi said, #####“In the neighbouring states of Rajasthan, there is a BJP government. There, petrol is ₹97 per litre. But the Congress government in Rajasthan sells petrol at higher prices.”\n\n>*“I give a guarantee that after the BJP government is formed, the prices of petrol and diesel will be reviewed... This will give relief to the poor and middle-class people,”* he added.\n\n>Modi also targeted the Congress government over the rising cases of crimes against women in Rajasthan, claiming that the grand old party has made the state number one in such incidents.\n\n>*\"Congress has made Rajasthan number one in crimes against women. The CM says that the complaints filed by the women are fake. Can it ever happen that a woman in our country files a fake case? The CM should say that a probe is underway, and not that the cases filed are fake. Isn't this an insult to women?\"* he said.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1700534466.0,
    "convurl": "https://external-preview.redd.it/UpL1-tfuSfVu4ElCC_y7Y6Gsf3M_WZLx2H_ggWJidko.jpg",
    "comments": [],
    "cleaned_text": "pm modi promises fuel price review bjp wins rajasthan latest news india hindustan times addressing public rally pali modi said neighbouring states rajasthan bjp government petrol per litre congress government rajasthan sells petrol higher prices give guarantee bjp government formed prices petrol diesel reviewed give relief poor middleclass people added modi also targeted congress government rising cases crimes women rajasthan claiming grand old party made state number one incidents congress made rajasthan number one crimes women cm says complaints filed women fake ever happen woman country files fake case cm say probe underway cases filed fake isnt insult women said ",
    "cleaned_title": "pm modi promises fuel price review bjp wins rajasthan latest news india hindustan times",
    "cleaned_selftext": "addressing public rally pali modi said neighbouring states rajasthan bjp government petrol per litre congress government rajasthan sells petrol higher prices give guarantee bjp government formed prices petrol diesel reviewed give relief poor middleclass people added modi also targeted congress government rising cases crimes women rajasthan claiming grand old party made state number one incidents congress made rajasthan number one crimes women cm says complaints filed women fake ever happen woman country files fake case cm say probe underway cases filed fake isnt insult women said",
    "cleaned_comments": "",
    "light_cleaned_title": "PM Modi promises fuel price review if BJP wins in Rajasthan | Latest News India - Hindustan Times",
    "light_cleaned_selftext": ">Addressing a public rally in Pali, Modi said, #####“In the neighbouring states of Rajasthan, there is a BJP government. There, petrol is ₹97 per litre. But the Congress government in Rajasthan sells petrol at higher prices.” >*“I give a guarantee that after the BJP government is formed, the prices of petrol and diesel will be reviewed... This will give relief to the poor and middle-class people,”* he added. >Modi also targeted the Congress government over the rising cases of crimes against women in Rajasthan, claiming that the grand old party has made the state number one in such incidents. >*\"Congress has made Rajasthan number one in crimes against women. The CM says that the complaints filed by the women are fake. Can it ever happen that a woman in our country files a fake case? The CM should say that a probe is underway, and not that the cases filed are fake. Isn't this an insult to women?\"* he said.",
    "light_cleaned_comments": ""
}