{
    "id": "1c2ypox",
    "title": "Worli rape case accused gets pre-arrest bail in assault of 21-year-old woman",
    "url": "https://www.hindustantimes.com/cities/mumbai-news/worli-rape-case-accused-gets-pre-arrest-bail-101712950235839.html",
    "selftext": ">\"The complaint seems like a result of spite from the first informant. The allegations against the applicant appear to be driven by ill will, possibly to damage his reputation and seek financial gain, given his and his family’s respected status in society,” said the application.\n\n>The application also mentioned that the informant voluntarily chose the places to visit that night, asserting that neither of them were intoxicated.\n\n>Strongly denying the accusations, the informant filed an application opposing his plea, stating that the incident was premeditated and carefully planned. She explained that she couldn’t file an FIR immediately because Shah and his friends had threatened her, claiming they were from affluent and influential families.",
    "flair": "Crime",
    "score": 55,
    "num_comments": 4,
    "created_utc": 1713003757.0,
    "convurl": "https://external-preview.redd.it/QIxNPyuLHVBZvmAu6_Y2lA26gqozOnF42GawlBKSFZQ.jpg?auto=webp&s=b938efbe0ad8f204d6ec64366b7a8d42ab03dc53",
    "comments": [
        "That's just sad",
        "will he join BJP?",
        "secret to unlimited immunity from repercussions of crime.",
        "Looks like the law is again on the wrong side once again",
        "I knew something was off no regular guy gets bail that easily, do I read the article, turns out the guy is rich and you know what. \n\nI know how most rich & play boi type guys are and I believe that in fact he did do it."
    ],
    "cleaned_text": "worli rape case accused gets prearrest bail assault yearold woman complaint seems like result spite first informant allegations applicant appear driven ill possibly damage reputation seek financial gain given familys respected status society said application application also mentioned informant voluntarily chose places visit night asserting neither intoxicated strongly denying accusations informant filed application opposing plea stating incident premeditated carefully planned explained couldnt file fir immediately shah friends threatened claiming affluent influential families ",
    "cleaned_title": "worli rape case accused gets prearrest bail assault yearold woman",
    "cleaned_selftext": "complaint seems like result spite first informant allegations applicant appear driven ill possibly damage reputation seek financial gain given familys respected status society said application application also mentioned informant voluntarily chose places visit night asserting neither intoxicated strongly denying accusations informant filed application opposing plea stating incident premeditated carefully planned explained couldnt file fir immediately shah friends threatened claiming affluent influential families",
    "cleaned_comments": "thats sad join bjp secret unlimited immunity repercussions crime looks like law wrong side knew something regular guy gets bail easily read article turns guy rich know know rich play boi type guys believe fact",
    "light_cleaned_title": "Worli rape case accused gets pre-arrest bail in assault of 21-year-old woman",
    "light_cleaned_selftext": ">\"The complaint seems like a result of spite from the first informant. The allegations against the applicant appear to be driven by ill will, possibly to damage his reputation and seek financial gain, given his and his family’s respected status in society,” said the application. >The application also mentioned that the informant voluntarily chose the places to visit that night, asserting that neither of them were intoxicated. >Strongly denying the accusations, the informant filed an application opposing his plea, stating that the incident was premeditated and carefully planned. She explained that she couldn’t file an FIR immediately because Shah and his friends had threatened her, claiming they were from affluent and influential families.",
    "light_cleaned_comments": "That's just sad will he join BJP? secret to unlimited immunity from repercussions of crime. Looks like the law is again on the wrong side once again I knew something was off no regular guy gets bail that easily, do I read the article, turns out the guy is rich and you know what. I know how most rich & play boi type guys are and I believe that in fact he did do it."
}