{
    "id": "16p77jy",
    "title": "Why so many medical seats are empty in Tamilnadu ? It includes seats in AIIMS where anyone from all over India can apply. People spending years in coaching yet seats are empty even in AIIMS .what's actually happening?",
    "url": "https://www.reddit.com/r/india/comments/16p77jy/why_so_many_medical_seats_are_empty_in_tamilnadu/",
    "selftext": "The Times of India\nhttps://m.timesofindia.com › chennai\n25% MBBS seats vacant in govt medical colleges in Tamil Nadu",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695380185.0,
    "convurl": "https://external-preview.redd.it/ylM5wgitktuB67CVvbPktfOtk_v9fcOmMSXSNSaSwRY.jpg?auto=webp&amp;s=eb40ba0397ea13dc769a493ad5246ed450812e8a",
    "comments": [
        "Can you give the proper link to the article that says 25% seats are vacant in TN? People are committing suicide that they didn't get MBBS seat and you are spreading lies like this?",
        "There is no aiims in TN, it shows in counseling but it was never built. Google aiims madurai",
        "Union government recently reduced the NEET PG eligibility to 9 percentile making anyone who attempted the exam eligible to get a seat and the TN BJP Chief Annamalai lied that this is because there's 50% vacant seats in PG, this post is an attempt to support that lie.",
        "Can you give the article or data for it from credible source?",
        ">There is no aiims in TN, it shows in counseling but it was never built. Google aiims madurai\n\nPlease don't spread fake news. The AIIMS Madurai is 95% complete \n\n[Recent picture](https://postimg.cc/xkPWJvqt)",
        "Its more than 95% completed while I am typing this, thanks for the pic btw!",
        "https://m.timesofindia.com/city/chennai/25-mbbs-seats-vacant-in-govt-medical-colleges/articleshow/103373485.cms",
        "Thanks but the article says it's about the 15% of the seats that comes under all India quota that's vacant. A guy from Mumbai maybe is taking his chance to not go all the way south for MBBS or he got MBBS in Maharashtra state quota. The 85% of Tamilnadu State quota are filled.",
        "AIIMS madurai is not built yet but they are loaning space in Ramanathapuram medical college (or Tuticorin medical college subject to correction) and admitting students."
    ],
    "cleaned_text": "many medical seats empty tamilnadu includes seats aiims anyone india apply people spending years coaching yet seats empty even aiims whats actually happening times india chennai mbbs seats vacant govt medical colleges tamil nadu ",
    "cleaned_title": "many medical seats empty tamilnadu includes seats aiims anyone india apply people spending years coaching yet seats empty even aiims whats actually happening",
    "cleaned_selftext": "times india chennai mbbs seats vacant govt medical colleges tamil nadu",
    "cleaned_comments": "give proper link article says seats vacant tn people committing suicide didnt get mbbs seat spreading lies like aiims tn shows counseling never built google aiims madurai union government recently reduced neet pg eligibility percentile making anyone attempted exam eligible get seat tn bjp chief annamalai lied theres vacant seats pg post attempt support lie give article data credible source aiims tn shows counseling never built google aiims madurai please dont spread fake news aiims madurai complete recent picturehttpspostimgccxkpwjvqt completed typing thanks pic btw thanks article says seats comes india quota thats vacant guy mumbai maybe taking chance go way south mbbs got mbbs maharashtra state quota tamilnadu state quota filled aiims madurai built yet loaning space ramanathapuram medical college tuticorin medical college subject correction admitting students",
    "light_cleaned_title": "Why so many medical seats are empty in Tamilnadu ? It includes seats in AIIMS where anyone from all over India can apply. People spending years in coaching yet seats are empty even in AIIMS .what's actually happening?",
    "light_cleaned_selftext": "The Times of India › chennai 25% MBBS seats vacant in govt medical colleges in Tamil Nadu",
    "light_cleaned_comments": "Can you give the proper link to the article that says 25% seats are vacant in TN? People are committing suicide that they didn't get MBBS seat and you are spreading lies like this? There is no aiims in TN, it shows in counseling but it was never built. Google aiims madurai Union government recently reduced the NEET PG eligibility to 9 percentile making anyone who attempted the exam eligible to get a seat and the TN BJP Chief Annamalai lied that this is because there's 50% vacant seats in PG, this post is an attempt to support that lie. Can you give the article or data for it from credible source? >There is no aiims in TN, it shows in counseling but it was never built. Google aiims madurai Please don't spread fake news. The AIIMS Madurai is 95% complete [Recent picture](https://postimg.cc/xkPWJvqt) Its more than 95% completed while I am typing this, thanks for the pic btw! Thanks but the article says it's about the 15% of the seats that comes under all India quota that's vacant. A guy from Mumbai maybe is taking his chance to not go all the way south for MBBS or he got MBBS in Maharashtra state quota. The 85% of Tamilnadu State quota are filled. AIIMS madurai is not built yet but they are loaning space in Ramanathapuram medical college (or Tuticorin medical college subject to correction) and admitting students."
}