{
    "id": "1f47k3q",
    "title": "Condition of Indian women",
    "url": "https://www.reddit.com/r/india/comments/1f47k3q/condition_of_indian_women/",
    "selftext": "Almost every woman I know has been made uncomfortable at least once by some creep in her life. \n\nMy mom like lots of Indian women had arranged marriage by her parents(my mom's brother had to get married , she had to marry before him otherwise her life would have been worse with him and his wife), shortly after she had me and never did any further education or job or any of her dreams. My mom's brother and wife used to insult her & me when I was little whom my mom had to go to as my maternal grandparents lived with them, his ego all time high even though unemployed. My mom's sister's son used to harass me to which she said that nothing happened and my mom should have taken care of me, then did not talk for a long time. Many women themself have such mindset. And many such incidents I have seen with a lot of women.\n\nFemale employment in India one of the lowest in world, many still get arranged married, do not feel comfortable wearing what they want, treated badly by brothers & live with in-laws against their wishes. \n\nWhen I was little I used to say that educated and skilled people should stay in the country. Now I completely get why people especially women will move out and live in a country with much better life. I also want to go out of here to live my life. Maybe it will improve in 50 60 years which is no guarantee either so makes sense that those that get opportunity will leave. \n\n[https://timesofindia.indiatimes.com/blogs/irrational-economics/where-are-indias-working-women/](https://timesofindia.indiatimes.com/blogs/irrational-economics/where-are-indias-working-women/)\n\n[https://theinnisherald.com/arranged-marriages-tales-of-a-trapped-indian-bride](https://theinnisherald.com/arranged-marriages-tales-of-a-trapped-indian-bride)\n\n\n\n",
    "flair": "Rant / Vent",
    "score": 5,
    "num_comments": 0,
    "created_utc": 1724950838.0,
    "convurl": "https://external-preview.redd.it/X6Xt5tae48bfyQ8QAfpzVL2K2JCbu9ZLxmKRC5bDuAs.jpg?auto=webp&s=68cbeec25fd6b79972d88565ebcb9a540a14e8f8",
    "comments": [],
    "cleaned_text": "condition indian women almost every woman know made uncomfortable least creep life mom like lots indian women arranged marriage parentsmy moms brother get married marry otherwise life would worse wife shortly never education job dreams moms brother wife used insult little mom go maternal grandparents lived ego time high even though unemployed moms sisters son used harass said nothing happened mom taken care talk long time many women themself mindset many incidents seen lot women female employment india one lowest world many still get arranged married feel comfortable wearing want treated badly brothers live inlaws wishes little used say educated skilled people stay country completely get people especially women move live country much better life also want go live life maybe improve years guarantee either makes sense get opportunity leave httpstimesofindiaindiatimescomblogsirrationaleconomicswhereareindiasworkingwomenhttpstimesofindiaindiatimescomblogsirrationaleconomicswhereareindiasworkingwomen httpstheinnisheraldcomarrangedmarriagestalesofatrappedindianbridehttpstheinnisheraldcomarrangedmarriagestalesofatrappedindianbride ",
    "cleaned_title": "condition indian women",
    "cleaned_selftext": "almost every woman know made uncomfortable least creep life mom like lots indian women arranged marriage parentsmy moms brother get married marry otherwise life would worse wife shortly never education job dreams moms brother wife used insult little mom go maternal grandparents lived ego time high even though unemployed moms sisters son used harass said nothing happened mom taken care talk long time many women themself mindset many incidents seen lot women female employment india one lowest world many still get arranged married feel comfortable wearing want treated badly brothers live inlaws wishes little used say educated skilled people stay country completely get people especially women move live country much better life also want go live life maybe improve years guarantee either makes sense get opportunity leave httpstimesofindiaindiatimescomblogsirrationaleconomicswhereareindiasworkingwomenhttpstimesofindiaindiatimescomblogsirrationaleconomicswhereareindiasworkingwomen httpstheinnisheraldcomarrangedmarriagestalesofatrappedindianbridehttpstheinnisheraldcomarrangedmarriagestalesofatrappedindianbride",
    "cleaned_comments": "",
    "light_cleaned_title": "Condition of Indian women",
    "light_cleaned_selftext": "Almost every woman I know has been made uncomfortable at least once by some creep in her life. My mom like lots of Indian women had arranged marriage by her parents(my mom's brother had to get married , she had to marry before him otherwise her life would have been worse with him and his wife), shortly after she had me and never did any further education or job or any of her dreams. My mom's brother and wife used to insult her & me when I was little whom my mom had to go to as my maternal grandparents lived with them, his ego all time high even though unemployed. My mom's sister's son used to harass me to which she said that nothing happened and my mom should have taken care of me, then did not talk for a long time. Many women themself have such mindset. And many such incidents I have seen with a lot of women. Female employment in India one of the lowest in world, many still get arranged married, do not feel comfortable wearing what they want, treated badly by brothers & live with in-laws against their wishes. When I was little I used to say that educated and skilled people should stay in the country. Now I completely get why people especially women will move out and live in a country with much better life. I also want to go out of here to live my life. Maybe it will improve in 50 60 years which is no guarantee either so makes sense that those that get opportunity will leave. [https://timesofindia.indiatimes.com/blogs/irrational-economics/where-are-indias-working-women/](https://timesofindia.indiatimes.com/blogs/irrational-economics/where-are-indias-working-women/) [https://theinnisherald.com/arranged-marriages-tales-of-a-trapped-indian-bride](https://theinnisherald.com/arranged-marriages-tales-of-a-trapped-indian-bride)",
    "light_cleaned_comments": ""
}