{
    "id": "16p78xh",
    "title": "What to do people?",
    "url": "https://www.reddit.com/gallery/16p78xh",
    "selftext": "So, my friend who lives in Glasgow ordered a gift for me from there itself and it has to be shipped to here in India. But the issue is, I got a message from the shipment company that they need to verify my address and for that I have to provide the valid photo id.\n\nThe issue here is that all my photo id's have a different address than the one where my friend put the address of, and it is clearly mentioned that I have to provide the address so,that the Customs can validate the address. \n\nShould I change the address on the Government IDs and that would take atleast 3-4 weeks (Aadhar, Voted Id).\n\nAny suggestions would be helpful? \nThank You !",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695380319.0,
    "convurl": "https://i.redd.it/cc40vo54gspb1.jpg",
    "comments": [],
    "cleaned_text": "people friend lives glasgow ordered gift shipped india issue got message shipment company need verify address provide valid photo id issue photo ids different address one friend put address clearly mentioned provide address sothat customs validate address change address government ids would take atleast weeks aadhar voted id suggestions would helpful thank ",
    "cleaned_title": "people",
    "cleaned_selftext": "friend lives glasgow ordered gift shipped india issue got message shipment company need verify address provide valid photo id issue photo ids different address one friend put address clearly mentioned provide address sothat customs validate address change address government ids would take atleast weeks aadhar voted id suggestions would helpful thank",
    "cleaned_comments": "",
    "light_cleaned_title": "What to do people?",
    "light_cleaned_selftext": "So, my friend who lives in Glasgow ordered a gift for me from there itself and it has to be shipped to here in India. But the issue is, I got a message from the shipment company that they need to verify my address and for that I have to provide the valid photo id. The issue here is that all my photo id's have a different address than the one where my friend put the address of, and it is clearly mentioned that I have to provide the address so,that the Customs can validate the address. Should I change the address on the Government IDs and that would take atleast 3-4 weeks (Aadhar, Voted Id). Any suggestions would be helpful? Thank You !",
    "light_cleaned_comments": ""
}