{
    "id": "1e3ru86",
    "title": "Federalism | Nyay Patra | Manifesto | Lok Sabha Elections 2024 | Indian National Congress",
    "url": "https://manifesto.inc.in/en/federalism/",
    "selftext": "__What is your opinion on strengthening federalism in India?__\n1)Enhanced Local Governance -Each state can have tailor made policies and experiment better.   \n2)Economic Growth-We can become more business friendly with lesser controls from central government.    \n3)Increased Political Participation-As state politics would become more important, more people would be politically active because they have to. The closer leaders will become more powerful. Local issues and grievances can be sorted faster.\n4)Reduced Central-State Tension- No more need to embed themselves in Delhi politics for funds. \nNo one can point fingers at centre for being too partial.   \n\n5) Central government would be more free to  manage National and diplomatic problems.  Issues like Manipur and Chinese land grabbing can be controlled because they cannot hide behind regional politics. \n\n6) States with weaker governance will become more responsible as its civilians will directly judge local leaders. Other states could pool resources based on necessities for the poor state to become financially independent faster. It will become a matter of pride and incompetent leaders will be voted out faster.  \n\n",
    "flair": "Policy/Economy",
    "score": 8,
    "num_comments": 1,
    "created_utc": 1721040809.0,
    "convurl": "https://external-preview.redd.it/ys-OMONv3TMZA41k68KgbycicsS64A7GVSHSytz-qxg.jpg?auto=webp&s=50beae9a54db36092adeac8b8aff53785f2f856a",
    "comments": [],
    "cleaned_text": "federalism nyay patra manifesto lok sabha elections indian national congress opinion strengthening federalism india enhanced local governance state tailor made policies experiment better economic growthwe become business friendly lesser controls central government increased political participationas state politics would become important people would politically active closer leaders become powerful local issues grievances sorted faster reduced centralstate tension need embed delhi politics funds one point fingers centre partial central government would free manage national diplomatic problems issues like manipur chinese land grabbing controlled hide behind regional politics states weaker governance become responsible civilians directly judge local leaders states could pool resources based necessities poor state become financially independent faster become matter pride incompetent leaders voted faster ",
    "cleaned_title": "federalism nyay patra manifesto lok sabha elections indian national congress",
    "cleaned_selftext": "opinion strengthening federalism india enhanced local governance state tailor made policies experiment better economic growthwe become business friendly lesser controls central government increased political participationas state politics would become important people would politically active closer leaders become powerful local issues grievances sorted faster reduced centralstate tension need embed delhi politics funds one point fingers centre partial central government would free manage national diplomatic problems issues like manipur chinese land grabbing controlled hide behind regional politics states weaker governance become responsible civilians directly judge local leaders states could pool resources based necessities poor state become financially independent faster become matter pride incompetent leaders voted faster",
    "cleaned_comments": "",
    "light_cleaned_title": "Federalism | Nyay Patra | Manifesto | Lok Sabha Elections 2024 | Indian National Congress",
    "light_cleaned_selftext": "__What is your opinion on strengthening federalism in India?__ 1)Enhanced Local Governance -Each state can have tailor made policies and experiment better. 2)Economic Growth-We can become more business friendly with lesser controls from central government. 3)Increased Political Participation-As state politics would become more important, more people would be politically active because they have to. The closer leaders will become more powerful. Local issues and grievances can be sorted faster. 4)Reduced Central-State Tension- No more need to embed themselves in Delhi politics for funds. No one can point fingers at centre for being too partial. 5) Central government would be more free to manage National and diplomatic problems. Issues like Manipur and Chinese land grabbing can be controlled because they cannot hide behind regional politics. 6) States with weaker governance will become more responsible as its civilians will directly judge local leaders. Other states could pool resources based on necessities for the poor state to become financially independent faster. It will become a matter of pride and incompetent leaders will be voted out faster.",
    "light_cleaned_comments": ""
}