{
    "id": "14ockyo",
    "title": "UCC: Cautious Congress decides to wait for draft Bill",
    "url": "https://indianexpress.com/article/india/ucc-cautious-congress-decides-to-wait-for-draft-bill-8696432/",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Findianexpress.com%2Farticle%2Findia%2Fucc-cautious-congress-decides-to-wait-for-draft-bill-8696432%2F",
    "flair": "Politics",
    "score": 62,
    "num_comments": 9,
    "created_utc": 1688264531.0,
    "convurl": "https://external-preview.redd.it/AE1YqSDyJCgA3_hGkJUtLIhVURZkyxYRloZjOBYSX_c.jpg?auto=webp&s=2204e99c03434dadb5b9ecf2b0a91af68b99d7cf",
    "comments": [
        "No reason to criticize anything if there is no such thing in reality. Wait for the documentation, don't believe on verbal statements.",
        "Probably the only sane position to take\n\nBhakts and AAP are already cheering for UCC, while Muslims and North easterners are freaking out. The bill is not out yet, we have no idea what the UCC will contain, still people are getting so hysterical over it",
        "Not falling for the hype train. Rare w by congress.",
        "Sane decision. Wait for the bill, put questions about the bill that will concern Hindu voters & tribal voters. Don’t bring in the Muslim angle, plain and simple.",
        "true. Hopefully they will play this right.",
        "pAAP is a sAAP. Sometimes, they reveal their true identity of B team of BJP. These bunch of anarchists must be banished from Indian politics.",
        "There is atleast 1.\nLaw abiding part of the community is already civil(in the sense of the bill) enough. And in general making rule is to limit freedom, creating basis for persecution etc etc. \nIn this regards we can contemplate need/motive/ambition of such bills/discussion.\nAnd I am against it.",
        "Totally"
    ],
    "cleaned_text": "ucc cautious congress decides wait draft bill  ",
    "cleaned_title": "ucc cautious congress decides wait draft bill",
    "cleaned_selftext": "",
    "cleaned_comments": "reason criticize anything thing reality wait documentation dont believe verbal statements probably sane position take bhakts aap already cheering ucc muslims north easterners freaking bill yet idea ucc contain still people getting hysterical falling hype train rare w congress sane decision wait bill put questions bill concern hindu voters tribal voters dont bring muslim angle plain simple true hopefully play right paap saap sometimes reveal true identity b team bjp bunch anarchists must banished indian politics atleast law abiding part community already civilin sense bill enough general making rule limit freedom creating basis persecution etc etc regards contemplate needmotiveambition billsdiscussion totally",
    "light_cleaned_title": "UCC: Cautious Congress decides to wait for draft Bill",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "No reason to criticize anything if there is no such thing in reality. Wait for the documentation, don't believe on verbal statements. Probably the only sane position to take Bhakts and AAP are already cheering for UCC, while Muslims and North easterners are freaking out. The bill is not out yet, we have no idea what the UCC will contain, still people are getting so hysterical over it Not falling for the hype train. Rare w by congress. Sane decision. Wait for the bill, put questions about the bill that will concern Hindu voters & tribal voters. Don’t bring in the Muslim angle, plain and simple. true. Hopefully they will play this right. pAAP is a sAAP. Sometimes, they reveal their true identity of B team of BJP. These bunch of anarchists must be banished from Indian politics. There is atleast 1. Law abiding part of the community is already civil(in the sense of the bill) enough. And in general making rule is to limit freedom, creating basis for persecution etc etc. In this regards we can contemplate need/motive/ambition of such bills/discussion. And I am against it. Totally"
}