{
    "id": "14hrxqc",
    "title": "‘Ajmal’s people’ will take all seats if we do not prioritise education: Assam CM’s hate speech",
    "url": "https://maktoobmedia.com/latest-news/ajmals-people-will-take-all-seats-if-we-do-not-prioritise-education-assam-cms-hate-speech/",
    "selftext": "Assam Chief Minister Himanta Biswa Sarma on Friday warned against medical and engineering seats in the state being dominated by “Ajmal’s people,” in an apparent reference to coaching for competitive examinations provided by the Ajmal Foundation, run by AIUDF chief and veteran Muslim politician Badruddin Ajmal.\n\n“If it continues this way, Assam’s medical and engineering seats will be taken by who? Ajmal’s people,” Sarma said at a public meeting in Lakhimpur, reported [Indian Express](https://indianexpress.com/article/india/ajmal-people-medical-engineering-seats-assam-doesnt-prioritise-education-himanta-8682752/).\n\n“We have no objection to them studying and taking the seats. Take 20-30%. But if they take all, it will hurt us, won’t it?” he said.\n\nSince taking over as chief minister of Assam in 2021, Sarma has made several Islamophobic comments.\n\nOn the same day, Sarma used the term “Hussain Obamas” in a tweet in response to a journalist who asked if a first information report has been filed in Guwahati against former United States President Barack Obama after he said that India risks “pulling apart” if the government does not protect the rights of Muslims.",
    "flair": "Politics",
    "score": 128,
    "num_comments": 30,
    "created_utc": 1687610024.0,
    "convurl": "https://external-preview.redd.it/8r3JSJZyBApBL0l-m33pinEkFGDZCXDJrLyWJiO3RRs.jpg?auto=webp&v=enabled&s=b884e17c4bc44001d3b6a7372fea6fdd9ba8972f",
    "comments": [
        "Reminds me of Karnataka, where they started upping the hate game after realizing they were losing votes on the ground. I think the NE is waking up to the destruction that this party has sown.",
        "Sarma a turncoat from Congress has more hatred for minorities than a born RSS true bred sanghi.",
        "Some times you have to over compensate for things you have been missing",
        "It boggles the mind how much verbal diarrhea an individual can spew.",
        "need to also note that muslims are generally underrepresented in premier institutes, govt jobs, military etc. Not to mention the recent study showing that muslim majority area is half as likely to get a school than otherwise. \n\n The Ajmal Foundation seems to be an initiative to make it otherwise, shame that the CM doesnt see it that way",
        "A popular saying in UP is Naya naya  Mulla, jyada pyaz khata hai/5 baar Namaz padtha hai. Essentially meaning a newly minted Muslim is more eager to show he is a better Muslim by eating more onions/offering Namaz 5 times which the older muslims who are more comfortable in their religious identity don't do coz their don't feel the urgent need to ingratiate with their new brethren. \n\nIt's pretty common like how Jitin Narayan Tyagi does in the rare case of a Muslim converting to Hinduism. In politics Kapil Mishra statements from AAP Era to when he joined BJP.",
        "*ziyada\n\n>In politics Kapil Mishra statements from AAP Era to when he joined BJP.\n\nThere's a video of him making his (probably Muslim) audience chant Allahu Akbar. 😂",
        "First they say Muslims don’t study and gain worldly knowledge. They are immersed in madarsa education. Now when they want to or are seeking education like everyone else, it is still a problem. Classic case of having one’s cake and eating it too.",
        "They want Muslims to prove their loyalty by serving as soldiers, but they also don't want \"too many\" of them in the military.",
        "Prove their loyalty? Wasn’t there a case during NRC in assam where an ex-serviceman was questioned and faced troubles proving his citizenship?",
        "Assamed to call him an elected representative of the people.",
        "Don't apply logic to Hindutva; it doesn't work.",
        "[Are you  an idiot calling such a loyal BJP supporter as Mishraji a hypocrite?](https://youtu.be/j6IFcxECAF4)",
        "Turncoat is hungry to prove his worth to his new masters and is willing to sink even lower than other sanghi leaders.",
        "Only thing is that there is a difference between Karnataka and Assam. Karnataka has normally not had any discord between Hindus and Muslims, maybe small exceptions in coastal region but majorly everyone gets along very well. All of us here were really disturbed and appalled by BJP's polarisation, even within BJP I think there were quite a few who did not agree with such bs but in BJP you only defy the leadership if you are prepared to leave the party or if you are Subramanian Swamy.\n\nAssam on the other hand sees huge amounts of Muslim refugees from neighbouring countries. I dont want say anything bad about them but definitely refugees coming in causes tensions with locals. This sentiment however small or big exists and the hindu population can be polarised. BJP being what it is will exploit this.",
        "Since no one did it, r/angryupvote",
        "Saaar there is flood in your state, i mean not mental state that is obvious",
        "There is no ideology in Indian politics, just votes. Congress just allied with Bajrang Sena (Bajrang Dal spinoff) in MP and Muslim League in Kerala.",
        "And then getting away with it scot free.",
        "why onions?",
        ">“We have no objection to them studying and taking the seats. Take 20-30%. But if they take all, it will hurt us, won’t it?” he said.\n\nHe should give 30% seats to Muslims in his party first.",
        "There is no ideology he is just making moves for RW vote bank …",
        "Coz eating onions is just outside the proper conduct meaning logically since a fresh outta Hinduism guy won't just wolf down beef at the start and start offending from what's least offensive and it's the most offensive thing a hindu can do for their tentative first steps outside boundaries of established hindu behavior so in PG-13 version it is assumed that is would a new guy freed from constraints of Hinduisms would do. \n\nAs to why our  local religions (meaning religions borne out of fertile regions of North Indian plains) frown upon eating tubers of plants like onion and garlic it's coz we have to uproot them thus killing them which isn't the case in eating grains where we harvest the dessicated corpses of plants who have completed their life cycle already. Potato despite similarly being a tuberous plant escapes religious scrutiny coz it was only introduced very recently (relatively) to our shores.",
        "Thanks for the explanation man."
    ],
    "cleaned_text": "ajmals people take seats prioritise education assam cms hate speech assam chief minister himanta biswa sarma friday warned medical engineering seats state dominated ajmals people apparent reference coaching competitive examinations provided ajmal foundation run aiudf chief veteran muslim politician badruddin ajmal continues way assams medical engineering seats taken ajmals people sarma said public meeting lakhimpur reported indian expresshttpsindianexpresscomarticleindiaajmalpeoplemedicalengineeringseatsassamdoesntprioritiseeducationhimanta objection studying taking seats take take hurt us wont said since taking chief minister assam sarma made several islamophobic comments day sarma used term hussain obamas tweet response journalist asked first information report filed guwahati former united states president barack obama said india risks pulling apart government protect rights muslims ",
    "cleaned_title": "ajmals people take seats prioritise education assam cms hate speech",
    "cleaned_selftext": "assam chief minister himanta biswa sarma friday warned medical engineering seats state dominated ajmals people apparent reference coaching competitive examinations provided ajmal foundation run aiudf chief veteran muslim politician badruddin ajmal continues way assams medical engineering seats taken ajmals people sarma said public meeting lakhimpur reported indian expresshttpsindianexpresscomarticleindiaajmalpeoplemedicalengineeringseatsassamdoesntprioritiseeducationhimanta objection studying taking seats take take hurt us wont said since taking chief minister assam sarma made several islamophobic comments day sarma used term hussain obamas tweet response journalist asked first information report filed guwahati former united states president barack obama said india risks pulling apart government protect rights muslims",
    "cleaned_comments": "reminds karnataka started upping hate game realizing losing votes ground think ne waking destruction party sown sarma turncoat congress hatred minorities born rss true bred sanghi times compensate things missing boggles mind much verbal diarrhea individual spew need also note muslims generally underrepresented premier institutes govt jobs military etc mention recent study showing muslim majority area half likely get school otherwise ajmal foundation seems initiative make otherwise shame cm doesnt see way popular saying naya naya mulla jyada pyaz khata hai baar namaz padtha hai essentially meaning newly minted muslim eager show better muslim eating onionsoffering namaz times older muslims comfortable religious identity dont coz dont feel urgent need ingratiate new brethren pretty common like jitin narayan tyagi rare case muslim converting hinduism politics kapil mishra statements aap era joined bjp ziyada politics kapil mishra statements aap era joined bjp theres video making probably muslim audience chant allahu akbar first say muslims dont study gain worldly knowledge immersed madarsa education want seeking education like everyone else still problem classic case ones cake eating want muslims prove loyalty serving soldiers also dont want many military prove loyalty wasnt case nrc assam exserviceman questioned faced troubles proving citizenship assamed call elected representative people dont apply logic hindutva doesnt work idiot calling loyal bjp supporter mishraji hypocritehttpsyoutubejifcxecaf turncoat hungry prove worth new masters willing sink even lower sanghi leaders thing difference karnataka assam karnataka normally discord hindus muslims maybe small exceptions coastal region majorly everyone gets along well us really disturbed appalled bjps polarisation even within bjp think quite agree bs bjp defy leadership prepared leave party subramanian swamy assam hand sees huge amounts muslim refugees neighbouring countries dont want say anything bad definitely refugees coming causes tensions locals sentiment however small big exists hindu population polarised bjp exploit since one rangryupvote saaar flood state mean mental state obvious ideology indian politics votes congress allied bajrang sena bajrang dal spinoff mp muslim league kerala getting away scot free onions objection studying taking seats take take hurt us wont said give seats muslims party first ideology making moves rw vote bank coz eating onions outside proper conduct meaning logically since fresh outta hinduism guy wont wolf beef start start offending whats least offensive offensive thing hindu tentative first steps outside boundaries established hindu behavior pg version assumed would new guy freed constraints hinduisms would local religions meaning religions borne fertile regions north indian plains frown upon eating tubers plants like onion garlic coz uproot thus killing isnt case eating grains harvest dessicated corpses plants completed life cycle already potato despite similarly tuberous plant escapes religious scrutiny coz introduced recently relatively shores thanks explanation man",
    "light_cleaned_title": "‘Ajmal’s people’ will take all seats if we do not prioritise education: Assam CM’s hate speech",
    "light_cleaned_selftext": "Assam Chief Minister Himanta Biswa Sarma on Friday warned against medical and engineering seats in the state being dominated by “Ajmal’s people,” in an apparent reference to coaching for competitive examinations provided by the Ajmal Foundation, run by AIUDF chief and veteran Muslim politician Badruddin Ajmal. “If it continues this way, Assam’s medical and engineering seats will be taken by who? Ajmal’s people,” Sarma said at a public meeting in Lakhimpur, reported [Indian Express](https://indianexpress.com/article/india/ajmal-people-medical-engineering-seats-assam-doesnt-prioritise-education-himanta-8682752/). “We have no objection to them studying and taking the seats. Take 20-30%. But if they take all, it will hurt us, won’t it?” he said. Since taking over as chief minister of Assam in 2021, Sarma has made several Islamophobic comments. On the same day, Sarma used the term “Hussain Obamas” in a tweet in response to a journalist who asked if a first information report has been filed in Guwahati against former United States President Barack Obama after he said that India risks “pulling apart” if the government does not protect the rights of Muslims.",
    "light_cleaned_comments": "Reminds me of Karnataka, where they started upping the hate game after realizing they were losing votes on the ground. I think the NE is waking up to the destruction that this party has sown. Sarma a turncoat from Congress has more hatred for minorities than a born RSS true bred sanghi. Some times you have to over compensate for things you have been missing It boggles the mind how much verbal diarrhea an individual can spew. need to also note that muslims are generally underrepresented in premier institutes, govt jobs, military etc. Not to mention the recent study showing that muslim majority area is half as likely to get a school than otherwise. The Ajmal Foundation seems to be an initiative to make it otherwise, shame that the CM doesnt see it that way A popular saying in UP is Naya naya Mulla, jyada pyaz khata hai/5 baar Namaz padtha hai. Essentially meaning a newly minted Muslim is more eager to show he is a better Muslim by eating more onions/offering Namaz 5 times which the older muslims who are more comfortable in their religious identity don't do coz their don't feel the urgent need to ingratiate with their new brethren. It's pretty common like how Jitin Narayan Tyagi does in the rare case of a Muslim converting to Hinduism. In politics Kapil Mishra statements from AAP Era to when he joined BJP. *ziyada >In politics Kapil Mishra statements from AAP Era to when he joined BJP. There's a video of him making his (probably Muslim) audience chant Allahu Akbar. 😂 First they say Muslims don’t study and gain worldly knowledge. They are immersed in madarsa education. Now when they want to or are seeking education like everyone else, it is still a problem. Classic case of having one’s cake and eating it too. They want Muslims to prove their loyalty by serving as soldiers, but they also don't want \"too many\" of them in the military. Prove their loyalty? Wasn’t there a case during NRC in assam where an ex-serviceman was questioned and faced troubles proving his citizenship? Assamed to call him an elected representative of the people. Don't apply logic to Hindutva; it doesn't work. [Are you an idiot calling such a loyal BJP supporter as Mishraji a hypocrite?](https://youtu.be/j6IFcxECAF4) Turncoat is hungry to prove his worth to his new masters and is willing to sink even lower than other sanghi leaders. Only thing is that there is a difference between Karnataka and Assam. Karnataka has normally not had any discord between Hindus and Muslims, maybe small exceptions in coastal region but majorly everyone gets along very well. All of us here were really disturbed and appalled by BJP's polarisation, even within BJP I think there were quite a few who did not agree with such bs but in BJP you only defy the leadership if you are prepared to leave the party or if you are Subramanian Swamy. Assam on the other hand sees huge amounts of Muslim refugees from neighbouring countries. I dont want say anything bad about them but definitely refugees coming in causes tensions with locals. This sentiment however small or big exists and the hindu population can be polarised. BJP being what it is will exploit this. Since no one did it, r/angryupvote Saaar there is flood in your state, i mean not mental state that is obvious There is no ideology in Indian politics, just votes. Congress just allied with Bajrang Sena (Bajrang Dal spinoff) in MP and Muslim League in Kerala. And then getting away with it scot free. why onions? >“We have no objection to them studying and taking the seats. Take 20-30%. But if they take all, it will hurt us, won’t it?” he said. He should give 30% seats to Muslims in his party first. There is no ideology he is just making moves for RW vote bank … Coz eating onions is just outside the proper conduct meaning logically since a fresh outta Hinduism guy won't just wolf down beef at the start and start offending from what's least offensive and it's the most offensive thing a hindu can do for their tentative first steps outside boundaries of established hindu behavior so in PG-13 version it is assumed that is would a new guy freed from constraints of Hinduisms would do. As to why our local religions (meaning religions borne out of fertile regions of North Indian plains) frown upon eating tubers of plants like onion and garlic it's coz we have to uproot them thus killing them which isn't the case in eating grains where we harvest the dessicated corpses of plants who have completed their life cycle already. Potato despite similarly being a tuberous plant escapes religious scrutiny coz it was only introduced very recently (relatively) to our shores. Thanks for the explanation man."
}