{
    "id": "13fj97u",
    "title": "Can’t grant SEBI six more months to finish probe, says SC on Adani-Hindenburg row",
    "url": "https://indianexpress.com/article/india/gautam-adani-hindenburg-supreme-court-sebi-stock-market-manipulatio-8605924/",
    "selftext": "It further said the court registry has received the report of the apex court-appointed Justice (retd) AM Sapre committee on the issue and would like to hear the matter on May 15 after perusing the findings of the panel. The top court said it will pronounce its order on SEBI’s plea for extension of time on May 15.",
    "flair": "Law & Courts",
    "score": 127,
    "num_comments": 13,
    "created_utc": 1683893142.0,
    "convurl": "https://external-preview.redd.it/07ckny_IUMlh0cOkgfRbbs3-1EUBRsAV_aki3xrj18A.jpg?auto=webp&v=enabled&s=9f2f563699440d53fdb270cd397dc7f9be1e2c31",
    "comments": [
        "The top court also cautioned a lawyer, appearing for petitioner Jaya Thakur of Congress, by saying that the court has said nothing about any regulatory failure on the part of SEBI.",
        "Yeah . Give a clean chit sooner .",
        "2 months to finish the probe lol. They know fishes as big as this will need more time to actually form a competent report.",
        "A firm with less than 10 employees have unearthed these scams. SEBI acted after the allegations were raised. Either SEBI is incompetent or it is deliberately trying to save Adani.",
        "One of his relatives is in SEBI, I forgot who, though.",
        "Didn't Mahua Moitra raiase a complaint with Sebi about Adani group in 2021? Is 2 years not enough for Sebi to finish their investigation?",
        "Who??",
        "Child’s father-in-law",
        "I meant the name of the board member🙄",
        " Karan Adani’s father-in-law Cyril Shroff is part of the committee on corporate governance in SEBI i.e. The Securities and Exchange Board of India. Karan Adani is the son of Adani Group’s chairman Gautman Adani. He is also the CEO of Adani ports and SEZ.",
        "Ah thank you for the information. Although being in a former sebi-appointed committee doesn't mean being in the board of directors, but I thank you for the information!",
        "How long do Indians will rely on judiciary to save the Indian democracy and remain servile creatures of messiah like leaders who they themselves create and become 2nd class servants in a democracy which is based on equality of all."
    ],
    "cleaned_text": "cant grant sebi six months finish probe says sc adanihindenburg row said court registry received report apex courtappointed justice retd sapre committee issue would like hear matter may perusing findings panel top court said pronounce order sebis plea extension time may ",
    "cleaned_title": "cant grant sebi six months finish probe says sc adanihindenburg row",
    "cleaned_selftext": "said court registry received report apex courtappointed justice retd sapre committee issue would like hear matter may perusing findings panel top court said pronounce order sebis plea extension time may",
    "cleaned_comments": "top court also cautioned lawyer appearing petitioner jaya thakur congress saying court said nothing regulatory failure part sebi yeah give clean chit sooner months finish probe lol know fishes big need time actually form competent report firm less employees unearthed scams sebi acted allegations raised either sebi incompetent deliberately trying save adani one relatives sebi forgot though didnt mahua moitra raiase complaint sebi adani group years enough sebi finish investigation childs fatherinlaw meant name board member karan adanis fatherinlaw cyril shroff part committee corporate governance sebi ie securities exchange board india karan adani son adani groups chairman gautman adani also ceo adani ports sez ah thank information although former sebiappointed committee doesnt mean board directors thank information long indians rely judiciary save indian democracy remain servile creatures messiah like leaders create become nd class servants democracy based equality",
    "light_cleaned_title": "Can’t grant SEBI six more months to finish probe, says SC on Adani-Hindenburg row",
    "light_cleaned_selftext": "It further said the court registry has received the report of the apex court-appointed Justice (retd) AM Sapre committee on the issue and would like to hear the matter on May 15 after perusing the findings of the panel. The top court said it will pronounce its order on SEBI’s plea for extension of time on May 15.",
    "light_cleaned_comments": "The top court also cautioned a lawyer, appearing for petitioner Jaya Thakur of Congress, by saying that the court has said nothing about any regulatory failure on the part of SEBI. Yeah . Give a clean chit sooner . 2 months to finish the probe lol. They know fishes as big as this will need more time to actually form a competent report. A firm with less than 10 employees have unearthed these scams. SEBI acted after the allegations were raised. Either SEBI is incompetent or it is deliberately trying to save Adani. One of his relatives is in SEBI, I forgot who, though. Didn't Mahua Moitra raiase a complaint with Sebi about Adani group in 2021? Is 2 years not enough for Sebi to finish their investigation? Who?? Child’s father-in-law I meant the name of the board member🙄 Karan Adani’s father-in-law Cyril Shroff is part of the committee on corporate governance in SEBI i.e. The Securities and Exchange Board of India. Karan Adani is the son of Adani Group’s chairman Gautman Adani. He is also the CEO of Adani ports and SEZ. Ah thank you for the information. Although being in a former sebi-appointed committee doesn't mean being in the board of directors, but I thank you for the information! How long do Indians will rely on judiciary to save the Indian democracy and remain servile creatures of messiah like leaders who they themselves create and become 2nd class servants in a democracy which is based on equality of all."
}