{
    "id": "1eciz6m",
    "title": "FRAUD Landlords of New Ashok Nagar",
    "url": "https://v.redd.it/6v8nhb1ypted1",
    "selftext": "My friend used to stay in a rented flat in New Ashok Nagar, which was taken care by this caretaker. Who steals the television from the tenants flat once the vacate the place and because of which the security money is denied and than he and other related folks won't pick your calls or messages.\n\nToday when my friend went and demanded back her money he called 7-8 guys and fought with her friend (male) who tried to stop him from fleeing the scene in which he was hurt.\n\nP.S. she was alone girl over there with other two friends and felt harassed when 7-8 guys came and grouped on her and still she is denied of her security money.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1721982463.0,
    "convurl": "https://external-preview.redd.it/czZpbnRydHhwdGVkMWuRQJsWRI-k6Eh1AUYDU4BmnNyokGMRu0QdNwK_SOyY.png?format=pjpg&auto=webp&s=c05362b98ff31d7c1b6142adae8d7f68a7a6a6a3",
    "comments": [],
    "cleaned_text": "fraud landlords new ashok nagar friend used stay rented flat new ashok nagar taken care caretaker steals television tenants flat vacate place security money denied related folks wont pick calls messages today friend went demanded back money called guys fought friend male tried stop fleeing scene hurt ps alone girl two friends felt harassed guys came grouped still denied security money ",
    "cleaned_title": "fraud landlords new ashok nagar",
    "cleaned_selftext": "friend used stay rented flat new ashok nagar taken care caretaker steals television tenants flat vacate place security money denied related folks wont pick calls messages today friend went demanded back money called guys fought friend male tried stop fleeing scene hurt ps alone girl two friends felt harassed guys came grouped still denied security money",
    "cleaned_comments": "",
    "light_cleaned_title": "FRAUD Landlords of New Ashok Nagar",
    "light_cleaned_selftext": "My friend used to stay in a rented flat in New Ashok Nagar, which was taken care by this caretaker. Who steals the television from the tenants flat once the vacate the place and because of which the security money is denied and than he and other related folks won't pick your calls or messages. Today when my friend went and demanded back her money he called 7-8 guys and fought with her friend (male) who tried to stop him from fleeing the scene in which he was hurt. P.S. she was alone girl over there with other two friends and felt harassed when 7-8 guys came and grouped on her and still she is denied of her security money.",
    "light_cleaned_comments": ""
}