{
    "id": "16hchor",
    "title": "My Firend's Father Nand Kishore Can Defeat Cancer With Your Support.",
    "url": "https://www.impactguru.com/fundraiser/kindly-help-nand-kishore",
    "selftext": "I don't where should i ask for this so I'm posting in some big reddit community So mod please don't remove my post.\n\nMy friend's name is *Kishan* and I am raising funds for my father *Nand Kisor* who is suffering from *Tongue Cancer* and is undergoing treatment. \n\nOur estimated target is *INR 8 lakhs,* which will cover the medical expenses, Chemotherpies, hospital bills, and medications. Please help if you can even as ₹100\n\nDonations site [Link](https://www.impactguru.com/fundraiser/kindly-help-nand-kishore) for cross checking that this not any fake\n\n\n- UPI ID - 9599256947@\n\n- UPI NO - 9810343840",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694576805.0,
    "convurl": "https://external-preview.redd.it/iL2-1TMFPmPOTe6z5u8IwjcO0iotpMtNp2j6qsCekZs.jpg?auto=webp&s=d83b6334ab51a555ac84c05fe35f48217b60ec08",
    "comments": [
        "UPI ID:- 9599256947@ybl",
        "Thank you to everyone who upvote my post and if you donate even a little amount I'm so grateful of you"
    ],
    "cleaned_text": "firends father nand kishore defeat cancer support dont ask im posting big reddit community mod please dont remove post friends name kishan raising funds father nand kisor suffering tongue cancer undergoing treatment estimated target inr lakhs cover medical expenses chemotherpies hospital bills medications please help even donations site linkhttpswwwimpactgurucomfundraiserkindlyhelpnandkishore cross checking fake upi id upi ",
    "cleaned_title": "firends father nand kishore defeat cancer support",
    "cleaned_selftext": "dont ask im posting big reddit community mod please dont remove post friends name kishan raising funds father nand kisor suffering tongue cancer undergoing treatment estimated target inr lakhs cover medical expenses chemotherpies hospital bills medications please help even donations site linkhttpswwwimpactgurucomfundraiserkindlyhelpnandkishore cross checking fake upi id upi",
    "cleaned_comments": "upi id ybl thank everyone upvote post donate even little amount im grateful",
    "light_cleaned_title": "My Firend's Father Nand Kishore Can Defeat Cancer With Your Support.",
    "light_cleaned_selftext": "I don't where should i ask for this so I'm posting in some big reddit community So mod please don't remove my post. My friend's name is *Kishan* and I am raising funds for my father *Nand Kisor* who is suffering from *Tongue Cancer* and is undergoing treatment. Our estimated target is *INR 8 lakhs,* which will cover the medical expenses, Chemotherpies, hospital bills, and medications. Please help if you can even as ₹100 Donations site [Link](https://www.impactguru.com/fundraiser/kindly-help-nand-kishore) for cross checking that this not any fake - UPI ID - 9599256947@ - UPI NO - 9810343840",
    "light_cleaned_comments": "UPI ID:- 9599256947@ybl Thank you to everyone who upvote my post and if you donate even a little amount I'm so grateful of you"
}