{
    "id": "16k74vj",
    "title": "Please help my mom win this competition.",
    "url": "https://www.reddit.com/r/india/comments/16k74vj/please_help_my_mom_win_this_competition/",
    "selftext": "My mom has registered for the Tata litfest. She is a lovely poet, and i really wish that she would win this..its at least one thing I can do for her.Her poem entered is here.If you love it , I request you to please place your votes for her entry :\n\nWE SHOULD ALL BE POETS. \n\n&#x200B;\n\nWe, should all be poets.\n\nBecause poetry gives you the license\n\nTo be brave, to make mistakes  \n\nWrite and rewrite who you are \n\nTo be whoever you want to be\n\nAll is fair in love and war and poetry\n\n&#x200B;\n\nPoetry allows you to be black\n\nOr white or brown or a rainbow\n\nPoetry allows you to change your name.\n\nGender or be anonymous\n\nPoetry sheds all your dead\n\nSo you slither like a beautiful tender python\n\nOn life’s misshapen branches\n\nAnd still evoke a gasp of admiration\n\n&#x200B;\n\nPoetry allows you to play with time\n\nTo hold it, twist it, stretch it\n\nCrush it...by simply\n\nPlaying with your mind\n\n&#x200B;\n\nPoetry leads you to awareness\n\nThat you can think, act, and exist\n\nWithout barriers of religion\n\nCulture and language\n\nPoetry induces in you a seventh sense. \n\nYou can smell a poet from afar\n\nAnd connect\n\n&#x200B;\n\nPoetry is free, no tax no GST\n\nNo debit no credit\n\nNo clearing no balance\n\nJust withdrawing from yourself\n\nAll that hurts\n\nCauses torments and tortures\n\nAll that sits like an elephant\n\nIn your stomach\n\nAll that puts a spring in your step\n\nAll that makes you sing and sway\n\nAll the goodness you hide behind fear\n\nAll the craziness you hold dear\n\nYou see a glimpse of your own self\n\nIn poetry\n\n&#x200B;\n\nPoetry, my friend, \n\nIs a full length crystal clear\n\nBeautiful mirror\n\n&#x200B;\n\nLet us all be poets.\n\nIf you liked it please vote here : [https://www.wishpond.com/lp/2754534/entries/203135283](https://www.wishpond.com/lp/2754534/entries/203135283)\n\nThank you soo much. My mom would appreciate every vote :)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694869573.0,
    "convurl": "https://external-preview.redd.it/FiSiYta85tyGzND8Y9X0rjmQZhsv1GOfY0jhghS7Q2g.jpg?auto=webp&s=21504a6e99c978c27578c011cb33c58f7c4f58e4",
    "comments": [
        "Voted."
    ],
    "cleaned_text": "please help mom win competition mom registered tata litfest lovely poet really wish would win thisits least one thing herher poem entered hereif love request please place votes entry poets xb poets poetry gives license brave make mistakes write rewrite whoever want fair love war poetry xb poetry allows black white brown rainbow poetry allows change name gender anonymous poetry sheds dead slither like beautiful tender python lifes misshapen branches still evoke gasp admiration xb poetry allows play time hold twist stretch crush itby simply playing mind xb poetry leads awareness think act exist without barriers religion culture language poetry induces seventh sense smell poet afar connect xb poetry free tax gst debit credit clearing balance withdrawing hurts causes torments tortures sits like elephant stomach puts spring step makes sing sway goodness hide behind fear craziness hold dear see glimpse self poetry xb poetry friend full length crystal clear beautiful mirror xb let us poets liked please vote httpswwwwishpondcomlpentrieshttpswwwwishpondcomlpentries thank soo much mom would appreciate every vote ",
    "cleaned_title": "please help mom win competition",
    "cleaned_selftext": "mom registered tata litfest lovely poet really wish would win thisits least one thing herher poem entered hereif love request please place votes entry poets xb poets poetry gives license brave make mistakes write rewrite whoever want fair love war poetry xb poetry allows black white brown rainbow poetry allows change name gender anonymous poetry sheds dead slither like beautiful tender python lifes misshapen branches still evoke gasp admiration xb poetry allows play time hold twist stretch crush itby simply playing mind xb poetry leads awareness think act exist without barriers religion culture language poetry induces seventh sense smell poet afar connect xb poetry free tax gst debit credit clearing balance withdrawing hurts causes torments tortures sits like elephant stomach puts spring step makes sing sway goodness hide behind fear craziness hold dear see glimpse self poetry xb poetry friend full length crystal clear beautiful mirror xb let us poets liked please vote httpswwwwishpondcomlpentrieshttpswwwwishpondcomlpentries thank soo much mom would appreciate every vote",
    "cleaned_comments": "voted",
    "light_cleaned_title": "Please help my mom win this competition.",
    "light_cleaned_selftext": "My mom has registered for the Tata litfest. She is a lovely poet, and i really wish that she would win this..its at least one thing I can do for her.Her poem entered is here.If you love it , I request you to please place your votes for her entry : WE SHOULD ALL BE POETS. &#x200B; We, should all be poets. Because poetry gives you the license To be brave, to make mistakes Write and rewrite who you are To be whoever you want to be All is fair in love and war and poetry &#x200B; Poetry allows you to be black Or white or brown or a rainbow Poetry allows you to change your name. Gender or be anonymous Poetry sheds all your dead So you slither like a beautiful tender python On life’s misshapen branches And still evoke a gasp of admiration &#x200B; Poetry allows you to play with time To hold it, twist it, stretch it Crush it...by simply Playing with your mind &#x200B; Poetry leads you to awareness That you can think, act, and exist Without barriers of religion Culture and language Poetry induces in you a seventh sense. You can smell a poet from afar And connect &#x200B; Poetry is free, no tax no GST No debit no credit No clearing no balance Just withdrawing from yourself All that hurts Causes torments and tortures All that sits like an elephant In your stomach All that puts a spring in your step All that makes you sing and sway All the goodness you hide behind fear All the craziness you hold dear You see a glimpse of your own self In poetry &#x200B; Poetry, my friend, Is a full length crystal clear Beautiful mirror &#x200B; Let us all be poets. If you liked it please vote here : [https://www.wishpond.com/lp/2754534/entries/203135283](https://www.wishpond.com/lp/2754534/entries/203135283) Thank you soo much. My mom would appreciate every vote :)",
    "light_cleaned_comments": "Voted."
}