{
    "id": "18k9azx",
    "title": "Amir Baap ka Bigda Bacha",
    "url": "https://i.redd.it/di11fx2vas6c1.png",
    "selftext": "https://www.firstpost.com/explainers/thane-woman-assault-horrifying-tale-of-bureaucrats-son-who-tried-to-mow-down-girlfriend-13510582.html\nKudos to his dad for his great parenting skills",
    "flair": "Crime",
    "score": 45,
    "num_comments": 18,
    "created_utc": 1702787970.0,
    "convurl": "https://i.redd.it/di11fx2vas6c1.png",
    "comments": [
        "https://twitter.com/AshwaBJP",
        "These people are our future…",
        "He should be jailed",
        "Fuck these entitled twats sideways and put them behind bars to rot. What a shame. If violence and entitlement is the only thing you get down to after being born in a privileged class, you are clearly a vile human being and don’t deserve to be out in the open tormenting the society.",
        "Entitlement and privilege comes from violence. So this is just family business",
        "Will se what action would taken !!",
        "I can’t agree with that kind of broad generalization but I do understand your sentiment.",
        "Police is trying to help this mofo",
        "The girl came to know he was married and still tried to reason with him. Should have left him.",
        "Ldki 4.5 saal tk iske saath thi. Aise bnde ke saath 2 din naa rhe koi",
        "You are right but one has to be careful about making such statements. It easily gives way to victim blaming. Regardless of anything, this wasn’t her fault. Being naive isn’t a crime. The only criminal here is this entitled asshole.",
        "She’ll get shamed & blamed for speaking up against him now.",
        "Least ret**ard from the \"best\" political party",
        "Is this the girlfriend hitter by car",
        "Bhai ladki ki galti nahi hai is crime me. Bhola ya bewakoof hona crime nahi hai. Crime to launde ne hi kiya hai aur usko jail honi chahiye."
    ],
    "cleaned_text": "amir baap ka bigda bacha kudos dad great parenting skills ",
    "cleaned_title": "amir baap ka bigda bacha",
    "cleaned_selftext": "kudos dad great parenting skills",
    "cleaned_comments": "people future jailed fuck entitled twats sideways put behind bars rot shame violence entitlement thing get born privileged class clearly vile human dont deserve open tormenting society entitlement privilege comes violence family business se action would taken cant agree kind broad generalization understand sentiment police trying help mofo girl came know married still tried reason left ldki saal tk iske saath thi aise bnde ke saath din naa rhe koi right one careful making statements easily gives way victim blaming regardless anything wasnt fault naive isnt crime criminal entitled asshole shell get shamed blamed speaking least retard best political party girlfriend hitter car bhai ladki ki galti nahi hai crime bhola ya bewakoof hona crime nahi hai crime launde ne hi kiya hai aur usko jail honi chahiye",
    "light_cleaned_title": "Amir Baap ka Bigda Bacha",
    "light_cleaned_selftext": "Kudos to his dad for his great parenting skills",
    "light_cleaned_comments": "These people are our future… He should be jailed Fuck these entitled twats sideways and put them behind bars to rot. What a shame. If violence and entitlement is the only thing you get down to after being born in a privileged class, you are clearly a vile human being and don’t deserve to be out in the open tormenting the society. Entitlement and privilege comes from violence. So this is just family business Will se what action would taken !! I can’t agree with that kind of broad generalization but I do understand your sentiment. Police is trying to help this mofo The girl came to know he was married and still tried to reason with him. Should have left him. Ldki 4.5 saal tk iske saath thi. Aise bnde ke saath 2 din naa rhe koi You are right but one has to be careful about making such statements. It easily gives way to victim blaming. Regardless of anything, this wasn’t her fault. Being naive isn’t a crime. The only criminal here is this entitled asshole. She’ll get shamed & blamed for speaking up against him now. Least ret**ard from the \"best\" political party Is this the girlfriend hitter by car Bhai ladki ki galti nahi hai is crime me. Bhola ya bewakoof hona crime nahi hai. Crime to launde ne hi kiya hai aur usko jail honi chahiye."
}