{
    "id": "12cgv4h",
    "title": "I got a new kitten. Need advice.",
    "url": "https://v.redd.it/37kwawcqu1sa1",
    "selftext": "Hey, I got a new kitten a month back! Adopted him from a friend who was traveling abroad. He has gotten all his injections, vaccinations, balls been cut, etc. He will turn 1 by the end of May.\n\nI need help with things to buy for him and to take care of him. Anything that you can share from personal experience would be lovely. \n\n1. If you could give me links to buy some nice interactive games/toys. Too many options on Amazon and would like to pick something that someone has used. \n\n2. Link for those 3way or 5way tunnels or any such items that you may have purchased. \n\n3. What feed do you use? I used Whiskas. Basically the stock my friend gave me. But have bought Royal Canin last time. It's 3 times as expensive. Is it worth it?\n\n4. What treats do you give? The store next to my house has limited options. \n\n5. What litter do you use? And how frequently do you change it? \n\n6. How frequently do you bathe your cute little monster? Haven't bathed him yet. Will mostly take him outside and get it done because I don't know how to do it. \n\n7. I will never cut his nails. Have done my research on that part. \n\n8. Lint remover. I need one badly. \n\nSorry for the long post. Video of him jumping around for your patience 😃",
    "flair": "AskIndia",
    "score": 384,
    "num_comments": 120,
    "created_utc": 1680693408.0,
    "convurl": "https://external-preview.redd.it/k5VCZVsJyVzrVjgdsYjUXcvo9xczy_b0zt-FKczIGOI.png?format=pjpg&auto=webp&v=enabled&s=50126c87fad518a307a3c86a8f87764b46de9964",
    "comments": [
        "That’s a cat.",
        "Do the Lion King Pose",
        "3) I use whiskas kitten dry food and wet food\n\n5) petcrux litter, clean it every evening and and refil whenever required.\n\n6) once a week, first wet the cat with mild warm water and mix cat shampoo in water and pour it rub it then clean with normal water then dry it\n\n7) why not to cut nails? I don’t know and never trimmed too\n\n8) why lint remover?",
        "https://preview.redd.it/mqdsaesn85sa1.png?width=1941&format=png&auto=webp&v=enabled&s=7df0a834841f07122cac81d60b060c03b29ac047\n\nMine, name Leo",
        "Advise: It’s not food. It’s not your girlfriend. No it won’t bark. No it can’t cook. No it doesn’t care about your feelings.",
        "Name her Adolf kitler",
        "He's so cute .\nYou don't need to bathe your kitten, a healthy cat can groom himself\n\nYou should cut his nails\n\nLitter can be availed from Amazon, I use ever clean pet pattern litter but please keep two litter boxes for a single cat.\nI use whiskas dry food and wet food and in addition i give them creamy o treats, they love it",
        "You've got an apex predator....let him do whatever it wants",
        "Olx par bech de👍",
        "Advice? \nEnjoy!",
        "Same bedsheet bhai",
        "DO NOT pet them on their stomachs. They absolutely hate and you will lose your hand",
        "wym you got a cat? It's the other way around.",
        "Sorry for this random question.\n\nDo surgery costs differ depending on the hospitals or is it same everywhere in a state?\n\nLooking to undergo a laser hemorrhoid surgery.\nIt currently costs 25K after applying my insurance in an hospital called Sparsh in Bangalore.",
        "Don't feed grapes 🍇\n it makes cat ill 😿",
        "That's protein 😋\n\nYummy protein. Take her to butcher if you are non vegetarian person.\n\nIf you are veg, then ignore this comment",
        "no no bathing once a week cats clean themselves",
        "https://preview.redd.it/vg3rnd2il5sa1.jpeg?width=4032&format=pjpg&auto=webp&v=enabled&s=245ca11ff1f98ce5bb55a73172ca9829b12371b3\n\nThis how it hides and become very dirty 🤦‍♂️ I don’t have any other option than bath",
        "he will lick and clean himself i have a bunny and they do the same if they are not cleaning themselves then there is something wrong with them at least that is the case with rabbits.\n\nwith cats too at maximum bath should be given once a year please research on this topic i am sure you will find many cases similar to yours you can see what they do in such a situation",
        "Thanks for the input, will do some research 👍",
        "https://preview.redd.it/dwe52u3ao5sa1.jpeg?width=1822&format=pjpg&auto=webp&v=enabled&s=d792c5c9e0946f244e7d9d15b421817ed21528d6\n\nHere's my Leo ❤",
        "I have three cats. I clean their litter every day and keep refilling with new litter. But once in three months  I clear out the litter box. And wash it and dry it and put fresh litter\n\nWhiskas is good enough but you could try rice little pumpkin and chicken combo as a home meal. Takes prep and can be stored for a week.\n\nOther than that, don't shower them. But if they are inside outside cat you might wanna buy wet wipes for pets. Or if they can be showered without bleeding you to death then go ahead. Don't cut nails. Unless it's extremely sharp. Take a Vets opinion on that",
        "That's what I thought, that's a grown cat, not a kitten",
        "Underrated comment",
        "Thats a floofer if i have seen one, I demand more pictures good sir!",
        "Completely off topic, but that bedsheet looks familiar huh ?",
        "r/beatmetoit",
        "You can safely trim a cat's nails carefully without hurting them. You cannot cut the entire nail, that's extremely painful. If you don't feel confident, just get some good scratching posts so the kitten can scratch and maintain nails himself.",
        "Double it and give it to the next person",
        "Don’t cook it! Not worth it!",
        "It's your personal\n\nThere are many issues in india to bother about",
        "Behaves like a kitten though.",
        "Actually she's grown up but not her mind she's still don't drinks milk without bour bita :(",
        "Don't you know the difference between a kitten and a cat?",
        "That's a full grown tom. Not a kitten.",
        "Why 2 litter box?",
        "We need more pics!",
        "Eat",
        "Cute username!!",
        "Never off the mind🤣🤣",
        "For a toy the Cat can play with (You'll have to use it so the Cat interacts with it), here's the link showing what I'm talking about.\n\n[https://supertails.com/products/trixie-playing-rod-with-leather-straps-and-feathers-toy-for-cats-assorted?variant=39924390494381&currency=INR&utm\\_medium=product\\_sync&utm\\_source=google&utm\\_content=sag\\_organic&utm\\_campaign=sag\\_organic&utm\\_campaign=PerfMax\\_NewCust\\_Products&utm\\_device=c&utm\\_term=&network=x&utm\\_medium=cpc&utm\\_source=google&agid=&ap=&aoi=&gclid=Cj0KCQjwuLShBhC\\_ARIsAFod4fLWV7L\\_ZlGTdth908GJ9T13GOg18v27hzID28eI6QbI5xDJ-apZDCoaArmnEALw\\_wcB](https://supertails.com/products/trixie-playing-rod-with-leather-straps-and-feathers-toy-for-cats-assorted?variant=39924390494381&currency=INR&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&utm_campaign=PerfMax_NewCust_Products&utm_device=c&utm_term=&network=x&utm_medium=cpc&utm_source=google&agid=&ap=&aoi=&gclid=Cj0KCQjwuLShBhC_ARIsAFod4fLWV7L_ZlGTdth908GJ9T13GOg18v27hzID28eI6QbI5xDJ-apZDCoaArmnEALw_wcB)\n\nWhiskas dry & wet food are good. Me-ow dry food is also good. My 2 Cats love the Mackerel flavour.\n\nI don't have a kitty litter. Instead trained both the Cats to pee & shit next to the drain in the bathroom.\n\nI give my Cats bath twice a month, especially the Persian because of the long fur. The Vet was suggesting a weekly bath but 2 times a month is fine.\n\nEven I don't cut their nails often. If taking the Cats to be groomed, they chop off the nails then.",
        "You didn’t get a cat, the cat’s got you.",
        "https://preview.redd.it/rsc9q3ds28sa1.png?width=3196&format=png&auto=webp&v=enabled&s=ab9b74652f0d601690a4d750d7fb98f84cb4c231",
        "That is a full grown cat.",
        "https://www.reddit.com/r/india/comments/12cgv4h/i_got_a_new_kitten_need_advice/jf53jfw/",
        "So cute😍",
        "Cats are very clean animal if you're seldom unable to clean the litter box they will defecate outside. So a spare litter box is good so that the cat always has options",
        "You didn't find it. It found you. It owns you now. Surrender unto it peasant. Submit to the higher order.",
        "Just one advice.. don't visit China with your cat",
        "Ayo that's a cat dude not a kitten 💀💀💀",
        "Hey! Fellow cat daddy here!  \n\n\n3. If you can invest some time into his food, get chicken from a butcher, mince and boil it and feed it to him. My kitten loves it, and I feed it to him on alternate days.   \nBased on how big your cat is, around 90-100grams chicken a day should do. You can basically buy 700 grams chicken at once and keep it frozen in the freezer for the week.   \nAsk your butcher to add liver + heart (around 100 grams,) and some chicken heads all totaling 700 grams.   \n**This is SUPER cost effective. In Mumbai where I live, it costs me Rs. 300 for 1KG of meat.** So like, for my kitten who is tiny, I buy 500 grams at once, and Rs.150 is done for the week.   \n*I mince it when I get it home and store it in tiny boxes. Becomes super easy to defreeze and boil too.*  \n\n\n**If possible, prefer dedicated pet websites like SuperTails or HeadsUpForTails**.   \n[https://headsupfortails.com/products/sheba-rich-chicken-premium-loaf-wet-kitten-food-box-1-68-kg](https://headsupfortails.com/products/sheba-rich-chicken-premium-loaf-wet-kitten-food-box-1-68-kg) this is a good option for the cost effective wet food. it comes down to around Rs.48 per pack if you buy this box. So similar to whiskas but better quality food.   \n\n\nALSO, avoid dry food. And feed him a variety of foods so he doesn't get addicted to just one.  \n\n\n4. **Me-O Wet treats** are great. **Temptations** dry treats are great too, especially for training. But cats are very selective, so you might have to try a few treats before he settles on one. So don't go overboard and buy a lot of them. (I made that mistake and suffered :') )  \n\n\n5. This lasts me around 3 - 3.5 months [https://www.amazon.in/gp/product/B09CYM1BKT/ref=ppx\\_yo\\_dt\\_b\\_asin\\_title\\_o04\\_s01?ie=UTF8&psc=1](https://www.amazon.in/gp/product/B09CYM1BKT/ref=ppx_yo_dt_b_asin_title_o04_s01?ie=UTF8&psc=1) .\n\nCats like their litter boxes clean, so I'd clean it every morning AT LEAST.   \n\n\n6. You'll find dry shampoos online, you can use those instead of bathing. Cats clean themselves, so only bathe them if they've like become SUPER dirty, have been in the mud or have ticks on them.  \n\n\n7. I think you should cut his nails. But also make sure you have scratch pads/posts in your house.  \n\n\n  \nP.S. HE IS SUPER CUTE!!!",
        "I bought my outside cat a couple of toys which she never played with. Then she found a string with balls attached to it that she loves playing with whenever she's feeling like giving out bunny kicks. You can try buying her fake mouses or feathers on a stick, but she'll probably end up playing with a box or a string. \n\nI buy Whiskas for her. I try to make sure every serving is half dry and half wet food, so it's cheaper to feed her without compromising her health. It seems like you might be loaded, so you don't have to worry about getting the cheapest option. I can't tell you what the best brand is. You should try r/pets or r/Indianpets.\n\nFor treats, I get Temptations or Me O Creamy. The treats have more calories, so make sure you use those rarely or when you're training her. I've seen some owners give one treat before bed each night.\n\nYou don't need to change the litter. Just cleaning by scooping is enough.\n\nYou're right; you don't need to cut the nails (usually). But you do need to provide a scratching post if you don't want to get all of your furniture torn up.\n\nCats don't need baths usually. They clean themselves. But if your cat gets too dirty to clean itself or gets covered in something she shouldn't ingest, give her a bath immediately. She'll probably hate it and fight you all the way. Wear thick, long gloves or something because she'll try to tear you up.",
        "Tatee katwa do .",
        "Make a post",
        "Dogs are better no 🧢.",
        "my heart 😭",
        "Bhai iska Naam economy rakh de kya pata woh bhi uchal pade",
        "Please do not cut the nails if you don't know cats nails have blood vessels at a certain point better cut them at the vet if needed.\nPlease do not take all advice from the internet without some confirmation for the cays sake.",
        "Royal cannin and Whiskas the only difference I found is there poop quality is better when eating royal canning.\nPoop smell also changes. Yoe can try after consulting the vet.\nKeep fresh water access for the cat or running water if you can.  \nTry to give him both dry and wet foods to avoid any renal issues when it's gets old as eating habits are hard to change when cats get old.",
        "I use Whiskas dry food and Sheba wet food. Whiskas is good enough.\n\nAs for toys, my cat likes balls. I have a few rattling balls that she likes to chase around. Also bought her chew toys.\n\nAs for treats, I usually give her Temptations. Either the dry ones or the creamy ones. But give your cat treats sparingly.\n\nI use BestClean litter. I think it clumps well and removes smell. Fairly cheap too.",
        "Wait until she fucks you and your whole house 🏠 😂 Congratulations man.",
        "Nice tag, if you purchased it online, can you please share the link I want to buy one for my Leo 😊",
        "😂",
        "Set up a cat wall",
        "You think cat's nails are only cut in veterinarian office? No . It's a little tricky to cut thier nails but you have to find ideal time when they're in relaxed state to cut their nails. I've done it many times with my two kittens, if one is not deft in handling paws, they can learn from vet but there's nothing wrong in cutting nails, you have to know from which point you should start cutting.",
        "&#x200B;\n\n1. Usually, they can play with anything - crumbled paper balls, earbuds, boxes, and bird feather is their favorite. You can get some toys from Amazon:\n   1. [Toy 1](https://www.amazon.in/REHTRAD-Kittens%EF%BC%8CFeather-Playing-Toys%EF%BC%8CPlush-Colored/dp/B08Z3FFSZN/ref=sr_1_5?crid=2UIVBZJBCWZ02&keywords=cat+toys&qid=1680762707&sprefix=cat+toys%2Caps%2C235&sr=8-5)\n   2. [Toy 2](https://www.amazon.in/Premium-Interactive-Activity-Fishing-Feathers/dp/B09BR683NC/ref=sr_1_12?crid=2UIVBZJBCWZ02&keywords=cat+toys&qid=1680762707&sprefix=cat+toys%2Caps%2C235&sr=8-12)\n   3. Prefer something that has feathers.\n   4. Also, don't give them all toys at once. Give them one by one. They will lose interest.\n2. Your cat seems to a long hair Indian cat (I have the same)\n   1. For wet food, get Bellota. For a bit premium you can [Sheba](https://www.amazon.in/Sheba-Fish-Skipjack-Salmon-Adult/dp/B079ZLVRTD/ref=sr_1_6?crid=367V5MLNKTUQU&keywords=sheba+cat+food&qid=1680764229&sprefix=sheba+%2Caps%2C287&sr=8-6). BTW, boiled chicken is the best with some pumpkin.\n   2. For dry food, try Friskies.\n   3. I really don't like the quality of whiskas.\n3. Meo, Sheeba creamy treats. You can also try small chunks ones too.\n4. [Bentonite clay litter](https://www.amazon.in/gp/product/B0BB9N3B61/ref=ppx_yo_dt_b_asin_image_o00_s00?ie=UTF8&psc=1) is easily available, but I'll recommend you try the wooden pellet ones(if possible)\n5. You don't need to. They clean themselves. There might be rare occasions when the cat is really dirty or has something stuck to the fur then you might need to give it a bath.\n6. But get the nails trimmed regularly. Because if they get out of habit it will pain in the ass to get it trimmed (cats being cats)\n7. [Lint remover](https://www.amazon.in/EPISKEY%C2%AE-Pet-Hair-Remover-Brush/dp/B09H37M5LK/ref=sr_1_8?keywords=pet+hair+brush&qid=1680762637&sprefix=pet+hair+%2Caps%2C269&sr=8-8) \\- this is a must for cleaning up your clothes.\n\n&#x200B;\n\nGet a [scratch pad](https://pawsindia.com/collections/cat-scratchers/products/pawsindia-5in1-replaceable-box-cat-scratcher), if you don't want your furniture etc to be ruined. Also, get something for grooming her daily, this will reduce the hair fall and reduce vomiting hair ball. \n\n[Cat grooming brush 1](https://www.amazon.in/Pumpkin-Cleaning-Slicker-Grooming-Undercoat/dp/B0987QX7HG/ref=sr_1_5?keywords=pet+hair+brush&qid=1680762637&sprefix=pet+hair+%2Caps%2C269&sr=8-5) \n\n[Cat grooming brush 2](https://www.amazon.in/Grooming-Deshedding-Brush-Gloves-Bathing/dp/B09QQMX3HT/ref=sr_1_5?keywords=cat%2Bgrooming%2Bgloves&qid=1680763779&sprefix=cat%2Bgro%2Caps%2C227&sr=8-5&th=1)\n\nTry getting food, and treats from local shops, they might give you 10-20% discount. \n\nFeel free to DM me regarding any help/tips.",
        "Love that cat with all your heart",
        ">What feed do you use? I used Whiskas. Basically the stock my friend gave me. But have bought Royal Canin last time. It's 3 times as expensive. Is it worth it?\n\nNo. In fact both Whiskas and Royal Canin are made by the same company and both are garbage, i.e. low meat and high sugar and salt. It will ruin your cat's health in the long run. Ideally look for high protein foods - Farmina/Matisse or other brands. They will probably be as expensive as Royal Canin.",
        "Of course! I bought it from Petsy. \n\nTheir website seems to be down right now, but here's the link anyway:\n\nhttps://www.petsy.online/products/personalised-petsy-pet-tag-small-circle-multiple-colours",
        "This site is down from long time 😢\n\nThank you for sharing the link.",
        "You want to suggest cutting nails to a 1st time cat owner go ahead.  Think about the poor cat in case a mistake happens.",
        "I thought they were kittens till the first year of their life.",
        "*He",
        "*him ... And that's one hell of a name",
        "Oh yes, my bad. It actually is. He finally selected me as the person who takes care of him but when I look at him I always feel like he is looking for other options on the side.",
        "Flipkart: Logon ko jode!",
        "Yes, have done research on this. It's because their vital organs are located there and they naturally feel threatened. But usually not with owners because of the familiarity with touch",
        "Post it in the Bangalore sub",
        "Kitten till one year. After that adult?",
        "You are right!",
        "He will turn one in May",
        "He will turn one in May",
        "He will turn one in may",
        "Leo baaga cute ga undi bhaiyya!!",
        "Thanks bhayya 😎",
        "Oh",
        "Name him Walter white",
        "That's a shame. I hope they haven't closed shop.",
        "He should seek help from veterinarian but down the line he has to learn. It is necessary to cut their nails so that they don't get too long, some cats are lazy and don't scratch enough to taper the long nails which causes discomfort",
        "That's a grown ass cat\n\nAnd buy some shelfs and toys for it",
        "Thank you for such a detailed reply. This really helps.",
        "Haha ... Yeh main kabhi karne wala nahi ...vkya pata kabhi uchhle hi na",
        "Chinese chef 💀",
        "Royal Canin is much much better than Whiskas, which is mainly cornmeal.\nCheck the ingredients. they are listed in order by %. if the 1st thing is corn-based, it's shit.\n\nBetter to encourage them to poop outdoors. but otherwise: Intersand Cat Scoopable Litter is the best price vs quality\n\nCats are self-cleaning.",
        "Okay where is the kitten",
        "Remove that thing tied over the cat’s neck, it can cause some hearing issues in future",
        "Sure budd!  \n\n\nthis video: [https://www.youtube.com/watch?v=QYfFsIeqNnU](https://www.youtube.com/watch?v=QYfFsIeqNnU)  \nhas a great guide on what your cat needs if you're gonna go for meat as his meal. You can easily just stick to chicken, but make sure you **boil** the meat (meat in India isn't tested/processed so it may contain viral diseases).",
        "Another IMPORTANT point (unsure if someone posted it): TALK TO YOUR VET!  \nGet your cat vaccinated!   \nYour vet might suggest a Tricat Vaccine AND a rabies vaccine.   \nThese have to be administered on a yearly basis.  \nALSO deworm your cat with medicine every 3 months.  \n\n\nAND **STERELIZE** your cat! Talk to your vet and get him to discuss when you should do it. In heat your cat will be a nuisance to you and your house PLUS it's very frustrating for cats when their sexual needs aren't satisfied!",
        "Milk can cause an upset stomach depending on the cat. Yes most cats are lactose intolerant,  but there are some which are tolerant as well.\nMy cat doesn't drink enough water, which caused him serious bladder stones and complete urinary blockage. \nHe loves milk, now from the past year, he's been getting only wet food with water and milk two times a day. Never had an upset stomach.",
        "I want a cat",
        "Try kitten Biryani 🗿",
        "Sell him",
        "You need to let him view the outside through the windows. Cats love that.",
        "Neutered male cats cat get a huge growth spurt actually. I have one which is less that a year old and weighs 6kgs",
        "Only trim like milimeters of nails if the floor is marble tiles or something of smooth-hard surface. If you see nails being reddish, its often because natural (over)grown nails creates a reactive force backwards when cats jump and causes internal bleeding. I would say internal bleeding is worse result. \n\nI used to trim in very little bits every week and the reddishness stopped. Whats more my cats have learned to bite their nails when big, along with rubbing their eyes to clean rheum so I don't have to worry anymore.",
        "You do not want them to lick and consume such man made chemicals bruh. This is one of those rare case where a wet towel should be used to clean them",
        "Just give them curd,yakult or milk fermented with lactobacillus probiotics powders. If the milk has fermented then most of resultant products are digestible for any mammal.",
        "only if strangers. my cats tumble all the time so that I may scratch their stomach",
        "I was gonna write the same. Considering Royal canin is some 85rs a piece for 85g with even less chicken content. There is a whole fiasco with wordings in petfood industry. Something \"with real chicken\" means just 25% chicken, something labelled just chicken or fish imply its just 3%, that too cheaper non-veg matter like liver.\n\nCompared to that normal meat from butcher shop is far far far cost effective. Along with liver and heart bits, you may also go for skin and gizzard pieces. Boneless fish is also good. For chicken I boil extra long such that the bone pieces fully softens up and not pose a hazard.\n\nOne thing that the above options can't provide is Taurine, so feeding a packed food once a week is useful. I go for Sheba's pumpkin chicken for the Taurine and the pumpkin enzymes. Also a mix of Samolac enzymes and probiotic powders to fill any other gap.\n\nRegarding dry food it depends on how much your cats drink water. Most house cats raised from kittens at home will drink good amount of water. One my cat only eats wet, another only eats dry but they consume water accordingly. Another cat was drinking too much water and his poop was always loose, puke too. I had to make him eat a bit of dry food to normalise his stool.\n\nu/thejokeyjokerson",
        "Toy 2 is really trash I had it. Its cheap bamboo stick with barely connected string and hazardous plastic wool filled toy doll at the end. My cat bit on the sticks enough to potrude out some pointy sharp chips.\n\nAll the ones below are good teasers I felt in different ways to keep cats engaged:\n\n\nhttps://www.amazon.in/gp/product/B01BTOV06S/, \n\nhttps://www.amazon.in/Pets-Company-Treaser-Feather-Interactive/dp/B0BHP7TPXZ,\n\nhttps://www.amazon.in/gp/product/B08KDS99CJ/",
        "u/thejokeyjokerson OP hear this out, Mars and Nestle has massive duopoly in pet industry and all their products are massproduced, repurposed reject meats and copius amount of undigestable grains. Its in these conglomerates' interest that pet cats(and dogs) develop hepatic and renal problems from undigestable things in their food(and from other bad diets), at which the point the same companies will sell hepatic/renal vet food for \"ageing\" pets; selling a solution to a problem the same companies contributed to. \n\nPedigree also by Mars as Whiskas, Sheba, RC are, had SEVEN major global recalls in TEN years. RC had 4 which is also bad.\n\n\nFarmina/Matisse is equally bad. Their lamb mouse has 20% chicken, 5% lamb, rest all grains. I have lost hope in packed petfood industry especially on the wetfood department. On the dryfood luckily these days Orijen, Taste of the Wild, Acana, arden-grange are available in India. Better to buy boneless chicken and fish and serve boiled. Add in eggs, liver, enzymes and probiotics. Its far economical and far more nutritious.",
        "Grain-free foods aren't necessarily safe either. The cornmeal replacement/substitute some companies use have shown to cause other different issues and all those substitutes are not regulated yet, just initial studies to warn of safety.",
        "You are protein too, yummm",
        "bro then he needs to be barred from going to that place but the reality is that they clean themselves and always smell very fresh like our hair does when we have just shampooed it with a smell less shampoo",
        "Now I get it, I clean my commander’s litter box twice a day.",
        "Their website is back up now in case you want to check the tag out.",
        "Thank you so much :) ordered few items. ❤️",
        "Very cute",
        ">Instead trained both the Cats to pee & shit next to the drain in the bathroom.\n\nMay I ask how?",
        "When I bought my Persian Cat as a Kitten, she was litter trained. The trick is that you've to take your Kitten or newly adopted Cat to the bathroom & place her right above the bathroom drain hole. They realise & recognize the smell somehow & pee/shit there.\n\nWhen I got my adopted Indie kitten after a year, I did this & she instantly started to use the bathroom for such deeds.\n\nThey're so hellbent on using the bathroom that if it's occupied at the time they want to use it, they patiently wait outside the door till it opens."
    ],
    "cleaned_text": "got new kitten need advice hey got new kitten month back adopted friend traveling abroad gotten injections vaccinations balls cut etc turn end may need help things buy take care anything share personal experience would lovely could give links buy nice interactive gamestoys many options amazon would like pick something someone used link way way tunnels items may purchased feed use used whiskas basically stock friend gave bought royal canin last time times expensive worth treats give store next house limited options litter use frequently change frequently bathe cute little monster havent bathed yet mostly take outside get done dont know never cut nails done research part lint remover need one badly sorry long post video jumping around patience ",
    "cleaned_title": "got new kitten need advice",
    "cleaned_selftext": "hey got new kitten month back adopted friend traveling abroad gotten injections vaccinations balls cut etc turn end may need help things buy take care anything share personal experience would lovely could give links buy nice interactive gamestoys many options amazon would like pick something someone used link way way tunnels items may purchased feed use used whiskas basically stock friend gave bought royal canin last time times expensive worth treats give store next house limited options litter use frequently change frequently bathe cute little monster havent bathed yet mostly take outside get done dont know never cut nails done research part lint remover need one badly sorry long post video jumping around patience",
    "cleaned_comments": "thats cat lion king pose use whiskas kitten dry food wet food petcrux litter clean every evening refil whenever required week first wet cat mild warm water mix cat shampoo water pour rub clean normal water dry cut nails dont know never trimmed lint remover mine name leo advise food girlfriend wont bark cant cook doesnt care feelings name adolf kitler hes cute dont need bathe kitten healthy cat groom cut nails litter availed amazon use ever clean pet pattern litter please keep two litter boxes single cat use whiskas dry food wet food addition give creamy treats love youve got apex predatorlet whatever wants olx par bech de advice enjoy bedsheet bhai pet stomachs absolutely hate lose hand wym got cat way around sorry random question surgery costs differ depending hospitals everywhere state looking undergo laser hemorrhoid surgery currently costs k applying insurance hospital called sparsh bangalore dont feed grapes makes cat ill thats protein yummy protein take butcher non vegetarian person veg ignore comment bathing week cats clean hides become dirty dont option bath lick clean bunny cleaning something wrong least case rabbits cats maximum bath given year please research topic sure find many cases similar see situation thanks input research heres leo three cats clean litter every day keep refilling new litter three months clear litter box wash dry put fresh litter whiskas good enough could try rice little pumpkin chicken combo home meal takes prep stored week dont shower inside outside cat might wan na buy wet wipes pets showered without bleeding death go ahead dont cut nails unless extremely sharp take vets opinion thats thought thats grown cat kitten underrated comment thats floofer seen one demand pictures good sir completely topic bedsheet looks familiar huh rbeatmetoit safely trim cats nails carefully without hurting cut entire nail thats extremely painful dont feel confident get good scratching posts kitten scratch maintain nails double give next person dont cook worth personal many issues india bother behaves like kitten though actually shes grown mind shes still dont drinks milk without bour bita dont know difference kitten cat thats full grown tom kitten litter box need pics eat cute username never mind toy cat play youll use cat interacts heres link showing im talking httpssupertailscomproductstrixieplayingrodwithleatherstrapsandfeatherstoyforcatsassortedvariantcurrencyinrutmmediumproductsyncutmsourcegoogleutmcontentsagorganicutmcampaignsagorganicutmcampaignperfmaxnewcustproductsutmdevicecutmtermnetworkxutmmediumcpcutmsourcegoogleagidapaoigclidcjkcqjwulshbhcarisafodflwvlzlgtdthgjtgogvhzideiqbixdjapzdcoaarmnealwwcbhttpssupertailscomproductstrixieplayingrodwithleatherstrapsandfeatherstoyforcatsassortedvariantcurrencyinrutmmediumproductsyncutmsourcegoogleutmcontentsagorganicutmcampaignsagorganicutmcampaignperfmaxnewcustproductsutmdevicecutmtermnetworkxutmmediumcpcutmsourcegoogleagidapaoigclidcjkcqjwulshbhcarisafodflwvlzlgtdthgjtgogvhzideiqbixdjapzdcoaarmnealwwcb whiskas dry wet food good meow dry food also good cats love mackerel flavour dont kitty litter instead trained cats pee shit next drain bathroom give cats bath twice month especially persian long fur vet suggesting weekly bath times month fine even dont cut nails often taking cats groomed chop nails didnt get cat cats got full grown cat cute cats clean animal youre seldom unable clean litter box defecate outside spare litter box good cat always options didnt find found owns surrender unto peasant submit higher order one advice dont visit china cat ayo thats cat dude kitten hey fellow cat daddy invest time food get chicken butcher mince boil feed kitten loves feed alternate days based big cat around grams chicken day basically buy grams chicken keep frozen freezer week ask butcher add liver heart around grams chicken heads totaling grams super cost effective mumbai live costs rs kg meat like kitten tiny buy grams rs done week mince get home store tiny boxes becomes super easy defreeze boil possible prefer dedicated pet websites like supertails headsupfortails httpsheadsupfortailscomproductsshebarichchickenpremiumloafwetkittenfoodboxkghttpsheadsupfortailscomproductsshebarichchickenpremiumloafwetkittenfoodboxkg good option cost effective wet food comes around rs per pack buy box similar whiskas better quality food also avoid dry food feed variety foods doesnt get addicted one meo wet treats great temptations dry treats great especially training cats selective might try treats settles one dont go overboard buy lot made mistake suffered lasts around months httpswwwamazoningpproductbcymbktrefppxyodtbasintitleosieutfpschttpswwwamazoningpproductbcymbktrefppxyodtbasintitleosieutfpsc cats like litter boxes clean id clean every morning least youll find dry shampoos online use instead bathing cats clean bathe theyve like become super dirty mud ticks think cut nails also make sure scratch padsposts house ps super cute bought outside cat couple toys never played found string balls attached loves playing whenever shes feeling like giving bunny kicks try buying fake mouses feathers stick shell probably end playing box string buy whiskas try make sure every serving half dry half wet food cheaper feed without compromising health seems like might loaded dont worry getting cheapest option cant tell best brand try rpets rindianpets treats get temptations creamy treats calories make sure use rarely youre training ive seen owners give one treat bed night dont need change litter cleaning scooping enough youre right dont need cut nails usually need provide scratching post dont want get furniture torn cats dont need baths usually clean cat gets dirty clean gets covered something shouldnt ingest give bath immediately shell probably hate fight way wear thick long gloves something shell try tear tatee katwa make post dogs better heart bhai iska naam economy rakh de kya pata woh bhi uchal pade please cut nails dont know cats nails blood vessels certain point better cut vet needed please take advice internet without confirmation cays sake royal cannin whiskas difference found poop quality better eating royal canning poop smell also changes yoe try consulting vet keep fresh water access cat running water try give dry wet foods avoid renal issues gets old eating habits hard change cats get old use whiskas dry food sheba wet food whiskas good enough toys cat likes balls rattling balls likes chase around also bought chew toys treats usually give temptations either dry ones creamy ones give cat treats sparingly use bestclean litter think clumps well removes smell fairly cheap wait fucks whole house congratulations man nice tag purchased online please share link want buy one leo set cat wall think cats nails cut veterinarian office little tricky cut thier nails find ideal time theyre relaxed state cut nails ive done many times two kittens one deft handling paws learn vet theres nothing wrong cutting nails know point start cutting xb usually play anything crumbled paper balls earbuds boxes bird feather favorite get toys amazon toy httpswwwamazoninrehtradkittensefbccfeatherplayingtoysefbccplushcoloreddpbzffsznrefsrcriduivbzjbcwzkeywordscattoysqidsprefixcattoyscapscsr toy httpswwwamazoninpremiuminteractiveactivityfishingfeathersdpbbrncrefsrcriduivbzjbcwzkeywordscattoysqidsprefixcattoyscapscsr prefer something feathers also dont give toys give one one lose interest cat seems long hair indian cat wet food get bellota bit premium shebahttpswwwamazoninshebafishskipjacksalmonadultdpbzlvrtdrefsrcridvmlnktuqukeywordsshebacatfoodqidsprefixshebacapscsr btw boiled chicken best pumpkin dry food try friskies really dont like quality whiskas meo sheeba creamy treats also try small chunks ones bentonite clay litterhttpswwwamazoningpproductbbbnbrefppxyodtbasinimageosieutfpsc easily available ill recommend try wooden pellet onesif possible dont need clean might rare occasions cat really dirty something stuck fur might need give bath get nails trimmed regularly get habit pain ass get trimmed cats cats lint removerhttpswwwamazoninepiskeycaepethairremoverbrushdpbhmlkrefsrkeywordspethairbrushqidsprefixpethaircapscsr must cleaning clothes xb get scratch padhttpspawsindiacomcollectionscatscratchersproductspawsindiainreplaceableboxcatscratcher dont want furniture etc ruined also get something grooming daily reduce hair fall reduce vomiting hair ball cat grooming brush httpswwwamazoninpumpkincleaningslickergroomingundercoatdpbqxhgrefsrkeywordspethairbrushqidsprefixpethaircapscsr cat grooming brush httpswwwamazoningroomingdesheddingbrushglovesbathingdpbqqmxhtrefsrkeywordscatbgroomingbglovesqidsprefixcatbgrocapscsrth try getting food treats local shops might give discount feel free dm regarding helptips love cat heart feed use used whiskas basically stock friend gave bought royal canin last time times expensive worth fact whiskas royal canin made company garbage ie low meat high sugar salt ruin cats health long run ideally look high protein foods farminamatisse brands probably expensive royal canin course bought petsy website seems right heres link anyway site long time thank sharing link want suggest cutting nails st time cat owner go ahead think poor cat case mistake happens thought kittens till first year life thats one hell name oh yes bad actually finally selected person takes care look always feel like looking options side flipkart logon ko jode yes done research vital organs located naturally feel threatened usually owners familiarity touch post bangalore sub kitten till one year adult right turn one may turn one may turn one may leo baaga cute ga undi bhaiyya thanks bhayya oh name walter white thats shame hope havent closed shop seek help veterinarian line learn necessary cut nails dont get long cats lazy dont scratch enough taper long nails causes discomfort thats grown ass cat buy shelfs toys thank detailed reply really helps haha yeh main kabhi karne wala nahi vkya pata kabhi uchhle hi na chinese chef royal canin much much better whiskas mainly cornmeal check ingredients listed order st thing cornbased shit better encourage poop outdoors otherwise intersand cat scoopable litter best price vs quality cats selfcleaning okay kitten remove thing tied cats neck cause hearing issues future sure budd video httpswwwyoutubecomwatchvqyffsieqnnuhttpswwwyoutubecomwatchvqyffsieqnnu great guide cat needs youre gon na go meat meal easily stick chicken make sure boil meat meat india isnt testedprocessed may contain viral diseases another important point unsure someone posted talk vet get cat vaccinated vet might suggest tricat vaccine rabies vaccine administered yearly basis also deworm cat medicine every months sterelize cat talk vet get discuss heat cat nuisance house plus frustrating cats sexual needs arent satisfied milk cause upset stomach depending cat yes cats lactose intolerant tolerant well cat doesnt drink enough water caused serious bladder stones complete urinary blockage loves milk past year hes getting wet food water milk two times day never upset stomach want cat try kitten biryani sell need let view outside windows cats love neutered male cats cat get huge growth spurt actually one less year old weighs kgs trim like milimeters nails floor marble tiles something smoothhard surface see nails reddish often natural overgrown nails creates reactive force backwards cats jump causes internal bleeding would say internal bleeding worse result used trim little bits every week reddishness stopped whats cats learned bite nails big along rubbing eyes clean rheum dont worry anymore want lick consume man made chemicals bruh one rare case wet towel used clean give curdyakult milk fermented lactobacillus probiotics powders milk fermented resultant products digestible mammal strangers cats tumble time may scratch stomach gon na write considering royal canin rs piece g even less chicken content whole fiasco wordings petfood industry something real chicken means chicken something labelled chicken fish imply cheaper nonveg matter like liver compared normal meat butcher shop far far far cost effective along liver heart bits may also go skin gizzard pieces boneless fish also good chicken boil extra long bone pieces fully softens pose hazard one thing options cant provide taurine feeding packed food week useful go shebas pumpkin chicken taurine pumpkin enzymes also mix samolac enzymes probiotic powders fill gap regarding dry food depends much cats drink water house cats raised kittens home drink good amount water one cat eats wet another eats dry consume water accordingly another cat drinking much water poop always loose puke make eat bit dry food normalise stool uthejokeyjokerson toy really trash cheap bamboo stick barely connected string hazardous plastic wool filled toy doll end cat bit sticks enough potrude pointy sharp chips ones good teasers felt different ways keep cats engaged uthejokeyjokerson op hear mars nestle massive duopoly pet industry products massproduced repurposed reject meats copius amount undigestable grains conglomerates interest pet catsand dogs develop hepatic renal problems undigestable things foodand bad diets point companies sell hepaticrenal vet food ageing pets selling solution problem companies contributed pedigree also mars whiskas sheba rc seven major global recalls ten years rc also bad farminamatisse equally bad lamb mouse chicken lamb rest grains lost hope packed petfood industry especially wetfood department dryfood luckily days orijen taste wild acana ardengrange available india better buy boneless chicken fish serve boiled add eggs liver enzymes probiotics far economical far nutritious grainfree foods arent necessarily safe either cornmeal replacementsubstitute companies use shown cause different issues substitutes regulated yet initial studies warn safety protein yummm bro needs barred going place reality clean always smell fresh like hair shampooed smell less shampoo get clean commanders litter box twice day website back case want check tag thank much ordered items cute instead trained cats pee shit next drain bathroom may ask bought persian cat kitten litter trained trick youve take kitten newly adopted cat bathroom place right bathroom drain hole realise recognize smell somehow peeshit got adopted indie kitten year instantly started use bathroom deeds theyre hellbent using bathroom occupied time want use patiently wait outside door till opens",
    "light_cleaned_title": "I got a new kitten. Need advice.",
    "light_cleaned_selftext": "Hey, I got a new kitten a month back! Adopted him from a friend who was traveling abroad. He has gotten all his injections, vaccinations, balls been cut, etc. He will turn 1 by the end of May. I need help with things to buy for him and to take care of him. Anything that you can share from personal experience would be lovely. 1. If you could give me links to buy some nice interactive games/toys. Too many options on Amazon and would like to pick something that someone has used. 2. Link for those 3way or 5way tunnels or any such items that you may have purchased. 3. What feed do you use? I used Whiskas. Basically the stock my friend gave me. But have bought Royal Canin last time. It's 3 times as expensive. Is it worth it? 4. What treats do you give? The store next to my house has limited options. 5. What litter do you use? And how frequently do you change it? 6. How frequently do you bathe your cute little monster? Haven't bathed him yet. Will mostly take him outside and get it done because I don't know how to do it. 7. I will never cut his nails. Have done my research on that part. 8. Lint remover. I need one badly. Sorry for the long post. Video of him jumping around for your patience 😃",
    "light_cleaned_comments": "That’s a cat. Do the Lion King Pose 3) I use whiskas kitten dry food and wet food 5) petcrux litter, clean it every evening and and refil whenever required. 6) once a week, first wet the cat with mild warm water and mix cat shampoo in water and pour it rub it then clean with normal water then dry it 7) why not to cut nails? I don’t know and never trimmed too 8) why lint remover? Mine, name Leo Advise: It’s not food. It’s not your girlfriend. No it won’t bark. No it can’t cook. No it doesn’t care about your feelings. Name her Adolf kitler He's so cute . You don't need to bathe your kitten, a healthy cat can groom himself You should cut his nails Litter can be availed from Amazon, I use ever clean pet pattern litter but please keep two litter boxes for a single cat. I use whiskas dry food and wet food and in addition i give them creamy o treats, they love it You've got an apex predator....let him do whatever it wants Olx par bech de👍 Advice? Enjoy! Same bedsheet bhai DO NOT pet them on their stomachs. They absolutely hate and you will lose your hand wym you got a cat? It's the other way around. Sorry for this random question. Do surgery costs differ depending on the hospitals or is it same everywhere in a state? Looking to undergo a laser hemorrhoid surgery. It currently costs 25K after applying my insurance in an hospital called Sparsh in Bangalore. Don't feed grapes 🍇 it makes cat ill 😿 That's protein 😋 Yummy protein. Take her to butcher if you are non vegetarian person. If you are veg, then ignore this comment no no bathing once a week cats clean themselves This how it hides and become very dirty 🤦‍♂️ I don’t have any other option than bath he will lick and clean himself i have a bunny and they do the same if they are not cleaning themselves then there is something wrong with them at least that is the case with rabbits. with cats too at maximum bath should be given once a year please research on this topic i am sure you will find many cases similar to yours you can see what they do in such a situation Thanks for the input, will do some research 👍 Here's my Leo ❤ I have three cats. I clean their litter every day and keep refilling with new litter. But once in three months I clear out the litter box. And wash it and dry it and put fresh litter Whiskas is good enough but you could try rice little pumpkin and chicken combo as a home meal. Takes prep and can be stored for a week. Other than that, don't shower them. But if they are inside outside cat you might wanna buy wet wipes for pets. Or if they can be showered without bleeding you to death then go ahead. Don't cut nails. Unless it's extremely sharp. Take a Vets opinion on that That's what I thought, that's a grown cat, not a kitten Underrated comment Thats a floofer if i have seen one, I demand more pictures good sir! Completely off topic, but that bedsheet looks familiar huh ? r/beatmetoit You can safely trim a cat's nails carefully without hurting them. You cannot cut the entire nail, that's extremely painful. If you don't feel confident, just get some good scratching posts so the kitten can scratch and maintain nails himself. Double it and give it to the next person Don’t cook it! Not worth it! It's your personal There are many issues in india to bother about Behaves like a kitten though. Actually she's grown up but not her mind she's still don't drinks milk without bour bita :( Don't you know the difference between a kitten and a cat? That's a full grown tom. Not a kitten. Why 2 litter box? We need more pics! Eat Cute username!! Never off the mind🤣🤣 For a toy the Cat can play with (You'll have to use it so the Cat interacts with it), here's the link showing what I'm talking about. [https://supertails.com/products/trixie-playing-rod-with-leather-straps-and-feathers-toy-for-cats-assorted?variant=39924390494381&currency=INR&utm\\_medium=product\\_sync&utm\\_source=google&utm\\_content=sag\\_organic&utm\\_campaign=sag\\_organic&utm\\_campaign=PerfMax\\_NewCust\\_Products&utm\\_device=c&utm\\_term=&network=x&utm\\_medium=cpc&utm\\_source=google&agid=&ap=&aoi=&gclid=Cj0KCQjwuLShBhC\\_ARIsAFod4fLWV7L\\_ZlGTdth908GJ9T13GOg18v27hzID28eI6QbI5xDJ-apZDCoaArmnEALw\\_wcB](https://supertails.com/products/trixie-playing-rod-with-leather-straps-and-feathers-toy-for-cats-assorted?variant=39924390494381&currency=INR&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&utm_campaign=PerfMax_NewCust_Products&utm_device=c&utm_term=&network=x&utm_medium=cpc&utm_source=google&agid=&ap=&aoi=&gclid=Cj0KCQjwuLShBhC_ARIsAFod4fLWV7L_ZlGTdth908GJ9T13GOg18v27hzID28eI6QbI5xDJ-apZDCoaArmnEALw_wcB) Whiskas dry & wet food are good. Me-ow dry food is also good. My 2 Cats love the Mackerel flavour. I don't have a kitty litter. Instead trained both the Cats to pee & shit next to the drain in the bathroom. I give my Cats bath twice a month, especially the Persian because of the long fur. The Vet was suggesting a weekly bath but 2 times a month is fine. Even I don't cut their nails often. If taking the Cats to be groomed, they chop off the nails then. You didn’t get a cat, the cat’s got you. That is a full grown cat. So cute😍 Cats are very clean animal if you're seldom unable to clean the litter box they will defecate outside. So a spare litter box is good so that the cat always has options You didn't find it. It found you. It owns you now. Surrender unto it peasant. Submit to the higher order. Just one advice.. don't visit China with your cat Ayo that's a cat dude not a kitten 💀💀💀 Hey! Fellow cat daddy here! 3. If you can invest some time into his food, get chicken from a butcher, mince and boil it and feed it to him. My kitten loves it, and I feed it to him on alternate days. Based on how big your cat is, around 90-100grams chicken a day should do. You can basically buy 700 grams chicken at once and keep it frozen in the freezer for the week. Ask your butcher to add liver + heart (around 100 grams,) and some chicken heads all totaling 700 grams. **This is SUPER cost effective. In Mumbai where I live, it costs me Rs. 300 for 1KG of meat.** So like, for my kitten who is tiny, I buy 500 grams at once, and Rs.150 is done for the week. *I mince it when I get it home and store it in tiny boxes. Becomes super easy to defreeze and boil too.* **If possible, prefer dedicated pet websites like SuperTails or HeadsUpForTails**. [https://headsupfortails.com/products/sheba-rich-chicken-premium-loaf-wet-kitten-food-box-1-68-kg](https://headsupfortails.com/products/sheba-rich-chicken-premium-loaf-wet-kitten-food-box-1-68-kg) this is a good option for the cost effective wet food. it comes down to around Rs.48 per pack if you buy this box. So similar to whiskas but better quality food. ALSO, avoid dry food. And feed him a variety of foods so he doesn't get addicted to just one. 4. **Me-O Wet treats** are great. **Temptations** dry treats are great too, especially for training. But cats are very selective, so you might have to try a few treats before he settles on one. So don't go overboard and buy a lot of them. (I made that mistake and suffered :') ) 5. This lasts me around 3 - 3.5 months [https://www.amazon.in/gp/product/B09CYM1BKT/ref=ppx\\_yo\\_dt\\_b\\_asin\\_title\\_o04\\_s01?ie=UTF8&psc=1](https://www.amazon.in/gp/product/B09CYM1BKT/ref=ppx_yo_dt_b_asin_title_o04_s01?ie=UTF8&psc=1) . Cats like their litter boxes clean, so I'd clean it every morning AT LEAST. 6. You'll find dry shampoos online, you can use those instead of bathing. Cats clean themselves, so only bathe them if they've like become SUPER dirty, have been in the mud or have ticks on them. 7. I think you should cut his nails. But also make sure you have scratch pads/posts in your house. P.S. HE IS SUPER CUTE!!! I bought my outside cat a couple of toys which she never played with. Then she found a string with balls attached to it that she loves playing with whenever she's feeling like giving out bunny kicks. You can try buying her fake mouses or feathers on a stick, but she'll probably end up playing with a box or a string. I buy Whiskas for her. I try to make sure every serving is half dry and half wet food, so it's cheaper to feed her without compromising her health. It seems like you might be loaded, so you don't have to worry about getting the cheapest option. I can't tell you what the best brand is. You should try r/pets or r/Indianpets. For treats, I get Temptations or Me O Creamy. The treats have more calories, so make sure you use those rarely or when you're training her. I've seen some owners give one treat before bed each night. You don't need to change the litter. Just cleaning by scooping is enough. You're right; you don't need to cut the nails (usually). But you do need to provide a scratching post if you don't want to get all of your furniture torn up. Cats don't need baths usually. They clean themselves. But if your cat gets too dirty to clean itself or gets covered in something she shouldn't ingest, give her a bath immediately. She'll probably hate it and fight you all the way. Wear thick, long gloves or something because she'll try to tear you up. Tatee katwa do . Make a post Dogs are better no 🧢. my heart 😭 Bhai iska Naam economy rakh de kya pata woh bhi uchal pade Please do not cut the nails if you don't know cats nails have blood vessels at a certain point better cut them at the vet if needed. Please do not take all advice from the internet without some confirmation for the cays sake. Royal cannin and Whiskas the only difference I found is there poop quality is better when eating royal canning. Poop smell also changes. Yoe can try after consulting the vet. Keep fresh water access for the cat or running water if you can. Try to give him both dry and wet foods to avoid any renal issues when it's gets old as eating habits are hard to change when cats get old. I use Whiskas dry food and Sheba wet food. Whiskas is good enough. As for toys, my cat likes balls. I have a few rattling balls that she likes to chase around. Also bought her chew toys. As for treats, I usually give her Temptations. Either the dry ones or the creamy ones. But give your cat treats sparingly. I use BestClean litter. I think it clumps well and removes smell. Fairly cheap too. Wait until she fucks you and your whole house 🏠 😂 Congratulations man. Nice tag, if you purchased it online, can you please share the link I want to buy one for my Leo 😊 😂 Set up a cat wall You think cat's nails are only cut in veterinarian office? No . It's a little tricky to cut thier nails but you have to find ideal time when they're in relaxed state to cut their nails. I've done it many times with my two kittens, if one is not deft in handling paws, they can learn from vet but there's nothing wrong in cutting nails, you have to know from which point you should start cutting. &#x200B; 1. Usually, they can play with anything - crumbled paper balls, earbuds, boxes, and bird feather is their favorite. You can get some toys from Amazon: 1. [Toy 1](https://www.amazon.in/REHTRAD-Kittens%EF%BC%8CFeather-Playing-Toys%EF%BC%8CPlush-Colored/dp/B08Z3FFSZN/ref=sr_1_5?crid=2UIVBZJBCWZ02&keywords=cat+toys&qid=1680762707&sprefix=cat+toys%2Caps%2C235&sr=8-5) 2. [Toy 2](https://www.amazon.in/Premium-Interactive-Activity-Fishing-Feathers/dp/B09BR683NC/ref=sr_1_12?crid=2UIVBZJBCWZ02&keywords=cat+toys&qid=1680762707&sprefix=cat+toys%2Caps%2C235&sr=8-12) 3. Prefer something that has feathers. 4. Also, don't give them all toys at once. Give them one by one. They will lose interest. 2. Your cat seems to a long hair Indian cat (I have the same) 1. For wet food, get Bellota. For a bit premium you can [Sheba](https://www.amazon.in/Sheba-Fish-Skipjack-Salmon-Adult/dp/B079ZLVRTD/ref=sr_1_6?crid=367V5MLNKTUQU&keywords=sheba+cat+food&qid=1680764229&sprefix=sheba+%2Caps%2C287&sr=8-6). BTW, boiled chicken is the best with some pumpkin. 2. For dry food, try Friskies. 3. I really don't like the quality of whiskas. 3. Meo, Sheeba creamy treats. You can also try small chunks ones too. 4. [Bentonite clay litter](https://www.amazon.in/gp/product/B0BB9N3B61/ref=ppx_yo_dt_b_asin_image_o00_s00?ie=UTF8&psc=1) is easily available, but I'll recommend you try the wooden pellet ones(if possible) 5. You don't need to. They clean themselves. There might be rare occasions when the cat is really dirty or has something stuck to the fur then you might need to give it a bath. 6. But get the nails trimmed regularly. Because if they get out of habit it will pain in the ass to get it trimmed (cats being cats) 7. [Lint remover](https://www.amazon.in/EPISKEY%C2%AE-Pet-Hair-Remover-Brush/dp/B09H37M5LK/ref=sr_1_8?keywords=pet+hair+brush&qid=1680762637&sprefix=pet+hair+%2Caps%2C269&sr=8-8) \\- this is a must for cleaning up your clothes. &#x200B; Get a [scratch pad](https://pawsindia.com/collections/cat-scratchers/products/pawsindia-5in1-replaceable-box-cat-scratcher), if you don't want your furniture etc to be ruined. Also, get something for grooming her daily, this will reduce the hair fall and reduce vomiting hair ball. [Cat grooming brush 1](https://www.amazon.in/Pumpkin-Cleaning-Slicker-Grooming-Undercoat/dp/B0987QX7HG/ref=sr_1_5?keywords=pet+hair+brush&qid=1680762637&sprefix=pet+hair+%2Caps%2C269&sr=8-5) [Cat grooming brush 2](https://www.amazon.in/Grooming-Deshedding-Brush-Gloves-Bathing/dp/B09QQMX3HT/ref=sr_1_5?keywords=cat%2Bgrooming%2Bgloves&qid=1680763779&sprefix=cat%2Bgro%2Caps%2C227&sr=8-5&th=1) Try getting food, and treats from local shops, they might give you 10-20% discount. Feel free to DM me regarding any help/tips. Love that cat with all your heart >What feed do you use? I used Whiskas. Basically the stock my friend gave me. But have bought Royal Canin last time. It's 3 times as expensive. Is it worth it? No. In fact both Whiskas and Royal Canin are made by the same company and both are garbage, i.e. low meat and high sugar and salt. It will ruin your cat's health in the long run. Ideally look for high protein foods - Farmina/Matisse or other brands. They will probably be as expensive as Royal Canin. Of course! I bought it from Petsy. Their website seems to be down right now, but here's the link anyway: This site is down from long time 😢 Thank you for sharing the link. You want to suggest cutting nails to a 1st time cat owner go ahead. Think about the poor cat in case a mistake happens. I thought they were kittens till the first year of their life. *He *him ... And that's one hell of a name Oh yes, my bad. It actually is. He finally selected me as the person who takes care of him but when I look at him I always feel like he is looking for other options on the side. Flipkart: Logon ko jode! Yes, have done research on this. It's because their vital organs are located there and they naturally feel threatened. But usually not with owners because of the familiarity with touch Post it in the Bangalore sub Kitten till one year. After that adult? You are right! He will turn one in May He will turn one in May He will turn one in may Leo baaga cute ga undi bhaiyya!! Thanks bhayya 😎 Oh Name him Walter white That's a shame. I hope they haven't closed shop. He should seek help from veterinarian but down the line he has to learn. It is necessary to cut their nails so that they don't get too long, some cats are lazy and don't scratch enough to taper the long nails which causes discomfort That's a grown ass cat And buy some shelfs and toys for it Thank you for such a detailed reply. This really helps. Haha ... Yeh main kabhi karne wala nahi ...vkya pata kabhi uchhle hi na Chinese chef 💀 Royal Canin is much much better than Whiskas, which is mainly cornmeal. Check the ingredients. they are listed in order by %. if the 1st thing is corn-based, it's shit. Better to encourage them to poop outdoors. but otherwise: Intersand Cat Scoopable Litter is the best price vs quality Cats are self-cleaning. Okay where is the kitten Remove that thing tied over the cat’s neck, it can cause some hearing issues in future Sure budd! this video: [https://www.youtube.com/watch?v=QYfFsIeqNnU](https://www.youtube.com/watch?v=QYfFsIeqNnU) has a great guide on what your cat needs if you're gonna go for meat as his meal. You can easily just stick to chicken, but make sure you **boil** the meat (meat in India isn't tested/processed so it may contain viral diseases). Another IMPORTANT point (unsure if someone posted it): TALK TO YOUR VET! Get your cat vaccinated! Your vet might suggest a Tricat Vaccine AND a rabies vaccine. These have to be administered on a yearly basis. ALSO deworm your cat with medicine every 3 months. AND **STERELIZE** your cat! Talk to your vet and get him to discuss when you should do it. In heat your cat will be a nuisance to you and your house PLUS it's very frustrating for cats when their sexual needs aren't satisfied! Milk can cause an upset stomach depending on the cat. Yes most cats are lactose intolerant, but there are some which are tolerant as well. My cat doesn't drink enough water, which caused him serious bladder stones and complete urinary blockage. He loves milk, now from the past year, he's been getting only wet food with water and milk two times a day. Never had an upset stomach. I want a cat Try kitten Biryani 🗿 Sell him You need to let him view the outside through the windows. Cats love that. Neutered male cats cat get a huge growth spurt actually. I have one which is less that a year old and weighs 6kgs Only trim like milimeters of nails if the floor is marble tiles or something of smooth-hard surface. If you see nails being reddish, its often because natural (over)grown nails creates a reactive force backwards when cats jump and causes internal bleeding. I would say internal bleeding is worse result. I used to trim in very little bits every week and the reddishness stopped. Whats more my cats have learned to bite their nails when big, along with rubbing their eyes to clean rheum so I don't have to worry anymore. You do not want them to lick and consume such man made chemicals bruh. This is one of those rare case where a wet towel should be used to clean them Just give them curd,yakult or milk fermented with lactobacillus probiotics powders. If the milk has fermented then most of resultant products are digestible for any mammal. only if strangers. my cats tumble all the time so that I may scratch their stomach I was gonna write the same. Considering Royal canin is some 85rs a piece for 85g with even less chicken content. There is a whole fiasco with wordings in petfood industry. Something \"with real chicken\" means just 25% chicken, something labelled just chicken or fish imply its just 3%, that too cheaper non-veg matter like liver. Compared to that normal meat from butcher shop is far far far cost effective. Along with liver and heart bits, you may also go for skin and gizzard pieces. Boneless fish is also good. For chicken I boil extra long such that the bone pieces fully softens up and not pose a hazard. One thing that the above options can't provide is Taurine, so feeding a packed food once a week is useful. I go for Sheba's pumpkin chicken for the Taurine and the pumpkin enzymes. Also a mix of Samolac enzymes and probiotic powders to fill any other gap. Regarding dry food it depends on how much your cats drink water. Most house cats raised from kittens at home will drink good amount of water. One my cat only eats wet, another only eats dry but they consume water accordingly. Another cat was drinking too much water and his poop was always loose, puke too. I had to make him eat a bit of dry food to normalise his stool. u/thejokeyjokerson Toy 2 is really trash I had it. Its cheap bamboo stick with barely connected string and hazardous plastic wool filled toy doll at the end. My cat bit on the sticks enough to potrude out some pointy sharp chips. All the ones below are good teasers I felt in different ways to keep cats engaged: u/thejokeyjokerson OP hear this out, Mars and Nestle has massive duopoly in pet industry and all their products are massproduced, repurposed reject meats and copius amount of undigestable grains. Its in these conglomerates' interest that pet cats(and dogs) develop hepatic and renal problems from undigestable things in their food(and from other bad diets), at which the point the same companies will sell hepatic/renal vet food for \"ageing\" pets; selling a solution to a problem the same companies contributed to. Pedigree also by Mars as Whiskas, Sheba, RC are, had SEVEN major global recalls in TEN years. RC had 4 which is also bad. Farmina/Matisse is equally bad. Their lamb mouse has 20% chicken, 5% lamb, rest all grains. I have lost hope in packed petfood industry especially on the wetfood department. On the dryfood luckily these days Orijen, Taste of the Wild, Acana, arden-grange are available in India. Better to buy boneless chicken and fish and serve boiled. Add in eggs, liver, enzymes and probiotics. Its far economical and far more nutritious. Grain-free foods aren't necessarily safe either. The cornmeal replacement/substitute some companies use have shown to cause other different issues and all those substitutes are not regulated yet, just initial studies to warn of safety. You are protein too, yummm bro then he needs to be barred from going to that place but the reality is that they clean themselves and always smell very fresh like our hair does when we have just shampooed it with a smell less shampoo Now I get it, I clean my commander’s litter box twice a day. Their website is back up now in case you want to check the tag out. Thank you so much :) ordered few items. ❤️ Very cute >Instead trained both the Cats to pee & shit next to the drain in the bathroom. May I ask how? When I bought my Persian Cat as a Kitten, she was litter trained. The trick is that you've to take your Kitten or newly adopted Cat to the bathroom & place her right above the bathroom drain hole. They realise & recognize the smell somehow & pee/shit there. When I got my adopted Indie kitten after a year, I did this & she instantly started to use the bathroom for such deeds. They're so hellbent on using the bathroom that if it's occupied at the time they want to use it, they patiently wait outside the door till it opens."
}