{
    "id": "1d6cu70",
    "title": "Hindu Muslim Marriage not allowed by MP high court",
    "url": "https://m.thewire.in/article/law/hindu-muslim-marriage-invalid-under-muslim-personal-law-madhya-pradesh-hc/amp",
    "selftext": "Fam.\n\nThis is actually ridiculous 🤦🏾‍♂️…\n\nIf the letter of the law currently cannot accept interfaith marriage; then it’s imperative we change the letter of the law.\n\nApparently even the Special Marriage Act wouldnt be considered valid…\n\n(Not shooting shots but according to this SRK and Gauri’s marriage wouldn’t be legally valid? Or irregular as the article calls it…)\n\nI understand that marriage equality for all will take time to be enshrined by law. We still have backwards laws where apparently rape can only be committed by a man and marital rape isn’t even recognized making LGBT marriage hard to recognize legally because so many other laws would have to change.\n\nBut interfaith marriages still have issues? Are you for real?",
    "flair": "Law & Courts",
    "score": 165,
    "num_comments": 49,
    "created_utc": 1717333369.0,
    "convurl": "https://external-preview.redd.it/RPm5Xcruh2Hwzg2ndib0iL3LxD_klCOSYL0Y_oOIxiE.jpg?auto=webp&s=ff52efb44722bccc48f75131a577b245c091f960",
    "comments": [
        "Different marriage law for different religion..!  A muslim guy can marry a 15 year old, but a hindu girl can't be married before 18.  Then How can a muslim marry a minor hindu?      Things can only sorted out if we introduce UCC",
        "Politicians need to be young and educated, not these 70 80 year olds. More importantly, people need to be educated about individual rights because not many really give a shit about those.",
        "As much as I hate religion politics:\n\n>As per Mahomedan law, the marriage of a Muslim boy with a girl who is an idolatress or a fire-worshiper, is not a valid marriage. Even if the marriage is registered under the Special Marriage Act, the marriage would be no more a valid marriage and it would be an irregular (fasid) marriage.” Justice Gurpal Singh Ahluwalia stated\n\nThe correct solution here is for the girl to convert to Islam. M no one is stopping her.",
        "It’s not the court that isn’t allowing the marriage. Under Muslim law an inter-religion marriage is not considered valid and the same has been interpreted by the court. When personal law exists then that shall take preference over the other religion-neutral law.",
        "The correct solution is to bring UCC.\nWhy does anyone need to change his or her religion for the sole purpose of marriage.",
        "Why we even have a Muslim law is beyond me",
        "And the irony is that Muslim Law is only for CIVIL issues, if it's theft or murder, its normal Indian Law. 😂",
        "> muslim guy can marry a 15 year old.\n\nwtf",
        "Another correct solution is that the guy can also convert, just saying.",
        "Isn't the existence of Muslim Law itself prejudicial?",
        "No one is stopping the boy to renounce the relegion too",
        "No , the correct solution is to throw out religion when people are loving each other and want to fucking stay together for life.\n\nNeither last name , neither caste , nor religion should matter in that context then.",
        "Personal laws are available. Similar civil laws exist for Hindus as well.",
        "Then why is it illegal for me if I have four wives?",
        "But interfaith couples exist in India. How did they get married?",
        "It is permitted by their personal laws. But Hindu laws prohibit having more than one spouse, whether for man or woman.",
        "It’s not that interfaith couples can’t get married. It’s just that the marriage is not going to be considered valid under Muslim laws, even though special marriage act exists.",
        "If it's illegal for me as an Indian citizen then it should be illegal for a Muslim citizen as well. If not then this is outright prejudice.",
        "I agree. There’s a need to implement UCC but again, that’s easier said than done to implement.",
        "Yeah its fucked up..!",
        "Well.... Anurag Thakur, Tejasvi Surya, etc are \"young and educated\"",
        "Prajwal too i assume",
        "What if she doesn't believe in jinn/genies? Or any other anti-scientific statement? See: https://wikiislam.net/wiki/Scientific_Errors_in_the_Quran\n\nOr support Islamic sex slavery? (See: https://wikiislam.net/wiki/Slavery_in_Islamic_Law)",
        "My doubt is why does Special Marriage Act exist? What's it's purpose if it can't protect marriage between inter religious faith ? \n\nIt's doubtful that no Muslims Hindu ever married under this act. If so are they invalid now? Why is the problem coming up now?",
        "Then what's the purpose of Special Marriage act?",
        "I think I wasn’t clear. So basically what they’re saying is, what is invalid under the Muslim law cannot be made legal by the special marriage act. Since Muslim law doesn’t recognise interfaith marriage, the same cannot be considered valid under the special marriage act. \n\nAnyone can be married under the special marriage act, regardless of religion. Even two people belonging to the same religion can choose to be married under the special marriage act. It’s not that the act is useless, it’s a very relevant and valid act. The conflict in this case is with the general law and the Mohammedan Law. \n\nHowever, the court’s interpretation in this case is that, if a marriage falls within something called degree of prohibited relationship, meaning if the marriage between the two people is prohibited by  their personal laws, then such marriage cannot be made valid  under the special marriage act also. \n\nFrom a legal perspective, this case has a lot to do with the actual interpretation of the law and how personal laws and general laws operate when they conflict with each other.",
        "Even if this is true, what does this have anything to do with this case?",
        "Sanghi judges.",
        "But is that so ? I'm assuming this kind of Muslim Hindu marriage isn't first . \n\nI thought Special Marriage act trumps all other personal laws. May have to look up laws.",
        "How is this related to being Sanghi judges?",
        "No general law prevails over a special act, be it in this or any other sphere of law. \nBut you are right, this isn’t the first Hindu Muslim marriage, it’s just that this may be the first time such an interpretation has been drawn by the courts, leading to the controversy.",
        "Bring UCC.\n\nCtrl+f Husband ctrl+r Spouse\n\nCtrl+f Wife Ctrl+r Spouse.",
        "Anyone who wants to marry a 15 year old kid should have their dick shot off with a sawed off shotgun.",
        "i agree, and that aint bait.",
        "The guy is a muslim. They probably have problem with that fact. That’s how patriarchal minds think. In their heads they are probably preventing the girl from being stolen by the other side.",
        "Nothing related to this case, but I am giving an example..!",
        "But they have punchable faces as well",
        "I think, the catch is that a Muslim Man cannot marry a Hindu woman. Which is, as said, prohibited under Muslim personal law. Hence, special marriage act does not stand in this case. \n\nI think this is a very stupid way to implement laws. However, what do I know. I am not an old person to have wisdom of experience like the people ruling and running this country.",
        "Setting narrative for UCC. Here comes 3rd term",
        "Well women don't have a dick",
        "I don't think that's how a patriarchal mindset works",
        "TIL Aaryan Khan is illegitimate child of SRK since Gauri didn't accepted Islam. No wonder Bhai haven't married yet.",
        "The petitioners had said in their plea that despite being in love with each other, their marriage couldn’t be registered under the Special Marriage Act as they couldn’t appear before the Marriage Officer owing to **objections raised by their family.**\n\nThe highlighted part of law should be changed. Anyone should be allowed to have a court marriage.",
        "He can get prosecuted under the pocso act. Hence, you are wrong",
        "Bro i am just giving and example, i am no expert in law..!  Thanks for the fact..!",
        "Op🤡 Its like you didn’t even read the article. The bar on marriage is set by Muslim Personal Law and not Indian Law.",
        "Yeah it’s Islamophobia but also patriarchy. If the girl was a Muslim and the guy a Hindu, this wouldn’t have been a problem.",
        "It’s like you didn’t even read my post 🤡 \n\n“If the letter of the law currently cannot accept interfaith marriage; then it’s imperative we change the letter of the law.”"
    ],
    "cleaned_text": "hindu muslim marriage allowed mp high court fam actually ridiculous letter law currently accept interfaith marriage imperative change letter law apparently even special marriage act wouldnt considered valid shooting shots according srk gauris marriage wouldnt legally valid irregular article calls understand marriage equality take time enshrined law still backwards laws apparently rape committed man marital rape isnt even recognized making lgbt marriage hard recognize legally many laws would change interfaith marriages still issues real ",
    "cleaned_title": "hindu muslim marriage allowed mp high court",
    "cleaned_selftext": "fam actually ridiculous letter law currently accept interfaith marriage imperative change letter law apparently even special marriage act wouldnt considered valid shooting shots according srk gauris marriage wouldnt legally valid irregular article calls understand marriage equality take time enshrined law still backwards laws apparently rape committed man marital rape isnt even recognized making lgbt marriage hard recognize legally many laws would change interfaith marriages still issues real",
    "cleaned_comments": "different marriage law different religion muslim guy marry year old hindu girl cant married muslim marry minor hindu things sorted introduce ucc politicians need young educated year olds importantly people need educated individual rights many really give shit much hate religion politics per mahomedan law marriage muslim boy girl idolatress fireworshiper valid marriage even marriage registered special marriage act marriage would valid marriage would irregular fasid marriage justice gurpal singh ahluwalia stated correct solution girl convert islam one stopping court isnt allowing marriage muslim law interreligion marriage considered valid interpreted court personal law exists shall take preference religionneutral law correct solution bring ucc anyone need change religion sole purpose marriage even muslim law beyond irony muslim law civil issues theft murder normal indian law muslim guy marry year old wtf another correct solution guy also convert saying isnt existence muslim law prejudicial one stopping boy renounce relegion correct solution throw religion people loving want fucking stay together life neither last name neither caste religion matter context personal laws available similar civil laws exist hindus well illegal four wives interfaith couples exist india get married permitted personal laws hindu laws prohibit one spouse whether man woman interfaith couples cant get married marriage going considered valid muslim laws even though special marriage act exists illegal indian citizen illegal muslim citizen well outright prejudice agree theres need implement ucc thats easier said done implement yeah fucked well anurag thakur tejasvi surya etc young educated prajwal assume doesnt believe jinngenies antiscientific statement see support islamic sex slavery see doubt special marriage act exist whats purpose cant protect marriage inter religious faith doubtful muslims hindu ever married act invalid problem coming whats purpose special marriage act think wasnt clear basically theyre saying invalid muslim law made legal special marriage act since muslim law doesnt recognise interfaith marriage considered valid special marriage act anyone married special marriage act regardless religion even two people belonging religion choose married special marriage act act useless relevant valid act conflict case general law mohammedan law however courts interpretation case marriage falls within something called degree prohibited relationship meaning marriage two people prohibited personal laws marriage made valid special marriage act also legal perspective case lot actual interpretation law personal laws general laws operate conflict even true anything case sanghi judges im assuming kind muslim hindu marriage isnt first thought special marriage act trumps personal laws may look laws related sanghi judges general law prevails special act sphere law right isnt first hindu muslim marriage may first time interpretation drawn courts leading controversy bring ucc ctrlf husband ctrlr spouse ctrlf wife ctrlr spouse anyone wants marry year old kid dick shot sawed shotgun agree aint bait guy muslim probably problem fact thats patriarchal minds think heads probably preventing girl stolen side nothing related case giving example punchable faces well think catch muslim man marry hindu woman said prohibited muslim personal law hence special marriage act stand case think stupid way implement laws however know old person wisdom experience like people ruling running country setting narrative ucc comes rd term well women dont dick dont think thats patriarchal mindset works til aaryan khan illegitimate child srk since gauri didnt accepted islam wonder bhai havent married yet petitioners said plea despite love marriage couldnt registered special marriage act couldnt appear marriage officer owing objections raised family highlighted part law changed anyone allowed court marriage get prosecuted pocso act hence wrong bro giving example expert law thanks fact op like didnt even read article bar marriage set muslim personal law indian law yeah islamophobia also patriarchy girl muslim guy hindu wouldnt problem like didnt even read post letter law currently accept interfaith marriage imperative change letter law",
    "light_cleaned_title": "Hindu Muslim Marriage not allowed by MP high court",
    "light_cleaned_selftext": "Fam. This is actually ridiculous 🤦🏾‍♂️… If the letter of the law currently cannot accept interfaith marriage; then it’s imperative we change the letter of the law. Apparently even the Special Marriage Act wouldnt be considered valid… (Not shooting shots but according to this SRK and Gauri’s marriage wouldn’t be legally valid? Or irregular as the article calls it…) I understand that marriage equality for all will take time to be enshrined by law. We still have backwards laws where apparently rape can only be committed by a man and marital rape isn’t even recognized making LGBT marriage hard to recognize legally because so many other laws would have to change. But interfaith marriages still have issues? Are you for real?",
    "light_cleaned_comments": "Different marriage law for different religion..! A muslim guy can marry a 15 year old, but a hindu girl can't be married before 18. Then How can a muslim marry a minor hindu? Things can only sorted out if we introduce UCC Politicians need to be young and educated, not these 70 80 year olds. More importantly, people need to be educated about individual rights because not many really give a shit about those. As much as I hate religion politics: >As per Mahomedan law, the marriage of a Muslim boy with a girl who is an idolatress or a fire-worshiper, is not a valid marriage. Even if the marriage is registered under the Special Marriage Act, the marriage would be no more a valid marriage and it would be an irregular (fasid) marriage.” Justice Gurpal Singh Ahluwalia stated The correct solution here is for the girl to convert to Islam. M no one is stopping her. It’s not the court that isn’t allowing the marriage. Under Muslim law an inter-religion marriage is not considered valid and the same has been interpreted by the court. When personal law exists then that shall take preference over the other religion-neutral law. The correct solution is to bring UCC. Why does anyone need to change his or her religion for the sole purpose of marriage. Why we even have a Muslim law is beyond me And the irony is that Muslim Law is only for CIVIL issues, if it's theft or murder, its normal Indian Law. 😂 > muslim guy can marry a 15 year old. wtf Another correct solution is that the guy can also convert, just saying. Isn't the existence of Muslim Law itself prejudicial? No one is stopping the boy to renounce the relegion too No , the correct solution is to throw out religion when people are loving each other and want to fucking stay together for life. Neither last name , neither caste , nor religion should matter in that context then. Personal laws are available. Similar civil laws exist for Hindus as well. Then why is it illegal for me if I have four wives? But interfaith couples exist in India. How did they get married? It is permitted by their personal laws. But Hindu laws prohibit having more than one spouse, whether for man or woman. It’s not that interfaith couples can’t get married. It’s just that the marriage is not going to be considered valid under Muslim laws, even though special marriage act exists. If it's illegal for me as an Indian citizen then it should be illegal for a Muslim citizen as well. If not then this is outright prejudice. I agree. There’s a need to implement UCC but again, that’s easier said than done to implement. Yeah its fucked up..! Well.... Anurag Thakur, Tejasvi Surya, etc are \"young and educated\" Prajwal too i assume What if she doesn't believe in jinn/genies? Or any other anti-scientific statement? See: Or support Islamic sex slavery? (See: My doubt is why does Special Marriage Act exist? What's it's purpose if it can't protect marriage between inter religious faith ? It's doubtful that no Muslims Hindu ever married under this act. If so are they invalid now? Why is the problem coming up now? Then what's the purpose of Special Marriage act? I think I wasn’t clear. So basically what they’re saying is, what is invalid under the Muslim law cannot be made legal by the special marriage act. Since Muslim law doesn’t recognise interfaith marriage, the same cannot be considered valid under the special marriage act. Anyone can be married under the special marriage act, regardless of religion. Even two people belonging to the same religion can choose to be married under the special marriage act. It’s not that the act is useless, it’s a very relevant and valid act. The conflict in this case is with the general law and the Mohammedan Law. However, the court’s interpretation in this case is that, if a marriage falls within something called degree of prohibited relationship, meaning if the marriage between the two people is prohibited by their personal laws, then such marriage cannot be made valid under the special marriage act also. From a legal perspective, this case has a lot to do with the actual interpretation of the law and how personal laws and general laws operate when they conflict with each other. Even if this is true, what does this have anything to do with this case? Sanghi judges. But is that so ? I'm assuming this kind of Muslim Hindu marriage isn't first . I thought Special Marriage act trumps all other personal laws. May have to look up laws. How is this related to being Sanghi judges? No general law prevails over a special act, be it in this or any other sphere of law. But you are right, this isn’t the first Hindu Muslim marriage, it’s just that this may be the first time such an interpretation has been drawn by the courts, leading to the controversy. Bring UCC. Ctrl+f Husband ctrl+r Spouse Ctrl+f Wife Ctrl+r Spouse. Anyone who wants to marry a 15 year old kid should have their dick shot off with a sawed off shotgun. i agree, and that aint bait. The guy is a muslim. They probably have problem with that fact. That’s how patriarchal minds think. In their heads they are probably preventing the girl from being stolen by the other side. Nothing related to this case, but I am giving an example..! But they have punchable faces as well I think, the catch is that a Muslim Man cannot marry a Hindu woman. Which is, as said, prohibited under Muslim personal law. Hence, special marriage act does not stand in this case. I think this is a very stupid way to implement laws. However, what do I know. I am not an old person to have wisdom of experience like the people ruling and running this country. Setting narrative for UCC. Here comes 3rd term Well women don't have a dick I don't think that's how a patriarchal mindset works TIL Aaryan Khan is illegitimate child of SRK since Gauri didn't accepted Islam. No wonder Bhai haven't married yet. The petitioners had said in their plea that despite being in love with each other, their marriage couldn’t be registered under the Special Marriage Act as they couldn’t appear before the Marriage Officer owing to **objections raised by their family.** The highlighted part of law should be changed. Anyone should be allowed to have a court marriage. He can get prosecuted under the pocso act. Hence, you are wrong Bro i am just giving and example, i am no expert in law..! Thanks for the fact..! Op🤡 Its like you didn’t even read the article. The bar on marriage is set by Muslim Personal Law and not Indian Law. Yeah it’s Islamophobia but also patriarchy. If the girl was a Muslim and the guy a Hindu, this wouldn’t have been a problem. It’s like you didn’t even read my post 🤡 “If the letter of the law currently cannot accept interfaith marriage; then it’s imperative we change the letter of the law.”"
}