{
    "id": "168qcg6",
    "title": "Should India reconsider it's gun law? What's your opinion?",
    "url": "https://www.reddit.com/r/india/comments/168qcg6/should_india_reconsider_its_gun_law_whats_your/",
    "selftext": "In India you can't easily own a gun and even If you own a gun you can't just shoot an intruder to death . If you do, then our great justice system will ruin your life. There have been cases where intruders enter a house, loot them and rape the women because they outnumbered the family members !\n\n**Think of it- you peacefully living with you family, suddenly 5-6 unarmed robbers try to break into your house. What are you supposed to do? Fist fight? Even the unarmed robbers can do anything as they outnumbers you.**\n\nThe police can't protect it's civilians, constitution takes ages ton punish the criminals and you are supposed to follow non violence and watch your home getting robbed and your women being abused! Even if the system serves justice, can it \"undo\" the loss/damage done to a family? Can it revive the dead who has been killed by robbers?\n\nMy opinion is- India must relax it's strict gun laws and require the owners to have CCTV footage as proof of intrusion if they decide to shoot. Now many of us may object saying- the police can kill anyone and just blame him of pulling out a gun. **But in that case government must equip every cop with go pro, as the US did. And, No- the easy access to gun is not the cause of mass shooting. Countries like Sweden, Finland, Serbia, Norway do not have strict gun laws and have very rare incidents of mass shooting.**\n\n**Take a look at what this so called Non violence has done this family. Can the government undo this horror?**\n\n[https://timesofindia.indiatimes.com/city/bareilly/robbers-enter-traders-house-rape-wife-minor-in-ups-rampur/articleshow/100405403.cms?from=mdr](https://timesofindia.indiatimes.com/city/bareilly/robbers-enter-traders-house-rape-wife-minor-in-ups-rampur/articleshow/100405403.cms?from=mdr)",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 11,
    "created_utc": 1693725359,
    "convurl": "https://external-preview.redd.it/etkjIcQvJzDInTTwtIYE35D2P9N1qBkOBnczf1P_B0M.jpg?auto=webp&amp;s=d0bfd251fd6c5aa82b29151e2241b9305fb81834",
    "comments": [
        "jaisa chal reha hai waisa chalne dein",
        "India should reconsider its entire criminal justice system tbh",
        "Gun law he iske liye mass shooting nai hoti varna harroz koi na koi goli khata, Hindu vs Muslim situation is not in favour of relaxed gun laws specially",
        "Lol. Just, Lol. People like this should be bought a general class ticket across India and sent on a 3 month trip so that they may have an idea of how detached from reality they are.",
        "> Think of it- you peacefully living with you family, suddenly 5-6 unarmed robbers try to break into your house. What are you supposed to do? Fist fight? Even the unarmed robbers can do anything as they outnumbers you.\n\nWannabe 'Muricans are amazing. But nothing tops the “good guy with a gun” fantasy. I wonder how many people believe they can actually get into a shoot-out with criminals, even in the land of guns and freedom fries.\n\n> In fact, research has shown that gun-toting independence unleashes much more chaos and carnage than heroism. A 2017 National Bureau of Economic Research study revealed that right-to-carry laws increase, rather than decrease, violent crime. Higher rates of gun ownership is correlated with higher homicide rates. Gun possession is correlated with increased road rage.\n\n[How the ‘good guy with a gun’ became a deadly American fantasy | PBS NewsHour](https://www.pbs.org/newshour/nation/how-the-good-guy-with-a-gun-became-a-deadly-american-fantasy)",
        ">**Countries like Sweden, Finland, Serbia, Norway do not have strict gun laws and have very rare incidents of mass shooting.** \n\nIncorrect. In countries such as Sweden, Finland, Serbia, and Norway, gun laws are strict. Guns cannot be obtained for self-defense or personal protection. Ordinary citizens can only own guns for hunting or competitive sports, and even then, they must pass rigorous background checks, drug tests, complete a year-long hunter training program, and pass a written and shooting test. If you have even a minor case against you, you will not be able to obtain a gun. Convicted of a felony? No guns for you. Have a history of domestic violence? No guns. Subject to a restraining order? No guns. Even if you have driven drunk, you will not be able to obtain a gun.\n\nIn contrast, in the United States, almost anyone can obtain a gun for personal safety. Despite this, the US has the highest overall rate of death from firearms compared to 13 other high-income countries — nearly five times that of France, the nation with the second-highest rate. Therefore, owning a gun does not necessarily equate to less crime. Strong and reliable law enforcement and an educated citizenry are more effective in reducing crime.\n\nAs per your statement, India has strict laws regarding gun ownership, yet it still sees the third-highest number of firearm-related deaths in the world (2016 survey). So, before considering relaxing gun laws, it is important to first address issues within the existing legal system, judicial system, and law enforcement agencies.\n\n[https://www.vox.com/2016/8/8/12351824/gun-control-sweden-solution](https://www.vox.com/2016/8/8/12351824/gun-control-sweden-solution)\n\n[https://planetnorway.com/gun-ownersip/](https://planetnorway.com/gun-ownersip/)\n\n[https://en.wikipedia.org/wiki/Firearms\\_regulation\\_in\\_Finland](https://en.wikipedia.org/wiki/Firearms_regulation_in_Finland)\n\n[https://www.commonwealthfund.org/publications/2023/apr/health-costs-gun-violence-how-us-compares-other-countries](https://www.commonwealthfund.org/publications/2023/apr/health-costs-gun-violence-how-us-compares-other-countries)\n\n[https://theweek.com/gun-violence/1023213/why-are-mass-shootings-rare-in-other-countries-despite-high-levels-of-gun](https://theweek.com/gun-violence/1023213/why-are-mass-shootings-rare-in-other-countries-despite-high-levels-of-gun)\n\n[https://en.wikipedia.org/wiki/Overview\\_of\\_gun\\_laws\\_by\\_nation](https://en.wikipedia.org/wiki/Overview_of_gun_laws_by_nation)\n\n[India sees the third-highest firearm-related deaths in the world (theprint.in)](https://theprint.in/india/india-sees-the-third-highest-firearm-related-deaths-in-the-world/274576/)",
        "Lol . Found a  wanna be American"
    ],
    "cleaned_text": "india reconsider gun law whats opinion india cant easily gun even gun cant shoot intruder death great justice system ruin life cases intruders enter house loot rape women outnumbered family members think peacefully living family suddenly unarmed robbers try break house supposed fist fight even unarmed robbers anything outnumbers police cant protect civilians constitution takes ages ton punish criminals supposed follow non violence watch home getting robbed women abused even system serves justice undo lossdamage done family revive dead killed robbers opinion india must relax strict gun laws require owners cctv footage proof intrusion decide shoot many us may object saying police kill anyone blame pulling gun case government must equip every cop go pro us easy access gun cause mass shooting countries like sweden finland serbia norway strict gun laws rare incidents mass shooting take look called non violence done family government undo horror httpstimesofindiaindiatimescomcitybareillyrobbersentertradershouserapewifeminorinupsrampurarticleshowcmsfrommdrhttpstimesofindiaindiatimescomcitybareillyrobbersentertradershouserapewifeminorinupsrampurarticleshowcmsfrommdr ",
    "cleaned_title": "india reconsider gun law whats opinion",
    "cleaned_selftext": "india cant easily gun even gun cant shoot intruder death great justice system ruin life cases intruders enter house loot rape women outnumbered family members think peacefully living family suddenly unarmed robbers try break house supposed fist fight even unarmed robbers anything outnumbers police cant protect civilians constitution takes ages ton punish criminals supposed follow non violence watch home getting robbed women abused even system serves justice undo lossdamage done family revive dead killed robbers opinion india must relax strict gun laws require owners cctv footage proof intrusion decide shoot many us may object saying police kill anyone blame pulling gun case government must equip every cop go pro us easy access gun cause mass shooting countries like sweden finland serbia norway strict gun laws rare incidents mass shooting take look called non violence done family government undo horror httpstimesofindiaindiatimescomcitybareillyrobbersentertradershouserapewifeminorinupsrampurarticleshowcmsfrommdrhttpstimesofindiaindiatimescomcitybareillyrobbersentertradershouserapewifeminorinupsrampurarticleshowcmsfrommdr",
    "cleaned_comments": "jaisa chal reha hai waisa chalne dein india reconsider entire criminal justice system tbh gun law iske liye mass shooting nai hoti varna harroz koi na koi goli khata hindu vs muslim situation favour relaxed gun laws specially lol lol people like bought general class ticket across india sent month trip may idea detached reality think peacefully living family suddenly unarmed robbers try break house supposed fist fight even unarmed robbers anything outnumbers wannabe muricans amazing nothing tops good guy gun fantasy wonder many people believe actually get shootout criminals even land guns freedom fries fact research shown guntoting independence unleashes much chaos carnage heroism national bureau economic research study revealed righttocarry laws increase rather decrease violent crime higher rates gun ownership correlated higher homicide rates gun possession correlated increased road rage good guy gun became deadly american fantasy pbs newshourhttpswwwpbsorgnewshournationhowthegoodguywithagunbecameadeadlyamericanfantasy countries like sweden finland serbia norway strict gun laws rare incidents mass shooting incorrect countries sweden finland serbia norway gun laws strict guns obtained selfdefense personal protection ordinary citizens guns hunting competitive sports even must pass rigorous background checks drug tests complete yearlong hunter training program pass written shooting test even minor case able obtain gun convicted felony guns history domestic violence guns subject restraining order guns even driven drunk able obtain gun contrast united states almost anyone obtain gun personal safety despite us highest overall rate death firearms compared highincome countries nearly five times france nation secondhighest rate therefore owning gun necessarily equate less crime strong reliable law enforcement educated citizenry effective reducing crime per statement india strict laws regarding gun ownership yet still sees thirdhighest number firearmrelated deaths world survey considering relaxing gun laws important first address issues within existing legal system judicial system law enforcement agencies httpswwwvoxcomguncontrolswedensolutionhttpswwwvoxcomguncontrolswedensolution httpsplanetnorwaycomgunownersiphttpsplanetnorwaycomgunownersip httpsenwikipediaorgwikifirearmsregulationinfinlandhttpsenwikipediaorgwikifirearmsregulationinfinland httpswwwcommonwealthfundorgpublicationsaprhealthcostsgunviolencehowuscomparesothercountrieshttpswwwcommonwealthfundorgpublicationsaprhealthcostsgunviolencehowuscomparesothercountries httpstheweekcomgunviolencewhyaremassshootingsrareinothercountriesdespitehighlevelsofgunhttpstheweekcomgunviolencewhyaremassshootingsrareinothercountriesdespitehighlevelsofgun httpsenwikipediaorgwikioverviewofgunlawsbynationhttpsenwikipediaorgwikioverviewofgunlawsbynation india sees thirdhighest firearmrelated deaths world theprintinhttpstheprintinindiaindiaseesthethirdhighestfirearmrelateddeathsintheworld lol found wan na american",
    "light_cleaned_title": "Should India reconsider it's gun law? What's your opinion?",
    "light_cleaned_selftext": "In India you can't easily own a gun and even If you own a gun you can't just shoot an intruder to death . If you do, then our great justice system will ruin your life. There have been cases where intruders enter a house, loot them and rape the women because they outnumbered the family members ! **Think of it- you peacefully living with you family, suddenly 5-6 unarmed robbers try to break into your house. What are you supposed to do? Fist fight? Even the unarmed robbers can do anything as they outnumbers you.** The police can't protect it's civilians, constitution takes ages ton punish the criminals and you are supposed to follow non violence and watch your home getting robbed and your women being abused! Even if the system serves justice, can it \"undo\" the loss/damage done to a family? Can it revive the dead who has been killed by robbers? My opinion is- India must relax it's strict gun laws and require the owners to have CCTV footage as proof of intrusion if they decide to shoot. Now many of us may object saying- the police can kill anyone and just blame him of pulling out a gun. **But in that case government must equip every cop with go pro, as the US did. And, No- the easy access to gun is not the cause of mass shooting. Countries like Sweden, Finland, Serbia, Norway do not have strict gun laws and have very rare incidents of mass shooting.** **Take a look at what this so called Non violence has done this family. Can the government undo this horror?** [https://timesofindia.indiatimes.com/city/bareilly/robbers-enter-traders-house-rape-wife-minor-in-ups-rampur/articleshow/100405403.cms?from=mdr](https://timesofindia.indiatimes.com/city/bareilly/robbers-enter-traders-house-rape-wife-minor-in-ups-rampur/articleshow/100405403.cms?from=mdr)",
    "light_cleaned_comments": "jaisa chal reha hai waisa chalne dein India should reconsider its entire criminal justice system tbh Gun law he iske liye mass shooting nai hoti varna harroz koi na koi goli khata, Hindu vs Muslim situation is not in favour of relaxed gun laws specially Lol. Just, Lol. People like this should be bought a general class ticket across India and sent on a 3 month trip so that they may have an idea of how detached from reality they are. > Think of it- you peacefully living with you family, suddenly 5-6 unarmed robbers try to break into your house. What are you supposed to do? Fist fight? Even the unarmed robbers can do anything as they outnumbers you. Wannabe 'Muricans are amazing. But nothing tops the “good guy with a gun” fantasy. I wonder how many people believe they can actually get into a shoot-out with criminals, even in the land of guns and freedom fries. > In fact, research has shown that gun-toting independence unleashes much more chaos and carnage than heroism. A 2017 National Bureau of Economic Research study revealed that right-to-carry laws increase, rather than decrease, violent crime. Higher rates of gun ownership is correlated with higher homicide rates. Gun possession is correlated with increased road rage. [How the ‘good guy with a gun’ became a deadly American fantasy | PBS NewsHour](https://www.pbs.org/newshour/nation/how-the-good-guy-with-a-gun-became-a-deadly-american-fantasy) >**Countries like Sweden, Finland, Serbia, Norway do not have strict gun laws and have very rare incidents of mass shooting.** Incorrect. In countries such as Sweden, Finland, Serbia, and Norway, gun laws are strict. Guns cannot be obtained for self-defense or personal protection. Ordinary citizens can only own guns for hunting or competitive sports, and even then, they must pass rigorous background checks, drug tests, complete a year-long hunter training program, and pass a written and shooting test. If you have even a minor case against you, you will not be able to obtain a gun. Convicted of a felony? No guns for you. Have a history of domestic violence? No guns. Subject to a restraining order? No guns. Even if you have driven drunk, you will not be able to obtain a gun. In contrast, in the United States, almost anyone can obtain a gun for personal safety. Despite this, the US has the highest overall rate of death from firearms compared to 13 other high-income countries — nearly five times that of France, the nation with the second-highest rate. Therefore, owning a gun does not necessarily equate to less crime. Strong and reliable law enforcement and an educated citizenry are more effective in reducing crime. As per your statement, India has strict laws regarding gun ownership, yet it still sees the third-highest number of firearm-related deaths in the world (2016 survey). So, before considering relaxing gun laws, it is important to first address issues within the existing legal system, judicial system, and law enforcement agencies. [https://www.vox.com/2016/8/8/12351824/gun-control-sweden-solution](https://www.vox.com/2016/8/8/12351824/gun-control-sweden-solution) [https://planetnorway.com/gun-ownersip/](https://planetnorway.com/gun-ownersip/) [https://en.wikipedia.org/wiki/Firearms\\_regulation\\_in\\_Finland](https://en.wikipedia.org/wiki/Firearms_regulation_in_Finland) [https://www.commonwealthfund.org/publications/2023/apr/health-costs-gun-violence-how-us-compares-other-countries](https://www.commonwealthfund.org/publications/2023/apr/health-costs-gun-violence-how-us-compares-other-countries) [https://theweek.com/gun-violence/1023213/why-are-mass-shootings-rare-in-other-countries-despite-high-levels-of-gun](https://theweek.com/gun-violence/1023213/why-are-mass-shootings-rare-in-other-countries-despite-high-levels-of-gun) [https://en.wikipedia.org/wiki/Overview\\_of\\_gun\\_laws\\_by\\_nation](https://en.wikipedia.org/wiki/Overview_of_gun_laws_by_nation) [India sees the third-highest firearm-related deaths in the world (theprint.in)](https://theprint.in/india/india-sees-the-third-highest-firearm-related-deaths-in-the-world/274576/) Lol . Found a wanna be American"
}