{
    "id": "14nniax",
    "title": "Cannot link Kotak 811 account to any of the UPI apps",
    "url": "https://www.reddit.com/r/india/comments/14nniax/cannot_link_kotak_811_account_to_any_of_the_upi/",
    "selftext": "Hello r/India, I recently opened a new Kotak 811 savings accounts and fully completed my KYC. I didn't get my physical debit card but have access to the virtual debit card. I'm also able to transfer money into it from my primary account and even check my balance from the Kotak mobile app.\n\nMy only problem is I cannot link the account to any of the UPI apps Gpay, Phonepe, BHIM, Paytm. All of them refuse saying there's a technical issue and asks me to try again later. Its been a week and I've been trying daily. I enabled my card for online transactions but it just doesn't work.\n\nHere's a screenshot of my trying on Phonepe - [https://i.imgur.com/f9Tmc5Y.jpg](https://i.imgur.com/f9Tmc5Y.jpg)\n\nWhat do you think can be the reason? The first two days I thought it might a server issue at their end but I can transfer money through the Kotak iOS app to other contacts and beneficiaries. But UPI seems to be an issue.\n\nAny help will be appreciated. Thank you :)\n\nEdit: grammar",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1688192267.0,
    "convurl": "https://external-preview.redd.it/S68DwrE42Vn8MsHIvNYMbljGRnWxl5JAT89wvujbMEs.jpg?auto=webp&s=bc710b01fda70a5e42f6e7eb276a1dca0c592b9b",
    "comments": [
        "same issue for more than 2 months. any luck?",
        "Nope still facing the issue.",
        "is it working now?? i’m on the same road as you dude.",
        "No man still not working 🥲",
        "Have you tried to contact the customer care yet? Why would there be an issue with linking for this long unless we are missing something.",
        "It works now. Please try",
        "It worked after two weeks. Sorry I didn’t update here",
        "already did. on july 20th or something idk.\ni forgot to update here. 😅. i went with aadhaar flow that time...",
        "Are there any sms charges? It mentions ₹0.5/sms\n\nIs it for debit sms also?",
        "Ik I am a bit late here, happened with me as well. Took me over a month. But their UPI servers are a hassle. Had to close the account.",
        "Any updates?"
    ],
    "cleaned_text": "link kotak account upi apps hello rindia recently opened new kotak savings accounts fully completed kyc didnt get physical debit card access virtual debit card im also able transfer money primary account even check balance kotak mobile app problem link account upi apps gpay phonepe bhim paytm refuse saying theres technical issue asks try later week ive trying daily enabled card online transactions doesnt work heres screenshot trying phonepe httpsiimgurcomftmcyjpghttpsiimgurcomftmcyjpg think reason first two days thought might server issue end transfer money kotak ios app contacts beneficiaries upi seems issue help appreciated thank edit grammar ",
    "cleaned_title": "link kotak account upi apps",
    "cleaned_selftext": "hello rindia recently opened new kotak savings accounts fully completed kyc didnt get physical debit card access virtual debit card im also able transfer money primary account even check balance kotak mobile app problem link account upi apps gpay phonepe bhim paytm refuse saying theres technical issue asks try later week ive trying daily enabled card online transactions doesnt work heres screenshot trying phonepe httpsiimgurcomftmcyjpghttpsiimgurcomftmcyjpg think reason first two days thought might server issue end transfer money kotak ios app contacts beneficiaries upi seems issue help appreciated thank edit grammar",
    "cleaned_comments": "issue months luck nope still facing issue working im road dude man still working tried contact customer care yet would issue linking long unless missing something works please try worked two weeks sorry didnt update already july th something idk forgot update went aadhaar flow time sms charges mentions sms debit sms also ik bit late happened well took month upi servers hassle close account updates",
    "light_cleaned_title": "Cannot link Kotak 811 account to any of the UPI apps",
    "light_cleaned_selftext": "Hello r/India, I recently opened a new Kotak 811 savings accounts and fully completed my KYC. I didn't get my physical debit card but have access to the virtual debit card. I'm also able to transfer money into it from my primary account and even check my balance from the Kotak mobile app. My only problem is I cannot link the account to any of the UPI apps Gpay, Phonepe, BHIM, Paytm. All of them refuse saying there's a technical issue and asks me to try again later. Its been a week and I've been trying daily. I enabled my card for online transactions but it just doesn't work. Here's a screenshot of my trying on Phonepe - [https://i.imgur.com/f9Tmc5Y.jpg](https://i.imgur.com/f9Tmc5Y.jpg) What do you think can be the reason? The first two days I thought it might a server issue at their end but I can transfer money through the Kotak iOS app to other contacts and beneficiaries. But UPI seems to be an issue. Any help will be appreciated. Thank you :) Edit: grammar",
    "light_cleaned_comments": "same issue for more than 2 months. any luck? Nope still facing the issue. is it working now?? i’m on the same road as you dude. No man still not working 🥲 Have you tried to contact the customer care yet? Why would there be an issue with linking for this long unless we are missing something. It works now. Please try It worked after two weeks. Sorry I didn’t update here already did. on july 20th or something idk. i forgot to update here. 😅. i went with aadhaar flow that time... Are there any sms charges? It mentions ₹0.5/sms Is it for debit sms also? Ik I am a bit late here, happened with me as well. Took me over a month. But their UPI servers are a hassle. Had to close the account. Any updates?"
}