{
    "id": "14g1j8m",
    "title": "Adipurush Controversy",
    "url": "https://www.reddit.com/r/india/comments/14g1j8m/adipurush_controversy/",
    "selftext": "Adipurush makers are trying to make money off of Indians' devotion and love for Ramayan. It seems like they're doind controversies just to stay in news.\n\nHere's a video on Adipurush controversy. It explains everything from the start to end. \nPlease let me know if I can add anything to it.\n\nhttps://youtu.be/9NOa_EeF2wA",
    "flair": "Rant / Vent",
    "score": 2,
    "num_comments": 4,
    "created_utc": 1687435022.0,
    "convurl": "https://external-preview.redd.it/SC9W-xteZKyKY5vY2IYHyRRZAK71eLmDIGp69ehKwB4.jpg?auto=webp&v=enabled&s=5f9c2b52465ac295c7558f1cf4cbc48834b235fe",
    "comments": [
        "Cinema is mirror of the society, listen to her after 8:00 [https://www.youtube.com/watch?v=4Jnbh3OgzbA](https://www.youtube.com/watch?v=4Jnbh3OgzbA)",
        "My take? Do not watch it. As simple as that.",
        "Agreed! They're portraying it as if this is the ultimate Ramayan interpretation, with no realisation of the mistakes or faults in the movie."
    ],
    "cleaned_text": "adipurush controversy adipurush makers trying make money indians devotion love ramayan seems like theyre doind controversies stay news heres video adipurush controversy explains everything start end please let know add anything ",
    "cleaned_title": "adipurush controversy",
    "cleaned_selftext": "adipurush makers trying make money indians devotion love ramayan seems like theyre doind controversies stay news heres video adipurush controversy explains everything start end please let know add anything",
    "cleaned_comments": "cinema mirror society listen httpswwwyoutubecomwatchvjnbhogzbahttpswwwyoutubecomwatchvjnbhogzba take watch simple agreed theyre portraying ultimate ramayan interpretation realisation mistakes faults movie",
    "light_cleaned_title": "Adipurush Controversy",
    "light_cleaned_selftext": "Adipurush makers are trying to make money off of Indians' devotion and love for Ramayan. It seems like they're doind controversies just to stay in news. Here's a video on Adipurush controversy. It explains everything from the start to end. Please let me know if I can add anything to it.",
    "light_cleaned_comments": "Cinema is mirror of the society, listen to her after 8:00 [https://www.youtube.com/watch?v=4Jnbh3OgzbA](https://www.youtube.com/watch?v=4Jnbh3OgzbA) My take? Do not watch it. As simple as that. Agreed! They're portraying it as if this is the ultimate Ramayan interpretation, with no realisation of the mistakes or faults in the movie."
}