{
    "id": "15b1c5y",
    "title": "Oil firms, govt are earning well. But you may still have to pay high fuel prices",
    "url": "https://economictimes.indiatimes.com/industry/energy/oil-gas/oil-firms-govt-are-earning-well-but-you-may-still-have-to-pay-high-fuel-prices/articleshow/102160771.cms",
    "selftext": "Oil firms are earning 10 rupees per litre.Operating profit of Refiners to hit 1 lakh crore combined. Petrol still retails above 100 in multiple parts of the country. Yet the government won't drop taxes as there is no other revenue source for it. If they drop taxes the budget deficits will widen and it becomes apparent to everyone the much touted economy is not generating enough profits to pay higher taxes!",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690462955.0,
    "convurl": "https://external-preview.redd.it/UVQkclnjbdMzBciJFOhx4KMNm1hGRPRG4ZWbDtGpZBg.jpg?auto=webp&s=e5ef3f86e0a13645db345b095edec4893014b3e3",
    "comments": [],
    "cleaned_text": "oil firms govt earning well may still pay high fuel prices oil firms earning rupees per litreoperating profit refiners hit lakh crore combined petrol still retails multiple parts country yet government wont drop taxes revenue source drop taxes budget deficits widen becomes apparent everyone much touted economy generating enough profits pay higher taxes ",
    "cleaned_title": "oil firms govt earning well may still pay high fuel prices",
    "cleaned_selftext": "oil firms earning rupees per litreoperating profit refiners hit lakh crore combined petrol still retails multiple parts country yet government wont drop taxes revenue source drop taxes budget deficits widen becomes apparent everyone much touted economy generating enough profits pay higher taxes",
    "cleaned_comments": "",
    "light_cleaned_title": "Oil firms, govt are earning well. But you may still have to pay high fuel prices",
    "light_cleaned_selftext": "Oil firms are earning 10 rupees per litre.Operating profit of Refiners to hit 1 lakh crore combined. Petrol still retails above 100 in multiple parts of the country. Yet the government won't drop taxes as there is no other revenue source for it. If they drop taxes the budget deficits will widen and it becomes apparent to everyone the much touted economy is not generating enough profits to pay higher taxes!",
    "light_cleaned_comments": ""
}