{
    "id": "13gcqry",
    "title": "How the ISI milked defense secrets from a lonely DRDO scientist",
    "url": "https://www.reddit.com/r/india/comments/13gcqry/how_the_isi_milked_defense_secrets_from_a_lonely/",
    "selftext": "Apparently, the ISI had no need to blackmail the Indian scientist after honey-trapping him, as the dude was pretty keen on sharing secrets as long as the lady sent in nudes.\n\n[https://www.mid-day.com/mumbai/mumbai-news/article/maharashtra-how-isi-milked-secrets-from-smitten-scientist-23285611](https://www.mid-day.com/mumbai/mumbai-news/article/maharashtra-how-isi-milked-secrets-from-smitten-scientist-23285611)",
    "flair": "Crime",
    "score": 412,
    "num_comments": 100,
    "created_utc": 1683969967.0,
    "convurl": "https://external-preview.redd.it/Hlq0dyapFzAijkpk6BZ82r6y4nk_dM_4YcyNrr8N6F8.jpg?auto=webp&v=enabled&s=ee19107e2d930404d902992e10cb937b8089c950",
    "comments": [
        "The scientist is also an active RSS pracharak. Not that there's any relation or somethin' :3  [https://www.ndtv.com/india-news/cong-alleges-drdo-official-held-by-ats-in-maharashtra-is-rss-volunteer-4021958](https://www.ndtv.com/india-news/cong-alleges-drdo-official-held-by-ats-in-maharashtra-is-rss-volunteer-4021958)",
        "He wanted to do some SwayamSeva, that's why he was asking for Noods.",
        "New law:The standing PM has to regularly send noods to all single govt employees",
        "State designated noods letsgooo",
        "During Mon key baat",
        "Exclusively on onlyfans",
        "This news has been shared to death here, what's the point of posting it over and over again.",
        "Understandable, even Einstein had no clue that his lover was a Russian spy. A hole can change your goal, if it's a black hole you're lost.",
        "RSS. What do you expect from such weak willed men that seek solace from the mundane ?",
        "What do you want the single govt employees to do with PM's noods?",
        "So that they no longer care about those foreign honey bees",
        "PM's noods?",
        "\"Bob and vagen\" intensifies",
        "Call it aatma nirbharta. You should use officially licensed words you see?",
        "Or HM's personal preference",
        "We need some DRD-Hoes to keep our scientists happy.",
        "Why not call him horny instead of lonely?",
        "![gif](giphy|LnjFup0l3KycdM8teN|downsized)",
        "I don't understand how men's brains work. How do these guys, entrusted with classified information (for which you should be in a fairly good position, which comes as a result of your intelligence and efficiency) not recognize obvious spying? \"This girl sends me nudes in return for national secrets. Our relationship is transactional. There is no way this girl would use those secrets for money.\" Seriously? How stupid are the people in charge of running the world?",
        "They cast a wide net only few get caught out of them they pick the weakest ones that they can exploit I guess. Our agencies might also be trying the same thing probably. World of espionage, somehow extract info.",
        "For f***s sake do scientists  in this country not even make enough to afford an esscort ....how little are they being paid ?",
        "Simp",
        "No one in the country is as pretty and beautiful",
        "Premium subscription to Chaturbate for all drdo employees",
        "It’s more like she sent nudes and guy says something salacious. Then the blackmail happens. You share secrets or I will share our chats.",
        "Robin Williams famously said that men have two major organs and only one works at any given time. Guess PeePee overrides Command Centre but the reverse rarely happens.\n\nHe's not the first man to sacrifice his life in service of Dick. He's one of a long line of men -- why do you think men try to control women all the time? It's because they can barely control themselves.",
        "I'm sorry but this is all on Indian whores and prostitutes. I mean India is the largest market for prostitution what good is that we you cannot meet the needs of a fellow countryman, that too a DRDO scientists. The govt and activists are working day and night to secure a good future for them and they couldn't care for a lonely DRDO scientist? I think it's high time, Indian whores need to up their game. A good initiative would be connect them through \"Digital India\" program. Where each person has a horny radar and whenever that radar goes \"Red alert\" the prostitute should contact him/her and looks after him",
        "Truly pathetic",
        "About as stupid as you, to instantly think that the problem was his gender and not his iq",
        "Exactly this.\n\nAlso, while it is extremely easy to judge someone after the fact, people don’t realize how smooth these criminals/actors are at their job. The woman didn’t ask for state secrets the moment she met him, she made it happen slowly and organically. It is still a dumb thing to do, but people do dumb things, and acknowledging that it isn’t exactly rocket science (ahem!) to entrap people is the first step to teach people how to avoid this.",
        "Thousands of pornstars, billions of porn videos and even hookers all around and yet he sold country's secrets to the enemy for that woman's nude. Either she is next level hot or the guy is next level idiot",
        "The OG simp💀",
        "Guess it's a good thing that I'm not in charge of any defense secrets then.",
        "Operation \"Lun' ki baat\"",
        "Right? Booby trap has never happened before with anyone else?? If only your comment made any sense.",
        "And?",
        "Ummm lonely? Dude was married with kids. Let’s not excuse this behaviour. Creep is as creep does",
        "To stupid to realize he can just send money , rather than state secrets. Even more stupid not to realize he can just spend the money on a local esscort. \nEnjoy the prison, traitor. Should be given the death penalty  for putting the nation at risk.",
        "All for the defence of the nation, the esscort gotta do their parts.\nHonestly if this keeps people from leaking state secrets, esscort services should be legalized and should be a tax write off.",
        "Wait a minute. He traded defence secrets just for nudes? WTF?",
        "So one person did something stupid and you immediately decide to blame an entire gender.      \nnice. /s",
        "Don't they swear celibacy? Tbh RSS pracharak should be disqualified of such a job title.",
        "Source?",
        "I'll bring the cream",
        "Spy's great grand daughter keep bragging about her grand mother being banged by Einstein. They also mention Einstein got the idea of space time curvature on the bed itself. They say he was so weird that one day he stopped, got up and started writing equation on the board immediately \"didn't even c*m\".",
        "Actually an officer was arrested in Chandipur,DRDO a few months back. He actually lived behind my house. I think that's the info I am allowed to provide.\n\nSource: [Honey-trapped by Pak spy, Odisha ITR officer arrested for leaking information - Hindustan Times](https://www.hindustantimes.com/cities/others/honeytrapped-by-pak-spy-odisha-itr-officer-arrested-for-leaking-information-101677247055624.html)",
        "At least she was his lover. This man was getting photos only.",
        "ATS must be having fun asking for description.",
        "they should tap drdo isro scientists",
        "We cannot get away from the fact that the man was a RSS card carrying member",
        "Such people don't touch pre existing items on internet, they want something to be presented to them.",
        "That's a high graphics game, play yourself you'll know.",
        "Imagine if part of your paycheck was a legalized bank of escorts!",
        "Bro where can I read abt all this ?",
        "Man decent salary would be good too : )",
        "Like people don't fap to him already : )",
        "And married people can't feel lonely?",
        "Nukes for nudes. Sounds fair to me : )",
        "It’s a serious SERIOUS issue to put such gullible fucks at helm of defence research. I mean it’s appalling how people are justifying his goddamn idiocy for “nudes”!? Lifelong RSS follower and subscriber of their sanskari front couldn’t be this idiot! Lonely ki mkc, such a person is called “naade ka dheela” in Hindi. Stop fending for such gullible fucks and instead make noise for some kind of mandatory training for these people before giving them posts, until it is “uncovered” that such high up posts become available to people with “certain affiliations” like is being obvious in recent appointments of VCs in universities in Delhi so as they dance in evening for some event when women students have been brutalised by “certain specific miscreants” in the day. \nIf you really want to chest-thump on your patriotism, ask for better people as leaders.",
        "RSS guy",
        "Russian WhatsApp",
        "Lmao, just googled this Einstein Russian  lover spy thing and found this.\nEinstein wrote this in a letter to her in 1945 \"Just recently I washed my head by myself, but not with the greatest success; I am not as careful as you are\".\n\nNo wonder his hair looked like that. I can't stop laughing.",
        "Modi sending Noodie?",
        "**MONEY** and  **LUST**\n\nYou cannot take that from an average Indian.",
        "Those Pakistani babes though...",
        "I see lots of comments asking how can such a naive/stupid person be in charge of critical and important documents.\n\nAmong other things, one of the good things the current govt at centre has done is overhauling the security setup of the defence related establishments.\n\nBetween 2016 and 2018, more than 35 thousand personnel have undergone psychometric tests and based on the assessment quite a few have been reassigned to non critical positions. The risky ones have to undergo the tests every year. \nThe key personnel have to give an undertaking before they can move into these roles which have access to state secrets.  The primary clauses mention that you can't talk to media, or publish books or articles pertaining to the work done at the organisation. But hidden in the fine print is one clause which specifically states that the phone conversation will be under surveillance. \n\n\nBad apples do get through like in the current case. \n\nBut overall the set up is much more secure now than what it was in pre-2016 era. Earlier the security was more like a formality which needs to be done in letter and not in spirit. Now it's followed strictly and whenever deviations are found the senior officers are marched off without delay or deliberations.  A few examples of such removals  were made and now everyone has fallen in line.\n\nI had a colleague who's wife worked in XXXX, Deonar, Mumbai. When our company changed to Jio numbers, his wife had to inform her personnel dept in writing that her husband's number has changed.",
        "No man ever controlled a woman or another man because they couldn't control themselves rather men did it because they thought they were superior and stronger than others whether in terms of physique,  wealth or influence.",
        "They can but only if the society agrees, otherwise u can't call urself lonely",
        "I am pretty sure nudes weren't the only thing, he was also looking for interaction with this woman. \nWhich is why things like onlyfans are so popular lol,  even when u have entire internet full of porn but people happily pay for onlyfans , fansly and all because they can interact with these pornstars",
        "Do we really know the person sending nudes was a woman? Could have been a 40 year old person pretending to be a woman,   fake nudes arent exactly difficult to generate .",
        "Peshwas collapsed for a hole. What's DRDO!!",
        "Wait till you hear about that guy in the US who leaked defense information on a gaming server",
        "Demn!",
        "Chut ka chakkar babu bhaiya",
        "No, if you read evolutionary biology and primatology, mate-guarding is a salient feature of the majority of human societies, as well as some primate groups.\n\nSince human females have evolved to have concealed ovulation and ovulate across the year, unlike other primates that are in estrus once or twice a year, human males could not determine paternity until the advent of DNA testing.\n\nEstablishing paternity became critically important when human beings moved from hunter-gatherer societies to settled agriculture, because settled agriculture enshrined private property, required surplus labour, and was critically dependent on male strength because food-growing is physically strenuous.\n\nIf you read anthropology, patriarchy is not as structured or well-established in hunter-gatherer societies. There's division of labour yes, but there's no myth-building around male supremacy or the enshrined supremacy of men.\n\nPatriarchy is largely a feature of agrarian societies.",
        "Elaborate pls.",
        "I don't believe it send me the link of the nude pictures , I'll 'analyse' those myself",
        "He could've paid for onlyfans lmfao, also prostitution is a thing too. Pretty sure there are paid girlfriend businesses as well.",
        "Watch Genius by NGC or Read online stuffs.",
        "As usual we can take help from our good friend Russia. They are a reliable supplier.",
        "This dude gets it. Rest won't understand",
        "Ah yes, the allegation of the congress, the bastion of truth"
    ],
    "cleaned_text": "isi milked defense secrets lonely drdo scientist apparently isi need blackmail indian scientist honeytrapping dude pretty keen sharing secrets long lady sent nudes httpswwwmiddaycommumbaimumbainewsarticlemaharashtrahowisimilkedsecretsfromsmittenscientisthttpswwwmiddaycommumbaimumbainewsarticlemaharashtrahowisimilkedsecretsfromsmittenscientist ",
    "cleaned_title": "isi milked defense secrets lonely drdo scientist",
    "cleaned_selftext": "apparently isi need blackmail indian scientist honeytrapping dude pretty keen sharing secrets long lady sent nudes httpswwwmiddaycommumbaimumbainewsarticlemaharashtrahowisimilkedsecretsfromsmittenscientisthttpswwwmiddaycommumbaimumbainewsarticlemaharashtrahowisimilkedsecretsfromsmittenscientist",
    "cleaned_comments": "scientist also active rss pracharak theres relation somethin httpswwwndtvcomindianewscongallegesdrdoofficialheldbyatsinmaharashtraisrssvolunteerhttpswwwndtvcomindianewscongallegesdrdoofficialheldbyatsinmaharashtraisrssvolunteer wanted swayamseva thats asking noods new lawthe standing pm regularly send noods single govt employees state designated noods letsgooo mon key baat exclusively onlyfans news shared death whats point posting understandable even einstein clue lover russian spy hole change goal black hole youre lost rss expect weak willed men seek solace mundane want single govt employees pms noods longer care foreign honey bees pms noods bob vagen intensifies call aatma nirbharta use officially licensed words see hms personal preference need drdhoes keep scientists happy call horny instead lonely gifgiphylnjfuplkycdmtendownsized dont understand mens brains work guys entrusted classified information fairly good position comes result intelligence efficiency recognize obvious spying girl sends nudes return national secrets relationship transactional way girl would use secrets money seriously stupid people charge running world cast wide net get caught pick weakest ones exploit guess agencies might also trying thing probably world espionage somehow extract info fs sake scientists country even make enough afford esscort little paid simp one country pretty beautiful premium subscription chaturbate drdo employees like sent nudes guy says something salacious blackmail happens share secrets share chats robin williams famously said men two major organs one works given time guess peepee overrides command centre reverse rarely happens hes first man sacrifice life service dick hes one long line men think men try control women time barely control im sorry indian whores prostitutes mean india largest market prostitution good meet needs fellow countryman drdo scientists govt activists working day night secure good future couldnt care lonely drdo scientist think high time indian whores need game good initiative would connect digital india program person horny radar whenever radar goes red alert prostitute contact himher looks truly pathetic stupid instantly think problem gender iq exactly also extremely easy judge someone fact people dont realize smooth criminalsactors job woman didnt ask state secrets moment met made happen slowly organically still dumb thing people dumb things acknowledging isnt exactly rocket science ahem entrap people first step teach people avoid thousands pornstars billions porn videos even hookers around yet sold countrys secrets enemy womans nude either next level hot guy next level idiot og simp guess good thing im charge defense secrets operation lun ki baat right booby trap never happened anyone else comment made sense ummm lonely dude married kids lets excuse behaviour creep creep stupid realize send money rather state secrets even stupid realize spend money local esscort enjoy prison traitor given death penalty putting nation risk defence nation esscort got ta parts honestly keeps people leaking state secrets esscort services legalized tax write wait minute traded defence secrets nudes wtf one person something stupid immediately decide blame entire gender nice dont swear celibacy tbh rss pracharak disqualified job title source ill bring cream spys great grand daughter keep bragging grand mother banged einstein also mention einstein got idea space time curvature bed say weird one day stopped got started writing equation board immediately didnt even cm actually officer arrested chandipurdrdo months back actually lived behind house think thats info allowed provide source honeytrapped pak spy odisha itr officer arrested leaking information hindustan timeshttpswwwhindustantimescomcitiesothershoneytrappedbypakspyodishaitrofficerarrestedforleakinginformationhtml least lover man getting photos ats must fun asking description tap drdo isro scientists get away fact man rss card carrying member people dont touch pre existing items internet want something presented thats high graphics game play youll know imagine part paycheck legalized bank escorts bro read abt man decent salary would good like people dont fap already married people cant feel lonely nukes nudes sounds fair serious serious issue put gullible fucks helm defence research mean appalling people justifying goddamn idiocy nudes lifelong rss follower subscriber sanskari front couldnt idiot lonely ki mkc person called naade ka dheela hindi stop fending gullible fucks instead make noise kind mandatory training people giving posts uncovered high posts become available people certain affiliations like obvious recent appointments vcs universities delhi dance evening event women students brutalised certain specific miscreants day really want chestthump patriotism ask better people leaders rss guy russian whatsapp lmao googled einstein russian lover spy thing found einstein wrote letter recently washed head greatest success careful wonder hair looked like cant stop laughing modi sending noodie money lust take average indian pakistani babes though see lots comments asking naivestupid person charge critical important documents among things one good things current govt centre done overhauling security setup defence related establishments thousand personnel undergone psychometric tests based assessment quite reassigned non critical positions risky ones undergo tests every year key personnel give undertaking move roles access state secrets primary clauses mention cant talk media publish books articles pertaining work done organisation hidden fine print one clause specifically states phone conversation surveillance bad apples get like current case overall set much secure pre era earlier security like formality needs done letter spirit followed strictly whenever deviations found senior officers marched without delay deliberations examples removals made everyone fallen line colleague whos wife worked xxxx deonar mumbai company changed jio numbers wife inform personnel dept writing husbands number changed man ever controlled woman another man couldnt control rather men thought superior stronger others whether terms physique wealth influence society agrees otherwise u cant call urself lonely pretty sure nudes werent thing also looking interaction woman things like onlyfans popular lol even u entire internet full porn people happily pay onlyfans fansly interact pornstars really know person sending nudes woman could year old person pretending woman fake nudes arent exactly difficult generate peshwas collapsed hole whats drdo wait till hear guy us leaked defense information gaming server demn chut ka chakkar babu bhaiya read evolutionary biology primatology mateguarding salient feature majority human societies well primate groups since human females evolved concealed ovulation ovulate across year unlike primates estrus twice year human males could determine paternity advent dna testing establishing paternity became critically important human beings moved huntergatherer societies settled agriculture settled agriculture enshrined private property required surplus labour critically dependent male strength foodgrowing physically strenuous read anthropology patriarchy structured wellestablished huntergatherer societies theres division labour yes theres mythbuilding around male supremacy enshrined supremacy men patriarchy largely feature agrarian societies elaborate pls dont believe send link nude pictures ill analyse couldve paid onlyfans lmfao also prostitution thing pretty sure paid girlfriend businesses well watch genius ngc read online stuffs usual take help good friend russia reliable supplier dude gets rest wont understand ah yes allegation congress bastion truth",
    "light_cleaned_title": "How the ISI milked defense secrets from a lonely DRDO scientist",
    "light_cleaned_selftext": "Apparently, the ISI had no need to blackmail the Indian scientist after honey-trapping him, as the dude was pretty keen on sharing secrets as long as the lady sent in nudes. [https://www.mid-day.com/mumbai/mumbai-news/article/maharashtra-how-isi-milked-secrets-from-smitten-scientist-23285611](https://www.mid-day.com/mumbai/mumbai-news/article/maharashtra-how-isi-milked-secrets-from-smitten-scientist-23285611)",
    "light_cleaned_comments": "The scientist is also an active RSS pracharak. Not that there's any relation or somethin' :3 [https://www.ndtv.com/india-news/cong-alleges-drdo-official-held-by-ats-in-maharashtra-is-rss-volunteer-4021958](https://www.ndtv.com/india-news/cong-alleges-drdo-official-held-by-ats-in-maharashtra-is-rss-volunteer-4021958) He wanted to do some SwayamSeva, that's why he was asking for Noods. New law:The standing PM has to regularly send noods to all single govt employees State designated noods letsgooo During Mon key baat Exclusively on onlyfans This news has been shared to death here, what's the point of posting it over and over again. Understandable, even Einstein had no clue that his lover was a Russian spy. A hole can change your goal, if it's a black hole you're lost. RSS. What do you expect from such weak willed men that seek solace from the mundane ? What do you want the single govt employees to do with PM's noods? So that they no longer care about those foreign honey bees PM's noods? \"Bob and vagen\" intensifies Call it aatma nirbharta. You should use officially licensed words you see? Or HM's personal preference We need some DRD-Hoes to keep our scientists happy. Why not call him horny instead of lonely? ![gif](giphy|LnjFup0l3KycdM8teN|downsized) I don't understand how men's brains work. How do these guys, entrusted with classified information (for which you should be in a fairly good position, which comes as a result of your intelligence and efficiency) not recognize obvious spying? \"This girl sends me nudes in return for national secrets. Our relationship is transactional. There is no way this girl would use those secrets for money.\" Seriously? How stupid are the people in charge of running the world? They cast a wide net only few get caught out of them they pick the weakest ones that they can exploit I guess. Our agencies might also be trying the same thing probably. World of espionage, somehow extract info. For f***s sake do scientists in this country not even make enough to afford an esscort ....how little are they being paid ? Simp No one in the country is as pretty and beautiful Premium subscription to Chaturbate for all drdo employees It’s more like she sent nudes and guy says something salacious. Then the blackmail happens. You share secrets or I will share our chats. Robin Williams famously said that men have two major organs and only one works at any given time. Guess PeePee overrides Command Centre but the reverse rarely happens. He's not the first man to sacrifice his life in service of Dick. He's one of a long line of men -- why do you think men try to control women all the time? It's because they can barely control themselves. I'm sorry but this is all on Indian whores and prostitutes. I mean India is the largest market for prostitution what good is that we you cannot meet the needs of a fellow countryman, that too a DRDO scientists. The govt and activists are working day and night to secure a good future for them and they couldn't care for a lonely DRDO scientist? I think it's high time, Indian whores need to up their game. A good initiative would be connect them through \"Digital India\" program. Where each person has a horny radar and whenever that radar goes \"Red alert\" the prostitute should contact him/her and looks after him Truly pathetic About as stupid as you, to instantly think that the problem was his gender and not his iq Exactly this. Also, while it is extremely easy to judge someone after the fact, people don’t realize how smooth these criminals/actors are at their job. The woman didn’t ask for state secrets the moment she met him, she made it happen slowly and organically. It is still a dumb thing to do, but people do dumb things, and acknowledging that it isn’t exactly rocket science (ahem!) to entrap people is the first step to teach people how to avoid this. Thousands of pornstars, billions of porn videos and even hookers all around and yet he sold country's secrets to the enemy for that woman's nude. Either she is next level hot or the guy is next level idiot The OG simp💀 Guess it's a good thing that I'm not in charge of any defense secrets then. Operation \"Lun' ki baat\" Right? Booby trap has never happened before with anyone else?? If only your comment made any sense. And? Ummm lonely? Dude was married with kids. Let’s not excuse this behaviour. Creep is as creep does To stupid to realize he can just send money , rather than state secrets. Even more stupid not to realize he can just spend the money on a local esscort. Enjoy the prison, traitor. Should be given the death penalty for putting the nation at risk. All for the defence of the nation, the esscort gotta do their parts. Honestly if this keeps people from leaking state secrets, esscort services should be legalized and should be a tax write off. Wait a minute. He traded defence secrets just for nudes? WTF? So one person did something stupid and you immediately decide to blame an entire gender. nice. /s Don't they swear celibacy? Tbh RSS pracharak should be disqualified of such a job title. Source? I'll bring the cream Spy's great grand daughter keep bragging about her grand mother being banged by Einstein. They also mention Einstein got the idea of space time curvature on the bed itself. They say he was so weird that one day he stopped, got up and started writing equation on the board immediately \"didn't even c*m\". Actually an officer was arrested in Chandipur,DRDO a few months back. He actually lived behind my house. I think that's the info I am allowed to provide. Source: [Honey-trapped by Pak spy, Odisha ITR officer arrested for leaking information - Hindustan Times](https://www.hindustantimes.com/cities/others/honeytrapped-by-pak-spy-odisha-itr-officer-arrested-for-leaking-information-101677247055624.html) At least she was his lover. This man was getting photos only. ATS must be having fun asking for description. they should tap drdo isro scientists We cannot get away from the fact that the man was a RSS card carrying member Such people don't touch pre existing items on internet, they want something to be presented to them. That's a high graphics game, play yourself you'll know. Imagine if part of your paycheck was a legalized bank of escorts! Bro where can I read abt all this ? Man decent salary would be good too : ) Like people don't fap to him already : ) And married people can't feel lonely? Nukes for nudes. Sounds fair to me : ) It’s a serious SERIOUS issue to put such gullible fucks at helm of defence research. I mean it’s appalling how people are justifying his goddamn idiocy for “nudes”!? Lifelong RSS follower and subscriber of their sanskari front couldn’t be this idiot! Lonely ki mkc, such a person is called “naade ka dheela” in Hindi. Stop fending for such gullible fucks and instead make noise for some kind of mandatory training for these people before giving them posts, until it is “uncovered” that such high up posts become available to people with “certain affiliations” like is being obvious in recent appointments of VCs in universities in Delhi so as they dance in evening for some event when women students have been brutalised by “certain specific miscreants” in the day. If you really want to chest-thump on your patriotism, ask for better people as leaders. RSS guy Russian WhatsApp Lmao, just googled this Einstein Russian lover spy thing and found this. Einstein wrote this in a letter to her in 1945 \"Just recently I washed my head by myself, but not with the greatest success; I am not as careful as you are\". No wonder his hair looked like that. I can't stop laughing. Modi sending Noodie? **MONEY** and **LUST** You cannot take that from an average Indian. Those Pakistani babes though... I see lots of comments asking how can such a naive/stupid person be in charge of critical and important documents. Among other things, one of the good things the current govt at centre has done is overhauling the security setup of the defence related establishments. Between 2016 and 2018, more than 35 thousand personnel have undergone psychometric tests and based on the assessment quite a few have been reassigned to non critical positions. The risky ones have to undergo the tests every year. The key personnel have to give an undertaking before they can move into these roles which have access to state secrets. The primary clauses mention that you can't talk to media, or publish books or articles pertaining to the work done at the organisation. But hidden in the fine print is one clause which specifically states that the phone conversation will be under surveillance. Bad apples do get through like in the current case. But overall the set up is much more secure now than what it was in pre-2016 era. Earlier the security was more like a formality which needs to be done in letter and not in spirit. Now it's followed strictly and whenever deviations are found the senior officers are marched off without delay or deliberations. A few examples of such removals were made and now everyone has fallen in line. I had a colleague who's wife worked in XXXX, Deonar, Mumbai. When our company changed to Jio numbers, his wife had to inform her personnel dept in writing that her husband's number has changed. No man ever controlled a woman or another man because they couldn't control themselves rather men did it because they thought they were superior and stronger than others whether in terms of physique, wealth or influence. They can but only if the society agrees, otherwise u can't call urself lonely I am pretty sure nudes weren't the only thing, he was also looking for interaction with this woman. Which is why things like onlyfans are so popular lol, even when u have entire internet full of porn but people happily pay for onlyfans , fansly and all because they can interact with these pornstars Do we really know the person sending nudes was a woman? Could have been a 40 year old person pretending to be a woman, fake nudes arent exactly difficult to generate . Peshwas collapsed for a hole. What's DRDO!! Wait till you hear about that guy in the US who leaked defense information on a gaming server Demn! Chut ka chakkar babu bhaiya No, if you read evolutionary biology and primatology, mate-guarding is a salient feature of the majority of human societies, as well as some primate groups. Since human females have evolved to have concealed ovulation and ovulate across the year, unlike other primates that are in estrus once or twice a year, human males could not determine paternity until the advent of DNA testing. Establishing paternity became critically important when human beings moved from hunter-gatherer societies to settled agriculture, because settled agriculture enshrined private property, required surplus labour, and was critically dependent on male strength because food-growing is physically strenuous. If you read anthropology, patriarchy is not as structured or well-established in hunter-gatherer societies. There's division of labour yes, but there's no myth-building around male supremacy or the enshrined supremacy of men. Patriarchy is largely a feature of agrarian societies. Elaborate pls. I don't believe it send me the link of the nude pictures , I'll 'analyse' those myself He could've paid for onlyfans lmfao, also prostitution is a thing too. Pretty sure there are paid girlfriend businesses as well. Watch Genius by NGC or Read online stuffs. As usual we can take help from our good friend Russia. They are a reliable supplier. This dude gets it. Rest won't understand Ah yes, the allegation of the congress, the bastion of truth"
}