{
    "id": "12cvi4s",
    "title": "Pathetic experience with Airasia booking. Help needed!",
    "url": "https://www.reddit.com/r/india/comments/12cvi4s/pathetic_experience_with_airasia_booking_help/",
    "selftext": "I tried to make an international booking through [airasia.com](https://airasia.com) , with payment through an international currency. After entering the credit card details, the website said \"payment failed\" and asked me to try some other payment method. Other payment methods were not working, and hence made the booking through makemytrip, and it got confirmed. After 1 hour, I get an email that money has been deducted by [airasia.com](https://airasia.com) and it sent me the ticket as well. Now, I am left with two non-refundable tickets, with different dates of departure, as I chose the cheaper from makemytrip. \n\nI contacted my credit card company asked for a charge-back, as I got no OTP before for authorizing the transaction, and also the website said that \"transaction declined\" and asked me to try some other payment method. They asked me to talk to [airasia.com](https://airasia.com) and sort it out. There is virtually no way to talk to a real customer support person from Air Asia, and even no email address mentioned. Everything leads to this dumb chatbot \"Bo\". I saw that there is a mention of [refund in case of duplicate booking](https://support.airasia.com/s/article/What-happens-if-I-make-a-double-payment-en?language=en_GB), but doesn't seem hopeful as it says both bookings need to be on the same date. There is no where I can explain my situation in detail to someone in airasia. I asked my credit card company to block my card and raise a dispute. For investigation, it needs cybercrime complaint number, ID proof, and dispute form. Is there any way to get a quick refund without all these hassles?",
    "flair": "AskIndia",
    "score": 6,
    "num_comments": 1,
    "created_utc": 1680723684.0,
    "convurl": "https://external-preview.redd.it/ZwJkbaVOaQHBlWiu9QLYpVJ0yugVRlH25IQbVw1lyzg.jpg?auto=webp&v=enabled&s=e0dd9ddb55bc941ef60cb4079380b0f43007648c",
    "comments": [
        "The refund will take at least a week, via a dispute. No other way",
        "I just experienced the same issue! How did you resolve yours?",
        "Any update on what happened as I’m facing a similar situation"
    ],
    "cleaned_text": "pathetic experience airasia booking help needed tried make international booking airasiacomhttpsairasiacom payment international currency entering credit card details website said payment failed asked try payment method payment methods working hence made booking makemytrip got confirmed hour get email money deducted airasiacomhttpsairasiacom sent ticket well left two nonrefundable tickets different dates departure chose cheaper makemytrip contacted credit card company asked chargeback got otp authorizing transaction also website said transaction declined asked try payment method asked talk airasiacomhttpsairasiacom sort virtually way talk real customer support person air asia even email address mentioned everything leads dumb chatbot bo saw mention refund case duplicate bookinghttpssupportairasiacomsarticlewhathappensifimakeadoublepaymentenlanguageengb doesnt seem hopeful says bookings need date explain situation detail someone airasia asked credit card company block card raise dispute investigation needs cybercrime complaint number id proof dispute form way get quick refund without hassles ",
    "cleaned_title": "pathetic experience airasia booking help needed",
    "cleaned_selftext": "tried make international booking airasiacomhttpsairasiacom payment international currency entering credit card details website said payment failed asked try payment method payment methods working hence made booking makemytrip got confirmed hour get email money deducted airasiacomhttpsairasiacom sent ticket well left two nonrefundable tickets different dates departure chose cheaper makemytrip contacted credit card company asked chargeback got otp authorizing transaction also website said transaction declined asked try payment method asked talk airasiacomhttpsairasiacom sort virtually way talk real customer support person air asia even email address mentioned everything leads dumb chatbot bo saw mention refund case duplicate bookinghttpssupportairasiacomsarticlewhathappensifimakeadoublepaymentenlanguageengb doesnt seem hopeful says bookings need date explain situation detail someone airasia asked credit card company block card raise dispute investigation needs cybercrime complaint number id proof dispute form way get quick refund without hassles",
    "cleaned_comments": "refund take least week via dispute way experienced issue resolve update happened im facing similar situation",
    "light_cleaned_title": "Pathetic experience with Airasia booking. Help needed!",
    "light_cleaned_selftext": "I tried to make an international booking through [airasia.com](https://airasia.com) , with payment through an international currency. After entering the credit card details, the website said \"payment failed\" and asked me to try some other payment method. Other payment methods were not working, and hence made the booking through makemytrip, and it got confirmed. After 1 hour, I get an email that money has been deducted by [airasia.com](https://airasia.com) and it sent me the ticket as well. Now, I am left with two non-refundable tickets, with different dates of departure, as I chose the cheaper from makemytrip. I contacted my credit card company asked for a charge-back, as I got no OTP before for authorizing the transaction, and also the website said that \"transaction declined\" and asked me to try some other payment method. They asked me to talk to [airasia.com](https://airasia.com) and sort it out. There is virtually no way to talk to a real customer support person from Air Asia, and even no email address mentioned. Everything leads to this dumb chatbot \"Bo\". I saw that there is a mention of [refund in case of duplicate booking](https://support.airasia.com/s/article/What-happens-if-I-make-a-double-payment-en?language=en_GB), but doesn't seem hopeful as it says both bookings need to be on the same date. There is no where I can explain my situation in detail to someone in airasia. I asked my credit card company to block my card and raise a dispute. For investigation, it needs cybercrime complaint number, ID proof, and dispute form. Is there any way to get a quick refund without all these hassles?",
    "light_cleaned_comments": "The refund will take at least a week, via a dispute. No other way I just experienced the same issue! How did you resolve yours? Any update on what happened as I’m facing a similar situation"
}