{
    "id": "1610kf6",
    "title": "Woman tourist r@ped in Goa by a man she met on flight.",
    "url": "https://www.indiatoday.in/india/story/gujarat-man-befriends-woman-flight-rapes-after-landing-goa-arrested-2426453-2023-08-25",
    "selftext": "Uncles are more creepy.\n\nLet's not blame the woman for the early trust. It's not an excuse for anyone to rape. In fact we must make an environment where woman can actually trust someone. \n\nIt's so easy to comment \"Why did she even share her number\", \"Why did she vist him alone\". It's NOT the excuse to rape someone. One could also ask, \"Why he took advantage of her and raped her\".",
    "flair": "Crime",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1692973055.0,
    "convurl": "https://external-preview.redd.it/icefeW2jquU6LysaDtjAahYrAgumsjGp5S2cgPaBYhM.jpg?auto=webp&s=43bc86b20a40248959abac92e836c27c7e6a5b42",
    "comments": [
        "इन नीच राक्षसों की वजह से..\n\nएक समय आएगा जब भारत में लोग बाहर से आना बंद कर देंगे ॥"
    ],
    "cleaned_text": "woman tourist rped goa man met flight uncles creepy lets blame woman early trust excuse anyone rape fact must make environment woman actually trust someone easy comment even share number vist alone excuse rape someone one could also ask took advantage raped ",
    "cleaned_title": "woman tourist rped goa man met flight",
    "cleaned_selftext": "uncles creepy lets blame woman early trust excuse anyone rape fact must make environment woman actually trust someone easy comment even share number vist alone excuse rape someone one could also ask took advantage raped",
    "cleaned_comments": "",
    "light_cleaned_title": "Woman tourist r@ped in Goa by a man she met on flight.",
    "light_cleaned_selftext": "Uncles are more creepy. Let's not blame the woman for the early trust. It's not an excuse for anyone to rape. In fact we must make an environment where woman can actually trust someone. It's so easy to comment \"Why did she even share her number\", \"Why did she vist him alone\". It's NOT the excuse to rape someone. One could also ask, \"Why he took advantage of her and raped her\".",
    "light_cleaned_comments": "इन नीच राक्षसों की वजह से.. एक समय आएगा जब भारत में लोग बाहर से आना बंद कर देंगे ॥"
}