{
    "id": "15xyer6",
    "title": "Women have unleashed \"legal terrorism\" by misusing Section 498A IPC: Calcutta High Court",
    "url": "https://www.barandbench.com/news/women-unleashed-legal-terrorism-misusing-section-498a-ipc-calcutta-high-court",
    "selftext": "*shocked Pikachu face*",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 101,
    "created_utc": 1692689636.0,
    "convurl": "https://external-preview.redd.it/PD2xhrUJLPsAioOoCx6fIGUleQhkeYE9vNHIQdVvqOI.jpg?auto=webp&s=c9680656b4846955264f26cd794a595c7b48205b",
    "comments": [
        "&#x200B;\n\nhttps://preview.redd.it/2jb8fv96gmjb1.png?width=512&format=png&auto=webp&s=fca7aabb995a5cee9d57f36810cc690491a3267c",
        "I am shocked! Shocked I say!!",
        "What is 498 ipc?",
        "Law that prescribes imprisonment for any dowry complaint by a woman, regardless of legitimacy of such complaint.",
        "To claim that no woman misuses the provisions is nonsense. The issue , like many of the issues in our country, is that we rush to legislate and don't bother about the implementation or implications. Shoddy police work, no problem, let's invoke UAPA or PSA . A well entrenched man walked free from a case, let's make a non bailable law. The fact is that we don't really care about the issues,not really, all we want to do is to show that we have acted.",
        "Was it? In my personal experience they apply the punishment but see if it's being charged or not.",
        "Pending investigation. They can be freed after that.",
        "That is true for everything, so doesn't really have to be said.",
        "Make nonsense laws which can be easily misused\n\nSee them getting misused\n\n😮",
        "Finally coming out of the slumber, are we?",
        "The bigger problem is we have a corruptible police force who can arrest you for random reasons. And law abiding people would rather pay bribes or fines rather than dealing with our opaque and slow legal system.",
        "Problem is I have seen some cases where honest man had to suffer because his wife eloped with her BF and has the wife had good family background, they were able to hire good lawyers and lobby and stuff to make the husband pay for it..",
        "Investigation are forever pending in India. You know that.",
        "You know that 95% of marriages have abuse and yet the idiotic men want to be the victims",
        "I literally didn't say anything either way.",
        "So the cases where Men are victim are supposed to be just accepted as such? \n\nPeople like you are impossible to understand. Gaand mein se nikaal ke dimaag sir mein lagao thoda.",
        "Did marriage rate fall or something? Since when did the courts started caring about men",
        "We are not talking about the men in your family. Calm down.",
        "Actually I think they came up with these laws believing that people will responsibly use these. But the group of women who should have benefited from it are not able to take advantage and the ones who can, go all out. I know 5 men personally whose lives are ruined because of this. 2 chose to settle with monetary payments, 1 saved by the judge because of some last minute evidence in his favor, 2 are fighting on and refuse to bend. 1 has written a book called bitter half and the other has started a non profit to advise other men like him. The latter is a childhood friend and breaks my heart to see him in so much trouble. Lost his father recently because the girls family just wouldnt stop harrassments and kept sending goons at their place.",
        "We’re talking about Indian men in general. The vast majority of the creeps and assholes",
        "And why do you think the males in your family are the minority? Everyone is a creep except your father or brother?",
        "That’s not what I said",
        "You edited the reply. And no, men in my family are the role models of my life. Especially my Father, so yeah I would always speak against generalizing.",
        "Generalization will not help.\nSaying men can't be victims of this crime because many do commit such acts\nIs like saying you are a scammer because many have been found to be scammers.\n\nDoesn't help at all.",
        ">People like you are impossible to understand. Gaand mein se nikaal ke dimaag sir mein lagao thoda.\n\nBro woke up and chose violence.",
        "Hate to go for the Low hanging fruit but you're a frequent poster in r/autism \nI don't feel any further discourse with you would lead to anything productive.",
        "They watched Daawat-e-Ishq and decided to enact in reality",
        "Better to let 10 guilty roam free then to have one innocent punished",
        "You think that’s a bad thing? lol bro autistics are more immune to idiotic hateful propaganda like this post.\nIt’s neurotypicals who get crazy in a mob",
        "Misogynists are also ableist what a surprise. You’re a trash bag of a person and should accept that about yourself without trying to even avoid responsibility for it by saying “I hate to be a dick but I’m going to anyway”",
        "How about we jail the women with the same punishment after they are freed ? Seems fair right ?",
        "Whats the full story?  (i don’t wanna sign up)",
        "So laws protecting women from harassment is nonsense?",
        "1[Whoever, being the husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished with imprisonment for a term which may extend to three years and shall also be liable to fine.\nExplanation.—For the purposes of this section, \"cruelty means\"—\n(a) anywilful conduct which is of such a nature as is likely to drive the woman to commit suicide or to cause grave injury or danger to life, limb or health (whether mental or physical) of the woman; or\n\nOP is a big liar.",
        "1[Whoever, being the husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished with imprisonment for a term which may extend to three years and shall also be liable to fine.\nExplanation.—For the purposes of this section, \"cruelty means\"—\n(a) anywilful conduct which is of such a nature as is likely to drive the woman to commit suicide or to cause grave injury or danger to life, limb or health (whether mental or physical) of the woman; or\n\nThis is 498a code. I want to know how can you exactly misuse this law when there’s a requirement for proof of abuse.",
        "Are you a lawyer?",
        "Exactly. There are rules to protect against false accusations.",
        "It is. OP just want to be dramatic",
        "No. But giving unchecked legal power is",
        "What do you mean by unchecked legal power? There’s investigations and trials for the legitimacy of the case.\n\nhttps://lawrato.com/indian-kanoon/ipc/section-498a",
        "Are you? Lol",
        "By the way, you have google to search for the procedure of the law before commenting nonsense \n\nhttps://lawrato.com/indian-kanoon/ipc/section-498a",
        "498a is non-bailable offence. It should be made bailable",
        "Lol. On what grounds?",
        "If he is falsely accused then how will he prove his innocence ? Bail gives temporary release and this will give him a chance to prove that he is not guilty",
        "Misuse of any legal provision, including Section 498A, is a concern. It's important to ensure that legal processes are followed correctly and that accusations are based on genuine grievances. Misuse can harm innocent individuals and undermine the credibility of the legal system.\n\nhttps://falserapedatabase.substack.com/",
        "Did you even look at the link I shared? 🤦‍♀️\n\nThe court ask for evidence of abuse upon which they investigate. They will only arrest if the court agree the accusations are true after the investigation. The accused can also defend their part with a lawyer if they believe they are falsely accused. \n\nSeriously you think police would just arrest people like that?",
        "Let me try to explain this in short.\n\n498A was introduced to end dowry deaths I. E. women forced to commit suicide or tortured to near death. \n\nIn such cases, police is expected to act proactively and with minimal input, as they essentially lead to a breakdown of society. Thus there is no qualification or requirement of abuse that needs to be met to file FIR by the plaintiff, as it is assumed police is doing so to to prevent such abuse. However, to convict the defendant, there are criterias to be met, as mentioned in the wording of the section. \n\nNow, when it comes to Court and the innocent has been in jail for a few weeks/months and the matter finally come to hearing to the Judicial Magistrate/Sessions Judge, they realize that there exists no proof of such crime in the first place, and the innocent is released.\n\nWhich is why you end up with Courts frustrated with bad laws. By the time Court can step in to help and quash/discharge the case, months/years may have passed. Often, it is too late and many innocents are forced to commit suicide. \n\nhttps://www.barandbench.com/news/women-unleashed-legal-terrorism-misusing-section-498a-ipc-calcutta-high-court\n\nhttps://www.barandbench.com/news/litigation/genuine-cases-sexual-offences-exception-law-heavily-biased-men-allahabad-high-court\n\nhttps://www.thehindu.com/news/national/delhi-high-court-expresses-worry-over-alarming-increase-of-false-rape-cases/article36042093.ece\n\nAlso, I don't understand what procedure you mean. Which section of CrPC are you talking about? If you care to read your own link, question 17 clearly states the police can arrest people indiscriminately and without a warrant from Court upon inkling of 498A. All that's needed is a complaint from the woman (Question 14, point ii).",
        "\n“Trial / Court Procedure under Section 498A\n\nAs has been stated before, the trial or a criminal court procedure is initiated with the instance of an FIR or a police complaint. The detailed trial procedure has been given below:\nFIR (First Information Report) / Police complaint: the first step is a Police Complaint or a First Information Report. This is covered under Section 154 of the Code of Criminal Procedure. An FIR puts the entire case into motion.\nInvestigation and Report by Officer: The second step after the FIR, is investigation by the Investigation Officer. After the examination of the facts and circumstances, collection of evidence, and examination of persons and other necessary steps, the officer completes the investigation and prepares the investigation.”\n\nRead this and tell me what do you mean by “there’s no requirement of evidence”",
        "“Innocent has to be in jail”? dude, the court won’t arrest the accused unless the investigation proves he’s not innocent. You’re making this up.",
        "You do realize, and I'm repeating myself here, that in 498A, the police can arrest immediately and without warrant. And that secondly, to get this started 154 CrPC is the first and only step (mere oral complaint by complainant).",
        "Give me the proof of it.",
        "Either you’re misunderstanding or you’re denying the facts because you’re afraid of people facing consequences of their actions",
        "The police will arrest the accused without warrant IF the investigation proves he’s guilty",
        "I can smell a controversy building ups",
        "Once again, 498A of IPC is a NBCO (Non Bailable and Cognizable Offence). A Cognizable Offence is one which means the police will arrest anyone without a warrant or needing Court's permission/assessment.\n\nIt's clear you have no understanding of the legal system and are simply basing your arguments on Google. I will refrain from commenting further. Wish you the best.",
        " \n\n## Trial / Court Procedure under Section 498A\n\nAs has been stated before, the trial or a criminal court procedure is initiated with the instance of an FIR or a police complaint. The detailed trial procedure has been given below:\n\n1. **FIR (First Information Report) / Police complaint:** the first step is a Police Complaint or a First Information Report. This is covered under Section 154 of the Code of Criminal Procedure. An FIR puts the entire case into motion.\n2. **Investigation and Report by Officer:** The second step after the FIR, is investigation by the Investigation Officer. After the examination of the facts and circumstances, collection of evidence, and examination of persons and other necessary steps, the officer completes the investigation and prepares the investigation.\n3. **Charge-sheet before Magistrate:** The police then files the charge sheet before the magistrate. The charge-sheet consists of all the criminal charges against the accused.\n4. **Arguments before Court and Framing of Charges:** On the fixed date of hearing, the Magistrate hears the parties’ arguments on the charges that have been set and then finally frames the charges.\n5. **Plea of guilty:** Section 241 of the Code of Criminal Procedure, 1973 talks about the plea of guilty, after framing of the charges the accused is given an opportunity to plead guilty, and the responsibility lies with the judge to ensure that the plea of guilt was voluntarily made. The judge may upon its discretion convict the accused.\n6. **Evidence by Prosecution:** After the framing of the charges and the accused pleading ‘not guilty’, the evidence is first given by the Prosecution, upon whom the burden of proof initially (generally) lies. Both oral and documentary evidence can be produced. The magistrate has the power to issue summons to any person as a witness or order him to produce any document.\n7. **Cross Examination of Witnesses by Accused/Counsel:** Witnesses of the prosecution when produced before the court are cross examined by the accused or his/her counsel.\n8. **Evidence by Accused if any, in defence:** If the accused has any evidence, it is presented to the Courts at this stage. He/she is given this opportunity to make his/her case stronger. However, since the burden of proof is on the prosecution i.e. the alleged victim, the accused is not required to present evidence.\n9. **Cross Examination of Witness by Prosecution:** If witnesses are produced by the defence, they will be cross-examined by the Prosecution.\n10. **Conclusion of Evidence:** Once the court has been presented with evidence from both sides, the evidence is concluded by the Court/Judge.\n11. **Oral / Final Arguments:** The final stage, nearing the judgement is the stage of final arguments. Here, both parties take turns (first, the prosecution and then the defence) and make final oral arguments in front of the judge.\n12. **Judgement by the Court:** Based upon the facts and circumstances of that case, and upon the arguments made and evidence produced, the Court gives its final judgement. The Court gives its reasons in support of the acquittal or conviction of the accused and pronounces its final order.\n13. **Acquittal or Conviction:** If the accused is held guilty, he/she is convicted and if held ‘not-guilty’, the accused is acquitted in the final judgement.\n14. **If Convicted, Hearing on Quantum of Sentence:** If the accused is held guilty and convicted, a hearing will take place to decide the quantum or extent of the Sentence or jail time.\n15. **Appeal to Higher Courts:** An appeal to Higher Courts can be made if the scenario allows it. From Sessions court, an appeal can be made to the High Court and from High Court, to the Supreme Court.\n\n \n\n## When Can A Person Be Held Guilty Under Section 498A, IPC?\n\nFor a person to be held guilty under Section 498A, IPC it is important for the prosecution to compulsorily prove the following:\n\n1. That the woman is married. This Section protects women from unruly and cruel behaviour that gets meted out to her in her marital home.\n2. That the woman is subject to cruelty or harassment. Cruelty as discussed above can take on myriad forms.\n3. That such cruelty or harassment is suffered by her at the hands of her husband or her in-laws or both.\n\n \n\n## Is An Arrest Under Section 498a, Ipc, Automatic?\n\nThere came a time when arrests under Section 498A, IPC became unnecessarily rampant and routinely automatic. They were effected with the menacing motives of disgruntled wives rather than as effective tools to aid police investigation.\n\nThis malpractice was eventually checked by the Supreme Court of India, with the passage of judgements like Arnesh Kumar v. State of Bihar (2014) and Rajesh Sharma v. State of Uttar Pradesh (2017), wherein the Hon’ble Court while clearly recognising the gross misuse of Section 498A, IPC, issued guidelines to the Police while making arrests under the same.\n\nAccordingly, while investigating a 498A case, the Police instead of carrying out an automatic arrest of the accused are mandated to issue a notice to him under Section 41A, CrPC to join the ongoing investigation into the offence. Arrests are not mandated to be carried out under Section 498A, IPC if the accused continues to join such investigation, as and when called to do so. Hence, it was thus that unnecessary arrests by the Police were curbed by the Court.\n\nHowever, once the FIR is registered, it is better recommended to take anticipatory bail. When the accused moves the court for anticipatory bail, certain conditions may be imposed by the court upon him/her. Depositing a demand draft of a certain amount in the name of the wife or other dependents as a part of maintenance etc. could be one of the conditions. But, when there exists a specific provision for maintenance of wife and child, such conditional anticipatory bail granted under section 498A would go against the law.",
        "You may have missed the comment I pasted. The arrest are made when the accused to do not comply with the investigation.",
        "where does it day you need proof though?\n\nisnt every law supposed to be standing on its own? that , in my very very very humble opinion, means that the statement of the law has to be a self supporting sentence. \n\nCan you please explain this to me?",
        "No. The law doesn’t stand on its own. If it does, anyone could be charged without trial or investigation for any law. You didn’t answer my question though. Where does it say it you don’t need proof. \n\nhttps://lawrato.com/indian-kanoon/ipc/section-498a\n\nGo to the procedure of the complaint. Read it and weep.",
        "> kept sending goons at their place.\n\nYeah, I'd definitely get a door peephole, extra iron grill with a lock outside the main door, and atleast 1 gun to deal with goons.",
        "I always love watching a meltdown",
        "You're oozing with so much hate and carrying a lot of negativity on your chest, which must be burdensome. Here's to hoping you live a life free of victimhood and falsehoods, as most men are decent individuals.",
        "Wtf",
        "Yo dude thanks for this link! You’re totally fuckin’ right - the complaint and FIR are registered, investigated and then brought in front of a magistrate who brings it to trial if evidence is provided.\n\nThere’s this idea that the police will just pick up the husband or in-laws and put them in jail. Happened to my own neighbors, but my parents keep assuming they were never at fault.\n\nThe fact that you have 22 downvotes shows you how pervasive this misogyny is.",
        "I know I am right. Look at how they stopped talking when I throw the facts at their faces. How the morons were whining about how the law is “misused” without researching is ridiculous. They don’t care about truth or justice. They hate that they can’t control women and they can’t get away from law if they force control over them.",
        "The casual rate at which spousal abuse is taken in India is fucking terrible.",
        "This mental_flight person needs to calm down😂",
        "If a woman walks into the police station and say that her husband and in laws are mistreating her for dowry , police can put them behind bars immediately.",
        "Dude, Please don’t lie. Police didn’t do shit when my mother pleaded for their protection against my father’s abuse.",
        "Generally you will have to make a good case. A girl first went to her mom's place and broke some stuff asked her mom to slap her and went to PS and filed 498a. The boy was arrested immediately. SC advisory is not mandatory so it's the discretion of the officer.  \nThe arrest are made when physical violence is involved and fake complaints are lost in court but earlier there was lot of social stigma attached to it. People started ignoring the families against whom the complaint was filed. Things have changed now. But the misuse continues due to lack of policy",
        "Then why Calcutta, Jharkhand, Gujarat, Odisha, Supreme Court are echoing the same thing ? \n\nhttps://www.barandbench.com/news/litigation/section-498a-ipc-cruelty-husband-misused-jharkhand-high-court\n\nhttps://www.livelaw.in/high-court/gujarat-high-court/gujarat-high-court-quashes-fir-misuse-section-498a-231331\n\nhttps://www.barandbench.com/news/section-498a-often-misused-to-pressurise-husbands-family-orissa-high-court\n\nhttps://indianexpress.com/article/india/sec-498a-being-used-to-settle-personal-scores-against-husband-his-kin-sc-7763471/",
        "You’re wrong again. \n\nhttps://lawrato.com/indian-kanoon/ipc/section-498a\n\nIf you go to the link, you’ll find the procedure for filing the complaint. You will also see that there’s a requirement for FIR, evidences upon which the officers investigate and determine if the accusation is fake or not. \n\nThe boy was found guilty of assaulting the girl by the police. Either you’re cooking up the story or you were fed with lies",
        "All of these articles have paywalls to read full article. Get ones without pay wall",
        "Slow ?? It’s crawling like a toddler without direction or purpose!\n\nAnd the police force, forget about it. It’s like getting involved with them is a nightmare in itself. Most of them illogical beings who only to profess about some bullshit philosophy or corrupt to the core.\n\nWho would want to involve in these situations when someone else would quite easily raise an FIR for defamation when we whistle when we are trying to change the system for fairer laws ?\n\nYes the system isn’t perfect, but who would even read this line anyways unless I put an emoji like this 😉",
        "The last article said the some cases have been dismissed upon finding lack of evidences. So what?",
        "I can share the case number if you want. Evidence was there since she beat herself up. Accused can always defend themselves but in this section police resort to immediate arrest because people will pay bribes to stop their family to go to jail.  \nSimilarly for rape. The mere statement of women that consent was absent is enough. These have been changed by SC and in future all PS will learn proper course of action to protect both parties. Until then we will have collateral damage.  \nAt this point I don't know what are you defending?? It is well settled that women misuse this law and SC has taken action, action from parliament is missing.  \nYou are very butt hurt by your father's episode and I understand that it may be so because these are individual episodes and so was your's.  \nPolice in India cannot be trusted, they have  lot's of tricks to harass and take bribes even though they know that the case will not stand in court. They do it because there will be no action against them. It seems you are not aware of how the system functions and blindly opposing anything because of previous experiences in life.",
        "Please do share. 😬  \n\nIf there were evidence of her beating herself and police chose to take immediate arrest then it’s the police’s fault. Not the laws. \n\nLol. “Mete statement is enough”? If that was case, how did these happen?\n\nhttps://www.bbc.com/news/world-asia-india-61317076.amp\n\nhttps://www.reuters.com/article/india-delhi-gang-rape-women-safety-polic-idINDEE90F0AY20130116\n\nhttps://www.bbc.com/news/world-asia-india-37868767.amp",
        ">Seriously you think police would just arrest people like that?\n\nHaha. Of course they do. You haven't seen much, nothing wrong with that. This sounds like such a streamlined thing, clearly you've never dealt with anything close to it lol.",
        "I will go through the links. It seems you are immature.  \nHow will police know she beat herself up?? You have turned this conversation into a joke.I will take my leave here since you are just trolling it seems.  \nGet serious in life.",
        "Haha, which world do you live in mate.\n\nYou've never dealt with it I'd assume. Police pick up the guy before anything, moreover, it's a non-bailable offense. (incoming long paragraphs lol).\n\nYou've made it sound such a streamlined process lol, how delusional.",
        "All the links you posted doesn't change anything about the misuse of law. It seems you are not aware of how law functions.",
        "What do you mean by misusing? I know you are lying because you didn’t mention the evidence or the bribe until now. You’re changing the story. You don’t even know the procedure of filing the complaint and the investigation. \n\nIf police are so welcoming around the woman who want to file a charge against rape, why are there women still afraid to report the rape? Why are there police humiliating them? \n\nhttps://www.livemint.com/Politics/AV3sIKoEBAGZozALMX8THK/99-cases-of-sexual-assaults-go-unreported-govt-data-shows.html?facet=amp\n\nYou are obviously butthurt by the laws taking actions against men that you are cooking up stories about fake accusations.",
        "Yes, I dealt with personally. No police ever arrested them the minute the case was filed. Yes, it’s a non bailable offence. You think the court give a slack the guilty ? Lol. (Incoming long paragraphs lol)",
        "Yes, it does. You just don’t want to admit it 🤡",
        "Sister you are out of depth here. The problems you are saying is faced by poor people. If you can afford 10k expenses which includes hiring a lawyer and court fees then police will take action otherwise they won't. There are lot of good officers where women have got justice but that experience is not shared across the country which is evident from the news reports you are sharing and court and parliament action regarding it. The same cannot be said for victims of 498a or 270.",
        "Then we have to agree to disagree because I am failing to understand your point.",
        "Dude, you said there were evidences of her beating up. Now you are telling me there’s none? Lol. I knew you were lying.",
        "So the problem is with the corrupt police. Not with the law. How do you those women in the articles I shared were poor people? Their identities weren’t revealed.",
        "This is a recognized issue. Police ask for money to take action. There are news articles, court citing, various activist and women help groups formed to help victims of backward socio economic background. What you are sharing is already known and I am not denying it.  \nHumans are by nature corrupt but law is on the side of police when they resort to automatic arrest without warrant. This has to be rectified not by removing the law but by amending it so that the accused is not put behind bars automatically.  \nAlso I am not in favor of action against complainant because I know how tough it is to prove in court.",
        "It's not argument about whether a guilty person should be in prison or not, that's obvious, but on the non-guilty person being put behind bars. You have made big generalisations and written long paragraphs already to win some online argument, you aren't worth wasting any time on.",
        "Of course they are. Stop empowering them so much.",
        "political goons. cant stop them. my friend lives in a gated community with security and yet...his dad had multiple strokes as a direct result of this and ultimately took him."
    ],
    "cleaned_text": "women unleashed legal terrorism misusing section ipc calcutta high court shocked pikachu face ",
    "cleaned_title": "women unleashed legal terrorism misusing section ipc calcutta high court",
    "cleaned_selftext": "shocked pikachu face",
    "cleaned_comments": "xb shocked shocked say ipc law prescribes imprisonment dowry complaint woman regardless legitimacy complaint claim woman misuses provisions nonsense issue like many issues country rush legislate dont bother implementation implications shoddy police work problem lets invoke uapa psa well entrenched man walked free case lets make non bailable law fact dont really care issuesnot really want show acted personal experience apply punishment see charged pending investigation freed true everything doesnt really said make nonsense laws easily misused see getting misused finally coming slumber bigger problem corruptible police force arrest random reasons law abiding people would rather pay bribes fines rather dealing opaque slow legal system problem seen cases honest man suffer wife eloped bf wife good family background able hire good lawyers lobby stuff make husband pay investigation forever pending india know know marriages abuse yet idiotic men want victims literally didnt say anything either way cases men victim supposed accepted people like impossible understand gaand mein se nikaal ke dimaag sir mein lagao thoda marriage rate fall something since courts started caring men talking men family calm actually think came laws believing people responsibly use group women benefited able take advantage ones go know men personally whose lives ruined chose settle monetary payments saved judge last minute evidence favor fighting refuse bend written book called bitter half started non profit advise men like latter childhood friend breaks heart see much trouble lost father recently girls family wouldnt stop harrassments kept sending goons place talking indian men general vast majority creeps assholes think males family minority everyone creep except father brother thats said edited reply men family role models life especially father yeah would always speak generalizing generalization help saying men cant victims crime many commit acts like saying scammer many found scammers doesnt help people like impossible understand gaand mein se nikaal ke dimaag sir mein lagao thoda bro woke chose violence hate go low hanging fruit youre frequent poster rautism dont feel discourse would lead anything productive watched daawateishq decided enact reality better let guilty roam free one innocent punished think thats bad thing lol bro autistics immune idiotic hateful propaganda like post neurotypicals get crazy mob misogynists also ableist surprise youre trash bag person accept without trying even avoid responsibility saying hate dick im going anyway jail women punishment freed seems fair right whats full story dont wan na sign laws protecting women harassment nonsense whoever husband relative husband woman subjects woman cruelty shall punished imprisonment term may extend three years shall also liable fine explanationfor purposes section cruelty means anywilful conduct nature likely drive woman commit suicide cause grave injury danger life limb health whether mental physical woman op big liar whoever husband relative husband woman subjects woman cruelty shall punished imprisonment term may extend three years shall also liable fine explanationfor purposes section cruelty means anywilful conduct nature likely drive woman commit suicide cause grave injury danger life limb health whether mental physical woman code want know exactly misuse law theres requirement proof abuse lawyer exactly rules protect false accusations op want dramatic giving unchecked legal power mean unchecked legal power theres investigations trials legitimacy case lol way google search procedure law commenting nonsense nonbailable offence made bailable lol grounds falsely accused prove innocence bail gives temporary release give chance prove guilty misuse legal provision including section concern important ensure legal processes followed correctly accusations based genuine grievances misuse harm innocent individuals undermine credibility legal system even look link shared court ask evidence abuse upon investigate arrest court agree accusations true investigation accused also defend part lawyer believe falsely accused seriously think police would arrest people like let try explain short introduced end dowry deaths e women forced commit suicide tortured near death cases police expected act proactively minimal input essentially lead breakdown society thus qualification requirement abuse needs met file fir plaintiff assumed police prevent abuse however convict defendant criterias met mentioned wording section comes court innocent jail weeksmonths matter finally come hearing judicial magistratesessions judge realize exists proof crime first place innocent released end courts frustrated bad laws time court step help quashdischarge case monthsyears may passed often late many innocents forced commit suicide also dont understand procedure mean section crpc talking care read link question clearly states police arrest people indiscriminately without warrant court upon inkling thats needed complaint woman question point ii trial court procedure section stated trial criminal court procedure initiated instance fir police complaint detailed trial procedure given fir first information report police complaint first step police complaint first information report covered section code criminal procedure fir puts entire case motion investigation report officer second step fir investigation investigation officer examination facts circumstances collection evidence examination persons necessary steps officer completes investigation prepares investigation read tell mean theres requirement evidence innocent jail dude court wont arrest accused unless investigation proves hes innocent youre making realize im repeating police arrest immediately without warrant secondly get started crpc first step mere oral complaint complainant give proof either youre misunderstanding youre denying facts youre afraid people facing consequences actions police arrest accused without warrant investigation proves hes guilty smell controversy building ups ipc nbco non bailable cognizable offence cognizable offence one means police arrest anyone without warrant needing courts permissionassessment clear understanding legal system simply basing arguments google refrain commenting wish best trial court procedure section stated trial criminal court procedure initiated instance fir police complaint detailed trial procedure given fir first information report police complaint first step police complaint first information report covered section code criminal procedure fir puts entire case motion investigation report officer second step fir investigation investigation officer examination facts circumstances collection evidence examination persons necessary steps officer completes investigation prepares investigation chargesheet magistrate police files charge sheet magistrate chargesheet consists criminal charges accused arguments court framing charges fixed date hearing magistrate hears parties arguments charges set finally frames charges plea guilty section code criminal procedure talks plea guilty framing charges accused given opportunity plead guilty responsibility lies judge ensure plea guilt voluntarily made judge may upon discretion convict accused evidence prosecution framing charges accused pleading guilty evidence first given prosecution upon burden proof initially generally lies oral documentary evidence produced magistrate power issue summons person witness order produce document cross examination witnesses accusedcounsel witnesses prosecution produced court cross examined accused hisher counsel evidence accused defence accused evidence presented courts stage heshe given opportunity make hisher case stronger however since burden proof prosecution ie alleged victim accused required present evidence cross examination witness prosecution witnesses produced defence crossexamined prosecution conclusion evidence court presented evidence sides evidence concluded courtjudge oral final arguments final stage nearing judgement stage final arguments parties take turns first prosecution defence make final oral arguments front judge judgement court based upon facts circumstances case upon arguments made evidence produced court gives final judgement court gives reasons support acquittal conviction accused pronounces final order acquittal conviction accused held guilty heshe convicted held notguilty accused acquitted final judgement convicted hearing quantum sentence accused held guilty convicted hearing take place decide quantum extent sentence jail time appeal higher courts appeal higher courts made scenario allows sessions court appeal made high court high court supreme court person held guilty section ipc person held guilty section ipc important prosecution compulsorily prove following woman married section protects women unruly cruel behaviour gets meted marital home woman subject cruelty harassment cruelty discussed take myriad forms cruelty harassment suffered hands husband inlaws arrest section ipc automatic came time arrests section ipc became unnecessarily rampant routinely automatic effected menacing motives disgruntled wives rather effective tools aid police investigation malpractice eventually checked supreme court india passage judgements like arnesh kumar v state bihar rajesh sharma v state uttar pradesh wherein honble court clearly recognising gross misuse section ipc issued guidelines police making arrests accordingly investigating case police instead carrying automatic arrest accused mandated issue notice section crpc join ongoing investigation offence arrests mandated carried section ipc accused continues join investigation called hence thus unnecessary arrests police curbed court however fir registered better recommended take anticipatory bail accused moves court anticipatory bail certain conditions may imposed court upon himher depositing demand draft certain amount name wife dependents part maintenance etc could one conditions exists specific provision maintenance wife child conditional anticipatory bail granted section would go law may missed comment pasted arrest made accused comply investigation day need proof though isnt every law supposed standing humble opinion means statement law self supporting sentence please explain law doesnt stand anyone could charged without trial investigation law didnt answer question though say dont need proof go procedure complaint read weep kept sending goons place yeah id definitely get door peephole extra iron grill lock outside main door atleast gun deal goons always love watching meltdown youre oozing much hate carrying lot negativity chest must burdensome heres hoping live life free victimhood falsehoods men decent individuals wtf yo dude thanks link youre totally fuckin right complaint fir registered investigated brought front magistrate brings trial evidence provided theres idea police pick husband inlaws put jail happened neighbors parents keep assuming never fault fact downvotes shows pervasive misogyny know right look stopped talking throw facts faces morons whining law misused without researching ridiculous dont care truth justice hate cant control women cant get away law force control casual rate spousal abuse taken india fucking terrible mentalflight person needs calm woman walks police station say husband laws mistreating dowry police put behind bars immediately dude please dont lie police didnt shit mother pleaded protection fathers abuse generally make good case girl first went moms place broke stuff asked mom slap went ps filed boy arrested immediately sc advisory mandatory discretion officer arrest made physical violence involved fake complaints lost court earlier lot social stigma attached people started ignoring families complaint filed things changed misuse continues due lack policy calcutta jharkhand gujarat odisha supreme court echoing thing youre wrong go link youll find procedure filing complaint also see theres requirement fir evidences upon officers investigate determine accusation fake boy found guilty assaulting girl police either youre cooking story fed lies articles paywalls read full article get ones without pay wall slow crawling like toddler without direction purpose police force forget like getting involved nightmare illogical beings profess bullshit philosophy corrupt core would want involve situations someone else would quite easily raise fir defamation whistle trying change system fairer laws yes system isnt perfect would even read line anyways unless put emoji like last article said cases dismissed upon finding lack evidences share case number want evidence since beat accused always defend section police resort immediate arrest people pay bribes stop family go jail similarly rape mere statement women consent absent enough changed sc future ps learn proper course action protect parties collateral damage point dont know defending well settled women misuse law sc taken action action parliament missing butt hurt fathers episode understand may individual episodes police india trusted lots tricks harass take bribes even though know case stand court action seems aware system functions blindly opposing anything previous experiences life please share evidence beating police chose take immediate arrest polices fault laws lol mete statement enough case happen seriously think police would arrest people like haha course havent seen much nothing wrong sounds like streamlined thing clearly youve never dealt anything close lol go links seems immature police know beat turned conversation jokei take leave since trolling seems get serious life haha world live mate youve never dealt id assume police pick guy anything moreover nonbailable offense incoming long paragraphs lol youve made sound streamlined process lol delusional links posted doesnt change anything misuse law seems aware law functions mean misusing know lying didnt mention evidence bribe youre changing story dont even know procedure filing complaint investigation police welcoming around woman want file charge rape women still afraid report rape police humiliating obviously butthurt laws taking actions men cooking stories fake accusations yes dealt personally police ever arrested minute case filed yes non bailable offence think court give slack guilty lol incoming long paragraphs lol yes dont want admit sister depth problems saying faced poor people afford k expenses includes hiring lawyer court fees police take action otherwise wont lot good officers women got justice experience shared across country evident news reports sharing court parliament action regarding said victims agree disagree failing understand point dude said evidences beating telling theres none lol knew lying problem corrupt police law women articles shared poor people identities werent revealed recognized issue police ask money take action news articles court citing various activist women help groups formed help victims backward socio economic background sharing already known denying humans nature corrupt law side police resort automatic arrest without warrant rectified removing law amending accused put behind bars automatically also favor action complainant know tough prove court argument whether guilty person prison thats obvious nonguilty person put behind bars made big generalisations written long paragraphs already win online argument arent worth wasting time course stop empowering much political goons cant stop friend lives gated community security yethis dad multiple strokes direct result ultimately took",
    "light_cleaned_title": "Women have unleashed \"legal terrorism\" by misusing Section 498A IPC: Calcutta High Court",
    "light_cleaned_selftext": "*shocked Pikachu face*",
    "light_cleaned_comments": "&#x200B; I am shocked! Shocked I say!! What is 498 ipc? Law that prescribes imprisonment for any dowry complaint by a woman, regardless of legitimacy of such complaint. To claim that no woman misuses the provisions is nonsense. The issue , like many of the issues in our country, is that we rush to legislate and don't bother about the implementation or implications. Shoddy police work, no problem, let's invoke UAPA or PSA . A well entrenched man walked free from a case, let's make a non bailable law. The fact is that we don't really care about the issues,not really, all we want to do is to show that we have acted. Was it? In my personal experience they apply the punishment but see if it's being charged or not. Pending investigation. They can be freed after that. That is true for everything, so doesn't really have to be said. Make nonsense laws which can be easily misused See them getting misused 😮 Finally coming out of the slumber, are we? The bigger problem is we have a corruptible police force who can arrest you for random reasons. And law abiding people would rather pay bribes or fines rather than dealing with our opaque and slow legal system. Problem is I have seen some cases where honest man had to suffer because his wife eloped with her BF and has the wife had good family background, they were able to hire good lawyers and lobby and stuff to make the husband pay for it.. Investigation are forever pending in India. You know that. You know that 95% of marriages have abuse and yet the idiotic men want to be the victims I literally didn't say anything either way. So the cases where Men are victim are supposed to be just accepted as such? People like you are impossible to understand. Gaand mein se nikaal ke dimaag sir mein lagao thoda. Did marriage rate fall or something? Since when did the courts started caring about men We are not talking about the men in your family. Calm down. Actually I think they came up with these laws believing that people will responsibly use these. But the group of women who should have benefited from it are not able to take advantage and the ones who can, go all out. I know 5 men personally whose lives are ruined because of this. 2 chose to settle with monetary payments, 1 saved by the judge because of some last minute evidence in his favor, 2 are fighting on and refuse to bend. 1 has written a book called bitter half and the other has started a non profit to advise other men like him. The latter is a childhood friend and breaks my heart to see him in so much trouble. Lost his father recently because the girls family just wouldnt stop harrassments and kept sending goons at their place. We’re talking about Indian men in general. The vast majority of the creeps and assholes And why do you think the males in your family are the minority? Everyone is a creep except your father or brother? That’s not what I said You edited the reply. And no, men in my family are the role models of my life. Especially my Father, so yeah I would always speak against generalizing. Generalization will not help. Saying men can't be victims of this crime because many do commit such acts Is like saying you are a scammer because many have been found to be scammers. Doesn't help at all. >People like you are impossible to understand. Gaand mein se nikaal ke dimaag sir mein lagao thoda. Bro woke up and chose violence. Hate to go for the Low hanging fruit but you're a frequent poster in r/autism I don't feel any further discourse with you would lead to anything productive. They watched Daawat-e-Ishq and decided to enact in reality Better to let 10 guilty roam free then to have one innocent punished You think that’s a bad thing? lol bro autistics are more immune to idiotic hateful propaganda like this post. It’s neurotypicals who get crazy in a mob Misogynists are also ableist what a surprise. You’re a trash bag of a person and should accept that about yourself without trying to even avoid responsibility for it by saying “I hate to be a dick but I’m going to anyway” How about we jail the women with the same punishment after they are freed ? Seems fair right ? Whats the full story? (i don’t wanna sign up) So laws protecting women from harassment is nonsense? 1[Whoever, being the husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished with imprisonment for a term which may extend to three years and shall also be liable to fine. Explanation.—For the purposes of this section, \"cruelty means\"— (a) anywilful conduct which is of such a nature as is likely to drive the woman to commit suicide or to cause grave injury or danger to life, limb or health (whether mental or physical) of the woman; or OP is a big liar. 1[Whoever, being the husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished with imprisonment for a term which may extend to three years and shall also be liable to fine. Explanation.—For the purposes of this section, \"cruelty means\"— (a) anywilful conduct which is of such a nature as is likely to drive the woman to commit suicide or to cause grave injury or danger to life, limb or health (whether mental or physical) of the woman; or This is 498a code. I want to know how can you exactly misuse this law when there’s a requirement for proof of abuse. Are you a lawyer? Exactly. There are rules to protect against false accusations. It is. OP just want to be dramatic No. But giving unchecked legal power is What do you mean by unchecked legal power? There’s investigations and trials for the legitimacy of the case. Are you? Lol By the way, you have google to search for the procedure of the law before commenting nonsense 498a is non-bailable offence. It should be made bailable Lol. On what grounds? If he is falsely accused then how will he prove his innocence ? Bail gives temporary release and this will give him a chance to prove that he is not guilty Misuse of any legal provision, including Section 498A, is a concern. It's important to ensure that legal processes are followed correctly and that accusations are based on genuine grievances. Misuse can harm innocent individuals and undermine the credibility of the legal system. Did you even look at the link I shared? 🤦‍♀️ The court ask for evidence of abuse upon which they investigate. They will only arrest if the court agree the accusations are true after the investigation. The accused can also defend their part with a lawyer if they believe they are falsely accused. Seriously you think police would just arrest people like that? Let me try to explain this in short. 498A was introduced to end dowry deaths I. E. women forced to commit suicide or tortured to near death. In such cases, police is expected to act proactively and with minimal input, as they essentially lead to a breakdown of society. Thus there is no qualification or requirement of abuse that needs to be met to file FIR by the plaintiff, as it is assumed police is doing so to to prevent such abuse. However, to convict the defendant, there are criterias to be met, as mentioned in the wording of the section. Now, when it comes to Court and the innocent has been in jail for a few weeks/months and the matter finally come to hearing to the Judicial Magistrate/Sessions Judge, they realize that there exists no proof of such crime in the first place, and the innocent is released. Which is why you end up with Courts frustrated with bad laws. By the time Court can step in to help and quash/discharge the case, months/years may have passed. Often, it is too late and many innocents are forced to commit suicide. Also, I don't understand what procedure you mean. Which section of CrPC are you talking about? If you care to read your own link, question 17 clearly states the police can arrest people indiscriminately and without a warrant from Court upon inkling of 498A. All that's needed is a complaint from the woman (Question 14, point ii). “Trial / Court Procedure under Section 498A As has been stated before, the trial or a criminal court procedure is initiated with the instance of an FIR or a police complaint. The detailed trial procedure has been given below: FIR (First Information Report) / Police complaint: the first step is a Police Complaint or a First Information Report. This is covered under Section 154 of the Code of Criminal Procedure. An FIR puts the entire case into motion. Investigation and Report by Officer: The second step after the FIR, is investigation by the Investigation Officer. After the examination of the facts and circumstances, collection of evidence, and examination of persons and other necessary steps, the officer completes the investigation and prepares the investigation.” Read this and tell me what do you mean by “there’s no requirement of evidence” “Innocent has to be in jail”? dude, the court won’t arrest the accused unless the investigation proves he’s not innocent. You’re making this up. You do realize, and I'm repeating myself here, that in 498A, the police can arrest immediately and without warrant. And that secondly, to get this started 154 CrPC is the first and only step (mere oral complaint by complainant). Give me the proof of it. Either you’re misunderstanding or you’re denying the facts because you’re afraid of people facing consequences of their actions The police will arrest the accused without warrant IF the investigation proves he’s guilty I can smell a controversy building ups Once again, 498A of IPC is a NBCO (Non Bailable and Cognizable Offence). A Cognizable Offence is one which means the police will arrest anyone without a warrant or needing Court's permission/assessment. It's clear you have no understanding of the legal system and are simply basing your arguments on Google. I will refrain from commenting further. Wish you the best. ## Trial / Court Procedure under Section 498A As has been stated before, the trial or a criminal court procedure is initiated with the instance of an FIR or a police complaint. The detailed trial procedure has been given below: 1. **FIR (First Information Report) / Police complaint:** the first step is a Police Complaint or a First Information Report. This is covered under Section 154 of the Code of Criminal Procedure. An FIR puts the entire case into motion. 2. **Investigation and Report by Officer:** The second step after the FIR, is investigation by the Investigation Officer. After the examination of the facts and circumstances, collection of evidence, and examination of persons and other necessary steps, the officer completes the investigation and prepares the investigation. 3. **Charge-sheet before Magistrate:** The police then files the charge sheet before the magistrate. The charge-sheet consists of all the criminal charges against the accused. 4. **Arguments before Court and Framing of Charges:** On the fixed date of hearing, the Magistrate hears the parties’ arguments on the charges that have been set and then finally frames the charges. 5. **Plea of guilty:** Section 241 of the Code of Criminal Procedure, 1973 talks about the plea of guilty, after framing of the charges the accused is given an opportunity to plead guilty, and the responsibility lies with the judge to ensure that the plea of guilt was voluntarily made. The judge may upon its discretion convict the accused. 6. **Evidence by Prosecution:** After the framing of the charges and the accused pleading ‘not guilty’, the evidence is first given by the Prosecution, upon whom the burden of proof initially (generally) lies. Both oral and documentary evidence can be produced. The magistrate has the power to issue summons to any person as a witness or order him to produce any document. 7. **Cross Examination of Witnesses by Accused/Counsel:** Witnesses of the prosecution when produced before the court are cross examined by the accused or his/her counsel. 8. **Evidence by Accused if any, in defence:** If the accused has any evidence, it is presented to the Courts at this stage. He/she is given this opportunity to make his/her case stronger. However, since the burden of proof is on the prosecution i.e. the alleged victim, the accused is not required to present evidence. 9. **Cross Examination of Witness by Prosecution:** If witnesses are produced by the defence, they will be cross-examined by the Prosecution. 10. **Conclusion of Evidence:** Once the court has been presented with evidence from both sides, the evidence is concluded by the Court/Judge. 11. **Oral / Final Arguments:** The final stage, nearing the judgement is the stage of final arguments. Here, both parties take turns (first, the prosecution and then the defence) and make final oral arguments in front of the judge. 12. **Judgement by the Court:** Based upon the facts and circumstances of that case, and upon the arguments made and evidence produced, the Court gives its final judgement. The Court gives its reasons in support of the acquittal or conviction of the accused and pronounces its final order. 13. **Acquittal or Conviction:** If the accused is held guilty, he/she is convicted and if held ‘not-guilty’, the accused is acquitted in the final judgement. 14. **If Convicted, Hearing on Quantum of Sentence:** If the accused is held guilty and convicted, a hearing will take place to decide the quantum or extent of the Sentence or jail time. 15. **Appeal to Higher Courts:** An appeal to Higher Courts can be made if the scenario allows it. From Sessions court, an appeal can be made to the High Court and from High Court, to the Supreme Court. ## When Can A Person Be Held Guilty Under Section 498A, IPC? For a person to be held guilty under Section 498A, IPC it is important for the prosecution to compulsorily prove the following: 1. That the woman is married. This Section protects women from unruly and cruel behaviour that gets meted out to her in her marital home. 2. That the woman is subject to cruelty or harassment. Cruelty as discussed above can take on myriad forms. 3. That such cruelty or harassment is suffered by her at the hands of her husband or her in-laws or both. ## Is An Arrest Under Section 498a, Ipc, Automatic? There came a time when arrests under Section 498A, IPC became unnecessarily rampant and routinely automatic. They were effected with the menacing motives of disgruntled wives rather than as effective tools to aid police investigation. This malpractice was eventually checked by the Supreme Court of India, with the passage of judgements like Arnesh Kumar v. State of Bihar (2014) and Rajesh Sharma v. State of Uttar Pradesh (2017), wherein the Hon’ble Court while clearly recognising the gross misuse of Section 498A, IPC, issued guidelines to the Police while making arrests under the same. Accordingly, while investigating a 498A case, the Police instead of carrying out an automatic arrest of the accused are mandated to issue a notice to him under Section 41A, CrPC to join the ongoing investigation into the offence. Arrests are not mandated to be carried out under Section 498A, IPC if the accused continues to join such investigation, as and when called to do so. Hence, it was thus that unnecessary arrests by the Police were curbed by the Court. However, once the FIR is registered, it is better recommended to take anticipatory bail. When the accused moves the court for anticipatory bail, certain conditions may be imposed by the court upon him/her. Depositing a demand draft of a certain amount in the name of the wife or other dependents as a part of maintenance etc. could be one of the conditions. But, when there exists a specific provision for maintenance of wife and child, such conditional anticipatory bail granted under section 498A would go against the law. You may have missed the comment I pasted. The arrest are made when the accused to do not comply with the investigation. where does it day you need proof though? isnt every law supposed to be standing on its own? that , in my very very very humble opinion, means that the statement of the law has to be a self supporting sentence. Can you please explain this to me? No. The law doesn’t stand on its own. If it does, anyone could be charged without trial or investigation for any law. You didn’t answer my question though. Where does it say it you don’t need proof. Go to the procedure of the complaint. Read it and weep. > kept sending goons at their place. Yeah, I'd definitely get a door peephole, extra iron grill with a lock outside the main door, and atleast 1 gun to deal with goons. I always love watching a meltdown You're oozing with so much hate and carrying a lot of negativity on your chest, which must be burdensome. Here's to hoping you live a life free of victimhood and falsehoods, as most men are decent individuals. Wtf Yo dude thanks for this link! You’re totally fuckin’ right - the complaint and FIR are registered, investigated and then brought in front of a magistrate who brings it to trial if evidence is provided. There’s this idea that the police will just pick up the husband or in-laws and put them in jail. Happened to my own neighbors, but my parents keep assuming they were never at fault. The fact that you have 22 downvotes shows you how pervasive this misogyny is. I know I am right. Look at how they stopped talking when I throw the facts at their faces. How the morons were whining about how the law is “misused” without researching is ridiculous. They don’t care about truth or justice. They hate that they can’t control women and they can’t get away from law if they force control over them. The casual rate at which spousal abuse is taken in India is fucking terrible. This mental_flight person needs to calm down😂 If a woman walks into the police station and say that her husband and in laws are mistreating her for dowry , police can put them behind bars immediately. Dude, Please don’t lie. Police didn’t do shit when my mother pleaded for their protection against my father’s abuse. Generally you will have to make a good case. A girl first went to her mom's place and broke some stuff asked her mom to slap her and went to PS and filed 498a. The boy was arrested immediately. SC advisory is not mandatory so it's the discretion of the officer. The arrest are made when physical violence is involved and fake complaints are lost in court but earlier there was lot of social stigma attached to it. People started ignoring the families against whom the complaint was filed. Things have changed now. But the misuse continues due to lack of policy Then why Calcutta, Jharkhand, Gujarat, Odisha, Supreme Court are echoing the same thing ? You’re wrong again. If you go to the link, you’ll find the procedure for filing the complaint. You will also see that there’s a requirement for FIR, evidences upon which the officers investigate and determine if the accusation is fake or not. The boy was found guilty of assaulting the girl by the police. Either you’re cooking up the story or you were fed with lies All of these articles have paywalls to read full article. Get ones without pay wall Slow ?? It’s crawling like a toddler without direction or purpose! And the police force, forget about it. It’s like getting involved with them is a nightmare in itself. Most of them illogical beings who only to profess about some bullshit philosophy or corrupt to the core. Who would want to involve in these situations when someone else would quite easily raise an FIR for defamation when we whistle when we are trying to change the system for fairer laws ? Yes the system isn’t perfect, but who would even read this line anyways unless I put an emoji like this 😉 The last article said the some cases have been dismissed upon finding lack of evidences. So what? I can share the case number if you want. Evidence was there since she beat herself up. Accused can always defend themselves but in this section police resort to immediate arrest because people will pay bribes to stop their family to go to jail. Similarly for rape. The mere statement of women that consent was absent is enough. These have been changed by SC and in future all PS will learn proper course of action to protect both parties. Until then we will have collateral damage. At this point I don't know what are you defending?? It is well settled that women misuse this law and SC has taken action, action from parliament is missing. You are very butt hurt by your father's episode and I understand that it may be so because these are individual episodes and so was your's. Police in India cannot be trusted, they have lot's of tricks to harass and take bribes even though they know that the case will not stand in court. They do it because there will be no action against them. It seems you are not aware of how the system functions and blindly opposing anything because of previous experiences in life. Please do share. 😬 If there were evidence of her beating herself and police chose to take immediate arrest then it’s the police’s fault. Not the laws. Lol. “Mete statement is enough”? If that was case, how did these happen? >Seriously you think police would just arrest people like that? Haha. Of course they do. You haven't seen much, nothing wrong with that. This sounds like such a streamlined thing, clearly you've never dealt with anything close to it lol. I will go through the links. It seems you are immature. How will police know she beat herself up?? You have turned this conversation into a joke.I will take my leave here since you are just trolling it seems. Get serious in life. Haha, which world do you live in mate. You've never dealt with it I'd assume. Police pick up the guy before anything, moreover, it's a non-bailable offense. (incoming long paragraphs lol). You've made it sound such a streamlined process lol, how delusional. All the links you posted doesn't change anything about the misuse of law. It seems you are not aware of how law functions. What do you mean by misusing? I know you are lying because you didn’t mention the evidence or the bribe until now. You’re changing the story. You don’t even know the procedure of filing the complaint and the investigation. If police are so welcoming around the woman who want to file a charge against rape, why are there women still afraid to report the rape? Why are there police humiliating them? You are obviously butthurt by the laws taking actions against men that you are cooking up stories about fake accusations. Yes, I dealt with personally. No police ever arrested them the minute the case was filed. Yes, it’s a non bailable offence. You think the court give a slack the guilty ? Lol. (Incoming long paragraphs lol) Yes, it does. You just don’t want to admit it 🤡 Sister you are out of depth here. The problems you are saying is faced by poor people. If you can afford 10k expenses which includes hiring a lawyer and court fees then police will take action otherwise they won't. There are lot of good officers where women have got justice but that experience is not shared across the country which is evident from the news reports you are sharing and court and parliament action regarding it. The same cannot be said for victims of 498a or 270. Then we have to agree to disagree because I am failing to understand your point. Dude, you said there were evidences of her beating up. Now you are telling me there’s none? Lol. I knew you were lying. So the problem is with the corrupt police. Not with the law. How do you those women in the articles I shared were poor people? Their identities weren’t revealed. This is a recognized issue. Police ask for money to take action. There are news articles, court citing, various activist and women help groups formed to help victims of backward socio economic background. What you are sharing is already known and I am not denying it. Humans are by nature corrupt but law is on the side of police when they resort to automatic arrest without warrant. This has to be rectified not by removing the law but by amending it so that the accused is not put behind bars automatically. Also I am not in favor of action against complainant because I know how tough it is to prove in court. It's not argument about whether a guilty person should be in prison or not, that's obvious, but on the non-guilty person being put behind bars. You have made big generalisations and written long paragraphs already to win some online argument, you aren't worth wasting any time on. Of course they are. Stop empowering them so much. political goons. cant stop them. my friend lives in a gated community with security and yet...his dad had multiple strokes as a direct result of this and ultimately took him."
}