{
    "id": "12rt4o5",
    "title": "Korean Blogger Harassment by Indian Boy",
    "url": "https://www.reddit.com/r/india/comments/12rt4o5/korean_blogger_harassment_by_indian_boy/",
    "selftext": "\" **Korean Blogger Harassment Caught on Camera: Jodhpur Pervert Arrested** \"\n\nCopying from description of the video\n\n[Korean Blogger Harassment Caught on Camera: Jodhpur Pervert Arrested - YouTube](https://www.youtube.com/watch?v=8VoPVGboJ2Y)\n\n\" **On Monday evening, a foreign tourist who claimed to be a Korean national was allegedly harassed in Jodhpur, Rajasthan. The victim, a Korean blogger, was reportedly shooting a video of herself while walking on the city's famous blue streets when she was followed by a man wearing a blue T-shirt and black shorts.  The video footage shows the man initially following the girl, who seemed to be in high spirits, until he starts harassing her by exposing his private parts. The girl can be seen running away from the man while shouting for help, as the man can be heard laughing behind her.  The incident has sparked outrage among the public, with many condemning the act and demanding immediate action against the perpetrator. The police have registered a case under relevant sections of the Indian Penal Code and are actively investigating the matter. The accused has been identified, and efforts are underway to arrest him.  The incident highlights the need for more stringent measures to ensure the safety and security of foreign tourists in India. It is essential to create awareness and sensitize people towards such acts of harassment and make them realize that such behavior is unacceptable and will not be tolerated. The tourism industry is a significant contributor to India's economy, and incidents like these can have a significant impact on the country's reputation as a safe and welcoming destination.  Tourism authorities should take steps to ensure the safety of tourists and create a conducive environment for them. The government should also take stringent measures to punish those found guilty of such crimes to deter others from engaging in similar behavior. It is crucial to make tourists feel safe and secure so that they can enjoy their stay in the country and spread positive word of mouth. Only then can India truly fulfill its potential as a leading tourist destination.** \"",
    "flair": "Crime",
    "score": 28,
    "num_comments": 21,
    "created_utc": 1681910543.0,
    "convurl": "https://external-preview.redd.it/KBJagDBD9mkAWNxK9zjIiTN2ircG9YaazXeKsG0w2cI.jpg?auto=webp&v=enabled&s=e1c96a8061061f64d272046919a7837a7401686c",
    "comments": [
        "It is utterly disgusting.",
        "There a bunch of people in the linked youtube video bringing up religion in the comments, does no one understand that religion isn't the bloody point, they're pointing fingers at things that don't matter in the current situation, the problem is different and I don't see how the guy's religion is supposed to change anything.",
        "Fuck this shithole",
        "Seriously. Internet and Indians don’t gel. We just don’t deserve it",
        "Typical bhartiya mard on a daily basis. Nothing new.",
        "How can u generalize like that ?",
        "What a pathetic state of affairs. No wonder foreign countries issue clothing guidelines and other warnings.",
        "Religion is the new cancer that the nation is addicted too. First thing in any incident is religion if it's yours then you try to justify it, if it's the other one then you ridicule it. The cance keeps spreading",
        "jane de bhai yaha ke mardo ne sach me izzat ka bsda kar dia hai, bahar ke desh me yahi tera stereotype banega tu kuch nahi kar sakta.",
        "are its not only in india\n\nporn has ruined a lot of us",
        "\"new\"?",
        "On a daily basis women are harassed like that.",
        "No, specifically getting sexually harassed is the story of every Indian women and little girls every single day. This is because there’s very widespread misogyny and toxic patriarchy in this country.",
        "Yes every woman and even little girls get harassed. It’s a fact, wake up to it.\n\nNothing to do with politics, this was fact 40 years ago in my mom’s time, 20 years ago and is still there. This is a social problem not political, of course none of the governments talk about it, media wakes up only when some gruesome tape murder happens only selective ones while similar ones go unnoticed. \n\nEvery single woman goes through a lot of trash everyday whenever they step outside ( even in the home people known to them do this specially to young kids) talk to women, like really talk to them. If they open up at all. \n\nThen CSA, you know how high the rate is ? \n\nStart with her normal day - you won’t find a single woman who haven’t been groped, catcalled, harassed, threatened, elbowed, flashed at or worse. Then there are men who harass through text and social media. Women and little girls are encouraged to hush up and keep quiet.\n\nWe have normalized this. And people like you don’t even know or want to recognize it.",
        "misogyny, maladjustment, lack of support and guidance, problematic upbringing, bad role models, frustration, unhealthy power dynamics.\n\nPorn is just fuel.",
        "Did I say that I am unaware of the sexual harrasment crimes that go in the world ? But why is it that you are saying this is specifically the case with India alone this is there everywhere..that's my point\n\nAlso I do have empathy towards the situation and u tell me .. do u not think that men and boys also go through sexual harrasment every day ?\n\nAre u unaware of that ? \n\nMy point is.. sexual predators can be men and also women.. I myself have been sexually harrassed by my aunt so many times.. she tried to molest me when I was a teenager.\n\nNow am I saying that all aunties are sexual predators ?\n\nThink..",
        "Yea men also go through, specially CSA in young boys is pretty high. And it’s not even considered a significant problem again thanks to toxic patriarchal set up. \n\nThe point also is this situation is worse in South Asia than some other countries. There is a combination of factors and no one seems to be taking any steps to stop this. Getting randomly groped or catcalled or sexually abused on the way to work / school .. no I haven’t faced in the other countries on a daily basis where I have lived and worked. \n\nI am sure you will see these more in countries with toxic patriarchal culture, slow law and order / justice.",
        "What a lack of sexual education and repression does to a society. Seriously, we Indians need to make greater strides on sex-related topics because this stereotype of us being creeps is only exacerbated when shit like this happens."
    ],
    "cleaned_text": "korean blogger harassment indian boy korean blogger harassment caught camera jodhpur pervert arrested copying description video korean blogger harassment caught camera jodhpur pervert arrested youtubehttpswwwyoutubecomwatchvvopvgbojy monday evening foreign tourist claimed korean national allegedly harassed jodhpur rajasthan victim korean blogger reportedly shooting video walking citys famous blue streets followed man wearing blue tshirt black shorts video footage shows man initially following girl seemed high spirits starts harassing exposing private parts girl seen running away man shouting help man heard laughing behind incident sparked outrage among public many condemning act demanding immediate action perpetrator police registered case relevant sections indian penal code actively investigating matter accused identified efforts underway arrest incident highlights need stringent measures ensure safety security foreign tourists india essential create awareness sensitize people towards acts harassment make realize behavior unacceptable tolerated tourism industry significant contributor indias economy incidents like significant impact countrys reputation safe welcoming destination tourism authorities take steps ensure safety tourists create conducive environment government also take stringent measures punish found guilty crimes deter others engaging similar behavior crucial make tourists feel safe secure enjoy stay country spread positive word mouth india truly fulfill potential leading tourist destination ",
    "cleaned_title": "korean blogger harassment indian boy",
    "cleaned_selftext": "korean blogger harassment caught camera jodhpur pervert arrested copying description video korean blogger harassment caught camera jodhpur pervert arrested youtubehttpswwwyoutubecomwatchvvopvgbojy monday evening foreign tourist claimed korean national allegedly harassed jodhpur rajasthan victim korean blogger reportedly shooting video walking citys famous blue streets followed man wearing blue tshirt black shorts video footage shows man initially following girl seemed high spirits starts harassing exposing private parts girl seen running away man shouting help man heard laughing behind incident sparked outrage among public many condemning act demanding immediate action perpetrator police registered case relevant sections indian penal code actively investigating matter accused identified efforts underway arrest incident highlights need stringent measures ensure safety security foreign tourists india essential create awareness sensitize people towards acts harassment make realize behavior unacceptable tolerated tourism industry significant contributor indias economy incidents like significant impact countrys reputation safe welcoming destination tourism authorities take steps ensure safety tourists create conducive environment government also take stringent measures punish found guilty crimes deter others engaging similar behavior crucial make tourists feel safe secure enjoy stay country spread positive word mouth india truly fulfill potential leading tourist destination",
    "cleaned_comments": "utterly disgusting bunch people linked youtube video bringing religion comments one understand religion isnt bloody point theyre pointing fingers things dont matter current situation problem different dont see guys religion supposed change anything fuck shithole seriously internet indians dont gel dont deserve typical bhartiya mard daily basis nothing new u generalize like pathetic state affairs wonder foreign countries issue clothing guidelines warnings religion new cancer nation addicted first thing incident religion try justify one ridicule cance keeps spreading jane de bhai yaha ke mardo ne sach izzat ka bsda kar dia hai bahar ke desh yahi tera stereotype banega tu kuch nahi kar sakta india porn ruined lot us new daily basis women harassed like specifically getting sexually harassed story every indian women little girls every single day theres widespread misogyny toxic patriarchy country yes every woman even little girls get harassed fact wake nothing politics fact years ago moms time years ago still social problem political course none governments talk media wakes gruesome tape murder happens selective ones similar ones go unnoticed every single woman goes lot trash everyday whenever step outside even home people known specially young kids talk women like really talk open csa know high rate start normal day wont find single woman havent groped catcalled harassed threatened elbowed flashed worse men harass text social media women little girls encouraged hush keep quiet normalized people like dont even know want recognize misogyny maladjustment lack support guidance problematic upbringing bad role models frustration unhealthy power dynamics porn fuel say unaware sexual harrasment crimes go world saying specifically case india alone everywherethats point also empathy towards situation u tell u think men boys also go sexual harrasment every day u unaware point sexual predators men also women sexually harrassed aunt many times tried molest teenager saying aunties sexual predators think yea men also go specially csa young boys pretty high even considered significant problem thanks toxic patriarchal set point also situation worse south asia countries combination factors one seems taking steps stop getting randomly groped catcalled sexually abused way work school havent faced countries daily basis lived worked sure see countries toxic patriarchal culture slow law order justice lack sexual education repression society seriously indians need make greater strides sexrelated topics stereotype us creeps exacerbated shit like happens",
    "light_cleaned_title": "Korean Blogger Harassment by Indian Boy",
    "light_cleaned_selftext": "\" **Korean Blogger Harassment Caught on Camera: Jodhpur Pervert Arrested** \" Copying from description of the video [Korean Blogger Harassment Caught on Camera: Jodhpur Pervert Arrested - YouTube](https://www.youtube.com/watch?v=8VoPVGboJ2Y) \" **On Monday evening, a foreign tourist who claimed to be a Korean national was allegedly harassed in Jodhpur, Rajasthan. The victim, a Korean blogger, was reportedly shooting a video of herself while walking on the city's famous blue streets when she was followed by a man wearing a blue T-shirt and black shorts. The video footage shows the man initially following the girl, who seemed to be in high spirits, until he starts harassing her by exposing his private parts. The girl can be seen running away from the man while shouting for help, as the man can be heard laughing behind her. The incident has sparked outrage among the public, with many condemning the act and demanding immediate action against the perpetrator. The police have registered a case under relevant sections of the Indian Penal Code and are actively investigating the matter. The accused has been identified, and efforts are underway to arrest him. The incident highlights the need for more stringent measures to ensure the safety and security of foreign tourists in India. It is essential to create awareness and sensitize people towards such acts of harassment and make them realize that such behavior is unacceptable and will not be tolerated. The tourism industry is a significant contributor to India's economy, and incidents like these can have a significant impact on the country's reputation as a safe and welcoming destination. Tourism authorities should take steps to ensure the safety of tourists and create a conducive environment for them. The government should also take stringent measures to punish those found guilty of such crimes to deter others from engaging in similar behavior. It is crucial to make tourists feel safe and secure so that they can enjoy their stay in the country and spread positive word of mouth. Only then can India truly fulfill its potential as a leading tourist destination.** \"",
    "light_cleaned_comments": "It is utterly disgusting. There a bunch of people in the linked youtube video bringing up religion in the comments, does no one understand that religion isn't the bloody point, they're pointing fingers at things that don't matter in the current situation, the problem is different and I don't see how the guy's religion is supposed to change anything. Fuck this shithole Seriously. Internet and Indians don’t gel. We just don’t deserve it Typical bhartiya mard on a daily basis. Nothing new. How can u generalize like that ? What a pathetic state of affairs. No wonder foreign countries issue clothing guidelines and other warnings. Religion is the new cancer that the nation is addicted too. First thing in any incident is religion if it's yours then you try to justify it, if it's the other one then you ridicule it. The cance keeps spreading jane de bhai yaha ke mardo ne sach me izzat ka bsda kar dia hai, bahar ke desh me yahi tera stereotype banega tu kuch nahi kar sakta. are its not only in india porn has ruined a lot of us \"new\"? On a daily basis women are harassed like that. No, specifically getting sexually harassed is the story of every Indian women and little girls every single day. This is because there’s very widespread misogyny and toxic patriarchy in this country. Yes every woman and even little girls get harassed. It’s a fact, wake up to it. Nothing to do with politics, this was fact 40 years ago in my mom’s time, 20 years ago and is still there. This is a social problem not political, of course none of the governments talk about it, media wakes up only when some gruesome tape murder happens only selective ones while similar ones go unnoticed. Every single woman goes through a lot of trash everyday whenever they step outside ( even in the home people known to them do this specially to young kids) talk to women, like really talk to them. If they open up at all. Then CSA, you know how high the rate is ? Start with her normal day - you won’t find a single woman who haven’t been groped, catcalled, harassed, threatened, elbowed, flashed at or worse. Then there are men who harass through text and social media. Women and little girls are encouraged to hush up and keep quiet. We have normalized this. And people like you don’t even know or want to recognize it. misogyny, maladjustment, lack of support and guidance, problematic upbringing, bad role models, frustration, unhealthy power dynamics. Porn is just fuel. Did I say that I am unaware of the sexual harrasment crimes that go in the world ? But why is it that you are saying this is specifically the case with India alone this is there everywhere..that's my point Also I do have empathy towards the situation and u tell me .. do u not think that men and boys also go through sexual harrasment every day ? Are u unaware of that ? My point is.. sexual predators can be men and also women.. I myself have been sexually harrassed by my aunt so many times.. she tried to molest me when I was a teenager. Now am I saying that all aunties are sexual predators ? Think.. Yea men also go through, specially CSA in young boys is pretty high. And it’s not even considered a significant problem again thanks to toxic patriarchal set up. The point also is this situation is worse in South Asia than some other countries. There is a combination of factors and no one seems to be taking any steps to stop this. Getting randomly groped or catcalled or sexually abused on the way to work / school .. no I haven’t faced in the other countries on a daily basis where I have lived and worked. I am sure you will see these more in countries with toxic patriarchal culture, slow law and order / justice. What a lack of sexual education and repression does to a society. Seriously, we Indians need to make greater strides on sex-related topics because this stereotype of us being creeps is only exacerbated when shit like this happens."
}