{
    "id": "13unzl7",
    "title": "Right to identify as any sex or gender",
    "url": "https://www.reddit.com/gallery/13unzl7",
    "selftext": "https://twitter.com/LiveLawIndia/status/1662826622964178946?t=vD-sTChfQ0j8u0qDx4ZAHQ&s=19",
    "flair": "Law & Courts",
    "score": 454,
    "num_comments": 143,
    "created_utc": 1685345373.0,
    "convurl": "https://i.redd.it/vor9axkj3q2b1.jpg",
    "comments": [
        "https://twitter.com/LiveLawIndia/status/1662826622964178946?t=vD-sTChfQ0j8u0qDx4ZAHQ&s=19",
        "Great decision.",
        "It still surprises me how progressive we can be when we are being rational",
        "![gif](giphy|4UJyRK2TXNhgk|downsized)",
        "![gif](giphy|qVID3J8fLrlZK)",
        "No one has seen Batman and me in the same room.",
        "Any sex (?). i guess i can figure out what he means but sex is biological whereas gender is a construct.",
        "Finally some good news",
        "Based",
        "Okay please guide me I am naive. Isn't gender natural and biological. Like yeah you can choose your sexuality which accordingly to me is like your sexual preference with whom you wish to marry, make a family and even be physical. I respect trans people and there is a whole lot of biology behind this that my small brain can't understand but what is this ? Like at the best you are Male, Female, Trans good ? But now like how many genders are there ? Is gay, lesbian also gender like we identify are gender based on sexual preference?",
        "I have a idea that when there is a contest were there are separate competition for men and women like cricket or boxing that time division should be done on the basis of biological sex no matter what you identify yourself as.",
        "Isn't that how it already is?",
        "I will try my best to explain to you.\n\n[Biological] sex, gender and sexuality are three completely different things.\n\nSex: Basically what you have between your legs. Can be changed after undergoing \"sex reassignment surgery\". Male/Female.\n\nGender: How you look, view yourself, behave, act, etc. Man/Woman. It's a social thing.\n\nSexuality: It defines who you are attracted to. Homosexuality, Heterosexuality and Bisexuality. (There are pansexual and asexual too).\n\nNow regarding trans, there are two types of people, Cisgender and Transgender.\n\nCisgender: Those having the same gender since their birth. Most people don't use this prefix. When you say you're a man or a woman, you typically mean cis-man or cis-woman.\n\nTransgender: Those having different genders than what they were during birth. Trans-man/Trans-woman.\n\nSo, if you're biologically a female but feel like a man trapped inside a woman's body, you can become a transgender man from a cisgender woman. Your sexuality (your attractions) do not have anything to do with this.\n\n\nI'm a gay man. That means I'm a man attracted to other cute men lol.",
        "Surprisingly good decision.",
        "Very rudimentary explanation because this is actually a very complex and nuanced topic and humanity/society/medicine is relatively new to addressing it because it was so rarely talked about.\n\nThere are 3 things you are talking about -\n\n1. Biological sex - depending on the chromosomes etc.\n\n2. Gender identity - depending on psychological \"stuff\" which we are still studying\n\n3. Sexual identity - based on preferences\n\nIt's also very possible that all 3 are related (almost always, biological sex defines gender identity, and this in turn informs attraction to the opposite sex). But there are cases of outliers for all 3.\n\nEg - a person born female might have a rare condition of having underdeveloped male reproductive organs internally (hermaphroditism). This can cause medical complications and hormonal issues.\n\nThese persons dealing with anatomical difficulties are called intersex.\n\nNext, a person born female might have \"gender dysphoria\" and identify themselves as a man. This usually leads to psychological distress which in turn causes physiological symptoms because of stress.\n\nSo dealing with this (via gender reassignment or counselling etc.) makes them trans gender.\n\nSexual identity is something that we are a bit more familiar with - gay, lesbian, bi etc.\n\nBut they aren't mutually exclusive (eg. A person might be born male, is never felt like a male and always associated themselves as a woman, but was sexually attracted to other woman). So it's pretty confusing and complex.\n\nIf any of the above points are incorrect I hope someone can correct me because I learnt most of this just a few months back.",
        "Too late! India already has a sizeable population of religious nuts and homophobes who don't seem to grasp the simple concept of \"Live and Let Live\". I have no idea how a person, who simply wants to choose what their gender identity is, affects anyone else in the society and yet people cannot just let them do what they want to.",
        "Kudos to the judge for throwing the RigVeda as well.",
        "America has two right wing parties. India has many. So we will have our own right wing nonsense",
        "Finally some rational progress",
        "America has problems like - women making their own choices, and queer people not being killed. \n\nDamn, must be so hard for you to live in those conditions.😔",
        "You mentioned asexual, thank you 🤩",
        "So if I identify as a woman am I entitled to what's being offered to women",
        "Lol. Not in the US. Lia Thomas, who literally has a penis and enjoys the distinct athletic advantages of natural testosterone, competes as a woman.",
        "And to add to that, a trans person can be gay/queer/bisexual etc even after their reassignment surgery. For example, if someone transitions from being a man to a woman, most of the time they do it because they feel like they don't belong in their own body and their gender dysphoria (not because they want to get with the opposite gender, which a lot of our movies depict as). They can still be attracted to a female after transitioning, if they feel the same way before transitioning.",
        "Depends on what you consider offered to women, and the country you are in.\n\nThere's a difference depending on how far along you are in transition, I think. \n\nSomeone who has been medically transitioning - especially if they started as a young adult, as soon as they are legally and medically able to and/or was on puberty blockers - can in most cases be indistinguishable from someone born female. \n\nOf course, they wouldn't be able to bear children or have menses, but I'm pretty sure external sexual organs can be reconstructed to resemble a cis woman.\n\nThe question about transgender athletes in sports is being debated - that too, I think, depends on how far along the transition is. \n\nYou can't have a trans man who has been undergoing hormone replacement therapy for years compete against cis women just because he was born with a vagina.\n\nLegally speaking, I don't know whether in India you will be able to get the posts reserved for women. I think there's a specific reservation category for transgender people, I'm not sure.",
        "You're welcome! Asexuality is just as valid. I personally feel there should be more awareness about it.",
        "I think you're mixing up gender, sex and sexual orientation.  \nGender is a spectrum and not binary, and usually has more to do with cultural norms expression and expectation. It doesn't equate to sex.   \nSex is more to do with your body. We used to correlate that to the sexual organ you have, or your set of chromosome, but as science develop we identified a lot of ''edge case''. For example a person who is a cis-woman through all her life may turns out to have a set of XY chromosome, but the receptor that capture testosterone hormones didn't work properly, or people with different set of chromosomes than just the ''usual'' XX or XY.   \n\n\nsexual orientation is just who you are attracted to. It is completely non-binary. It can go from straight, to gay, to asexual or pansexual. It's also fluid, with a non-insignificant portion of the population changing their sexual orientation throughout their life.",
        "Gender affirmation surgery is called sex reassignment surgery here so maybe he got confused.",
        "It's not on the root level . These guys keep the country running. I mean in Rajasthan it's difficult just being a girl imagine being trans.",
        "She does not, in fact, have the advantage of natural testosterone anymore since she's quite far into HRT. Please look up how HRT works. \n\n> Thomas lost muscle mass and strength through testosterone suppression and hormone replacement therapy. Her time for the 500 freestyle is over 15 seconds slower than her personal bests before medically transitioning",
        "Depends on if and how far along into HRT they are. Male to female transitioners for example lose muscle mass in the process of HRT, and when on HRT they also usually take steps for testosterone suppression. \n\nTake Lia Thomas, the example a commenter wrongly supplied as a reply to your comment. Her personal best after HRT is over 15seconds slower than before HRT. \n\nIf you are interested in this, there are studies about this topic you can look up. People make lots of noise about m-to-f athletes in women's sports but as you can find out, they're mostly empty.",
        "ohh okay got it. yep i definitely think he got confused as well",
        "should be a law even withough the vedas. we dont need vedas to be human. But yeah i wont lie. it helps to promote it between rw nutjobs",
        "Incredible India..",
        "Damn. Dude with the clapback from Ancient text 😎.\nNice.",
        "Wow , that's a lottaa shit",
        "Yeah, especially the cisgender heterosexuals 😘",
        "i identify myself as a water bottle.",
        "Hi fellow bo*oh*wo*",
        "That's a bit exaggerated tbh. Rajasthan is like Punjab and it's not that bad."
    ],
    "cleaned_text": "right identify sex gender  ",
    "cleaned_title": "right identify sex gender",
    "cleaned_selftext": "",
    "cleaned_comments": "great decision still surprises progressive rational gifgiphyujyrktxnhgkdownsized gifgiphyqvidjflrlzk one seen batman room sex guess figure means sex biological whereas gender construct finally good news based okay please guide naive isnt gender natural biological like yeah choose sexuality accordingly like sexual preference wish marry make family even physical respect trans people whole lot biology behind small brain cant understand like best male female trans good like many genders gay lesbian also gender like identify gender based sexual preference idea contest separate competition men women like cricket boxing time division done basis biological sex matter identify isnt already try best explain biological sex gender sexuality three completely different things sex basically legs changed undergoing sex reassignment surgery malefemale gender look view behave act etc manwoman social thing sexuality defines attracted homosexuality heterosexuality bisexuality pansexual asexual regarding trans two types people cisgender transgender cisgender gender since birth people dont use prefix say youre man woman typically mean cisman ciswoman transgender different genders birth transmantranswoman youre biologically female feel like man trapped inside womans body become transgender man cisgender woman sexuality attractions anything im gay man means im man attracted cute men lol surprisingly good decision rudimentary explanation actually complex nuanced topic humanitysocietymedicine relatively new addressing rarely talked things talking biological sex depending chromosomes etc gender identity depending psychological stuff still studying sexual identity based preferences also possible related almost always biological sex defines gender identity turn informs attraction opposite sex cases outliers eg person born female might rare condition underdeveloped male reproductive organs internally hermaphroditism cause medical complications hormonal issues persons dealing anatomical difficulties called intersex next person born female might gender dysphoria identify man usually leads psychological distress turn causes physiological symptoms stress dealing via gender reassignment counselling etc makes trans gender sexual identity something bit familiar gay lesbian bi etc arent mutually exclusive eg person might born male never felt like male always associated woman sexually attracted woman pretty confusing complex points incorrect hope someone correct learnt months back late india already sizeable population religious nuts homophobes dont seem grasp simple concept live let live idea person simply wants choose gender identity affects anyone else society yet people let want kudos judge throwing rigveda well america two right wing parties india many right wing nonsense finally rational progress america problems like women making choices queer people killed damn must hard live conditions mentioned asexual thank identify woman entitled whats offered women lol us lia thomas literally penis enjoys distinct athletic advantages natural testosterone competes woman add trans person gayqueerbisexual etc even reassignment surgery example someone transitions man woman time feel like dont belong body gender dysphoria want get opposite gender lot movies depict still attracted female transitioning feel way transitioning depends consider offered women country theres difference depending far along transition think someone medically transitioning especially started young adult soon legally medically able andor puberty blockers cases indistinguishable someone born female course wouldnt able bear children menses im pretty sure external sexual organs reconstructed resemble cis woman question transgender athletes sports debated think depends far along transition cant trans man undergoing hormone replacement therapy years compete cis women born vagina legally speaking dont know whether india able get posts reserved women think theres specific reservation category transgender people im sure youre welcome asexuality valid personally feel awareness think youre mixing gender sex sexual orientation gender spectrum binary usually cultural norms expression expectation doesnt equate sex sex body used correlate sexual organ set chromosome science develop identified lot edge case example person ciswoman life may turns set xy chromosome receptor capture testosterone hormones didnt work properly people different set chromosomes usual xx xy sexual orientation attracted completely nonbinary go straight gay asexual pansexual also fluid noninsignificant portion population changing sexual orientation throughout life gender affirmation surgery called sex reassignment surgery maybe got confused root level guys keep country running mean rajasthan difficult girl imagine trans fact advantage natural testosterone anymore since shes quite far hrt please look hrt works thomas lost muscle mass strength testosterone suppression hormone replacement therapy time freestyle seconds slower personal bests medically transitioning depends far along hrt male female transitioners example lose muscle mass process hrt hrt also usually take steps testosterone suppression take lia thomas example commenter wrongly supplied reply comment personal best hrt seconds slower hrt interested studies topic look people make lots noise mtof athletes womens sports find theyre mostly empty ohh okay got yep definitely think got confused well law even withough vedas dont need vedas human yeah wont lie helps promote rw nutjobs incredible india damn dude clapback ancient text nice wow thats lottaa shit yeah especially cisgender heterosexuals identify water bottle hi fellow boohwo thats bit exaggerated tbh rajasthan like punjab bad",
    "light_cleaned_title": "Right to identify as any sex or gender",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "Great decision. It still surprises me how progressive we can be when we are being rational ![gif](giphy|4UJyRK2TXNhgk|downsized) ![gif](giphy|qVID3J8fLrlZK) No one has seen Batman and me in the same room. Any sex (?). i guess i can figure out what he means but sex is biological whereas gender is a construct. Finally some good news Based Okay please guide me I am naive. Isn't gender natural and biological. Like yeah you can choose your sexuality which accordingly to me is like your sexual preference with whom you wish to marry, make a family and even be physical. I respect trans people and there is a whole lot of biology behind this that my small brain can't understand but what is this ? Like at the best you are Male, Female, Trans good ? But now like how many genders are there ? Is gay, lesbian also gender like we identify are gender based on sexual preference? I have a idea that when there is a contest were there are separate competition for men and women like cricket or boxing that time division should be done on the basis of biological sex no matter what you identify yourself as. Isn't that how it already is? I will try my best to explain to you. [Biological] sex, gender and sexuality are three completely different things. Sex: Basically what you have between your legs. Can be changed after undergoing \"sex reassignment surgery\". Male/Female. Gender: How you look, view yourself, behave, act, etc. Man/Woman. It's a social thing. Sexuality: It defines who you are attracted to. Homosexuality, Heterosexuality and Bisexuality. (There are pansexual and asexual too). Now regarding trans, there are two types of people, Cisgender and Transgender. Cisgender: Those having the same gender since their birth. Most people don't use this prefix. When you say you're a man or a woman, you typically mean cis-man or cis-woman. Transgender: Those having different genders than what they were during birth. Trans-man/Trans-woman. So, if you're biologically a female but feel like a man trapped inside a woman's body, you can become a transgender man from a cisgender woman. Your sexuality (your attractions) do not have anything to do with this. I'm a gay man. That means I'm a man attracted to other cute men lol. Surprisingly good decision. Very rudimentary explanation because this is actually a very complex and nuanced topic and humanity/society/medicine is relatively new to addressing it because it was so rarely talked about. There are 3 things you are talking about - 1. Biological sex - depending on the chromosomes etc. 2. Gender identity - depending on psychological \"stuff\" which we are still studying 3. Sexual identity - based on preferences It's also very possible that all 3 are related (almost always, biological sex defines gender identity, and this in turn informs attraction to the opposite sex). But there are cases of outliers for all 3. Eg - a person born female might have a rare condition of having underdeveloped male reproductive organs internally (hermaphroditism). This can cause medical complications and hormonal issues. These persons dealing with anatomical difficulties are called intersex. Next, a person born female might have \"gender dysphoria\" and identify themselves as a man. This usually leads to psychological distress which in turn causes physiological symptoms because of stress. So dealing with this (via gender reassignment or counselling etc.) makes them trans gender. Sexual identity is something that we are a bit more familiar with - gay, lesbian, bi etc. But they aren't mutually exclusive (eg. A person might be born male, is never felt like a male and always associated themselves as a woman, but was sexually attracted to other woman). So it's pretty confusing and complex. If any of the above points are incorrect I hope someone can correct me because I learnt most of this just a few months back. Too late! India already has a sizeable population of religious nuts and homophobes who don't seem to grasp the simple concept of \"Live and Let Live\". I have no idea how a person, who simply wants to choose what their gender identity is, affects anyone else in the society and yet people cannot just let them do what they want to. Kudos to the judge for throwing the RigVeda as well. America has two right wing parties. India has many. So we will have our own right wing nonsense Finally some rational progress America has problems like - women making their own choices, and queer people not being killed. Damn, must be so hard for you to live in those conditions.😔 You mentioned asexual, thank you 🤩 So if I identify as a woman am I entitled to what's being offered to women Lol. Not in the US. Lia Thomas, who literally has a penis and enjoys the distinct athletic advantages of natural testosterone, competes as a woman. And to add to that, a trans person can be gay/queer/bisexual etc even after their reassignment surgery. For example, if someone transitions from being a man to a woman, most of the time they do it because they feel like they don't belong in their own body and their gender dysphoria (not because they want to get with the opposite gender, which a lot of our movies depict as). They can still be attracted to a female after transitioning, if they feel the same way before transitioning. Depends on what you consider offered to women, and the country you are in. There's a difference depending on how far along you are in transition, I think. Someone who has been medically transitioning - especially if they started as a young adult, as soon as they are legally and medically able to and/or was on puberty blockers - can in most cases be indistinguishable from someone born female. Of course, they wouldn't be able to bear children or have menses, but I'm pretty sure external sexual organs can be reconstructed to resemble a cis woman. The question about transgender athletes in sports is being debated - that too, I think, depends on how far along the transition is. You can't have a trans man who has been undergoing hormone replacement therapy for years compete against cis women just because he was born with a vagina. Legally speaking, I don't know whether in India you will be able to get the posts reserved for women. I think there's a specific reservation category for transgender people, I'm not sure. You're welcome! Asexuality is just as valid. I personally feel there should be more awareness about it. I think you're mixing up gender, sex and sexual orientation. Gender is a spectrum and not binary, and usually has more to do with cultural norms expression and expectation. It doesn't equate to sex. Sex is more to do with your body. We used to correlate that to the sexual organ you have, or your set of chromosome, but as science develop we identified a lot of ''edge case''. For example a person who is a cis-woman through all her life may turns out to have a set of XY chromosome, but the receptor that capture testosterone hormones didn't work properly, or people with different set of chromosomes than just the ''usual'' XX or XY. sexual orientation is just who you are attracted to. It is completely non-binary. It can go from straight, to gay, to asexual or pansexual. It's also fluid, with a non-insignificant portion of the population changing their sexual orientation throughout their life. Gender affirmation surgery is called sex reassignment surgery here so maybe he got confused. It's not on the root level . These guys keep the country running. I mean in Rajasthan it's difficult just being a girl imagine being trans. She does not, in fact, have the advantage of natural testosterone anymore since she's quite far into HRT. Please look up how HRT works. > Thomas lost muscle mass and strength through testosterone suppression and hormone replacement therapy. Her time for the 500 freestyle is over 15 seconds slower than her personal bests before medically transitioning Depends on if and how far along into HRT they are. Male to female transitioners for example lose muscle mass in the process of HRT, and when on HRT they also usually take steps for testosterone suppression. Take Lia Thomas, the example a commenter wrongly supplied as a reply to your comment. Her personal best after HRT is over 15seconds slower than before HRT. If you are interested in this, there are studies about this topic you can look up. People make lots of noise about m-to-f athletes in women's sports but as you can find out, they're mostly empty. ohh okay got it. yep i definitely think he got confused as well should be a law even withough the vedas. we dont need vedas to be human. But yeah i wont lie. it helps to promote it between rw nutjobs Incredible India.. Damn. Dude with the clapback from Ancient text 😎. Nice. Wow , that's a lottaa shit Yeah, especially the cisgender heterosexuals 😘 i identify myself as a water bottle. Hi fellow bo*oh*wo* That's a bit exaggerated tbh. Rajasthan is like Punjab and it's not that bad."
}