{
    "id": "16k441b",
    "title": "Suddenly all copper items turning black",
    "url": "https://www.reddit.com/gallery/16k441b",
    "selftext": "Hi Folks\n\nSuddenly the copper items like Water Jug, Lock and Puja and even Silver items started to turn black. Does it due to air quality? We have some Nala running near home. I have attached some snaps.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694860267.0,
    "convurl": "https://i.redd.it/0xh2tt4qhlob1.jpg",
    "comments": [
        "This is likely just usual oxidation, copper oxide/silver oxide have get tarnished over time.\n\nThough the process is accelerated in high humidity areas and obviously more oxygen.\n\nTry keeping is closed off area or drier places ?",
        "We regularly use these items it was never like this before. So we are wondering if it's just started a month back. Might be climate also but Not sure.",
        "Clean them with tamarind to get their original colour",
        "They were of copper colour a month back? They turned like this within a month!!?",
        "Copper and copper alloys corrode by first tarnishing, blackening and eventually turning green. If it's happening suddenly, there is likely an accelerant in the air. If, as you say, a sewage pipe is running near your home, it is a possible source of sulfur, ammonia or even hydrogen sulfide **H2S**. The rapidity of the corrosion possibly indicates **H2S**, which you can detect by smelling the air for rotten eggs. But you lose the ability to smell **H2S** if you stick around a while, so you might want to test for its presence by walking away from source and returning after a few hours. \n\nHydrogen sulfide is a very poisonous gas, and if this is indeed what is causing the rapid corrosion of copper, you must get your sewage inspected/covered etc.",
        "Humid weather will be harsher for copper and silver goods. Try tamarind/lemon or pitambari powder to clean copper products. \nUse colgate tooth powder to clean silver products.",
        "Apocalypse is closer.",
        "Thanks for the proper explanation. We are trying to get hold of the municipality member to fix the sewage. It seems that the issue.\n\nIf the family inhaled the hydrogen sulphide for 2 months any health will be there? If not immediate or longer. ?",
        "Yes, it is due to sewage leakage",
        "Get the sewage pipe repaired as soon as possible. Which city? Call municipality number, contact the ward representative.",
        "It's Gadag, Karnataka, \n\nYes escalated the topic to the municipality.",
        "Oh.\n\nTry to figure out what may be causing this, and check if it can cause health issues or not.",
        "Yes checking what will be health issues due to this.",
        "Tou wont face health issues due to thid but your Electronics will , especially ACs"
    ],
    "cleaned_text": "suddenly copper items turning black hi folks suddenly copper items like water jug lock puja even silver items started turn black due air quality nala running near home attached snaps ",
    "cleaned_title": "suddenly copper items turning black",
    "cleaned_selftext": "hi folks suddenly copper items like water jug lock puja even silver items started turn black due air quality nala running near home attached snaps",
    "cleaned_comments": "likely usual oxidation copper oxidesilver oxide get tarnished time though process accelerated high humidity areas obviously oxygen try keeping closed area drier places regularly use items never like wondering started month back might climate also sure clean tamarind get original colour copper colour month back turned like within month copper copper alloys corrode first tarnishing blackening eventually turning green happening suddenly likely accelerant air say sewage pipe running near home possible source sulfur ammonia even hydrogen sulfide hs rapidity corrosion possibly indicates hs detect smelling air rotten eggs lose ability smell hs stick around might want test presence walking away source returning hours hydrogen sulfide poisonous gas indeed causing rapid corrosion copper must get sewage inspectedcovered etc humid weather harsher copper silver goods try tamarindlemon pitambari powder clean copper products use colgate tooth powder clean silver products apocalypse closer thanks proper explanation trying get hold municipality member fix sewage seems issue family inhaled hydrogen sulphide months health immediate longer yes due sewage leakage get sewage pipe repaired soon possible city call municipality number contact ward representative gadag karnataka yes escalated topic municipality oh try figure may causing check cause health issues yes checking health issues due tou wont face health issues due thid electronics especially acs",
    "light_cleaned_title": "Suddenly all copper items turning black",
    "light_cleaned_selftext": "Hi Folks Suddenly the copper items like Water Jug, Lock and Puja and even Silver items started to turn black. Does it due to air quality? We have some Nala running near home. I have attached some snaps.",
    "light_cleaned_comments": "This is likely just usual oxidation, copper oxide/silver oxide have get tarnished over time. Though the process is accelerated in high humidity areas and obviously more oxygen. Try keeping is closed off area or drier places ? We regularly use these items it was never like this before. So we are wondering if it's just started a month back. Might be climate also but Not sure. Clean them with tamarind to get their original colour They were of copper colour a month back? They turned like this within a month!!? Copper and copper alloys corrode by first tarnishing, blackening and eventually turning green. If it's happening suddenly, there is likely an accelerant in the air. If, as you say, a sewage pipe is running near your home, it is a possible source of sulfur, ammonia or even hydrogen sulfide **H2S**. The rapidity of the corrosion possibly indicates **H2S**, which you can detect by smelling the air for rotten eggs. But you lose the ability to smell **H2S** if you stick around a while, so you might want to test for its presence by walking away from source and returning after a few hours. Hydrogen sulfide is a very poisonous gas, and if this is indeed what is causing the rapid corrosion of copper, you must get your sewage inspected/covered etc. Humid weather will be harsher for copper and silver goods. Try tamarind/lemon or pitambari powder to clean copper products. Use colgate tooth powder to clean silver products. Apocalypse is closer. Thanks for the proper explanation. We are trying to get hold of the municipality member to fix the sewage. It seems that the issue. If the family inhaled the hydrogen sulphide for 2 months any health will be there? If not immediate or longer. ? Yes, it is due to sewage leakage Get the sewage pipe repaired as soon as possible. Which city? Call municipality number, contact the ward representative. It's Gadag, Karnataka, Yes escalated the topic to the municipality. Oh. Try to figure out what may be causing this, and check if it can cause health issues or not. Yes checking what will be health issues due to this. Tou wont face health issues due to thid but your Electronics will , especially ACs"
}