{
    "id": "16k165b",
    "title": "Supreme Court rules Aadhaar not mandatory for bank accounts, mobile numbers, school admissions | India News",
    "url": "https://www.reddit.com/r/india/comments/16k165b/supreme_court_rules_aadhaar_not_mandatory_for/",
    "selftext": "Supreme Court rules Aadhaar not mandatory for bank accounts, mobile numbers, school admissions\n\n>Ruling that Aadhaar was not compulsory for school admissions, the SC said *no child could be denied benefits of any scheme for not having Aadhaar number*. “*CBSE, NEET, UGC cannot make Aadhaar mandatory, also it is not compulsory for school admissions*,” Justice AK Sikri, who is part of the five-judge bench that heard a clutch of petitions challenging the constitutional validity of the Aadhaar Act, said.\n\nSources:\n\nhttps://indianexpress.com/article/india/aadhaar-verdict-supreme-court-judgment-uidai-5374829/\n\nhttps://indianexpress.com/article/india/aadhaar-verdict-full-text-judgment-supreme-court-order-5374794/",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694849283.0,
    "convurl": "https://external-preview.redd.it/hFP6898Bd0JsmQj3x_eFMxZfR2-Adgu8VzrJzHDEwQg.jpg?auto=webp&s=40f0edf075a11cd2b3c7b63220d77332cd6f087b",
    "comments": [
        "u/shitpost-shitpost\n\nThe dangers finally dawned on the Hon'ble SC of India.",
        "Like locking the door after the horse has bolted !\n\nWe have already linked Aadhar to all possible accounts, MFs, PAN, voter ID, everywhere, and now the lordships have said it is not mandatory ?",
        "I think this is old news",
        "Stupid judiciary \n\nAadhar is just like social security no",
        "Is getting admission and opening bank account anything to do with social security?",
        "He is comparing it to social security number in usa",
        "Wait 6 days and the government will pass a vidheyak void this.",
        "Judiciary is a joke at this point tbh.",
        "It's not compulsory but life without it would be so full of hassles that almost everyone would have one. \n\nThis is 5 year old news at this point.",
        "Randi babu randi",
        "Yes, from September 26, 2018.",
        "That was years ago. Not implenmented by govt",
        "This is very old new OP.  September 26, 2018, why share it now?",
        "2018 news, what's the point of posting it now? The ruling isn't even implemented by the govt",
        "Half a decade old news. Govt has found multiple ways to nullify this order",
        "But banks refuse to accept applications for account if you're applying in a state different from your permanent address. They won't even accept voter ID.",
        "Madarchod. After forcing everyone to add it and the income tax department is still going to charge higher tds, now these bastards back track? is there a way to unlink adhaar?",
        "Dude, it's a 2018 judgement which govt. lost. Government has not respected this judgement. Someday a case will have to be fought of contempt of court against it.",
        "So can we file cases against banks and telecom companies for harassing us into linking Aadhaar to fucking everything?",
        "What's the use of the this ruling. The institutes that ask for Aaadhar will continue asking for it and if we say court has not mandated it they simply say, \"Ok go somewhere else then\"",
        "why are you posting 2018 judgement now?",
        "Yes!!!",
        "Govt lost and changed law to force adhaar in mf/stock market/itr cases those r legally mandatory now even court can't do anything now",
        "Is this Puttaswamy vs India or has SC given a new verdict?"
    ],
    "cleaned_text": "supreme court rules aadhaar mandatory bank accounts mobile numbers school admissions india news supreme court rules aadhaar mandatory bank accounts mobile numbers school admissions ruling aadhaar compulsory school admissions sc said child could denied benefits scheme aadhaar number cbse neet ugc make aadhaar mandatory also compulsory school admissions justice ak sikri part fivejudge bench heard clutch petitions challenging constitutional validity aadhaar act said sources ",
    "cleaned_title": "supreme court rules aadhaar mandatory bank accounts mobile numbers school admissions india news",
    "cleaned_selftext": "supreme court rules aadhaar mandatory bank accounts mobile numbers school admissions ruling aadhaar compulsory school admissions sc said child could denied benefits scheme aadhaar number cbse neet ugc make aadhaar mandatory also compulsory school admissions justice ak sikri part fivejudge bench heard clutch petitions challenging constitutional validity aadhaar act said sources",
    "cleaned_comments": "ushitpostshitpost dangers finally dawned honble sc india like locking door horse bolted already linked aadhar possible accounts mfs pan voter id everywhere lordships said mandatory think old news stupid judiciary aadhar like social security getting admission opening bank account anything social security comparing social security number usa wait days government pass vidheyak void judiciary joke point tbh compulsory life without would full hassles almost everyone would one year old news point randi babu randi yes september years ago implenmented govt old new op september share news whats point posting ruling isnt even implemented govt half decade old news govt found multiple ways nullify order banks refuse accept applications account youre applying state different permanent address wont even accept voter id madarchod forcing everyone add income tax department still going charge higher tds bastards back track way unlink adhaar dude judgement govt lost government respected judgement someday case fought contempt court file cases banks telecom companies harassing us linking aadhaar fucking everything whats use ruling institutes ask aaadhar continue asking say court mandated simply say ok go somewhere else posting judgement yes govt lost changed law force adhaar mfstock marketitr cases r legally mandatory even court cant anything puttaswamy vs india sc given new verdict",
    "light_cleaned_title": "Supreme Court rules Aadhaar not mandatory for bank accounts, mobile numbers, school admissions | India News",
    "light_cleaned_selftext": "Supreme Court rules Aadhaar not mandatory for bank accounts, mobile numbers, school admissions >Ruling that Aadhaar was not compulsory for school admissions, the SC said *no child could be denied benefits of any scheme for not having Aadhaar number*. “*CBSE, NEET, UGC cannot make Aadhaar mandatory, also it is not compulsory for school admissions*,” Justice AK Sikri, who is part of the five-judge bench that heard a clutch of petitions challenging the constitutional validity of the Aadhaar Act, said. Sources:",
    "light_cleaned_comments": "u/shitpost-shitpost The dangers finally dawned on the Hon'ble SC of India. Like locking the door after the horse has bolted ! We have already linked Aadhar to all possible accounts, MFs, PAN, voter ID, everywhere, and now the lordships have said it is not mandatory ? I think this is old news Stupid judiciary Aadhar is just like social security no Is getting admission and opening bank account anything to do with social security? He is comparing it to social security number in usa Wait 6 days and the government will pass a vidheyak void this. Judiciary is a joke at this point tbh. It's not compulsory but life without it would be so full of hassles that almost everyone would have one. This is 5 year old news at this point. Randi babu randi Yes, from September 26, 2018. That was years ago. Not implenmented by govt This is very old new OP. September 26, 2018, why share it now? 2018 news, what's the point of posting it now? The ruling isn't even implemented by the govt Half a decade old news. Govt has found multiple ways to nullify this order But banks refuse to accept applications for account if you're applying in a state different from your permanent address. They won't even accept voter ID. Madarchod. After forcing everyone to add it and the income tax department is still going to charge higher tds, now these bastards back track? is there a way to unlink adhaar? Dude, it's a 2018 judgement which govt. lost. Government has not respected this judgement. Someday a case will have to be fought of contempt of court against it. So can we file cases against banks and telecom companies for harassing us into linking Aadhaar to fucking everything? What's the use of the this ruling. The institutes that ask for Aaadhar will continue asking for it and if we say court has not mandated it they simply say, \"Ok go somewhere else then\" why are you posting 2018 judgement now? Yes!!! Govt lost and changed law to force adhaar in mf/stock market/itr cases those r legally mandatory now even court can't do anything now Is this Puttaswamy vs India or has SC given a new verdict?"
}