{
    "id": "1guv0ek",
    "title": "RBI spent $26 Billion from reserves in one month to arrest the falling Rupee",
    "url": "https://i.redd.it/61otiutyfu1e1.jpeg",
    "selftext": "Why isn't RBI allowing Rupee to 'find its own course' as gloriously put by Nirmala Tai? Why? She made it sound it's such a nice thing that Rupee is completely free to lead its own life.\n\n\nHow many months before ₹ break into 3 digits against $1?\n",
    "flair": "Policy/Economy",
    "score": 86,
    "num_comments": 5,
    "created_utc": 1732015716.0,
    "convurl": "https://i.redd.it/61otiutyfu1e1.jpeg",
    "comments": [
        "I have no idea what this means? They are trying to control inflation by making expensive expenditures?\nCan someone smart explain further?",
        "Rupee should be allowed to fluctuate as per free market. RBI(govt) should not intervene in free market. Them buying rupees causes inefficiencies in the market.\n\nElse BJP should stop calling itself right wing.",
        "brooooooooooo thats alot damn usa",
        "They are trying to control the value of the INR against the USD. RBI spent $26 Billion to buy INR from the global market. It's simple supply and demand. More supply leads to lowering of prices and less supply leads to hiking in prices. RBI sells USD and buys INR, thereby making INR less abundant in the global market, which makes people who want INR pay more for it. If they don't, INR becomes more abundant, value decreases and imports become expensive; which affects India's buying power (especially oil)...",
        "India is trying to import a lot, which means too much ₹ rupees in the international market which reduces its value. \n\nRBI has lots of $ in their savings account which they can use to buyback the ₹ which causes it to stabilize. \n\nWhy they do it because falling currency means the government is blamed, and they will lose elections in Maharashtra"
    ],
    "cleaned_text": "rbi spent billion reserves one month arrest falling rupee isnt rbi allowing rupee find course gloriously put nirmala tai made sound nice thing rupee completely free lead life many months break digits ",
    "cleaned_title": "rbi spent billion reserves one month arrest falling rupee",
    "cleaned_selftext": "isnt rbi allowing rupee find course gloriously put nirmala tai made sound nice thing rupee completely free lead life many months break digits",
    "cleaned_comments": "idea means trying control inflation making expensive expenditures someone smart explain rupee allowed fluctuate per free market rbigovt intervene free market buying rupees causes inefficiencies market else bjp stop calling right wing brooooooooooo thats alot damn usa trying control value inr usd rbi spent billion buy inr global market simple supply demand supply leads lowering prices less supply leads hiking prices rbi sells usd buys inr thereby making inr less abundant global market makes people want inr pay dont inr becomes abundant value decreases imports become expensive affects indias buying power especially oil india trying import lot means much rupees international market reduces value rbi lots savings account use buyback causes stabilize falling currency means government blamed lose elections maharashtra",
    "light_cleaned_title": "RBI spent $26 Billion from reserves in one month to arrest the falling Rupee",
    "light_cleaned_selftext": "Why isn't RBI allowing Rupee to 'find its own course' as gloriously put by Nirmala Tai? Why? She made it sound it's such a nice thing that Rupee is completely free to lead its own life. How many months before ₹ break into 3 digits against $1?",
    "light_cleaned_comments": "I have no idea what this means? They are trying to control inflation by making expensive expenditures? Can someone smart explain further? Rupee should be allowed to fluctuate as per free market. RBI(govt) should not intervene in free market. Them buying rupees causes inefficiencies in the market. Else BJP should stop calling itself right wing. brooooooooooo thats alot damn usa They are trying to control the value of the INR against the USD. RBI spent $26 Billion to buy INR from the global market. It's simple supply and demand. More supply leads to lowering of prices and less supply leads to hiking in prices. RBI sells USD and buys INR, thereby making INR less abundant in the global market, which makes people who want INR pay more for it. If they don't, INR becomes more abundant, value decreases and imports become expensive; which affects India's buying power (especially oil)... India is trying to import a lot, which means too much ₹ rupees in the international market which reduces its value. RBI has lots of $ in their savings account which they can use to buyback the ₹ which causes it to stabilize. Why they do it because falling currency means the government is blamed, and they will lose elections in Maharashtra"
}