{
    "id": "1f32905",
    "title": "time for indian garment industry to shine",
    "url": "https://www.reddit.com/r/india/comments/1f32905/time_for_indian_garment_industry_to_shine/",
    "selftext": "[https://www.business-standard.com/world-news/bangladesh-garment-industry-faces-crisis-amid-political-unrest-floods-124082700097\\_1.html](https://www.business-standard.com/world-news/bangladesh-garment-industry-faces-crisis-amid-political-unrest-floods-124082700097_1.html)\n\nas this and many other articles postulate, and also something we are inherently aware of ; this is a golden opportunity for india to claw back the textile business from bangaldesh. india has had centuries old textile and garment skillwork which died out slowly. bangladesh & recently vietnam has lapped up the mass production of garments for global MNCs such as zara, H&M, patagonia , M&S and shitloads more. \n\nwith the recent political turmoil in b'desh , indian govt. should go all out to offer all kinds of sops for global MNCs to tie up with existing garment manufacturers in gujarat, u.p , T.N to open large factories & warehouses. \n\nthis is a golden once in a lifetime kind of opportunity, will the govt. step up and be extremely aggressive in their business policy? ",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1724822228.0,
    "convurl": "https://external-preview.redd.it/7vR8B33hGyF_Lr6ZU7aV477fnGuFBtRHY34rDY3FThY.jpg?auto=webp&s=b3495bae1d4bce0312615be846040c0cf02a9eb9",
    "comments": [
        "> centuries old textile and garment skillwork which died out\n\nThis BS is what destroyed us. There were others also that were skilled. Somehow people think we had the best this and that and everything in the olden times. No. \n\nPeople toiled. Kings/queens enjoyed while the poor weaved or <something>. Others (across world) also mass amazing silk. \n\nIt also died out because\n\n- many including you want to work in front of PC/Mac\n- are you willing to work in PITA of clothing industry? Yes, it is terrible. That is the reason *vadakkan* maybe translate to northern people are working in the current south belt of textiles like Coimbatore Erode etc.\n- I met some that do outsourcing to Zara etc in Coimbatore. He clarified that costs are rising there. He is already planning to open industries in Vietnam etc.\n- the only other option is get migration from places like Bangladesh etc.\n- this is next part of our industrial bosses. They want become international. They want to be like next Suzuki or BMW. TVS for example assembles things in Rwanda etc.\n\nHave a measured dream. Change happens for good.\n\nBig MNC look for quality and profit."
    ],
    "cleaned_text": "time indian garment industry shine httpswwwbusinessstandardcomworldnewsbangladeshgarmentindustryfacescrisisamidpoliticalunrestfloodshtmlhttpswwwbusinessstandardcomworldnewsbangladeshgarmentindustryfacescrisisamidpoliticalunrestfloodshtml many articles postulate also something inherently aware golden opportunity india claw back textile business bangaldesh india centuries old textile garment skillwork died slowly bangladesh recently vietnam lapped mass production garments global mncs zara hm patagonia ms shitloads recent political turmoil bdesh indian govt go offer kinds sops global mncs tie existing garment manufacturers gujarat tn open large factories warehouses golden lifetime kind opportunity govt step extremely aggressive business policy ",
    "cleaned_title": "time indian garment industry shine",
    "cleaned_selftext": "httpswwwbusinessstandardcomworldnewsbangladeshgarmentindustryfacescrisisamidpoliticalunrestfloodshtmlhttpswwwbusinessstandardcomworldnewsbangladeshgarmentindustryfacescrisisamidpoliticalunrestfloodshtml many articles postulate also something inherently aware golden opportunity india claw back textile business bangaldesh india centuries old textile garment skillwork died slowly bangladesh recently vietnam lapped mass production garments global mncs zara hm patagonia ms shitloads recent political turmoil bdesh indian govt go offer kinds sops global mncs tie existing garment manufacturers gujarat tn open large factories warehouses golden lifetime kind opportunity govt step extremely aggressive business policy",
    "cleaned_comments": "centuries old textile garment skillwork died bs destroyed us others also skilled somehow people think best everything olden times people toiled kingsqueens enjoyed poor weaved something others across world also mass amazing silk also died many including want work front pcmac willing work pita clothing industry yes terrible reason vadakkan maybe translate northern people working current south belt textiles like coimbatore erode etc met outsourcing zara etc coimbatore clarified costs rising already planning open industries vietnam etc option get migration places like bangladesh etc next part industrial bosses want become international want like next suzuki bmw tvs example assembles things rwanda etc measured dream change happens good big mnc look quality profit",
    "light_cleaned_title": "time for indian garment industry to shine",
    "light_cleaned_selftext": "[https://www.business-standard.com/world-news/bangladesh-garment-industry-faces-crisis-amid-political-unrest-floods-124082700097\\_1.html](https://www.business-standard.com/world-news/bangladesh-garment-industry-faces-crisis-amid-political-unrest-floods-124082700097_1.html) as this and many other articles postulate, and also something we are inherently aware of ; this is a golden opportunity for india to claw back the textile business from bangaldesh. india has had centuries old textile and garment skillwork which died out slowly. bangladesh & recently vietnam has lapped up the mass production of garments for global MNCs such as zara, H&M, patagonia , M&S and shitloads more. with the recent political turmoil in b'desh , indian govt. should go all out to offer all kinds of sops for global MNCs to tie up with existing garment manufacturers in gujarat, u.p , T.N to open large factories & warehouses. this is a golden once in a lifetime kind of opportunity, will the govt. step up and be extremely aggressive in their business policy?",
    "light_cleaned_comments": "> centuries old textile and garment skillwork which died out This BS is what destroyed us. There were others also that were skilled. Somehow people think we had the best this and that and everything in the olden times. No. People toiled. Kings/queens enjoyed while the poor weaved or <something>. Others (across world) also mass amazing silk. It also died out because - many including you want to work in front of PC/Mac - are you willing to work in PITA of clothing industry? Yes, it is terrible. That is the reason *vadakkan* maybe translate to northern people are working in the current south belt of textiles like Coimbatore Erode etc. - I met some that do outsourcing to Zara etc in Coimbatore. He clarified that costs are rising there. He is already planning to open industries in Vietnam etc. - the only other option is get migration from places like Bangladesh etc. - this is next part of our industrial bosses. They want become international. They want to be like next Suzuki or BMW. TVS for example assembles things in Rwanda etc. Have a measured dream. Change happens for good. Big MNC look for quality and profit."
}