{
    "id": "15o61r2",
    "title": "Quality of education in Nagaland",
    "url": "https://i.redd.it/gj89irapsghb1.png",
    "selftext": "So i tutor this 14 y/o kid and happened to come across her marksheet which i found while checking her textbook for some problems. So I was wondering if i should ask her parents to complain the school about the absolute blasphemy of a teacher or just leave it as it is because it's already some months old. Her last exams i teached her preety well and covered all the syllabus but she scored only 30 out of 60 and therefore after this discovery I'm wondering if she got such marks because of the teacher's error or because she did bad.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691752486.0,
    "convurl": "https://i.redd.it/gj89irapsghb1.png",
    "comments": [
        "This is collision on the teacher's side",
        "Edit: Forgot to mention the question carried 5 marks and this \"error\" cost her 2 marks",
        "Seems like the teacher just deducted marks because they expected P*R*2 in one go instead of this step by step calculation. Sad!",
        "seems like initially the guy did 20+40 = 460\n\nthen saw his friends answer sheet and added a . in 420 making it 42\n\nand then revised the answer\n\nsee the calculation he did in bottom left\n\ndont blame the teacher , she might have missed the '.' \n\nNo need to sweat it more"
    ],
    "cleaned_text": "quality education nagaland tutor yo kid happened come across marksheet found checking textbook problems wondering ask parents complain school absolute blasphemy teacher leave already months old last exams teached preety well covered syllabus scored therefore discovery im wondering got marks teachers error bad ",
    "cleaned_title": "quality education nagaland",
    "cleaned_selftext": "tutor yo kid happened come across marksheet found checking textbook problems wondering ask parents complain school absolute blasphemy teacher leave already months old last exams teached preety well covered syllabus scored therefore discovery im wondering got marks teachers error bad",
    "cleaned_comments": "collision teachers side edit forgot mention question carried marks error cost marks seems like teacher deducted marks expected pr one go instead step step calculation sad seems like initially guy saw friends answer sheet added making revised answer see calculation bottom left dont blame teacher might missed need sweat",
    "light_cleaned_title": "Quality of education in Nagaland",
    "light_cleaned_selftext": "So i tutor this 14 y/o kid and happened to come across her marksheet which i found while checking her textbook for some problems. So I was wondering if i should ask her parents to complain the school about the absolute blasphemy of a teacher or just leave it as it is because it's already some months old. Her last exams i teached her preety well and covered all the syllabus but she scored only 30 out of 60 and therefore after this discovery I'm wondering if she got such marks because of the teacher's error or because she did bad.",
    "light_cleaned_comments": "This is collision on the teacher's side Edit: Forgot to mention the question carried 5 marks and this \"error\" cost her 2 marks Seems like the teacher just deducted marks because they expected P*R*2 in one go instead of this step by step calculation. Sad! seems like initially the guy did 20+40 = 460 then saw his friends answer sheet and added a . in 420 making it 42 and then revised the answer see the calculation he did in bottom left dont blame the teacher , she might have missed the '.' No need to sweat it more"
}