{
    "id": "18g2nou",
    "title": "Getting so many scam messages lately. What to make of it ?",
    "url": "https://www.reddit.com/gallery/18g2nou",
    "selftext": "Haven’t actually tried any of these, are they trying to kill two birds with one stone, scamming and increasing ratings of places/increasing website visits?\n\nAlso increase in such scams could also mean my number is getting shared in these scammer forums :/",
    "flair": "Rant / Vent",
    "score": 3,
    "num_comments": 6,
    "created_utc": 1702324939.0,
    "convurl": "https://i.redd.it/2neb4ig12q5c1.jpg",
    "comments": [
        "Merko bhi aya tha bhai review dedo or 160/- apke bank acc main sab scam hota hai inka",
        "This js pig butchering scam .they contact random people , start gaining trust by simple payments , after some point they move the transactions to questionable platforms ,\n\nThen the victim gets greedy and invests heavily and will lose all the money.\n\nThese initial steps are to convince the people that money can come easily if you trust these guys.",
        "I've never heard of Indian scammers before lol",
        "Mereko to 160 milte tbhi block mardeta hoon"
    ],
    "cleaned_text": "getting many scam messages lately make havent actually tried trying kill two birds one stone scamming increasing ratings placesincreasing website visits also increase scams could also mean number getting shared scammer forums ",
    "cleaned_title": "getting many scam messages lately make",
    "cleaned_selftext": "havent actually tried trying kill two birds one stone scamming increasing ratings placesincreasing website visits also increase scams could also mean number getting shared scammer forums",
    "cleaned_comments": "merko bhi aya tha bhai review dedo apke bank acc main sab scam hota hai inka js pig butchering scam contact random people start gaining trust simple payments point move transactions questionable platforms victim gets greedy invests heavily lose money initial steps convince people money come easily trust guys ive never heard indian scammers lol mereko milte tbhi block mardeta hoon",
    "light_cleaned_title": "Getting so many scam messages lately. What to make of it ?",
    "light_cleaned_selftext": "Haven’t actually tried any of these, are they trying to kill two birds with one stone, scamming and increasing ratings of places/increasing website visits? Also increase in such scams could also mean my number is getting shared in these scammer forums :/",
    "light_cleaned_comments": "Merko bhi aya tha bhai review dedo or 160/- apke bank acc main sab scam hota hai inka This js pig butchering scam .they contact random people , start gaining trust by simple payments , after some point they move the transactions to questionable platforms , Then the victim gets greedy and invests heavily and will lose all the money. These initial steps are to convince the people that money can come easily if you trust these guys. I've never heard of Indian scammers before lol Mereko to 160 milte tbhi block mardeta hoon"
}