{
    "id": "1cfsxiz",
    "title": "Prashant Bhushan Accuses Judge of Political Dog-Whistling, Must Read SC EVM’S Order",
    "url": "https://lawchakra.in/controversial-tweet-bhushan-accuses-judge/?fbclid=PAZXh0bgNhZW0CMTEAAabvGiNCHLrCw40dZCHSC4PEV1WPQu4Dt3CGhsqlxtRIsD-gX3P7m7S8FR8_aem_Aad5NQdfquAS0d1LJxP8wMxLlAsx_Im2yx2-AQQCsXdKjAJvkrkPISlGTynHRX1o84L9GuB3-Bayj2699h5h9eyY",
    "selftext": "https://twitter.com/pbhushan1/status/1784242141499125762\n\nhttps://indconlawphil.wordpress.com/2024/04/27/an-injudicious-judicial-opinion/\n\n>Paragraph 5 of Justice Dipankar Datta’s concurring opinion in the Supreme Court’s 26th April judgment on the question of electronic voting machines [EVMs] and VVPAT verification (Association for Democratic Reforms vs Election Commission of India) proceeds as follows:\n\n>>It is of immediate relevance to note that in recent years, a trend has been fast developing of certain vested interest groups endeavouring to undermine the achievements and accomplishments of the nation, earned through the hard work and dedication of its sincere workforce. There seems to be a concerted effort to discredit, diminish, and weaken the progress of this great nation on every possible frontier. Any such effort, or rather attempt, has to be nipped in the bud. No Constitutional court, far less this Court, would allow such attempt to succeed as long as it (the court) has a say in the matter. I have serious doubt as regards the bona fides of the petitioning association when it seeks a reversion to the old order.\n\n>There are two things to note about this paragraph.\n\n>First, the judge levels a range of allegations in the first two sentences, but provides no evidence or particulars. He does not identify who these “vested interest groups” are. He does not specify what “the achievements and accomplishments of the nation” are, which are being “undermined” by these unnamed “vested interest groups.” He does not clarify what the “concerted effort” is that is being made by (presumably) the same unnamed “vested interest groups.” He does not explain what “progress of this great nation” is being weakened, and how, and by whom. There is a term for such language, and it is called a “dog-whistle.”\n\n>The second issue in this paragraph is the judge’s gratuitous personal attack upon the petitioner, the Association for Democratic Reforms. I will not here write a screed defending the ADR: their two-and-a-half-decades’ worth of work is in the public domain, it speaks for itself, and they do not need anyone to speak on their behalf. Notice, however, how – much like the first part of the paragraph – the judge provides no evidence for doubting ADR’s bona fides; in fact, the only reason for that, that comes out of the judgment, seems to be the judge’s outrage at the suggestion of replacing EVMs with paper ballots",
    "flair": "Law & Courts",
    "score": 110,
    "num_comments": 6,
    "created_utc": 1714375008.0,
    "convurl": "https://external-preview.redd.it/QJOI8KPdIGDaiIymVCWCyz1ZG1jTflz1VgCKB6lHh-4.jpg?auto=webp&s=0108d53848a1b75728e7911477e01af4dd2a0bc5",
    "comments": [
        "This absolutely true, we should stop pretending that these judges are Independent, sc have been long compromised, and when something good judgement comes out which should have happen 5 years ago we start hero worshiping these judges as if they are last beacon of hope for democracy. The bench fixing, inaction against grave human rights violations, all the drama on chandigarh electoral officer but no action against him. They do bear minimum that too 5 years too late and we celebrate them as gods.",
        "Saheb might have a job lined up.",
        "There used to be a time for every problem the government would say committee bithayenge, and these committee would be formed with retired judges, and these judges would give favorable judgments for government to get a seat in one of those committees so that they can keep their government salaries and perks along with pension for being retired from judge post. But now we see government is not shying away no committee needed directly you will get seat in the parliament no one will question the government or the judges anyway.",
        "Everyone will pay if not by law then by the hands of people. If I still don't get a job, I will start targeting these kind of people. Like Dexter.",
        "https://preview.redd.it/ywe160l1wdxc1.png?width=562&format=png&auto=webp&s=0ff45574cca1f39df7947949d2846805e74c0ca1",
        "Sanjiv Khanna is hearing Arvind Kejriwal's case today. Guess we know what's gonna happen.",
        "It takes phenomenal boot-licking skills, to malign an organisation like ADR (Association for Democratic Reforms)."
    ],
    "cleaned_text": "prashant bhushan accuses judge political dogwhistling must read sc evms order paragraph justice dipankar dattas concurring opinion supreme courts th april judgment question electronic voting machines evms vvpat verification association democratic reforms vs election commission india proceeds follows immediate relevance note recent years trend fast developing certain vested interest groups endeavouring undermine achievements accomplishments nation earned hard work dedication sincere workforce seems concerted effort discredit diminish weaken progress great nation every possible frontier effort rather attempt nipped bud constitutional court far less court would allow attempt succeed long court say matter serious doubt regards bona fides petitioning association seeks reversion old order two things note paragraph first judge levels range allegations first two sentences provides evidence particulars identify vested interest groups specify achievements accomplishments nation undermined unnamed vested interest groups clarify concerted effort made presumably unnamed vested interest groups explain progress great nation weakened term language called dogwhistle second issue paragraph judges gratuitous personal attack upon petitioner association democratic reforms write screed defending adr twoandahalfdecades worth work public domain speaks need anyone speak behalf notice however much like first part paragraph judge provides evidence doubting adrs bona fides fact reason comes judgment seems judges outrage suggestion replacing evms paper ballots ",
    "cleaned_title": "prashant bhushan accuses judge political dogwhistling must read sc evms order",
    "cleaned_selftext": "paragraph justice dipankar dattas concurring opinion supreme courts th april judgment question electronic voting machines evms vvpat verification association democratic reforms vs election commission india proceeds follows immediate relevance note recent years trend fast developing certain vested interest groups endeavouring undermine achievements accomplishments nation earned hard work dedication sincere workforce seems concerted effort discredit diminish weaken progress great nation every possible frontier effort rather attempt nipped bud constitutional court far less court would allow attempt succeed long court say matter serious doubt regards bona fides petitioning association seeks reversion old order two things note paragraph first judge levels range allegations first two sentences provides evidence particulars identify vested interest groups specify achievements accomplishments nation undermined unnamed vested interest groups clarify concerted effort made presumably unnamed vested interest groups explain progress great nation weakened term language called dogwhistle second issue paragraph judges gratuitous personal attack upon petitioner association democratic reforms write screed defending adr twoandahalfdecades worth work public domain speaks need anyone speak behalf notice however much like first part paragraph judge provides evidence doubting adrs bona fides fact reason comes judgment seems judges outrage suggestion replacing evms paper ballots",
    "cleaned_comments": "absolutely true stop pretending judges independent sc long compromised something good judgement comes happen years ago start hero worshiping judges last beacon hope democracy bench fixing inaction grave human rights violations drama chandigarh electoral officer action bear minimum years late celebrate gods saheb might job lined used time every problem government would say committee bithayenge committee would formed retired judges judges would give favorable judgments government get seat one committees keep government salaries perks along pension retired judge post see government shying away committee needed directly get seat parliament one question government judges anyway everyone pay law hands people still dont get job start targeting kind people like dexter sanjiv khanna hearing arvind kejriwals case today guess know whats gon na happen takes phenomenal bootlicking skills malign organisation like adr association democratic reforms",
    "light_cleaned_title": "Prashant Bhushan Accuses Judge of Political Dog-Whistling, Must Read SC EVM’S Order",
    "light_cleaned_selftext": ">Paragraph 5 of Justice Dipankar Datta’s concurring opinion in the Supreme Court’s 26th April judgment on the question of electronic voting machines [EVMs] and VVPAT verification (Association for Democratic Reforms vs Election Commission of India) proceeds as follows: >>It is of immediate relevance to note that in recent years, a trend has been fast developing of certain vested interest groups endeavouring to undermine the achievements and accomplishments of the nation, earned through the hard work and dedication of its sincere workforce. There seems to be a concerted effort to discredit, diminish, and weaken the progress of this great nation on every possible frontier. Any such effort, or rather attempt, has to be nipped in the bud. No Constitutional court, far less this Court, would allow such attempt to succeed as long as it (the court) has a say in the matter. I have serious doubt as regards the bona fides of the petitioning association when it seeks a reversion to the old order. >There are two things to note about this paragraph. >First, the judge levels a range of allegations in the first two sentences, but provides no evidence or particulars. He does not identify who these “vested interest groups” are. He does not specify what “the achievements and accomplishments of the nation” are, which are being “undermined” by these unnamed “vested interest groups.” He does not clarify what the “concerted effort” is that is being made by (presumably) the same unnamed “vested interest groups.” He does not explain what “progress of this great nation” is being weakened, and how, and by whom. There is a term for such language, and it is called a “dog-whistle.” >The second issue in this paragraph is the judge’s gratuitous personal attack upon the petitioner, the Association for Democratic Reforms. I will not here write a screed defending the ADR: their two-and-a-half-decades’ worth of work is in the public domain, it speaks for itself, and they do not need anyone to speak on their behalf. Notice, however, how – much like the first part of the paragraph – the judge provides no evidence for doubting ADR’s bona fides; in fact, the only reason for that, that comes out of the judgment, seems to be the judge’s outrage at the suggestion of replacing EVMs with paper ballots",
    "light_cleaned_comments": "This absolutely true, we should stop pretending that these judges are Independent, sc have been long compromised, and when something good judgement comes out which should have happen 5 years ago we start hero worshiping these judges as if they are last beacon of hope for democracy. The bench fixing, inaction against grave human rights violations, all the drama on chandigarh electoral officer but no action against him. They do bear minimum that too 5 years too late and we celebrate them as gods. Saheb might have a job lined up. There used to be a time for every problem the government would say committee bithayenge, and these committee would be formed with retired judges, and these judges would give favorable judgments for government to get a seat in one of those committees so that they can keep their government salaries and perks along with pension for being retired from judge post. But now we see government is not shying away no committee needed directly you will get seat in the parliament no one will question the government or the judges anyway. Everyone will pay if not by law then by the hands of people. If I still don't get a job, I will start targeting these kind of people. Like Dexter. Sanjiv Khanna is hearing Arvind Kejriwal's case today. Guess we know what's gonna happen. It takes phenomenal boot-licking skills, to malign an organisation like ADR (Association for Democratic Reforms)."
}