{
    "id": "13tbw1e",
    "title": "Urgent Help Needed: Donations for Hospitalized Cat at Crown Vet Hospital, Kalyani Nagar, Pune (Posting all the proofs and hospital bills) QR is also there",
    "url": "https://www.reddit.com/gallery/13tbw1e",
    "selftext": "Hello, fellow Redditors!\n\nI hope this post finds you well. Today, I am reaching out to this amazing community for urgent help and support. A dear feline friend is currently in critical condition and is receiving treatment at Crown Vet Hospital in Kalyani Nagar, Pune. We are a group of college students who found this poor kitty in dire need, and we cannot afford to cover the entire hospital bill on our own. We are kindly requesting your assistance in the form of donations, no matter how small.\n\nCat is in critical condition and is admitted , she is eating food so that's a good sign . The hospital bill has reached  around 18k\n\nThe veterinary team at Crown Vet Hospital has been exceptional in their care, providing round-the-clock attention and treatment. However, the expenses have started to accumulate, and it's becoming increasingly challenging for us to manage everything alone.\n\nWe understand that times are tough for everyone, but even a small contribution can make a significant difference in saving this precious life. Every penny donated will go directly towards covering the cat's medical bills, including surgeries, medications, and other necessary procedures.\n\nHere's how you can help:\n\nDonation Options: We have set up a donation fund through a reliable platform [UPI] to facilitate easy and secure transactions. [Siddharth -8421799102]\n\nShare and Spread the Word: If you're unable to contribute financially, that's absolutely okay. We would be immensely grateful if you could share this post with your friends, family, and other communities. The more people who see this, the higher the chances of reaching our goal.\n\nMoral Support: Your words of encouragement, prayers, and positive vibes are also valuable to us during this challenging time. Feel free to leave comments and messages of support.\n\nWe will make sure to keep everyone updated on the cat's progress and the utilization of funds. Transparency is of utmost importance to us, and we will provide all necessary documentation upon request.\n\nThank you from the bottom of our hearts for taking the time to read this post and for considering helping us. Together, we can make a difference and give this cat a fighting chance at a happy and healthy life.\n\nTL;DR: A cat is hospitalized at Crown Vet Hospital in Kalyani Nagar, Pune. We are college students unable to afford the entire medical bill. We kindly request your donations, no matter how small, to help save this cat's life. Please share this post if you're unable to contribute financially. Your support means the world to us!",
    "flair": "AskIndia",
    "score": 193,
    "num_comments": 59,
    "created_utc": 1685205175.0,
    "convurl": "https://i.redd.it/lkcpqe760g2b1.png",
    "comments": [
        "Reach",
        "Cfbr",
        "Cfbr",
        "Hope she gets ok.",
        "Reach",
        "Ifjwhfje",
        "Dhshhsh",
        "Cjchnnh",
        "The bill has reached around 18k the Screenshot asking 5000 is 2 days old ( I have attached the bills too) we are college students so 18k is a big amount for us",
        "Billu bhai ko bachalo😞",
        "Sent some money , god bless you guys.",
        "Cfbr",
        "Couldn't do a lot but did what I could",
        "Username checks out",
        "Reach++",
        "Transferred some money, pls donate guys 🙏",
        "User name doesn't check out.",
        "Hey update on the amount of money you got.",
        "Hope he gets okay, ❤️\nTransferred some money .",
        "Your welcome, manchild.",
        "Pretty sure you wrote this using chatgpt but ok. \n\nI wish i had done this for my cat maybe she might have been still alive. FUCK it hurts thinking about how much she suffered before finally bring able to rest in peace.",
        "Reach, hope the cato recovers soon ✨",
        "???",
        "Reach",
        "I pity those around you",
        "Did whatever Little i could.",
        "Sent a very menial ammount, but I hope Alex gets well soon",
        "How much amount have you collected until now?",
        "https://preview.redd.it/4ie0byazfj2b1.png?width=1080&format=pjpg&auto=webp&v=enabled&s=66707354265e61d5db79bab3e3866a8ec14a1d3a\n\nDid my part jitna bhi I could.. hopefully billu Bhai will recover soon .. please share updates ❤️",
        "This street dog menac is getting out of hand",
        "OP update please.",
        "UPDATE: Alex is better now , his vitals are okay , swelling is still there. He is eating food properly , he would be discharged by today evening and then he would be kept in foster for 10 days .",
        "You should also make it easier for NRIs to donate. Many NRIs don't have UPI. Maybe ask the vet to accept international CC?\n\nAlso, try posing on gofundme (although not sure how it will work with International money transfer).",
        "Thankyou so much❤️",
        "Thankyou ❤️",
        "Thankyou ❤️",
        "Thankyou so much ❤️",
        "You are welcome, send me pictures when your friend is all better",
        "Updated in comments",
        "Can you donate via PayPal?",
        "PayPal : https://www.paypal.me/siddharthtamrakar",
        "Upvoted for visibility\n\nPlease cross post this on /r/pune",
        "Already posted in r/pune",
        "Thankyou ❤️",
        "Thankyou ❤️",
        "Thankyou ❤️ for donating",
        "Your username though 💀💀",
        "Hey did you reach your donation goal?",
        "Did this guy give any update on the Cat? I had donated and asked for updates and this guy hasn't given any update yet.",
        "Did this guy give any update on the cat ? I have donated and have been asking for updates but he hasn't updated about the cat's health yet.",
        "Yes We don't need donations anymore",
        "Thankyou everyone for donating and helping us,❤️ We don't need donations anymore",
        "Bro I updated in comments , he is currently at Foster for 10 days, if you want videos I can send",
        "UPDATE- Alex is Fine now , he still has Swelling, his wounds are healing slowly , he's eating food properly. thankyou everyone for donating ❤️. WE DON'T NEED DONATIONS ANYMORE\n\nhttps://preview.redd.it/99h24k8gp03b1.png?width=1080&format=pjpg&auto=webp&v=enabled&s=9b6502d36dca6e532af511bcffe09c594b7d0431",
        "Yes please. Kindly do the needful in my DM . I had specifically requested you to give some updates."
    ],
    "cleaned_text": "urgent help needed donations hospitalized cat crown vet hospital kalyani nagar pune posting proofs hospital bills qr also hello fellow redditors hope post finds well today reaching amazing community urgent help support dear feline friend currently critical condition receiving treatment crown vet hospital kalyani nagar pune group college students found poor kitty dire need afford cover entire hospital bill kindly requesting assistance form donations matter small cat critical condition admitted eating food thats good sign hospital bill reached around k veterinary team crown vet hospital exceptional care providing roundtheclock attention treatment however expenses started accumulate becoming increasingly challenging us manage everything alone understand times tough everyone even small contribution make significant difference saving precious life every penny donated go directly towards covering cats medical bills including surgeries medications necessary procedures heres help donation options set donation fund reliable platform upi facilitate easy secure transactions siddharth share spread word youre unable contribute financially thats absolutely okay would immensely grateful could share post friends family communities people see higher chances reaching goal moral support words encouragement prayers positive vibes also valuable us challenging time feel free leave comments messages support make sure keep everyone updated cats progress utilization funds transparency utmost importance us provide necessary documentation upon request thank bottom hearts taking time read post considering helping us together make difference give cat fighting chance happy healthy life tldr cat hospitalized crown vet hospital kalyani nagar pune college students unable afford entire medical bill kindly request donations matter small help save cats life please share post youre unable contribute financially support means world us ",
    "cleaned_title": "urgent help needed donations hospitalized cat crown vet hospital kalyani nagar pune posting proofs hospital bills qr also",
    "cleaned_selftext": "hello fellow redditors hope post finds well today reaching amazing community urgent help support dear feline friend currently critical condition receiving treatment crown vet hospital kalyani nagar pune group college students found poor kitty dire need afford cover entire hospital bill kindly requesting assistance form donations matter small cat critical condition admitted eating food thats good sign hospital bill reached around k veterinary team crown vet hospital exceptional care providing roundtheclock attention treatment however expenses started accumulate becoming increasingly challenging us manage everything alone understand times tough everyone even small contribution make significant difference saving precious life every penny donated go directly towards covering cats medical bills including surgeries medications necessary procedures heres help donation options set donation fund reliable platform upi facilitate easy secure transactions siddharth share spread word youre unable contribute financially thats absolutely okay would immensely grateful could share post friends family communities people see higher chances reaching goal moral support words encouragement prayers positive vibes also valuable us challenging time feel free leave comments messages support make sure keep everyone updated cats progress utilization funds transparency utmost importance us provide necessary documentation upon request thank bottom hearts taking time read post considering helping us together make difference give cat fighting chance happy healthy life tldr cat hospitalized crown vet hospital kalyani nagar pune college students unable afford entire medical bill kindly request donations matter small help save cats life please share post youre unable contribute financially support means world us",
    "cleaned_comments": "reach cfbr cfbr hope gets ok reach ifjwhfje dhshhsh cjchnnh bill reached around k screenshot asking days old attached bills college students k big amount us billu bhai ko bachalo sent money god bless guys cfbr couldnt lot could username checks reach transferred money pls donate guys user name doesnt check hey update amount money got hope gets okay transferred money welcome manchild pretty sure wrote using chatgpt ok wish done cat maybe might still alive fuck hurts thinking much suffered finally bring able rest peace reach hope cato recovers soon reach pity around whatever little could sent menial ammount hope alex gets well soon much amount collected part jitna bhi could hopefully billu bhai recover soon please share updates street dog menac getting hand op update please update alex better vitals okay swelling still eating food properly would discharged today evening would kept foster days also make easier nris donate many nris dont upi maybe ask vet accept international cc also try posing gofundme although sure work international money transfer thankyou much thankyou thankyou thankyou much welcome send pictures friend better updated comments donate via paypal paypal upvoted visibility please cross post rpune already posted rpune thankyou thankyou thankyou donating username though hey reach donation goal guy give update cat donated asked updates guy hasnt given update yet guy give update cat donated asking updates hasnt updated cats health yet yes dont need donations anymore thankyou everyone donating helping us dont need donations anymore bro updated comments currently foster days want videos send update alex fine still swelling wounds healing slowly hes eating food properly thankyou everyone donating dont need donations anymore yes please kindly needful dm specifically requested give updates",
    "light_cleaned_title": "Urgent Help Needed: Donations for Hospitalized Cat at Crown Vet Hospital, Kalyani Nagar, Pune (Posting all the proofs and hospital bills) QR is also there",
    "light_cleaned_selftext": "Hello, fellow Redditors! I hope this post finds you well. Today, I am reaching out to this amazing community for urgent help and support. A dear feline friend is currently in critical condition and is receiving treatment at Crown Vet Hospital in Kalyani Nagar, Pune. We are a group of college students who found this poor kitty in dire need, and we cannot afford to cover the entire hospital bill on our own. We are kindly requesting your assistance in the form of donations, no matter how small. Cat is in critical condition and is admitted , she is eating food so that's a good sign . The hospital bill has reached around 18k The veterinary team at Crown Vet Hospital has been exceptional in their care, providing round-the-clock attention and treatment. However, the expenses have started to accumulate, and it's becoming increasingly challenging for us to manage everything alone. We understand that times are tough for everyone, but even a small contribution can make a significant difference in saving this precious life. Every penny donated will go directly towards covering the cat's medical bills, including surgeries, medications, and other necessary procedures. Here's how you can help: Donation Options: We have set up a donation fund through a reliable platform [UPI] to facilitate easy and secure transactions. [Siddharth -8421799102] Share and Spread the Word: If you're unable to contribute financially, that's absolutely okay. We would be immensely grateful if you could share this post with your friends, family, and other communities. The more people who see this, the higher the chances of reaching our goal. Moral Support: Your words of encouragement, prayers, and positive vibes are also valuable to us during this challenging time. Feel free to leave comments and messages of support. We will make sure to keep everyone updated on the cat's progress and the utilization of funds. Transparency is of utmost importance to us, and we will provide all necessary documentation upon request. Thank you from the bottom of our hearts for taking the time to read this post and for considering helping us. Together, we can make a difference and give this cat a fighting chance at a happy and healthy life. TL;DR: A cat is hospitalized at Crown Vet Hospital in Kalyani Nagar, Pune. We are college students unable to afford the entire medical bill. We kindly request your donations, no matter how small, to help save this cat's life. Please share this post if you're unable to contribute financially. Your support means the world to us!",
    "light_cleaned_comments": "Reach Cfbr Cfbr Hope she gets ok. Reach Ifjwhfje Dhshhsh Cjchnnh The bill has reached around 18k the Screenshot asking 5000 is 2 days old ( I have attached the bills too) we are college students so 18k is a big amount for us Billu bhai ko bachalo😞 Sent some money , god bless you guys. Cfbr Couldn't do a lot but did what I could Username checks out Reach++ Transferred some money, pls donate guys 🙏 User name doesn't check out. Hey update on the amount of money you got. Hope he gets okay, ❤️ Transferred some money . Your welcome, manchild. Pretty sure you wrote this using chatgpt but ok. I wish i had done this for my cat maybe she might have been still alive. FUCK it hurts thinking about how much she suffered before finally bring able to rest in peace. Reach, hope the cato recovers soon ✨ ??? Reach I pity those around you Did whatever Little i could. Sent a very menial ammount, but I hope Alex gets well soon How much amount have you collected until now? Did my part jitna bhi I could.. hopefully billu Bhai will recover soon .. please share updates ❤️ This street dog menac is getting out of hand OP update please. UPDATE: Alex is better now , his vitals are okay , swelling is still there. He is eating food properly , he would be discharged by today evening and then he would be kept in foster for 10 days . You should also make it easier for NRIs to donate. Many NRIs don't have UPI. Maybe ask the vet to accept international CC? Also, try posing on gofundme (although not sure how it will work with International money transfer). Thankyou so much❤️ Thankyou ❤️ Thankyou ❤️ Thankyou so much ❤️ You are welcome, send me pictures when your friend is all better Updated in comments Can you donate via PayPal? PayPal : Upvoted for visibility Please cross post this on /r/pune Already posted in r/pune Thankyou ❤️ Thankyou ❤️ Thankyou ❤️ for donating Your username though 💀💀 Hey did you reach your donation goal? Did this guy give any update on the Cat? I had donated and asked for updates and this guy hasn't given any update yet. Did this guy give any update on the cat ? I have donated and have been asking for updates but he hasn't updated about the cat's health yet. Yes We don't need donations anymore Thankyou everyone for donating and helping us,❤️ We don't need donations anymore Bro I updated in comments , he is currently at Foster for 10 days, if you want videos I can send UPDATE- Alex is Fine now , he still has Swelling, his wounds are healing slowly , he's eating food properly. thankyou everyone for donating ❤️. WE DON'T NEED DONATIONS ANYMORE Yes please. Kindly do the needful in my DM . I had specifically requested you to give some updates."
}