{
    "id": "17r9b6v",
    "title": "Did they miss any mobile brand?",
    "url": "https://www.reddit.com/gallery/17r9b6v",
    "selftext": "Recently purchased (yes cheq chips are paid) a voucher for reliance digital on cheq… looks like cannot use it to buy phone\n\nCannot use it for any cart less than 35k… I thought the text says on 20k it gives 2k\n\nLife lessons: do not get greedy with vouchers. The t&c are a must read in such cases. \nApps which give rewards on payment will one day fail you…\n\nWhich other apps do you use for credit card payments? Any app where it is free to pay bills (no rewards)? \nTIA",
    "flair": "Rant / Vent",
    "score": 305,
    "num_comments": 67,
    "created_utc": 1699522337.0,
    "convurl": "https://i.redd.it/v576yysgkazb1.jpg",
    "comments": [
        "They want you to buy Samsung S series or A series 🫠",
        "Only Oppo, Nothing and Lava are left.",
        "T&C are always in favor of these companies, always.",
        "Nokia",
        "Nokia , motorola",
        "Motorola's there",
        "Blackberry",
        "Samsung, Pixel, Sony, LG and Nokia",
        "Micromax",
        "does asus not sell any phone anymore",
        "I wanted to buy motorola edge 40",
        "Funniest part is in 2nd ss it says this coupon code gives me 2k discount on 20k… but the customer support is arguing that voucher is applicable on 35k purchase only 😂",
        "Micromax",
        "Samsung s&a series",
        "I use Cred and some of the vouchers you get there are actually great for online shopping. \n\nG-pay has drastically gone down the drain in terms of quality of scratch cards.",
        "Everything reliance is a scam, pick the 2^nd beat thing. For example: Instead of Jio Gigafibre… Airtel Xstream it is~",
        "Lg doesn't make phones anymore, Sony is not available in India, Pixel is Flipkart exclusive",
        "Brand name ka gyaan chodne aagy sb bhsdi wale",
        "They left pixel",
        "Nokia 2310 bro.\n\nThe father of all phones.",
        "Iqoo",
        "Iqoo neo 7 is nice but not on reliance digital last i checked",
        "No it's not, just checked, \nYou can count in Itel tho",
        "Man the brands they have not mentioned here are not available on their stores anyways 😂😂 \n\nA lot of people here suggest pixel but even pixel is not sold there",
        "They missed Nothing",
        "Jio phone",
        "True google is not but itel is or atleast the low range ones anyway",
        "They forgot 'nothing'",
        "Google too",
        "Get Samsung s23(that's probably what they want you to buy anyway lmao). Reliance digital stores are filled with Samsung phones for a reason ig.",
        "They left out Asus",
        "Nokia,Oppo,Infinix,Nothing,Lava,Micromax",
        "Wow,  finally time traveler  from 2009.",
        "Jio ka phone lo bol rhe indirectly!!!\n\nWaise Karbonn, lava bhi le sakege",
        "I see what you did there.",
        "Justice for these guys 🙏",
        "Bro you already got a 14 Pro Max/iPhone 15 series💀",
        "For my father😅",
        "i bought it recently, its a good phone for its price main issues are \n\nits curved display, screen protector is more expensive for such phones and they also wear off quicker and sometimes some apps dont respond even after clicking on them because my hand is touching the screen around the edge when i am holding the phone\n\ncamera is meh, not recommended if thats a priority. i heard gcam improves it but the improvement is barely noticeable\n\nother than this two i thought everything else was good.",
        "Damn now they don't make it in 2023. Fair enough my time travelling days are over.",
        "iQoo",
        "Google pixel le le bhai",
        "Philips, Haier, Dell",
        "Redmi, honor, google pixel, oppo, lava, nokia, lenovo, asus, samsung s series a series",
        "GCam improvements are noticable. By default the camera processes the hell out of all the back cameras and makes the photo look very soft. Colour science is not very good either. The worst part is the shutter lag - it's not blaringly bad, but just enough that you might think it was your mistake.\n\nGCam fixes all of that.",
        "You are a sus my guy , you left nothing",
        "Pixel",
        "Lava?",
        "Freedom 251😂",
        "Only voucher I use is 3 free credit audible",
        "Pixel",
        "Galaxy high end phones are included.",
        "Lundphone",
        "Lenovo mi oppo lava",
        "I avoid buying anything from Reliance Digital. All their offers are bogus.\n\nI remember I was looking for a washing machine at Reliance but its price was around 4-5K higher compared to other stores. The salesman said there's a special offer on the machine. You will get a microwave for free. When I asked how much the microwave was worth, they said 6K.\n\nEven Jio used to offer these so called discounts worth 5000 when buying a phone. But it was in the form of Rs 50 coupons for recharging Jio which you could only apply once per month.",
        "Coupon valid for Samsung A and S series",
        "Get yourself a pixel mate",
        "Freedom 251",
        "Am I the only person having ASUS Device from 2018 and still rocking in 2023 with Android 14?",
        "Nokia",
        "Lava..",
        "They became a network security company",
        "Asus, Iqoo, nothing phone",
        "Google",
        "Samsung A and S series isn't excluded",
        "Or Z",
        "Oppo,Asus,nothing",
        "Freedom 251",
        "Bro uninstall cred, you would be much more happy",
        "You mean cheq? This was cheq (but yea uninstalled it... Traps to make you spend more money)"
    ],
    "cleaned_text": "miss mobile brand recently purchased yes cheq chips paid voucher reliance digital cheq looks like use buy phone use cart less k thought text says k gives k life lessons get greedy vouchers tc must read cases apps give rewards payment one day fail apps use credit card payments app free pay bills rewards tia ",
    "cleaned_title": "miss mobile brand",
    "cleaned_selftext": "recently purchased yes cheq chips paid voucher reliance digital cheq looks like use buy phone use cart less k thought text says k gives k life lessons get greedy vouchers tc must read cases apps give rewards payment one day fail apps use credit card payments app free pay bills rewards tia",
    "cleaned_comments": "want buy samsung series series oppo nothing lava left tc always favor companies always nokia nokia motorola motorolas blackberry samsung pixel sony lg nokia micromax asus sell phone anymore wanted buy motorola edge funniest part nd ss says coupon code gives k discount k customer support arguing voucher applicable k purchase micromax samsung sa series use cred vouchers get actually great online shopping gpay drastically gone drain terms quality scratch cards everything reliance scam pick nd beat thing example instead jio gigafibre airtel xstream lg doesnt make phones anymore sony available india pixel flipkart exclusive brand name ka gyaan chodne aagy sb bhsdi wale left pixel nokia bro father phones iqoo iqoo neo nice reliance digital last checked checked count itel tho man brands mentioned available stores anyways lot people suggest pixel even pixel sold missed nothing jio phone true google itel atleast low range ones anyway forgot nothing google get samsung sthats probably want buy anyway lmao reliance digital stores filled samsung phones reason ig left asus nokiaoppoinfinixnothinglavamicromax wow finally time traveler jio ka phone lo bol rhe indirectly waise karbonn lava bhi le sakege see justice guys bro already got pro maxiphone series father bought recently good phone price main issues curved display screen protector expensive phones also wear quicker sometimes apps dont respond even clicking hand touching screen around edge holding phone camera meh recommended thats priority heard gcam improves improvement barely noticeable two thought everything else good damn dont make fair enough time travelling days iqoo google pixel le le bhai philips haier dell redmi honor google pixel oppo lava nokia lenovo asus samsung series series gcam improvements noticable default camera processes hell back cameras makes photo look soft colour science good either worst part shutter lag blaringly bad enough might think mistake gcam fixes sus guy left nothing pixel lava freedom voucher use free credit audible pixel galaxy high end phones included lundphone lenovo mi oppo lava avoid buying anything reliance digital offers bogus remember looking washing machine reliance price around k higher compared stores salesman said theres special offer machine get microwave free asked much microwave worth said k even jio used offer called discounts worth buying phone form rs coupons recharging jio could apply per month coupon valid samsung series get pixel mate freedom person asus device still rocking android nokia lava became network security company asus iqoo nothing phone google samsung series isnt excluded z oppoasusnothing freedom bro uninstall cred would much happy mean cheq cheq yea uninstalled traps make spend money",
    "light_cleaned_title": "Did they miss any mobile brand?",
    "light_cleaned_selftext": "Recently purchased (yes cheq chips are paid) a voucher for reliance digital on cheq… looks like cannot use it to buy phone Cannot use it for any cart less than 35k… I thought the text says on 20k it gives 2k Life lessons: do not get greedy with vouchers. The t&c are a must read in such cases. Apps which give rewards on payment will one day fail you… Which other apps do you use for credit card payments? Any app where it is free to pay bills (no rewards)? TIA",
    "light_cleaned_comments": "They want you to buy Samsung S series or A series 🫠 Only Oppo, Nothing and Lava are left. T&C are always in favor of these companies, always. Nokia Nokia , motorola Motorola's there Blackberry Samsung, Pixel, Sony, LG and Nokia Micromax does asus not sell any phone anymore I wanted to buy motorola edge 40 Funniest part is in 2nd ss it says this coupon code gives me 2k discount on 20k… but the customer support is arguing that voucher is applicable on 35k purchase only 😂 Micromax Samsung s&a series I use Cred and some of the vouchers you get there are actually great for online shopping. G-pay has drastically gone down the drain in terms of quality of scratch cards. Everything reliance is a scam, pick the 2^nd beat thing. For example: Instead of Jio Gigafibre… Airtel Xstream it is~ Lg doesn't make phones anymore, Sony is not available in India, Pixel is Flipkart exclusive Brand name ka gyaan chodne aagy sb bhsdi wale They left pixel Nokia 2310 bro. The father of all phones. Iqoo Iqoo neo 7 is nice but not on reliance digital last i checked No it's not, just checked, You can count in Itel tho Man the brands they have not mentioned here are not available on their stores anyways 😂😂 A lot of people here suggest pixel but even pixel is not sold there They missed Nothing Jio phone True google is not but itel is or atleast the low range ones anyway They forgot 'nothing' Google too Get Samsung s23(that's probably what they want you to buy anyway lmao). Reliance digital stores are filled with Samsung phones for a reason ig. They left out Asus Nokia,Oppo,Infinix,Nothing,Lava,Micromax Wow, finally time traveler from 2009. Jio ka phone lo bol rhe indirectly!!! Waise Karbonn, lava bhi le sakege I see what you did there. Justice for these guys 🙏 Bro you already got a 14 Pro Max/iPhone 15 series💀 For my father😅 i bought it recently, its a good phone for its price main issues are its curved display, screen protector is more expensive for such phones and they also wear off quicker and sometimes some apps dont respond even after clicking on them because my hand is touching the screen around the edge when i am holding the phone camera is meh, not recommended if thats a priority. i heard gcam improves it but the improvement is barely noticeable other than this two i thought everything else was good. Damn now they don't make it in 2023. Fair enough my time travelling days are over. iQoo Google pixel le le bhai Philips, Haier, Dell Redmi, honor, google pixel, oppo, lava, nokia, lenovo, asus, samsung s series a series GCam improvements are noticable. By default the camera processes the hell out of all the back cameras and makes the photo look very soft. Colour science is not very good either. The worst part is the shutter lag - it's not blaringly bad, but just enough that you might think it was your mistake. GCam fixes all of that. You are a sus my guy , you left nothing Pixel Lava? Freedom 251😂 Only voucher I use is 3 free credit audible Pixel Galaxy high end phones are included. Lundphone Lenovo mi oppo lava I avoid buying anything from Reliance Digital. All their offers are bogus. I remember I was looking for a washing machine at Reliance but its price was around 4-5K higher compared to other stores. The salesman said there's a special offer on the machine. You will get a microwave for free. When I asked how much the microwave was worth, they said 6K. Even Jio used to offer these so called discounts worth 5000 when buying a phone. But it was in the form of Rs 50 coupons for recharging Jio which you could only apply once per month. Coupon valid for Samsung A and S series Get yourself a pixel mate Freedom 251 Am I the only person having ASUS Device from 2018 and still rocking in 2023 with Android 14? Nokia Lava.. They became a network security company Asus, Iqoo, nothing phone Google Samsung A and S series isn't excluded Or Z Oppo,Asus,nothing Freedom 251 Bro uninstall cred, you would be much more happy You mean cheq? This was cheq (but yea uninstalled it... Traps to make you spend more money)"
}