{
    "id": "15ofsre",
    "title": "Section 377 out, new bill also provides no protection to men against sex assault",
    "url": "https://www.indiatoday.in/law-today/story/section-377-dropped-in-bill-no-punishment-for-unnatural-sex-offences-against-men-2419706-2023-08-11",
    "selftext": "The new bill removed the only law that men could use to claim sexual assault. While the laws never allowed men to be seen as victims of female perpetrators, 377 at least allowed men to file cases of sexual misconduct against other men. Men are already far less likely to report rape or sexual assault, especially by another man due to the rampant homophobia and toxic masculinity in this country and the whole world, but now the few men who want to CAN'T?! The new bill will provide absolutely no protection to men from any kind sexual assault.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 53,
    "created_utc": 1691776655.0,
    "convurl": "https://external-preview.redd.it/EVpNQzHnxpL7gyo4puY9wyL4Y4O7y6tuGjPZXoBFeXU.jpg?auto=webp&s=86cc4500d141ede6b45c25c2552ab2813db2294c",
    "comments": [
        "Hmm, men should be addressed as victim when he gets sexually assaulted by another man. Similarly Women should be accused of being a sex offended when another women or minor is victim.",
        "Hindi me naam hai… buss. Orr kuch nhi. \n\nAb time to reinvent the wheel. \n\nThrow the baby with bathwater. Busy bhi to dikhna hai. Decolonisation horha hai… majak thore hai.\n\nPolicy experts ne soch ke kiya hoga to accha hi kiya hoga.\n\nBla bla bla bla bla \n\nFucking morons.",
        "We are just evolving backwards",
        "Nahi nahi, pre marital sex ko basically illegal kiya hai na.\n\nAur sedition karneki toh sochna bhi mat umar kaid hai ab.",
        "[Added to the list](https://old.reddit.com/r/india/comments/15o2aui/home_minister_introduces_bill_to_amend_indian/jvqmjsn/)",
        "Pussy nahi toh SA se protection nahi?",
        "Our legal system still thinks that \"Men can't be raped\".\n\nSo if a man gets involved in a fake SA case, the woman can't be blamed, the man is almost immediately guilty, his life is ruined, his reputation is gone, his job is gone. But the woman will be supported thoroughly by society and the legal system (which was made to protect everybody).\n\nIf a man gets assaulted, we just have to live with it. That's it? Now it's very easily plausible why 51% of the suicides among men accused of sexual assault were due to false allegations being leveled against them.\n\nSource: https://m.timesofindia.com/city/delhi/protect-men-against-false-allegations-say-protesters/articleshow/69315200.cms\n\nIs this the equality we are enforcing?",
        "Something needs to change.",
        "Typical. I am a male who was sexually assaulted as a teenager, so fuck this sexist bullshit. Guess I'll get a gun to defend myself against others.",
        "And also across genders. There are women who sexually assault men. None of the laws should be based on gender, they should be gender-neutral.",
        ">we just have to live with it.\n\nJust chant the magic words \"it is what it is\"",
        ">Is this the equality we are enforcing?\n\nLots of toxic feminists who want entitlement and privilege, not equality. They often use it to abuse others in the name of \"protecting women\".",
        "There is no such case on earth where women has assaulted adult men. There are cases when secual offender I women and the victim is boy or teenager.",
        "Bro u r wrong.",
        "Yes they can't yaar. Men can't be. Why r u so mad? There is no case of it so chill its not worthy doing that coz that's never gonna happen.",
        "I'd love to see how the MRA sanghis react to this. These are undoubted issues with patriarchy altogether. When you vote against female empowerment you're also voting against not so obvious ideologies that affect men equally.",
        "Where the fuck is feminism coming from here? This bill is literally a result of the sanghi government we put into power. They're literally the opposite of feminists. Instead of picking the retarded lawmakers you're picking on women who fight for their rights (and rightfully so).",
        "They don't care about male victims of men. They care about male victims of women because that's easy to weaponise when talking against feminism. They'll just blame the lack of men's rights on feminism, not the patriarchy in India that's fucking all of us over.",
        "Indian voters are just brain dead. All you need is to stir some religious issue out of thin air. That's all it takes to win an election in India. Misogyny, casteism, sexism, fascism and everything else just comes gift wrapped when you elect sanghi leaders. I fucking hate the political atmosphere in India.",
        "You know the laws removed were labeled anti gay and homophobic right?\n\n\n>When you vote against female empowerment \n\nWhen did we do that?",
        "This is insane mental gymnastics\n\n377 was labelled Anti gay and homophobic and was supposed to be removed\nIt criminalised gay sex\nRead the 377 you'll realise \nDo not spread misinformation.\n\nThe base of laws for sexual assault of men cannot be built upon 377\nIt needs new land and cement.\n\nYou're clearly jumping the bandwagon",
        "Why isn't rape a gender neutral crime then? Men can't be assaulted? \n\nAlso what do you mean when did we do that? When your MLAs go around calling rapists sanskari, garlanding them, not holding elected representatives accountable for the sexual crimes they've committed, parading women naked and a million other things sanghis have done how can you claim nothing was ever done? This government prematurely released convicted rapists and murderers. Normally these things would warrant the death penalty but here they had their feet touched, garlanded them, and had them greeted with sweets. In a nutshell if you commit crimes against humanity you are rewarded by the BJP as long as it fits their narrative.",
        " Men being majority in the Parliament still cannot pass a bill that can protect men from sexual assault. Now, the one act, removed.\n\nFuture will see a rise in sexual assaults on men mostly by men.",
        "You are extremely wrong if you think this is what feminism intends for, infact feminism supports men expressing their traumatic experiences which patriarchy (which our legal and society system is entrenched in) doesn't allow and also believes men are stronger so they can't be sexually harmed by men or women.",
        "The SC had declared that only non consensual sexual intercourse between males would be illegal under 377, and had decriminalized the consensual sex. \n\nThe government could have just added the words non-consensual to the section and the amendment would have fixed the issue. \n\nEven if we want a new base for sexual assault on men, where is this base in the new ~~Code~~ Sanhita?",
        "it's a canon event",
        "Lol feminists have regularly opposed laws to make rape laws gender neutral. https://m.timesofindia.com/india/cabinet-nod-to-make-rape-gender-neutral-riles-womens-groups/articleshow/15049606.cms",
        "Yes, but do you think the current government will even speak a word about such a bill. This was the best we had.\n\nIdeally they should have made rape gender neutral",
        "State of gun laws in India is completely fucked. I wanted to get a gun later in life but there's so many hoops you need to jump through for it, extremely small amount of legal guns, and the ones which are legal are fuck expensive and even compared to other country prices you pay up to 20 times (not a typo or exaggeration) for the same gun.",
        "Wanted to stay in the country \n\n\nBut looks like I'll be leaving very soon",
        "This is an 11 year old ordeal where the entire basis of \"no men get assaulted\" was based on the the lack of data. Which is a terrible way to go and it is absolutely wrong. \n\nThis 1 standalone group of feminists don't comprise feminism as a whole which is focused on gender neutrality more so than a decade ago.\n\nThis country doesn't take rape against women seriously, you think they will take rape against men even slightly seriously?",
        "Once again, read the article and little bit more about it before commenting. While removing the anti-gay aspect is good, this was the last and final piece of law that allowed men to seek redressal for being victims of at least one kind of sexual assault.",
        ">final piece of law that allowed men to seek redressal for being victims of at least one kind of sexual assault.\n\nYes we need the government and judiciary to acknowledge that but it couldn't be done on the hunched back of 377.\n\nI think these things are a building up process\nHopefully with time as what takes precedence before this is martial rapes, which are still gray area for our constitution.",
        "That too despite having the parliament in Delhi. Don't they read the [news](https://www.firstpost.com/india/new-delhi-man-slapped-by-date-raped-by-restaurant-owner-bouncer-after-row-over-inflated-bill-12958222.html)?",
        "these laws come from the bureaucracy, not the government. Too many people forget this. The text, the nuance, the exclusions and inclusions are all drafted by bureaucrats. The clowns in parliament often have no idea what is even in these bills.\n\nThe problem is, the bureaucracy identified crimes against women as a problem right from Independence. This is why we have nonsense \"Crimes\" like outraging the \"modesty\" of a woman but not a man.\n\nWe have a problem with violence against women in india but we also have a problem of infantalising women. we also have a problem with equal access to the legal system. All this law will do is be weaponised by wealthy women as a get out of jail free card.",
        "Forgot to add /s unless you are joking",
        "No, they don't follow news and also stay detached from realities.",
        "Law needs to be changed.",
        "Sedition ab bhi nhi hataya matlab?!",
        "What can one do if he/she is too poor to emigrate?",
        "Why you find this ridiculing? There is no such cases, and I all I said is men don't need to worry coz it never happens.",
        "[https://en.wikipedia.org/wiki/Rape\\_of\\_males](https://en.wikipedia.org/wiki/Rape_of_males)",
        "Austria job seekers visa.",
        "Yeah, these are the only article you enjoy to read. Go read it your whole life, feel satisfied. \nI bet these are the only article you have read in life.",
        "Why are you angry ? I was just trying to say that men do rape other men also there have been such cases in India also. Even boys are protected by POSCO for a good reason.",
        "Ohh, sorry in thought u r justifying the cases where women are sexual offenders. Yeah, in all the cases it's men who did it to other men.",
        ">Yeah, in all the cases it's men who did it to other men.\n\nYou are wrong",
        "this is exactly I've been looking for since the news came out. \nno protection to false rape charges and no mention of physical abuse or mental abuse of male.",
        "Naam badla hai baas. Aur punishment increase kiya hai. Also, seditious speeches won't be construed as sedition apparently.",
        "The idea it needs \"new cement\" doesn't justify removing it WITHOUT a replacement. \n\n377 was homophobic and was used to criminalise consensual gay relationships but it was also used by male rape victims and married women who can't file rape cases under 376 because of the marriage exception. The bench took note of the fact that it is the only law that dealt with male rape when they read it down. Otherwise it would have struck down instead of read down.",
        "It is very obvious that his argument is only to defend the government.",
        "Naam badla h...kanoon wahi h..ulta usmein penalty pehle se bad gayi h",
        "The people who defended the NDA about the Trans Act, you are gonna get fruits of your labour soon.",
        "They know. It is intentional. The government knows very well about 377 being the only law that protects men. It was part of the 377 hearing. This is exactly why 377 was read down and not struck down.",
        ">Why isn't rape a gender neutral crime then? Men can't be assaulted? \nIt is and yes men are assaulted but you have to be realistic to expect such a change. Our constitution still doesn't cover the martial rapes, to expect rigorous punishment for male victims of sexual assault is simply in the future. 377 is ridiculous excuse of justice to men victims of sexual assault when in reality it truly aimed at punishing 'sodomy' consensual or non consensual later modified in 2019 by SC. \nThe key thing to be noted is that for committing sexual violence, the perpetrator and the victim can be of any gender, unlike what is mentioned in Section 354A to 354D and Section 375 of The Indian Penal Code, which states that only a man can be the perpetrator.\n\"Only a man can be a perpetrator\" is the nature of our constitution. You see the tone? \nAnyways I'm hopeful with the rise of importance of sexuality and gender at the zenith of its relevance, we'll see some positive changes in laws regarding this context.\n>When your MLAs go around calling rapists sanskari, garlanding them, not holding elected representatives accountable for the sexual crimes they've committed,\nNot my MLA's, not my elected representatives. They should be shamed publicly for garlanding the convicts.\nIn my opinion Bilkis Rape convicts should be tortured until the light in their eyes go dim yet they are out after serving some 15 years with more than 1000 years in bail.\nHow horrendous and unjust this feels right? Yet all of this was 'legal' which is exactly my point and should be the point of discussion. There should be no such provision to do this.\nThe laws aren't enough to punish justly and to prevent such nature of crimes. People given the opportunity will always use this powerful favouring system of judiciary, legislative to manipulate and exploit for personal or political gains.\n> parading women naked\nMeities case wasn't of religion as it might be projected,\nThere are Christian and Muslims Meities too.\nIt's a conflict between 2 hill tribes.\nAgain what do you think the sentence of the caught will be? there was a whole mob but only four are caught and to be accused right? Is that right? \nstill no law for punishing a mob in such context.\nNow yesterday a bill was introduced which will punish mob for lynching upto 7 years jail time or life imprisonment or even death sentence. \n>million other things sanghis have done how can you claim nothing was ever done?\nReminds me of kathua case after which the government introduced the death penalty for the rape of 12 yrs old or younger. \n\nNow since you're sanghi this sanghi that\nRemember ajmer case in 1992, involved the serial gangrape and blackmailing of more than 300-500 school and college-aged girls in Ajmer, Rajasthan\nAll school or college girls were mostly underage. \nIt was in definite terms congress run scandal where school girls were gangraped then blackmailed by a photo colour lab printed the nude photographs of the women and helped circulate them.\nNow even the most leftist of newspapers claim the victim count to be more than 100, others claim 300 to 500, obviously such large scale operation wasn't run by youth wing of congress as it was made after getting caught. \nAnyway a reporter exposed and youth leader of congress were made the scapegoat. \nNow farooq chisti one of the masterminds of this operation has in  2007, a fast-track court sentenced him to life. In 2013, the Rajasthan High Court deemed he had served enough time and released him. Yes that's his punishment.\n\nIf you know the names of all culprits its easy to give this a communal angle but that's not what I'm trying to pontificate.\n\n\n“Dargah par aane wale log unke hath choomte hai (People coming to the Dargah used to kiss the hand of this fellow). Living a lavish life in Ajmer. \n\n\"They used this religious power to get political influence. SPs to SHOs would call them to negotiate over FIRs or issue appeals. No one could say no to them,” says 'the print'.\n\nThe point I'm trying to make is there are loopholes that can be manipulated and thats why judiciary needs a reform. Unless it happens political parties all corrupt at core will use it to exploit you and me.\n\nCongress aur bjp are not different. \"Bjp is congress+ cow\"- arun shourie."
    ],
    "cleaned_text": "section new bill also provides protection men sex assault new bill removed law men could use claim sexual assault laws never allowed men seen victims female perpetrators least allowed men file cases sexual misconduct men men already far less likely report rape sexual assault especially another man due rampant homophobia toxic masculinity country whole world men want cant new bill provide absolutely protection men kind sexual assault ",
    "cleaned_title": "section new bill also provides protection men sex assault",
    "cleaned_selftext": "new bill removed law men could use claim sexual assault laws never allowed men seen victims female perpetrators least allowed men file cases sexual misconduct men men already far less likely report rape sexual assault especially another man due rampant homophobia toxic masculinity country whole world men want cant new bill provide absolutely protection men kind sexual assault",
    "cleaned_comments": "hmm men addressed victim gets sexually assaulted another man similarly women accused sex offended another women minor victim hindi naam hai buss orr kuch nhi ab time reinvent wheel throw baby bathwater busy bhi dikhna hai decolonisation horha hai majak thore hai policy experts ne soch ke kiya hoga accha hi kiya hoga bla bla bla bla bla fucking morons evolving backwards nahi nahi pre marital sex ko basically illegal kiya hai na aur sedition karneki toh sochna bhi mat umar kaid hai ab added listhttpsoldredditcomrindiacommentsoauihomeministerintroducesbilltoamendindianjvqmjsn pussy nahi toh sa se protection nahi legal system still thinks men cant raped man gets involved fake sa case woman cant blamed man almost immediately guilty life ruined reputation gone job gone woman supported thoroughly society legal system made protect everybody man gets assaulted live thats easily plausible suicides among men accused sexual assault due false allegations leveled source equality enforcing something needs change typical male sexually assaulted teenager fuck sexist bullshit guess ill get gun defend others also across genders women sexually assault men none laws based gender genderneutral live chant magic words equality enforcing lots toxic feminists want entitlement privilege equality often use abuse others name protecting women case earth women assaulted adult men cases secual offender women victim boy teenager bro u r wrong yes cant yaar men cant r u mad case chill worthy coz thats never gon na happen id love see mra sanghis react undoubted issues patriarchy altogether vote female empowerment youre also voting obvious ideologies affect men equally fuck feminism coming bill literally result sanghi government put power theyre literally opposite feminists instead picking retarded lawmakers youre picking women fight rights rightfully dont care male victims men care male victims women thats easy weaponise talking feminism theyll blame lack mens rights feminism patriarchy india thats fucking us indian voters brain dead need stir religious issue thin air thats takes win election india misogyny casteism sexism fascism everything else comes gift wrapped elect sanghi leaders fucking hate political atmosphere india know laws removed labeled anti gay homophobic right vote female empowerment insane mental gymnastics labelled anti gay homophobic supposed removed criminalised gay sex read youll realise spread misinformation base laws sexual assault men built upon needs new land cement youre clearly jumping bandwagon isnt rape gender neutral crime men cant assaulted also mean mlas go around calling rapists sanskari garlanding holding elected representatives accountable sexual crimes theyve committed parading women naked million things sanghis done claim nothing ever done government prematurely released convicted rapists murderers normally things would warrant death penalty feet touched garlanded greeted sweets nutshell commit crimes humanity rewarded bjp long fits narrative men majority parliament still pass bill protect men sexual assault one act removed future see rise sexual assaults men mostly men extremely wrong think feminism intends infact feminism supports men expressing traumatic experiences patriarchy legal society system entrenched doesnt allow also believes men stronger cant sexually harmed men women sc declared non consensual sexual intercourse males would illegal decriminalized consensual sex government could added words nonconsensual section amendment would fixed issue even want new base sexual assault men base new code sanhita canon event lol feminists regularly opposed laws make rape laws gender neutral yes think current government even speak word bill best ideally made rape gender neutral state gun laws india completely fucked wanted get gun later life theres many hoops need jump extremely small amount legal guns ones legal fuck expensive even compared country prices pay times typo exaggeration gun wanted stay country looks like ill leaving soon year old ordeal entire basis men get assaulted based lack data terrible way go absolutely wrong standalone group feminists dont comprise feminism whole focused gender neutrality decade ago country doesnt take rape women seriously think take rape men even slightly seriously read article little bit commenting removing antigay aspect good last final piece law allowed men seek redressal victims least one kind sexual assault final piece law allowed men seek redressal victims least one kind sexual assault yes need government judiciary acknowledge couldnt done hunched back think things building process hopefully time takes precedence martial rapes still gray area constitution despite parliament delhi dont read newshttpswwwfirstpostcomindianewdelhimanslappedbydaterapedbyrestaurantownerbouncerafterrowoverinflatedbillhtml laws come bureaucracy government many people forget text nuance exclusions inclusions drafted bureaucrats clowns parliament often idea even bills problem bureaucracy identified crimes women problem right independence nonsense crimes like outraging modesty woman man problem violence women india also problem infantalising women also problem equal access legal system law weaponised wealthy women get jail free card forgot add unless joking dont follow news also stay detached realities law needs changed sedition ab bhi nhi hataya matlab one heshe poor emigrate find ridiculing cases said men dont need worry coz never happens httpsenwikipediaorgwikirapeofmaleshttpsenwikipediaorgwikirapeofmales austria job seekers visa yeah article enjoy read go read whole life feel satisfied bet article read life angry trying say men rape men also cases india also even boys protected posco good reason ohh sorry thought u r justifying cases women sexual offenders yeah cases men men yeah cases men men wrong exactly ive looking since news came protection false rape charges mention physical abuse mental abuse male naam badla hai baas aur punishment increase kiya hai also seditious speeches wont construed sedition apparently idea needs new cement doesnt justify removing without replacement homophobic used criminalise consensual gay relationships also used male rape victims married women cant file rape cases marriage exception bench took note fact law dealt male rape read otherwise would struck instead read obvious argument defend government naam badla hkanoon wahi hulta usmein penalty pehle se bad gayi h people defended nda trans act gon na get fruits labour soon know intentional government knows well law protects men part hearing exactly read struck isnt rape gender neutral crime men cant assaulted yes men assaulted realistic expect change constitution still doesnt cover martial rapes expect rigorous punishment male victims sexual assault simply future ridiculous excuse justice men victims sexual assault reality truly aimed punishing sodomy consensual non consensual later modified sc key thing noted committing sexual violence perpetrator victim gender unlike mentioned section section indian penal code states man perpetrator man perpetrator nature constitution see tone anyways im hopeful rise importance sexuality gender zenith relevance well see positive changes laws regarding context mlas go around calling rapists sanskari garlanding holding elected representatives accountable sexual crimes theyve committed mlas elected representatives shamed publicly garlanding convicts opinion bilkis rape convicts tortured light eyes go dim yet serving years years bail horrendous unjust feels right yet legal exactly point point discussion provision laws arent enough punish justly prevent nature crimes people given opportunity always use powerful favouring system judiciary legislative manipulate exploit personal political gains parading women naked meities case wasnt religion might projected christian muslims meities conflict hill tribes think sentence caught whole mob four caught accused right right still law punishing mob context yesterday bill introduced punish mob lynching upto years jail time life imprisonment even death sentence million things sanghis done claim nothing ever done reminds kathua case government introduced death penalty rape yrs old younger since youre sanghi sanghi remember ajmer case involved serial gangrape blackmailing school collegeaged girls ajmer rajasthan school college girls mostly underage definite terms congress run scandal school girls gangraped blackmailed photo colour lab printed nude photographs women helped circulate even leftist newspapers claim victim count others claim obviously large scale operation wasnt run youth wing congress made getting caught anyway reporter exposed youth leader congress made scapegoat farooq chisti one masterminds operation fasttrack court sentenced life rajasthan high court deemed served enough time released yes thats punishment know names culprits easy give communal angle thats im trying pontificate dargah par aane wale log unke hath choomte hai people coming dargah used kiss hand fellow living lavish life ajmer used religious power get political influence sps shos would call negotiate firs issue appeals one could say says print point im trying make loopholes manipulated thats judiciary needs reform unless happens political parties corrupt core use exploit congress aur bjp different bjp congress cow arun shourie",
    "light_cleaned_title": "Section 377 out, new bill also provides no protection to men against sex assault",
    "light_cleaned_selftext": "The new bill removed the only law that men could use to claim sexual assault. While the laws never allowed men to be seen as victims of female perpetrators, 377 at least allowed men to file cases of sexual misconduct against other men. Men are already far less likely to report rape or sexual assault, especially by another man due to the rampant homophobia and toxic masculinity in this country and the whole world, but now the few men who want to CAN'T?! The new bill will provide absolutely no protection to men from any kind sexual assault.",
    "light_cleaned_comments": "Hmm, men should be addressed as victim when he gets sexually assaulted by another man. Similarly Women should be accused of being a sex offended when another women or minor is victim. Hindi me naam hai… buss. Orr kuch nhi. Ab time to reinvent the wheel. Throw the baby with bathwater. Busy bhi to dikhna hai. Decolonisation horha hai… majak thore hai. Policy experts ne soch ke kiya hoga to accha hi kiya hoga. Bla bla bla bla bla Fucking morons. We are just evolving backwards Nahi nahi, pre marital sex ko basically illegal kiya hai na. Aur sedition karneki toh sochna bhi mat umar kaid hai ab. [Added to the list](https://old.reddit.com/r/india/comments/15o2aui/home_minister_introduces_bill_to_amend_indian/jvqmjsn/) Pussy nahi toh SA se protection nahi? Our legal system still thinks that \"Men can't be raped\". So if a man gets involved in a fake SA case, the woman can't be blamed, the man is almost immediately guilty, his life is ruined, his reputation is gone, his job is gone. But the woman will be supported thoroughly by society and the legal system (which was made to protect everybody). If a man gets assaulted, we just have to live with it. That's it? Now it's very easily plausible why 51% of the suicides among men accused of sexual assault were due to false allegations being leveled against them. Source: Is this the equality we are enforcing? Something needs to change. Typical. I am a male who was sexually assaulted as a teenager, so fuck this sexist bullshit. Guess I'll get a gun to defend myself against others. And also across genders. There are women who sexually assault men. None of the laws should be based on gender, they should be gender-neutral. >we just have to live with it. Just chant the magic words \"it is what it is\" >Is this the equality we are enforcing? Lots of toxic feminists who want entitlement and privilege, not equality. They often use it to abuse others in the name of \"protecting women\". There is no such case on earth where women has assaulted adult men. There are cases when secual offender I women and the victim is boy or teenager. Bro u r wrong. Yes they can't yaar. Men can't be. Why r u so mad? There is no case of it so chill its not worthy doing that coz that's never gonna happen. I'd love to see how the MRA sanghis react to this. These are undoubted issues with patriarchy altogether. When you vote against female empowerment you're also voting against not so obvious ideologies that affect men equally. Where the fuck is feminism coming from here? This bill is literally a result of the sanghi government we put into power. They're literally the opposite of feminists. Instead of picking the retarded lawmakers you're picking on women who fight for their rights (and rightfully so). They don't care about male victims of men. They care about male victims of women because that's easy to weaponise when talking against feminism. They'll just blame the lack of men's rights on feminism, not the patriarchy in India that's fucking all of us over. Indian voters are just brain dead. All you need is to stir some religious issue out of thin air. That's all it takes to win an election in India. Misogyny, casteism, sexism, fascism and everything else just comes gift wrapped when you elect sanghi leaders. I fucking hate the political atmosphere in India. You know the laws removed were labeled anti gay and homophobic right? >When you vote against female empowerment When did we do that? This is insane mental gymnastics 377 was labelled Anti gay and homophobic and was supposed to be removed It criminalised gay sex Read the 377 you'll realise Do not spread misinformation. The base of laws for sexual assault of men cannot be built upon 377 It needs new land and cement. You're clearly jumping the bandwagon Why isn't rape a gender neutral crime then? Men can't be assaulted? Also what do you mean when did we do that? When your MLAs go around calling rapists sanskari, garlanding them, not holding elected representatives accountable for the sexual crimes they've committed, parading women naked and a million other things sanghis have done how can you claim nothing was ever done? This government prematurely released convicted rapists and murderers. Normally these things would warrant the death penalty but here they had their feet touched, garlanded them, and had them greeted with sweets. In a nutshell if you commit crimes against humanity you are rewarded by the BJP as long as it fits their narrative. Men being majority in the Parliament still cannot pass a bill that can protect men from sexual assault. Now, the one act, removed. Future will see a rise in sexual assaults on men mostly by men. You are extremely wrong if you think this is what feminism intends for, infact feminism supports men expressing their traumatic experiences which patriarchy (which our legal and society system is entrenched in) doesn't allow and also believes men are stronger so they can't be sexually harmed by men or women. The SC had declared that only non consensual sexual intercourse between males would be illegal under 377, and had decriminalized the consensual sex. The government could have just added the words non-consensual to the section and the amendment would have fixed the issue. Even if we want a new base for sexual assault on men, where is this base in the new ~~Code~~ Sanhita? it's a canon event Lol feminists have regularly opposed laws to make rape laws gender neutral. Yes, but do you think the current government will even speak a word about such a bill. This was the best we had. Ideally they should have made rape gender neutral State of gun laws in India is completely fucked. I wanted to get a gun later in life but there's so many hoops you need to jump through for it, extremely small amount of legal guns, and the ones which are legal are fuck expensive and even compared to other country prices you pay up to 20 times (not a typo or exaggeration) for the same gun. Wanted to stay in the country But looks like I'll be leaving very soon This is an 11 year old ordeal where the entire basis of \"no men get assaulted\" was based on the the lack of data. Which is a terrible way to go and it is absolutely wrong. This 1 standalone group of feminists don't comprise feminism as a whole which is focused on gender neutrality more so than a decade ago. This country doesn't take rape against women seriously, you think they will take rape against men even slightly seriously? Once again, read the article and little bit more about it before commenting. While removing the anti-gay aspect is good, this was the last and final piece of law that allowed men to seek redressal for being victims of at least one kind of sexual assault. >final piece of law that allowed men to seek redressal for being victims of at least one kind of sexual assault. Yes we need the government and judiciary to acknowledge that but it couldn't be done on the hunched back of 377. I think these things are a building up process Hopefully with time as what takes precedence before this is martial rapes, which are still gray area for our constitution. That too despite having the parliament in Delhi. Don't they read the [news](https://www.firstpost.com/india/new-delhi-man-slapped-by-date-raped-by-restaurant-owner-bouncer-after-row-over-inflated-bill-12958222.html)? these laws come from the bureaucracy, not the government. Too many people forget this. The text, the nuance, the exclusions and inclusions are all drafted by bureaucrats. The clowns in parliament often have no idea what is even in these bills. The problem is, the bureaucracy identified crimes against women as a problem right from Independence. This is why we have nonsense \"Crimes\" like outraging the \"modesty\" of a woman but not a man. We have a problem with violence against women in india but we also have a problem of infantalising women. we also have a problem with equal access to the legal system. All this law will do is be weaponised by wealthy women as a get out of jail free card. Forgot to add /s unless you are joking No, they don't follow news and also stay detached from realities. Law needs to be changed. Sedition ab bhi nhi hataya matlab?! What can one do if he/she is too poor to emigrate? Why you find this ridiculing? There is no such cases, and I all I said is men don't need to worry coz it never happens. [https://en.wikipedia.org/wiki/Rape\\_of\\_males](https://en.wikipedia.org/wiki/Rape_of_males) Austria job seekers visa. Yeah, these are the only article you enjoy to read. Go read it your whole life, feel satisfied. I bet these are the only article you have read in life. Why are you angry ? I was just trying to say that men do rape other men also there have been such cases in India also. Even boys are protected by POSCO for a good reason. Ohh, sorry in thought u r justifying the cases where women are sexual offenders. Yeah, in all the cases it's men who did it to other men. >Yeah, in all the cases it's men who did it to other men. You are wrong this is exactly I've been looking for since the news came out. no protection to false rape charges and no mention of physical abuse or mental abuse of male. Naam badla hai baas. Aur punishment increase kiya hai. Also, seditious speeches won't be construed as sedition apparently. The idea it needs \"new cement\" doesn't justify removing it WITHOUT a replacement. 377 was homophobic and was used to criminalise consensual gay relationships but it was also used by male rape victims and married women who can't file rape cases under 376 because of the marriage exception. The bench took note of the fact that it is the only law that dealt with male rape when they read it down. Otherwise it would have struck down instead of read down. It is very obvious that his argument is only to defend the government. Naam badla h...kanoon wahi h..ulta usmein penalty pehle se bad gayi h The people who defended the NDA about the Trans Act, you are gonna get fruits of your labour soon. They know. It is intentional. The government knows very well about 377 being the only law that protects men. It was part of the 377 hearing. This is exactly why 377 was read down and not struck down. >Why isn't rape a gender neutral crime then? Men can't be assaulted? It is and yes men are assaulted but you have to be realistic to expect such a change. Our constitution still doesn't cover the martial rapes, to expect rigorous punishment for male victims of sexual assault is simply in the future. 377 is ridiculous excuse of justice to men victims of sexual assault when in reality it truly aimed at punishing 'sodomy' consensual or non consensual later modified in 2019 by SC. The key thing to be noted is that for committing sexual violence, the perpetrator and the victim can be of any gender, unlike what is mentioned in Section 354A to 354D and Section 375 of The Indian Penal Code, which states that only a man can be the perpetrator. \"Only a man can be a perpetrator\" is the nature of our constitution. You see the tone? Anyways I'm hopeful with the rise of importance of sexuality and gender at the zenith of its relevance, we'll see some positive changes in laws regarding this context. >When your MLAs go around calling rapists sanskari, garlanding them, not holding elected representatives accountable for the sexual crimes they've committed, Not my MLA's, not my elected representatives. They should be shamed publicly for garlanding the convicts. In my opinion Bilkis Rape convicts should be tortured until the light in their eyes go dim yet they are out after serving some 15 years with more than 1000 years in bail. How horrendous and unjust this feels right? Yet all of this was 'legal' which is exactly my point and should be the point of discussion. There should be no such provision to do this. The laws aren't enough to punish justly and to prevent such nature of crimes. People given the opportunity will always use this powerful favouring system of judiciary, legislative to manipulate and exploit for personal or political gains. > parading women naked Meities case wasn't of religion as it might be projected, There are Christian and Muslims Meities too. It's a conflict between 2 hill tribes. Again what do you think the sentence of the caught will be? there was a whole mob but only four are caught and to be accused right? Is that right? still no law for punishing a mob in such context. Now yesterday a bill was introduced which will punish mob for lynching upto 7 years jail time or life imprisonment or even death sentence. >million other things sanghis have done how can you claim nothing was ever done? Reminds me of kathua case after which the government introduced the death penalty for the rape of 12 yrs old or younger. Now since you're sanghi this sanghi that Remember ajmer case in 1992, involved the serial gangrape and blackmailing of more than 300-500 school and college-aged girls in Ajmer, Rajasthan All school or college girls were mostly underage. It was in definite terms congress run scandal where school girls were gangraped then blackmailed by a photo colour lab printed the nude photographs of the women and helped circulate them. Now even the most leftist of newspapers claim the victim count to be more than 100, others claim 300 to 500, obviously such large scale operation wasn't run by youth wing of congress as it was made after getting caught. Anyway a reporter exposed and youth leader of congress were made the scapegoat. Now farooq chisti one of the masterminds of this operation has in 2007, a fast-track court sentenced him to life. In 2013, the Rajasthan High Court deemed he had served enough time and released him. Yes that's his punishment. If you know the names of all culprits its easy to give this a communal angle but that's not what I'm trying to pontificate. “Dargah par aane wale log unke hath choomte hai (People coming to the Dargah used to kiss the hand of this fellow). Living a lavish life in Ajmer. \"They used this religious power to get political influence. SPs to SHOs would call them to negotiate over FIRs or issue appeals. No one could say no to them,” says 'the print'. The point I'm trying to make is there are loopholes that can be manipulated and thats why judiciary needs a reform. Unless it happens political parties all corrupt at core will use it to exploit you and me. Congress aur bjp are not different. \"Bjp is congress+ cow\"- arun shourie."
}