{
    "id": "1e8588w",
    "title": "\"AIIMS Has Given Puja Khedkar A Fake Disability Certificate; Signed Off By 6 Doctors\" | IAS Fraud",
    "url": "https://youtu.be/X7tom9wSMwY",
    "selftext": "As there were speculations on whether she recieved certificate from private institute but no AIIMS issued her the certificate signed by 6 doctors. She claimed VI + depression but since depression was rejected aiims issued her the certificate with VI + hearing loss in one day.",
    "flair": "Law & Courts",
    "score": 160,
    "num_comments": 20,
    "created_utc": 1721508419,
    "convurl": "https://external-preview.redd.it/R0EiBrQ0k37ugMb4DW3p1VFDTmuiz1BTqr60M9Q5J9c.jpg?auto=webp&s=75d53586efd76aac064de267ae5d21edc2ab6c72",
    "comments": [
        "This woman put more effort into faking things than it would have to pass the bloody exam!",
        "Just check the certificates of every serving candidate till date. \n\nBut Babus stick together.",
        "This is why she will be quickly fed to the wolves before the entire house of cards is discovered. 😄",
        "No. The headline is factually incorrect. Puja Khedkar was called to AIIMS multiple times to determine disability. [https://punemirror.com/pune/others/trainee-ias-officer-evaded-med-test-at-aiims-6-times/cid1720591180.htm#google\\_vignette](https://punemirror.com/pune/others/trainee-ias-officer-evaded-med-test-at-aiims-6-times/cid1720591180.htm#google_vignette) She never went. She got her disability certificate from a private hospital. [https://www.business-standard.com/india-news/ias-pooja-khedkar-has-7-locomotor-disability-pune-based-private-hospital-124071600693\\_1.html](https://www.business-standard.com/india-news/ias-pooja-khedkar-has-7-locomotor-disability-pune-based-private-hospital-124071600693_1.html)",
        "Are private hospital certificates valid? I thought as per govt website, there are only limited government doctors to certify...",
        "Yep, the scam is more elaborate. AIIMS docs were part of it, just shows the system is rotten to its core.",
        "I don't know the UPSC rules. But I know that AIIMS had written to DOPT about her not appearing for medical verification after calling her 6 times. The CAT ordered her candidature to be cancelled. https://sundayguardianlive.com/top-five/in-2023-cat-ordered-cancellation-of-puja-khedkars-ias-selection",
        "We failed to get disability certificate for our nephew born with congenital defects. And here these guys are faking and enjoying tax payers money.",
        "And then I have seen guys from lower or middle class background get rejected by UPSC due to some other minor problems.\nSystem only works against those who cant game it...",
        "Those 6 doctors should be given immediate promotion.",
        "You won't be able to do so...because a large number would be genuine.",
        "That's the problem Aiims theselves gave her vi and hearing loss certificate.",
        "I can only go on documents that are in public domain. Am not saying AIIMS is incorruptible. But the interview you linked is basing these arguments on hearsay.",
        "Bhai, I am a doctor at AIIMS. It is not that easy to overturn systems in AIIMS because everything there goes through multiple layers.",
        "I knew it. Money can buyout anything. Period.",
        "It's not basing on the hearsay, the disability certificate is signed and issued by aiims. Have you even watched the video?",
        "She also passed the exams, though with less marks. Those fakes were used to bridge the gaps.",
        "Scribe writing her answers, who was probably subject expert. Clown show all over",
        "Seeing the results of the current NTA tests most of the selected aiims students got in like that only so its just helping their own kind.",
        "This was a well thought up fraud.\n\nBut a wrong candidate giving exams? Multiple times? With biometrics? With random centers? \n\nNah.\n\nShe was confident in clearing the exams, that's why she kept trying.",
        "All she did was called her papaw. It's money and greedy shitty zombies who did heavy lifting.",
        "Bro she had a scribe write her exam as she claimed physical disability. \n\n\nI don't know from where you're thinking this. It is rumoured in her interview round the UPSC commissioner (chairman) was present in interview panel which is why he also resigned very very quickly. \n\n\n\n\nShe kept trying because once her candidature was cancelled because she was caught in physical disability, changed her name to reappear as it's a loophole ",
        "Her father and grandfather were IAS means she has very deep connections, which makes it quite possible."
    ],
    "cleaned_text": "aiims given puja khedkar fake disability certificate signed doctors ias fraud speculations whether recieved certificate private institute aiims issued certificate signed doctors claimed vi depression since depression rejected aiims issued certificate vi hearing loss one day ",
    "cleaned_title": "aiims given puja khedkar fake disability certificate signed doctors ias fraud",
    "cleaned_selftext": "speculations whether recieved certificate private institute aiims issued certificate signed doctors claimed vi depression since depression rejected aiims issued certificate vi hearing loss one day",
    "cleaned_comments": "woman put effort faking things would pass bloody exam check certificates every serving candidate till date babus stick together quickly fed wolves entire house cards discovered headline factually incorrect puja khedkar called aiims multiple times determine disability httpspunemirrorcompuneotherstraineeiasofficerevadedmedtestataiimstimescidhtmgooglevignettehttpspunemirrorcompuneotherstraineeiasofficerevadedmedtestataiimstimescidhtmgooglevignette never went got disability certificate private hospital httpswwwbusinessstandardcomindianewsiaspoojakhedkarhaslocomotordisabilitypunebasedprivatehospitalhtmlhttpswwwbusinessstandardcomindianewsiaspoojakhedkarhaslocomotordisabilitypunebasedprivatehospitalhtml private hospital certificates valid thought per govt website limited government doctors certify yep scam elaborate aiims docs part shows system rotten core dont know upsc rules know aiims written dopt appearing medical verification calling times cat ordered candidature cancelled failed get disability certificate nephew born congenital defects guys faking enjoying tax payers money seen guys lower middle class background get rejected upsc due minor problems system works cant game doctors given immediate promotion wont able sobecause large number would genuine thats problem aiims theselves gave vi hearing loss certificate go documents public domain saying aiims incorruptible interview linked basing arguments hearsay bhai doctor aiims easy overturn systems aiims everything goes multiple layers knew money buyout anything period basing hearsay disability certificate signed issued aiims even watched video also passed exams though less marks fakes used bridge gaps scribe writing answers probably subject expert clown show seeing results current nta tests selected aiims students got like helping kind well thought fraud wrong candidate giving exams multiple times biometrics random centers nah confident clearing exams thats kept trying called papaw money greedy shitty zombies heavy lifting bro scribe write exam claimed physical disability dont know youre thinking rumoured interview round upsc commissioner chairman present interview panel also resigned quickly kept trying candidature cancelled caught physical disability changed name reappear loophole father grandfather ias means deep connections makes quite possible",
    "light_cleaned_title": "\"AIIMS Has Given Puja Khedkar A Fake Disability Certificate; Signed Off By 6 Doctors\" | IAS Fraud",
    "light_cleaned_selftext": "As there were speculations on whether she recieved certificate from private institute but no AIIMS issued her the certificate signed by 6 doctors. She claimed VI + depression but since depression was rejected aiims issued her the certificate with VI + hearing loss in one day.",
    "light_cleaned_comments": "This woman put more effort into faking things than it would have to pass the bloody exam! Just check the certificates of every serving candidate till date. But Babus stick together. This is why she will be quickly fed to the wolves before the entire house of cards is discovered. 😄 No. The headline is factually incorrect. Puja Khedkar was called to AIIMS multiple times to determine disability. [https://punemirror.com/pune/others/trainee-ias-officer-evaded-med-test-at-aiims-6-times/cid1720591180.htm#google\\_vignette](https://punemirror.com/pune/others/trainee-ias-officer-evaded-med-test-at-aiims-6-times/cid1720591180.htm#google_vignette) She never went. She got her disability certificate from a private hospital. [https://www.business-standard.com/india-news/ias-pooja-khedkar-has-7-locomotor-disability-pune-based-private-hospital-124071600693\\_1.html](https://www.business-standard.com/india-news/ias-pooja-khedkar-has-7-locomotor-disability-pune-based-private-hospital-124071600693_1.html) Are private hospital certificates valid? I thought as per govt website, there are only limited government doctors to certify... Yep, the scam is more elaborate. AIIMS docs were part of it, just shows the system is rotten to its core. I don't know the UPSC rules. But I know that AIIMS had written to DOPT about her not appearing for medical verification after calling her 6 times. The CAT ordered her candidature to be cancelled. We failed to get disability certificate for our nephew born with congenital defects. And here these guys are faking and enjoying tax payers money. And then I have seen guys from lower or middle class background get rejected by UPSC due to some other minor problems. System only works against those who cant game it... Those 6 doctors should be given immediate promotion. You won't be able to do so...because a large number would be genuine. That's the problem Aiims theselves gave her vi and hearing loss certificate. I can only go on documents that are in public domain. Am not saying AIIMS is incorruptible. But the interview you linked is basing these arguments on hearsay. Bhai, I am a doctor at AIIMS. It is not that easy to overturn systems in AIIMS because everything there goes through multiple layers. I knew it. Money can buyout anything. Period. It's not basing on the hearsay, the disability certificate is signed and issued by aiims. Have you even watched the video? She also passed the exams, though with less marks. Those fakes were used to bridge the gaps. Scribe writing her answers, who was probably subject expert. Clown show all over Seeing the results of the current NTA tests most of the selected aiims students got in like that only so its just helping their own kind. This was a well thought up fraud. But a wrong candidate giving exams? Multiple times? With biometrics? With random centers? Nah. She was confident in clearing the exams, that's why she kept trying. All she did was called her papaw. It's money and greedy shitty zombies who did heavy lifting. Bro she had a scribe write her exam as she claimed physical disability. I don't know from where you're thinking this. It is rumoured in her interview round the UPSC commissioner (chairman) was present in interview panel which is why he also resigned very very quickly. She kept trying because once her candidature was cancelled because she was caught in physical disability, changed her name to reappear as it's a loophole Her father and grandfather were IAS means she has very deep connections, which makes it quite possible."
}