{
    "id": "15ua9do",
    "title": "What's your take on MedTwitter coming against having multiple sexual partners?",
    "url": "https://indianexpress.com/article/trending/trending-in-india/doctor-equates-being-sexually-active-with-prostitution-netizens-respond-8896502/",
    "selftext": "\nIt all started with a Dr Dhruv Chauhan's tweet (deleted now) and now hundreds of doctors are supporting him on twitter. Isn't moral policing by doctors unprofessional? Thoughts?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 123,
    "created_utc": 1692333242.0,
    "convurl": "https://external-preview.redd.it/u5vjvDZLj7GXmGldaSoCAOJLZ20EWnT3n2avPMj4ocA.jpg?auto=webp&s=ac78285f90c1f86dc2a1e2188472beafe9f03d0d",
    "comments": [
        "Screenshot of the deleted tweet\n\nhttps://preview.redd.it/p37p0kcvrsib1.jpeg?width=719&format=pjpg&auto=webp&s=40d575c942d7fcae918e8948bb69bb9ba5a57dbc",
        "Doctors are people who spend 10-12 years getting their degrees, + 5-6 years spent preparing for medical exams. They have no outside world experience, most medical colleges have mess separated on caste basis. So these type of statements are not really surprising.",
        "I didn't know about the separated mess thing. I knew there's casteism in med schools, but damn even mess is separated?",
        "This is a really backward view. You are essentially stereotyping all doctors as nerdy losers loll,l🤣🤣",
        "https://preview.redd.it/5r3r97z6usib1.jpeg?width=1080&format=pjpg&auto=webp&s=8599c0505d47f5eddbebc84830866483d40c393a\n\nThis is his subsequent statement and if he's practicing what he's saying, I have zero issues.",
        "His misinformed tweet equating having multiple sexual partners to prostitution which is not only demeaning to the people having multiple sex partner but also to the sex workers (the undertone of his statement did imply it) has invited a lot of misogynist replies under his tweet (which has been deleted) and on the medTwitter community. This is really uncalled for. My take on it (that nobody asked for) - LIVE AND LET LIVE. People know what they are doing. This is 2023 and it's about time we shouldn't be judging people for their individual choice as long as they aren't harming anyone.",
        "I commented on this in another post where I reminded people that draupadi of Mahabharat had 5 sexual partners at the same time.",
        "What a goddamn weirdo, she prolly hit the insecurity.",
        "Who told you man that mess is separated? Dude just hears some bullshit somewhere and propagates it.",
        "Doesn't matter if they are doctors, engineers, professors etc. Their primary identity is that of a chaddi.",
        "I personally am not against having multiple sex partners for a woman. The problem is when she lies about it and cheats on her partner and then claims half his property and income.",
        "Just a reminder that she did stupid shit like this as well [https://i.imgur.com/xmwGqWm.png](https://i.imgur.com/xmwGqWm.png)",
        "> The problem is when she lies about it and cheats on her partner and then claims half his property and income.\n\nCheating is bad irrespective of gender.",
        "People know what they are doing. - Have you seen people? They are stupid.",
        "Yes but one gender gets protected by law universally while the other gets shafted.",
        "Basically multiple sexual partners ek saath nhi hone chiye , lets say break up hua then someone else and so and so on , then it's fine ....",
        "If they're consenting then what's the problem?",
        "Consenting for what?",
        "😂😂😂. Feminists will label you as a mysogynist/bigot. Expecting expensive gifts / dinners etc in exchange of sex. Its modern day prostitution. Oh wait am I a bigot now?",
        "Well I'm not interested in morally judging what she did. I am only saying she had the freedom to do that back then , so today's Indian girls also deserve that freedom to do what they want as long as their actions are not harming others. Who the fuck is this doctor to give moral lessons? To the patient he's a doctor. That's all. He should do his job as a doctor and shut the fuck up. Not morally judge his patients.",
        "Having sex.",
        "That's the problem. I'm not pro or anti men or women. I'm just neutral but still will get attacked by everyone involved.",
        "Then it's fine if there is consent , it's your life who am I to govern or judge you",
        "Quoting fiction to prove a point involves cherrypicking whatever suits your narrative so not really up for that either",
        "Multiple sexual partners in what definition? At the same time? Do all the other parties know that it's not exclusive?\n\n\nDepending on the answer the question ranges from completely fine to wildly disgusting (deliberate cheating) which should be shamed.",
        "Idiots think no one is neutral. They can't fathom that someone is smart enough to see a clear picture and judge an issue on its merits and not on political views. Its like if you are with modi, you're with India and if you are not with modi, you are against India.",
        "Actually she didn't have the freedom. She chose Arjuna only, and then was forced to marry the rest of the brothers due to dharma and shit.",
        "Absolutely agree even though I disagree with his personal opinion.",
        "Exactly. The problem comes when a partner has sex without the consent of the other partner and things go crazy.",
        "Ya , that's literal cheating then",
        "First of all I never quoted anything. I don't give a fuck if Mahabharat is fiction or not. Even if it's fiction, it's an ancient story where the concept of such freedom for women existed and discussed. And I'm not making this a religious issue at all. Imo all religions are equally dumb. I'm pointing out that women having freedom being mentioned in an ancient fictional story is worth appreciating. Unfortunately the culture has changed so badly that men started dominating women and laid down freedom curtailing rules and regulations on them. Women can do what they want. Their body, their choice.",
        "She wasn't forced. She was asked to which she agreed. And btw the wedding didn't happen immediately after she agreed. Because it was unheard of, the elders of that society deliberated on this issue and finally decided there's nothing wrong in it. Also don't forget that she was happily married. She questioned the decisions of her husbands in different matters but she never doubted the marriage.",
        "Sometimes it makes me feel people in India are more concerned about correcting others rather than minding their own business",
        "She actually wasn't forced. She didn't object to this decision at all. All 5 brothers were enamored by her. And it was Yudhishthir's decision that she marries them all. Draupadi at no point objected to this union. However, Drupad her father did object. And at this point comes in Ved Vyasa that a woman can marry more than one husband.",
        "Last I checked, Adultery is not a crime in India, irrespective of gender",
        "He said these woke kids will turn families into prostitution. \n\nIsnt it already ? Like if you get a govt job, the dowry you get particularly in Haryana and UP, its crazy. The idea is simple - govt job means a girl who will listen to you. Basically concubine. Hell, its worse when you think that its the concubine that gets paid, whereas the wife's side pays the dowry.",
        "He needs to get some.",
        "Yes.",
        "Not everything which isn't a crime is good. Cheating on your partner may not be illegal, but definitely a shitty thing to do. All the while the male gets shafted by the law is what makes this worse.",
        "Yup",
        "Then he can also deny treatment to the person",
        "Isn't marriage a contract between husband and wife so if a third party gets involved in mine then she should expect divorce and same goes to me. If you want to whore around then don't marry.",
        "Why will he do that? Idiot doesn't want to miss out on money",
        "Nobody is justifying cheating bro.\n\n>Multiple sexual partners in what definition? At the same time?\n\nIn their entire life. Not necessarily at the same time.\n\n>Do all the other parties know that it's not exclusive?\n\nIf not, that will be cheating.\n\nYes cheating should be shamed, \n\nbut the doctor was slut shaming women for having sexual partners and that is a problem.",
        "We humans have some ethics culture have brain have power of thinking what's right and whats wrong we are not animals like dog like Street dogs have multiple partners we are not dogs or animals we are humans.",
        "Your comment didn't say good or bad, it said 'law' and it favouring one gender over another. I will repeat since you don't know what your own comment was, there is no law that penalises one gender for this and not another, in India at least. Not sure from where you are getting your law knowledge",
        "Social constructs are never rational...",
        "+1",
        "If he practices what he preaches then that's not a problem at all.\n\nFor example, I have never had an addiction not I ever touched something addictive. I do judge addicted people.\n\nI would be a hypocrite if I judged someone while i did a similar thing myself. But I'm not. So I'm clear that way.\n\nSame goes for this guy. If he practices what he preaches, he's clear to speak what he has in mind.",
        "Dr finding out Jordan Peterson, Ben Shapiro, Andrew Tate for the first time",
        "False equivalence. Addiction damages your body, sex doesn't.\n\nWhat he is doing is PROJECTION.\n\nappropriate comparison would be - Like I wouldn't have tattoos on my body but I wouldn't judge people who have.\n\nHe is also going out of his way to Target and slut shame that women and women in general. Harrassing and name calling someone for their personal choices is never justified.",
        "Dont have to be judgemental, let them do their thing.\nEveryone has the right to explore.\n But, I do agree with the guy that its nothing to be proud of, since sex comes easy to women, unlike men. Most women dont have to try or put much effort in finding someone to have sex with. But, most men do need to put a lot of effort, and has to pass a lot of criterias to even get the attention of the opposite sex. And hence, a man can be proud of having multiple sexual partners. If someone achieves something that they can get easily, then its not gonna be respected.",
        "Right. Make up stories about a fictional character.",
        "> there is no law that penalises one gender for this and not another, in India at least.\n\nWait till you know about dowry laws, alimony laws, child custody laws, etc etc",
        "What is his point of view on men having multiple partners?",
        "That one 1 tweet about having multiple sexual partner is so inaccurate. He didn't phrase it properly.",
        "My opinion is the doctor is wrong she can do whatever she can.\nBut when a man want look if her future wife can do housework or not he shouldn't be judge as well by anyone.",
        "Multiple partners means having a sexual history if many people, it doesn't mean cheating after marriage or cheating while in relationship, those are called open marriage and open relationship.",
        "Wait till you know about whataboutery and why you should not use it if you want to indulge in an constructive discussion",
        "By forced, of course I didn't mean someone threatened her to do it or something. But it wasn't her decision. Nor did Yudhisthira ask her opinion before taking the decision. Stop pretending like this was the golden age of gender equality or something.",
        "Yes but not when he's being a professional. If a doctor in US does that, his licence would be revoked. Treat the patient for his/her illness. Not talk all the shit that comes to the mind",
        "I am not saying that it was a golden age of gender equality either, what I am saying is she was a strong woman who if was opposed to the marriage would have spoken against it. Earth at no point of time has been gender equal. I mean even now girls are subjected to constant speculations and doubts, and even then they were. I am just point out that she was not some helpless damsel we portray her to be. She was strong and independent. \n\nI did no way mean to be disrespectful to you, if I did however, come across as that, I apologise!",
        "This is a messed up take",
        "She actually had only one sexual partner - Arjun, but all 5 as her partners. This was explained in Mahabharat somewhere. I could clearly recall.",
        "More backwards than what these nerdy losers are saying?",
        "Non-ethical non-monogamy perpetuated by men, without the consent of their partners, was turned a blind eye towards and in many instances considered inevitable by most of Indian society for centuries.\nEthical non-monogamy today, especially in instances of women (which involves no deception with their partners) is suddenly threatening to society. Even sex before marriage for women is 'wrong', the mere idea of women in control of their bodies is suddenly 'emulating the wild west'. Well living in the same western society, I can tell you the freedom from judgement for women it brings- you don't have to fit into a certain mold to be taken seriously or respected by the larger society. I have friends who have chosen to not have pre-marital sex, friends who are polyamorous (ethically) and friends who are in stable, monogamous relationships, and no one is better or worse for it. While I am a monogamous woman myself, I do not know why people are so affected by women's personal choices about their bodies.\nThis kind of enmeshing of 'personal views' and professional opinion from Indian docs- esp ones who enjoy a large social media following and therefore reach millions - is disheartening. It will create barriers in the minds of people who will hesitate to seek a medical opinion now. Just remember, this kind of taboo is exactly why women are hesitant to go to a gynaecologist in the first place and conditions like 'PCOS' are not taken seriously. Also as a scientist myself, the propagation of misinformation is stagerring.",
        "Most loudmouth vocal doctors on Twitter are almost always mediocre/below average in actual practice and skill, best to ignore these online warriors",
        "When he displays Dr. in his user id, he is speaking as a doctor and needs to be called out as such.",
        "Bro please swallow only one red pill a day",
        "No that's factually incorrect. She has 5 sexual partners but only one at a time. It changed yearly. Some versions say it changed when she desired.",
        "Nope. She had at least one kid from each husband. But this not my point here. I'm only talking about the freedom she had back then and the unfortunate lack of freedom for today's Indian women",
        "Unfortunately such judgemental attitude is not uncommon. Our groups are rife with misogyny. Ultimately the doctors themselves are part of the society and their attitudes are a reflection of the society. Education sadly is not enough to eradicate prejudice.",
        "I need to see a viable source. Not that i don’t believe you but for my own curiosity.",
        "You can search for names of her 5 children. That is same in every version.",
        "> most medical colleges have mess separated on caste basis      \n    \nThat is messed up.",
        "Wait till you get married and learn about the gender bias of our laws.",
        "When i read this on reddit few days back i thought the doctor is some grumpy old man but nope, even a young person who is a medical professional have this kind of scum misogynistic regressive 200BC attitude and now i've read other doctors supporting this shithead, we are fucked guys.",
        "thats bullshit,dont just beleive whatever crap anyone starts spouting lmao",
        "It all depends on whether they are at the same time or not.",
        "Still messed up though?",
        "He is switching his position. The original post expressed frustration at doctors judging women. If you ask your women friends, you would know how common this experience is, inside clinics. They face judgement during consultation. This bigot doubles down and says that he WILL judge, as xyz is not right mentally physically or psychologically (none of which are medically correct statements).\n\nNow that he has been called out he is changing his position and saying that he actually does not judge.",
        "Could be declared the national hobby.",
        "Free to have multiple partners but not free to have multiple opinions ? Hmmmm\n\nThen you should not have any problem with men wanting a virgin wife.\n\nsee, freedom of choice goes both ways.",
        "Personally give that I would to a doctor more often than not because of stupidity or lack of awareness of some illness, I would very much like them to be less judgy. Or atleast less obvious about their judgement.\n\nIts like your mechanic being judgy about your driving style, when all you want him to do is fix the problem, becuase that is what you pay him for. I'll take his opinion on other things if I want it thank you.",
        "Imo moral policing is wrong but I won't like this kind of thinking. So probably dating someone like her is no no for me.",
        "W doctor",
        "But can he source clinical research in the comments proving multiple sexual partners is not 'medically' fit for every demographic type despite taking precautions for STDs? If no, then his tweet is propagating psuedoscience.",
        "There are shit people and good people doing all kinds of jobs. This one just happens to be a doctor.",
        "So multiple partner for women is not a show off because easy, but multiple partners for men are because they are incapable. Mmmmm okay",
        ">  And it was Yudhishthir's decision that she marries them all.\n\nnope, it was kunti's. &nbsp; arjuna told her, \"look, mom, what i've brought!\"; kunti replied, without looking, \"share it with your brothers.\".",
        "https://scroll.in/article/1049603/a-dalit-scholars-death-and-brahmin-dominance-at-indias-premier-scientific-institute\n\nI know it was long time ago,but....\nhttps://qz.com/india/1446932/iisc-bengaluru-once-had-eight-dining-halls-for-different-castes\n\nI have seen this kind of experience happened to a student in my college who happened to be Dalit. It ain't black and white anymore. You have to be really observant on how discrimination happens. It is very subtle nowadays.",
        "Yes. If you are incapable of something that doesn't come easily to you, and you achieve it by putting in lot of effort and hard work into it, it is something to be proud of. \n\nThink of it this way. If a man/woman works hard, went through tough times,  took a lot of risk, put in a lot of effort and became rich and in a good position, he/she will be respected. \nBut, if they just inherits the money or property from their parents without doing any work, they wont be respected because it was just given to them with ease.",
        "Agreed this did happen. However, following this Arjun told Yudhishthir he should marry Draupadi because he was the eldest. I mean at least this is what I have read in Mahabharat by KMG. And then Yudhishthir notices that all the brothers looked smitten by her. And so, then he says that we all should marry her. At least this is what I have read 😅 I'm also currently reading the Bibek Debroy version but have not reached till this part. Let's see if that one also says this!",
        "Nah, AFAIR, the pandavas had a schedule of whoo would have draupadi when. &nbsp; Also there was a rule that if she was alone in a room with one pandava, and any other pandava entered the room at that time, he would have to go into exile for a period; this was the reason for one of arjuna's exiles.",
        "It's not us and as long my understanding he is saying it on Twitter not infront of a petient every one has person life opinion which they can share \nWhat is he saying is correct supporting cheating is not woke",
        "No, she never had freedom. She chose Arjuna but Kunti made her marry all 5 of them to keep the family together and prevent them from splitting with their separate families (this is commonly practiced by many tribes with scarce resources). She opposed it too but her father intervened and she stayed. \nThis rule of purification and sharing common wife with each husband for a year and shifting to the next  was suggested by Ved Vyas... \n.\nLife was not easy back then they had to manage with whatever the best they had and can.",
        "And such a man ending up alone should also not result in men blaming women.",
        "Bhai it's so funny watching adults pick on things to attack 😂.\n\n\"Naam me Dr. use kyu kia? 😡\"",
        "True. Same with women who end up alone because they had a lot of partners and men don't want to choose her for \"that\" reason should not blame men",
        "Nobody's stopping na?\n\nKya fark pad gaya if 1 random guy on twitter said he will judge. \n\nThis shouldn't even be a topic worthy of so much discussion and attention lol.",
        "People will quote anything to fire their bigotry bhai.\n\nEk kare to theek, dusra kare toh its wrong.",
        "We only have enough fossil fuels for the next few decades.",
        "You are totally ignoring the context here, and its obvious why.\n\nI am not talking about a random person who expressed a random opinion while having Dr. in his name. \n\nHe advertises himself as a doctor in twitter, his bio is full of his medical credentials, and majority of his tweets are medical field related/based on his identity as a doctor. And in this particular occasion, he used his 'medical knowledge' and quoted 'medical facts' to slut shame females who dare to explore their sexuality.  And his arguments are perceived as 'expert opinion' by the readers thanks to the things i mentioned above. \n\nIts funny when adults cannot appreciate the context and nuances and needs others to spoonfeed the same.",
        ">and its obvious why.\n\nWhy?",
        "From what I've seen, such women are usually the ones who end up in long term relationships, often healthy ones with men who are as promiscuous as them, or at least as socially liberal. They have their own problems, but being alone is usually not one of them.\n\nI know men like you have some super awesome revenge fantasy against the women that refuse to sleep with you, but that's unfortunately not how reality works. Good luck though. Men who think like this more often than not end up alone because women don't want to tolerate misogyny, laziness, and abuse from conservative man-children.",
        "Because if you take context into consideration there is nothing funny about my comment. Which means you wouldnt have a reason to post your 'clever' response to that",
        "Oh ok",
        ">I know men like you have some super awesome revenge fantasy against the women that refuse to sleep with you\n> misogyny, laziness, and abuse\n\nHaha, if the females in my life(friends and sisters) saw that presumption you made about me without knowing anything of me, they'd laugh at you so bad.\n\nAd hominem. The discussion is over.",
        "Bingo, I am married for 05 years.",
        "Enjoy life then. Don't waste it browsing reddit and talking to strangers online.",
        "I don't take life lessons, especially not from the school of thought that you subscribe to. I will do whatever I want to with my time, my life. \nCheers.",
        "You have no idea what school of thought I subscribe to. It's beyond your mental capacity to understand.",
        "I don't want an idea and even if I wanted to, like you said, it's beyond my mental capacity. \nOver and out.",
        "> beyond my mental capacity\n\nExactly.",
        ">\"Females\" in my life. \n\nYeah, sure bud.",
        "Whatever makes you happy. Idrc now.",
        "Mmm but I always thought your career and professional life was a social thing and sex a little more private in comparison 🤔",
        "Not private when you are trying to figure out if you are respected on its basis and should or should not feel proud about it."
    ],
    "cleaned_text": "whats take medtwitter coming multiple sexual partners started dr dhruv chauhans tweet deleted hundreds doctors supporting twitter isnt moral policing doctors unprofessional thoughts ",
    "cleaned_title": "whats take medtwitter coming multiple sexual partners",
    "cleaned_selftext": "started dr dhruv chauhans tweet deleted hundreds doctors supporting twitter isnt moral policing doctors unprofessional thoughts",
    "cleaned_comments": "screenshot deleted tweet doctors people spend years getting degrees years spent preparing medical exams outside world experience medical colleges mess separated caste basis type statements really surprising didnt know separated mess thing knew theres casteism med schools damn even mess separated really backward view essentially stereotyping doctors nerdy losers lolll subsequent statement hes practicing hes saying zero issues misinformed tweet equating multiple sexual partners prostitution demeaning people multiple sex partner also sex workers undertone statement imply invited lot misogynist replies tweet deleted medtwitter community really uncalled take nobody asked live let live people know time shouldnt judging people individual choice long arent harming anyone commented another post reminded people draupadi mahabharat sexual partners time goddamn weirdo prolly hit insecurity told man mess separated dude hears bullshit somewhere propagates doesnt matter doctors engineers professors etc primary identity chaddi personally multiple sex partners woman problem lies cheats partner claims half property income reminder stupid shit like well httpsiimgurcomxmwgqwmpnghttpsiimgurcomxmwgqwmpng problem lies cheats partner claims half property income cheating bad irrespective gender people know seen people stupid yes one gender gets protected law universally gets shafted basically multiple sexual partners ek saath nhi hone chiye lets say break hua someone else fine theyre consenting whats problem consenting feminists label mysogynistbigot expecting expensive gifts dinners etc exchange sex modern day prostitution oh wait bigot well im interested morally judging saying freedom back todays indian girls also deserve freedom want long actions harming others fuck doctor give moral lessons patient hes doctor thats job doctor shut fuck morally judge patients sex thats problem im pro anti men women im neutral still get attacked everyone involved fine consent life govern judge quoting fiction prove point involves cherrypicking whatever suits narrative really either multiple sexual partners definition time parties know exclusive depending answer question ranges completely fine wildly disgusting deliberate cheating shamed idiots think one neutral cant fathom someone smart enough see clear picture judge issue merits political views like modi youre india modi india actually didnt freedom chose arjuna forced marry rest brothers due dharma shit absolutely agree even though disagree personal opinion exactly problem comes partner sex without consent partner things go crazy ya thats literal cheating first never quoted anything dont give fuck mahabharat fiction even fiction ancient story concept freedom women existed discussed im making religious issue imo religions equally dumb im pointing women freedom mentioned ancient fictional story worth appreciating unfortunately culture changed badly men started dominating women laid freedom curtailing rules regulations women want body choice wasnt forced asked agreed btw wedding didnt happen immediately agreed unheard elders society deliberated issue finally decided theres nothing wrong also dont forget happily married questioned decisions husbands different matters never doubted marriage sometimes makes feel people india concerned correcting others rather minding business actually wasnt forced didnt object decision brothers enamored yudhishthirs decision marries draupadi point objected union however drupad father object point comes ved vyasa woman marry one husband last checked adultery crime india irrespective gender said woke kids turn families prostitution isnt already like get govt job dowry get particularly haryana crazy idea simple govt job means girl listen basically concubine hell worse think concubine gets paid whereas wifes side pays dowry needs get yes everything isnt crime good cheating partner may illegal definitely shitty thing male gets shafted law makes worse yup also deny treatment person isnt marriage contract husband wife third party gets involved mine expect divorce goes want whore around dont marry idiot doesnt want miss money nobody justifying cheating bro multiple sexual partners definition time entire life necessarily time parties know exclusive cheating yes cheating shamed doctor slut shaming women sexual partners problem humans ethics culture brain power thinking whats right whats wrong animals like dog like street dogs multiple partners dogs animals humans comment didnt say good bad said law favouring one gender another repeat since dont know comment law penalises one gender another india least sure getting law knowledge social constructs never rational practices preaches thats problem example never addiction ever touched something addictive judge addicted people would hypocrite judged someone similar thing im im clear way goes guy practices preaches hes clear speak mind dr finding jordan peterson ben shapiro andrew tate first time false equivalence addiction damages body sex doesnt projection appropriate comparison would like wouldnt tattoos body wouldnt judge people also going way target slut shame women women general harrassing name calling someone personal choices never justified dont judgemental let thing everyone right explore agree guy nothing proud since sex comes easy women unlike men women dont try put much effort finding someone sex men need put lot effort pass lot criterias even get attention opposite sex hence man proud multiple sexual partners someone achieves something get easily gon na respected right make stories fictional character law penalises one gender another india least wait till know dowry laws alimony laws child custody laws etc etc point view men multiple partners one tweet multiple sexual partner inaccurate didnt phrase properly opinion doctor wrong whatever man want look future wife housework shouldnt judge well anyone multiple partners means sexual history many people doesnt mean cheating marriage cheating relationship called open marriage open relationship wait till know whataboutery use want indulge constructive discussion forced course didnt mean someone threatened something wasnt decision yudhisthira ask opinion taking decision stop pretending like golden age gender equality something yes hes professional doctor us licence would revoked treat patient hisher illness talk shit comes mind saying golden age gender equality either saying strong woman opposed marriage would spoken earth point time gender equal mean even girls subjected constant speculations doubts even point helpless damsel portray strong independent way mean disrespectful however come across apologise messed take actually one sexual partner arjun partners explained mahabharat somewhere could clearly recall backwards nerdy losers saying nonethical nonmonogamy perpetuated men without consent partners turned blind eye towards many instances considered inevitable indian society centuries ethical nonmonogamy today especially instances women involves deception partners suddenly threatening society even sex marriage women wrong mere idea women control bodies suddenly emulating wild west well living western society tell freedom judgement women brings dont fit certain mold taken seriously respected larger society friends chosen premarital sex friends polyamorous ethically friends stable monogamous relationships one better worse monogamous woman know people affected womens personal choices bodies kind enmeshing personal views professional opinion indian docs esp ones enjoy large social media following therefore reach millions disheartening create barriers minds people hesitate seek medical opinion remember kind taboo exactly women hesitant go gynaecologist first place conditions like pcos taken seriously also scientist propagation misinformation stagerring loudmouth vocal doctors twitter almost always mediocrebelow average actual practice skill best ignore online warriors displays dr user id speaking doctor needs called bro please swallow one red pill day thats factually incorrect sexual partners one time changed yearly versions say changed desired nope least one kid husband point im talking freedom back unfortunate lack freedom todays indian women unfortunately judgemental attitude uncommon groups rife misogyny ultimately doctors part society attitudes reflection society education sadly enough eradicate prejudice need see viable source dont believe curiosity search names children every version medical colleges mess separated caste basis messed wait till get married learn gender bias laws read reddit days back thought doctor grumpy old man nope even young person medical professional kind scum misogynistic regressive bc attitude ive read doctors supporting shithead fucked guys thats bullshitdont beleive whatever crap anyone starts spouting lmao depends whether time still messed though switching position original post expressed frustration doctors judging women ask women friends would know common experience inside clinics face judgement consultation bigot doubles says judge xyz right mentally physically psychologically none medically correct statements called changing position saying actually judge could declared national hobby free multiple partners free multiple opinions hmmmm problem men wanting virgin wife see freedom choice goes ways personally give would doctor often stupidity lack awareness illness would much like less judgy atleast less obvious judgement like mechanic judgy driving style want fix problem becuase pay ill take opinion things want thank imo moral policing wrong wont like kind thinking probably dating someone like w doctor source clinical research comments proving multiple sexual partners medically fit every demographic type despite taking precautions stds tweet propagating psuedoscience shit people good people kinds jobs one happens doctor multiple partner women show easy multiple partners men incapable mmmmm okay yudhishthirs decision marries nope kuntis nbsp arjuna told look mom ive brought kunti replied without looking share brothers know long time agobut seen kind experience happened student college happened dalit aint black white anymore really observant discrimination happens subtle nowadays yes incapable something doesnt come easily achieve putting lot effort hard work something proud think way manwoman works hard went tough times took lot risk put lot effort became rich good position heshe respected inherits money property parents without work wont respected given ease agreed happen however following arjun told yudhishthir marry draupadi eldest mean least read mahabharat kmg yudhishthir notices brothers looked smitten says marry least read im also currently reading bibek debroy version reached till part lets see one also says nah afair pandavas schedule whoo would draupadi nbsp also rule alone room one pandava pandava entered room time would go exile period reason one arjunas exiles us long understanding saying twitter infront petient every one person life opinion share saying correct supporting cheating woke never freedom chose arjuna kunti made marry keep family together prevent splitting separate families commonly practiced many tribes scarce resources opposed father intervened stayed rule purification sharing common wife husband year shifting next suggested ved vyas life easy back manage whatever best man ending alone also result men blaming women bhai funny watching adults pick things attack naam dr use kyu kia true women end alone lot partners men dont want choose reason blame men nobodys stopping na kya fark pad gaya random guy twitter said judge shouldnt even topic worthy much discussion attention lol people quote anything fire bigotry bhai ek kare theek dusra kare toh wrong enough fossil fuels next decades totally ignoring context obvious talking random person expressed random opinion dr name advertises doctor twitter bio full medical credentials majority tweets medical field relatedbased identity doctor particular occasion used medical knowledge quoted medical facts slut shame females dare explore sexuality arguments perceived expert opinion readers thanks things mentioned funny adults appreciate context nuances needs others spoonfeed obvious ive seen women usually ones end long term relationships often healthy ones men promiscuous least socially liberal problems alone usually one know men like super awesome revenge fantasy women refuse sleep thats unfortunately reality works good luck though men think like often end alone women dont want tolerate misogyny laziness abuse conservative manchildren take context consideration nothing funny comment means wouldnt reason post clever response oh ok know men like super awesome revenge fantasy women refuse sleep misogyny laziness abuse haha females lifefriends sisters saw presumption made without knowing anything theyd laugh bad ad hominem discussion bingo married years enjoy life dont waste browsing reddit talking strangers online dont take life lessons especially school thought subscribe whatever want time life cheers idea school thought subscribe beyond mental capacity understand dont want idea even wanted like said beyond mental capacity beyond mental capacity exactly females life yeah sure bud whatever makes happy idrc mmm always thought career professional life social thing sex little private comparison private trying figure respected basis feel proud",
    "light_cleaned_title": "What's your take on MedTwitter coming against having multiple sexual partners?",
    "light_cleaned_selftext": "It all started with a Dr Dhruv Chauhan's tweet (deleted now) and now hundreds of doctors are supporting him on twitter. Isn't moral policing by doctors unprofessional? Thoughts?",
    "light_cleaned_comments": "Screenshot of the deleted tweet Doctors are people who spend 10-12 years getting their degrees, + 5-6 years spent preparing for medical exams. They have no outside world experience, most medical colleges have mess separated on caste basis. So these type of statements are not really surprising. I didn't know about the separated mess thing. I knew there's casteism in med schools, but damn even mess is separated? This is a really backward view. You are essentially stereotyping all doctors as nerdy losers loll,l🤣🤣 This is his subsequent statement and if he's practicing what he's saying, I have zero issues. His misinformed tweet equating having multiple sexual partners to prostitution which is not only demeaning to the people having multiple sex partner but also to the sex workers (the undertone of his statement did imply it) has invited a lot of misogynist replies under his tweet (which has been deleted) and on the medTwitter community. This is really uncalled for. My take on it (that nobody asked for) - LIVE AND LET LIVE. People know what they are doing. This is 2023 and it's about time we shouldn't be judging people for their individual choice as long as they aren't harming anyone. I commented on this in another post where I reminded people that draupadi of Mahabharat had 5 sexual partners at the same time. What a goddamn weirdo, she prolly hit the insecurity. Who told you man that mess is separated? Dude just hears some bullshit somewhere and propagates it. Doesn't matter if they are doctors, engineers, professors etc. Their primary identity is that of a chaddi. I personally am not against having multiple sex partners for a woman. The problem is when she lies about it and cheats on her partner and then claims half his property and income. Just a reminder that she did stupid shit like this as well [https://i.imgur.com/xmwGqWm.png](https://i.imgur.com/xmwGqWm.png) > The problem is when she lies about it and cheats on her partner and then claims half his property and income. Cheating is bad irrespective of gender. People know what they are doing. - Have you seen people? They are stupid. Yes but one gender gets protected by law universally while the other gets shafted. Basically multiple sexual partners ek saath nhi hone chiye , lets say break up hua then someone else and so and so on , then it's fine .... If they're consenting then what's the problem? Consenting for what? 😂😂😂. Feminists will label you as a mysogynist/bigot. Expecting expensive gifts / dinners etc in exchange of sex. Its modern day prostitution. Oh wait am I a bigot now? Well I'm not interested in morally judging what she did. I am only saying she had the freedom to do that back then , so today's Indian girls also deserve that freedom to do what they want as long as their actions are not harming others. Who the fuck is this doctor to give moral lessons? To the patient he's a doctor. That's all. He should do his job as a doctor and shut the fuck up. Not morally judge his patients. Having sex. That's the problem. I'm not pro or anti men or women. I'm just neutral but still will get attacked by everyone involved. Then it's fine if there is consent , it's your life who am I to govern or judge you Quoting fiction to prove a point involves cherrypicking whatever suits your narrative so not really up for that either Multiple sexual partners in what definition? At the same time? Do all the other parties know that it's not exclusive? Depending on the answer the question ranges from completely fine to wildly disgusting (deliberate cheating) which should be shamed. Idiots think no one is neutral. They can't fathom that someone is smart enough to see a clear picture and judge an issue on its merits and not on political views. Its like if you are with modi, you're with India and if you are not with modi, you are against India. Actually she didn't have the freedom. She chose Arjuna only, and then was forced to marry the rest of the brothers due to dharma and shit. Absolutely agree even though I disagree with his personal opinion. Exactly. The problem comes when a partner has sex without the consent of the other partner and things go crazy. Ya , that's literal cheating then First of all I never quoted anything. I don't give a fuck if Mahabharat is fiction or not. Even if it's fiction, it's an ancient story where the concept of such freedom for women existed and discussed. And I'm not making this a religious issue at all. Imo all religions are equally dumb. I'm pointing out that women having freedom being mentioned in an ancient fictional story is worth appreciating. Unfortunately the culture has changed so badly that men started dominating women and laid down freedom curtailing rules and regulations on them. Women can do what they want. Their body, their choice. She wasn't forced. She was asked to which she agreed. And btw the wedding didn't happen immediately after she agreed. Because it was unheard of, the elders of that society deliberated on this issue and finally decided there's nothing wrong in it. Also don't forget that she was happily married. She questioned the decisions of her husbands in different matters but she never doubted the marriage. Sometimes it makes me feel people in India are more concerned about correcting others rather than minding their own business She actually wasn't forced. She didn't object to this decision at all. All 5 brothers were enamored by her. And it was Yudhishthir's decision that she marries them all. Draupadi at no point objected to this union. However, Drupad her father did object. And at this point comes in Ved Vyasa that a woman can marry more than one husband. Last I checked, Adultery is not a crime in India, irrespective of gender He said these woke kids will turn families into prostitution. Isnt it already ? Like if you get a govt job, the dowry you get particularly in Haryana and UP, its crazy. The idea is simple - govt job means a girl who will listen to you. Basically concubine. Hell, its worse when you think that its the concubine that gets paid, whereas the wife's side pays the dowry. He needs to get some. Yes. Not everything which isn't a crime is good. Cheating on your partner may not be illegal, but definitely a shitty thing to do. All the while the male gets shafted by the law is what makes this worse. Yup Then he can also deny treatment to the person Isn't marriage a contract between husband and wife so if a third party gets involved in mine then she should expect divorce and same goes to me. If you want to whore around then don't marry. Why will he do that? Idiot doesn't want to miss out on money Nobody is justifying cheating bro. >Multiple sexual partners in what definition? At the same time? In their entire life. Not necessarily at the same time. >Do all the other parties know that it's not exclusive? If not, that will be cheating. Yes cheating should be shamed, but the doctor was slut shaming women for having sexual partners and that is a problem. We humans have some ethics culture have brain have power of thinking what's right and whats wrong we are not animals like dog like Street dogs have multiple partners we are not dogs or animals we are humans. Your comment didn't say good or bad, it said 'law' and it favouring one gender over another. I will repeat since you don't know what your own comment was, there is no law that penalises one gender for this and not another, in India at least. Not sure from where you are getting your law knowledge Social constructs are never rational... +1 If he practices what he preaches then that's not a problem at all. For example, I have never had an addiction not I ever touched something addictive. I do judge addicted people. I would be a hypocrite if I judged someone while i did a similar thing myself. But I'm not. So I'm clear that way. Same goes for this guy. If he practices what he preaches, he's clear to speak what he has in mind. Dr finding out Jordan Peterson, Ben Shapiro, Andrew Tate for the first time False equivalence. Addiction damages your body, sex doesn't. What he is doing is PROJECTION. appropriate comparison would be - Like I wouldn't have tattoos on my body but I wouldn't judge people who have. He is also going out of his way to Target and slut shame that women and women in general. Harrassing and name calling someone for their personal choices is never justified. Dont have to be judgemental, let them do their thing. Everyone has the right to explore. But, I do agree with the guy that its nothing to be proud of, since sex comes easy to women, unlike men. Most women dont have to try or put much effort in finding someone to have sex with. But, most men do need to put a lot of effort, and has to pass a lot of criterias to even get the attention of the opposite sex. And hence, a man can be proud of having multiple sexual partners. If someone achieves something that they can get easily, then its not gonna be respected. Right. Make up stories about a fictional character. > there is no law that penalises one gender for this and not another, in India at least. Wait till you know about dowry laws, alimony laws, child custody laws, etc etc What is his point of view on men having multiple partners? That one 1 tweet about having multiple sexual partner is so inaccurate. He didn't phrase it properly. My opinion is the doctor is wrong she can do whatever she can. But when a man want look if her future wife can do housework or not he shouldn't be judge as well by anyone. Multiple partners means having a sexual history if many people, it doesn't mean cheating after marriage or cheating while in relationship, those are called open marriage and open relationship. Wait till you know about whataboutery and why you should not use it if you want to indulge in an constructive discussion By forced, of course I didn't mean someone threatened her to do it or something. But it wasn't her decision. Nor did Yudhisthira ask her opinion before taking the decision. Stop pretending like this was the golden age of gender equality or something. Yes but not when he's being a professional. If a doctor in US does that, his licence would be revoked. Treat the patient for his/her illness. Not talk all the shit that comes to the mind I am not saying that it was a golden age of gender equality either, what I am saying is she was a strong woman who if was opposed to the marriage would have spoken against it. Earth at no point of time has been gender equal. I mean even now girls are subjected to constant speculations and doubts, and even then they were. I am just point out that she was not some helpless damsel we portray her to be. She was strong and independent. I did no way mean to be disrespectful to you, if I did however, come across as that, I apologise! This is a messed up take She actually had only one sexual partner - Arjun, but all 5 as her partners. This was explained in Mahabharat somewhere. I could clearly recall. More backwards than what these nerdy losers are saying? Non-ethical non-monogamy perpetuated by men, without the consent of their partners, was turned a blind eye towards and in many instances considered inevitable by most of Indian society for centuries. Ethical non-monogamy today, especially in instances of women (which involves no deception with their partners) is suddenly threatening to society. Even sex before marriage for women is 'wrong', the mere idea of women in control of their bodies is suddenly 'emulating the wild west'. Well living in the same western society, I can tell you the freedom from judgement for women it brings- you don't have to fit into a certain mold to be taken seriously or respected by the larger society. I have friends who have chosen to not have pre-marital sex, friends who are polyamorous (ethically) and friends who are in stable, monogamous relationships, and no one is better or worse for it. While I am a monogamous woman myself, I do not know why people are so affected by women's personal choices about their bodies. This kind of enmeshing of 'personal views' and professional opinion from Indian docs- esp ones who enjoy a large social media following and therefore reach millions - is disheartening. It will create barriers in the minds of people who will hesitate to seek a medical opinion now. Just remember, this kind of taboo is exactly why women are hesitant to go to a gynaecologist in the first place and conditions like 'PCOS' are not taken seriously. Also as a scientist myself, the propagation of misinformation is stagerring. Most loudmouth vocal doctors on Twitter are almost always mediocre/below average in actual practice and skill, best to ignore these online warriors When he displays Dr. in his user id, he is speaking as a doctor and needs to be called out as such. Bro please swallow only one red pill a day No that's factually incorrect. She has 5 sexual partners but only one at a time. It changed yearly. Some versions say it changed when she desired. Nope. She had at least one kid from each husband. But this not my point here. I'm only talking about the freedom she had back then and the unfortunate lack of freedom for today's Indian women Unfortunately such judgemental attitude is not uncommon. Our groups are rife with misogyny. Ultimately the doctors themselves are part of the society and their attitudes are a reflection of the society. Education sadly is not enough to eradicate prejudice. I need to see a viable source. Not that i don’t believe you but for my own curiosity. You can search for names of her 5 children. That is same in every version. > most medical colleges have mess separated on caste basis That is messed up. Wait till you get married and learn about the gender bias of our laws. When i read this on reddit few days back i thought the doctor is some grumpy old man but nope, even a young person who is a medical professional have this kind of scum misogynistic regressive 200BC attitude and now i've read other doctors supporting this shithead, we are fucked guys. thats bullshit,dont just beleive whatever crap anyone starts spouting lmao It all depends on whether they are at the same time or not. Still messed up though? He is switching his position. The original post expressed frustration at doctors judging women. If you ask your women friends, you would know how common this experience is, inside clinics. They face judgement during consultation. This bigot doubles down and says that he WILL judge, as xyz is not right mentally physically or psychologically (none of which are medically correct statements). Now that he has been called out he is changing his position and saying that he actually does not judge. Could be declared the national hobby. Free to have multiple partners but not free to have multiple opinions ? Hmmmm Then you should not have any problem with men wanting a virgin wife. see, freedom of choice goes both ways. Personally give that I would to a doctor more often than not because of stupidity or lack of awareness of some illness, I would very much like them to be less judgy. Or atleast less obvious about their judgement. Its like your mechanic being judgy about your driving style, when all you want him to do is fix the problem, becuase that is what you pay him for. I'll take his opinion on other things if I want it thank you. Imo moral policing is wrong but I won't like this kind of thinking. So probably dating someone like her is no no for me. W doctor But can he source clinical research in the comments proving multiple sexual partners is not 'medically' fit for every demographic type despite taking precautions for STDs? If no, then his tweet is propagating psuedoscience. There are shit people and good people doing all kinds of jobs. This one just happens to be a doctor. So multiple partner for women is not a show off because easy, but multiple partners for men are because they are incapable. Mmmmm okay > And it was Yudhishthir's decision that she marries them all. nope, it was kunti's. &nbsp; arjuna told her, \"look, mom, what i've brought!\"; kunti replied, without looking, \"share it with your brothers.\". I know it was long time ago,but.... I have seen this kind of experience happened to a student in my college who happened to be Dalit. It ain't black and white anymore. You have to be really observant on how discrimination happens. It is very subtle nowadays. Yes. If you are incapable of something that doesn't come easily to you, and you achieve it by putting in lot of effort and hard work into it, it is something to be proud of. Think of it this way. If a man/woman works hard, went through tough times, took a lot of risk, put in a lot of effort and became rich and in a good position, he/she will be respected. But, if they just inherits the money or property from their parents without doing any work, they wont be respected because it was just given to them with ease. Agreed this did happen. However, following this Arjun told Yudhishthir he should marry Draupadi because he was the eldest. I mean at least this is what I have read in Mahabharat by KMG. And then Yudhishthir notices that all the brothers looked smitten by her. And so, then he says that we all should marry her. At least this is what I have read 😅 I'm also currently reading the Bibek Debroy version but have not reached till this part. Let's see if that one also says this! Nah, AFAIR, the pandavas had a schedule of whoo would have draupadi when. &nbsp; Also there was a rule that if she was alone in a room with one pandava, and any other pandava entered the room at that time, he would have to go into exile for a period; this was the reason for one of arjuna's exiles. It's not us and as long my understanding he is saying it on Twitter not infront of a petient every one has person life opinion which they can share What is he saying is correct supporting cheating is not woke No, she never had freedom. She chose Arjuna but Kunti made her marry all 5 of them to keep the family together and prevent them from splitting with their separate families (this is commonly practiced by many tribes with scarce resources). She opposed it too but her father intervened and she stayed. This rule of purification and sharing common wife with each husband for a year and shifting to the next was suggested by Ved Vyas... . Life was not easy back then they had to manage with whatever the best they had and can. And such a man ending up alone should also not result in men blaming women. Bhai it's so funny watching adults pick on things to attack 😂. \"Naam me Dr. use kyu kia? 😡\" True. Same with women who end up alone because they had a lot of partners and men don't want to choose her for \"that\" reason should not blame men Nobody's stopping na? Kya fark pad gaya if 1 random guy on twitter said he will judge. This shouldn't even be a topic worthy of so much discussion and attention lol. People will quote anything to fire their bigotry bhai. Ek kare to theek, dusra kare toh its wrong. We only have enough fossil fuels for the next few decades. You are totally ignoring the context here, and its obvious why. I am not talking about a random person who expressed a random opinion while having Dr. in his name. He advertises himself as a doctor in twitter, his bio is full of his medical credentials, and majority of his tweets are medical field related/based on his identity as a doctor. And in this particular occasion, he used his 'medical knowledge' and quoted 'medical facts' to slut shame females who dare to explore their sexuality. And his arguments are perceived as 'expert opinion' by the readers thanks to the things i mentioned above. Its funny when adults cannot appreciate the context and nuances and needs others to spoonfeed the same. >and its obvious why. Why? From what I've seen, such women are usually the ones who end up in long term relationships, often healthy ones with men who are as promiscuous as them, or at least as socially liberal. They have their own problems, but being alone is usually not one of them. I know men like you have some super awesome revenge fantasy against the women that refuse to sleep with you, but that's unfortunately not how reality works. Good luck though. Men who think like this more often than not end up alone because women don't want to tolerate misogyny, laziness, and abuse from conservative man-children. Because if you take context into consideration there is nothing funny about my comment. Which means you wouldnt have a reason to post your 'clever' response to that Oh ok >I know men like you have some super awesome revenge fantasy against the women that refuse to sleep with you > misogyny, laziness, and abuse Haha, if the females in my life(friends and sisters) saw that presumption you made about me without knowing anything of me, they'd laugh at you so bad. Ad hominem. The discussion is over. Bingo, I am married for 05 years. Enjoy life then. Don't waste it browsing reddit and talking to strangers online. I don't take life lessons, especially not from the school of thought that you subscribe to. I will do whatever I want to with my time, my life. Cheers. You have no idea what school of thought I subscribe to. It's beyond your mental capacity to understand. I don't want an idea and even if I wanted to, like you said, it's beyond my mental capacity. Over and out. > beyond my mental capacity Exactly. >\"Females\" in my life. Yeah, sure bud. Whatever makes you happy. Idrc now. Mmm but I always thought your career and professional life was a social thing and sex a little more private in comparison 🤔 Not private when you are trying to figure out if you are respected on its basis and should or should not feel proud about it."
}