{
    "id": "10nzbmr",
    "title": "In India, how can I see comet c/2022 e3 (ztf) with naked eyes?",
    "url": "https://www.reddit.com/r/india/comments/10nzbmr/in_india_how_can_i_see_comet_c2022_e3_ztf_with/",
    "selftext": "&gt;Comet C/2022 E3 (ZTF) is currently making its way through the northern skies and should reach its brightest magnitude in early February, [according to In-The-Sky.org](https://in-the-sky.org/comets/20230201_CK22E030_2.png)(opens in new tab) as it approaches perigee on Feb. 1. To see the comet for yourself, look to the north just after sunset and look for a faint greenish glow. Under the right dark sky conditions, the comet could be visible to the unaided eye, but [binoculars](https://www.space.com/26021-best-binoculars.html) will certainly make the job easier.\n\nCredits : [https://www.space.com/comet-c2022-e3-ztf-how-to-see-approach-earth](https://www.space.com/comet-c2022-e3-ztf-how-to-see-approach-earth)\n\nImage Credit &amp; [Copyright](https://apod.nasa.gov/apod/lib/about_apod.html#srapply): [Dan Bartlett](https://www.astrobin.com/users/h2ologg/)\n\nhttps://preview.redd.it/o4flktstywea1.png?width=960&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=df3279e1b38643708e54128fc8f9e8ca32e411cf",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 6,
    "created_utc": 1674968107,
    "convurl": "https://b.thumbs.redditmedia.com/S2GnbIft6iYODZrD7n4dRxHTx0ZiOjZRFcKCsUVCB2c.jpg",
    "comments": [
        "It depends where you are staying. In big cities, it's almost impossible to see it because of light pollution. \n\nMaybe at the outskirts of the city you can see it on a clear night, with binoculars, as long as the moon is not too bright (new moon or crescent).",
        "Stellarium says you can see it tonight at 10:30 PM, at 15° declination (angle above the horizon) and 10° east from the north pole.\n\nIt'll reach peak declination of around 23° at 0° North at around 3 AM tomorrow. (These numbers are for Bangalore, btw. They'll slightly change depending on how high up you are from the equator)\n\nBut it's magnitude is only 5.5 which means it is among the faintest objects in the night sky. Even on its perigee on Feb 1st, the magnitude will only slightly improve to 5.4. So, I'm not sure if you'll be able to spot it in the city and without a binoculars.\n\nYou could install Stellarium on your phone and try your luck.",
        "I live in big city :(",
        "Let's see if I can spot it with naked eyes which is least possible, will update you.",
        "👍🏽",
        "Let me know if you were able to spot this in Bangalore"
    ],
    "cleaned_text": "india see comet c e ztf naked eyes gtcomet c e ztf currently making way northern skies reach brightest magnitude early february according intheskyorghttpsintheskyorgcometsckepngopens new tab approaches perigee feb see comet look north sunset look faint greenish glow right dark sky conditions comet could visible unaided eye binocularshttpswwwspacecombestbinocularshtml certainly make job easier credits httpswwwspacecomcometceztfhowtoseeapproachearthhttpswwwspacecomcometceztfhowtoseeapproachearth image credit amp copyrighthttpsapodnasagovapodlibaboutapodhtmlsrapply dan bartletthttpswwwastrobincomusershologg ",
    "cleaned_title": "india see comet c e ztf naked eyes",
    "cleaned_selftext": "gtcomet c e ztf currently making way northern skies reach brightest magnitude early february according intheskyorghttpsintheskyorgcometsckepngopens new tab approaches perigee feb see comet look north sunset look faint greenish glow right dark sky conditions comet could visible unaided eye binocularshttpswwwspacecombestbinocularshtml certainly make job easier credits httpswwwspacecomcometceztfhowtoseeapproachearthhttpswwwspacecomcometceztfhowtoseeapproachearth image credit amp copyrighthttpsapodnasagovapodlibaboutapodhtmlsrapply dan bartletthttpswwwastrobincomusershologg",
    "cleaned_comments": "depends staying big cities almost impossible see light pollution maybe outskirts city see clear night binoculars long moon bright new moon crescent stellarium says see tonight pm declination angle horizon east north pole itll reach peak declination around north around tomorrow numbers bangalore btw theyll slightly change depending high equator magnitude means among faintest objects night sky even perigee feb st magnitude slightly improve im sure youll able spot city without binoculars could install stellarium phone try luck live big city lets see spot naked eyes least possible update let know able spot bangalore",
    "light_cleaned_title": "In India, how can I see comet c/2022 e3 (ztf) with naked eyes?",
    "light_cleaned_selftext": "&gt;Comet C/2022 E3 (ZTF) is currently making its way through the northern skies and should reach its brightest magnitude in early February, [according to In-The-Sky.org](https://in-the-sky.org/comets/20230201_CK22E030_2.png)(opens in new tab) as it approaches perigee on Feb. 1. To see the comet for yourself, look to the north just after sunset and look for a faint greenish glow. Under the right dark sky conditions, the comet could be visible to the unaided eye, but [binoculars](https://www.space.com/26021-best-binoculars.html) will certainly make the job easier. Credits : [https://www.space.com/comet-c2022-e3-ztf-how-to-see-approach-earth](https://www.space.com/comet-c2022-e3-ztf-how-to-see-approach-earth) Image Credit &amp; [Copyright](https://apod.nasa.gov/apod/lib/about_apod.html#srapply): [Dan Bartlett](https://www.astrobin.com/users/h2ologg/)",
    "light_cleaned_comments": "It depends where you are staying. In big cities, it's almost impossible to see it because of light pollution. Maybe at the outskirts of the city you can see it on a clear night, with binoculars, as long as the moon is not too bright (new moon or crescent). Stellarium says you can see it tonight at 10:30 PM, at 15° declination (angle above the horizon) and 10° east from the north pole. It'll reach peak declination of around 23° at 0° North at around 3 AM tomorrow. (These numbers are for Bangalore, btw. They'll slightly change depending on how high up you are from the equator) But it's magnitude is only 5.5 which means it is among the faintest objects in the night sky. Even on its perigee on Feb 1st, the magnitude will only slightly improve to 5.4. So, I'm not sure if you'll be able to spot it in the city and without a binoculars. You could install Stellarium on your phone and try your luck. I live in big city :( Let's see if I can spot it with naked eyes which is least possible, will update you. 👍🏽 Let me know if you were able to spot this in Bangalore"
}