{
    "id": "15zov52",
    "title": "This is setting a very dangerous trend in mob justice. Must be curbed in bud otherwise it can turn very ugly.",
    "url": "https://www.reddit.com/r/india/comments/15zov52/this_is_setting_a_very_dangerous_trend_in_mob/",
    "selftext": "[https://timesofindia.indiatimes.com/city/agartala/tripura-panchayat-member-instigates-mob-to-strip-woman-beat-her-up-after-son-caught-stealing-money/articleshow/102941446.cms?from=mdr](https://timesofindia.indiatimes.com/city/agartala/tripura-panchayat-member-instigates-mob-to-strip-woman-beat-her-up-after-son-caught-stealing-money/articleshow/102941446.cms?from=mdr)\n\nAfter buldozer justice, there have been few incidents of mob justice involving stripping women. This could lead to very ugly incidents as the already perverted mob would do this at the slightest provocation. Strictest action needs to be taken.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692844162.0,
    "convurl": "https://external-preview.redd.it/7Cje53egFi5WcByhMe09VyaD3QM8tNZlxCmCtDUSl_Y.jpg?auto=webp&s=da80ef51379ce88f7c91023de4af8935fd6a5186",
    "comments": [
        "Opposition should push for judicial reforms.No other way the conditions can be improved"
    ],
    "cleaned_text": "setting dangerous trend mob justice must curbed bud otherwise turn ugly httpstimesofindiaindiatimescomcityagartalatripurapanchayatmemberinstigatesmobtostripwomanbeatherupaftersoncaughtstealingmoneyarticleshowcmsfrommdrhttpstimesofindiaindiatimescomcityagartalatripurapanchayatmemberinstigatesmobtostripwomanbeatherupaftersoncaughtstealingmoneyarticleshowcmsfrommdr buldozer justice incidents mob justice involving stripping women could lead ugly incidents already perverted mob would slightest provocation strictest action needs taken ",
    "cleaned_title": "setting dangerous trend mob justice must curbed bud otherwise turn ugly",
    "cleaned_selftext": "httpstimesofindiaindiatimescomcityagartalatripurapanchayatmemberinstigatesmobtostripwomanbeatherupaftersoncaughtstealingmoneyarticleshowcmsfrommdrhttpstimesofindiaindiatimescomcityagartalatripurapanchayatmemberinstigatesmobtostripwomanbeatherupaftersoncaughtstealingmoneyarticleshowcmsfrommdr buldozer justice incidents mob justice involving stripping women could lead ugly incidents already perverted mob would slightest provocation strictest action needs taken",
    "cleaned_comments": "opposition push judicial reformsno way conditions improved",
    "light_cleaned_title": "This is setting a very dangerous trend in mob justice. Must be curbed in bud otherwise it can turn very ugly.",
    "light_cleaned_selftext": "[https://timesofindia.indiatimes.com/city/agartala/tripura-panchayat-member-instigates-mob-to-strip-woman-beat-her-up-after-son-caught-stealing-money/articleshow/102941446.cms?from=mdr](https://timesofindia.indiatimes.com/city/agartala/tripura-panchayat-member-instigates-mob-to-strip-woman-beat-her-up-after-son-caught-stealing-money/articleshow/102941446.cms?from=mdr) After buldozer justice, there have been few incidents of mob justice involving stripping women. This could lead to very ugly incidents as the already perverted mob would do this at the slightest provocation. Strictest action needs to be taken.",
    "light_cleaned_comments": "Opposition should push for judicial reforms.No other way the conditions can be improved"
}