{
    "id": "14zcxth",
    "title": "This is what we pay for as Indians, Not a witch hunt but for awareness and entertainment.",
    "url": "https://www.reddit.com/r/india/comments/14zcxth/this_is_what_we_pay_for_as_indians_not_a_witch/",
    "selftext": "[https://www.twitch.tv/videos/1871521191](https://www.twitch.tv/videos/1871521191)  \n\n\nSorry about the longform video. I appreciate and truly thank you for taking time out of your day to view it. I did contact customer care who very quickly dismissed my complaint and said they'd \"look into it\". I understand that there are way more pressing issues plaguing the country but I rarely post. Please consider watching what I had to say from the bottom of my heart about people who exploit \"made in India\" sentiments to deliver absolute dogshit and ruin fellow countrymen.   \n\n\nI thank you for your patience and I hope you got a moments worth of entertainment even if you don't sympathize with my argument. Thank you!",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689331150.0,
    "convurl": "https://external-preview.redd.it/kARG_NNOic6HuuHHGdFqv8h6tl288kjtqlxNefjisdk.jpg?auto=webp&s=4af4ed9a2be0e26faf86a7c83fe906140ae165da",
    "comments": [
        "Don't buy Indian products especially if they are very cheap compared to alternatives and for daily usage. The worst part is most of it is probably made in China and sold with Made in India tag at an extra charge. At least China sells for cheap while India will try to scam for extra money.   \n   \nTry to get a refund. Make a video on youtube and post the issue on Twitter too.",
        "This is disgusting but honestly man it's your own fault for trusting some crap off Amazon. I'm sorry for you! Hope you're able to rise up from this and come back.",
        "This is absolutely disgusting but it comes down to you trusting some crap on amazon. I sincerely hope you rise above it but obviously try your luck on twitter or some other platforms."
    ],
    "cleaned_text": "pay indians witch hunt awareness entertainment httpswwwtwitchtvvideoshttpswwwtwitchtvvideos sorry longform video appreciate truly thank taking time day view contact customer care quickly dismissed complaint said theyd look understand way pressing issues plaguing country rarely post please consider watching say bottom heart people exploit made india sentiments deliver absolute dogshit ruin fellow countrymen thank patience hope got moments worth entertainment even dont sympathize argument thank ",
    "cleaned_title": "pay indians witch hunt awareness entertainment",
    "cleaned_selftext": "httpswwwtwitchtvvideoshttpswwwtwitchtvvideos sorry longform video appreciate truly thank taking time day view contact customer care quickly dismissed complaint said theyd look understand way pressing issues plaguing country rarely post please consider watching say bottom heart people exploit made india sentiments deliver absolute dogshit ruin fellow countrymen thank patience hope got moments worth entertainment even dont sympathize argument thank",
    "cleaned_comments": "dont buy indian products especially cheap compared alternatives daily usage worst part probably made china sold made india tag extra charge least china sells cheap india try scam extra money try get refund make video youtube post issue twitter disgusting honestly man fault trusting crap amazon im sorry hope youre able rise come back absolutely disgusting comes trusting crap amazon sincerely hope rise obviously try luck twitter platforms",
    "light_cleaned_title": "This is what we pay for as Indians, Not a witch hunt but for awareness and entertainment.",
    "light_cleaned_selftext": "[https://www.twitch.tv/videos/1871521191](https://www.twitch.tv/videos/1871521191) Sorry about the longform video. I appreciate and truly thank you for taking time out of your day to view it. I did contact customer care who very quickly dismissed my complaint and said they'd \"look into it\". I understand that there are way more pressing issues plaguing the country but I rarely post. Please consider watching what I had to say from the bottom of my heart about people who exploit \"made in India\" sentiments to deliver absolute dogshit and ruin fellow countrymen. I thank you for your patience and I hope you got a moments worth of entertainment even if you don't sympathize with my argument. Thank you!",
    "light_cleaned_comments": "Don't buy Indian products especially if they are very cheap compared to alternatives and for daily usage. The worst part is most of it is probably made in China and sold with Made in India tag at an extra charge. At least China sells for cheap while India will try to scam for extra money. Try to get a refund. Make a video on youtube and post the issue on Twitter too. This is disgusting but honestly man it's your own fault for trusting some crap off Amazon. I'm sorry for you! Hope you're able to rise up from this and come back. This is absolutely disgusting but it comes down to you trusting some crap on amazon. I sincerely hope you rise above it but obviously try your luck on twitter or some other platforms."
}