{
    "id": "13vo9py",
    "title": "This upcoming Delimitation is such a Tragedy.",
    "url": "https://www.reddit.com/r/india/comments/13vo9py/this_upcoming_delimitation_is_such_a_tragedy/",
    "selftext": " \"This is indeed a travesty and a tragedy if it does come true. Southern states of India have been the best performers on all fronts post-independence\n\nLeaders and people of all Southern states need to raise their voices collectively cutting across political affiliations against this injustice\" - KTR via Twitter\n\nhttps://preview.redd.it/b4h9t4rq103b1.png?width=2160&format=png&auto=webp&v=enabled&s=519c9337bed959a0755a7c5f37f93c044c282102",
    "flair": "Politics",
    "score": 134,
    "num_comments": 63,
    "created_utc": 1685447878.0,
    "convurl": "https://b.thumbs.redditmedia.com/Aix3Xalxq0koDhmuzDrn-EX1sVZz_9DqltFu6OCZMjo.jpg",
    "comments": [
        "What's the solution??",
        "People from just two states UP/Bihar will have more representation than anyone else. Two states will dominate 25% of the seats.",
        "To not change it. No state should be rewarded for breeding like rabbits while others implemented family planning.",
        "I am from the south and I mind this. You'll probably mind this too when you realise that people from a handful of states will decide Lok Sabha elections",
        "The solution is to keep it as is. Simple enough, really. Have a look at current rates and see if you think some states are underrepresented",
        "Lol I've worked on delimitation previously. My point is exactly that - states shouldn't be put at an advantage just because they can't implement family planning properly. That was why delimitation didn't happen in 2002, that's why it shouldn't happen in 2026.",
        "I am also from South and I do mind this ...",
        "There has to be some power balance.\n\nGreater federalization, more powers to Rajya Sabha and so on.",
        "There is a solution.... break up all current states into a number of equally populated states. This will break up any dissipative tendencies as well as give equal representation.",
        "Fundamentals.\n\n1 person = 1 vote.\n\nDivide all the compartments ~equally for more equity.\n\n\nAs for population, the North will always be more populus on average, family planning or not. Its enabled by the geography.",
        "Why not divide the states then? Bundelkhand, Braj etc.",
        "Family planning ot not, the northern plains can hold and support more people on average.\n\nThe solution is migration.",
        "South India.  \nOr one more Rajiv Gandhi tactic☠️. Or Indira Gandhi. Or basically any important Gandhi☠️. All of them were assassinated (even mahatma gandhi). Modi finally can fulfill his wish of becoming a dictator by joining the family dynasty's preferred way of deaths.",
        "Is actually a good idea. But I don't have the authority to do that. So, I didn't divide the states.",
        "South's honest reaction : Goes around spreading their DNA aggressively.  \n India's population going to touch 10 billion. Master stroke by Mudi ji. His Sanatan drum policies will surely save us all. As it had for thousands of years against the mughals, the British.",
        "Please stop fear mongering the devolution of Loksabha seats is not just based on population but also on equal representation. ECI is aware of this.\nUp+ bihar is 30 Cr, i.e. almost 20% of national population, however population density will also be taken into account.",
        "That's not a solution because you are breaking up the states for the wrong reason.\n\nUsually, it is either similar demographics or need to manage the larger area more efficiently which should drive these break up of states into smaller one.",
        "Cow belt is cow belt. That won't magically increase the GDP or literacy rate there. You can't cure stupidity.",
        "Higher density is to rationalise the representation, i.e. to use in inverse proportion to ensure balance between population and equal representation is maintained",
        "So you are saying that the seats will be distributed based on population (direct proportion) and population density (inversely)?",
        "You don't mind because you have zero idea how this is gonna affect the southern states. But it's fine. Ignorance is not a crime.",
        "If implemented the way it is presented, the country's political, economic and social perspectives will change forever. Everything will be created for and be consumed by the hindi belt. Nothing else will matter.",
        "I can tell how it affected Kerala. It's bigger than Goa but contributes fewer loksabha seats to the current ruling party. So we see we get ignored routinely from Central govt projects and Railway etc. More than that we see a particular set of people encourage propaganda against the state even if it means people from Kerala will be angry about it. You see statements from politicians saying Kerala is like Somalia and implying that if Karnataka don't vote for the party, they will end up like Kerala. All of these happened because in the grand scheme of Indian politics, Kerala has very little political power. Now imagine the whole South is like this and how it's gonna affect when central govt makes policies. Imagine how much money they get from Central projects. What will be the attitude towards Hindi etc.",
        "Well then by that logic, not increasing the number of seats for the cow belt would also not harm them.",
        "It's not geography. It's the fertility rate. UP and BH have rates well above 2.1 while southern states have well below 2.",
        "The trajectory is in the opposite direction. The govt is trying to centralise everything",
        "> As for population, the North will always be more populus on average, family planning or not. \n\nThat has nothing to do with what I said.",
        "how will that change where they are cesspit of right wing politics",
        "If they try to force this through, the south will need to create an alliance to get their voices heard. I am pretty sure with these jokers in charge, the south will be labelled traitors just for trying to have their voices heard.",
        "true",
        "How do you know that the ECI will actually do this? The law doesn't require it.",
        ">\tHow long will we ignore the bimaru states ?\n\nIt is news to me that we have ignored those states. Remind me which state sends most MPs to the LS, and which state is considered the biggest prize in the general elections?\n\nTen out of India's 14 PMs, namely Nehru, Shastri, Indira, Rajiv, Charan Singh, VP Singh, Chandra Shekhar, ABV and Modi were either from UP or representing UP. Gujral was an RS MP from Bihar. To be fair, 5 of Indira's 16 years were from Medak so you can deduct those. But still, the argument that the north was ignored is astounding when 51 out of 75 years have featured a PM from UP or BH. And every single long running PM except Manmohan is a UP MP. \n\n\n>\tAt some point we need to pull them up , and save them from sabotaging themselves\n\nNobody is saying that you don't. But that shouldn't come at the cost of penalizing southern states and incentivising poor performance on family planning. \n\nAnd if you think they are sabotaging themselves, why should they be rewarded with more seats while the states that aren't self sabotaging should be punished with lesser proportion of seats in the LS?\n\nAnd clearly the union govt doesn't share your view because instead of seeing southern states as an example, it tries to demonize us with the PM and HM promoting a vile movie and painting an entire southern state as evil. \n\n\n>\tMaybe we can introduce laws that give special status to South Indian states\n\nThe trajectory is in the opposite direction, with the union govt centralising more financial and policy making powers. \n\n\n>\tPeople are just bitching and moaning about this for months but literally no solution has been proposed\n\nThat is ridiculous. We elect govts to solve problems. This imbalance between north and south is not a new problem, the govt has known about it for ages. It has both the authority and the responsibility to address it. Why do you not ask what solutions the govt has to address the problem? When a person is raising a concern, why is the onus of providing a solution with the same person? \n\nIf that is how you are going to approach it, then fine. Apply the same logic across the board. The lack of development in UP is a concern for UP people and it should be their headache to figure out how to solve it with the current LS as it stands. And if they don't, then they're bitching and moaning. \n\n\n>\tYou just want to use this issue for political gains\n\nThe issue is inherently political, as it has to do with representation at the center, which is by its very nature a zero sum game.",
        "ECI is a constitutional body and there is something called as delimitation Act. Meaning the ECI has to do delimitation as per provisions of the act and the govt cannot interfere into this process. \nThe act is based of these principles:\n1. Equal representation\n2. Census \n3. Reservation (SC St act)\n4. Geography\n5. Avoiding Gerrymandering, i.e. delimitation should not give any undue advantage to any party\n\nNow one can argue that ECI can be partial however, in such a case it can be challenged in SC based on above principles, which even the ECI understands, so they have very limited scope of deviation from the constitutional responsibilities to favour any party.",
        "None of those relates to or even mentions population density. And as you point out, census figures ie population are a major factor.. \n\nThere is nothing in your comment that addresses the concern from Southern states that they are going to be punished for population control. \n\nThe partiality issue isn't even relevant. Simply by taking population as the key variable, one can obtain the result that he southern states are penalised.\n\nBtw even if it did take density into account, Bihar and UP are the 5th and 9th densest states. TN, MH, and KA all have lesser density. So it's not like this variable would change much even if it was used.",
        "There is multiple points that I have listed amongst them is population and geography, which gives us population density.\nPopulation density is used to rationalise the seat representation. Take extreme example like Goa has 5 lakhs person per MP, whereas UP has 25 lakhs.\n\nSo regions with higher density has higher no of people representing per MP.",
        "The least successful people who kept losing every major war against invaders, purely from following caste and discarding meritocracy; and the north western merchants who sold other south asians as slaves to the world, they are back to assuming majority power again. This time it will totally be fine. We serfs totally have rights protected. We didn't lose territory to China /s",
        "*keedas",
        "Again, that is your conjecture. Let us look at the law itself, which you can find [here](https://eci.gov.in/files/file/7317-the-delimitation-act-2002/)\n\nPage 4 is the relevant page, where it says it will determine seats based on \"the census figures as ascertained at the census held in the year 1971\"\n\nThe reference to geography comes later, where it says:\n\n> all constituencies shall, as far as practicable, be geographically compact areas, and in delimiting them regard shall be had to physical features, existing boundaries of administrative units, facilities of communication and public convenience\n\nWhich prevents gerrymandering, but is not related to the density of the population in the area. Your Goa example is probably due more to the fact that practicality requires an integer number of seats - you cannot have one-third of an MP, for instance. \n\nAnd if it was based on density, as I pointed out earlier, UP and BH still come up close to the top while a number of southern states + MH come later. So even if density was considered (which it is not) it wouldn't change the outcome much. The original point that it will result in a reduction of % of southern seats still stands. Your density point is largely irrelevant to this discussion anyway.",
        "Take recent delimitation of J&K.\n44% population of Jammu votes for 48% of seats, while 56% of Kasmir votes for 52% of seats.\nSo with a population difference of 12% the seat difference is just 4%.\nThis is done so that Jammu despite lower population gets equal representation.\nToday 5 states of south have 119 seats and Up+bihar 120 so difference is 1. Population is of up+Bihar is 30 cr while of south is 24 cr. \nTaking into account of population and representation the difference between south and thess states would not be more than 10, as opposed to 60 which is shown here.\nAlso there is no set formula for delimitation. ECI takes into account opinion of all the stakeholder and comes up with solutions to address major concerns raised by stakeholders. Southern states have already raised this concern and ECI will surely address it.",
        "You seem to have more faith on the ECI doing the right thing even though it is not legally required to do so. I don't. \n\nEspecially given that after the KA verdict, all five southern states and their concerns can easily be painted as an anti national brigade.",
        "Even with empirical evidence and proper references you still have doubts. \nWhat you need to understand is that ECI is medium, but balance in dispensation is maintained by the interlocks and seperation of powers that constitution has given to each stakeholders. \nIn simple terms justice is delivered by the systems and processes not individuals or institute.\nAnyways keep believing what you believe there is no limitations to imagination and paranoia.",
        "I'll address your J&K example directly: Jammu recieved 6 more seats than they had previously. [Of those six seats, four have a Hindu majority](https://www.deccanherald.com/amp/national/north-and-central/explained-what-jk-delimitation-means-1106986.html). That sounds very convenient for the BJP. I wonder how seats would be divided when it comes to a bunch of states that are known for their anti national tendencies of voting against the BJP. \n\n\n>\tyou still have doubts.\n\nYes, because similar assurances were given during the 15th FC and the result was that southern states like Karnataka were the biggest losers.\n\nAnd I've given you a reference too. The act does not require the ECI to give any importance to the concerns of the southern states. That they will do so is your conjecture. So when you say \n\n\n>\tjustice is delivered by the systems and processes not individuals or institute\n\nThere is no defined process that says they need to do so. There is no requirement that southern states need to sign off on this. They could do delimitation entirely based on population, make a lip service remark that they considered our concerns, and they would be in line with the law.  \n\nSo you calling this paranoia is ridiculous, especially when you base it on one delimitation in J&K, and even that seems to *coincidentally* benefit the party that would love to reduce southern states to as few seats as possible.",
        "> Let's just let those kids suffer and die from curable diseases and suffer from poverty. \n\nWhat does this have to do with delimitation?"
    ],
    "cleaned_text": "upcoming delimitation tragedy indeed travesty tragedy come true southern states india best performers fronts postindependence leaders people southern states need raise voices collectively cutting across political affiliations injustice ktr via twitter ",
    "cleaned_title": "upcoming delimitation tragedy",
    "cleaned_selftext": "indeed travesty tragedy come true southern states india best performers fronts postindependence leaders people southern states need raise voices collectively cutting across political affiliations injustice ktr via twitter",
    "cleaned_comments": "whats solution people two states upbihar representation anyone else two states dominate seats change state rewarded breeding like rabbits others implemented family planning south mind youll probably mind realise people handful states decide lok sabha elections solution keep simple enough really look current rates see think states underrepresented lol ive worked delimitation previously point exactly states shouldnt put advantage cant implement family planning properly delimitation didnt happen thats shouldnt happen also south mind power balance greater federalization powers rajya sabha solution break current states number equally populated states break dissipative tendencies well give equal representation fundamentals person vote divide compartments equally equity population north always populus average family planning enabled geography divide states bundelkhand braj etc family planning ot northern plains hold support people average solution migration south india one rajiv gandhi tactic indira gandhi basically important gandhi assassinated even mahatma gandhi modi finally fulfill wish becoming dictator joining family dynastys preferred way deaths actually good idea dont authority didnt divide states souths honest reaction goes around spreading dna aggressively indias population going touch billion master stroke mudi ji sanatan drum policies surely save us thousands years mughals british please stop fear mongering devolution loksabha seats based population also equal representation eci aware bihar cr ie almost national population however population density also taken account thats solution breaking states wrong reason usually either similar demographics need manage larger area efficiently drive break states smaller one cow belt cow belt wont magically increase gdp literacy rate cant cure stupidity higher density rationalise representation ie use inverse proportion ensure balance population equal representation maintained saying seats distributed based population direct proportion population density inversely dont mind zero idea gon na affect southern states fine ignorance crime implemented way presented countrys political economic social perspectives change forever everything created consumed hindi belt nothing else matter tell affected kerala bigger goa contributes fewer loksabha seats current ruling party see get ignored routinely central govt projects railway etc see particular set people encourage propaganda state even means people kerala angry see statements politicians saying kerala like somalia implying karnataka dont vote party end like kerala happened grand scheme indian politics kerala little political power imagine whole south like gon na affect central govt makes policies imagine much money get central projects attitude towards hindi etc well logic increasing number seats cow belt would also harm geography fertility rate bh rates well southern states well trajectory opposite direction govt trying centralise everything population north always populus average family planning nothing said change cesspit right wing politics try force south need create alliance get voices heard pretty sure jokers charge south labelled traitors trying voices heard true know eci actually law doesnt require long ignore bimaru states news ignored states remind state sends mps ls state considered biggest prize general elections ten indias pms namely nehru shastri indira rajiv charan singh vp singh chandra shekhar abv modi either representing gujral rs mp bihar fair indiras years medak deduct still argument north ignored astounding years featured pm bh every single long running pm except manmohan mp point need pull save sabotaging nobody saying dont shouldnt come cost penalizing southern states incentivising poor performance family planning think sabotaging rewarded seats states arent self sabotaging punished lesser proportion seats ls clearly union govt doesnt share view instead seeing southern states example tries demonize us pm hm promoting vile movie painting entire southern state evil maybe introduce laws give special status south indian states trajectory opposite direction union govt centralising financial policy making powers people bitching moaning months literally solution proposed ridiculous elect govts solve problems imbalance north south new problem govt known ages authority responsibility address ask solutions govt address problem person raising concern onus providing solution person going approach fine apply logic across board lack development concern people headache figure solve current ls stands dont theyre bitching moaning want use issue political gains issue inherently political representation center nature zero sum game eci constitutional body something called delimitation act meaning eci delimitation per provisions act govt interfere process act based principles equal representation census reservation sc st act geography avoiding gerrymandering ie delimitation give undue advantage party one argue eci partial however case challenged sc based principles even eci understands limited scope deviation constitutional responsibilities favour party none relates even mentions population density point census figures ie population major factor nothing comment addresses concern southern states going punished population control partiality issue isnt even relevant simply taking population key variable one obtain result southern states penalised btw even take density account bihar th th densest states tn mh ka lesser density like variable would change much even used multiple points listed amongst population geography gives us population density population density used rationalise seat representation take extreme example like goa lakhs person per mp whereas lakhs regions higher density higher people representing per mp least successful people kept losing every major war invaders purely following caste discarding meritocracy north western merchants sold south asians slaves world back assuming majority power time totally fine serfs totally rights protected didnt lose territory china keedas conjecture let us look law find herehttpsecigovinfilesfilethedelimitationact page relevant page says determine seats based census figures ascertained census held year reference geography comes later says constituencies shall far practicable geographically compact areas delimiting regard shall physical features existing boundaries administrative units facilities communication public convenience prevents gerrymandering related density population area goa example probably due fact practicality requires integer number seats onethird mp instance based density pointed earlier bh still come close top number southern states mh come later even density considered wouldnt change outcome much original point result reduction southern seats still stands density point largely irrelevant discussion anyway take recent delimitation jk population jammu votes seats kasmir votes seats population difference seat difference done jammu despite lower population gets equal representation today states south seats upbihar difference population upbihar cr south cr taking account population representation difference south thess states would opposed shown also set formula delimitation eci takes account opinion stakeholder comes solutions address major concerns raised stakeholders southern states already raised concern eci surely address seem faith eci right thing even though legally required dont especially given ka verdict five southern states concerns easily painted anti national brigade even empirical evidence proper references still doubts need understand eci medium balance dispensation maintained interlocks seperation powers constitution given stakeholders simple terms justice delivered systems processes individuals institute anyways keep believing believe limitations imagination paranoia ill address jk example directly jammu recieved seats previously six seats four hindu majorityhttpswwwdeccanheraldcomampnationalnorthandcentralexplainedwhatjkdelimitationmeanshtml sounds convenient bjp wonder seats would divided comes bunch states known anti national tendencies voting bjp still doubts yes similar assurances given th fc result southern states like karnataka biggest losers ive given reference act require eci give importance concerns southern states conjecture say justice delivered systems processes individuals institute defined process says need requirement southern states need sign could delimitation entirely based population make lip service remark considered concerns would line law calling paranoia ridiculous especially base one delimitation jk even seems coincidentally benefit party would love reduce southern states seats possible lets let kids suffer die curable diseases suffer poverty delimitation",
    "light_cleaned_title": "This upcoming Delimitation is such a Tragedy.",
    "light_cleaned_selftext": "\"This is indeed a travesty and a tragedy if it does come true. Southern states of India have been the best performers on all fronts post-independence Leaders and people of all Southern states need to raise their voices collectively cutting across political affiliations against this injustice\" - KTR via Twitter",
    "light_cleaned_comments": "What's the solution?? People from just two states UP/Bihar will have more representation than anyone else. Two states will dominate 25% of the seats. To not change it. No state should be rewarded for breeding like rabbits while others implemented family planning. I am from the south and I mind this. You'll probably mind this too when you realise that people from a handful of states will decide Lok Sabha elections The solution is to keep it as is. Simple enough, really. Have a look at current rates and see if you think some states are underrepresented Lol I've worked on delimitation previously. My point is exactly that - states shouldn't be put at an advantage just because they can't implement family planning properly. That was why delimitation didn't happen in 2002, that's why it shouldn't happen in 2026. I am also from South and I do mind this ... There has to be some power balance. Greater federalization, more powers to Rajya Sabha and so on. There is a solution.... break up all current states into a number of equally populated states. This will break up any dissipative tendencies as well as give equal representation. Fundamentals. 1 person = 1 vote. Divide all the compartments ~equally for more equity. As for population, the North will always be more populus on average, family planning or not. Its enabled by the geography. Why not divide the states then? Bundelkhand, Braj etc. Family planning ot not, the northern plains can hold and support more people on average. The solution is migration. South India. Or one more Rajiv Gandhi tactic☠️. Or Indira Gandhi. Or basically any important Gandhi☠️. All of them were assassinated (even mahatma gandhi). Modi finally can fulfill his wish of becoming a dictator by joining the family dynasty's preferred way of deaths. Is actually a good idea. But I don't have the authority to do that. So, I didn't divide the states. South's honest reaction : Goes around spreading their DNA aggressively. India's population going to touch 10 billion. Master stroke by Mudi ji. His Sanatan drum policies will surely save us all. As it had for thousands of years against the mughals, the British. Please stop fear mongering the devolution of Loksabha seats is not just based on population but also on equal representation. ECI is aware of this. Up+ bihar is 30 Cr, i.e. almost 20% of national population, however population density will also be taken into account. That's not a solution because you are breaking up the states for the wrong reason. Usually, it is either similar demographics or need to manage the larger area more efficiently which should drive these break up of states into smaller one. Cow belt is cow belt. That won't magically increase the GDP or literacy rate there. You can't cure stupidity. Higher density is to rationalise the representation, i.e. to use in inverse proportion to ensure balance between population and equal representation is maintained So you are saying that the seats will be distributed based on population (direct proportion) and population density (inversely)? You don't mind because you have zero idea how this is gonna affect the southern states. But it's fine. Ignorance is not a crime. If implemented the way it is presented, the country's political, economic and social perspectives will change forever. Everything will be created for and be consumed by the hindi belt. Nothing else will matter. I can tell how it affected Kerala. It's bigger than Goa but contributes fewer loksabha seats to the current ruling party. So we see we get ignored routinely from Central govt projects and Railway etc. More than that we see a particular set of people encourage propaganda against the state even if it means people from Kerala will be angry about it. You see statements from politicians saying Kerala is like Somalia and implying that if Karnataka don't vote for the party, they will end up like Kerala. All of these happened because in the grand scheme of Indian politics, Kerala has very little political power. Now imagine the whole South is like this and how it's gonna affect when central govt makes policies. Imagine how much money they get from Central projects. What will be the attitude towards Hindi etc. Well then by that logic, not increasing the number of seats for the cow belt would also not harm them. It's not geography. It's the fertility rate. UP and BH have rates well above 2.1 while southern states have well below 2. The trajectory is in the opposite direction. The govt is trying to centralise everything > As for population, the North will always be more populus on average, family planning or not. That has nothing to do with what I said. how will that change where they are cesspit of right wing politics If they try to force this through, the south will need to create an alliance to get their voices heard. I am pretty sure with these jokers in charge, the south will be labelled traitors just for trying to have their voices heard. true How do you know that the ECI will actually do this? The law doesn't require it. > How long will we ignore the bimaru states ? It is news to me that we have ignored those states. Remind me which state sends most MPs to the LS, and which state is considered the biggest prize in the general elections? Ten out of India's 14 PMs, namely Nehru, Shastri, Indira, Rajiv, Charan Singh, VP Singh, Chandra Shekhar, ABV and Modi were either from UP or representing UP. Gujral was an RS MP from Bihar. To be fair, 5 of Indira's 16 years were from Medak so you can deduct those. But still, the argument that the north was ignored is astounding when 51 out of 75 years have featured a PM from UP or BH. And every single long running PM except Manmohan is a UP MP. > At some point we need to pull them up , and save them from sabotaging themselves Nobody is saying that you don't. But that shouldn't come at the cost of penalizing southern states and incentivising poor performance on family planning. And if you think they are sabotaging themselves, why should they be rewarded with more seats while the states that aren't self sabotaging should be punished with lesser proportion of seats in the LS? And clearly the union govt doesn't share your view because instead of seeing southern states as an example, it tries to demonize us with the PM and HM promoting a vile movie and painting an entire southern state as evil. > Maybe we can introduce laws that give special status to South Indian states The trajectory is in the opposite direction, with the union govt centralising more financial and policy making powers. > People are just bitching and moaning about this for months but literally no solution has been proposed That is ridiculous. We elect govts to solve problems. This imbalance between north and south is not a new problem, the govt has known about it for ages. It has both the authority and the responsibility to address it. Why do you not ask what solutions the govt has to address the problem? When a person is raising a concern, why is the onus of providing a solution with the same person? If that is how you are going to approach it, then fine. Apply the same logic across the board. The lack of development in UP is a concern for UP people and it should be their headache to figure out how to solve it with the current LS as it stands. And if they don't, then they're bitching and moaning. > You just want to use this issue for political gains The issue is inherently political, as it has to do with representation at the center, which is by its very nature a zero sum game. ECI is a constitutional body and there is something called as delimitation Act. Meaning the ECI has to do delimitation as per provisions of the act and the govt cannot interfere into this process. The act is based of these principles: 1. Equal representation 2. Census 3. Reservation (SC St act) 4. Geography 5. Avoiding Gerrymandering, i.e. delimitation should not give any undue advantage to any party Now one can argue that ECI can be partial however, in such a case it can be challenged in SC based on above principles, which even the ECI understands, so they have very limited scope of deviation from the constitutional responsibilities to favour any party. None of those relates to or even mentions population density. And as you point out, census figures ie population are a major factor.. There is nothing in your comment that addresses the concern from Southern states that they are going to be punished for population control. The partiality issue isn't even relevant. Simply by taking population as the key variable, one can obtain the result that he southern states are penalised. Btw even if it did take density into account, Bihar and UP are the 5th and 9th densest states. TN, MH, and KA all have lesser density. So it's not like this variable would change much even if it was used. There is multiple points that I have listed amongst them is population and geography, which gives us population density. Population density is used to rationalise the seat representation. Take extreme example like Goa has 5 lakhs person per MP, whereas UP has 25 lakhs. So regions with higher density has higher no of people representing per MP. The least successful people who kept losing every major war against invaders, purely from following caste and discarding meritocracy; and the north western merchants who sold other south asians as slaves to the world, they are back to assuming majority power again. This time it will totally be fine. We serfs totally have rights protected. We didn't lose territory to China /s *keedas Again, that is your conjecture. Let us look at the law itself, which you can find [here](https://eci.gov.in/files/file/7317-the-delimitation-act-2002/) Page 4 is the relevant page, where it says it will determine seats based on \"the census figures as ascertained at the census held in the year 1971\" The reference to geography comes later, where it says: > all constituencies shall, as far as practicable, be geographically compact areas, and in delimiting them regard shall be had to physical features, existing boundaries of administrative units, facilities of communication and public convenience Which prevents gerrymandering, but is not related to the density of the population in the area. Your Goa example is probably due more to the fact that practicality requires an integer number of seats - you cannot have one-third of an MP, for instance. And if it was based on density, as I pointed out earlier, UP and BH still come up close to the top while a number of southern states + MH come later. So even if density was considered (which it is not) it wouldn't change the outcome much. The original point that it will result in a reduction of % of southern seats still stands. Your density point is largely irrelevant to this discussion anyway. Take recent delimitation of J&K. 44% population of Jammu votes for 48% of seats, while 56% of Kasmir votes for 52% of seats. So with a population difference of 12% the seat difference is just 4%. This is done so that Jammu despite lower population gets equal representation. Today 5 states of south have 119 seats and Up+bihar 120 so difference is 1. Population is of up+Bihar is 30 cr while of south is 24 cr. Taking into account of population and representation the difference between south and thess states would not be more than 10, as opposed to 60 which is shown here. Also there is no set formula for delimitation. ECI takes into account opinion of all the stakeholder and comes up with solutions to address major concerns raised by stakeholders. Southern states have already raised this concern and ECI will surely address it. You seem to have more faith on the ECI doing the right thing even though it is not legally required to do so. I don't. Especially given that after the KA verdict, all five southern states and their concerns can easily be painted as an anti national brigade. Even with empirical evidence and proper references you still have doubts. What you need to understand is that ECI is medium, but balance in dispensation is maintained by the interlocks and seperation of powers that constitution has given to each stakeholders. In simple terms justice is delivered by the systems and processes not individuals or institute. Anyways keep believing what you believe there is no limitations to imagination and paranoia. I'll address your J&K example directly: Jammu recieved 6 more seats than they had previously. [Of those six seats, four have a Hindu majority](https://www.deccanherald.com/amp/national/north-and-central/explained-what-jk-delimitation-means-1106986.html). That sounds very convenient for the BJP. I wonder how seats would be divided when it comes to a bunch of states that are known for their anti national tendencies of voting against the BJP. > you still have doubts. Yes, because similar assurances were given during the 15th FC and the result was that southern states like Karnataka were the biggest losers. And I've given you a reference too. The act does not require the ECI to give any importance to the concerns of the southern states. That they will do so is your conjecture. So when you say > justice is delivered by the systems and processes not individuals or institute There is no defined process that says they need to do so. There is no requirement that southern states need to sign off on this. They could do delimitation entirely based on population, make a lip service remark that they considered our concerns, and they would be in line with the law. So you calling this paranoia is ridiculous, especially when you base it on one delimitation in J&K, and even that seems to *coincidentally* benefit the party that would love to reduce southern states to as few seats as possible. > Let's just let those kids suffer and die from curable diseases and suffer from poverty. What does this have to do with delimitation?"
}