{
    "id": "184umit",
    "title": "Indians are more interested in watching cricket than caring about our soldiers.",
    "url": "https://i.redd.it/no0e6se0kt2c1.png",
    "selftext": "Indian govt is more interested in earning money through india pakistan cricket match as it's highest viewers.\n\nWhy are we still interacting with Pakistan. We should isolate them in everything with zero interaction.\n\nIt's the common man of country who is not nationalist and doesn't care abt our soldiers. Their forces/ terrorist backed organisation are killing our soldiers and we are enjoying cricket.\n\nBig shame for us as we are sleeping and ignorant. All we need is entertainment. \n\nHow can we enjoy while our brothers are dying for us",
    "flair": "Crime",
    "score": 9,
    "num_comments": 6,
    "created_utc": 1701059762.0,
    "convurl": "https://i.redd.it/no0e6se0kt2c1.png",
    "comments": [
        "we live in a society",
        "Thankfully Indians have more sense than OP",
        "Ah, tumhara to naam Ashwin h 😆",
        "Unga peru enna ani pudungiya"
    ],
    "cleaned_text": "indians interested watching cricket caring soldiers indian govt interested earning money india pakistan cricket match highest viewers still interacting pakistan isolate everything zero interaction common man country nationalist doesnt care abt soldiers forces terrorist backed organisation killing soldiers enjoying cricket big shame us sleeping ignorant need entertainment enjoy brothers dying us ",
    "cleaned_title": "indians interested watching cricket caring soldiers",
    "cleaned_selftext": "indian govt interested earning money india pakistan cricket match highest viewers still interacting pakistan isolate everything zero interaction common man country nationalist doesnt care abt soldiers forces terrorist backed organisation killing soldiers enjoying cricket big shame us sleeping ignorant need entertainment enjoy brothers dying us",
    "cleaned_comments": "live society thankfully indians sense op ah tumhara naam ashwin h unga peru enna ani pudungiya",
    "light_cleaned_title": "Indians are more interested in watching cricket than caring about our soldiers.",
    "light_cleaned_selftext": "Indian govt is more interested in earning money through india pakistan cricket match as it's highest viewers. Why are we still interacting with Pakistan. We should isolate them in everything with zero interaction. It's the common man of country who is not nationalist and doesn't care abt our soldiers. Their forces/ terrorist backed organisation are killing our soldiers and we are enjoying cricket. Big shame for us as we are sleeping and ignorant. All we need is entertainment. How can we enjoy while our brothers are dying for us",
    "light_cleaned_comments": "we live in a society Thankfully Indians have more sense than OP Ah, tumhara to naam Ashwin h 😆 Unga peru enna ani pudungiya"
}