{
    "id": "15hbvfq",
    "title": "AKTU, Lucknow is imo probably the worst University in India.",
    "url": "https://www.reddit.com/r/india/comments/15hbvfq/aktu_lucknow_is_imo_probably_the_worst_university/",
    "selftext": "Just completed my 4 years of hell in a college affiliated to AKTU. It has been an absolute horrible experience. \nThere is absolutely no accountability whatsoever. They have given a mail ID and a Student Helpline Number on their Website but no one responds. I once tried calling the number everyday for 7 days multiple times a day and it just says that the line is busy. \n\nAlso, the Carry over or the Backlog system is garbage. I don't know what the Evaluators smoke while checking the answer sheets. They seem to have a Target of giving a certain number of Backlogs to charge 2500/- per Backlog. \n\nIn my personal Experience i got 3 Backlogs  in 6th semester and i applied for Reevaluation and passed in all three and in two of the Subjects my marks were increased by 18 and 26. Like sure they can be a mistake of 1-2 marks, but 20 marks ???? Seriously. Similar thing Happened to some of my friends. A friend of mine scored 16 and got a backlog he applied for a Reevaluation and his marks got increased to 53. Like how is such a big error possible. \n\nAlso the VC got changed recently as the previous VC was accused of Corruption as well as the Registrar. \n\nAlso i gave Carry over examination in January 2023 and the result hasn't been declared yet and a month ago i gave my 8th Sem examinations. If they don't declare the result i would not be able to apply for masters abroad. \n\nIn my last days of college i was sitting beside my professor for a project and he was checking some AKTU External Examination sheets while talking on a Phone and paying absolutely no attention to the Answersheet and straight up crossed 4 pages without looking at it. like this has got to be a big joke right?\n\nTL;DR: Don't even consider AKTU",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691087319.0,
    "convurl": "https://external-preview.redd.it/VIaoFjcI0IlWHYki7ZxCg-QDA71YBGvSwUVMyNElAKo.jpg?auto=webp&s=9cabc3e6a1aba7d9b21312d76d448f62e1f38f7e",
    "comments": [
        "How to file re-evaluation in aktu",
        "I'm studying in AKTU too ( 4th sem) . Taking admission in this university was my worst decision yet .",
        "Can I dm u?",
        "Yes"
    ],
    "cleaned_text": "aktu lucknow imo probably worst university india completed years hell college affiliated aktu absolute horrible experience absolutely accountability whatsoever given mail id student helpline number website one responds tried calling number everyday days multiple times day says line busy also carry backlog system garbage dont know evaluators smoke checking answer sheets seem target giving certain number backlogs charge per backlog personal experience got backlogs th semester applied reevaluation passed three two subjects marks increased like sure mistake marks marks seriously similar thing happened friends friend mine scored got backlog applied reevaluation marks got increased like big error possible also vc got changed recently previous vc accused corruption well registrar also gave carry examination january result hasnt declared yet month ago gave th sem examinations dont declare result would able apply masters abroad last days college sitting beside professor project checking aktu external examination sheets talking phone paying absolutely attention answersheet straight crossed pages without looking like got big joke right tldr dont even consider aktu ",
    "cleaned_title": "aktu lucknow imo probably worst university india",
    "cleaned_selftext": "completed years hell college affiliated aktu absolute horrible experience absolutely accountability whatsoever given mail id student helpline number website one responds tried calling number everyday days multiple times day says line busy also carry backlog system garbage dont know evaluators smoke checking answer sheets seem target giving certain number backlogs charge per backlog personal experience got backlogs th semester applied reevaluation passed three two subjects marks increased like sure mistake marks marks seriously similar thing happened friends friend mine scored got backlog applied reevaluation marks got increased like big error possible also vc got changed recently previous vc accused corruption well registrar also gave carry examination january result hasnt declared yet month ago gave th sem examinations dont declare result would able apply masters abroad last days college sitting beside professor project checking aktu external examination sheets talking phone paying absolutely attention answersheet straight crossed pages without looking like got big joke right tldr dont even consider aktu",
    "cleaned_comments": "file reevaluation aktu im studying aktu th sem taking admission university worst decision yet dm u yes",
    "light_cleaned_title": "AKTU, Lucknow is imo probably the worst University in India.",
    "light_cleaned_selftext": "Just completed my 4 years of hell in a college affiliated to AKTU. It has been an absolute horrible experience. There is absolutely no accountability whatsoever. They have given a mail ID and a Student Helpline Number on their Website but no one responds. I once tried calling the number everyday for 7 days multiple times a day and it just says that the line is busy. Also, the Carry over or the Backlog system is garbage. I don't know what the Evaluators smoke while checking the answer sheets. They seem to have a Target of giving a certain number of Backlogs to charge 2500/- per Backlog. In my personal Experience i got 3 Backlogs in 6th semester and i applied for Reevaluation and passed in all three and in two of the Subjects my marks were increased by 18 and 26. Like sure they can be a mistake of 1-2 marks, but 20 marks ???? Seriously. Similar thing Happened to some of my friends. A friend of mine scored 16 and got a backlog he applied for a Reevaluation and his marks got increased to 53. Like how is such a big error possible. Also the VC got changed recently as the previous VC was accused of Corruption as well as the Registrar. Also i gave Carry over examination in January 2023 and the result hasn't been declared yet and a month ago i gave my 8th Sem examinations. If they don't declare the result i would not be able to apply for masters abroad. In my last days of college i was sitting beside my professor for a project and he was checking some AKTU External Examination sheets while talking on a Phone and paying absolutely no attention to the Answersheet and straight up crossed 4 pages without looking at it. like this has got to be a big joke right? TL;DR: Don't even consider AKTU",
    "light_cleaned_comments": "How to file re-evaluation in aktu I'm studying in AKTU too ( 4th sem) . Taking admission in this university was my worst decision yet . Can I dm u? Yes"
}