{
    "id": "14ly2p1",
    "title": "Why is nobody talking about this ?",
    "url": "https://www.reddit.com/r/india/comments/14ly2p1/why_is_nobody_talking_about_this/",
    "selftext": "[https://www.thehindu.com/news/national/other-states/telangana-cm-cabinet-colleagues-arrive-in-pandharpur-in-motorcade-of-600-vehicles/article67013227.ece](https://www.thehindu.com/news/national/other-states/telangana-cm-cabinet-colleagues-arrive-in-pandharpur-in-motorcade-of-600-vehicles/article67013227.ece)\n\nFucking 600 motorcars, such a good waste of taxpayers money - KCR probably.\n\nSeriously guys, how is this getting so less coverage? Anybody else wondered:\n\na) Why maharashtra of all states, we are not even Telangana's neighbour\n\nb) Also why 600 cars,nobody gonna talka bout climate or even the money wasted\n\nWhat was this, an ego contest, what did it even prove/accomplish?\n\nLooking forward to my fellow brothers/sisters thoughts..",
    "flair": "Politics",
    "score": 122,
    "num_comments": 28,
    "created_utc": 1688022819.0,
    "convurl": "https://external-preview.redd.it/roz6xVmn74crk0Zwf0hSwC4nUSromixFUhNlQ36g2To.jpg?auto=webp&v=enabled&s=a86b70dceed3918a8d915ecbefb74f7820ce5217",
    "comments": [
        "BJP paid them to grab non-BJP votes from ShivSena-NCP-INC. Simple as that.",
        "\\>  Why maharashtra of all states, we are not even Telangana's neighbour\n\nhttps://preview.redd.it/cjbxcv2j4x8b1.png?width=412&format=png&auto=webp&v=enabled&s=10f6571796071b47466aec93454d24cb97b4bc32",
        "He is not getting single seat here. Don't worry. We have enough oppositions here",
        "Solapur was bordering the Hyderabad state. Mid Maharashtra was in Hyderabad state",
        "😂😂 Good one",
        "There’s a lot of self importance crap out with indian politicians"
    ],
    "cleaned_text": "nobody talking httpswwwthehinducomnewsnationalotherstatestelanganacmcabinetcolleaguesarriveinpandharpurinmotorcadeofvehiclesarticleecehttpswwwthehinducomnewsnationalotherstatestelanganacmcabinetcolleaguesarriveinpandharpurinmotorcadeofvehiclesarticleece fucking motorcars good waste taxpayers money kcr probably seriously guys getting less coverage anybody else wondered maharashtra states even telanganas neighbour b also carsnobody gon na talka bout climate even money wasted ego contest even proveaccomplish looking forward fellow brotherssisters thoughts ",
    "cleaned_title": "nobody talking",
    "cleaned_selftext": "httpswwwthehinducomnewsnationalotherstatestelanganacmcabinetcolleaguesarriveinpandharpurinmotorcadeofvehiclesarticleecehttpswwwthehinducomnewsnationalotherstatestelanganacmcabinetcolleaguesarriveinpandharpurinmotorcadeofvehiclesarticleece fucking motorcars good waste taxpayers money kcr probably seriously guys getting less coverage anybody else wondered maharashtra states even telanganas neighbour b also carsnobody gon na talka bout climate even money wasted ego contest even proveaccomplish looking forward fellow brotherssisters thoughts",
    "cleaned_comments": "bjp paid grab nonbjp votes shivsenancpinc simple maharashtra states even telanganas neighbour getting single seat dont worry enough oppositions solapur bordering hyderabad state mid maharashtra hyderabad state good one theres lot self importance crap indian politicians",
    "light_cleaned_title": "Why is nobody talking about this ?",
    "light_cleaned_selftext": "[https://www.thehindu.com/news/national/other-states/telangana-cm-cabinet-colleagues-arrive-in-pandharpur-in-motorcade-of-600-vehicles/article67013227.ece](https://www.thehindu.com/news/national/other-states/telangana-cm-cabinet-colleagues-arrive-in-pandharpur-in-motorcade-of-600-vehicles/article67013227.ece) Fucking 600 motorcars, such a good waste of taxpayers money - KCR probably. Seriously guys, how is this getting so less coverage? Anybody else wondered: a) Why maharashtra of all states, we are not even Telangana's neighbour b) Also why 600 cars,nobody gonna talka bout climate or even the money wasted What was this, an ego contest, what did it even prove/accomplish? Looking forward to my fellow brothers/sisters thoughts..",
    "light_cleaned_comments": "BJP paid them to grab non-BJP votes from ShivSena-NCP-INC. Simple as that. \\> Why maharashtra of all states, we are not even Telangana's neighbour He is not getting single seat here. Don't worry. We have enough oppositions here Solapur was bordering the Hyderabad state. Mid Maharashtra was in Hyderabad state 😂😂 Good one There’s a lot of self importance crap out with indian politicians"
}