{
    "id": "12kv9eq",
    "title": "Looking for Indian respondents",
    "url": "https://www.reddit.com/r/india/comments/12kv9eq/looking_for_indian_respondents/",
    "selftext": "Hi everyone,  \nI am working on a research project for my graduation degree. I need responses from Indian people about their payment decisions regarding hired domestic help for their households.  \n\n\nIt will take around 3-4 minutes maximum, all questions are rank-based and won't require you to type anything out. Please help me out, thank you in advance! :)\n\n https://sprw.io/stt-oTeMXhUAKb8FuSzpn1eF1S",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 3,
    "created_utc": 1681404357.0,
    "convurl": "https://external-preview.redd.it/xRL5XAmcJwPs228H618yvvHlAId6GPLS972okxUGU6Y.jpg",
    "comments": [
        "Hey, I'm lookin for respondents too...I have filled yours, it would be helpful if you filled mine too!\n\nhttps://forms.gle/XU64C35JbPQgR71C7",
        "done, thanks for helping out!"
    ],
    "cleaned_text": "looking indian respondents hi everyone working research project graduation degree need responses indian people payment decisions regarding hired domestic help households take around minutes maximum questions rankbased wont require type anything please help thank advance ",
    "cleaned_title": "looking indian respondents",
    "cleaned_selftext": "hi everyone working research project graduation degree need responses indian people payment decisions regarding hired domestic help households take around minutes maximum questions rankbased wont require type anything please help thank advance",
    "cleaned_comments": "hey im lookin respondents tooi filled would helpful filled mine done thanks helping",
    "light_cleaned_title": "Looking for Indian respondents",
    "light_cleaned_selftext": "Hi everyone, I am working on a research project for my graduation degree. I need responses from Indian people about their payment decisions regarding hired domestic help for their households. It will take around 3-4 minutes maximum, all questions are rank-based and won't require you to type anything out. Please help me out, thank you in advance! :)",
    "light_cleaned_comments": "Hey, I'm lookin for respondents too...I have filled yours, it would be helpful if you filled mine too! done, thanks for helping out!"
}