{
    "id": "14s134a",
    "title": "Very weird YouTube Homepage suggestions!",
    "url": "https://www.reddit.com/r/india/comments/14s134a/very_weird_youtube_homepage_suggestions/",
    "selftext": "Basically, lately I am being suggested pro pakistani channels and some urdu channels on my youtube homepage. What's weird is that I don't watch any videos like that or support pakistan. In fact I don't even understand urdu. So why is this happening. My search and watch history is exactly opposite, I watch all pro India and pro Russia channels. And for news I watch Hindustan Times, WION, and FirstPost. So it is really weird for youtube to suggest these channels. Even if I tell youtube that I am not interested in these videos I still get the recommendations of the same type of videos. Is my google account hacked? Should I be worried?  \n\n\nHere is an example:-  \n\n\nhttps://preview.redd.it/nmzay7wdnaab1.png?width=421&format=png&auto=webp&s=07766a689c9c60274a7c4d38b1ff570a21d8628b",
    "flair": "AskIndia",
    "score": 5,
    "num_comments": 9,
    "created_utc": 1688627193.0,
    "convurl": "https://b.thumbs.redditmedia.com/mRiGe-Y-5Zuv75XoAiHBo0vsLMvjXi-vXAzKdgcvsrY.jpg",
    "comments": [
        "It could be just because you see news channels. I don't see any out there so get recommendations based on my likes or channels subscribed.\n\nThere's a good chance you could've mistakenly clicked on a video on a website which then took it as a subject of interest to you.",
        "Wow bro, insecure much? Just the mention of Pakistan triggers you so much? Seriously, just ignore and move on with your life",
        "I'd be (and anyone should be) concerned if I see some shit like this getting recommended to them.",
        "Hoodhboy is one of the biggest critics of the Pakistani state and state enforcement of religion. \n\n\" And for news I watch Hindustan Times, WION, and FirstPost. \" yeah I already got that you were a BJP-bot but there's no need to out yourself.",
        "Try watching the video maybe. How your country is actually doing well will be the biggest mystery for me I swear.",
        "What's the mystery in that? All the shit that happens here is a tiny miniscule amount of how everything else just works, even if its in a half broken state.",
        "Fair enough. Would really suggest watching the video anyway, Hoodhboy is very level headed thinker (if albeit slightly neoliberal sometimes) and I don't get why he's getting treated like the boogeyman just because he's from PK."
    ],
    "cleaned_text": "weird youtube homepage suggestions basically lately suggested pro pakistani channels urdu channels youtube homepage whats weird dont watch videos like support pakistan fact dont even understand urdu happening search watch history exactly opposite watch pro india pro russia channels news watch hindustan times wion firstpost really weird youtube suggest channels even tell youtube interested videos still get recommendations type videos google account hacked worried example ",
    "cleaned_title": "weird youtube homepage suggestions",
    "cleaned_selftext": "basically lately suggested pro pakistani channels urdu channels youtube homepage whats weird dont watch videos like support pakistan fact dont even understand urdu happening search watch history exactly opposite watch pro india pro russia channels news watch hindustan times wion firstpost really weird youtube suggest channels even tell youtube interested videos still get recommendations type videos google account hacked worried example",
    "cleaned_comments": "could see news channels dont see get recommendations based likes channels subscribed theres good chance couldve mistakenly clicked video website took subject interest wow bro insecure much mention pakistan triggers much seriously ignore move life id anyone concerned see shit like getting recommended hoodhboy one biggest critics pakistani state state enforcement religion news watch hindustan times wion firstpost yeah already got bjpbot theres need try watching video maybe country actually well biggest mystery swear whats mystery shit happens tiny miniscule amount everything else works even half broken state fair enough would really suggest watching video anyway hoodhboy level headed thinker albeit slightly neoliberal sometimes dont get hes getting treated like boogeyman hes pk",
    "light_cleaned_title": "Very weird YouTube Homepage suggestions!",
    "light_cleaned_selftext": "Basically, lately I am being suggested pro pakistani channels and some urdu channels on my youtube homepage. What's weird is that I don't watch any videos like that or support pakistan. In fact I don't even understand urdu. So why is this happening. My search and watch history is exactly opposite, I watch all pro India and pro Russia channels. And for news I watch Hindustan Times, WION, and FirstPost. So it is really weird for youtube to suggest these channels. Even if I tell youtube that I am not interested in these videos I still get the recommendations of the same type of videos. Is my google account hacked? Should I be worried? Here is an example:-",
    "light_cleaned_comments": "It could be just because you see news channels. I don't see any out there so get recommendations based on my likes or channels subscribed. There's a good chance you could've mistakenly clicked on a video on a website which then took it as a subject of interest to you. Wow bro, insecure much? Just the mention of Pakistan triggers you so much? Seriously, just ignore and move on with your life I'd be (and anyone should be) concerned if I see some shit like this getting recommended to them. Hoodhboy is one of the biggest critics of the Pakistani state and state enforcement of religion. \" And for news I watch Hindustan Times, WION, and FirstPost. \" yeah I already got that you were a BJP-bot but there's no need to out yourself. Try watching the video maybe. How your country is actually doing well will be the biggest mystery for me I swear. What's the mystery in that? All the shit that happens here is a tiny miniscule amount of how everything else just works, even if its in a half broken state. Fair enough. Would really suggest watching the video anyway, Hoodhboy is very level headed thinker (if albeit slightly neoliberal sometimes) and I don't get why he's getting treated like the boogeyman just because he's from PK."
}