{
    "id": "1990rkx",
    "title": "I am sick of this mentality.",
    "url": "https://www.reddit.com/gallery/1990rkx",
    "selftext": "Context : girls dancing, having fun. \nWhy do we do this? Why do we sexualise our own women as though they are our property and things like these so casual? They’re just extremely pretty women. This isn’t the first time. I’ve seen so many videos where people go “Blue /black/pink waali Meri” what are we teaching the younger generation as well, honestly? This mindset is extremely concerning. I love dark humour but there is a clear distinction that these men cannot see.",
    "flair": "Rant / Vent",
    "score": 9,
    "num_comments": 5,
    "created_utc": 1705509186.0,
    "convurl": "https://i.redd.it/e64qbf0g21dc1.jpg",
    "comments": [
        "chahe gori ho ya kali ho...",
        "https://preview.redd.it/4fh243su81dc1.png?width=512&format=pjpg&auto=webp&s=b041e440ae794355e6015aec10bddfd1a277c0f9",
        "younger generation? This is how boys talk OP. What's so offending to you about this?\n\ntumne kabhi shadi mein boys check out nhi kare? Women talk like this all the time when they're in their group/gang.\n\nEither you want ki Sara time har koi office level ka formal communication rakhe ya fir they did something offensive after this, only then its offensive. Otherwise there's zilch wrong in this \"mentality\"."
    ],
    "cleaned_text": "sick mentality context girls dancing fun sexualise women though property things like casual theyre extremely pretty women isnt first time ive seen many videos people go blue blackpink waali meri teaching younger generation well honestly mindset extremely concerning love dark humour clear distinction men see ",
    "cleaned_title": "sick mentality",
    "cleaned_selftext": "context girls dancing fun sexualise women though property things like casual theyre extremely pretty women isnt first time ive seen many videos people go blue blackpink waali meri teaching younger generation well honestly mindset extremely concerning love dark humour clear distinction men see",
    "cleaned_comments": "chahe gori ho ya kali ho younger generation boys talk op whats offending tumne kabhi shadi mein boys check nhi kare women talk like time theyre groupgang either want ki sara time har koi office level ka formal communication rakhe ya fir something offensive offensive otherwise theres zilch wrong mentality",
    "light_cleaned_title": "I am sick of this mentality.",
    "light_cleaned_selftext": "Context : girls dancing, having fun. Why do we do this? Why do we sexualise our own women as though they are our property and things like these so casual? They’re just extremely pretty women. This isn’t the first time. I’ve seen so many videos where people go “Blue /black/pink waali Meri” what are we teaching the younger generation as well, honestly? This mindset is extremely concerning. I love dark humour but there is a clear distinction that these men cannot see.",
    "light_cleaned_comments": "chahe gori ho ya kali ho... younger generation? This is how boys talk OP. What's so offending to you about this? tumne kabhi shadi mein boys check out nhi kare? Women talk like this all the time when they're in their group/gang. Either you want ki Sara time har koi office level ka formal communication rakhe ya fir they did something offensive after this, only then its offensive. Otherwise there's zilch wrong in this \"mentality\"."
}