{
    "id": "nmmp9v",
    "title": "Bi-Weekly Food and Recipes Thread",
    "url": "https://www.reddit.com/r/india/comments/nmmp9v/biweekly_food_and_recipes_thread/",
    "selftext": "Foodies of r/India! Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nFeel free to share recipes, and if you tried out something new, you can also share pictures!\n\n**The Food Thread is posted every two weeks on Friday mornings.**\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=899972afbc4bab665798a0f5917960a98ec4f4d5",
    "flair": "Scheduled",
    "score": 22,
    "num_comments": 9,
    "created_utc": 1622165414,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        "Does anyone have a good no-machine gelato recipe?    \nI've been able to make icecream successfully but  gelato has been a nightmare.",
        "Does anyone even like Paneer Bhurji ? Maybe I dont know how to make one. Any guidance.",
        "The recipe I use goes like this\n\n**Ingredients**  \n1 Small Onion finely chopped  \n3 Cloves of Garlic finely chopped  \nRed Chilli Powder  \nTurmeric Powder  \n1 bunch Coriander Leaves  \n2 tsp Cumin Seeds  \n1 tsp Hing / Asafoetida  \n1 small tomato - finely chopped  \n3 finely chopped green chillies  \n1 tbsp Oil  \nApprox 500 gms Paneer - Don't remember the quantity as I just put it according to taste\n\n**Method**\n\n1. Heat oil in pan\n2. Saute Onions till translucent\n3. Add garlic and continue to fry till golden\n4. Add in hing and cumin seeds on the side and wait cumin seeds crackle\n5. Add finely chopped green chillis\n6. Add in finely chopped tomatoes and saute till oil separates\n7. Lower heat and add in red chilli powder and turmeric\n8. Once heated through crumble paneer into pan\n9. Cook for 5-7 minutes\n10. Add salt according to taste\n11. Finally add coriander leaves\n\nDone :)",
        "I'll definitely do this.",
        "https://youtu.be/MUzjIceBV70 is also an easy recipe",
        "Can you share your icecream recipe?",
        "Sure.    \nMade with 2 bowls:    \nhttps://www.youtube.com/watch?v=p-SikBqk2PM    \n    \nMade with a pan, spoon and freezer:    \nhttps://www.youtube.com/watch?v=O7sQBfpQCvU    \n    \nI'd really suggest aiming for flavours that are uncommon (like coffee or chocolate mint) since making batches at home aren't entirely cost effective.",
        "I thought it'd be cheaper than store-bought icecream, aw man :("
    ],
    "cleaned_text": "biweekly food recipes thread foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings ",
    "cleaned_title": "biweekly food recipes thread",
    "cleaned_selftext": "foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings",
    "cleaned_comments": "anyone good nomachine gelato recipe ive able make icecream successfully gelato nightmare anyone even like paneer bhurji maybe dont know make one guidance recipe use goes like ingredients small onion finely chopped cloves garlic finely chopped red chilli powder turmeric powder bunch coriander leaves tsp cumin seeds tsp hing asafoetida small tomato finely chopped finely chopped green chillies tbsp oil approx gms paneer dont remember quantity put according taste method heat oil pan saute onions till translucent add garlic continue fry till golden add hing cumin seeds side wait cumin seeds crackle add finely chopped green chillis add finely chopped tomatoes saute till oil separates lower heat add red chilli powder turmeric heated crumble paneer pan cook minutes add salt according taste finally add coriander leaves done ill definitely also easy recipe share icecream recipe sure made bowls made pan spoon freezer id really suggest aiming flavours uncommon like coffee chocolate mint since making batches home arent entirely cost effective thought itd cheaper storebought icecream aw man",
    "light_cleaned_title": "Bi-Weekly Food and Recipes Thread",
    "light_cleaned_selftext": "Foodies of r/India! Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Feel free to share recipes, and if you tried out something new, you can also share pictures! **The Food Thread is posted every two weeks on Friday mornings.**",
    "light_cleaned_comments": "Does anyone have a good no-machine gelato recipe? I've been able to make icecream successfully but gelato has been a nightmare. Does anyone even like Paneer Bhurji ? Maybe I dont know how to make one. Any guidance. The recipe I use goes like this **Ingredients** 1 Small Onion finely chopped 3 Cloves of Garlic finely chopped Red Chilli Powder Turmeric Powder 1 bunch Coriander Leaves 2 tsp Cumin Seeds 1 tsp Hing / Asafoetida 1 small tomato - finely chopped 3 finely chopped green chillies 1 tbsp Oil Approx 500 gms Paneer - Don't remember the quantity as I just put it according to taste **Method** 1. Heat oil in pan 2. Saute Onions till translucent 3. Add garlic and continue to fry till golden 4. Add in hing and cumin seeds on the side and wait cumin seeds crackle 5. Add finely chopped green chillis 6. Add in finely chopped tomatoes and saute till oil separates 7. Lower heat and add in red chilli powder and turmeric 8. Once heated through crumble paneer into pan 9. Cook for 5-7 minutes 10. Add salt according to taste 11. Finally add coriander leaves Done :) I'll definitely do this. is also an easy recipe Can you share your icecream recipe? Sure. Made with 2 bowls: Made with a pan, spoon and freezer: I'd really suggest aiming for flavours that are uncommon (like coffee or chocolate mint) since making batches at home aren't entirely cost effective. I thought it'd be cheaper than store-bought icecream, aw man :("
}