{
    "id": "1bzjrtj",
    "title": "Press Release: Civil society organisations express urgent concerns over the integrity of the 2024 general elections to the Lok Sabha | Internet Freedom Foundation",
    "url": "https://www.reddit.com/r/india/comments/1bzjrtj/press_release_civil_society_organisations_express/",
    "selftext": "&#x200B;\n\n[https:\\/\\/internetfreedom.in\\/civil-society-writes-to-eci-on-2024-elections\\/](https://preview.redd.it/mave4qozwdtc1.jpg?width=1600&format=pjpg&auto=webp&s=bb12008ef6bf6dd902ecf7b34cd6bb2ea62efeb8)\n\n \n\nNew Delhi, April 08, 2024: Earlier today, 11 civil society organisations [wrote](https://drive.google.com/file/d/1svYMfe5KclydjdLaCP9fRGH34fjuKjme/view?usp=sharing&ref=static.internetfreedom.in) to  the Election Commission of India (“ECI”) in a collaborative effort,  highlighting the role of technology in affecting electoral processes and  outcomes. The letter includes an urgent appeal to the ECI to uphold the  integrity of the upcoming elections and hold political parties,  candidates, and digital platforms accountable to the voters. \n\nThe signatories to the letter are [Article 21 Trust](https://www.article21trust.org/?ref=static.internetfreedom.in), [Association for Democratic Reforms](https://adrindia.org/?ref=static.internetfreedom.in), [Campaign Against Hate Speech](https://hatespeechbeda.wordpress.com/?ref=static.internetfreedom.in), [Common Cause](https://www.commoncause.in/?ref=static.internetfreedom.in), [Internet Freedom Foundation](https://internetfreedom.in/?ref=static.internetfreedom.in), [LibTech India](https://libtech.in/?ref=static.internetfreedom.in), [Maadhyam](https://linktr.ee/Maadhyam?ref=static.internetfreedom.in), [Mazdoor Kisan Shakti Sangathan](https://mkssindia.org/?ref=static.internetfreedom.in), [National Alliance of People's Movements](https://napmindia.wordpress.com/?ref=static.internetfreedom.in), [Rajasthan Asangathit Mazdoor Union](https://www.ramuindia.org/?ref=static.internetfreedom.in), and [Software Freedom Law Center, India](https://sflc.in/?ref=static.internetfreedom.in). \n\nFollowing are the concerns and appeals outlined in the joint letter:\n\n1. **Online campaigning and surrogate advertisements**:  Expenditure on surrogate advertising and targeted online campaigns by  political actors to influence voter perception and beliefs are not under  adequate scrutiny. The ECI must increase the accountability of  political parties and digital platforms by adopting internationally  acceptable, rights-respecting standards for regulating political  expenditure on online ads and targeted campaigning. \n2. **Use of emerging technologies such as deepfakes**:  The use of generative AI technology (particularly deepfakes) by  political actors with the intent to influence voter perception and  impact electoral outcomes raises urgent concerns. The ECI must introduce  measures to increase the accountability of political actors who deploy  generative AI with the intent of influencing voter perceptions and  political narratives.\n3. **Inadequacies of the Voluntary  Code of Conduct:** The  Voluntary Code of Conduct is non-binding, has no legal force, and was  drafted without any transparency and input from civil society. Lower  standards are applied to digital platforms in India as compared to other  jurisdictions, there is no monitoring of platforms’ compliance, and  there is a lack of redressal for voters in case of non-compliance. The  ECI should initiate a transparent and participatory process spearheaded  by a third-party, independent organisation(s) to arrive at a Model Code  of Conduct (“MCC”) to be followed by political candidates and digital  platforms - with clear enforcement guidelines and reporting mechanisms.\n4. **Voter surveillance:** The  use of facial recognition and video surveillance technology at polling  booths can deter the right to vote without fear or coercion, may violate  the right to privacy, and is antithetical to a free and fair election.  The ECI should initiate a careful reevaluation of the implementation of  surveillance technologies in electoral processes and assess it against  strict standards of legality, necessity and proportionality.\n\n**###**\n\nRegards,\n\n1. Article 21 Trust\n2. Association for Democratic Reforms\n3. Campaign Against Hate Speech\n4. Common Cause\n5. Internet Freedom Foundation\n6. LibTech India\n7. Maadhyam\n8. Mazdoor Kisan Shakti Sangathan\n9. National Alliance of People's Movements\n10. Rajasthan Asangathit Mazdoor Union \n11. Software Freedom Law Center, India\n\n&#x200B;\n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 28,
    "num_comments": 1,
    "created_utc": 1712638384.0,
    "convurl": "https://b.thumbs.redditmedia.com/imwHznpCL8d-jPZL8S2QNREDlw5aqnDC8xEFm-5bxFA.jpg",
    "comments": [
        "[Will India’s Election Commission Provide All Parties a Level Playing Field?](https://thediplomat.com/2024/03/will-indias-election-commission-provide-all-parties-a-level-playing-field/)    \n\n> “The election commission has a critical job – to be a fair referee between different parties during elections. But at present, the strongest player – the ruling party – appoints the referee. This is obviously a conflict of interest,” Shoaib Daniyal, political editor at the Scroll news portal, told The Diplomat.    \n\nBut wiil the ECI be unbiased?   \n\n> For over six years now, the credibility of the ECI has taken a beating, as opposition parties and civil society personalities have often accused the body of showing biases in favor of Modi’s BJP. Complaints against Modi or other top leaders of the BJP lodged by opposition parties with the ECI were not acted upon with the same promptness and seriousness as the commission showed while acting on complaints lodged by the ruling party."
    ],
    "cleaned_text": "press release civil society organisations express urgent concerns integrity general elections lok sabha internet freedom foundation xb httpsinternetfreedomincivilsocietywritestoecionelectionshttpspreviewredditmaveqozwdtcjpgwidthformatpjpgautowebpsbbefbfddecfbcdbbeaefeb new delhi april earlier today civil society organisations wrotehttpsdrivegooglecomfiledsvymfekclydjdlacpfrghfjukjmeviewuspsharingrefstaticinternetfreedomin election commission india eci collaborative effort highlighting role technology affecting electoral processes outcomes letter includes urgent appeal eci uphold integrity upcoming elections hold political parties candidates digital platforms accountable voters signatories letter article trusthttpswwwarticletrustorgrefstaticinternetfreedomin association democratic reformshttpsadrindiaorgrefstaticinternetfreedomin campaign hate speechhttpshatespeechbedawordpresscomrefstaticinternetfreedomin common causehttpswwwcommoncauseinrefstaticinternetfreedomin internet freedom foundationhttpsinternetfreedominrefstaticinternetfreedomin libtech indiahttpslibtechinrefstaticinternetfreedomin maadhyamhttpslinktreemaadhyamrefstaticinternetfreedomin mazdoor kisan shakti sangathanhttpsmkssindiaorgrefstaticinternetfreedomin national alliance peoples movementshttpsnapmindiawordpresscomrefstaticinternetfreedomin rajasthan asangathit mazdoor unionhttpswwwramuindiaorgrefstaticinternetfreedomin software freedom law center indiahttpssflcinrefstaticinternetfreedomin following concerns appeals outlined joint letter online campaigning surrogate advertisements expenditure surrogate advertising targeted online campaigns political actors influence voter perception beliefs adequate scrutiny eci must increase accountability political parties digital platforms adopting internationally acceptable rightsrespecting standards regulating political expenditure online ads targeted campaigning use emerging technologies deepfakes use generative ai technology particularly deepfakes political actors intent influence voter perception impact electoral outcomes raises urgent concerns eci must introduce measures increase accountability political actors deploy generative ai intent influencing voter perceptions political narratives inadequacies voluntary code conduct voluntary code conduct nonbinding legal force drafted without transparency input civil society lower standards applied digital platforms india compared jurisdictions monitoring platforms compliance lack redressal voters case noncompliance eci initiate transparent participatory process spearheaded thirdparty independent organisations arrive model code conduct mcc followed political candidates digital platforms clear enforcement guidelines reporting mechanisms voter surveillance use facial recognition video surveillance technology polling booths deter right vote without fear coercion may violate right privacy antithetical free fair election eci initiate careful reevaluation implementation surveillance technologies electoral processes assess strict standards legality necessity proportionality regards article trust association democratic reforms campaign hate speech common cause internet freedom foundation libtech india maadhyam mazdoor kisan shakti sangathan national alliance peoples movements rajasthan asangathit mazdoor union software freedom law center india xb xb ",
    "cleaned_title": "press release civil society organisations express urgent concerns integrity general elections lok sabha internet freedom foundation",
    "cleaned_selftext": "xb httpsinternetfreedomincivilsocietywritestoecionelectionshttpspreviewredditmaveqozwdtcjpgwidthformatpjpgautowebpsbbefbfddecfbcdbbeaefeb new delhi april earlier today civil society organisations wrotehttpsdrivegooglecomfiledsvymfekclydjdlacpfrghfjukjmeviewuspsharingrefstaticinternetfreedomin election commission india eci collaborative effort highlighting role technology affecting electoral processes outcomes letter includes urgent appeal eci uphold integrity upcoming elections hold political parties candidates digital platforms accountable voters signatories letter article trusthttpswwwarticletrustorgrefstaticinternetfreedomin association democratic reformshttpsadrindiaorgrefstaticinternetfreedomin campaign hate speechhttpshatespeechbedawordpresscomrefstaticinternetfreedomin common causehttpswwwcommoncauseinrefstaticinternetfreedomin internet freedom foundationhttpsinternetfreedominrefstaticinternetfreedomin libtech indiahttpslibtechinrefstaticinternetfreedomin maadhyamhttpslinktreemaadhyamrefstaticinternetfreedomin mazdoor kisan shakti sangathanhttpsmkssindiaorgrefstaticinternetfreedomin national alliance peoples movementshttpsnapmindiawordpresscomrefstaticinternetfreedomin rajasthan asangathit mazdoor unionhttpswwwramuindiaorgrefstaticinternetfreedomin software freedom law center indiahttpssflcinrefstaticinternetfreedomin following concerns appeals outlined joint letter online campaigning surrogate advertisements expenditure surrogate advertising targeted online campaigns political actors influence voter perception beliefs adequate scrutiny eci must increase accountability political parties digital platforms adopting internationally acceptable rightsrespecting standards regulating political expenditure online ads targeted campaigning use emerging technologies deepfakes use generative ai technology particularly deepfakes political actors intent influence voter perception impact electoral outcomes raises urgent concerns eci must introduce measures increase accountability political actors deploy generative ai intent influencing voter perceptions political narratives inadequacies voluntary code conduct voluntary code conduct nonbinding legal force drafted without transparency input civil society lower standards applied digital platforms india compared jurisdictions monitoring platforms compliance lack redressal voters case noncompliance eci initiate transparent participatory process spearheaded thirdparty independent organisations arrive model code conduct mcc followed political candidates digital platforms clear enforcement guidelines reporting mechanisms voter surveillance use facial recognition video surveillance technology polling booths deter right vote without fear coercion may violate right privacy antithetical free fair election eci initiate careful reevaluation implementation surveillance technologies electoral processes assess strict standards legality necessity proportionality regards article trust association democratic reforms campaign hate speech common cause internet freedom foundation libtech india maadhyam mazdoor kisan shakti sangathan national alliance peoples movements rajasthan asangathit mazdoor union software freedom law center india xb xb",
    "cleaned_comments": "indias election commission provide parties level playing fieldhttpsthediplomatcomwillindiaselectioncommissionprovideallpartiesalevelplayingfield election commission critical job fair referee different parties elections present strongest player ruling party appoints referee obviously conflict interest shoaib daniyal political editor scroll news portal told diplomat wiil eci unbiased six years credibility eci taken beating opposition parties civil society personalities often accused body showing biases favor modis bjp complaints modi top leaders bjp lodged opposition parties eci acted upon promptness seriousness commission showed acting complaints lodged ruling party",
    "light_cleaned_title": "Press Release: Civil society organisations express urgent concerns over the integrity of the 2024 general elections to the Lok Sabha | Internet Freedom Foundation",
    "light_cleaned_selftext": "&#x200B; [https:\\/\\/internetfreedom.in\\/civil-society-writes-to-eci-on-2024-elections\\/](https://preview.redd.it/mave4qozwdtc1.jpg?width=1600&format=pjpg&auto=webp&s=bb12008ef6bf6dd902ecf7b34cd6bb2ea62efeb8) New Delhi, April 08, 2024: Earlier today, 11 civil society organisations [wrote](https://drive.google.com/file/d/1svYMfe5KclydjdLaCP9fRGH34fjuKjme/view?usp=sharing&ref=static.internetfreedom.in) to the Election Commission of India (“ECI”) in a collaborative effort, highlighting the role of technology in affecting electoral processes and outcomes. The letter includes an urgent appeal to the ECI to uphold the integrity of the upcoming elections and hold political parties, candidates, and digital platforms accountable to the voters. The signatories to the letter are [Article 21 Trust](https://www.article21trust.org/?ref=static.internetfreedom.in), [Association for Democratic Reforms](https://adrindia.org/?ref=static.internetfreedom.in), [Campaign Against Hate Speech](https://hatespeechbeda.wordpress.com/?ref=static.internetfreedom.in), [Common Cause](https://www.commoncause.in/?ref=static.internetfreedom.in), [Internet Freedom Foundation](https://internetfreedom.in/?ref=static.internetfreedom.in), [LibTech India](https://libtech.in/?ref=static.internetfreedom.in), [Maadhyam](https://linktr.ee/Maadhyam?ref=static.internetfreedom.in), [Mazdoor Kisan Shakti Sangathan](https://mkssindia.org/?ref=static.internetfreedom.in), [National Alliance of People's Movements](https://napmindia.wordpress.com/?ref=static.internetfreedom.in), [Rajasthan Asangathit Mazdoor Union](https://www.ramuindia.org/?ref=static.internetfreedom.in), and [Software Freedom Law Center, India](https://sflc.in/?ref=static.internetfreedom.in). Following are the concerns and appeals outlined in the joint letter: 1. **Online campaigning and surrogate advertisements**: Expenditure on surrogate advertising and targeted online campaigns by political actors to influence voter perception and beliefs are not under adequate scrutiny. The ECI must increase the accountability of political parties and digital platforms by adopting internationally acceptable, rights-respecting standards for regulating political expenditure on online ads and targeted campaigning. 2. **Use of emerging technologies such as deepfakes**: The use of generative AI technology (particularly deepfakes) by political actors with the intent to influence voter perception and impact electoral outcomes raises urgent concerns. The ECI must introduce measures to increase the accountability of political actors who deploy generative AI with the intent of influencing voter perceptions and political narratives. 3. **Inadequacies of the Voluntary Code of Conduct:** The Voluntary Code of Conduct is non-binding, has no legal force, and was drafted without any transparency and input from civil society. Lower standards are applied to digital platforms in India as compared to other jurisdictions, there is no monitoring of platforms’ compliance, and there is a lack of redressal for voters in case of non-compliance. The ECI should initiate a transparent and participatory process spearheaded by a third-party, independent organisation(s) to arrive at a Model Code of Conduct (“MCC”) to be followed by political candidates and digital platforms - with clear enforcement guidelines and reporting mechanisms. 4. **Voter surveillance:** The use of facial recognition and video surveillance technology at polling booths can deter the right to vote without fear or coercion, may violate the right to privacy, and is antithetical to a free and fair election. The ECI should initiate a careful reevaluation of the implementation of surveillance technologies in electoral processes and assess it against strict standards of legality, necessity and proportionality. **###** Regards, 1. Article 21 Trust 2. Association for Democratic Reforms 3. Campaign Against Hate Speech 4. Common Cause 5. Internet Freedom Foundation 6. LibTech India 7. Maadhyam 8. Mazdoor Kisan Shakti Sangathan 9. National Alliance of People's Movements 10. Rajasthan Asangathit Mazdoor Union 11. Software Freedom Law Center, India &#x200B; &#x200B;",
    "light_cleaned_comments": "[Will India’s Election Commission Provide All Parties a Level Playing Field?](https://thediplomat.com/2024/03/will-indias-election-commission-provide-all-parties-a-level-playing-field/) > “The election commission has a critical job – to be a fair referee between different parties during elections. But at present, the strongest player – the ruling party – appoints the referee. This is obviously a conflict of interest,” Shoaib Daniyal, political editor at the Scroll news portal, told The Diplomat. But wiil the ECI be unbiased? > For over six years now, the credibility of the ECI has taken a beating, as opposition parties and civil society personalities have often accused the body of showing biases in favor of Modi’s BJP. Complaints against Modi or other top leaders of the BJP lodged by opposition parties with the ECI were not acted upon with the same promptness and seriousness as the commission showed while acting on complaints lodged by the ruling party."
}