{
    "id": "15gacof",
    "title": "Nuh Clashes Well-Coordinated, More Such Violence Likely Ahead of 2024 Polls: Satyapal Malik",
    "url": "https://www.reddit.com/r/india/comments/15gacof/nuh_clashes_wellcoordinated_more_such_violence/",
    "selftext": "He made some worrying predictions   \n\\- Increased communal pogroms  \n\\- Chance of an attack on ayodhya temple to instigate communal riots  \n\\- A Pulvama II  \n\\- Chance of a BJP mla or minister getting killed  \n\\-  He makes an accusation that Ajith doval visiting UAE frequently is to  put pressure on pakistan to not retaliate its soldiers when indian army  attacks on pak occupied kasmir . this means an attack will be orchestrated  just before the elections...  \n[https://thewire.in/politics/nuh-clashes-well-coordinated-more-such-violence-likely-ahead-of-2024-polls-satyapal-malik](https://thewire.in/politics/nuh-clashes-well-coordinated-more-such-violence-likely-ahead-of-2024-polls-satyapal-malik)  \n",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690986431.0,
    "convurl": "https://external-preview.redd.it/DF4zP1hn2gWDkP20_nQcj6ZDBOwNWapFtJoI2byOkS8.jpg?auto=webp&s=d1c21cd53a93e6905ae6d1e349a003689e85242d",
    "comments": [
        "With China sitting at the Eastern front, India will not make any move in the Western side. We just can't afford fighting on 2 fronts, no matter what CDS Gen. Bipin Rawat said when he was alive. \n\nCommunal riots are the most viable option for the BJP.",
        "Both the Pakistani army and the Modi government have something to gain by India attacking POK, and also him coming back to power. So, I would say that's very likely. \n\nUnless this gets mass traction in Pakistan and they have to deny before it happens."
    ],
    "cleaned_text": "nuh clashes wellcoordinated violence likely ahead polls satyapal malik made worrying predictions increased communal pogroms chance attack ayodhya temple instigate communal riots pulvama ii chance bjp mla minister getting killed makes accusation ajith doval visiting uae frequently put pressure pakistan retaliate soldiers indian army attacks pak occupied kasmir means attack orchestrated elections httpsthewireinpoliticsnuhclasheswellcoordinatedmoresuchviolencelikelyaheadofpollssatyapalmalikhttpsthewireinpoliticsnuhclasheswellcoordinatedmoresuchviolencelikelyaheadofpollssatyapalmalik ",
    "cleaned_title": "nuh clashes wellcoordinated violence likely ahead polls satyapal malik",
    "cleaned_selftext": "made worrying predictions increased communal pogroms chance attack ayodhya temple instigate communal riots pulvama ii chance bjp mla minister getting killed makes accusation ajith doval visiting uae frequently put pressure pakistan retaliate soldiers indian army attacks pak occupied kasmir means attack orchestrated elections httpsthewireinpoliticsnuhclasheswellcoordinatedmoresuchviolencelikelyaheadofpollssatyapalmalikhttpsthewireinpoliticsnuhclasheswellcoordinatedmoresuchviolencelikelyaheadofpollssatyapalmalik",
    "cleaned_comments": "china sitting eastern front india make move western side cant afford fighting fronts matter cds gen bipin rawat said alive communal riots viable option bjp pakistani army modi government something gain india attacking pok also coming back power would say thats likely unless gets mass traction pakistan deny happens",
    "light_cleaned_title": "Nuh Clashes Well-Coordinated, More Such Violence Likely Ahead of 2024 Polls: Satyapal Malik",
    "light_cleaned_selftext": "He made some worrying predictions \\- Increased communal pogroms \\- Chance of an attack on ayodhya temple to instigate communal riots \\- A Pulvama II \\- Chance of a BJP mla or minister getting killed \\- He makes an accusation that Ajith doval visiting UAE frequently is to put pressure on pakistan to not retaliate its soldiers when indian army attacks on pak occupied kasmir . this means an attack will be orchestrated just before the elections... [https://thewire.in/politics/nuh-clashes-well-coordinated-more-such-violence-likely-ahead-of-2024-polls-satyapal-malik](https://thewire.in/politics/nuh-clashes-well-coordinated-more-such-violence-likely-ahead-of-2024-polls-satyapal-malik)",
    "light_cleaned_comments": "With China sitting at the Eastern front, India will not make any move in the Western side. We just can't afford fighting on 2 fronts, no matter what CDS Gen. Bipin Rawat said when he was alive. Communal riots are the most viable option for the BJP. Both the Pakistani army and the Modi government have something to gain by India attacking POK, and also him coming back to power. So, I would say that's very likely. Unless this gets mass traction in Pakistan and they have to deny before it happens."
}