{
    "id": "pkntir",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/pkntir/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 10,
    "num_comments": 4,
    "created_utc": 1631151017,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "We are Hiring  \n1. [ServiceNow](https://www.servicenow.com/) \\- It's a listed **product** company on [NYSE](https://finance.yahoo.com/quote/NOW/) working in the enterprise space.   \n2. Location - Hyderabad/Bengaluru  \n3. Role - Senior/Staff UX Designer (5+ years of experience)  \n4. You can message me for details",
        "if someone is associated with a staffing firm, can he/she post the requirements ?",
        "Question. \n\nMy sister is a MSc student and a major project of her requires her to have internship experience. \nSo, she contacted some IIT/IISC (Apparantly I don't remember) for any available internships. \n\nThose institute folks responded positively, but the internship is \"reversed\", which means my sister has to pay Rs. 30,000 for an onsite internship, travelling and staying charges, do free work for them, all this for just an internship experience for a project. \n\nIs this shit even legal?",
        "That's possibly a scam.\n\nGovt institutions don't ask for money."
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "hiring servicenowhttpswwwservicenowcom listed product company nysehttpsfinanceyahoocomquotenow working enterprise space location hyderabadbengaluru role seniorstaff ux designer years experience message details someone associated staffing firm heshe post requirements question sister msc student major project requires internship experience contacted iitiisc apparantly dont remember available internships institute folks responded positively internship reversed means sister pay rs onsite internship travelling staying charges free work internship experience project shit even legal thats possibly scam govt institutions dont ask money",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "We are Hiring 1. [ServiceNow](https://www.servicenow.com/) \\- It's a listed **product** company on [NYSE](https://finance.yahoo.com/quote/NOW/) working in the enterprise space. 2. Location - Hyderabad/Bengaluru 3. Role - Senior/Staff UX Designer (5+ years of experience) 4. You can message me for details if someone is associated with a staffing firm, can he/she post the requirements ? Question. My sister is a MSc student and a major project of her requires her to have internship experience. So, she contacted some IIT/IISC (Apparantly I don't remember) for any available internships. Those institute folks responded positively, but the internship is \"reversed\", which means my sister has to pay Rs. 30,000 for an onsite internship, travelling and staying charges, do free work for them, all this for just an internship experience for a project. Is this shit even legal? That's possibly a scam. Govt institutions don't ask for money."
}