{
    "id": "148v30v",
    "title": "Weekly Mental Health Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/148v30v/weekly_mental_health_discussion_thread/",
    "selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here.\n\nYou may find someone who has gone through a similar episode and might be able to help/guide you.\n\nPlease be civil and maintain Reddiquette while participating or replying/helping out someone.\n\nYou can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic.\n\n**If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**.\n\n* **Helplines**: AASRA: 91-22-27546669 (24 hours)\n* **Sneha Foundation**: 91-44-24640050 (24 hours)\n* **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours)\n* **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm)\n* **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm)\n\n**Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/1fqd80djw8n61.png?width=1487&format=png&auto=webp&v=enabled&s=184ead1efd5057f53cc3236ab564a2ce3ac8a7f6",
    "flair": "Scheduled",
    "score": 6,
    "num_comments": 15,
    "created_utc": 1686706210.0,
    "convurl": "https://external-preview.redd.it/FUATMZm8JLDTc_Im2P2hwXDebj9H8XTUE2E46u7I0hY.jpg",
    "comments": [
        "I'm insecure about something. Let's say, I'm insecure about X. X is a factor out of my hand, and I'm not responsible for it. \n\nI know about my insecurity, I don't feel guilty about it. \n\nI am not being an asshole to other people because of this insecurity. \n\nIt doesn't make me feel bad about myself like it used to. \n\nBut I'm getting a bit too defensive when people mock others for their X. \n\nAnd I'm afraid that i will never be accepted for because of X. \n\nIs my insecurity getting better or getting worse😬",
        "Definitely getting better",
        "Thanks!",
        "I have personally learned to live with uncertainty. I trust myself that i will be able to handle any situation with equanimity (i usually don't, but that's a good way to get rid of anxiety)",
        "Me and my father had a fight two days ago... My mom came into my support and then he was also started shouting on her. I was very enraged this time(these incidents happened before too). Now I can't forgive him because I've done this so many times and he still repeats this often... Since I live in a joint family and I am not talking to him from two days, no one is talking to me. And my father is behaving like nothing happened.. I can't forgive him until he realizes his mistake(and that'll never gonna happen). Also I recently suffered a failure from an examination ( PG) and now this... I cant bear it anymore",
        "Being aware of your insecurity and accepting it takes you miles ahead than most folks. Everyone deals with it differently.",
        "Hey mate, how are you doing now?",
        "Option D: Statement II is correct explanation for Statement I",
        "Upsc aspirant there? 😐",
        "Thanks for the positive words😊",
        "Well every generic shit exam aspirant here. 😓😒",
        "They say we forgive not for the other person but for ourselves. I know its easier said than done but hope it can help you find some peace. Hope you are doing well.",
        "I'm fine... No one is bothering me in my family... Within a month I'll be leaving for my PG for 2 years... I didn't want things to turn out like this beforehand.",
        "I wouldn't be enraged in the first place if I had forgiven him immediately. But it is happening too often that I thought confronting him should be better. Yes, forgiveness is necessary for my mental health and relationships. I think it will happen eventually like every time.",
        "I believe only time will tell how things would turn out. Good luck on your PG.",
        "How to achieve this elusive but all encompassing entity called consistency? Everything I do is half assed, half hearted, and I lose focus and motivation midway.  How do some people have this fire to keep going? I want that too. I want to be amped up and on fire at least most of the time.",
        "I'm insecure about my partner. She has grown distant to me, doesn't want to have long conversations, and always talks about that other guy friend of hers. It's to the point that I'm almost certain she's screwing me over, and it has taken a toll on my mental health. They go to \"internship\" together, sit together, have lunch together, and almost certainly go home in the same car. When I confronted her, she said I was just overthinking and that there is nothing between them; but I can't bring myself to agree to that.   \n\n\nI mean, I really want to not feel like this, being disappointed and all. It has taken a toll at my mental health to the point that no matter what I do, I just can't be happy. I am always stressed out, my heart beats a million beats a second, I can't sleep, I don't feel like eating, and I always feel like crying. And the worst part is, other than a handful of friends, I can't talk about this with anyone, literally nobody.",
        "Why in the world are people downvoting a thread like this?  Are they all in the \"suck it up and stifle yourself\" brigade??\n\nIf you don't want to post here then don't.  There's no reason to dump on people trying to get things off their chests",
        "**Does finding a partner and marrying help with depression and suicidal thoughts if you are lonely for years?**\n\nI am 28M. I think it's been 10+ years of me wishing to have a partner, affection and so on. Over the years, I became so desperate to the point, I became clinically depressed. I am not suicidal but I am not super happy with life either and don't have a strong desire to live. I also feel very lonely too everyday.\n\nAnyone in similar boat? Did marrying or finding a girlfriend solved any of your issues?",
        "So true"
    ],
    "cleaned_text": "weekly mental health discussion thread anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall ",
    "cleaned_title": "weekly mental health discussion thread",
    "cleaned_selftext": "anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall",
    "cleaned_comments": "im insecure something lets say im insecure x x factor hand im responsible know insecurity dont feel guilty asshole people insecurity doesnt make feel bad like used im getting bit defensive people mock others x im afraid never accepted x insecurity getting better getting worse definitely getting better thanks personally learned live uncertainty trust able handle situation equanimity usually dont thats good way get rid anxiety father fight two days ago mom came support also started shouting enraged timethese incidents happened cant forgive ive done many times still repeats often since live joint family talking two days one talking father behaving like nothing happened cant forgive realizes mistakeand thatll never gon na happen also recently suffered failure examination pg cant bear anymore aware insecurity accepting takes miles ahead folks everyone deals differently hey mate option statement ii correct explanation statement upsc aspirant thanks positive words well every generic shit exam aspirant say forgive person know easier said done hope help find peace hope well im fine one bothering family within month ill leaving pg years didnt want things turn like beforehand wouldnt enraged first place forgiven immediately happening often thought confronting better yes forgiveness necessary mental health relationships think happen eventually like every time believe time tell things would turn good luck pg achieve elusive encompassing entity called consistency everything half assed half hearted lose focus motivation midway people fire keep going want want amped fire least time im insecure partner grown distant doesnt want long conversations always talks guy friend point im almost certain shes screwing taken toll mental health go internship together sit together lunch together almost certainly go home car confronted said overthinking nothing cant bring agree mean really want feel like disappointed taken toll mental health point matter cant happy always stressed heart beats million beats second cant sleep dont feel like eating always feel like crying worst part handful friends cant talk anyone literally nobody world people downvoting thread like suck stifle brigade dont want post dont theres reason dump people trying get things chests finding partner marrying help depression suicidal thoughts lonely years think years wishing partner affection years became desperate point became clinically depressed suicidal super happy life either dont strong desire live also feel lonely everyday anyone similar boat marrying finding girlfriend solved issues true",
    "light_cleaned_title": "Weekly Mental Health Discussion Thread",
    "light_cleaned_selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here. You may find someone who has gone through a similar episode and might be able to help/guide you. Please be civil and maintain Reddiquette while participating or replying/helping out someone. You can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic. **If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**. * **Helplines**: AASRA: 91-22-27546669 (24 hours) * **Sneha Foundation**: 91-44-24640050 (24 hours) * **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours) * **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm) * **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm) **Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "I'm insecure about something. Let's say, I'm insecure about X. X is a factor out of my hand, and I'm not responsible for it. I know about my insecurity, I don't feel guilty about it. I am not being an asshole to other people because of this insecurity. It doesn't make me feel bad about myself like it used to. But I'm getting a bit too defensive when people mock others for their X. And I'm afraid that i will never be accepted for because of X. Is my insecurity getting better or getting worse😬 Definitely getting better Thanks! I have personally learned to live with uncertainty. I trust myself that i will be able to handle any situation with equanimity (i usually don't, but that's a good way to get rid of anxiety) Me and my father had a fight two days ago... My mom came into my support and then he was also started shouting on her. I was very enraged this time(these incidents happened before too). Now I can't forgive him because I've done this so many times and he still repeats this often... Since I live in a joint family and I am not talking to him from two days, no one is talking to me. And my father is behaving like nothing happened.. I can't forgive him until he realizes his mistake(and that'll never gonna happen). Also I recently suffered a failure from an examination ( PG) and now this... I cant bear it anymore Being aware of your insecurity and accepting it takes you miles ahead than most folks. Everyone deals with it differently. Hey mate, how are you doing now? Option D: Statement II is correct explanation for Statement I Upsc aspirant there? 😐 Thanks for the positive words😊 Well every generic shit exam aspirant here. 😓😒 They say we forgive not for the other person but for ourselves. I know its easier said than done but hope it can help you find some peace. Hope you are doing well. I'm fine... No one is bothering me in my family... Within a month I'll be leaving for my PG for 2 years... I didn't want things to turn out like this beforehand. I wouldn't be enraged in the first place if I had forgiven him immediately. But it is happening too often that I thought confronting him should be better. Yes, forgiveness is necessary for my mental health and relationships. I think it will happen eventually like every time. I believe only time will tell how things would turn out. Good luck on your PG. How to achieve this elusive but all encompassing entity called consistency? Everything I do is half assed, half hearted, and I lose focus and motivation midway. How do some people have this fire to keep going? I want that too. I want to be amped up and on fire at least most of the time. I'm insecure about my partner. She has grown distant to me, doesn't want to have long conversations, and always talks about that other guy friend of hers. It's to the point that I'm almost certain she's screwing me over, and it has taken a toll on my mental health. They go to \"internship\" together, sit together, have lunch together, and almost certainly go home in the same car. When I confronted her, she said I was just overthinking and that there is nothing between them; but I can't bring myself to agree to that. I mean, I really want to not feel like this, being disappointed and all. It has taken a toll at my mental health to the point that no matter what I do, I just can't be happy. I am always stressed out, my heart beats a million beats a second, I can't sleep, I don't feel like eating, and I always feel like crying. And the worst part is, other than a handful of friends, I can't talk about this with anyone, literally nobody. Why in the world are people downvoting a thread like this? Are they all in the \"suck it up and stifle yourself\" brigade?? If you don't want to post here then don't. There's no reason to dump on people trying to get things off their chests **Does finding a partner and marrying help with depression and suicidal thoughts if you are lonely for years?** I am 28M. I think it's been 10+ years of me wishing to have a partner, affection and so on. Over the years, I became so desperate to the point, I became clinically depressed. I am not suicidal but I am not super happy with life either and don't have a strong desire to live. I also feel very lonely too everyday. Anyone in similar boat? Did marrying or finding a girlfriend solved any of your issues? So true"
}