{
    "id": "16mospa",
    "title": "Madras HC judge's crusade against 'corruption' — revisiting cases, questioning netas' acquittals",
    "url": "https://theprint.in/judiciary/madras-hc-judges-crusade-against-corruption-revisiting-cases-questioning-netas-acquittals/1767948/",
    "selftext": "Since August, Justice Justice N. Anand Venkatesh has instituted suo motu revision petitions against discharges & acquittals of 6 serving & ex ministers, both from ruling DMK & opposition AIADMK.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695124031.0,
    "convurl": "https://external-preview.redd.it/f4oGPVBcaRi8UthDOZxXcNMDQbK4MqgHesCqGEik3Qk.jpg?auto=webp&s=0906bc2ef60f8176aaba6448e1c0a2a8a73fa127",
    "comments": [
        ">In these orders, Justice Venkatesh has launched a crusade against all the stakeholders in the criminal justice system, including special courts for trying MPs and MLAs, as well as the Directorate of Vigilance and Anti-Corruption (DVAC).\n\n>Last month, Justice Venkatesh sent ripples in the judicial circles after he took suo motu cognizance of the acquittal of Tamil Nadu’s Higher Education Minister K. Ponmudy in a disproportionate assets case in June. Venkatesh’s order spoke of how the district judge, within four days, “marshaled the evidence of 172 prosecution witnesses and 381 documents and managed (or rather stage-managed) to deliver a 226-page testament/judgment acquitting all the accused”.\n\n>The Madras HC judge has since instituted suo motu revision petitions against five more discharges and acquittals involving five other Tamil Nadu politicians — Revenue Minister K.K.S.S.R. Ramachandran, Finance Minister Thangam Thennarasu, former Chief Minister O. Panneerselvam, Rural Development Minister I. Periyasamy and former Social Welfare Minister B. Valarmathi.\n\n\nHe gave significant positive orders in the below case\n\n>Since becoming a judge in 2018, Justice Venkatesh has made headlines several times in the past too, the most prominent instance being when he was lauded in March 2021 for his “refreshing candor” for admitting that he needs to break his “own preconceived notions” while deciding a protection plea by a same-sex couple."
    ],
    "cleaned_text": "madras hc judges crusade corruption revisiting cases questioning netas acquittals since august justice justice n anand venkatesh instituted suo motu revision petitions discharges acquittals serving ex ministers ruling dmk opposition aiadmk ",
    "cleaned_title": "madras hc judges crusade corruption revisiting cases questioning netas acquittals",
    "cleaned_selftext": "since august justice justice n anand venkatesh instituted suo motu revision petitions discharges acquittals serving ex ministers ruling dmk opposition aiadmk",
    "cleaned_comments": "orders justice venkatesh launched crusade stakeholders criminal justice system including special courts trying mps mlas well directorate vigilance anticorruption dvac last month justice venkatesh sent ripples judicial circles took suo motu cognizance acquittal tamil nadus higher education minister k ponmudy disproportionate assets case june venkateshs order spoke district judge within four days marshaled evidence prosecution witnesses documents managed rather stagemanaged deliver page testamentjudgment acquitting accused madras hc judge since instituted suo motu revision petitions five discharges acquittals involving five tamil nadu politicians revenue minister kkssr ramachandran finance minister thangam thennarasu former chief minister panneerselvam rural development minister periyasamy former social welfare minister b valarmathi gave significant positive orders case since becoming judge justice venkatesh made headlines several times past prominent instance lauded march refreshing candor admitting needs break preconceived notions deciding protection plea samesex couple",
    "light_cleaned_title": "Madras HC judge's crusade against 'corruption' — revisiting cases, questioning netas' acquittals",
    "light_cleaned_selftext": "Since August, Justice Justice N. Anand Venkatesh has instituted suo motu revision petitions against discharges & acquittals of 6 serving & ex ministers, both from ruling DMK & opposition AIADMK.",
    "light_cleaned_comments": ">In these orders, Justice Venkatesh has launched a crusade against all the stakeholders in the criminal justice system, including special courts for trying MPs and MLAs, as well as the Directorate of Vigilance and Anti-Corruption (DVAC). >Last month, Justice Venkatesh sent ripples in the judicial circles after he took suo motu cognizance of the acquittal of Tamil Nadu’s Higher Education Minister K. Ponmudy in a disproportionate assets case in June. Venkatesh’s order spoke of how the district judge, within four days, “marshaled the evidence of 172 prosecution witnesses and 381 documents and managed (or rather stage-managed) to deliver a 226-page testament/judgment acquitting all the accused”. >The Madras HC judge has since instituted suo motu revision petitions against five more discharges and acquittals involving five other Tamil Nadu politicians — Revenue Minister K.K.S.S.R. Ramachandran, Finance Minister Thangam Thennarasu, former Chief Minister O. Panneerselvam, Rural Development Minister I. Periyasamy and former Social Welfare Minister B. Valarmathi. He gave significant positive orders in the below case >Since becoming a judge in 2018, Justice Venkatesh has made headlines several times in the past too, the most prominent instance being when he was lauded in March 2021 for his “refreshing candor” for admitting that he needs to break his “own preconceived notions” while deciding a protection plea by a same-sex couple."
}