{
    "id": "15rjkn5",
    "title": "7 years of the Internet Freedom Foundation | 7 years of your consistent support",
    "url": "https://www.reddit.com/r/india/comments/15rjkn5/7_years_of_the_internet_freedom_foundation_7/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/f91p3zkvo7ib1.png?width=1600&format=png&auto=webp&s=f4a3d9ccd0860bca4edb454180d854a5cf2a5109\n\nToday, as India celebrates its 77th Independence Day, the Internet Freedom Foundation completes 7 years since our [**first**](https://internetfreedom.in/hello-world/?ref=static.internetfreedom.in) public post.\n\nIt’s been an eventful year for digital rights, as always. Independence Day, along with being a moment to celebrate, is also an opportunity to reflect on what has been, and hope for what will be. Today, there is also much to be concerned about. Millions of people in the state of Manipur have been under an [**internet shutdown**](https://keepusonline.in/?ref=static.internetfreedom.in) for over 100 days now. The Monsoon Session of Parliament saw the enactment of the disappointing and alarming [**Digital Personal Data Protection Act**](https://internetfreedom.in/dpdpb-2023-in-the-parliament/?ref=static.internetfreedom.in) and the [**Registration of Births and Deaths (Amendment) Act**](https://twitter.com/IFFonParliament/status/1690300614209839104?s=20&ref=static.internetfreedom.in), which seeks to track citizens from cradle to grave. In a massive development, the Minister for Home Affairs introduced [**three key bills**](https://twitter.com/IFFonParliament/status/1689916184680890368?s=20&ref=static.internetfreedom.in) that overhaul the entire framework of criminal justice. In Haryana, the internet has been [**suspended**](https://twitter.com/internetfreedom/status/1686699378851917824?s=20&ref=static.internetfreedom.in) in certain districts for close to two weeks in response to communal violence. Last month, the Telecom Regulatory Authority of India released a [**consultation paper**](https://twitter.com/internetfreedom/status/1678353865207345154?s=20&ref=static.internetfreedom.in) to regulate and selectively ban OTT communication services which could threaten their integrity and access to them.  \n\nClearly, a lot is happening and it can feel hopeless, helpless, and scary.\n\nFor almost a decade, it is our community that has been at the core of our work, driving our efforts. And we promise to continue to keep fighting. IFF was born 7 years ago on Independence Day and we draw our core values and beliefs from the same spirit that drove the struggle for independence. When we say we fight for your privacy, your right to freedom of speech, for net neutrality, for innovation, what we’re fighting for is your right to self-determination and control over your destiny, on and offline.\n\n\\-Team IFF  \n\n\n[Sign up to become a member or donate now](https://internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692078095.0,
    "convurl": "https://external-preview.redd.it/xl9312awVEalZfiWHSkovl6_1r_r8DisVbozR3L5xrg.jpg",
    "comments": [],
    "cleaned_text": "years internet freedom foundation years consistent support xb today india celebrates th independence day internet freedom foundation completes years since firsthttpsinternetfreedominhelloworldrefstaticinternetfreedomin public post eventful year digital rights always independence day along moment celebrate also opportunity reflect hope today also much concerned millions people state manipur internet shutdownhttpskeepusonlineinrefstaticinternetfreedomin days monsoon session parliament saw enactment disappointing alarming digital personal data protection acthttpsinternetfreedomindpdpbintheparliamentrefstaticinternetfreedomin registration births deaths amendment acthttpstwittercomiffonparliamentstatussrefstaticinternetfreedomin seeks track citizens cradle grave massive development minister home affairs introduced three key billshttpstwittercomiffonparliamentstatussrefstaticinternetfreedomin overhaul entire framework criminal justice haryana internet suspendedhttpstwittercominternetfreedomstatussrefstaticinternetfreedomin certain districts close two weeks response communal violence last month telecom regulatory authority india released consultation paperhttpstwittercominternetfreedomstatussrefstaticinternetfreedomin regulate selectively ban ott communication services could threaten integrity access clearly lot happening feel hopeless helpless scary almost decade community core work driving efforts promise continue keep fighting iff born years ago independence day draw core values beliefs spirit drove struggle independence say fight privacy right freedom speech net neutrality innovation fighting right selfdetermination control destiny offline team iff sign become member donate nowhttpsinternetfreedomindonate ",
    "cleaned_title": "years internet freedom foundation years consistent support",
    "cleaned_selftext": "xb today india celebrates th independence day internet freedom foundation completes years since firsthttpsinternetfreedominhelloworldrefstaticinternetfreedomin public post eventful year digital rights always independence day along moment celebrate also opportunity reflect hope today also much concerned millions people state manipur internet shutdownhttpskeepusonlineinrefstaticinternetfreedomin days monsoon session parliament saw enactment disappointing alarming digital personal data protection acthttpsinternetfreedomindpdpbintheparliamentrefstaticinternetfreedomin registration births deaths amendment acthttpstwittercomiffonparliamentstatussrefstaticinternetfreedomin seeks track citizens cradle grave massive development minister home affairs introduced three key billshttpstwittercomiffonparliamentstatussrefstaticinternetfreedomin overhaul entire framework criminal justice haryana internet suspendedhttpstwittercominternetfreedomstatussrefstaticinternetfreedomin certain districts close two weeks response communal violence last month telecom regulatory authority india released consultation paperhttpstwittercominternetfreedomstatussrefstaticinternetfreedomin regulate selectively ban ott communication services could threaten integrity access clearly lot happening feel hopeless helpless scary almost decade community core work driving efforts promise continue keep fighting iff born years ago independence day draw core values beliefs spirit drove struggle independence say fight privacy right freedom speech net neutrality innovation fighting right selfdetermination control destiny offline team iff sign become member donate nowhttpsinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "7 years of the Internet Freedom Foundation | 7 years of your consistent support",
    "light_cleaned_selftext": "&#x200B; Today, as India celebrates its 77th Independence Day, the Internet Freedom Foundation completes 7 years since our [**first**](https://internetfreedom.in/hello-world/?ref=static.internetfreedom.in) public post. It’s been an eventful year for digital rights, as always. Independence Day, along with being a moment to celebrate, is also an opportunity to reflect on what has been, and hope for what will be. Today, there is also much to be concerned about. Millions of people in the state of Manipur have been under an [**internet shutdown**](https://keepusonline.in/?ref=static.internetfreedom.in) for over 100 days now. The Monsoon Session of Parliament saw the enactment of the disappointing and alarming [**Digital Personal Data Protection Act**](https://internetfreedom.in/dpdpb-2023-in-the-parliament/?ref=static.internetfreedom.in) and the [**Registration of Births and Deaths (Amendment) Act**](https://twitter.com/IFFonParliament/status/1690300614209839104?s=20&ref=static.internetfreedom.in), which seeks to track citizens from cradle to grave. In a massive development, the Minister for Home Affairs introduced [**three key bills**](https://twitter.com/IFFonParliament/status/1689916184680890368?s=20&ref=static.internetfreedom.in) that overhaul the entire framework of criminal justice. In Haryana, the internet has been [**suspended**](https://twitter.com/internetfreedom/status/1686699378851917824?s=20&ref=static.internetfreedom.in) in certain districts for close to two weeks in response to communal violence. Last month, the Telecom Regulatory Authority of India released a [**consultation paper**](https://twitter.com/internetfreedom/status/1678353865207345154?s=20&ref=static.internetfreedom.in) to regulate and selectively ban OTT communication services which could threaten their integrity and access to them. Clearly, a lot is happening and it can feel hopeless, helpless, and scary. For almost a decade, it is our community that has been at the core of our work, driving our efforts. And we promise to continue to keep fighting. IFF was born 7 years ago on Independence Day and we draw our core values and beliefs from the same spirit that drove the struggle for independence. When we say we fight for your privacy, your right to freedom of speech, for net neutrality, for innovation, what we’re fighting for is your right to self-determination and control over your destiny, on and offline. \\-Team IFF [Sign up to become a member or donate now](https://internetfreedom.in/donate)",
    "light_cleaned_comments": ""
}