{
    "id": "1byafg6",
    "title": "Beware of Scammers from Quikr and Olx",
    "url": "https://www.reddit.com/r/india/comments/1byafg6/beware_of_scammers_from_quikr_and_olx/",
    "selftext": "I had posted seconds for sale on Quikr. Someone called Shantanu Mishra (7970019716) reached out saying he is interested in buying the items.\n\nAs I had multiple items, he said he was a dealer in Electronics and furniture and would buy everything in bulk and would pay amount as requested (amount totalling to Rs. 38000).\n\nFor a week there was no contact, but called today saying did you give a missed call. I denied. Then he  said he is sending someone over to buy all the stuff and he will transfer the money. I was elated.\n\nI told him I had GPay only, but he insisted on PayTM. I setup PayTM, and he told me to check if I received message \"Hello\" from his end. I checked the messages and I did receive it, I also replied back. Then he said he sent voucher of Re.1 and check your messages. I saw message like this below -\n\n    Hi, You have successfully created\n    voucher of INR 1/- from\n    (livingtrade65@pay1 merchent) Paying\n    Money Voucher to your account Ref:\n    766855666756\n    No. Rs 1 Voucher Receive from pay\n    One\n\nThen he asked to send Re.1 to him to redeem it. I was wondering why I should send money to him. Anyway I sent Re.1. Then he told me to check my bank account. It showed a surplus of Re.1.\n\nNext he said he transferred voucher of Rs.25000 and asked to send Rs.25000 to receive it.\n\nhttps://preview.redd.it/6os5fd5fg3tc1.png?width=1080&format=png&auto=webp&s=3867271eba898b8df4bc94303fb3b01e4131af9e\n\nHe also posted a screenshot of it in WhatsApp as\n\nhttps://preview.redd.it/divxb4aie3tc1.png?width=869&format=png&auto=webp&s=314eca04c0984adc2fedbfe0e131109fefcaf0cf\n\nHe asked me to send Rs.25000. My spider senses were tingling. I said no I am not transferring any money. I don't understand this. As he said someone is coming, let the guy come then I will transfer.\n\nHe started pressurizing me to send the money. Fortunately I realized it was a scam. \n\nThe way the scam works is, he sent Rs.1 twice from another number. As I was on the chat of original number, I didn't realize how I received Rs.1 and thought this voucher thing is real.\n\nhttps://preview.redd.it/5q9f7d2jg3tc1.png?width=1080&format=png&auto=webp&s=2e0e0bd22c283e61fb4c93b394871ff53ed0889c\n\nSo beware of scams where you are told that you need to transfer money because of voucher crap.\n\nThis is the guys pic -\n\nhttps://preview.redd.it/qxtw2x5yg3tc1.png?width=1080&format=png&auto=webp&s=0e91ac52e78f8b9b61a313e228b0ac768d97ce88\n\n",
    "flair": "Crime",
    "score": 15,
    "num_comments": 0,
    "created_utc": 1712512028.0,
    "convurl": "https://b.thumbs.redditmedia.com/aAEk6laKJwP5YiUH57vinn5mBfTGnJf3CuaWIM0OnHE.jpg",
    "comments": [],
    "cleaned_text": "beware scammers quikr olx posted seconds sale quikr someone called shantanu mishra reached saying interested buying items multiple items said dealer electronics furniture would buy everything bulk would pay amount requested amount totalling rs week contact called today saying give missed call denied said sending someone buy stuff transfer money elated told gpay insisted paytm setup paytm told check received message hello end checked messages receive also replied back said sent voucher check messages saw message like hi successfully created voucher inr livingtradepay merchent paying money voucher account ref rs voucher receive pay one asked send redeem wondering send money anyway sent told check bank account showed surplus next said transferred voucher rs asked send rs receive also posted screenshot whatsapp asked send rs spider senses tingling said transferring money dont understand said someone coming let guy come transfer started pressurizing send money fortunately realized scam way scam works sent rs twice another number chat original number didnt realize received rs thought voucher thing real beware scams told need transfer money voucher crap guys pic ",
    "cleaned_title": "beware scammers quikr olx",
    "cleaned_selftext": "posted seconds sale quikr someone called shantanu mishra reached saying interested buying items multiple items said dealer electronics furniture would buy everything bulk would pay amount requested amount totalling rs week contact called today saying give missed call denied said sending someone buy stuff transfer money elated told gpay insisted paytm setup paytm told check received message hello end checked messages receive also replied back said sent voucher check messages saw message like hi successfully created voucher inr livingtradepay merchent paying money voucher account ref rs voucher receive pay one asked send redeem wondering send money anyway sent told check bank account showed surplus next said transferred voucher rs asked send rs receive also posted screenshot whatsapp asked send rs spider senses tingling said transferring money dont understand said someone coming let guy come transfer started pressurizing send money fortunately realized scam way scam works sent rs twice another number chat original number didnt realize received rs thought voucher thing real beware scams told need transfer money voucher crap guys pic",
    "cleaned_comments": "",
    "light_cleaned_title": "Beware of Scammers from Quikr and Olx",
    "light_cleaned_selftext": "I had posted seconds for sale on Quikr. Someone called Shantanu Mishra (7970019716) reached out saying he is interested in buying the items. As I had multiple items, he said he was a dealer in Electronics and furniture and would buy everything in bulk and would pay amount as requested (amount totalling to Rs. 38000). For a week there was no contact, but called today saying did you give a missed call. I denied. Then he said he is sending someone over to buy all the stuff and he will transfer the money. I was elated. I told him I had GPay only, but he insisted on PayTM. I setup PayTM, and he told me to check if I received message \"Hello\" from his end. I checked the messages and I did receive it, I also replied back. Then he said he sent voucher of Re.1 and check your messages. I saw message like this below - Hi, You have successfully created voucher of INR 1/- from (livingtrade65@pay1 merchent) Paying Money Voucher to your account Ref: 766855666756 No. Rs 1 Voucher Receive from pay One Then he asked to send Re.1 to him to redeem it. I was wondering why I should send money to him. Anyway I sent Re.1. Then he told me to check my bank account. It showed a surplus of Re.1. Next he said he transferred voucher of Rs.25000 and asked to send Rs.25000 to receive it. He also posted a screenshot of it in WhatsApp as He asked me to send Rs.25000. My spider senses were tingling. I said no I am not transferring any money. I don't understand this. As he said someone is coming, let the guy come then I will transfer. He started pressurizing me to send the money. Fortunately I realized it was a scam. The way the scam works is, he sent Rs.1 twice from another number. As I was on the chat of original number, I didn't realize how I received Rs.1 and thought this voucher thing is real. So beware of scams where you are told that you need to transfer money because of voucher crap. This is the guys pic -",
    "light_cleaned_comments": ""
}