{
    "id": "14m3o5y",
    "title": "Sweaty Hands, Gym Straps ?",
    "url": "https://www.reddit.com/gallery/14m3o5y",
    "selftext": "1 month beginner in weight lifting. prior some condition of chronic excessive sweaty hands and body.\n\nAm facing difficulty in holding pulling movement with barb, and dumb. Someone in my gym recommend me to buy gym glove,\n\nProblem is: Am concern that If sweat would make it worse in full gym gloves, or should i go to chalk, or anyone facing same problem how did you deal with  this .",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1688041523.0,
    "convurl": "https://i.redd.it/xskyvwm3ay8b1.png",
    "comments": [
        "Gloves will make your grip worse in every case.\n\nUse Chalk and learn to use the hook grip."
    ],
    "cleaned_text": "sweaty hands gym straps month beginner weight lifting prior condition chronic excessive sweaty hands body facing difficulty holding pulling movement barb dumb someone gym recommend buy gym glove problem concern sweat would make worse full gym gloves go chalk anyone facing problem deal ",
    "cleaned_title": "sweaty hands gym straps",
    "cleaned_selftext": "month beginner weight lifting prior condition chronic excessive sweaty hands body facing difficulty holding pulling movement barb dumb someone gym recommend buy gym glove problem concern sweat would make worse full gym gloves go chalk anyone facing problem deal",
    "cleaned_comments": "gloves make grip worse every case use chalk learn use hook grip",
    "light_cleaned_title": "Sweaty Hands, Gym Straps ?",
    "light_cleaned_selftext": "1 month beginner in weight lifting. prior some condition of chronic excessive sweaty hands and body. Am facing difficulty in holding pulling movement with barb, and dumb. Someone in my gym recommend me to buy gym glove, Problem is: Am concern that If sweat would make it worse in full gym gloves, or should i go to chalk, or anyone facing same problem how did you deal with this .",
    "light_cleaned_comments": "Gloves will make your grip worse in every case. Use Chalk and learn to use the hook grip."
}