{
    "id": "146masn",
    "title": "Cheap speakers or headphones?",
    "url": "https://www.reddit.com/r/india/comments/146masn/cheap_speakers_or_headphones/",
    "selftext": "A budget of about 1500INR. I've missed out on some good offers. Majority of the speakers available in this price range are pathetic. Headphones hurt my ears, but they're too convenient (and cheaper.)\n\n&#x200B;\n\nhttps://preview.redd.it/ftlsmg3zxb5b1.png?width=1645&format=png&auto=webp&v=enabled&s=eacdfdff09bcfa7a0123ec545b9cdd0fcf559aa0\n\n&#x200B;\n\nDoes anybody have any idea about whether/ when Amazon restocks unavailable items?\n\n&#x200B;\n\n&#x200B;\n\n[Current option.](https://preview.redd.it/zwzlgsqtyb5b1.png?width=1520&format=png&auto=webp&v=enabled&s=c035002271ca97bcff23a06c2bab1756986b1e36)\n\n&#x200B;",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1686464220.0,
    "convurl": "https://b.thumbs.redditmedia.com/Nry9fdjWlh0QiOnqdrhAw8WAPS0gJ1r5MNaI7Z4raNg.jpg",
    "comments": [
        "Just get a TWS. \n\nIt's much better than getting a cheap Headphone or a cheap Speaker.",
        "Then my old wired earphones instantly become obsolete. I also feel the ear pain much more so, with headsets that fit directly inside into your ear.\n\nI would prefer a speaker or an over-ear headset that can actually deliver better sound than my laptop/built in monitor speakers.\n\nI will be spending the majority of my life on my desk. Portability is not a major concern. I'd rather avoid anything that runs on battery/wireless.",
        "Hmm, okay.\n\nJust a suggestion, don't buy a boat product.",
        "\n\nI see Amazon recommending them to me all the time, but never bought anything from them because... money. \n\nThey bad?",
        "They're rebranded chinese products.",
        "But I though most of Amazon was...\n\n\nShould probably wait for the first speaker to get restocked anyway... better than any of those  RGB night lamps that are in the speakers section.",
        "For good sound at this price range I'd suggest iems like [7hz Zero](https://www.theaudiostore.in/products/7hz-salnotes-zero-iem) or [Tangzu Waner](https://www.headphonezone.in/products/tangzu-waner-s-g)",
        "https://www.amazon.in/CREATIVE-Pebble-Desktop-Speakers-Black/dp/B0791H74NT\n\nI would not go below this",
        "They just raised the price by 400 Rs. It was 1800 just a day ago."
    ],
    "cleaned_text": "cheap speakers headphones budget inr ive missed good offers majority speakers available price range pathetic headphones hurt ears theyre convenient cheaper xb xb anybody idea whether amazon restocks unavailable items xb xb current optionhttpspreviewredditzwzlgsqtybbpngwidthformatpngautowebpvenabledsccabcffacbabbe xb ",
    "cleaned_title": "cheap speakers headphones",
    "cleaned_selftext": "budget inr ive missed good offers majority speakers available price range pathetic headphones hurt ears theyre convenient cheaper xb xb anybody idea whether amazon restocks unavailable items xb xb current optionhttpspreviewredditzwzlgsqtybbpngwidthformatpngautowebpvenabledsccabcffacbabbe xb",
    "cleaned_comments": "get tws much better getting cheap headphone cheap speaker old wired earphones instantly become obsolete also feel ear pain much headsets fit directly inside ear would prefer speaker overear headset actually deliver better sound laptopbuilt monitor speakers spending majority life desk portability major concern id rather avoid anything runs batterywireless hmm okay suggestion dont buy boat product see amazon recommending time never bought anything money bad theyre rebranded chinese products though amazon probably wait first speaker get restocked anyway better rgb night lamps speakers section good sound price range id suggest iems like hz zerohttpswwwtheaudiostoreinproductshzsalnoteszeroiem tangzu wanerhttpswwwheadphonezoneinproductstangzuwanersg would go raised price rs day ago",
    "light_cleaned_title": "Cheap speakers or headphones?",
    "light_cleaned_selftext": "A budget of about 1500INR. I've missed out on some good offers. Majority of the speakers available in this price range are pathetic. Headphones hurt my ears, but they're too convenient (and cheaper.) &#x200B; &#x200B; Does anybody have any idea about whether/ when Amazon restocks unavailable items? &#x200B; &#x200B; [Current option.](https://preview.redd.it/zwzlgsqtyb5b1.png?width=1520&format=png&auto=webp&v=enabled&s=c035002271ca97bcff23a06c2bab1756986b1e36) &#x200B;",
    "light_cleaned_comments": "Just get a TWS. It's much better than getting a cheap Headphone or a cheap Speaker. Then my old wired earphones instantly become obsolete. I also feel the ear pain much more so, with headsets that fit directly inside into your ear. I would prefer a speaker or an over-ear headset that can actually deliver better sound than my laptop/built in monitor speakers. I will be spending the majority of my life on my desk. Portability is not a major concern. I'd rather avoid anything that runs on battery/wireless. Hmm, okay. Just a suggestion, don't buy a boat product. I see Amazon recommending them to me all the time, but never bought anything from them because... money. They bad? They're rebranded chinese products. But I though most of Amazon was... Should probably wait for the first speaker to get restocked anyway... better than any of those RGB night lamps that are in the speakers section. For good sound at this price range I'd suggest iems like [7hz Zero](https://www.theaudiostore.in/products/7hz-salnotes-zero-iem) or [Tangzu Waner](https://www.headphonezone.in/products/tangzu-waner-s-g) I would not go below this They just raised the price by 400 Rs. It was 1800 just a day ago."
}