{
    "id": "109xrt1",
    "title": "My Flipkart account has a Gift Card that I'm unable to use on anything and they have zero customer support. What are my options?",
    "url": "https://www.reddit.com/r/india/comments/109xrt1/my_flipkart_account_has_a_gift_card_that_im/",
    "selftext": "Not sure if any of you have tried to contact Flipkart customer support for anything, but as much as they claim their blatant BS about a 24/7 customer support channel and reiterate countless times about how they have such a fantastic customer first approach, there is fundamentally no way to reach them.\n\nThe phone numbers (044-45614700,  1800-202-9898,  1800-208-9898) listed as their official customer support numbers only play back a pre-recorded message asking us to visit the 'My Orders' page to know the details about our orders and hangs up.\n\nTheir customer support email (cs at flipkart.com) doesn't even have an autorespond feature letting you know a ticket number or a timeline for resolution of complaint. There is no response to the email I have sent them.\n\nAnyways, the issue I'm having is this - I added a Gift card worth Rs. 1000 a while ago. And now I am trying to place an order for a phone that is only sold on Flipkart and when I tried to use it on the orders page, it asks me to enter the OTP sent to my mobile number but only catch is that this mobile number is my old phone number from several years ago that I don't have access to. So I go to the account page to update the phone number and it says that it requires two OTPs, one sent to the existing number on the account (which I do not have access to) and the new phone number. So there is literally no way for me to update my phone number, and therefore no way to use the money that I have put in my account.\n\n&amp;#x200B;\n\n[This is their official policy.](https://preview.redd.it/4tvqe60p0mba1.png?width=1138&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2ff356031b279ef5888d8524a2cb6dcc8cc53706)\n\nAnd with what I started this thread with, there is no way to contact their customer support. So basically I'm in a deadlock where I cannot use my money in the gift card balance and it has an expiry date and there is fundamentally no way to reach customer support. I am honestly astonished that they are allowed to operate in this country with virtually no customer support.\n\nI tweeted to them on Twitter and they sent their copypasta about sending them details on the DM and they have been sending me more irrelevant copypasted stuff on the dms. Each time a new person sends me a message that is unrelated to my initial request.\n\nI cannot believe how impossible it is to do something that is so profoundly simple. I am literally begging them to allow me to spend money on their platform and they have no solution for me!\n\nDoes anyone have any solutions for this?",
    "flair": "AskIndia",
    "score": 6,
    "num_comments": 8,
    "created_utc": 1673524143,
    "convurl": "https://b.thumbs.redditmedia.com/TAYHDcjZjd78C7anzair9X9Fcnc_BgAWLu6cPQnBjKk.jpg",
    "comments": [
        "Honestly Flipkart is shit. I am a plus memeber and yet I am the least prioritised one as well. Anyways, try calling on this number 04445614700. Keep trying for sometime if it says the executives are busy. As per my experience, chances of picking up are better after 9:30 PM IST. There are other steps to get a call from them via app but as you don't have the registered number, it's of no use. Keep me in updated.",
        "I tried that number. It says the same pre-recorded message asking me to visit the my orders page for support and hangs up. Is that just for me???\n\nWhat does it tell you when you call them?",
        "All our executives are busy right now, please feel free to wait or reach out to us via mail. This may be because I am calling from my registered number and you are not. I got a call back from them a few minutes ago.  I can suggest you create a new account with a new number or use any of your family member's registered number and call them using the mentioned number. Once you can reach out to them, then they might be able to help you out, if they can't ask them to transfer your call to their senior executives(don't listen to any bullshit that our seniors are busy, eating, bathing, fucking, sleeping, just transfer the call).",
        "Flipkart support responds on Twitter. They may not solve the problem, but atleast they will respond.",
        "Which is worse than never responding. Because it's basically a bunch of people dedicated to instill false hope. That's nearly sinister.",
        "Yeah. This makes a lot of sense. I had created a new account with my existing number which for some reason I'm unable to login with. Maybe that's why I'm getting a prerecoeded message, because my number belongs to a deactivated account?\n\nAnyway I'll create a new account with my family members number. \n\nThank you for helping me make sense of the nonsensical pre-recorded message. \n\nMay I ask  if you have some insider info with Flipkart or the call center industry? You seem knowledgeable.",
        "No I don't. It's just I am a frustrated customer and so far had so many encounters with them that I have understood how to deal with them. I am done with theek services, products, delivery, pickup, everything. I haven't talked to my girlfriend in some months for so long as many times I have talked to their customer executives. Sometimes, I feel ok to talk to them atleast they keep on apologizing even though the issue is a manufacturer defect or logistics issue, unlike her. Listening to sorries can also be frustrating so I talk to the seniors then. So yeah, I have a pretty good experience as a customer. Keep this updated.",
        "Companies are naked and when we take it to Twitter and people starts seeing it, their executives just hold a towel infront of our eyes by responding on the tweet when the reality still remains the same. Maybe they can help sometimes and maybe they can't or won't, who knows."
    ],
    "cleaned_text": "flipkart account gift card im unable use anything zero customer support options sure tried contact flipkart customer support anything much claim blatant bs customer support channel reiterate countless times fantastic customer first approach fundamentally way reach phone numbers listed official customer support numbers play back prerecorded message asking us visit orders page know details orders hangs customer support email cs flipkartcom doesnt even autorespond feature letting know ticket number timeline resolution complaint response email sent anyways issue im added gift card worth rs ago trying place order phone sold flipkart tried use orders page asks enter otp sent mobile number catch mobile number old phone number several years ago dont access go account page update phone number says requires two otps one sent existing number account access new phone number literally way update phone number therefore way use money put account ampxb official policyhttpspreviewreddittvqepmbapngwidthampformatpngampautowebpampvenabledampsffbefdacbdcccc started thread way contact customer support basically im deadlock use money gift card balance expiry date fundamentally way reach customer support honestly astonished allowed operate country virtually customer support tweeted twitter sent copypasta sending details dm sending irrelevant copypasted stuff dms time new person sends message unrelated initial request believe impossible something profoundly simple literally begging allow spend money platform solution anyone solutions ",
    "cleaned_title": "flipkart account gift card im unable use anything zero customer support options",
    "cleaned_selftext": "sure tried contact flipkart customer support anything much claim blatant bs customer support channel reiterate countless times fantastic customer first approach fundamentally way reach phone numbers listed official customer support numbers play back prerecorded message asking us visit orders page know details orders hangs customer support email cs flipkartcom doesnt even autorespond feature letting know ticket number timeline resolution complaint response email sent anyways issue im added gift card worth rs ago trying place order phone sold flipkart tried use orders page asks enter otp sent mobile number catch mobile number old phone number several years ago dont access go account page update phone number says requires two otps one sent existing number account access new phone number literally way update phone number therefore way use money put account ampxb official policyhttpspreviewreddittvqepmbapngwidthampformatpngampautowebpampvenabledampsffbefdacbdcccc started thread way contact customer support basically im deadlock use money gift card balance expiry date fundamentally way reach customer support honestly astonished allowed operate country virtually customer support tweeted twitter sent copypasta sending details dm sending irrelevant copypasted stuff dms time new person sends message unrelated initial request believe impossible something profoundly simple literally begging allow spend money platform solution anyone solutions",
    "cleaned_comments": "honestly flipkart shit plus memeber yet least prioritised one well anyways try calling number keep trying sometime says executives busy per experience chances picking better pm ist steps get call via app dont registered number use keep updated tried number says prerecorded message asking visit orders page support hangs tell call executives busy right please feel free wait reach us via mail may calling registered number got call back minutes ago suggest create new account new number use family members registered number call using mentioned number reach might able help cant ask transfer call senior executivesdont listen bullshit seniors busy eating bathing fucking sleeping transfer call flipkart support responds twitter may solve problem atleast respond worse never responding basically bunch people dedicated instill false hope thats nearly sinister yeah makes lot sense created new account existing number reason im unable login maybe thats im getting prerecoeded message number belongs deactivated account anyway ill create new account family members number thank helping make sense nonsensical prerecorded message may ask insider info flipkart call center industry seem knowledgeable dont frustrated customer far many encounters understood deal done theek services products delivery pickup everything havent talked girlfriend months long many times talked customer executives sometimes feel ok talk atleast keep apologizing even though issue manufacturer defect logistics issue unlike listening sorries also frustrating talk seniors yeah pretty good experience customer keep updated companies naked take twitter people starts seeing executives hold towel infront eyes responding tweet reality still remains maybe help sometimes maybe cant wont knows",
    "light_cleaned_title": "My Flipkart account has a Gift Card that I'm unable to use on anything and they have zero customer support. What are my options?",
    "light_cleaned_selftext": "Not sure if any of you have tried to contact Flipkart customer support for anything, but as much as they claim their blatant BS about a 24/7 customer support channel and reiterate countless times about how they have such a fantastic customer first approach, there is fundamentally no way to reach them. The phone numbers (044-45614700, 1800-202-9898, 1800-208-9898) listed as their official customer support numbers only play back a pre-recorded message asking us to visit the 'My Orders' page to know the details about our orders and hangs up. Their customer support email (cs at flipkart.com) doesn't even have an autorespond feature letting you know a ticket number or a timeline for resolution of complaint. There is no response to the email I have sent them. Anyways, the issue I'm having is this - I added a Gift card worth Rs. 1000 a while ago. And now I am trying to place an order for a phone that is only sold on Flipkart and when I tried to use it on the orders page, it asks me to enter the OTP sent to my mobile number but only catch is that this mobile number is my old phone number from several years ago that I don't have access to. So I go to the account page to update the phone number and it says that it requires two OTPs, one sent to the existing number on the account (which I do not have access to) and the new phone number. So there is literally no way for me to update my phone number, and therefore no way to use the money that I have put in my account.  [This is their official policy.](https://preview.redd.it/4tvqe60p0mba1.png?width=1138&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2ff356031b279ef5888d8524a2cb6dcc8cc53706) And with what I started this thread with, there is no way to contact their customer support. So basically I'm in a deadlock where I cannot use my money in the gift card balance and it has an expiry date and there is fundamentally no way to reach customer support. I am honestly astonished that they are allowed to operate in this country with virtually no customer support. I tweeted to them on Twitter and they sent their copypasta about sending them details on the DM and they have been sending me more irrelevant copypasted stuff on the dms. Each time a new person sends me a message that is unrelated to my initial request. I cannot believe how impossible it is to do something that is so profoundly simple. I am literally begging them to allow me to spend money on their platform and they have no solution for me! Does anyone have any solutions for this?",
    "light_cleaned_comments": "Honestly Flipkart is shit. I am a plus memeber and yet I am the least prioritised one as well. Anyways, try calling on this number 04445614700. Keep trying for sometime if it says the executives are busy. As per my experience, chances of picking up are better after 9:30 PM IST. There are other steps to get a call from them via app but as you don't have the registered number, it's of no use. Keep me in updated. I tried that number. It says the same pre-recorded message asking me to visit the my orders page for support and hangs up. Is that just for me??? What does it tell you when you call them? All our executives are busy right now, please feel free to wait or reach out to us via mail. This may be because I am calling from my registered number and you are not. I got a call back from them a few minutes ago. I can suggest you create a new account with a new number or use any of your family member's registered number and call them using the mentioned number. Once you can reach out to them, then they might be able to help you out, if they can't ask them to transfer your call to their senior executives(don't listen to any bullshit that our seniors are busy, eating, bathing, fucking, sleeping, just transfer the call). Flipkart support responds on Twitter. They may not solve the problem, but atleast they will respond. Which is worse than never responding. Because it's basically a bunch of people dedicated to instill false hope. That's nearly sinister. Yeah. This makes a lot of sense. I had created a new account with my existing number which for some reason I'm unable to login with. Maybe that's why I'm getting a prerecoeded message, because my number belongs to a deactivated account? Anyway I'll create a new account with my family members number. Thank you for helping me make sense of the nonsensical pre-recorded message. May I ask if you have some insider info with Flipkart or the call center industry? You seem knowledgeable. No I don't. It's just I am a frustrated customer and so far had so many encounters with them that I have understood how to deal with them. I am done with theek services, products, delivery, pickup, everything. I haven't talked to my girlfriend in some months for so long as many times I have talked to their customer executives. Sometimes, I feel ok to talk to them atleast they keep on apologizing even though the issue is a manufacturer defect or logistics issue, unlike her. Listening to sorries can also be frustrating so I talk to the seniors then. So yeah, I have a pretty good experience as a customer. Keep this updated. Companies are naked and when we take it to Twitter and people starts seeing it, their executives just hold a towel infront of our eyes by responding on the tweet when the reality still remains the same. Maybe they can help sometimes and maybe they can't or won't, who knows."
}