{
    "id": "1eh3rdc",
    "title": "How to get away with murder with a life sentence",
    "url": "https://www.reddit.com/r/india/comments/1eh3rdc/how_to_get_away_with_murder_with_a_life_sentence/",
    "selftext": "Is it fair that the loved ones of murder victims should serve a lifetime of grief  while the murderer revels in the life he forever deprived his victim of after just a few years in jail?\n\n[https://www.theweek.in/news/india/2024/07/30/how-to-get-away-with-murder-with-a-life-sentence.html](https://www.theweek.in/news/india/2024/07/30/how-to-get-away-with-murder-with-a-life-sentence.html)",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1722474031.0,
    "convurl": "https://external-preview.redd.it/-lbBDhhUfWSrP_M9PoO3OG6ZWiR8mW_WP8rQesHOvAk.jpg?auto=webp&s=79d019732b60514ebc25ae8f7aec182effe65517",
    "comments": [
        "The premature release or unjustified parole breaks given to politically influential life convicts has raised disquiet about the life sentence regime in our country. The article takes an incisive look at a system which seems to coddle murderers while denying basic justice to the victims, that is to bereaved relatives. This lack of fit between crime and punishment devalues human life, which is one of the rarest of rare experiences available in the universe as we know it today. The writer, a bereaved father, suggests reforms that could help mitigate this ongoing miscarriage of justice and warns that unless they are undertaken quickly, aggrieved relatives could be driven to the rough justice that only acts of desperate vengeance can deliver."
    ],
    "cleaned_text": "get away murder life sentence fair loved ones murder victims serve lifetime grief murderer revels life forever deprived victim years jail httpswwwtheweekinnewsindiahowtogetawaywithmurderwithalifesentencehtmlhttpswwwtheweekinnewsindiahowtogetawaywithmurderwithalifesentencehtml ",
    "cleaned_title": "get away murder life sentence",
    "cleaned_selftext": "fair loved ones murder victims serve lifetime grief murderer revels life forever deprived victim years jail httpswwwtheweekinnewsindiahowtogetawaywithmurderwithalifesentencehtmlhttpswwwtheweekinnewsindiahowtogetawaywithmurderwithalifesentencehtml",
    "cleaned_comments": "premature release unjustified parole breaks given politically influential life convicts raised disquiet life sentence regime country article takes incisive look system seems coddle murderers denying basic justice victims bereaved relatives lack fit crime punishment devalues human life one rarest rare experiences available universe know today writer bereaved father suggests reforms could help mitigate ongoing miscarriage justice warns unless undertaken quickly aggrieved relatives could driven rough justice acts desperate vengeance deliver",
    "light_cleaned_title": "How to get away with murder with a life sentence",
    "light_cleaned_selftext": "Is it fair that the loved ones of murder victims should serve a lifetime of grief while the murderer revels in the life he forever deprived his victim of after just a few years in jail? [https://www.theweek.in/news/india/2024/07/30/how-to-get-away-with-murder-with-a-life-sentence.html](https://www.theweek.in/news/india/2024/07/30/how-to-get-away-with-murder-with-a-life-sentence.html)",
    "light_cleaned_comments": "The premature release or unjustified parole breaks given to politically influential life convicts has raised disquiet about the life sentence regime in our country. The article takes an incisive look at a system which seems to coddle murderers while denying basic justice to the victims, that is to bereaved relatives. This lack of fit between crime and punishment devalues human life, which is one of the rarest of rare experiences available in the universe as we know it today. The writer, a bereaved father, suggests reforms that could help mitigate this ongoing miscarriage of justice and warns that unless they are undertaken quickly, aggrieved relatives could be driven to the rough justice that only acts of desperate vengeance can deliver."
}