{
    "id": "1465jaq",
    "title": "Derailed by ambition",
    "url": "https://www.deccanherald.com/opinion/main-article/derailed-by-ambition-1226458.html",
    "selftext": "Modi focusing on personal PR by inaugrating every Vande Bharat while safety issues are ignored.\nHis inauguration is not the issue but considering he is the PM such events lead to a \"All Hands On Deck\" situation in the railways and everything else is put on hold and people working on important tasks ( like implementation of a collision safety system) are moved out to ensure the PMs PR stunt goes successfully. But are such PR stunts necessary when a tragic scenario lile the one that happend could have been averted if resources were focused on getting the safety related issues sorted first. \nThis is not the first instance, in some of the initial runs of Vande Bharat there were incidents where the trains struck a cow and was visibly damaged. Despite that incident becoming a meme we should not forget that that was a serious near miss.",
    "flair": "AskIndia",
    "score": 9,
    "num_comments": 2,
    "created_utc": 1686417009.0,
    "convurl": "https://external-preview.redd.it/HUldIrh55FpsfsCstISZMqmYXXJGzDhi8RdT1EpgHs0.jpg?auto=webp&v=enabled&s=204b40b2d1e73f7374747c7fcf352cdacaa1e4e3",
    "comments": [
        "You mean \"Derailed by Narcissisism\""
    ],
    "cleaned_text": "derailed ambition modi focusing personal pr inaugrating every vande bharat safety issues ignored inauguration issue considering pm events lead hands deck situation railways everything else put hold people working important tasks like implementation collision safety system moved ensure pms pr stunt goes successfully pr stunts necessary tragic scenario lile one happend could averted resources focused getting safety related issues sorted first first instance initial runs vande bharat incidents trains struck cow visibly damaged despite incident becoming meme forget serious near miss ",
    "cleaned_title": "derailed ambition",
    "cleaned_selftext": "modi focusing personal pr inaugrating every vande bharat safety issues ignored inauguration issue considering pm events lead hands deck situation railways everything else put hold people working important tasks like implementation collision safety system moved ensure pms pr stunt goes successfully pr stunts necessary tragic scenario lile one happend could averted resources focused getting safety related issues sorted first first instance initial runs vande bharat incidents trains struck cow visibly damaged despite incident becoming meme forget serious near miss",
    "cleaned_comments": "mean derailed narcissisism",
    "light_cleaned_title": "Derailed by ambition",
    "light_cleaned_selftext": "Modi focusing on personal PR by inaugrating every Vande Bharat while safety issues are ignored. His inauguration is not the issue but considering he is the PM such events lead to a \"All Hands On Deck\" situation in the railways and everything else is put on hold and people working on important tasks ( like implementation of a collision safety system) are moved out to ensure the PMs PR stunt goes successfully. But are such PR stunts necessary when a tragic scenario lile the one that happend could have been averted if resources were focused on getting the safety related issues sorted first. This is not the first instance, in some of the initial runs of Vande Bharat there were incidents where the trains struck a cow and was visibly damaged. Despite that incident becoming a meme we should not forget that that was a serious near miss.",
    "light_cleaned_comments": "You mean \"Derailed by Narcissisism\""
}