{
    "id": "15l0loa",
    "title": "Tacking the foot traffic for Indian retail sites in India",
    "url": "https://www.reddit.com/r/india/comments/15l0loa/tacking_the_foot_traffic_for_indian_retail_sites/",
    "selftext": "Greetings, everyone! I hope you're all doing well.\n\n&#x200B;\n\nLately, I've been helping a few of my friends with commercial real estate deals ( We are relatively new to this space ); they've been exploring the possibility of opening/acquiring franchises around the Delhi NCR region.\n\nDuring this process, I encountered a challenge related to tracking the foot traffic for these sites. In the US and Canada, we have location intelligence platforms like [Placer.ai](https://Placer.ai), which help me understand the foot traffic for a given location. However, in the Indian market, I've found it a bit challenging.\n\nFor those of you engaged in commercial real estate deals in India, I'm curious: How do you effectively measure your KPIs like footfall and customer personas based on their geographical origin?\n\nThank you for taking the time to read through this post.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691450437.0,
    "convurl": "https://external-preview.redd.it/ZVfPIK-jXdxaOF0c6TdqKq7Cwo5OhL-lkCmYerw64Ro.jpg?auto=webp&s=d1c71d8ff330f75d250e71446990fce68ea313ae",
    "comments": [],
    "cleaned_text": "tacking foot traffic indian retail sites india greetings everyone hope youre well xb lately ive helping friends commercial real estate deals relatively new space theyve exploring possibility openingacquiring franchises around delhi ncr region process encountered challenge related tracking foot traffic sites us canada location intelligence platforms like placeraihttpsplacerai help understand foot traffic given location however indian market ive found bit challenging engaged commercial real estate deals india im curious effectively measure kpis like footfall customer personas based geographical origin thank taking time read post ",
    "cleaned_title": "tacking foot traffic indian retail sites india",
    "cleaned_selftext": "greetings everyone hope youre well xb lately ive helping friends commercial real estate deals relatively new space theyve exploring possibility openingacquiring franchises around delhi ncr region process encountered challenge related tracking foot traffic sites us canada location intelligence platforms like placeraihttpsplacerai help understand foot traffic given location however indian market ive found bit challenging engaged commercial real estate deals india im curious effectively measure kpis like footfall customer personas based geographical origin thank taking time read post",
    "cleaned_comments": "",
    "light_cleaned_title": "Tacking the foot traffic for Indian retail sites in India",
    "light_cleaned_selftext": "Greetings, everyone! I hope you're all doing well. &#x200B; Lately, I've been helping a few of my friends with commercial real estate deals ( We are relatively new to this space ); they've been exploring the possibility of opening/acquiring franchises around the Delhi NCR region. During this process, I encountered a challenge related to tracking the foot traffic for these sites. In the US and Canada, we have location intelligence platforms like [Placer.ai](https://Placer.ai), which help me understand the foot traffic for a given location. However, in the Indian market, I've found it a bit challenging. For those of you engaged in commercial real estate deals in India, I'm curious: How do you effectively measure your KPIs like footfall and customer personas based on their geographical origin? Thank you for taking the time to read through this post.",
    "light_cleaned_comments": ""
}