{
    "id": "15w8wh0",
    "title": "A Teacher in Karnataka Was arrested For a heinous assault on a MINOR post 6 years.",
    "url": "https://legal.economictimes.indiatimes.com/news/litigation/ktaka-teacher-sentenced-to-life-imprisonment-for-unnatural-sex-with-minor/102167660",
    "selftext": "Teachers are revered with such respect all over the globe especially in India placing them next to God. The  environment is expected to be holistic, safe and nurturing to students so much so that they are termed as our second parents. I too indifferent to others have immense respect for teachers and also adored one for his excellent teaching skills and how his presence in class meant utmost concentration to the chapters being taught by him. He was such a humble and positive person in our eyes. That was until we opened the newspaper this morning. Too shocked to get a word out of our mouths. We couldn't believe what we read. The same teacher we spent close to 3 years with was declared a \"Pedophile\" a \"Sex Offender\".He r*ped a boy, a student from his coaching centre for the span of 2 years while he blackmailed him to fail him. The poor boy held on for a while but the truth was out when he was contracted with an STD from him and informed his parents as well as the medical practitioners. The parents immediately logded a complaint against him and he was arrested too. But the most horrifying part of all though was the fact that this case was registered in 2016 and the judgement for his life imprisonment was declared in July 2023. All throughout these 6 years nobody around him had a clue about a case filed on him, to such an extent that he continued running his Coaching Centre, was a guest lecturer in numerous schools, principal of a private college, a head teacher in the coaching centre I studied in and so on. He almost faced no consequences for the past 6 years for such a heinous crime. This with thousands of other cases goes to show how lineant our judicial system can be with such crucial topics.\n     \nThis was the article posted in 2016:\n\nhttps://www.newindianexpress.com/states/karnataka/2016/sep/10/Kulai-PU-College-lecturer-held-for-sexual-assault-1517761.amp",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1692530681.0,
    "convurl": "https://external-preview.redd.it/BCf1JYhwLE4BUYg-mK-s6V5ygawScHN3BbBnZXoH3qg.jpg?auto=webp&s=0cb709be3dd1a01399335b591b930b6cebfcad2f",
    "comments": [],
    "cleaned_text": "teacher karnataka arrested heinous assault minor post years teachers revered respect globe especially india placing next god environment expected holistic safe nurturing students much termed second parents indifferent others immense respect teachers also adored one excellent teaching skills presence class meant utmost concentration chapters taught humble positive person eyes opened newspaper morning shocked get word mouths couldnt believe read teacher spent close years declared pedophile sex offenderhe rped boy student coaching centre span years blackmailed fail poor boy held truth contracted std informed parents well medical practitioners parents immediately logded complaint arrested horrifying part though fact case registered judgement life imprisonment declared july throughout years nobody around clue case filed extent continued running coaching centre guest lecturer numerous schools principal private college head teacher coaching centre studied almost faced consequences past years heinous crime thousands cases goes show lineant judicial system crucial topics article posted ",
    "cleaned_title": "teacher karnataka arrested heinous assault minor post years",
    "cleaned_selftext": "teachers revered respect globe especially india placing next god environment expected holistic safe nurturing students much termed second parents indifferent others immense respect teachers also adored one excellent teaching skills presence class meant utmost concentration chapters taught humble positive person eyes opened newspaper morning shocked get word mouths couldnt believe read teacher spent close years declared pedophile sex offenderhe rped boy student coaching centre span years blackmailed fail poor boy held truth contracted std informed parents well medical practitioners parents immediately logded complaint arrested horrifying part though fact case registered judgement life imprisonment declared july throughout years nobody around clue case filed extent continued running coaching centre guest lecturer numerous schools principal private college head teacher coaching centre studied almost faced consequences past years heinous crime thousands cases goes show lineant judicial system crucial topics article posted",
    "cleaned_comments": "",
    "light_cleaned_title": "A Teacher in Karnataka Was arrested For a heinous assault on a MINOR post 6 years.",
    "light_cleaned_selftext": "Teachers are revered with such respect all over the globe especially in India placing them next to God. The environment is expected to be holistic, safe and nurturing to students so much so that they are termed as our second parents. I too indifferent to others have immense respect for teachers and also adored one for his excellent teaching skills and how his presence in class meant utmost concentration to the chapters being taught by him. He was such a humble and positive person in our eyes. That was until we opened the newspaper this morning. Too shocked to get a word out of our mouths. We couldn't believe what we read. The same teacher we spent close to 3 years with was declared a \"Pedophile\" a \"Sex Offender\".He r*ped a boy, a student from his coaching centre for the span of 2 years while he blackmailed him to fail him. The poor boy held on for a while but the truth was out when he was contracted with an STD from him and informed his parents as well as the medical practitioners. The parents immediately logded a complaint against him and he was arrested too. But the most horrifying part of all though was the fact that this case was registered in 2016 and the judgement for his life imprisonment was declared in July 2023. All throughout these 6 years nobody around him had a clue about a case filed on him, to such an extent that he continued running his Coaching Centre, was a guest lecturer in numerous schools, principal of a private college, a head teacher in the coaching centre I studied in and so on. He almost faced no consequences for the past 6 years for such a heinous crime. This with thousands of other cases goes to show how lineant our judicial system can be with such crucial topics. This was the article posted in 2016:",
    "light_cleaned_comments": ""
}