{
    "id": "12bcoky",
    "title": "BIGOTRY IN CURRICULUM TEXTBOOKS",
    "url": "https://www.reddit.com/r/india/comments/12bcoky/bigotry_in_curriculum_textbooks/",
    "selftext": "hiyya y'all! ProjectETE just made this petition and would love to have your support!! [https://www.change.org/ProjectETE](https://www.change.org/ProjectETE)  ProjectETE is a community dedicated to promoting fairness and accuracy  in education, that is to say that when curriculum textbooks have biased  or factually incorrect statements we recognize it, help the public  identify the problem, realise it's significance, and also come up with  implementable solutions—both on the small and large scale. A few  examples of bias in educational material include ALLEN stating  homosexuality as a cause of HIV transmission, the CBSE board paper  speaking against the 'emancipation of women,' or even the use of pink  for illustrations of girls and blue for boys. Failure to act will  perpetuate hate and reinforce baseless societal norms in future  generations. This petition hopes to ensure that guidelines are  established so that such harmful, discriminatory and stereotypical  statements aren't included in curriculum textbooks. Sign and share it to  make a difference one textbook at a time.\n\nTLDR:  sign and share the petition to ensure that guidelines are established  against discriminatory and stereotypical statements in curriculum  textbooks. here's the link: [https://www.change.org/ProjectETE](https://www.change.org/ProjectETE)",
    "flair": "Policy/Economy",
    "score": 6,
    "num_comments": 0,
    "created_utc": 1680596460.0,
    "convurl": "https://external-preview.redd.it/lL79cSImX0Wz0OTL1RhAI5JVKOxbpoAUpf0vfbBKRks.jpg?auto=webp&v=enabled&s=557312979fc4c2625cb1ed08b48540fbcaf665f7",
    "comments": [],
    "cleaned_text": "bigotry curriculum textbooks hiyya yall projectete made petition would love support httpswwwchangeorgprojectetehttpswwwchangeorgprojectete projectete community dedicated promoting fairness accuracy education say curriculum textbooks biased factually incorrect statements recognize help public identify problem realise significance also come implementable solutionsboth small large scale examples bias educational material include allen stating homosexuality cause hiv transmission cbse board paper speaking emancipation women even use pink illustrations girls blue boys failure act perpetuate hate reinforce baseless societal norms future generations petition hopes ensure guidelines established harmful discriminatory stereotypical statements arent included curriculum textbooks sign share make difference one textbook time tldr sign share petition ensure guidelines established discriminatory stereotypical statements curriculum textbooks heres link httpswwwchangeorgprojectetehttpswwwchangeorgprojectete ",
    "cleaned_title": "bigotry curriculum textbooks",
    "cleaned_selftext": "hiyya yall projectete made petition would love support httpswwwchangeorgprojectetehttpswwwchangeorgprojectete projectete community dedicated promoting fairness accuracy education say curriculum textbooks biased factually incorrect statements recognize help public identify problem realise significance also come implementable solutionsboth small large scale examples bias educational material include allen stating homosexuality cause hiv transmission cbse board paper speaking emancipation women even use pink illustrations girls blue boys failure act perpetuate hate reinforce baseless societal norms future generations petition hopes ensure guidelines established harmful discriminatory stereotypical statements arent included curriculum textbooks sign share make difference one textbook time tldr sign share petition ensure guidelines established discriminatory stereotypical statements curriculum textbooks heres link httpswwwchangeorgprojectetehttpswwwchangeorgprojectete",
    "cleaned_comments": "",
    "light_cleaned_title": "BIGOTRY IN CURRICULUM TEXTBOOKS",
    "light_cleaned_selftext": "hiyya y'all! ProjectETE just made this petition and would love to have your support!! [https://www.change.org/ProjectETE](https://www.change.org/ProjectETE) ProjectETE is a community dedicated to promoting fairness and accuracy in education, that is to say that when curriculum textbooks have biased or factually incorrect statements we recognize it, help the public identify the problem, realise it's significance, and also come up with implementable solutions—both on the small and large scale. A few examples of bias in educational material include ALLEN stating homosexuality as a cause of HIV transmission, the CBSE board paper speaking against the 'emancipation of women,' or even the use of pink for illustrations of girls and blue for boys. Failure to act will perpetuate hate and reinforce baseless societal norms in future generations. This petition hopes to ensure that guidelines are established so that such harmful, discriminatory and stereotypical statements aren't included in curriculum textbooks. Sign and share it to make a difference one textbook at a time. TLDR: sign and share the petition to ensure that guidelines are established against discriminatory and stereotypical statements in curriculum textbooks. here's the link: [https://www.change.org/ProjectETE](https://www.change.org/ProjectETE)",
    "light_cleaned_comments": ""
}