{
    "id": "16be313",
    "title": "No agenda for Parl session, discuss nine issues raised by oppn: Sonia Gandhi in letter to PM Modi",
    "url": "https://indianexpress.com/article/india/sonia-gandhi-letter-pm-modi-8927045/",
    "selftext": "\"I must point out that this Special Session was convened without any consultation with other political parties,\" the Congress leader wrote. \"None of us have any idea of its agenda. All we have been communicated is that all five days have been allocated for Government business.\"",
    "flair": "Politics",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1693986880.0,
    "convurl": "https://external-preview.redd.it/_aBliwZjbHY6FZrX6mK4uebP_lETz8gcfRYoJgUUzuc.jpg?auto=webp&s=f0b5d63b67c7770a20e5b50f3aa0a60ebad8970a",
    "comments": [
        "https://www.hindustantimes.com/india-news/sonia-gandhi-writes-pm-narendra-modi-agenda-special-session-parliament-101693983923140-amp.html\n\n>Issues mentioned by Gandhi in the letter were:\n\nCurrent economic situation with focus on increasing price rise of essential commodities, growing unemployment, rise in inequalities and distress of MSMEs;\n\nCommitment made by the Government of India to farmers and farmer organizations in regard to MS and other demands raised by them;\n\nDemand for a JPC to investigate the transactions of the Adani business group in light of all revelations;\n\nThe continued agony faced by people of Manipur and breakdown of; Constitutional machinery and social harmony in the State;\n\nRise in communal tension in different States like Haryana;\n\nContinued occupation of Indian Territory by China and challenges to our sovereignty on our borders in Ladakh and Arunachal Pradesh;\n\nUrgent need for a Caste Census;\n\nDamages being inflicted on Centre-State relations;\n\nImpact of natural disasters caused by extreme floods in some States and drought in others",
        "Govt is Bigg Boss?"
    ],
    "cleaned_text": "agenda parl session discuss nine issues raised oppn sonia gandhi letter pm modi must point special session convened without consultation political parties congress leader wrote none us idea agenda communicated five days allocated government business ",
    "cleaned_title": "agenda parl session discuss nine issues raised oppn sonia gandhi letter pm modi",
    "cleaned_selftext": "must point special session convened without consultation political parties congress leader wrote none us idea agenda communicated five days allocated government business",
    "cleaned_comments": "issues mentioned gandhi letter current economic situation focus increasing price rise essential commodities growing unemployment rise inequalities distress msmes commitment made government india farmers farmer organizations regard ms demands raised demand jpc investigate transactions adani business group light revelations continued agony faced people manipur breakdown constitutional machinery social harmony state rise communal tension different states like haryana continued occupation indian territory china challenges sovereignty borders ladakh arunachal pradesh urgent need caste census damages inflicted centrestate relations impact natural disasters caused extreme floods states drought others govt bigg boss",
    "light_cleaned_title": "No agenda for Parl session, discuss nine issues raised by oppn: Sonia Gandhi in letter to PM Modi",
    "light_cleaned_selftext": "\"I must point out that this Special Session was convened without any consultation with other political parties,\" the Congress leader wrote. \"None of us have any idea of its agenda. All we have been communicated is that all five days have been allocated for Government business.\"",
    "light_cleaned_comments": ">Issues mentioned by Gandhi in the letter were: Current economic situation with focus on increasing price rise of essential commodities, growing unemployment, rise in inequalities and distress of MSMEs; Commitment made by the Government of India to farmers and farmer organizations in regard to MS and other demands raised by them; Demand for a JPC to investigate the transactions of the Adani business group in light of all revelations; The continued agony faced by people of Manipur and breakdown of; Constitutional machinery and social harmony in the State; Rise in communal tension in different States like Haryana; Continued occupation of Indian Territory by China and challenges to our sovereignty on our borders in Ladakh and Arunachal Pradesh; Urgent need for a Caste Census; Damages being inflicted on Centre-State relations; Impact of natural disasters caused by extreme floods in some States and drought in others Govt is Bigg Boss?"
}