{
    "id": "14m40yh",
    "title": "How do I encourage book reading and reviews when X sells, even among pre-teens?",
    "url": "https://www.reddit.com/r/india/comments/14m40yh/how_do_i_encourage_book_reading_and_reviews_when/",
    "selftext": "13-year old Vijay has been reading and reviewing books for ages, and during the pandemic began posting his book reviews on [Youtube](https://www.youtube.com/@BRBV). He has posted over 100 book reviews and the channel is steadily generating views. Has over 280 subscribers and the reviews get a dozen or so views and occasional comments, which is fine by itself. \n\nBut then comes comparison, which is a kill-joy.\n\nSome of his classmates – especially girls have begun posting videos of them gyrating to latest Bollywood flicks and those are generating ‘thousands’ of views and subscribes. I realize that X sells, even among pre-teens. \n\nAnd there’s nothing wrong with skimpily clad teens gyrating. Proud parents want to encourage wannabe India's Got Talent; and Unkils and aUnties love to ogle at these videos. And I am left wondering how to get some reflected glory for a niche, geeky genera? ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1688042514.0,
    "convurl": "https://external-preview.redd.it/ll6Tr6osY7F3qM28BFFl9mbVVzB7JT_YoYKsQ1Ca9Mo.jpg?auto=webp&v=enabled&s=2d26105cef0fa7cc9a6fac239fc2b3a33d5727f0",
    "comments": [
        "I don’t know about this particular channel. \n\nBut there are many channels which are based on book reviews. Some are hit like readwithcindy and many just merge into background without much subscribers.",
        "> Some are hit like readwithcindy and many just merge into background without much subscribers.\n\nYes, I have seen readwithcindy too - extremely popular. Most, however are just the long tail!\n\nAn this gene can't compete with **eye candy** genera out there ;-)",
        "People have limited Attention to give to anything, but unlimited capacity to receive Attention.\n\nTech platforms take full advantage of this Attention Inequality to get ppl to create content for their platforms with the sales pitch that you will receive Attention as a reward.\n\nBut what they dont tell you or Vijay is that as Content explodes with everyone desperately searching for an audience, the available eyeballs are not increasing.\n\nSo whats happening now only less than 0.5% of the content being produced actually gets consumed by anyone according to the UN. So its not Vijay's fault. He cant win in such a system. And dont ask him to try. And talk to the girls too. All the girls who get views on one day dont get it the next day cuz there is someone else pulling attention away.",
        "> So whats happening now only less than 0.5% of the content being produced actually gets consumed by anyone according to the UN. So its not Vijay's fault. He cant win in such a system. And dont ask him to try. And talk to the girls too. All the girls who get views on one day dont get it the next day cuz there is someone else pulling attention away.\n\nTx. I love this succinct description of all factors at play!"
    ],
    "cleaned_text": "encourage book reading reviews x sells even among preteens year old vijay reading reviewing books ages pandemic began posting book reviews youtubehttpswwwyoutubecombrbv posted book reviews channel steadily generating views subscribers reviews get dozen views occasional comments fine comes comparison killjoy classmates especially girls begun posting videos gyrating latest bollywood flicks generating thousands views subscribes realize x sells even among preteens theres nothing wrong skimpily clad teens gyrating proud parents want encourage wannabe indias got talent unkils aunties love ogle videos left wondering get reflected glory niche geeky genera ",
    "cleaned_title": "encourage book reading reviews x sells even among preteens",
    "cleaned_selftext": "year old vijay reading reviewing books ages pandemic began posting book reviews youtubehttpswwwyoutubecombrbv posted book reviews channel steadily generating views subscribers reviews get dozen views occasional comments fine comes comparison killjoy classmates especially girls begun posting videos gyrating latest bollywood flicks generating thousands views subscribes realize x sells even among preteens theres nothing wrong skimpily clad teens gyrating proud parents want encourage wannabe indias got talent unkils aunties love ogle videos left wondering get reflected glory niche geeky genera",
    "cleaned_comments": "dont know particular channel many channels based book reviews hit like readwithcindy many merge background without much subscribers hit like readwithcindy many merge background without much subscribers yes seen readwithcindy extremely popular however long tail gene cant compete eye candy genera people limited attention give anything unlimited capacity receive attention tech platforms take full advantage attention inequality get ppl create content platforms sales pitch receive attention reward dont tell vijay content explodes everyone desperately searching audience available eyeballs increasing whats happening less content produced actually gets consumed anyone according un vijays fault cant win system dont ask try talk girls girls get views one day dont get next day cuz someone else pulling attention away whats happening less content produced actually gets consumed anyone according un vijays fault cant win system dont ask try talk girls girls get views one day dont get next day cuz someone else pulling attention away tx love succinct description factors play",
    "light_cleaned_title": "How do I encourage book reading and reviews when X sells, even among pre-teens?",
    "light_cleaned_selftext": "13-year old Vijay has been reading and reviewing books for ages, and during the pandemic began posting his book reviews on [Youtube](https://www.youtube.com/@BRBV). He has posted over 100 book reviews and the channel is steadily generating views. Has over 280 subscribers and the reviews get a dozen or so views and occasional comments, which is fine by itself. But then comes comparison, which is a kill-joy. Some of his classmates – especially girls have begun posting videos of them gyrating to latest Bollywood flicks and those are generating ‘thousands’ of views and subscribes. I realize that X sells, even among pre-teens. And there’s nothing wrong with skimpily clad teens gyrating. Proud parents want to encourage wannabe India's Got Talent; and Unkils and aUnties love to ogle at these videos. And I am left wondering how to get some reflected glory for a niche, geeky genera?",
    "light_cleaned_comments": "I don’t know about this particular channel. But there are many channels which are based on book reviews. Some are hit like readwithcindy and many just merge into background without much subscribers. > Some are hit like readwithcindy and many just merge into background without much subscribers. Yes, I have seen readwithcindy too - extremely popular. Most, however are just the long tail! An this gene can't compete with **eye candy** genera out there ;-) People have limited Attention to give to anything, but unlimited capacity to receive Attention. Tech platforms take full advantage of this Attention Inequality to get ppl to create content for their platforms with the sales pitch that you will receive Attention as a reward. But what they dont tell you or Vijay is that as Content explodes with everyone desperately searching for an audience, the available eyeballs are not increasing. So whats happening now only less than 0.5% of the content being produced actually gets consumed by anyone according to the UN. So its not Vijay's fault. He cant win in such a system. And dont ask him to try. And talk to the girls too. All the girls who get views on one day dont get it the next day cuz there is someone else pulling attention away. > So whats happening now only less than 0.5% of the content being produced actually gets consumed by anyone according to the UN. So its not Vijay's fault. He cant win in such a system. And dont ask him to try. And talk to the girls too. All the girls who get views on one day dont get it the next day cuz there is someone else pulling attention away. Tx. I love this succinct description of all factors at play!"
}