{
    "id": "1550vl1",
    "title": "ANI spreading fake news with communal angle",
    "url": "https://www.reddit.com/r/india/comments/1550vl1/ani_spreading_fake_news_with_communal_angle/",
    "selftext": " https://twitter.com/zoo\\_bear/status/1682080638684508160?s=20 \n\nANI has recently spread fake news on twitter. Today 3 rapists were arrested who were responsible for raping kuki women. Also, today Manipur police arrested a person named abdul khan , who is member of PREPAK ( separatist organization). These two are completely different case.  ANI mixed the two news and said that abdul khan is the person responsible for rape. Later ANI deleted this tweet. But bjp IT cell spread the fake news on twitter with help of their trolls.\n\nWhy is no action taken against such channels? It was fake news that causes rape of two girls and now such organizations dont even think what will happen after spreading such news. What do they want? ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689881813.0,
    "convurl": "https://external-preview.redd.it/hxITrN5cp9C7eyfkUKRw4GQxTAnlDZ337fiJs89Dpsw.jpg?auto=webp&s=804c89915dcf40ac109a855454a7c44783c0e894",
    "comments": [],
    "cleaned_text": "ani spreading fake news communal angle ani recently spread fake news twitter today rapists arrested responsible raping kuki women also today manipur police arrested person named abdul khan member prepak separatist organization two completely different case ani mixed two news said abdul khan person responsible rape later ani deleted tweet bjp cell spread fake news twitter help trolls action taken channels fake news causes rape two girls organizations dont even think happen spreading news want ",
    "cleaned_title": "ani spreading fake news communal angle",
    "cleaned_selftext": "ani recently spread fake news twitter today rapists arrested responsible raping kuki women also today manipur police arrested person named abdul khan member prepak separatist organization two completely different case ani mixed two news said abdul khan person responsible rape later ani deleted tweet bjp cell spread fake news twitter help trolls action taken channels fake news causes rape two girls organizations dont even think happen spreading news want",
    "cleaned_comments": "",
    "light_cleaned_title": "ANI spreading fake news with communal angle",
    "light_cleaned_selftext": "ANI has recently spread fake news on twitter. Today 3 rapists were arrested who were responsible for raping kuki women. Also, today Manipur police arrested a person named abdul khan , who is member of PREPAK ( separatist organization). These two are completely different case. ANI mixed the two news and said that abdul khan is the person responsible for rape. Later ANI deleted this tweet. But bjp IT cell spread the fake news on twitter with help of their trolls. Why is no action taken against such channels? It was fake news that causes rape of two girls and now such organizations dont even think what will happen after spreading such news. What do they want?",
    "light_cleaned_comments": ""
}