{
    "id": "1f8hnii",
    "title": "Forcing husband to live in separate room is cruelty, says Allahabad High Court granting divorce",
    "url": "https://www.deccanherald.com/india/uttar-pradesh/forcing-husband-to-live-in-separate-room-is-cruelty-says-allahabad-high-court-granting-divorce-3175054",
    "selftext": "‘’Cruelty is to be taken as a behaviour by one spouse towards the other, which causes reasonable apprehension in the mind of the latter that it is not safe for him or her to continue the matrimonial relationship with the other… mental cruelty is a is a state of mind and feeling with one of the spouses due to the behaviour or behavioural pattern by the other,’’ the court said in a recent judgement.",
    "flair": "Law & Courts",
    "score": 109,
    "num_comments": 5,
    "created_utc": 1725415081.0,
    "convurl": "https://external-preview.redd.it/2OsmAC8GxxPlaDvpbrHMVU2rLL2Tlb4sq7QKEl3HucM.jpg?auto=webp&s=737902a074b804e705c0e9bf3f2c5d9e2901d4e5",
    "comments": [
        "> mental cruelty is a is a state of mind and feeling with one of the spouses due to the behaviour or behavioural pattern by the other,\n\nReally glad the court recognizes that it cuts across genders",
        "wtf thats so regressive.\n\n\nForcing a wife to sleep in the same bed as husband is cruelty. \n\n\nWhy is court deciding on who should sleep where??",
        "Court isn't forcing anyone to sleep where but acknowledging that cruelty is experienced by both genders and is a ground for divorce.",
        "Huh? Court didn't say the wife has to sleep in the same room they acknowledged the civil cruelty and granted a divorce. \n\nWhat article did you read?",
        "Bro no one forcing her \n\nCourt has just taken account that it's cruelty and granted divorce \n\nWhich I think is great as they both aren't getting along",
        "Gotcha"
    ],
    "cleaned_text": "forcing husband live separate room cruelty says allahabad high court granting divorce cruelty taken behaviour one spouse towards causes reasonable apprehension mind latter safe continue matrimonial relationship mental cruelty state mind feeling one spouses due behaviour behavioural pattern court said recent judgement ",
    "cleaned_title": "forcing husband live separate room cruelty says allahabad high court granting divorce",
    "cleaned_selftext": "cruelty taken behaviour one spouse towards causes reasonable apprehension mind latter safe continue matrimonial relationship mental cruelty state mind feeling one spouses due behaviour behavioural pattern court said recent judgement",
    "cleaned_comments": "mental cruelty state mind feeling one spouses due behaviour behavioural pattern really glad court recognizes cuts across genders wtf thats regressive forcing wife sleep bed husband cruelty court deciding sleep court isnt forcing anyone sleep acknowledging cruelty experienced genders ground divorce huh court didnt say wife sleep room acknowledged civil cruelty granted divorce article read bro one forcing court taken account cruelty granted divorce think great arent getting along gotcha",
    "light_cleaned_title": "Forcing husband to live in separate room is cruelty, says Allahabad High Court granting divorce",
    "light_cleaned_selftext": "‘’Cruelty is to be taken as a behaviour by one spouse towards the other, which causes reasonable apprehension in the mind of the latter that it is not safe for him or her to continue the matrimonial relationship with the other… mental cruelty is a is a state of mind and feeling with one of the spouses due to the behaviour or behavioural pattern by the other,’’ the court said in a recent judgement.",
    "light_cleaned_comments": "> mental cruelty is a is a state of mind and feeling with one of the spouses due to the behaviour or behavioural pattern by the other, Really glad the court recognizes that it cuts across genders wtf thats so regressive. Forcing a wife to sleep in the same bed as husband is cruelty. Why is court deciding on who should sleep where?? Court isn't forcing anyone to sleep where but acknowledging that cruelty is experienced by both genders and is a ground for divorce. Huh? Court didn't say the wife has to sleep in the same room they acknowledged the civil cruelty and granted a divorce. What article did you read? Bro no one forcing her Court has just taken account that it's cruelty and granted divorce Which I think is great as they both aren't getting along Gotcha"
}