{
    "id": "13d9mi2",
    "title": "What % of people in each state are poor?",
    "url": "https://www.reddit.com/r/india/comments/13d9mi2/what_of_people_in_each_state_are_poor/",
    "selftext": "Source: [https://twitter.com/indiainpixels/status/1472890759791595521?lang=en](https://twitter.com/indiainpixels/status/1472890759791595521?lang=en)\n\nhttps://preview.redd.it/sdzpto963wya1.png?width=1434&format=png&auto=webp&v=enabled&s=20a844bc18b1f362b469141cf049d155a47c2f8e",
    "flair": "Policy/Economy",
    "score": 16,
    "num_comments": 11,
    "created_utc": 1683674547.0,
    "convurl": "https://external-preview.redd.it/N75YSzDNzZ4HXqm8oB_1X0gO5w4EZy2vCo7dwBIrywM.jpg?auto=webp&v=enabled&s=92d5b61e15441ad9f6c0eb47e27f532f26f6e53c",
    "comments": [
        "Why is Bihar like this?",
        "Quick answer is corruption. Detailed answer will require PhD work. \n\nThere is not enough investment in any social infrastructure - education, health, public safety.  Casteism still rules.  In the end you have a population that is not moving up. Politicians beurocrat nexus  find this convenient for their corruption",
        "useless politicians. Their CM is dreaming of becoming a PM.",
        "Most poor in ? Double engine states 😁\n\n![gif](giphy|9WXyFIDv2PyBq)",
        "So Kerala has no poverty?",
        "The Kerala story.\n\nLove jihad is eliminating poverty",
        "Would anyone just take one look at the state of Bihar and say \"no thanks\" to him then?",
        "konsa ganja fuka hai usne idk, he is not even having majority seats in his own state."
    ],
    "cleaned_text": "people state poor source httpstwittercomindiainpixelsstatuslangenhttpstwittercomindiainpixelsstatuslangen ",
    "cleaned_title": "people state poor",
    "cleaned_selftext": "source httpstwittercomindiainpixelsstatuslangenhttpstwittercomindiainpixelsstatuslangen",
    "cleaned_comments": "bihar like quick answer corruption detailed answer require phd work enough investment social infrastructure education health public safety casteism still rules end population moving politicians beurocrat nexus find convenient corruption useless politicians cm dreaming becoming pm poor double engine states gifgiphywxyfidvpybq kerala poverty kerala story love jihad eliminating poverty would anyone take one look state bihar say thanks konsa ganja fuka hai usne idk even majority seats state",
    "light_cleaned_title": "What % of people in each state are poor?",
    "light_cleaned_selftext": "Source: [https://twitter.com/indiainpixels/status/1472890759791595521?lang=en](https://twitter.com/indiainpixels/status/1472890759791595521?lang=en)",
    "light_cleaned_comments": "Why is Bihar like this? Quick answer is corruption. Detailed answer will require PhD work. There is not enough investment in any social infrastructure - education, health, public safety. Casteism still rules. In the end you have a population that is not moving up. Politicians beurocrat nexus find this convenient for their corruption useless politicians. Their CM is dreaming of becoming a PM. Most poor in ? Double engine states 😁 ![gif](giphy|9WXyFIDv2PyBq) So Kerala has no poverty? The Kerala story. Love jihad is eliminating poverty Would anyone just take one look at the state of Bihar and say \"no thanks\" to him then? konsa ganja fuka hai usne idk, he is not even having majority seats in his own state."
}