{
    "id": "1492zoo",
    "title": "Report launch | “No Internet Means No Work, No Pay, No Food\"",
    "url": "https://www.reddit.com/r/india/comments/1492zoo/report_launch_no_internet_means_no_work_no_pay_no/",
    "selftext": "On June 14, 2023, Human Rights Watch and IFF launched their joint report **“No Internet Means No Work, No Pay, No Food\": Internet Shutdowns Deny Access to Basic Rights in \"Digital India.\"** \n\nThe report sheds lights on a fundamental conflict in the Government’s push for “Digital India''— even as digitalisation & platformisation make internet access vital for everyday life, state governments and the Union Government continue to impose shutdowns arbitrarily, erratically, unnecessarily, and disproportionately, and in the process, denying millions access to basic rights and entitlements guaranteed by the Constitution. \n\nRead the full report here: [https://www.hrw.org/report/2023/06/14/no-internet-means-no-work-no-pay-no-food/internet-shutdowns-deny-access-basic](https://www.hrw.org/report/2023/06/14/no-internet-means-no-work-no-pay-no-food/internet-shutdowns-deny-access-basic)\n\nRead the [English](https://www.hrw.org/news/2023/06/13/india-internet-shutdowns-hurt-vulnerable-communities) and [Hindi](https://www.youtube.com/watch?v=nqk8lbYNfqw) Press release. \n\n# Virtual Launch Event | 14th June - 7:00 PM IST \n\n[Register now](https://hrworg.zoom.us/webinar/register/WN_cRDVCVJYSju39Q0nzuS1lQ) \n\nhttps://preview.redd.it/sxsx6bzw8y5b1.png?width=1600&format=png&auto=webp&v=enabled&s=923c3681c26d07c068ba7101d9ecc50a00b17077\n\n[Register now](https://hrworg.zoom.us/webinar/register/WN_cRDVCVJYSju39Q0nzuS1lQ) \n\nThe panel includes:\n\n* Vineet Bhambhu, member of the Mazdoor Kisan Shakti Sangathan;\n* Tim Engelhardt, Human Rights Officer, Thematic Engagement, Special Procedures and Right to Development Division, Office of the United Nations High Commissioner for Human Rights; \n* Apar Gupta, Founding Director of IFF; and \n* Jayshree Bajoria, Associate Director, Asia, Human Rights Watch. \n\n*The panel will be moderated by Rohini Lakshané, Technologist and Researcher.* \n\nHelp us continue fighting internet shutdowns. [Become an IFF member today.](https://internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 234,
    "num_comments": 9,
    "created_utc": 1686733661.0,
    "convurl": "https://external-preview.redd.it/WhukN-c59_4Q-g6EZWoZs1Zqle7wzPLupnl7BXlTKjM.jpg?auto=webp&v=enabled&s=5448e68341b478d229d4f30b11b767e83d7be96d",
    "comments": [
        "We are fighting wrongly\n\nWe need to fight for the making the data to be public and announced every time the internet shutdown happens \n\nWith the info , what domains , what area , what services are impacted , what is the period of shutdown, who issued the order and why it was okayed. \n\n\nOnly when this law gets passed we can fight the above thing",
        "It's such a shame that on one hand India is pushing digitization and on the other leading in internet shutdowns.",
        "We have had a similar issue, as we are working in a sector in Jodhpur-Barmer. Where getting internet was struggle to begin with and with internet outage it was a crime for us not being able to help the artisans.",
        "Thank you. Finally someone put this out.\n\nWe cannot both push for a digital India and then shut that shit down.\n\nIf the internet was shut down today for me, i would lose my job, i won't be able to access ANY MONEY, and wtf am i gonna do then?\n\nThe government has NO PLAN OR INTENTION to feed me, why should I on their whim suffer this?\n\nAnd the best part is, the banks.\n\nThe banks will still want their fucking emi won't they. The rest of the world was dying but they needed their emi paid right. Even tho hey, let's let billions of dollars be stolen, but how dare this idiot not pay his 3k a month emi. I will go and make his life hell. \n\nThe government should be held liable for all this. You can't push for a digital India then punish us. That's like new age fascism, because if they wanna punish us or make us wanna listen, they will just shut the internet down."
    ],
    "cleaned_text": "report launch internet means work pay food june human rights watch iff launched joint report internet means work pay food internet shutdowns deny access basic rights digital india report sheds lights fundamental conflict governments push digital india even digitalisation platformisation make internet access vital everyday life state governments union government continue impose shutdowns arbitrarily erratically unnecessarily disproportionately process denying millions access basic rights entitlements guaranteed constitution read full report httpswwwhrworgreportnointernetmeansnoworknopaynofoodinternetshutdownsdenyaccessbasichttpswwwhrworgreportnointernetmeansnoworknopaynofoodinternetshutdownsdenyaccessbasic read englishhttpswwwhrworgnewsindiainternetshutdownshurtvulnerablecommunities hindihttpswwwyoutubecomwatchvnqklbynfqw press release virtual launch event th june pm ist register nowhttpshrworgzoomuswebinarregisterwncrdvcvjysjuqnzuslq register nowhttpshrworgzoomuswebinarregisterwncrdvcvjysjuqnzuslq panel includes vineet bhambhu member mazdoor kisan shakti sangathan tim engelhardt human rights officer thematic engagement special procedures right development division office united nations high commissioner human rights apar gupta founding director iff jayshree bajoria associate director asia human rights watch panel moderated rohini lakshan technologist researcher help us continue fighting internet shutdowns become iff member todayhttpsinternetfreedomindonate ",
    "cleaned_title": "report launch internet means work pay food",
    "cleaned_selftext": "june human rights watch iff launched joint report internet means work pay food internet shutdowns deny access basic rights digital india report sheds lights fundamental conflict governments push digital india even digitalisation platformisation make internet access vital everyday life state governments union government continue impose shutdowns arbitrarily erratically unnecessarily disproportionately process denying millions access basic rights entitlements guaranteed constitution read full report httpswwwhrworgreportnointernetmeansnoworknopaynofoodinternetshutdownsdenyaccessbasichttpswwwhrworgreportnointernetmeansnoworknopaynofoodinternetshutdownsdenyaccessbasic read englishhttpswwwhrworgnewsindiainternetshutdownshurtvulnerablecommunities hindihttpswwwyoutubecomwatchvnqklbynfqw press release virtual launch event th june pm ist register nowhttpshrworgzoomuswebinarregisterwncrdvcvjysjuqnzuslq register nowhttpshrworgzoomuswebinarregisterwncrdvcvjysjuqnzuslq panel includes vineet bhambhu member mazdoor kisan shakti sangathan tim engelhardt human rights officer thematic engagement special procedures right development division office united nations high commissioner human rights apar gupta founding director iff jayshree bajoria associate director asia human rights watch panel moderated rohini lakshan technologist researcher help us continue fighting internet shutdowns become iff member todayhttpsinternetfreedomindonate",
    "cleaned_comments": "fighting wrongly need fight making data public announced every time internet shutdown happens info domains area services impacted period shutdown issued order okayed law gets passed fight thing shame one hand india pushing digitization leading internet shutdowns similar issue working sector jodhpurbarmer getting internet struggle begin internet outage crime us able help artisans thank finally someone put push digital india shut shit internet shut today would lose job wont able access money wtf gon na government plan intention feed whim suffer best part banks banks still want fucking emi wont rest world dying needed emi paid right even tho hey lets let billions dollars stolen dare idiot pay k month emi go make life hell government held liable cant push digital india punish us thats like new age fascism wan na punish us make us wan na listen shut internet",
    "light_cleaned_title": "Report launch | “No Internet Means No Work, No Pay, No Food\"",
    "light_cleaned_selftext": "On June 14, 2023, Human Rights Watch and IFF launched their joint report **“No Internet Means No Work, No Pay, No Food\": Internet Shutdowns Deny Access to Basic Rights in \"Digital India.\"** The report sheds lights on a fundamental conflict in the Government’s push for “Digital India''— even as digitalisation & platformisation make internet access vital for everyday life, state governments and the Union Government continue to impose shutdowns arbitrarily, erratically, unnecessarily, and disproportionately, and in the process, denying millions access to basic rights and entitlements guaranteed by the Constitution. Read the full report here: [https://www.hrw.org/report/2023/06/14/no-internet-means-no-work-no-pay-no-food/internet-shutdowns-deny-access-basic](https://www.hrw.org/report/2023/06/14/no-internet-means-no-work-no-pay-no-food/internet-shutdowns-deny-access-basic) Read the [English](https://www.hrw.org/news/2023/06/13/india-internet-shutdowns-hurt-vulnerable-communities) and [Hindi](https://www.youtube.com/watch?v=nqk8lbYNfqw) Press release. # Virtual Launch Event | 14th June - 7:00 PM IST [Register now](https://hrworg.zoom.us/webinar/register/WN_cRDVCVJYSju39Q0nzuS1lQ) [Register now](https://hrworg.zoom.us/webinar/register/WN_cRDVCVJYSju39Q0nzuS1lQ) The panel includes: * Vineet Bhambhu, member of the Mazdoor Kisan Shakti Sangathan; * Tim Engelhardt, Human Rights Officer, Thematic Engagement, Special Procedures and Right to Development Division, Office of the United Nations High Commissioner for Human Rights; * Apar Gupta, Founding Director of IFF; and * Jayshree Bajoria, Associate Director, Asia, Human Rights Watch. *The panel will be moderated by Rohini Lakshané, Technologist and Researcher.* Help us continue fighting internet shutdowns. [Become an IFF member today.](https://internetfreedom.in/donate)",
    "light_cleaned_comments": "We are fighting wrongly We need to fight for the making the data to be public and announced every time the internet shutdown happens With the info , what domains , what area , what services are impacted , what is the period of shutdown, who issued the order and why it was okayed. Only when this law gets passed we can fight the above thing It's such a shame that on one hand India is pushing digitization and on the other leading in internet shutdowns. We have had a similar issue, as we are working in a sector in Jodhpur-Barmer. Where getting internet was struggle to begin with and with internet outage it was a crime for us not being able to help the artisans. Thank you. Finally someone put this out. We cannot both push for a digital India and then shut that shit down. If the internet was shut down today for me, i would lose my job, i won't be able to access ANY MONEY, and wtf am i gonna do then? The government has NO PLAN OR INTENTION to feed me, why should I on their whim suffer this? And the best part is, the banks. The banks will still want their fucking emi won't they. The rest of the world was dying but they needed their emi paid right. Even tho hey, let's let billions of dollars be stolen, but how dare this idiot not pay his 3k a month emi. I will go and make his life hell. The government should be held liable for all this. You can't push for a digital India then punish us. That's like new age fascism, because if they wanna punish us or make us wanna listen, they will just shut the internet down."
}