{
    "id": "18cyf52",
    "title": "Zomato Gold offers free deliveries but asks us to pay for it. Rant",
    "url": "https://www.reddit.com/gallery/18cyf52",
    "selftext": "How's that a 9km outlet of the same restaurant doesn't deliver but a 17km one does? I have zomato Gold and the deliveries are free upto 10km. Very scummy.",
    "flair": "Rant / Vent",
    "score": 21,
    "num_comments": 30,
    "created_utc": 1701963943.0,
    "convurl": "https://i.redd.it/advp9gzl8w4c1.jpg",
    "comments": [
        "idk man it’s always worked for me, check if something was wrong with that outlet and it closed for everyone else not just you, try to order from it on a new account to see if the issue is real or a scam",
        "\\>  it closed \n\nits closed? it clearly states that it too far away to deliver while the other one is even tho further they are ready to deliver it for delivery fee. \n\nif a restaurant is closed it would say 'restaurant doesnt accept order currently or they switched off online order currently' it wouldnt say whatever the app says in as in the screenshot. \n\nnothing is wrong with my account or zomato app. this is how they seem to be operating.",
        "Maybe before, but now there are a lot of problems.\n\nThe one I face is them not giving you free deleivery even if you buy their 6 deliveries for 40 rupees or whatever. Even their support said I didn't do anything wrong, and they can't properly compensate you.\n\nFuck you zomato",
        "Well tbh I've seen some Domino's outlet opening 8 hours and some 24 hrs. So totally normal.",
        "I think your order has to be over 1500 for the free delivery offer",
        "this 🔝\n\nit’s totally normal for people like this letting it slide and being like “mehh its totally normal” \nlol 😂",
        "Well you're more than welcome to protest.",
        "Average entitled Indian consumer!",
        "Why are you ordering food from 17 kms away?",
        "oh man. a consumer can buy a premium version of the zomato called zomato gold. when you have Gold membership all the deliveries within 10km range are free of cost. No delivery charges. \n\nNow about the post. Zomato deliberately makes me not to order from a restaurant which is 9km while allowing me to buy food from the same restaurant but a different outlet which is 17km away by asking me to pay for it. \n\nI hope you can understand",
        "Are you missing what i was actually stating in the post?\n\nThey are not letting me order from a restaurant which is 9km away saying that restaurant is far away. But they are allowing the same restaurant chain but a different outlet which 17km away, but they are asking me to pay for it.\n\nif 9km is far away then 17km should obviously be far enough. its a basic knowledge. But they just want me to pay for it by keeping the restaurant which is within 10km range, by not letting me order from there saying 'its too far away'.",
        "wym? \n\nhow come the screenshots of zomato saying, 'that restaurant is too far away to order' and you are speaking about restaurant getting closed? \n\nthey are not letting me order from a restaurant which is 9km away by saying that its too far away. but they are letting me order from the same restaurant chain but a different outlet which is 17km away, but asking me to pay for it. \n\nIf the first one isnt far away how come the 17km is so near that they can allow me to order. \n\nhow come you can compare whatever this post is about to whatever you are saying? it doesnt make any sense at all",
        "Well, your title says otherwise. I was responding to that.\n\nIn these cases, better create a text post putting in all the details, and add images inline in the description. That'll give everyone the clear picture.",
        "exactly. see how obvious what zomato is doing. and nobody really sees any kind of wrong in it. \n\nthey all act like they are superior to other ppl who compaints about other things  ad this user said  'average entitled indian consumer'\n\n ppl are very eager to discriminate others without having any brain cells to think.",
        "Are your serious,? I have already given an in line description about the issue i am facing in the 1st photo.  \n\n?? You read at all before commenting some irrelevant things?",
        "It does happen, some outlets doesn't cook some dishes. Happened with me in case of pizza hut",
        "That description is not visible in desktop web version of reddit.",
        "Oh I see",
        "If Gold deliveries are indeed free upto 10KM and that is stated in the Terms and Conditions then try messaging them with this screenshot and tell them you need a refund or something since they aren't honoring the promise.",
        "bro. are you even serious? how can you even rationalize things like this when someone is showing along with the proof of the app clearly saying 'the restaurant is far away'. \n\nand you come here and speak about individual dishes. LOL",
        "well its not my mistake isnt it? for someone to come and start irrationally advising a stranger when the first person doesnt even have the full context.? Good day",
        "you really think we can contact zomato that easily. if i have a lizard in my food or the food is spilled out or if i even receive a wrong order, you know how difficult it is to contact them? \n\nall we can do is speak to a bot. and an agent will be assigned and this agent wouldnt even ask anything. all they do at the end of the day is, sorry for the inconvenience, please take this 50rs coupon code you can use within the next month, to compensate for your struggle. and i am sitting here with a spilled 400rs dish  :(",
        "Twitter or daal do Bhai fir kuch hoga iska",
        "i will try to :)",
        "The practices these PPL use are so scummy 🤧",
        "Bruv i had this argument with ppl in several subs (indian_subs) and mostly all of them are defending these companies for some reason and I was so surprised that this is the peoples who we are with 😂\n\nThey cannot stand up for themselves, they think they know buisness calling it out (_oh they need to earn to, how would they earn_), some are just blind fans of zomato making memes on insta, and some are just complete idiots who say shit like _”its a premium luxury service you pay extra for”_\n\nat that point I realised we cannot do anything about these company charging literally anything without decency because we live in a place where half of folks are filled with these idiots 😂",
        "Got it. If you hate a company's service so much - stop giving them business.",
        "nice gyan"
    ],
    "cleaned_text": "zomato gold offers free deliveries asks us pay rant hows km outlet restaurant doesnt deliver km one zomato gold deliveries free upto km scummy ",
    "cleaned_title": "zomato gold offers free deliveries asks us pay rant",
    "cleaned_selftext": "hows km outlet restaurant doesnt deliver km one zomato gold deliveries free upto km scummy",
    "cleaned_comments": "idk man always worked check something wrong outlet closed everyone else try order new account see issue real scam closed closed clearly states far away deliver one even tho ready deliver delivery fee restaurant closed would say restaurant doesnt accept order currently switched online order currently wouldnt say whatever app says screenshot nothing wrong account zomato app seem operating maybe lot problems one face giving free deleivery even buy deliveries rupees whatever even support said didnt anything wrong cant properly compensate fuck zomato well tbh ive seen dominos outlet opening hours hrs totally normal think order free delivery offer totally normal people like letting slide like mehh totally normal lol well youre welcome protest average entitled indian consumer ordering food kms away oh man consumer buy premium version zomato called zomato gold gold membership deliveries within km range free cost delivery charges post zomato deliberately makes order restaurant km allowing buy food restaurant different outlet km away asking pay hope understand missing actually stating post letting order restaurant km away saying restaurant far away allowing restaurant chain different outlet km away asking pay km far away km obviously far enough basic knowledge want pay keeping restaurant within km range letting order saying far away wym come screenshots zomato saying restaurant far away order speaking restaurant getting closed letting order restaurant km away saying far away letting order restaurant chain different outlet km away asking pay first one isnt far away come km near allow order come compare whatever post whatever saying doesnt make sense well title says otherwise responding cases better create text post putting details add images inline description thatll give everyone clear picture exactly see obvious zomato nobody really sees kind wrong act like superior ppl compaints things ad user said average entitled indian consumer ppl eager discriminate others without brain cells think serious already given line description issue facing st photo read commenting irrelevant things happen outlets doesnt cook dishes happened case pizza hut description visible desktop web version reddit oh see gold deliveries indeed free upto km stated terms conditions try messaging screenshot tell need refund something since arent honoring promise bro even serious even rationalize things like someone showing along proof app clearly saying restaurant far away come speak individual dishes lol well mistake isnt someone come start irrationally advising stranger first person doesnt even full context good day really think contact zomato easily lizard food food spilled even receive wrong order know difficult contact speak bot agent assigned agent wouldnt even ask anything end day sorry inconvenience please take rs coupon code use within next month compensate struggle sitting spilled rs dish twitter daal bhai fir kuch hoga iska try practices ppl use scummy bruv argument ppl several subs indiansubs mostly defending companies reason surprised peoples stand think know buisness calling oh need earn would earn blind fans zomato making memes insta complete idiots say shit like premium luxury service pay extra point realised anything company charging literally anything without decency live place half folks filled idiots got hate companys service much stop giving business nice gyan",
    "light_cleaned_title": "Zomato Gold offers free deliveries but asks us to pay for it. Rant",
    "light_cleaned_selftext": "How's that a 9km outlet of the same restaurant doesn't deliver but a 17km one does? I have zomato Gold and the deliveries are free upto 10km. Very scummy.",
    "light_cleaned_comments": "idk man it’s always worked for me, check if something was wrong with that outlet and it closed for everyone else not just you, try to order from it on a new account to see if the issue is real or a scam \\> it closed its closed? it clearly states that it too far away to deliver while the other one is even tho further they are ready to deliver it for delivery fee. if a restaurant is closed it would say 'restaurant doesnt accept order currently or they switched off online order currently' it wouldnt say whatever the app says in as in the screenshot. nothing is wrong with my account or zomato app. this is how they seem to be operating. Maybe before, but now there are a lot of problems. The one I face is them not giving you free deleivery even if you buy their 6 deliveries for 40 rupees or whatever. Even their support said I didn't do anything wrong, and they can't properly compensate you. Fuck you zomato Well tbh I've seen some Domino's outlet opening 8 hours and some 24 hrs. So totally normal. I think your order has to be over 1500 for the free delivery offer this 🔝 it’s totally normal for people like this letting it slide and being like “mehh its totally normal” lol 😂 Well you're more than welcome to protest. Average entitled Indian consumer! Why are you ordering food from 17 kms away? oh man. a consumer can buy a premium version of the zomato called zomato gold. when you have Gold membership all the deliveries within 10km range are free of cost. No delivery charges. Now about the post. Zomato deliberately makes me not to order from a restaurant which is 9km while allowing me to buy food from the same restaurant but a different outlet which is 17km away by asking me to pay for it. I hope you can understand Are you missing what i was actually stating in the post? They are not letting me order from a restaurant which is 9km away saying that restaurant is far away. But they are allowing the same restaurant chain but a different outlet which 17km away, but they are asking me to pay for it. if 9km is far away then 17km should obviously be far enough. its a basic knowledge. But they just want me to pay for it by keeping the restaurant which is within 10km range, by not letting me order from there saying 'its too far away'. wym? how come the screenshots of zomato saying, 'that restaurant is too far away to order' and you are speaking about restaurant getting closed? they are not letting me order from a restaurant which is 9km away by saying that its too far away. but they are letting me order from the same restaurant chain but a different outlet which is 17km away, but asking me to pay for it. If the first one isnt far away how come the 17km is so near that they can allow me to order. how come you can compare whatever this post is about to whatever you are saying? it doesnt make any sense at all Well, your title says otherwise. I was responding to that. In these cases, better create a text post putting in all the details, and add images inline in the description. That'll give everyone the clear picture. exactly. see how obvious what zomato is doing. and nobody really sees any kind of wrong in it. they all act like they are superior to other ppl who compaints about other things ad this user said 'average entitled indian consumer' ppl are very eager to discriminate others without having any brain cells to think. Are your serious,? I have already given an in line description about the issue i am facing in the 1st photo. ?? You read at all before commenting some irrelevant things? It does happen, some outlets doesn't cook some dishes. Happened with me in case of pizza hut That description is not visible in desktop web version of reddit. Oh I see If Gold deliveries are indeed free upto 10KM and that is stated in the Terms and Conditions then try messaging them with this screenshot and tell them you need a refund or something since they aren't honoring the promise. bro. are you even serious? how can you even rationalize things like this when someone is showing along with the proof of the app clearly saying 'the restaurant is far away'. and you come here and speak about individual dishes. LOL well its not my mistake isnt it? for someone to come and start irrationally advising a stranger when the first person doesnt even have the full context.? Good day you really think we can contact zomato that easily. if i have a lizard in my food or the food is spilled out or if i even receive a wrong order, you know how difficult it is to contact them? all we can do is speak to a bot. and an agent will be assigned and this agent wouldnt even ask anything. all they do at the end of the day is, sorry for the inconvenience, please take this 50rs coupon code you can use within the next month, to compensate for your struggle. and i am sitting here with a spilled 400rs dish :( Twitter or daal do Bhai fir kuch hoga iska i will try to :) The practices these PPL use are so scummy 🤧 Bruv i had this argument with ppl in several subs (indian_subs) and mostly all of them are defending these companies for some reason and I was so surprised that this is the peoples who we are with 😂 They cannot stand up for themselves, they think they know buisness calling it out (_oh they need to earn to, how would they earn_), some are just blind fans of zomato making memes on insta, and some are just complete idiots who say shit like _”its a premium luxury service you pay extra for”_ at that point I realised we cannot do anything about these company charging literally anything without decency because we live in a place where half of folks are filled with these idiots 😂 Got it. If you hate a company's service so much - stop giving them business. nice gyan"
}