{
    "id": "1hh1wj3",
    "title": "Delhi court grants 7-day interim bail to Umar Khalid to attend cousin’s wedding",
    "url": "https://indianexpress.com/article/cities/delhi/2020-delhi-riots-conspiracy-case-umar-khalid-gets-7-day-interim-bail-9732059/?ref=hometop_hp",
    "selftext": "This is peanuts but at least a bit of time away from jail for him. ",
    "flair": "Law & Courts",
    "score": 639,
    "num_comments": 50,
    "created_utc": 1734529564.0,
    "convurl": "https://external-preview.redd.it/2XQ16zltU_oSEcZ0PIAScigfiZpj_nL1zINFtQnN3-c.jpg?auto=webp&s=5637a4d178faed7eb00acc473a2325d7ccdc4e7d",
    "comments": [
        "happy to see this, he shouldn't have been jailed in the first place",
        "True Indian fighting for India against fascism",
        "What an honour /s\nAt least he’ll get to breathe dirty free air",
        "In the new India only rapist and murders get bail immediately!! Justice is sold !!",
        "That one interview with Arnab before the deranged republic TV phase really twisted public opinion on this guy.",
        "Dear hindus , is he being held just because of his religion? Mostly yea and is this the raam rajya?",
        "Bet that the judge would be transferred unfortunately",
        "asking in the wrong sub",
        "Kkmobconibi:ivihihquhjko4xv6liii8\\8.9.9.¿0./&. P11j taQ5 9 in 8j",
        "Lol",
        "Stop generalizing, a lot of Hindu people supported him too, most of the people participating with him were also Hindu. So can we stop this relegion game please?",
        "Thank heavens. The Bhagat Singh of our era!",
        "There is a cat on reddit\n\nhttps://preview.redd.it/kdmr7d93km7e1.gif?width=600&format=png8&s=c7d158c6ab7a08936da74ca631ae19046bdc0070",
        "These parasites should be kept in solitary confinement.",
        "Why is everyone here supporting a convict who was involved in Delhi riots?",
        "Just like ranga and billa",
        " and Kapil sharma to gill danda khelne ke bare me bol raha tha?",
        "Show proof",
        "> Why is everyone here supporting a convict who was involved in Delhi riots?\n\n\n\nConvict???  How was he convicted when the trial hasn't happened? This is the whole problem with the voters, they make assumptions without knowing facts. \n\n> [Four years of Umar Khalid in prison without trial](https://indiatomorrow.net/2024/09/17/four-years-of-umar-khalid-in-prison-without-trial-civil-society-demands-his-release-the-documentary-prisoner-no-626710-is-present-gains-global-attention/)\n\n> A well-known student activist and researcher from Jawaharlal Nehru University (JNU), he has been in in Tihar Jail for four years without bail or trial. \n\n> Dr. Ilyas criticized the ongoing delays in the case, noting that even after four years, charges have yet to be framed. \n\n\nRead the damn article, they are proceeding with the case because it will fall apart. So they delay, and keep him imprisoned.",
        "Nah he is not",
        "You're right but I have watched his hate mongering speeches at JNU which were hurtful to watch as an Indian. I know he has been imprisoned without a trial but I would not feel bad for anyone who is a hate mongerer, rioter (who promotes damaging harmony and public property) and separatist. This is what I make of him from his public appearances and not by any political party statements. A bunch of JNU \"students\" rose to \"fame\" and started their political careers after those riots. If things worked out for him, he'd be a politician like Kanhaiya Kumar now. Nothing to do with his religion, I hate these anti-social elements equally. What happened with him was legally wrong but we have several things to worry about in this country where \"good\" people are wrongly framed and imprisoned.",
        "Lol hate Mongering. The hate mongering done by BJP doesn't hurt you yeah? If he is a criminal then prove it or shut the fuck up",
        "Why are you getting so defensive? I did not name any political party here coz I'm not a fan of anyone. My statement was on the person involved and the reason he is involved. I'm not here to play politics nor have political conversations. But people like you behave as if he's your dad or brother, lol! If you want proves on his hate mongering speeches, those are out in the public domain. Watch for yourself.",
        "Let’s hope he doesn’t run away. There should be constant monitoring of his movements.",
        "Quote an example of it then. And give full context and source.",
        "plot twist : he is the groom",
        "Delhi pollution will increase now",
        "Jail is exception, Bail is the norm \n\n\nOr so seems to be something the Supreme court said",
        "Hate mongering??\n\n[like this?](https://youtu.be/VhXd-A6-A8Q?si=PddQ09DZGBtSote6) \n\nOr [or something like this?](https://youtu.be/gN4keFMJpkQ?si=B37CZJIC4iI9VsBg)\n\nI am not someone who gets in political discussion but the words you used are just not fair.",
        "> I have watched his hate mongering speeches at JNU which were hurtful to watch as an Indian\n\nCan you share them here for us to watch as well?",
        "Yes",
        "Bro I get whatever he did or didn't do but we shouldn't be putting him in jail for this long",
        "Lol",
        "Judje Sahab aap idhar?",
        "Lmao 😂😂",
        "Order Order",
        "Was it a good interview?",
        "This is so sad !\nHe had got university admission in Germany n he didn’t take that as he wanted to stay in India !\n\nI had no idea he was still in jail !\n\nWhen rapists n murderers get bail !\n\nReally heartbreaking",
        "Source of hate mongering speeches?",
        "si swiggy lies, says 19 min but actually can't do it in 50 min. truth is swiggy lies just to try get attraction ni can he (indian) can't",
        "dimaag m kya h lawre? bhagat singh se iska compare kr rha ?",
        "awww priviledge wale log germany nahi ja paaye so sad....",
        "Let the poor guy just live!",
        "Bro ye subreddit pura muslim dominated hai kya?",
        "Haa bhai orr bohot saare pakistani bhi hai \nBc poora sub left hai",
        "Makes sense now",
        "what hindus have to do with this? india is secular country.",
        "Secular in books but practical you can lynch mulsims , kill sikhs and become MLA , MP based on that",
        "You would be a mp or mla even after killing hindus, that doesnt make this non secular, the power is with elected govt and not with people who follow a religion. better ask them instead of just yapping.",
        "PM called muslims citizens invaders, doesn’t matter what a 75 YO book says when the government has a different agenda."
    ],
    "cleaned_text": "delhi court grants day interim bail umar khalid attend cousins wedding peanuts least bit time away jail ",
    "cleaned_title": "delhi court grants day interim bail umar khalid attend cousins wedding",
    "cleaned_selftext": "peanuts least bit time away jail",
    "cleaned_comments": "happy see shouldnt jailed first place true indian fighting india fascism honour least hell get breathe dirty free air new india rapist murders get bail immediately justice sold one interview arnab deranged republic tv phase really twisted public opinion guy dear hindus held religion mostly yea raam rajya bet judge would transferred unfortunately asking wrong sub kkmobconibiivihihquhjkoxvliii pj taq j lol stop generalizing lot hindu people supported people participating also hindu stop relegion game please thank heavens bhagat singh era cat reddit parasites kept solitary confinement everyone supporting convict involved delhi riots like ranga billa kapil sharma gill danda khelne ke bare bol raha tha show proof everyone supporting convict involved delhi riots convict convicted trial hasnt happened whole problem voters make assumptions without knowing facts four years umar khalid prison without trialhttpsindiatomorrownetfouryearsofumarkhalidinprisonwithouttrialcivilsocietydemandshisreleasethedocumentaryprisonernoispresentgainsglobalattention wellknown student activist researcher jawaharlal nehru university jnu tihar jail four years without bail trial dr ilyas criticized ongoing delays case noting even four years charges yet framed read damn article proceeding case fall apart delay keep imprisoned nah youre right watched hate mongering speeches jnu hurtful watch indian know imprisoned without trial would feel bad anyone hate mongerer rioter promotes damaging harmony public property separatist make public appearances political party statements bunch jnu students rose fame started political careers riots things worked hed politician like kanhaiya kumar nothing religion hate antisocial elements equally happened legally wrong several things worry country good people wrongly framed imprisoned lol hate mongering hate mongering done bjp doesnt hurt yeah criminal prove shut fuck getting defensive name political party coz im fan anyone statement person involved reason involved im play politics political conversations people like behave hes dad brother lol want proves hate mongering speeches public domain watch lets hope doesnt run away constant monitoring movements quote example give full context source plot twist groom delhi pollution increase jail exception bail norm seems something supreme court said hate mongering like thishttpsyoutubevhxdaaqsipddqdzgbtsote something like thishttpsyoutubegnkefmjpkqsibczjiciivsbg someone gets political discussion words used fair watched hate mongering speeches jnu hurtful watch indian share us watch well yes bro get whatever didnt shouldnt putting jail long lol judje sahab aap idhar lmao order order good interview sad got university admission germany n didnt take wanted stay india idea still jail rapists n murderers get bail really heartbreaking source hate mongering speeches si swiggy lies says min actually cant min truth swiggy lies try get attraction ni indian cant dimaag kya h lawre bhagat singh se iska compare kr rha awww priviledge wale log germany nahi ja paaye sad let poor guy live bro ye subreddit pura muslim dominated hai kya haa bhai orr bohot saare pakistani bhi hai bc poora sub left hai makes sense hindus india secular country secular books practical lynch mulsims kill sikhs become mla mp based would mp mla even killing hindus doesnt make non secular power elected govt people follow religion better ask instead yapping pm called muslims citizens invaders doesnt matter yo book says government different agenda",
    "light_cleaned_title": "Delhi court grants 7-day interim bail to Umar Khalid to attend cousin’s wedding",
    "light_cleaned_selftext": "This is peanuts but at least a bit of time away from jail for him.",
    "light_cleaned_comments": "happy to see this, he shouldn't have been jailed in the first place True Indian fighting for India against fascism What an honour /s At least he’ll get to breathe dirty free air In the new India only rapist and murders get bail immediately!! Justice is sold !! That one interview with Arnab before the deranged republic TV phase really twisted public opinion on this guy. Dear hindus , is he being held just because of his religion? Mostly yea and is this the raam rajya? Bet that the judge would be transferred unfortunately asking in the wrong sub Kkmobconibi:ivihihquhjko4xv6liii8\\8.9.9.¿0./&. P11j taQ5 9 in 8j Lol Stop generalizing, a lot of Hindu people supported him too, most of the people participating with him were also Hindu. So can we stop this relegion game please? Thank heavens. The Bhagat Singh of our era! There is a cat on reddit These parasites should be kept in solitary confinement. Why is everyone here supporting a convict who was involved in Delhi riots? Just like ranga and billa and Kapil sharma to gill danda khelne ke bare me bol raha tha? Show proof > Why is everyone here supporting a convict who was involved in Delhi riots? Convict??? How was he convicted when the trial hasn't happened? This is the whole problem with the voters, they make assumptions without knowing facts. > [Four years of Umar Khalid in prison without trial](https://indiatomorrow.net/2024/09/17/four-years-of-umar-khalid-in-prison-without-trial-civil-society-demands-his-release-the-documentary-prisoner-no-626710-is-present-gains-global-attention/) > A well-known student activist and researcher from Jawaharlal Nehru University (JNU), he has been in in Tihar Jail for four years without bail or trial. > Dr. Ilyas criticized the ongoing delays in the case, noting that even after four years, charges have yet to be framed. Read the damn article, they are proceeding with the case because it will fall apart. So they delay, and keep him imprisoned. Nah he is not You're right but I have watched his hate mongering speeches at JNU which were hurtful to watch as an Indian. I know he has been imprisoned without a trial but I would not feel bad for anyone who is a hate mongerer, rioter (who promotes damaging harmony and public property) and separatist. This is what I make of him from his public appearances and not by any political party statements. A bunch of JNU \"students\" rose to \"fame\" and started their political careers after those riots. If things worked out for him, he'd be a politician like Kanhaiya Kumar now. Nothing to do with his religion, I hate these anti-social elements equally. What happened with him was legally wrong but we have several things to worry about in this country where \"good\" people are wrongly framed and imprisoned. Lol hate Mongering. The hate mongering done by BJP doesn't hurt you yeah? If he is a criminal then prove it or shut the fuck up Why are you getting so defensive? I did not name any political party here coz I'm not a fan of anyone. My statement was on the person involved and the reason he is involved. I'm not here to play politics nor have political conversations. But people like you behave as if he's your dad or brother, lol! If you want proves on his hate mongering speeches, those are out in the public domain. Watch for yourself. Let’s hope he doesn’t run away. There should be constant monitoring of his movements. Quote an example of it then. And give full context and source. plot twist : he is the groom Delhi pollution will increase now Jail is exception, Bail is the norm Or so seems to be something the Supreme court said Hate mongering?? [like this?](https://youtu.be/VhXd-A6-A8Q?si=PddQ09DZGBtSote6) Or [or something like this?](https://youtu.be/gN4keFMJpkQ?si=B37CZJIC4iI9VsBg) I am not someone who gets in political discussion but the words you used are just not fair. > I have watched his hate mongering speeches at JNU which were hurtful to watch as an Indian Can you share them here for us to watch as well? Yes Bro I get whatever he did or didn't do but we shouldn't be putting him in jail for this long Lol Judje Sahab aap idhar? Lmao 😂😂 Order Order Was it a good interview? This is so sad ! He had got university admission in Germany n he didn’t take that as he wanted to stay in India ! I had no idea he was still in jail ! When rapists n murderers get bail ! Really heartbreaking Source of hate mongering speeches? si swiggy lies, says 19 min but actually can't do it in 50 min. truth is swiggy lies just to try get attraction ni can he (indian) can't dimaag m kya h lawre? bhagat singh se iska compare kr rha ? awww priviledge wale log germany nahi ja paaye so sad.... Let the poor guy just live! Bro ye subreddit pura muslim dominated hai kya? Haa bhai orr bohot saare pakistani bhi hai Bc poora sub left hai Makes sense now what hindus have to do with this? india is secular country. Secular in books but practical you can lynch mulsims , kill sikhs and become MLA , MP based on that You would be a mp or mla even after killing hindus, that doesnt make this non secular, the power is with elected govt and not with people who follow a religion. better ask them instead of just yapping. PM called muslims citizens invaders, doesn’t matter what a 75 YO book says when the government has a different agenda."
}