{
    "id": "1519bwy",
    "title": "My son has a YouTube channel and I want him to stop doing this .",
    "url": "https://www.reddit.com/r/india/comments/1519bwy/my_son_has_a_youtube_channel_and_i_want_him_to/",
    "selftext": "Hello everybody, my son is 20 year old and is currently pursuing graduation . His results of each semester is not great and it is not what I expect from my son. He just waste his time on YouTube . He has a channel in which he makes some videos . https://youtube.com/@PesPlaymaker\nHe currently have 300 subscriber and he told me that he will get 10k subscribers by end of this year . Well I don't believe him and I just want to ask if you could tell me how to make him understand that it is not important and how  tell him to stay focused in his career .\nThanks for reading .",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689521865.0,
    "convurl": "https://external-preview.redd.it/3jNkMVAGEzZV9zHLLc5I4E7TsrwKl0jqiU547TAkuCE.jpg?auto=webp&s=ad581299942cfbae5ecdab94e609995ca5384f5c",
    "comments": [
        "You should suggest him to balance both studies and video gaming and not outright banning video games.\nVideos games can be more than time waste.\nOnly few people are passionate about things these days, if he believes he will achieve it then don't shut him off",
        "I feel like this post is about to go down coz people are gonna comment on your son's youtube channel mentioning \"tere baap tera football band karna chatha hai\" xddd"
    ],
    "cleaned_text": "son youtube channel want stop hello everybody son year old currently pursuing graduation results semester great expect son waste time youtube channel makes videos currently subscriber told get k subscribers end year well dont believe want ask could tell make understand important tell stay focused career thanks reading ",
    "cleaned_title": "son youtube channel want stop",
    "cleaned_selftext": "hello everybody son year old currently pursuing graduation results semester great expect son waste time youtube channel makes videos currently subscriber told get k subscribers end year well dont believe want ask could tell make understand important tell stay focused career thanks reading",
    "cleaned_comments": "suggest balance studies video gaming outright banning video games videos games time waste people passionate things days believes achieve dont shut feel like post go coz people gon na comment sons youtube channel mentioning tere baap tera football band karna chatha hai xddd",
    "light_cleaned_title": "My son has a YouTube channel and I want him to stop doing this .",
    "light_cleaned_selftext": "Hello everybody, my son is 20 year old and is currently pursuing graduation . His results of each semester is not great and it is not what I expect from my son. He just waste his time on YouTube . He has a channel in which he makes some videos . He currently have 300 subscriber and he told me that he will get 10k subscribers by end of this year . Well I don't believe him and I just want to ask if you could tell me how to make him understand that it is not important and how tell him to stay focused in his career . Thanks for reading .",
    "light_cleaned_comments": "You should suggest him to balance both studies and video gaming and not outright banning video games. Videos games can be more than time waste. Only few people are passionate about things these days, if he believes he will achieve it then don't shut him off I feel like this post is about to go down coz people are gonna comment on your son's youtube channel mentioning \"tere baap tera football band karna chatha hai\" xddd"
}