{
    "id": "1cy0bel",
    "title": "Govt successfully met peak power demand in Delhi without outages: Atishi",
    "url": "https://www.hindustantimes.com/india-news/govt-successfully-met-peak-power-demand-in-delhi-without-outages-atishi-101716383322361.html",
    "selftext": "\"Maybe Delhi is the only state that gives 24-hour electricity. In the last three days when the heatwave has been intense, neighbouring cities have seen long power cuts. In Greater Noida housing societies, more than four hours of outages were reported. There were eight-hour-long power cuts in many sectors in Noida. In many areas of Ghaziabad there were six-hour long power cuts on May 21 and May 22,\" she alleged.\n\nShe claimed that there were 14-hour-long power cuts in Loni. Even in Gurugram, there were power cuts, she said, adding that the BJP-ruled states have been witnessing power cuts.\n\n\"That is why BJP is fed up with Delhi Chief Minister Arvind Kejriwal. He had promised 24 hours power supply to Delhiites.",
    "flair": "Policy/Economy",
    "score": 121,
    "num_comments": 17,
    "created_utc": 1716384704.0,
    "convurl": "https://external-preview.redd.it/jER7sNrZqenhgse-E3DeXyRdgQHVemHBRuX-uE65nWQ.jpg",
    "comments": [
        "I’d agree, I haven’t been experiencing any outages or cuts more than a couple of mins.\n\nBut, the AAP Sarkar in Punjab is royally faltering in Thai department in Punjab.",
        "Assam here, the powercuts are insanely true for someone (Himanta Biswa Sharma) that thumps his chest all the time on twitter against Kejriwal for Modi.",
        "Yeah same in UP. 2 hour power cut from past three days.    Previously I didn't had any major  power cut from past 3 years..!",
        "The last power cut in my society in Delhi was 12 years ago when the entire northern grid failed ( a few cuts here and there but those were maintenance cuts) . Tbh I forgot power cuts are still a thing till I came across this article",
        "Is that when the metro also stopped?",
        "Yes, found an article that explains this [issue](https://medium.com/clean-energy-for-billions/indian-blackouts-of-july-2012-what-happened-and-why-639e31fb52ad)",
        "That’s insane. I lived in a newly developed society in Gurugram for a couple of months during the summer of 2022 and there were two occasions where the power for the entire community was disrupted for 36-48 hours straight. We were living on generator electricity for that entire time which costs an insane amount. Felt like I was back to the Stone Age. Told my parents to sell that property and buy something away from Gurugram. They eventually sold and bought a house in Chandigarh.",
        "This is true. I have not purchased inverter/battery after 2014",
        "On the other hand, I live in Chattarpur, Delhi. There is a powercut for 3-4 hours almost everyday.\n\nIf you go to BSES website and check the outage schedule, you'll see that there is a scheduled outage for transformer maintanence, I have been living in Chattarpur and Neb Sarai area for 5 years now, and this is a common thing for power cuts.",
        "Punjab when?? Same ruling party so...",
        "Hyderabad and probably other parts of Telangana used to have almost guaranteed 24 hour power until this year",
        "Thai Department?",
        "From pune, live near the airport.\n\nPower cut is frequent phenomenon and happens as soon as there is rain or thunder.\n\nSociety does not have power backup.\n\nCry every time I see rain.",
        "*This",
        "Shifted from Delhi to Gurgaon last year \n\nWorst decision of my life... experiencing power cuts since 2 weeks"
    ],
    "cleaned_text": "govt successfully met peak power demand delhi without outages atishi maybe delhi state gives hour electricity last three days heatwave intense neighbouring cities seen long power cuts greater noida housing societies four hours outages reported eighthourlong power cuts many sectors noida many areas ghaziabad sixhour long power cuts may may alleged claimed hourlong power cuts loni even gurugram power cuts said adding bjpruled states witnessing power cuts bjp fed delhi chief minister arvind kejriwal promised hours power supply delhiites ",
    "cleaned_title": "govt successfully met peak power demand delhi without outages atishi",
    "cleaned_selftext": "maybe delhi state gives hour electricity last three days heatwave intense neighbouring cities seen long power cuts greater noida housing societies four hours outages reported eighthourlong power cuts many sectors noida many areas ghaziabad sixhour long power cuts may may alleged claimed hourlong power cuts loni even gurugram power cuts said adding bjpruled states witnessing power cuts bjp fed delhi chief minister arvind kejriwal promised hours power supply delhiites",
    "cleaned_comments": "id agree havent experiencing outages cuts couple mins aap sarkar punjab royally faltering thai department punjab assam powercuts insanely true someone himanta biswa sharma thumps chest time twitter kejriwal modi yeah hour power cut past three days previously didnt major power cut past years last power cut society delhi years ago entire northern grid failed cuts maintenance cuts tbh forgot power cuts still thing till came across article metro also stopped yes found article explains issuehttpsmediumcomcleanenergyforbillionsindianblackoutsofjulywhathappenedandwhyefbad thats insane lived newly developed society gurugram couple months summer two occasions power entire community disrupted hours straight living generator electricity entire time costs insane amount felt like back stone age told parents sell property buy something away gurugram eventually sold bought house chandigarh true purchased inverterbattery hand live chattarpur delhi powercut hours almost everyday go bses website check outage schedule youll see scheduled outage transformer maintanence living chattarpur neb sarai area years common thing power cuts punjab ruling party hyderabad probably parts telangana used almost guaranteed hour power year thai department pune live near airport power cut frequent phenomenon happens soon rain thunder society power backup cry every time see rain shifted delhi gurgaon last year worst decision life experiencing power cuts since weeks",
    "light_cleaned_title": "Govt successfully met peak power demand in Delhi without outages: Atishi",
    "light_cleaned_selftext": "\"Maybe Delhi is the only state that gives 24-hour electricity. In the last three days when the heatwave has been intense, neighbouring cities have seen long power cuts. In Greater Noida housing societies, more than four hours of outages were reported. There were eight-hour-long power cuts in many sectors in Noida. In many areas of Ghaziabad there were six-hour long power cuts on May 21 and May 22,\" she alleged. She claimed that there were 14-hour-long power cuts in Loni. Even in Gurugram, there were power cuts, she said, adding that the BJP-ruled states have been witnessing power cuts. \"That is why BJP is fed up with Delhi Chief Minister Arvind Kejriwal. He had promised 24 hours power supply to Delhiites.",
    "light_cleaned_comments": "I’d agree, I haven’t been experiencing any outages or cuts more than a couple of mins. But, the AAP Sarkar in Punjab is royally faltering in Thai department in Punjab. Assam here, the powercuts are insanely true for someone (Himanta Biswa Sharma) that thumps his chest all the time on twitter against Kejriwal for Modi. Yeah same in UP. 2 hour power cut from past three days. Previously I didn't had any major power cut from past 3 years..! The last power cut in my society in Delhi was 12 years ago when the entire northern grid failed ( a few cuts here and there but those were maintenance cuts) . Tbh I forgot power cuts are still a thing till I came across this article Is that when the metro also stopped? Yes, found an article that explains this [issue](https://medium.com/clean-energy-for-billions/indian-blackouts-of-july-2012-what-happened-and-why-639e31fb52ad) That’s insane. I lived in a newly developed society in Gurugram for a couple of months during the summer of 2022 and there were two occasions where the power for the entire community was disrupted for 36-48 hours straight. We were living on generator electricity for that entire time which costs an insane amount. Felt like I was back to the Stone Age. Told my parents to sell that property and buy something away from Gurugram. They eventually sold and bought a house in Chandigarh. This is true. I have not purchased inverter/battery after 2014 On the other hand, I live in Chattarpur, Delhi. There is a powercut for 3-4 hours almost everyday. If you go to BSES website and check the outage schedule, you'll see that there is a scheduled outage for transformer maintanence, I have been living in Chattarpur and Neb Sarai area for 5 years now, and this is a common thing for power cuts. Punjab when?? Same ruling party so... Hyderabad and probably other parts of Telangana used to have almost guaranteed 24 hour power until this year Thai Department? From pune, live near the airport. Power cut is frequent phenomenon and happens as soon as there is rain or thunder. Society does not have power backup. Cry every time I see rain. *This Shifted from Delhi to Gurgaon last year Worst decision of my life... experiencing power cuts since 2 weeks"
}