{
    "id": "15uhjsd",
    "title": "Almost Half of Americans See Automation Replacing Their Jobs. Are Indians or at least urban Indians equally worried? I don't think so.",
    "url": "https://www.reddit.com/r/india/comments/15uhjsd/almost_half_of_americans_see_automation_replacing/",
    "selftext": " Does the government of India, have any plans to tackle the enormous wave of Automation and AI that is coming our way?\n\n[https://www.bnnbloomberg.ca/almost-half-of-americans-see-automation-replacing-their-jobs-1.1960170](https://www.bnnbloomberg.ca/almost-half-of-americans-see-automation-replacing-their-jobs-1.1960170)\n\nThis is all just a matter of when and not if anymore. The rate of progression of tasks being achieved and surpassed already should be worrying. [Hollywood strikes](https://variety.com/2023/biz/news/sag-aftra-background-actors-artificial-intelligence-1235673432/), [MedPalm in hospitals](https://economictimes.indiatimes.com/magazines/panache/ai-in-healthcare-googles-med-palm-2-chatbot-enters-testing-phase-in-us-hospitals/articleshow/101637840.cms), AI is already disrupting significant industries.  \nChina is again proactive and spending billions to upgrade the infrastructure that will lead the way of the future, despite the US trade war. Is India doing anything to ensure this wave doesn't hit us as a surprise?\n\nMost of India's exports, or any growing economy, are things that the first world countries don't want to do. Be it IT support, low/no patent high volume pharmaceutical drugs manufacturing. And when (**not if**) automation supersedes the cost of cheap labor in developed countries. What sort of aftershocks are we looking at? And not to mention, when the same wave happens in our own country for manufacturing.\n\nI AM TERRIFIED!!",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692357003.0,
    "convurl": "https://external-preview.redd.it/vxcyd5o9ES5tGug_TalH_jRHhHyn0MvNki0DBKmyRnA.jpg?auto=webp&s=54c52e80b93372bc5ec13fe0337128246fe3fb74",
    "comments": [
        "No one's worried. But when the shit hits the fan, I know they'll all blame the Muslims for it.",
        "AI Jihad! Reeeeee!",
        "Or nehru",
        "Can’t replace what doesn’t exists",
        "Smort",
        "Can't replace jobs that you don't have/can't create. At the same time, having a huge surplus of young, uneducated but unemployed men is not going to end well for India. Demographic dividend my ass lol",
        "It does seem gloomy ahead",
        "We have a lift operator in a lift here , the point of lifts, it's automation yet in India we still have lift operators",
        "OP, don’t panic.\n\nIt’s too soon to say anything. According to what my cousin, who works in ML for Google ,says, you will see a lot of articles hyping up AI and exaggerating a lot of tasks done by AI systems, to attract more funding into their projects etc",
        "The only way Google's AI doesn't replace me as a coder is if they deliberately dumb it down. It currently does almost 50% of my coding tasks, just the hardware scaling in a couple of years would make me irrelevant.",
        "So you’re saying that the AI automatically does 50 % of your coding tasks without any aid or prompts ?",
        "Well obviously you wanted to make some point. So just make that. And to your prev comments, those prompts can be written by a non-coder as well.",
        "No I am just trying to understand if AI can code on its own or if it needs prompts and guidance from someone else",
        "Very little prompting is required. And whatever currently is required, won't be soon enough. Hence the fear. The clients will soon have access to a model, that'll act as a developer, and just talk the requirement out with the model. I need an e-commerce site to do this and that. And a day or two later it's done. No managers, no developers, no nothing Very rudimentary models already exists. , [https://www.wix.com/](https://www.wix.com/),"
    ],
    "cleaned_text": "almost half americans see automation replacing jobs indians least urban indians equally worried dont think government india plans tackle enormous wave automation ai coming way httpswwwbnnbloombergcaalmosthalfofamericansseeautomationreplacingtheirjobshttpswwwbnnbloombergcaalmosthalfofamericansseeautomationreplacingtheirjobs matter anymore rate progression tasks achieved surpassed already worrying hollywood strikeshttpsvarietycombiznewssagaftrabackgroundactorsartificialintelligence medpalm hospitalshttpseconomictimesindiatimescommagazinespanacheaiinhealthcaregooglesmedpalmchatbotenterstestingphaseinushospitalsarticleshowcms ai already disrupting significant industries china proactive spending billions upgrade infrastructure lead way future despite us trade war india anything ensure wave doesnt hit us surprise indias exports growing economy things first world countries dont want support lowno patent high volume pharmaceutical drugs manufacturing automation supersedes cost cheap labor developed countries sort aftershocks looking mention wave happens country manufacturing terrified ",
    "cleaned_title": "almost half americans see automation replacing jobs indians least urban indians equally worried dont think",
    "cleaned_selftext": "government india plans tackle enormous wave automation ai coming way httpswwwbnnbloombergcaalmosthalfofamericansseeautomationreplacingtheirjobshttpswwwbnnbloombergcaalmosthalfofamericansseeautomationreplacingtheirjobs matter anymore rate progression tasks achieved surpassed already worrying hollywood strikeshttpsvarietycombiznewssagaftrabackgroundactorsartificialintelligence medpalm hospitalshttpseconomictimesindiatimescommagazinespanacheaiinhealthcaregooglesmedpalmchatbotenterstestingphaseinushospitalsarticleshowcms ai already disrupting significant industries china proactive spending billions upgrade infrastructure lead way future despite us trade war india anything ensure wave doesnt hit us surprise indias exports growing economy things first world countries dont want support lowno patent high volume pharmaceutical drugs manufacturing automation supersedes cost cheap labor developed countries sort aftershocks looking mention wave happens country manufacturing terrified",
    "cleaned_comments": "ones worried shit hits fan know theyll blame muslims ai jihad reeeeee nehru cant replace doesnt exists smort cant replace jobs dont havecant create time huge surplus young uneducated unemployed men going end well india demographic dividend ass lol seem gloomy ahead lift operator lift point lifts automation yet india still lift operators op dont panic soon say anything according cousin works ml google says see lot articles hyping ai exaggerating lot tasks done ai systems attract funding projects etc way googles ai doesnt replace coder deliberately dumb currently almost coding tasks hardware scaling couple years would make irrelevant youre saying ai automatically coding tasks without aid prompts well obviously wanted make point make prev comments prompts written noncoder well trying understand ai code needs prompts guidance someone else little prompting required whatever currently required wont soon enough hence fear clients soon access model thatll act developer talk requirement model need ecommerce site day two later done managers developers nothing rudimentary models already exists httpswwwwixcomhttpswwwwixcom",
    "light_cleaned_title": "Almost Half of Americans See Automation Replacing Their Jobs. Are Indians or at least urban Indians equally worried? I don't think so.",
    "light_cleaned_selftext": "Does the government of India, have any plans to tackle the enormous wave of Automation and AI that is coming our way? [https://www.bnnbloomberg.ca/almost-half-of-americans-see-automation-replacing-their-jobs-1.1960170](https://www.bnnbloomberg.ca/almost-half-of-americans-see-automation-replacing-their-jobs-1.1960170) This is all just a matter of when and not if anymore. The rate of progression of tasks being achieved and surpassed already should be worrying. [Hollywood strikes](https://variety.com/2023/biz/news/sag-aftra-background-actors-artificial-intelligence-1235673432/), [MedPalm in hospitals](https://economictimes.indiatimes.com/magazines/panache/ai-in-healthcare-googles-med-palm-2-chatbot-enters-testing-phase-in-us-hospitals/articleshow/101637840.cms), AI is already disrupting significant industries. China is again proactive and spending billions to upgrade the infrastructure that will lead the way of the future, despite the US trade war. Is India doing anything to ensure this wave doesn't hit us as a surprise? Most of India's exports, or any growing economy, are things that the first world countries don't want to do. Be it IT support, low/no patent high volume pharmaceutical drugs manufacturing. And when (**not if**) automation supersedes the cost of cheap labor in developed countries. What sort of aftershocks are we looking at? And not to mention, when the same wave happens in our own country for manufacturing. I AM TERRIFIED!!",
    "light_cleaned_comments": "No one's worried. But when the shit hits the fan, I know they'll all blame the Muslims for it. AI Jihad! Reeeeee! Or nehru Can’t replace what doesn’t exists Smort Can't replace jobs that you don't have/can't create. At the same time, having a huge surplus of young, uneducated but unemployed men is not going to end well for India. Demographic dividend my ass lol It does seem gloomy ahead We have a lift operator in a lift here , the point of lifts, it's automation yet in India we still have lift operators OP, don’t panic. It’s too soon to say anything. According to what my cousin, who works in ML for Google ,says, you will see a lot of articles hyping up AI and exaggerating a lot of tasks done by AI systems, to attract more funding into their projects etc The only way Google's AI doesn't replace me as a coder is if they deliberately dumb it down. It currently does almost 50% of my coding tasks, just the hardware scaling in a couple of years would make me irrelevant. So you’re saying that the AI automatically does 50 % of your coding tasks without any aid or prompts ? Well obviously you wanted to make some point. So just make that. And to your prev comments, those prompts can be written by a non-coder as well. No I am just trying to understand if AI can code on its own or if it needs prompts and guidance from someone else Very little prompting is required. And whatever currently is required, won't be soon enough. Hence the fear. The clients will soon have access to a model, that'll act as a developer, and just talk the requirement out with the model. I need an e-commerce site to do this and that. And a day or two later it's done. No managers, no developers, no nothing Very rudimentary models already exists. , [https://www.wix.com/](https://www.wix.com/),"
}