{
    "id": "1cixq4o",
    "title": "Raj Bhavan employee accuses West Bengal Governor of sexual harassment",
    "url": "https://www.thehindu.com/news/national/west-bengal/raj-bhavan-employee-accuses-west-bengal-governor-of-sexual-harassment/article68133002.ece/amp/",
    "selftext": "Scandal, Sex scandal everywhere.",
    "flair": "Crime",
    "score": 271,
    "num_comments": 19,
    "created_utc": 1714703289.0,
    "convurl": "https://external-preview.redd.it/BJTFcNAwHpad5Nks__AejUTCjx9vNN3GYeSucL-yY5A.jpg?auto=webp&s=31622bb5a101466b90a26bb34804e2866eb4bdb9",
    "comments": [
        "ot just that, he even bared the entry of police into Raj Bhavan premises.",
        "From Indian Express: \n\n\n>In a statement issued Thursday night, Raj Bhawan hit back at the minister: “For defamation and anti-constitutional media statements against the Governor… Chandrima Bhattacharya has been banned (from) entry into the Raj Bhavan premises of Kolkata, Darjeeling and Barrackpore. The Governor has also instructed that he will not participate in any function attended by the Minister. The Attorney General of India has been contacted for advice on further legal steps against the Minister.”\n\n\n>The governor also banned the entry of police into Raj Bhavan premises under the guise of “conducting unauthorised, illegitimate, sham and motivated ‘investigation’ to placate political bosses during elections,” the statement added.\n\n\nhttps://indianexpress.com/article/cities/kolkata/west-bengal-governor-cv-ananda-bose-molestation-complaint-9304077/\n\n\nThe shit-show starts....",
        "I know this is democracy falling apart but good to see venom being fought with venom",
        "Another sexual assault/harassment news? Come on say something about something more important like where mudizi is going to sit next for his meditation man",
        "Almost always sex scandals are power abuse. It tells that perpetrators feel that they are not accountable in the eyes of law. \n\nIt is not about sex, it is about power.",
        "WB should withdraw all its police personnel from all places near the Raj Bhawan and watch the Governor \"panicking\".",
        "Bengal is turning into rape capital of India. First Sandeshkali where Mamata Banerji asked victims to solve matter with rapists and now this.",
        "Banning entry of police, guy is for sure hiding his intentions. Wouldn’t the Raj Bhavan be full of cctv cameras and I don’t think anyone would meet in the bedroom. \n\nSo is this all a distraction to erase the evidence !!",
        "fake cases are rampant in West Bengal. \n\nElection time.",
        "I get what you mean by that. A crime against women is always a crime. All of them should get justice. But i don't think \"*Bengal is turning into rape capital of India.*\"\n\n\n>Bengal stand in fourth position with 35,884 cases of crime against women last year. \n\n\n\n>The rate of rape cases (one case registered per one lakh women population) was the least in Kolkata (0.2), followed by Chennai (1.0) and Coimbatore (1.1).\n\n\nSource: https://thewire.in/women/crimes-against-women-rape-cases-india-2021-ncrb-data\n\n\n\nAnd fuck Mamata for saying that. She is no different than Brij Bhushan. Mfs are always blaming the victim.",
        "Exactly in both cases it was the victim blaming.",
        "what is wrong with this bjp party..... all of them are predators ? ..and this guy toh even looks like one!",
        "Sanghi Governors are perverts who assault/manipulate women sexually.\n\nThere was a Governor in TN, who used a university Lecturer to supply college girls in exchange for her posting. Girls recorded the audio and released it. The governor went silent after that and they changed the governor so people forgot.\n\nRecently the lecturer was convicted but the top official (open secret that it is the governor) is free. \n\nhttps://www.deccanherald.com/india/tamil-nadu/mku-sex-scandal-convicted-nirmala-devi-sentenced-to-10-years-of-imprisonment-over-trafficking-girls-for-sexual-favours-3001992",
        "Please don't include looks here. Any person can be a devil.",
        "Even assuming if you are right, why would he run away from investigation? Face them boldly. \nUnless you are talking about Delhi based fake cases like Kejriwal",
        "Who is running away ?"
    ],
    "cleaned_text": "raj bhavan employee accuses west bengal governor sexual harassment scandal sex scandal everywhere ",
    "cleaned_title": "raj bhavan employee accuses west bengal governor sexual harassment",
    "cleaned_selftext": "scandal sex scandal everywhere",
    "cleaned_comments": "ot even bared entry police raj bhavan premises indian express statement issued thursday night raj bhawan hit back minister defamation anticonstitutional media statements governor chandrima bhattacharya banned entry raj bhavan premises kolkata darjeeling barrackpore governor also instructed participate function attended minister attorney general india contacted advice legal steps minister governor also banned entry police raj bhavan premises guise conducting unauthorised illegitimate sham motivated investigation placate political bosses elections statement added shitshow starts know democracy falling apart good see venom fought venom another sexual assaultharassment news come say something something important like mudizi going sit next meditation man almost always sex scandals power abuse tells perpetrators feel accountable eyes law sex power wb withdraw police personnel places near raj bhawan watch governor panicking bengal turning rape capital india first sandeshkali mamata banerji asked victims solve matter rapists banning entry police guy sure hiding intentions wouldnt raj bhavan full cctv cameras dont think anyone would meet bedroom distraction erase evidence fake cases rampant west bengal election time get mean crime women always crime get justice dont think bengal turning rape capital india bengal stand fourth position cases crime women last year rate rape cases one case registered per one lakh women population least kolkata followed chennai coimbatore source fuck mamata saying different brij bhushan mfs always blaming victim exactly cases victim blaming wrong bjp party predators guy toh even looks like one sanghi governors perverts assaultmanipulate women sexually governor tn used university lecturer supply college girls exchange posting girls recorded audio released governor went silent changed governor people forgot recently lecturer convicted top official open secret governor free please dont include looks person devil even assuming right would run away investigation face boldly unless talking delhi based fake cases like kejriwal running away",
    "light_cleaned_title": "Raj Bhavan employee accuses West Bengal Governor of sexual harassment",
    "light_cleaned_selftext": "Scandal, Sex scandal everywhere.",
    "light_cleaned_comments": "ot just that, he even bared the entry of police into Raj Bhavan premises. From Indian Express: >In a statement issued Thursday night, Raj Bhawan hit back at the minister: “For defamation and anti-constitutional media statements against the Governor… Chandrima Bhattacharya has been banned (from) entry into the Raj Bhavan premises of Kolkata, Darjeeling and Barrackpore. The Governor has also instructed that he will not participate in any function attended by the Minister. The Attorney General of India has been contacted for advice on further legal steps against the Minister.” >The governor also banned the entry of police into Raj Bhavan premises under the guise of “conducting unauthorised, illegitimate, sham and motivated ‘investigation’ to placate political bosses during elections,” the statement added. The shit-show starts.... I know this is democracy falling apart but good to see venom being fought with venom Another sexual assault/harassment news? Come on say something about something more important like where mudizi is going to sit next for his meditation man Almost always sex scandals are power abuse. It tells that perpetrators feel that they are not accountable in the eyes of law. It is not about sex, it is about power. WB should withdraw all its police personnel from all places near the Raj Bhawan and watch the Governor \"panicking\". Bengal is turning into rape capital of India. First Sandeshkali where Mamata Banerji asked victims to solve matter with rapists and now this. Banning entry of police, guy is for sure hiding his intentions. Wouldn’t the Raj Bhavan be full of cctv cameras and I don’t think anyone would meet in the bedroom. So is this all a distraction to erase the evidence !! fake cases are rampant in West Bengal. Election time. I get what you mean by that. A crime against women is always a crime. All of them should get justice. But i don't think \"*Bengal is turning into rape capital of India.*\" >Bengal stand in fourth position with 35,884 cases of crime against women last year. >The rate of rape cases (one case registered per one lakh women population) was the least in Kolkata (0.2), followed by Chennai (1.0) and Coimbatore (1.1). Source: And fuck Mamata for saying that. She is no different than Brij Bhushan. Mfs are always blaming the victim. Exactly in both cases it was the victim blaming. what is wrong with this bjp party..... all of them are predators ? ..and this guy toh even looks like one! Sanghi Governors are perverts who assault/manipulate women sexually. There was a Governor in TN, who used a university Lecturer to supply college girls in exchange for her posting. Girls recorded the audio and released it. The governor went silent after that and they changed the governor so people forgot. Recently the lecturer was convicted but the top official (open secret that it is the governor) is free. Please don't include looks here. Any person can be a devil. Even assuming if you are right, why would he run away from investigation? Face them boldly. Unless you are talking about Delhi based fake cases like Kejriwal Who is running away ?"
}