{
    "id": "1ehljyx",
    "title": "Indians bad attitude and civic senses. No respect for country.",
    "url": "https://youtu.be/yJORlECPxNE?si=V60Ja8Q6Oo0jc9HY",
    "selftext": "Your doctors and health gurus advice you to not take stress and all that but it's just impossible in this country. You wake up fresh in the morning and get ready to go to work with a good mood but half of your energy for the day gets drained in the commute itself..no matter private or public transport. This 'adjust karlo' attitude needs to go. ",
    "flair": "Rant / Vent",
    "score": 8,
    "num_comments": 1,
    "created_utc": 1722531051.0,
    "convurl": "https://external-preview.redd.it/UfeK-AGpD--T2dxdSfkTLbJSyxa0KIiS_kAzRqgVS2k.jpg?auto=webp&s=c1258bf81dde9690aec9fa5e989a5e6b6c8dd6c2",
    "comments": [
        "Ye india me har jagah ka situation hai.\nMan karta hai utarke ek ek ko 4-5 laafa laga du…\nPata nahi kya soch k opposite lane se overtake karte hai.. sach me unpadh gawar log bhare hai desh me…"
    ],
    "cleaned_text": "indians bad attitude civic senses respect country doctors health gurus advice take stress impossible country wake fresh morning get ready go work good mood half energy day gets drained commute itselfno matter private public transport adjust karlo attitude needs go ",
    "cleaned_title": "indians bad attitude civic senses respect country",
    "cleaned_selftext": "doctors health gurus advice take stress impossible country wake fresh morning get ready go work good mood half energy day gets drained commute itselfno matter private public transport adjust karlo attitude needs go",
    "cleaned_comments": "ye india har jagah ka situation hai man karta hai utarke ek ek ko laafa laga du pata nahi kya soch k opposite lane se overtake karte hai sach unpadh gawar log bhare hai desh",
    "light_cleaned_title": "Indians bad attitude and civic senses. No respect for country.",
    "light_cleaned_selftext": "Your doctors and health gurus advice you to not take stress and all that but it's just impossible in this country. You wake up fresh in the morning and get ready to go to work with a good mood but half of your energy for the day gets drained in the commute itself..no matter private or public transport. This 'adjust karlo' attitude needs to go.",
    "light_cleaned_comments": "Ye india me har jagah ka situation hai. Man karta hai utarke ek ek ko 4-5 laafa laga du… Pata nahi kya soch k opposite lane se overtake karte hai.. sach me unpadh gawar log bhare hai desh me…"
}