{
    "id": "1gyvpmt",
    "title": "NDTV: GPS Misleads Car To Damaged Bridge, It Falls Into River Killing 3 In UP",
    "url": "https://www.ndtv.com/india-news/gps-misleads-car-to-damaged-bridge-it-falls-into-river-killing-3-in-up-7096433",
    "selftext": "News like this reminds you, how little human life holds value in India, ek varicade hi toh lagana tha.",
    "flair": "Rant / Vent",
    "score": 164,
    "num_comments": 21,
    "created_utc": 1732467749.0,
    "convurl": "https://external-preview.redd.it/MXsRoL2BMSvCSOFiL-riynLZ8Tnfi_C-SMVZVKQiPfo.jpg?auto=webp&s=24aeb7c9f9a0e2b6dbe628c74db070735ff6a67d",
    "comments": [
        "There was a bridge that broke 2 years ago. Apparently there was no warning sign on the road as well.\n\nThis fucking laxity should be punished. But we know it won't. The one in charge would have already said \"ye sab chalta hai bhai\" to someone who asked.",
        "WTF!!! New fear unlocked.",
        "Ok i understood that authorities should have put some warning signs, waht i can't understand was the driver was sleeping while driving and he wasn't able to see the road.",
        "https://preview.redd.it/oyzri9yf1x2e1.jpeg?width=591&format=pjpg&auto=webp&s=43b702a5f2270f538ed51e9c7151ad3c293df42c",
        "It's an empty bridge. You'd be going at a decent speed. The broken portion won't be noticeable from far enough to stop safely.",
        ">News like this reminds you, how little human life holds value in India, ek varicade hi toh lagana tha.\n\n  \nMore about social responsibility and awareness shown by people who are in charge. UP clearly is worst possible state for that.",
        "Fix the headline -- \"Improperly built and corruption riddled governance led to deaths\"",
        "We will demand accountability from everyone except our politicians.",
        "You aren’t supposed to put signs that a bridge is broken. You are supposed to barricade it so that no one can drive on it.",
        "r/expectedoffice",
        "The Golden State!",
        "Have you ever driven a car on a highway or an empty road? The road beyond 30 metres or so is blurry. If you are driving at 80-100+ you won't have enough time to stop",
        "check the image. it's not like the bridge is broken, a whole section is just missing.\n\nwhen you're driving you may think it's just sloping downwards.",
        "the victims were Hindus. just saying if any bhakt is reading. \n\n\ncorruption actually kills more Hindus (since they are the majority) than other threats like love jihad. ",
        "Yup, blame the victim",
        "Every single headline is focusing on GPS, as if Google Maps can anticipate all the myriad issues that happen on roads. Nobody is questioning why the entry point to a broken bridge was left open, why there was no barricade or warning sign. \n\nGoogle Maps is a maps application, it can't update routes in real time. What if the bridge had broken 1 day ago? Would you still blame Google?\n\nIf the bridge was broken for 6 months, was this not enough time for local authorities to put up signs and barricades?",
        "No barricading , no sign boards , instead of questioning the govt, blame google. That's Indian media for you. We all are so doomed.",
        "India media's journalism standard is shit, they are naming google just because it makes the headline catchy.",
        "No, they are focusing on Google because they are afraid of repercussions if they name the actual culprits, the administration of Uttar Pradesh",
        "Well, if they blamed the government there could be repercussions for the media company and the people reporting it."
    ],
    "cleaned_text": "ndtv gps misleads car damaged bridge falls river killing news like reminds little human life holds value india ek varicade hi toh lagana tha ",
    "cleaned_title": "ndtv gps misleads car damaged bridge falls river killing",
    "cleaned_selftext": "news like reminds little human life holds value india ek varicade hi toh lagana tha",
    "cleaned_comments": "bridge broke years ago apparently warning sign road well fucking laxity punished know wont one charge would already said ye sab chalta hai bhai someone asked wtf new fear unlocked ok understood authorities put warning signs waht cant understand driver sleeping driving wasnt able see road empty bridge youd going decent speed broken portion wont noticeable far enough stop safely news like reminds little human life holds value india ek varicade hi toh lagana tha social responsibility awareness shown people charge clearly worst possible state fix headline improperly built corruption riddled governance led deaths demand accountability everyone except politicians arent supposed put signs bridge broken supposed barricade one drive rexpectedoffice golden state ever driven car highway empty road road beyond metres blurry driving wont enough time stop check image like bridge broken whole section missing youre driving may think sloping downwards victims hindus saying bhakt reading corruption actually kills hindus since majority threats like love jihad yup blame victim every single headline focusing gps google maps anticipate myriad issues happen roads nobody questioning entry point broken bridge left open barricade warning sign google maps maps application cant update routes real time bridge broken day ago would still blame google bridge broken months enough time local authorities put signs barricades barricading sign boards instead questioning govt blame google thats indian media doomed india medias journalism standard shit naming google makes headline catchy focusing google afraid repercussions name actual culprits administration uttar pradesh well blamed government could repercussions media company people reporting",
    "light_cleaned_title": "NDTV: GPS Misleads Car To Damaged Bridge, It Falls Into River Killing 3 In UP",
    "light_cleaned_selftext": "News like this reminds you, how little human life holds value in India, ek varicade hi toh lagana tha.",
    "light_cleaned_comments": "There was a bridge that broke 2 years ago. Apparently there was no warning sign on the road as well. This fucking laxity should be punished. But we know it won't. The one in charge would have already said \"ye sab chalta hai bhai\" to someone who asked. WTF!!! New fear unlocked. Ok i understood that authorities should have put some warning signs, waht i can't understand was the driver was sleeping while driving and he wasn't able to see the road. It's an empty bridge. You'd be going at a decent speed. The broken portion won't be noticeable from far enough to stop safely. >News like this reminds you, how little human life holds value in India, ek varicade hi toh lagana tha. More about social responsibility and awareness shown by people who are in charge. UP clearly is worst possible state for that. Fix the headline -- \"Improperly built and corruption riddled governance led to deaths\" We will demand accountability from everyone except our politicians. You aren’t supposed to put signs that a bridge is broken. You are supposed to barricade it so that no one can drive on it. r/expectedoffice The Golden State! Have you ever driven a car on a highway or an empty road? The road beyond 30 metres or so is blurry. If you are driving at 80-100+ you won't have enough time to stop check the image. it's not like the bridge is broken, a whole section is just missing. when you're driving you may think it's just sloping downwards. the victims were Hindus. just saying if any bhakt is reading. corruption actually kills more Hindus (since they are the majority) than other threats like love jihad. Yup, blame the victim Every single headline is focusing on GPS, as if Google Maps can anticipate all the myriad issues that happen on roads. Nobody is questioning why the entry point to a broken bridge was left open, why there was no barricade or warning sign. Google Maps is a maps application, it can't update routes in real time. What if the bridge had broken 1 day ago? Would you still blame Google? If the bridge was broken for 6 months, was this not enough time for local authorities to put up signs and barricades? No barricading , no sign boards , instead of questioning the govt, blame google. That's Indian media for you. We all are so doomed. India media's journalism standard is shit, they are naming google just because it makes the headline catchy. No, they are focusing on Google because they are afraid of repercussions if they name the actual culprits, the administration of Uttar Pradesh Well, if they blamed the government there could be repercussions for the media company and the people reporting it."
}