{
    "id": "17gvxfu",
    "title": "Why hasn’t the government done nothing so far, and let this escalate to a death penalty?",
    "url": "https://www.livemint.com/news/world/indian-nationals-sentenced-to-death-in-qatar-for-espionage-on-behalf-of-israel/amp-11698318334914.html",
    "selftext": "https://www.livemint.com/news/world/indian-nationals-sentenced-to-death-in-qatar-for-espionage-on-behalf-of-israel/amp-11698318334914.html \n\nNo details given by Qatar or India, these ex-navy officers were arrested last year without any official charges. And now the death penalty !\nI’m shocked to see this and the lack of support from the government towards ex-servicemen who have fought and served their country",
    "flair": "Politics",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1698325059.0,
    "convurl": "https://external-preview.redd.it/bUBZaXTzJwDfi7xN7tIEkTKjsgsdQHlpHCxvj2BBtqU.jpg?auto=webp&s=f2c602761cc91a870fdaa48a0f3e2fdd44d62fa9",
    "comments": [
        "They are not diplomats. They are civilians (ex-service men are civilians) working for a private defense company based in Oman are accused of spying charges.  Death penalty is legal in many countries, including India.\n\nI dont think the Indian governments can do anything. It is the law of the country. I think foreign spies caught in India are also treated the same way,."
    ],
    "cleaned_text": "hasnt government done nothing far let escalate death penalty details given qatar india exnavy officers arrested last year without official charges death penalty im shocked see lack support government towards exservicemen fought served country ",
    "cleaned_title": "hasnt government done nothing far let escalate death penalty",
    "cleaned_selftext": "details given qatar india exnavy officers arrested last year without official charges death penalty im shocked see lack support government towards exservicemen fought served country",
    "cleaned_comments": "diplomats civilians exservice men civilians working private defense company based oman accused spying charges death penalty legal many countries including india dont think indian governments anything law country think foreign spies caught india also treated way",
    "light_cleaned_title": "Why hasn’t the government done nothing so far, and let this escalate to a death penalty?",
    "light_cleaned_selftext": "No details given by Qatar or India, these ex-navy officers were arrested last year without any official charges. And now the death penalty ! I’m shocked to see this and the lack of support from the government towards ex-servicemen who have fought and served their country",
    "light_cleaned_comments": "They are not diplomats. They are civilians (ex-service men are civilians) working for a private defense company based in Oman are accused of spying charges. Death penalty is legal in many countries, including India. I dont think the Indian governments can do anything. It is the law of the country. I think foreign spies caught in India are also treated the same way,."
}