{
    "id": "garpxf",
    "title": "Social media users need a personal protection kit against overzealous arrests!",
    "url": "https://www.reddit.com/r/india/comments/garpxf/social_media_users_need_a_personal_protection_kit/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/g69w1u8tywv41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=d9dc49ff366df10b6155eb5a43af69bd67b3e627\n\n**Tl;dr**\n\nArrests are being made for spreading fake news under the Epidemic Diseases Act which due to its vague phrasing gives wide powers to the government. We give a background on the Act and its provisions and how in times of increased government power it has led to more than 500 cases being lodged under it. We have also written to the Union Home Ministry to urgently issue an advisory to State Governments with a draft SOP, to tackle the menace of COVID-19 related disinformation without resorting to overzealous criminal prosecutions.   \n\n\n**Background on Epidemic Diseases Act, 1897**  \n\n\n[**The Epidemic Diseases Act of 1897**](https://arogya.maharashtra.gov.in/Site/Uploads/GR/EPIDEMIC-DISEASES-ACT%5B1%5D.pdf) was first enacted in the wake of the outbreak of the bubonic plague in India which gave the colonial government wide powers at the time. “[**This Act empowered the colonial authorities to detain the plague suspects, destroy or demolish infected property and dwellings, prohibit fairs and pilgrimages and examine the passengers at will.”** ](https://thewire.in/history/colonialism-epidemic-diseases-act)The Act, as it stands currently as well, gives wide powers to the State government under S.2. It authorizes the State government to take any such measures or prescribe any such temporary regulations which it shall deem necessary to prevent the outbreak or further spread of the epidemic. This provides a wide ambit to the provision and one of the measures for which it is being used consistently is combating fake news.  \n\n\n[**Misinformation**](https://foreignpolicy.com/2020/04/17/fake-news-real-arrests/) through social media has been one of the toughest adversaries in the fight against COVID-19. Various stories about fake cures and solutions have been doing the rounds on the internet which include [**vibrations from clapping will kill the virus**](https://economictimes.indiatimes.com/magazines/panache/janta-curfew-row-amitabh-bachchan-claims-vibrations-from-clapping-destroy-virus-twitter-schools-him/articleshow/74785682.cms?from=mdr) and that [**cow urine and cow dung can be used as cures**](https://www.indiatoday.in/india/story/cow-urine-dung-can-treat-coronavirus-says-assam-bjp-mla-1651708-2020-03-02). While the spread of fake news is itself problematic as it creates confusion, one of the most worrying trends of this pandemic is the spread of [**conspiracy theories**](https://www.theguardian.com/world/2020/apr/13/coronavirus-conspiracy-theories-targeting-muslims-spread-in-india) which has led to a rise in communal violence.  \n\n\nAccording to a status report filed by the Central government in the Supreme Court, [**“fake news causing serious panic, is the \"single most unmanageable hindrance\" in the management of this challenge.”**](https://www.businesstoday.in/latest/trends/coronavirus-spread-contained-so-far-due-to-proactive-steps-fake-news-biggest-hindrance-centre-to-sc/story/399747.html). Our Executive Director, Apar Gupta has explained how this order of the Supreme Court[ **undermines the right of journalists**](https://cpj.org/blog/2020/04/lawyer-apar-gupta-on-what-the-indian-supreme-court.php) to report.   \n\n\n**Relevant legal provisions that cause concern**\n\nThe legal provisions being invoked for criminal prosecutions of social media users that are being used as a means to curb the spread of fake news are illustrated below:  \n\n\n1. Under S.3 of the Epidemic Diseases Act any person who disobeys any regulation or order made under the Act is punishable under S.188 of the IPC. For context, punishment under this section will be prescribed for violation of lockdown orders issued by the Central government under this Act. Under the [**S.188 of the IPC**](https://indiankanoon.org/doc/1432790/) , a punishment of simple imprisonment for a term of six months is prescribed for whoever disobeys an order duly promulgated by a public servant.   \n\n2. [**S.505(1)(b) of the IPC**](https://indiankanoon.org/doc/1198526/) is another provision which is being invoked frequently. It prescribes a punishment of imprisonment which may extend to 3 years or fine or both for making, publishing or circulating any statement, rumor or report which may cause fear or alarm to the public.  \n\n3. [**Section 54 of the Disaster Management Act**](https://indiankanoon.org/doc/640589/) also deals with creating ‘false alarm or warning as to disaster or its severity or magnitude, leading to panic’ which is punishable by imprisonment of upto one year.  \n\n\n**Arrests for fake news**  \n\n\nAs reported in today’s (April 30, 2020) Hindustan Times, these legal provisions have been used to lodge at least close to [**500 cases**](https://www.hindustantimes.com/india-news/about-500-cases-lodged-in-india-for-social-media-posts-on-covid-19/story-PBaxt7oNs9IdPNUCVRiUUM.html). This is a large number which matches a disturbing yet global trend of using criminal prosecutions as a preferred choice to tackle disinformation.   \n\n\nSome illustrative cases include:  \n\n\n1. Close to [**100 arrests in West Bengal**](https://www.hindustantimes.com/india-news/about-500-cases-lodged-in-india-for-social-media-posts-on-covid-19/story-PBaxt7oNs9IdPNUCVRiUUM.html), “The arrested people include homemakers, students, school teachers, government employees and traders. The police are scanning social media pages, said Gyanwant Singh, the inspector general (law and order) of West Bengal Police.”\n2. [**“A health worker posted in Rajasthan's Dausa district was arrested and his services were terminated for allegedly spreading fake news about the coronavirus”**](https://www.indiatoday.in/india/story/rajasthan-health-worker-arrested-for-spreading-fake-news-about-coronavirus-1655950-2020-03-16).\n3. In [**Odisha**](https://www.indiatoday.in/india/story/odisha-32-year-old-held-spreading-fake-news-coronavirus-social-media-1655623-2020-03-14), a man was arrested for making a misleading post relating to COVID-19 on Facebook.\n4. At least 15 people, a majority of them being women, have been arrested for spreading fake news in [**Mizoram**](https://www.eastmojo.com/mizoram/2020/03/19/covid-19-15-held-over-fake-news-in-mizoram-42-entry-points-shut).\n5. Three people in [**Telangana**](https://www.ndtv.com/telangana-news/coronavirus-3-arrested-in-telangana-for-spreading-fake-news-on-coronavirus-2195867) were arrested for spreading fake news via social media for forwarding a fake picture on Whatsapp.\n6. In Maharashtra, at least [**18 people**](https://www.indiatoday.in/india/story/coronavirus-maharashtra-registers-115-cases-over-fake-news-since-lockdown-1664318-2020-04-07) were arrested for violating the [**advisory**](https://www.maharashtra.gov.in/Site/Upload/Acts%20Rules/Marathi/Korona%20Notification%2014%20March%202020....pdf) released by the State government which prohibits organizations or individuals from publicizing information about COVID-19 without ascertaining prior clearance from relevant government health authorities, in order to avoid spread of misinformation. The advisory has been framed by the State government under the Epidemic Diseases Act.  \n\n\nThe problem with arrests for fake news is as follows:  \n\n\n1. Wide ambit of Epidemic Diseases Act might lead to arbitrary arrests targeting specific community or political opponents. The Act could then be used to stifle political dissent instead of curbing fake news. Since these provisions are broadly phrased they can result in arbitrary action. For example, [**a news portal founder was arrested in Tamil Nadu**](https://www.deccanherald.com/national/south/news-portal-founder-arrested-in-tamil-nadu-for-critical-reports-against-state-govt-829274.html) for publishing reports that were critical of the government. It was claimed that the news reports were “false and provocative”. He was booked under S.3 of the Epidemic Act and S.188 and 505 (1) (b) of the IPC.  \n\n2. [**Arrests for fake news have not proven to be effective in curbing fake news.**](https://foreignpolicy.com/2020/04/17/fake-news-real-arrests/) This is because rampant arrests have been made of random people. For example, people who have forwarded a fake Whatsapp message have been arrested. This does nothing to either identify the source of the misinformation who has started the Whatsapp forward and in the age of social media it might be difficult to identify altogether. Additionally, it also does not curb the spread of the fake message itself since arresting people for forwarding messages, even though fake, only goes to show the inability of the government to control the spread of fake news and also poses the danger of possible human rights violations.    \n\n\n**We write to the Home Ministry to issue an advisory**  \n\n\nWe draw our position against misinformation clearly. It is a complex problem which must be addressed by a policy tool kit that promotes the values of free expression and also to exercise any censorship powers based on the legal standards that emerge from a human rights framework. Here we have written to the Home Ministry and called on them to issue an advisory with a draft SOP (Standard Operating Procedure) that draws from [**“Joint Declaration on ‘Fake News’, Disinformation and Propaganda”**](https://www.osce.org/fom/302796?download=true) dated March 3, 2017.   \n\n\nEffective communication should be made from official channels to fill the vacuum in which misinformation perpetuates. [**It is imperative for authorities to instead begin combating bad information with good information and curtail the room for speculation.**](https://foreignpolicy.com/2020/04/17/fake-news-real-arrests/)Almost all countries around the world have seen their leaders holding regular press briefings to answer questions about the government response to the pandemic except India. With a 1.3 billion strong population locked down under some of the strictest lockdown measures, the panic and hysteria created due to fake news and misinformation in India has already been catastrophic and something which could have been easily avoidable if effective paths of communication had been created.    \n\n\n**Arrests for fake news solve no purpose and should not be made**\n\nArresting people for spreading fake news during this pandemic only further traumatizes individuals and communities in this unprecedented time. Instead of using the heavy handed approach of arrests, the government should try to ease the misery of the nation by providing clear and effective information.    \n\n\n**Important Documents**\n\n1. Representation to HMO on Social Media Arrests dated April 30, 2020. ([**link**](https://drive.google.com/open?id=1K4fnRVEKKSPAfAeCrmp9aMsEPZiQTsWW))\n\n**Our objective is to keep the internet experiences fair, open and private.**  [**Help us by joining forces and becoming an IFF Member today!**](https://internetfreedom.in/donate/)",
    "flair": "Policy/Economy",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1588234730,
    "convurl": "https://b.thumbs.redditmedia.com/5YJwC2NQJzIw7CQdCsvlxpxuYodNsuRSlUK0cGbKksU.jpg",
    "comments": [
        "Hate in the time of Corona.",
        "Diff topic , I've pm u also , need of the hour- can u stop the gov from making their legal spyware in built into devices. Pls.",
        "We are working towards the whole mandatory/voluntary issue starting tomorrow. Do follow us for regular updates. We will try our best to ensure user choice and consent is maintained :)",
        "It's nice to see someone listen thanks and good luck."
    ],
    "cleaned_text": "social media users need personal protection kit overzealous arrests ampxb tldr arrests made spreading fake news epidemic diseases act due vague phrasing gives wide powers government give background act provisions times increased government power led cases lodged also written union home ministry urgently issue advisory state governments draft sop tackle menace covid related disinformation without resorting overzealous criminal prosecutions background epidemic diseases act epidemic diseases act httpsarogyamaharashtragovinsiteuploadsgrepidemicdiseasesactbdpdf first enacted wake outbreak bubonic plague india gave colonial government wide powers time act empowered colonial authorities detain plague suspects destroy demolish infected property dwellings prohibit fairs pilgrimages examine passengers httpsthewireinhistorycolonialismepidemicdiseasesactthe act stands currently well gives wide powers state government authorizes state government take measures prescribe temporary regulations shall deem necessary prevent outbreak spread epidemic provides wide ambit provision one measures used consistently combating fake news misinformationhttpsforeignpolicycomfakenewsrealarrests social media one toughest adversaries fight covid various stories fake cures solutions rounds internet include vibrations clapping kill virushttpseconomictimesindiatimescommagazinespanachejantacurfewrowamitabhbachchanclaimsvibrationsfromclappingdestroyvirustwitterschoolshimarticleshowcmsfrommdr cow urine cow dung used cureshttpswwwindiatodayinindiastorycowurinedungcantreatcoronavirussaysassambjpmla spread fake news problematic creates confusion one worrying trends pandemic spread conspiracy theorieshttpswwwtheguardiancomworldaprcoronavirusconspiracytheoriestargetingmuslimsspreadinindia led rise communal violence according status report filed central government supreme court fake news causing serious panic single unmanageable hindrance management challengehttpswwwbusinesstodayinlatesttrendscoronavirusspreadcontainedsofarduetoproactivestepsfakenewsbiggesthindrancecentretoscstoryhtml executive director apar gupta explained order supreme court undermines right journalistshttpscpjorgbloglawyeraparguptaonwhattheindiansupremecourtphp report relevant legal provisions cause concern legal provisions invoked criminal prosecutions social media users used means curb spread fake news illustrated epidemic diseases act person disobeys regulation order made act punishable ipc context punishment section prescribed violation lockdown orders issued central government act ipchttpsindiankanoonorgdoc punishment simple imprisonment term six months prescribed whoever disobeys order duly promulgated public servant sb ipchttpsindiankanoonorgdoc another provision invoked frequently prescribes punishment imprisonment may extend years fine making publishing circulating statement rumor report may cause fear alarm public section disaster management acthttpsindiankanoonorgdoc also deals creating false alarm warning disaster severity magnitude leading panic punishable imprisonment upto one year arrests fake news reported todays april hindustan times legal provisions used lodge least close caseshttpswwwhindustantimescomindianewsaboutcaseslodgedinindiaforsocialmediapostsoncovidstorypbaxtonsidpnucvriuumhtml large number matches disturbing yet global trend using criminal prosecutions preferred choice tackle disinformation illustrative cases include close arrests west bengalhttpswwwhindustantimescomindianewsaboutcaseslodgedinindiaforsocialmediapostsoncovidstorypbaxtonsidpnucvriuumhtml arrested people include homemakers students school teachers government employees traders police scanning social media pages said gyanwant singh inspector general law order west bengal police health worker posted rajasthans dausa district arrested services terminated allegedly spreading fake news coronavirushttpswwwindiatodayinindiastoryrajasthanhealthworkerarrestedforspreadingfakenewsaboutcoronavirus odishahttpswwwindiatodayinindiastoryodishayearoldheldspreadingfakenewscoronavirussocialmedia man arrested making misleading post relating covid facebook least people majority women arrested spreading fake news mizoramhttpswwweastmojocommizoramcovidheldoverfakenewsinmizoramentrypointsshut three people telanganahttpswwwndtvcomtelangananewscoronavirusarrestedintelanganaforspreadingfakenewsoncoronavirus arrested spreading fake news via social media forwarding fake picture whatsapp maharashtra least peoplehttpswwwindiatodayinindiastorycoronavirusmaharashtraregisterscasesoverfakenewssincelockdown arrested violating advisoryhttpswwwmaharashtragovinsiteuploadactsrulesmarathikoronanotificationmarchpdf released state government prohibits organizations individuals publicizing information covid without ascertaining prior clearance relevant government health authorities order avoid spread misinformation advisory framed state government epidemic diseases act problem arrests fake news follows wide ambit epidemic diseases act might lead arbitrary arrests targeting specific community political opponents act could used stifle political dissent instead curbing fake news since provisions broadly phrased result arbitrary action example news portal founder arrested tamil naduhttpswwwdeccanheraldcomnationalsouthnewsportalfounderarrestedintamilnaduforcriticalreportsagainststategovthtml publishing reports critical government claimed news reports false provocative booked epidemic act b ipc arrests fake news proven effective curbing fake newshttpsforeignpolicycomfakenewsrealarrests rampant arrests made random people example people forwarded fake whatsapp message arrested nothing either identify source misinformation started whatsapp forward age social media might difficult identify altogether additionally also curb spread fake message since arresting people forwarding messages even though fake goes show inability government control spread fake news also poses danger possible human rights violations write home ministry issue advisory draw position misinformation clearly complex problem must addressed policy tool kit promotes values free expression also exercise censorship powers based legal standards emerge human rights framework written home ministry called issue advisory draft sop standard operating procedure draws joint declaration fake news disinformation propagandahttpswwwosceorgfomdownloadtrue dated march effective communication made official channels fill vacuum misinformation perpetuates imperative authorities instead begin combating bad information good information curtail room speculationhttpsforeignpolicycomfakenewsrealarrestsalmost countries around world seen leaders holding regular press briefings answer questions government response pandemic except india billion strong population locked strictest lockdown measures panic hysteria created due fake news misinformation india already catastrophic something could easily avoidable effective paths communication created arrests fake news solve purpose made arresting people spreading fake news pandemic traumatizes individuals communities unprecedented time instead using heavy handed approach arrests government try ease misery nation providing clear effective information important documents representation hmo social media arrests dated april linkhttpsdrivegooglecomopenidkfnrvekkspafaecrmpamsepziqtsww objective keep internet experiences fair open private help us joining forces becoming iff member todayhttpsinternetfreedomindonate ",
    "cleaned_title": "social media users need personal protection kit overzealous arrests",
    "cleaned_selftext": "ampxb tldr arrests made spreading fake news epidemic diseases act due vague phrasing gives wide powers government give background act provisions times increased government power led cases lodged also written union home ministry urgently issue advisory state governments draft sop tackle menace covid related disinformation without resorting overzealous criminal prosecutions background epidemic diseases act epidemic diseases act httpsarogyamaharashtragovinsiteuploadsgrepidemicdiseasesactbdpdf first enacted wake outbreak bubonic plague india gave colonial government wide powers time act empowered colonial authorities detain plague suspects destroy demolish infected property dwellings prohibit fairs pilgrimages examine passengers httpsthewireinhistorycolonialismepidemicdiseasesactthe act stands currently well gives wide powers state government authorizes state government take measures prescribe temporary regulations shall deem necessary prevent outbreak spread epidemic provides wide ambit provision one measures used consistently combating fake news misinformationhttpsforeignpolicycomfakenewsrealarrests social media one toughest adversaries fight covid various stories fake cures solutions rounds internet include vibrations clapping kill virushttpseconomictimesindiatimescommagazinespanachejantacurfewrowamitabhbachchanclaimsvibrationsfromclappingdestroyvirustwitterschoolshimarticleshowcmsfrommdr cow urine cow dung used cureshttpswwwindiatodayinindiastorycowurinedungcantreatcoronavirussaysassambjpmla spread fake news problematic creates confusion one worrying trends pandemic spread conspiracy theorieshttpswwwtheguardiancomworldaprcoronavirusconspiracytheoriestargetingmuslimsspreadinindia led rise communal violence according status report filed central government supreme court fake news causing serious panic single unmanageable hindrance management challengehttpswwwbusinesstodayinlatesttrendscoronavirusspreadcontainedsofarduetoproactivestepsfakenewsbiggesthindrancecentretoscstoryhtml executive director apar gupta explained order supreme court undermines right journalistshttpscpjorgbloglawyeraparguptaonwhattheindiansupremecourtphp report relevant legal provisions cause concern legal provisions invoked criminal prosecutions social media users used means curb spread fake news illustrated epidemic diseases act person disobeys regulation order made act punishable ipc context punishment section prescribed violation lockdown orders issued central government act ipchttpsindiankanoonorgdoc punishment simple imprisonment term six months prescribed whoever disobeys order duly promulgated public servant sb ipchttpsindiankanoonorgdoc another provision invoked frequently prescribes punishment imprisonment may extend years fine making publishing circulating statement rumor report may cause fear alarm public section disaster management acthttpsindiankanoonorgdoc also deals creating false alarm warning disaster severity magnitude leading panic punishable imprisonment upto one year arrests fake news reported todays april hindustan times legal provisions used lodge least close caseshttpswwwhindustantimescomindianewsaboutcaseslodgedinindiaforsocialmediapostsoncovidstorypbaxtonsidpnucvriuumhtml large number matches disturbing yet global trend using criminal prosecutions preferred choice tackle disinformation illustrative cases include close arrests west bengalhttpswwwhindustantimescomindianewsaboutcaseslodgedinindiaforsocialmediapostsoncovidstorypbaxtonsidpnucvriuumhtml arrested people include homemakers students school teachers government employees traders police scanning social media pages said gyanwant singh inspector general law order west bengal police health worker posted rajasthans dausa district arrested services terminated allegedly spreading fake news coronavirushttpswwwindiatodayinindiastoryrajasthanhealthworkerarrestedforspreadingfakenewsaboutcoronavirus odishahttpswwwindiatodayinindiastoryodishayearoldheldspreadingfakenewscoronavirussocialmedia man arrested making misleading post relating covid facebook least people majority women arrested spreading fake news mizoramhttpswwweastmojocommizoramcovidheldoverfakenewsinmizoramentrypointsshut three people telanganahttpswwwndtvcomtelangananewscoronavirusarrestedintelanganaforspreadingfakenewsoncoronavirus arrested spreading fake news via social media forwarding fake picture whatsapp maharashtra least peoplehttpswwwindiatodayinindiastorycoronavirusmaharashtraregisterscasesoverfakenewssincelockdown arrested violating advisoryhttpswwwmaharashtragovinsiteuploadactsrulesmarathikoronanotificationmarchpdf released state government prohibits organizations individuals publicizing information covid without ascertaining prior clearance relevant government health authorities order avoid spread misinformation advisory framed state government epidemic diseases act problem arrests fake news follows wide ambit epidemic diseases act might lead arbitrary arrests targeting specific community political opponents act could used stifle political dissent instead curbing fake news since provisions broadly phrased result arbitrary action example news portal founder arrested tamil naduhttpswwwdeccanheraldcomnationalsouthnewsportalfounderarrestedintamilnaduforcriticalreportsagainststategovthtml publishing reports critical government claimed news reports false provocative booked epidemic act b ipc arrests fake news proven effective curbing fake newshttpsforeignpolicycomfakenewsrealarrests rampant arrests made random people example people forwarded fake whatsapp message arrested nothing either identify source misinformation started whatsapp forward age social media might difficult identify altogether additionally also curb spread fake message since arresting people forwarding messages even though fake goes show inability government control spread fake news also poses danger possible human rights violations write home ministry issue advisory draw position misinformation clearly complex problem must addressed policy tool kit promotes values free expression also exercise censorship powers based legal standards emerge human rights framework written home ministry called issue advisory draft sop standard operating procedure draws joint declaration fake news disinformation propagandahttpswwwosceorgfomdownloadtrue dated march effective communication made official channels fill vacuum misinformation perpetuates imperative authorities instead begin combating bad information good information curtail room speculationhttpsforeignpolicycomfakenewsrealarrestsalmost countries around world seen leaders holding regular press briefings answer questions government response pandemic except india billion strong population locked strictest lockdown measures panic hysteria created due fake news misinformation india already catastrophic something could easily avoidable effective paths communication created arrests fake news solve purpose made arresting people spreading fake news pandemic traumatizes individuals communities unprecedented time instead using heavy handed approach arrests government try ease misery nation providing clear effective information important documents representation hmo social media arrests dated april linkhttpsdrivegooglecomopenidkfnrvekkspafaecrmpamsepziqtsww objective keep internet experiences fair open private help us joining forces becoming iff member todayhttpsinternetfreedomindonate",
    "cleaned_comments": "hate time corona diff topic ive pm u also need hour u stop gov making legal spyware built devices pls working towards whole mandatoryvoluntary issue starting tomorrow follow us regular updates try best ensure user choice consent maintained nice see someone listen thanks good luck",
    "light_cleaned_title": "Social media users need a personal protection kit against overzealous arrests!",
    "light_cleaned_selftext": "**Tl;dr** Arrests are being made for spreading fake news under the Epidemic Diseases Act which due to its vague phrasing gives wide powers to the government. We give a background on the Act and its provisions and how in times of increased government power it has led to more than 500 cases being lodged under it. We have also written to the Union Home Ministry to urgently issue an advisory to State Governments with a draft SOP, to tackle the menace of COVID-19 related disinformation without resorting to overzealous criminal prosecutions. **Background on Epidemic Diseases Act, 1897** [**The Epidemic Diseases Act of 1897**](https://arogya.maharashtra.gov.in/Site/Uploads/GR/EPIDEMIC-DISEASES-ACT%5B1%5D.pdf) was first enacted in the wake of the outbreak of the bubonic plague in India which gave the colonial government wide powers at the time. “[**This Act empowered the colonial authorities to detain the plague suspects, destroy or demolish infected property and dwellings, prohibit fairs and pilgrimages and examine the passengers at will.”** ](https://thewire.in/history/colonialism-epidemic-diseases-act)The Act, as it stands currently as well, gives wide powers to the State government under S.2. It authorizes the State government to take any such measures or prescribe any such temporary regulations which it shall deem necessary to prevent the outbreak or further spread of the epidemic. This provides a wide ambit to the provision and one of the measures for which it is being used consistently is combating fake news. [**Misinformation**](https://foreignpolicy.com/2020/04/17/fake-news-real-arrests/) through social media has been one of the toughest adversaries in the fight against COVID-19. Various stories about fake cures and solutions have been doing the rounds on the internet which include [**vibrations from clapping will kill the virus**](https://economictimes.indiatimes.com/magazines/panache/janta-curfew-row-amitabh-bachchan-claims-vibrations-from-clapping-destroy-virus-twitter-schools-him/articleshow/74785682.cms?from=mdr) and that [**cow urine and cow dung can be used as cures**](https://www.indiatoday.in/india/story/cow-urine-dung-can-treat-coronavirus-says-assam-bjp-mla-1651708-2020-03-02). While the spread of fake news is itself problematic as it creates confusion, one of the most worrying trends of this pandemic is the spread of [**conspiracy theories**](https://www.theguardian.com/world/2020/apr/13/coronavirus-conspiracy-theories-targeting-muslims-spread-in-india) which has led to a rise in communal violence. According to a status report filed by the Central government in the Supreme Court, [**“fake news causing serious panic, is the \"single most unmanageable hindrance\" in the management of this challenge.”**](https://www.businesstoday.in/latest/trends/coronavirus-spread-contained-so-far-due-to-proactive-steps-fake-news-biggest-hindrance-centre-to-sc/story/399747.html). Our Executive Director, Apar Gupta has explained how this order of the Supreme Court[ **undermines the right of journalists**](https://cpj.org/blog/2020/04/lawyer-apar-gupta-on-what-the-indian-supreme-court.php) to report. **Relevant legal provisions that cause concern** The legal provisions being invoked for criminal prosecutions of social media users that are being used as a means to curb the spread of fake news are illustrated below: 1. Under S.3 of the Epidemic Diseases Act any person who disobeys any regulation or order made under the Act is punishable under S.188 of the IPC. For context, punishment under this section will be prescribed for violation of lockdown orders issued by the Central government under this Act. Under the [**S.188 of the IPC**](https://indiankanoon.org/doc/1432790/) , a punishment of simple imprisonment for a term of six months is prescribed for whoever disobeys an order duly promulgated by a public servant. 2. [**S.505(1)(b) of the IPC**](https://indiankanoon.org/doc/1198526/) is another provision which is being invoked frequently. It prescribes a punishment of imprisonment which may extend to 3 years or fine or both for making, publishing or circulating any statement, rumor or report which may cause fear or alarm to the public. 3. [**Section 54 of the Disaster Management Act**](https://indiankanoon.org/doc/640589/) also deals with creating ‘false alarm or warning as to disaster or its severity or magnitude, leading to panic’ which is punishable by imprisonment of upto one year. **Arrests for fake news** As reported in today’s (April 30, 2020) Hindustan Times, these legal provisions have been used to lodge at least close to [**500 cases**](https://www.hindustantimes.com/india-news/about-500-cases-lodged-in-india-for-social-media-posts-on-covid-19/story-PBaxt7oNs9IdPNUCVRiUUM.html). This is a large number which matches a disturbing yet global trend of using criminal prosecutions as a preferred choice to tackle disinformation. Some illustrative cases include: 1. Close to [**100 arrests in West Bengal**](https://www.hindustantimes.com/india-news/about-500-cases-lodged-in-india-for-social-media-posts-on-covid-19/story-PBaxt7oNs9IdPNUCVRiUUM.html), “The arrested people include homemakers, students, school teachers, government employees and traders. The police are scanning social media pages, said Gyanwant Singh, the inspector general (law and order) of West Bengal Police.” 2. [**“A health worker posted in Rajasthan's Dausa district was arrested and his services were terminated for allegedly spreading fake news about the coronavirus”**](https://www.indiatoday.in/india/story/rajasthan-health-worker-arrested-for-spreading-fake-news-about-coronavirus-1655950-2020-03-16). 3. In [**Odisha**](https://www.indiatoday.in/india/story/odisha-32-year-old-held-spreading-fake-news-coronavirus-social-media-1655623-2020-03-14), a man was arrested for making a misleading post relating to COVID-19 on Facebook. 4. At least 15 people, a majority of them being women, have been arrested for spreading fake news in [**Mizoram**](https://www.eastmojo.com/mizoram/2020/03/19/covid-19-15-held-over-fake-news-in-mizoram-42-entry-points-shut). 5. Three people in [**Telangana**](https://www.ndtv.com/telangana-news/coronavirus-3-arrested-in-telangana-for-spreading-fake-news-on-coronavirus-2195867) were arrested for spreading fake news via social media for forwarding a fake picture on Whatsapp. 6. In Maharashtra, at least [**18 people**](https://www.indiatoday.in/india/story/coronavirus-maharashtra-registers-115-cases-over-fake-news-since-lockdown-1664318-2020-04-07) were arrested for violating the [**advisory**](https://www.maharashtra.gov.in/Site/Upload/Acts%20Rules/Marathi/Korona%20Notification%2014%20March%202020....pdf) released by the State government which prohibits organizations or individuals from publicizing information about COVID-19 without ascertaining prior clearance from relevant government health authorities, in order to avoid spread of misinformation. The advisory has been framed by the State government under the Epidemic Diseases Act. The problem with arrests for fake news is as follows: 1. Wide ambit of Epidemic Diseases Act might lead to arbitrary arrests targeting specific community or political opponents. The Act could then be used to stifle political dissent instead of curbing fake news. Since these provisions are broadly phrased they can result in arbitrary action. For example, [**a news portal founder was arrested in Tamil Nadu**](https://www.deccanherald.com/national/south/news-portal-founder-arrested-in-tamil-nadu-for-critical-reports-against-state-govt-829274.html) for publishing reports that were critical of the government. It was claimed that the news reports were “false and provocative”. He was booked under S.3 of the Epidemic Act and S.188 and 505 (1) (b) of the IPC. 2. [**Arrests for fake news have not proven to be effective in curbing fake news.**](https://foreignpolicy.com/2020/04/17/fake-news-real-arrests/) This is because rampant arrests have been made of random people. For example, people who have forwarded a fake Whatsapp message have been arrested. This does nothing to either identify the source of the misinformation who has started the Whatsapp forward and in the age of social media it might be difficult to identify altogether. Additionally, it also does not curb the spread of the fake message itself since arresting people for forwarding messages, even though fake, only goes to show the inability of the government to control the spread of fake news and also poses the danger of possible human rights violations. **We write to the Home Ministry to issue an advisory** We draw our position against misinformation clearly. It is a complex problem which must be addressed by a policy tool kit that promotes the values of free expression and also to exercise any censorship powers based on the legal standards that emerge from a human rights framework. Here we have written to the Home Ministry and called on them to issue an advisory with a draft SOP (Standard Operating Procedure) that draws from [**“Joint Declaration on ‘Fake News’, Disinformation and Propaganda”**](https://www.osce.org/fom/302796?download=true) dated March 3, 2017. Effective communication should be made from official channels to fill the vacuum in which misinformation perpetuates. [**It is imperative for authorities to instead begin combating bad information with good information and curtail the room for speculation.**](https://foreignpolicy.com/2020/04/17/fake-news-real-arrests/)Almost all countries around the world have seen their leaders holding regular press briefings to answer questions about the government response to the pandemic except India. With a 1.3 billion strong population locked down under some of the strictest lockdown measures, the panic and hysteria created due to fake news and misinformation in India has already been catastrophic and something which could have been easily avoidable if effective paths of communication had been created. **Arrests for fake news solve no purpose and should not be made** Arresting people for spreading fake news during this pandemic only further traumatizes individuals and communities in this unprecedented time. Instead of using the heavy handed approach of arrests, the government should try to ease the misery of the nation by providing clear and effective information. **Important Documents** 1. Representation to HMO on Social Media Arrests dated April 30, 2020. ([**link**](https://drive.google.com/open?id=1K4fnRVEKKSPAfAeCrmp9aMsEPZiQTsWW)) **Our objective is to keep the internet experiences fair, open and private.** [**Help us by joining forces and becoming an IFF Member today!**](https://internetfreedom.in/donate/)",
    "light_cleaned_comments": "Hate in the time of Corona. Diff topic , I've pm u also , need of the hour- can u stop the gov from making their legal spyware in built into devices. Pls. We are working towards the whole mandatory/voluntary issue starting tomorrow. Do follow us for regular updates. We will try our best to ensure user choice and consent is maintained :) It's nice to see someone listen thanks and good luck."
}