{
    "id": "15e7q1q",
    "title": "Supreme Court: India's most powerful court is drowning under thousands of cases",
    "url": "https://www.bbc.co.uk/news/world-asia-india-66292895",
    "selftext": "BBC News - Supreme Court: India's most powerful court is drowning under thousands of cases\n\nhttps://www.bbc.co.uk/news/world-asia-india-66292895",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1690783588.0,
    "convurl": "https://external-preview.redd.it/SD4eJInlYK3HXVf8zLXjHXAHB-mYjeZWo05pPn4NwwA.jpg?auto=webp&s=0b2010a4a4c0ab77de24a666971daa8ab138c87b",
    "comments": [
        "It's their own damn fault. The court refuses to enforce judicial discipline, takes cases on individual whims and fancies, frequently allows even routine and petty matters when it should instead be leaving that to the high courts and focusing on ensuring that the legal community and subordinate judges do their jobs properly. Let's not even get into their ridiculous special mention system that privileges attorneys with nepotistic connections over new entrants to the field.\n\nIf the judges spent a little less time fucking with the constitution and actually fulfilling their remit, and maybe actually punishing lawyers who vaccillate endlessly they might get their pendency down.\n\nBut high pendency suits everyone. Judges get to pick and choose which cases are convenient. Lawyers get to charge crores for special access. The wealthy get superior access while the state gets to fuck ordinary people using the process rather than needing to actually prove anything.\n\nEveryone wins. Except the mango people.",
        "Need another supreme court and more judges. Ditch paperwork and go digital.",
        "What is stopping these guys from increasing the number of courts at all levels? \n\nIndia has a lot of problems but the most important among them is judicial delay, everything takes at least a decade and people end up losing faith in the judiciary. Expand the judicial system ten fold and adopt technology wherever it can help increase transparency and efficiency.",
        "They can't expand themselves, govt does that",
        "Diplomats, Bureaucrats, Judges are all power hungry, operational expansion means power dilution."
    ],
    "cleaned_text": "supreme court indias powerful court drowning thousands cases bbc news supreme court indias powerful court drowning thousands cases ",
    "cleaned_title": "supreme court indias powerful court drowning thousands cases",
    "cleaned_selftext": "bbc news supreme court indias powerful court drowning thousands cases",
    "cleaned_comments": "damn fault court refuses enforce judicial discipline takes cases individual whims fancies frequently allows even routine petty matters instead leaving high courts focusing ensuring legal community subordinate judges jobs properly lets even get ridiculous special mention system privileges attorneys nepotistic connections new entrants field judges spent little less time fucking constitution actually fulfilling remit maybe actually punishing lawyers vaccillate endlessly might get pendency high pendency suits everyone judges get pick choose cases convenient lawyers get charge crores special access wealthy get superior access state gets fuck ordinary people using process rather needing actually prove anything everyone wins except mango people need another supreme court judges ditch paperwork go digital stopping guys increasing number courts levels india lot problems important among judicial delay everything takes least decade people end losing faith judiciary expand judicial system ten fold adopt technology wherever help increase transparency efficiency cant expand govt diplomats bureaucrats judges power hungry operational expansion means power dilution",
    "light_cleaned_title": "Supreme Court: India's most powerful court is drowning under thousands of cases",
    "light_cleaned_selftext": "BBC News - Supreme Court: India's most powerful court is drowning under thousands of cases",
    "light_cleaned_comments": "It's their own damn fault. The court refuses to enforce judicial discipline, takes cases on individual whims and fancies, frequently allows even routine and petty matters when it should instead be leaving that to the high courts and focusing on ensuring that the legal community and subordinate judges do their jobs properly. Let's not even get into their ridiculous special mention system that privileges attorneys with nepotistic connections over new entrants to the field. If the judges spent a little less time fucking with the constitution and actually fulfilling their remit, and maybe actually punishing lawyers who vaccillate endlessly they might get their pendency down. But high pendency suits everyone. Judges get to pick and choose which cases are convenient. Lawyers get to charge crores for special access. The wealthy get superior access while the state gets to fuck ordinary people using the process rather than needing to actually prove anything. Everyone wins. Except the mango people. Need another supreme court and more judges. Ditch paperwork and go digital. What is stopping these guys from increasing the number of courts at all levels? India has a lot of problems but the most important among them is judicial delay, everything takes at least a decade and people end up losing faith in the judiciary. Expand the judicial system ten fold and adopt technology wherever it can help increase transparency and efficiency. They can't expand themselves, govt does that Diplomats, Bureaucrats, Judges are all power hungry, operational expansion means power dilution."
}