{
    "id": "180f302",
    "title": "Bengaluru: Five Bescom officials arrested in mother-daughter electrocution incident",
    "url": "https://www.hindustantimes.com/cities/bengaluru-news/bengaluru-five-bescom-officials-arrested-in-mother-daughter-electrocution-incident-101700559608495.html",
    "selftext": "The horrific incident occurred near the Hope Farm junction, when a 23-year-old woman accidentally stepped on a live wire that was lying on a footpath while carrying her nine-month-old baby girl, which electrocuted both of them instantly.\n\nThey should all be charged with involuntary manslaughter.",
    "flair": "Crime",
    "score": 37,
    "num_comments": 0,
    "created_utc": 1700566983.0,
    "convurl": "https://external-preview.redd.it/tPJfUj85tuJeHX1zfqwKeCja81VnYxocv8uFROxAJUM.jpg?auto=webp&s=903cf18c99efee602e1b6824ceb9780b436e19d5",
    "comments": [],
    "cleaned_text": "bengaluru five bescom officials arrested motherdaughter electrocution incident horrific incident occurred near hope farm junction yearold woman accidentally stepped live wire lying footpath carrying ninemonthold baby girl electrocuted instantly charged involuntary manslaughter ",
    "cleaned_title": "bengaluru five bescom officials arrested motherdaughter electrocution incident",
    "cleaned_selftext": "horrific incident occurred near hope farm junction yearold woman accidentally stepped live wire lying footpath carrying ninemonthold baby girl electrocuted instantly charged involuntary manslaughter",
    "cleaned_comments": "",
    "light_cleaned_title": "Bengaluru: Five Bescom officials arrested in mother-daughter electrocution incident",
    "light_cleaned_selftext": "The horrific incident occurred near the Hope Farm junction, when a 23-year-old woman accidentally stepped on a live wire that was lying on a footpath while carrying her nine-month-old baby girl, which electrocuted both of them instantly. They should all be charged with involuntary manslaughter.",
    "light_cleaned_comments": ""
}