{
    "id": "18o92vi",
    "title": "Licence-raj continues: Planning house party with alcohol in Noida? Apply for occasional bar licence",
    "url": "https://m.economictimes.com/industry/cons-products/liquor/planning-house-party-with-alcohol-in-noida-apply-for-occasional-bar-licence/articleshow/106182687.cms",
    "selftext": "This is ridiculous. What’s in it for consumers? Just more ways to loot people’s hard-earned, heavily-taxed money😡",
    "flair": "Policy/Economy",
    "score": 16,
    "num_comments": 4,
    "created_utc": 1703228992.0,
    "convurl": "https://external-preview.redd.it/L9cEKesOF0yAZDx1AS535CroTAAa1zTZbFjGhjZmNTY.jpg?auto=webp&s=d62be9a5775398c50eaf185e4cb36c00d0c1137a",
    "comments": [
        "Maharashtra has similar rules. No one follows them.",
        "That won't stop governments from *selectively* applying them. If you tweet against your CM for example, and during the investigation if the cops find out that you regularly host booze parties, this law will be the perfect excuse to take you to the lockup.",
        "Exactly. Laws enforced selectively is a secret weapon."
    ],
    "cleaned_text": "licenceraj continues planning house party alcohol noida apply occasional bar licence ridiculous whats consumers ways loot peoples hardearned heavilytaxed money ",
    "cleaned_title": "licenceraj continues planning house party alcohol noida apply occasional bar licence",
    "cleaned_selftext": "ridiculous whats consumers ways loot peoples hardearned heavilytaxed money",
    "cleaned_comments": "maharashtra similar rules one follows wont stop governments selectively applying tweet cm example investigation cops find regularly host booze parties law perfect excuse take lockup exactly laws enforced selectively secret weapon",
    "light_cleaned_title": "Licence-raj continues: Planning house party with alcohol in Noida? Apply for occasional bar licence",
    "light_cleaned_selftext": "This is ridiculous. What’s in it for consumers? Just more ways to loot people’s hard-earned, heavily-taxed money😡",
    "light_cleaned_comments": "Maharashtra has similar rules. No one follows them. That won't stop governments from *selectively* applying them. If you tweet against your CM for example, and during the investigation if the cops find out that you regularly host booze parties, this law will be the perfect excuse to take you to the lockup. Exactly. Laws enforced selectively is a secret weapon."
}