{
    "id": "1fyyawn",
    "title": "IFF's 2nd Annual Membership Drive comes to an end ",
    "url": "https://www.reddit.com/r/india/comments/1fyyawn/iffs_2nd_annual_membership_drive_comes_to_an_end/",
    "selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/kjcgtbdexitd1.jpg?width=680&format=pjpg&auto=webp&s=5b17212bd8075aea20374a7e7cc3d39b1fdb667f)\n\nWe launched our 2nd Annual Membership Drive to add 300 new IFF members, who can donate to us every month & join us in the fight for our digital rights. We have reached the end of the membership drive & we are so grateful for 183 people who signed up! \n\n[https://internetfreedom.in/annual-membership-drive-2024/](https://internetfreedom.in/annual-membership-drive-2024/)\n\n2024, was a lot (which year isn’t a lot for the digital nagriks anyway?)\n\nThis year was particularly significant for our rights and civil liberties. During the 2024 General Elections, we stood up for all 'Digital Nagriks' and #FreeAndFair elections. \n\nWe put our foot down on digiyatra & warned every one of its pitfalls. We shared our woes of the #Dard\\_E\\_DigiYatra and asked you to safely deboard from digiyatra before harm befalls upon your personal data. \n\nOur latest victory was a BIG win for free speech! The 2023 fact-checking amendments to the[ #ITRules](https://x.com/hashtag/ITRules?src=hashtag_click) were struck down! Big or small, the fight for digital rights should march on without setbacks and only YOU can ensure that. Become a member of IFF and do your bit ;) \n\nWe thank Sanitary Panels and Disha Ravi for helping us get new members to join the IFF community - we love you both so much! <333 We are because of our community and people like you, helping build this community! \n\n\n\n",
    "flair": "Policy/Economy",
    "score": 9,
    "num_comments": 0,
    "created_utc": 1728389659.0,
    "convurl": "https://external-preview.redd.it/sjdDaQm4vhzX5L8klqmP9MW--5QmarLnjmBu_FQsr_o.jpg?auto=webp&s=f3dd7e131d166db14eb4e513edd4e49c7539d94b",
    "comments": [],
    "cleaned_text": "iffs nd annual membership drive comes end iff needs support ever details end posthttpspreviewredditkjcgtbdexitdjpgwidthformatpjpgautowebpsbbdaeaaeccdbfdbf launched nd annual membership drive add new iff members donate us every month join us fight digital rights reached end membership drive grateful people signed httpsinternetfreedominannualmembershipdrivehttpsinternetfreedominannualmembershipdrive lot year isnt lot digital nagriks anyway year particularly significant rights civil liberties general elections stood digital nagriks freeandfair elections put foot digiyatra warned every one pitfalls shared woes dardedigiyatra asked safely deboard digiyatra harm befalls upon personal data latest victory big win free speech factchecking amendments itruleshttpsxcomhashtagitrulessrchashtagclick struck big small fight digital rights march without setbacks ensure become member iff bit thank sanitary panels disha ravi helping us get new members join iff community love much community people like helping build community ",
    "cleaned_title": "iffs nd annual membership drive comes end",
    "cleaned_selftext": "iff needs support ever details end posthttpspreviewredditkjcgtbdexitdjpgwidthformatpjpgautowebpsbbdaeaaeccdbfdbf launched nd annual membership drive add new iff members donate us every month join us fight digital rights reached end membership drive grateful people signed httpsinternetfreedominannualmembershipdrivehttpsinternetfreedominannualmembershipdrive lot year isnt lot digital nagriks anyway year particularly significant rights civil liberties general elections stood digital nagriks freeandfair elections put foot digiyatra warned every one pitfalls shared woes dardedigiyatra asked safely deboard digiyatra harm befalls upon personal data latest victory big win free speech factchecking amendments itruleshttpsxcomhashtagitrulessrchashtagclick struck big small fight digital rights march without setbacks ensure become member iff bit thank sanitary panels disha ravi helping us get new members join iff community love much community people like helping build community",
    "cleaned_comments": "",
    "light_cleaned_title": "IFF's 2nd Annual Membership Drive comes to an end",
    "light_cleaned_selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/kjcgtbdexitd1.jpg?width=680&format=pjpg&auto=webp&s=5b17212bd8075aea20374a7e7cc3d39b1fdb667f) We launched our 2nd Annual Membership Drive to add 300 new IFF members, who can donate to us every month & join us in the fight for our digital rights. We have reached the end of the membership drive & we are so grateful for 183 people who signed up! [https://internetfreedom.in/annual-membership-drive-2024/](https://internetfreedom.in/annual-membership-drive-2024/) 2024, was a lot (which year isn’t a lot for the digital nagriks anyway?) This year was particularly significant for our rights and civil liberties. During the 2024 General Elections, we stood up for all 'Digital Nagriks' and #FreeAndFair elections. We put our foot down on digiyatra & warned every one of its pitfalls. We shared our woes of the #Dard\\_E\\_DigiYatra and asked you to safely deboard from digiyatra before harm befalls upon your personal data. Our latest victory was a BIG win for free speech! The 2023 fact-checking amendments to the[ #ITRules](https://x.com/hashtag/ITRules?src=hashtag_click) were struck down! Big or small, the fight for digital rights should march on without setbacks and only YOU can ensure that. Become a member of IFF and do your bit ;) We thank Sanitary Panels and Disha Ravi for helping us get new members to join the IFF community - we love you both so much! <333 We are because of our community and people like you, helping build this community!",
    "light_cleaned_comments": ""
}