{
    "id": "11stz44",
    "title": "Where do I buy aesthetic backpacks in India?",
    "url": "https://www.reddit.com/r/india/comments/11stz44/where_do_i_buy_aesthetic_backpacks_in_india/",
    "selftext": "I was wondering if there were any Indian businesses which made/sell aesthetic bags, does not matter if it is western/japanese/korean style. Maybe something like these (pls find attached 2 pics)? If there were any sellers or even local Indian small businesses who made bags like these? Price range upto 1500 inr (including shipping pls), but if a bag were really good I might consider upto 2000 considering I would be using it for the next few years.\n\n&amp;#x200B;\n\n[bag1](https://preview.redd.it/ww52vj9up3oa1.png?width=855&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d150e22124080e07dfbe08e9881712646f34edb9)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/30aqtn5gq3oa1.png?width=557&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=f71428d9a8ce9ee167834256494975ce67950764",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 5,
    "created_utc": 1678972803,
    "convurl": "https://a.thumbs.redditmedia.com/swNN2ogOQOmDS1B09Wj2XuplBlOPilbluvnnvU2-FA4.jpg",
    "comments": [
        "If you don't want to compromise with the quality, just go for Wildcraft backpacks.\n\nThey're usually of great quality with strong stitching. And also they look pretty aesthetic.\n\nThey are usually between the range of  ₹1000 - 2500.\n\nYou can check them out on Flipkart and Amazon. You'll get more varients and options on Flipkart though.\n\nWildcraft &gt; Skybags, American Tourister\n\nAlso, don't buy the bag of any random company on any shopping site. You should not compromise with the quality. \n\nAnd if you want for school/college/office purpose, go with atleast 30L backpack. And if you want one for travelling, go with 40L+ backpack.",
        "My Wildcraft backpack looked super nice and lasted more than 5 years. \n\nI've had a generic asian bag I ordered from Amazon, it looked really really good from pictures and even when I unboxed it. But the straps came apart within 1 month.",
        "i don't know if they are aestheic for you cause personal taste but genie on amazon is good brand I have been using a bag from them for 1 year plus \n\n&amp;#x200B;\n\n[https://www.amazon.in/s?k=genie&amp;ref=nb\\_sb\\_noss](https://www.amazon.in/s?k=genie&amp;ref=nb_sb_noss)\n\n&amp;#x200B;\n\nmy  bag : [https://www.amazon.in/Genie-Flamenco2-Backpack-Compatible-Resistant/dp/B08YF1XJXY/ref=sr\\_1\\_32?keywords=genie&amp;qid=1678994906&amp;sr=8-32](https://www.amazon.in/Genie-Flamenco2-Backpack-Compatible-Resistant/dp/B08YF1XJXY/ref=sr_1_32?keywords=genie&amp;qid=1678994906&amp;sr=8-32)",
        "Let me guess. It broke where the shoulder straps meet with the carry loop. Then later it turned into a gapping hole through which u could access the back compartment. Am I right or am I right, boys?"
    ],
    "cleaned_text": "buy aesthetic backpacks india wondering indian businesses madesell aesthetic bags matter westernjapanesekorean style maybe something like pls find attached pics sellers even local indian small businesses made bags like price range upto inr including shipping pls bag really good might consider upto considering would using next years ampxb baghttpspreviewredditwwvjupoapngwidthampformatpngampautowebpampvenabledampsdeedfbeefedb ampxb ",
    "cleaned_title": "buy aesthetic backpacks india",
    "cleaned_selftext": "wondering indian businesses madesell aesthetic bags matter westernjapanesekorean style maybe something like pls find attached pics sellers even local indian small businesses made bags like price range upto inr including shipping pls bag really good might consider upto considering would using next years ampxb baghttpspreviewredditwwvjupoapngwidthampformatpngampautowebpampvenabledampsdeedfbeefedb ampxb",
    "cleaned_comments": "dont want compromise quality go wildcraft backpacks theyre usually great quality strong stitching also look pretty aesthetic usually range check flipkart amazon youll get varients options flipkart though wildcraft gt skybags american tourister also dont buy bag random company shopping site compromise quality want schoolcollegeoffice purpose go atleast l backpack want one travelling go l backpack wildcraft backpack looked super nice lasted years ive generic asian bag ordered amazon looked really really good pictures even unboxed straps came apart within month dont know aestheic cause personal taste genie amazon good brand using bag year plus ampxb httpswwwamazoninskgenieamprefnbsbnosshttpswwwamazoninskgenieamprefnbsbnoss ampxb bag httpswwwamazoningenieflamencobackpackcompatibleresistantdpbyfxjxyrefsrkeywordsgenieampqidampsrhttpswwwamazoningenieflamencobackpackcompatibleresistantdpbyfxjxyrefsrkeywordsgenieampqidampsr let guess broke shoulder straps meet carry loop later turned gapping hole u could access back compartment right right boys",
    "light_cleaned_title": "Where do I buy aesthetic backpacks in India?",
    "light_cleaned_selftext": "I was wondering if there were any Indian businesses which made/sell aesthetic bags, does not matter if it is western/japanese/korean style. Maybe something like these (pls find attached 2 pics)? If there were any sellers or even local Indian small businesses who made bags like these? Price range upto 1500 inr (including shipping pls), but if a bag were really good I might consider upto 2000 considering I would be using it for the next few years.  [bag1](https://preview.redd.it/ww52vj9up3oa1.png?width=855&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d150e22124080e07dfbe08e9881712646f34edb9)",
    "light_cleaned_comments": "If you don't want to compromise with the quality, just go for Wildcraft backpacks. They're usually of great quality with strong stitching. And also they look pretty aesthetic. They are usually between the range of ₹1000 - 2500. You can check them out on Flipkart and Amazon. You'll get more varients and options on Flipkart though. Wildcraft &gt; Skybags, American Tourister Also, don't buy the bag of any random company on any shopping site. You should not compromise with the quality. And if you want for school/college/office purpose, go with atleast 30L backpack. And if you want one for travelling, go with 40L+ backpack. My Wildcraft backpack looked super nice and lasted more than 5 years. I've had a generic asian bag I ordered from Amazon, it looked really really good from pictures and even when I unboxed it. But the straps came apart within 1 month. i don't know if they are aestheic for you cause personal taste but genie on amazon is good brand I have been using a bag from them for 1 year plus  [https://www.amazon.in/s?k=genie&amp;ref=nb\\_sb\\_noss](https://www.amazon.in/s?k=genie&amp;ref=nb_sb_noss)  my bag : [https://www.amazon.in/Genie-Flamenco2-Backpack-Compatible-Resistant/dp/B08YF1XJXY/ref=sr\\_1\\_32?keywords=genie&amp;qid=1678994906&amp;sr=8-32](https://www.amazon.in/Genie-Flamenco2-Backpack-Compatible-Resistant/dp/B08YF1XJXY/ref=sr_1_32?keywords=genie&amp;qid=1678994906&amp;sr=8-32) Let me guess. It broke where the shoulder straps meet with the carry loop. Then later it turned into a gapping hole through which u could access the back compartment. Am I right or am I right, boys?"
}