{
    "id": "1beijyz",
    "title": "Alina Akhtar, a 14-year-old 10th class student of Lucknow St. Paul's College, sent a letter to CM Yogi Said \"Honorable Chief Minister, we want to study\"",
    "url": "https://i.redd.it/83cab2f87aoc1.jpeg",
    "selftext": "To Honorable Chief Minister Yogi Adityanath Ji\n\nTo the most beloved Chief Minister of my state in the entire country, I am forced to write this letter with a sad heart.\n\nI have full hope that you will understand my thoughts well and take some meaningful action on this!\n\nHonorable Chief Minister, I started studying from Nursery KG from Children's Palace School and have reached high school class 10 while studying at St. Paul's College, Lucknow.\n\nAnd my elder brother is preparing to go to college after completing his intermediate finals.\n\nDuring my studies till now, I have seen my dad struggling a lot, I have seen his problems increasing with time, earlier even the books of upper class were useful, which provided some relief, gradually This trend has also ended, the syllabus changes every year, and becomes very expensive, as soon as the studies are completed, the books of the children of every class become trash, they cannot be used again by the children of the class below!\n\nWhy this is done, I don't know!\n\nCopy books and school fees have become so expensive that even buying a pen or register in between has become difficult. Apart from this, the competition and studies have been made so tough that it is not possible to understand anything without tuition.\n\nHis fees are also no less!\n\nWe see daddy having a lot of trouble in arranging the fees. Seeing his problems, we cry a lot, many times I feel like leaving studies, but I remember what you all said that daughter. Educate, save your daughter, and if India studies, India will progress!\n\nHonorable Chief Minister, we have seen daddy selling mom's jewelery to arrange Rs 1 lakh for elder brother's admission! Because we have seen our dad doing journalism very honestly, he does not earn a single rupee from anyone through any wrong means, he teaches the lesson of honesty to us too! My dad has received respect in many places because of his honesty and writing good articles, but this does not cover the household expenses, my dad's income is very limited, in such a situation, what will he do next for my and brother's education? We don't know!\n\nHonorable Chief Minister, we want to study! The story of millions of children like us is similar to ours!\n\nYou have made many good changes in your state,\n\nWith folded hands, I request you to make some changes in the field of education so that education can become affordable for everyone.\n\nAlso end the practice of changing books every year, so that those books can be useful to the children of lower classes, and thousands of trees do not have to sacrifice their lives to make so many books and notebooks.\n\nAn ordinary girl from your state",
    "flair": "Rant / Vent",
    "score": 17,
    "num_comments": 10,
    "created_utc": 1710414086.0,
    "convurl": "https://i.redd.it/83cab2f87aoc1.jpeg",
    "comments": [
        "Please link the source",
        "Hello 14-yo bulli bai, all your problems will go away with bulldojer. Sending some right now - Regs, philosopher raja Adityanath. \n\nNew Jersey and Reddit Hindus heard cheering...",
        "Muslim Girl studying in Christian School. This will go to Ajay Bisht's Trash folder faster than dick pill and Nigerian prince emails.",
        "This is honestly depressing, I actually do not know anything about the demographic of UP but no child should beg for the education",
        "Can anyone plz tell Can’t she study in government school or get scholarship based on her merit ?",
        "Fuckin opposition is so disorganised & incompetent, that even on progressive issues, BJP is holding the mantle, even an imaginary one.\n\nPlease Congress, fire Rahul Gandhi and get your shit together. I want to vote for you, but rather vote NOTA."
    ],
    "cleaned_text": "alina akhtar yearold th class student lucknow st pauls college sent letter cm yogi said honorable chief minister want study honorable chief minister yogi adityanath ji beloved chief minister state entire country forced write letter sad heart full hope understand thoughts well take meaningful action honorable chief minister started studying nursery kg childrens palace school reached high school class studying st pauls college lucknow elder brother preparing go college completing intermediate finals studies till seen dad struggling lot seen problems increasing time earlier even books upper class useful provided relief gradually trend also ended syllabus changes every year becomes expensive soon studies completed books children every class become trash used children class done dont know copy books school fees become expensive even buying pen register become difficult apart competition studies made tough possible understand anything without tuition fees also less see daddy lot trouble arranging fees seeing problems cry lot many times feel like leaving studies remember said daughter educate save daughter india studies india progress honorable chief minister seen daddy selling moms jewelery arrange rs lakh elder brothers admission seen dad journalism honestly earn single rupee anyone wrong means teaches lesson honesty us dad received respect many places honesty writing good articles cover household expenses dads income limited situation next brothers education dont know honorable chief minister want study story millions children like us similar made many good changes state folded hands request make changes field education education become affordable everyone also end practice changing books every year books useful children lower classes thousands trees sacrifice lives make many books notebooks ordinary girl state ",
    "cleaned_title": "alina akhtar yearold th class student lucknow st pauls college sent letter cm yogi said honorable chief minister want study",
    "cleaned_selftext": "honorable chief minister yogi adityanath ji beloved chief minister state entire country forced write letter sad heart full hope understand thoughts well take meaningful action honorable chief minister started studying nursery kg childrens palace school reached high school class studying st pauls college lucknow elder brother preparing go college completing intermediate finals studies till seen dad struggling lot seen problems increasing time earlier even books upper class useful provided relief gradually trend also ended syllabus changes every year becomes expensive soon studies completed books children every class become trash used children class done dont know copy books school fees become expensive even buying pen register become difficult apart competition studies made tough possible understand anything without tuition fees also less see daddy lot trouble arranging fees seeing problems cry lot many times feel like leaving studies remember said daughter educate save daughter india studies india progress honorable chief minister seen daddy selling moms jewelery arrange rs lakh elder brothers admission seen dad journalism honestly earn single rupee anyone wrong means teaches lesson honesty us dad received respect many places honesty writing good articles cover household expenses dads income limited situation next brothers education dont know honorable chief minister want study story millions children like us similar made many good changes state folded hands request make changes field education education become affordable everyone also end practice changing books every year books useful children lower classes thousands trees sacrifice lives make many books notebooks ordinary girl state",
    "cleaned_comments": "please link source hello yo bulli bai problems go away bulldojer sending right regs philosopher raja adityanath new jersey reddit hindus heard cheering muslim girl studying christian school go ajay bishts trash folder faster dick pill nigerian prince emails honestly depressing actually know anything demographic child beg education anyone plz tell cant study government school get scholarship based merit fuckin opposition disorganised incompetent even progressive issues bjp holding mantle even imaginary one please congress fire rahul gandhi get shit together want vote rather vote nota",
    "light_cleaned_title": "Alina Akhtar, a 14-year-old 10th class student of Lucknow St. Paul's College, sent a letter to CM Yogi Said \"Honorable Chief Minister, we want to study\"",
    "light_cleaned_selftext": "To Honorable Chief Minister Yogi Adityanath Ji To the most beloved Chief Minister of my state in the entire country, I am forced to write this letter with a sad heart. I have full hope that you will understand my thoughts well and take some meaningful action on this! Honorable Chief Minister, I started studying from Nursery KG from Children's Palace School and have reached high school class 10 while studying at St. Paul's College, Lucknow. And my elder brother is preparing to go to college after completing his intermediate finals. During my studies till now, I have seen my dad struggling a lot, I have seen his problems increasing with time, earlier even the books of upper class were useful, which provided some relief, gradually This trend has also ended, the syllabus changes every year, and becomes very expensive, as soon as the studies are completed, the books of the children of every class become trash, they cannot be used again by the children of the class below! Why this is done, I don't know! Copy books and school fees have become so expensive that even buying a pen or register in between has become difficult. Apart from this, the competition and studies have been made so tough that it is not possible to understand anything without tuition. His fees are also no less! We see daddy having a lot of trouble in arranging the fees. Seeing his problems, we cry a lot, many times I feel like leaving studies, but I remember what you all said that daughter. Educate, save your daughter, and if India studies, India will progress! Honorable Chief Minister, we have seen daddy selling mom's jewelery to arrange Rs 1 lakh for elder brother's admission! Because we have seen our dad doing journalism very honestly, he does not earn a single rupee from anyone through any wrong means, he teaches the lesson of honesty to us too! My dad has received respect in many places because of his honesty and writing good articles, but this does not cover the household expenses, my dad's income is very limited, in such a situation, what will he do next for my and brother's education? We don't know! Honorable Chief Minister, we want to study! The story of millions of children like us is similar to ours! You have made many good changes in your state, With folded hands, I request you to make some changes in the field of education so that education can become affordable for everyone. Also end the practice of changing books every year, so that those books can be useful to the children of lower classes, and thousands of trees do not have to sacrifice their lives to make so many books and notebooks. An ordinary girl from your state",
    "light_cleaned_comments": "Please link the source Hello 14-yo bulli bai, all your problems will go away with bulldojer. Sending some right now - Regs, philosopher raja Adityanath. New Jersey and Reddit Hindus heard cheering... Muslim Girl studying in Christian School. This will go to Ajay Bisht's Trash folder faster than dick pill and Nigerian prince emails. This is honestly depressing, I actually do not know anything about the demographic of UP but no child should beg for the education Can anyone plz tell Can’t she study in government school or get scholarship based on her merit ? Fuckin opposition is so disorganised & incompetent, that even on progressive issues, BJP is holding the mantle, even an imaginary one. Please Congress, fire Rahul Gandhi and get your shit together. I want to vote for you, but rather vote NOTA."
}