{
    "id": "151uom9",
    "title": "Should Air India Airlines (Tata Owned) modernize their Air hostess Saree uniform to Transparent version to compete better with more fashionable private Airlines with western outfits?",
    "url": "https://www.reddit.com/gallery/151uom9",
    "selftext": "Since other private Indian Airlines like Spice Jet, Indigo, etc, have opted for Western outfits like short skirts and tops as uniforms for their flight attendants, should Air India (as Tata bought it recently) step up their fashion and modernize their Air hostess Saree uniform to Transparent version, which is very common nowadays in Indian metropolitan Cities, to compete better with more fashionable private Airlines with their western outfits? \n\nShare your thoughts on this.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689578109.0,
    "convurl": "https://i.redd.it/fczzc0t57hcb1.jpg",
    "comments": [
        "All photos are publicly available in Google when searched for Transparent sarees.",
        "Perv !",
        "No, transparency does not serve any purpose other than being an eye candy to pervs. I would very much like a uniform in which the staff feels comfortable working in and looks decent at the same time.",
        "Why would you specifically want to objectify women? Saying that getting transparent saree to compete with more fashionable Airlines!!? You could have said it in different manner to not make it sound like that",
        "seriously dude ?",
        "Then they should allow only full pants and should ban short skirts as uniforms in private airlines as it shows the legs which objectives women ?",
        "No. They should stop with this whole air hostess thing itself. Eat at the airport, get on board, watch video, strap in, fly, and GTFO. For longer flights, maybe have stewards and marshalls.",
        "You could have phrase it differently dude. Saying competing with airlines via dresses of women sounds awful to me atleast\n\nYou could have just said that this dress would be a perfect choice in the current era for air India to finally upgrade their uniforms and give it modern touch",
        "Okay, now I got you.. Yeah modernization was the focus here.",
        "Yes, because short skirts are a hazard during emergency situations. This outdated practice of having girls wearing skimpy clothes serving you needs to stay in the 1960s where it belongs. It's a product of the patriarchy of those times, and we need to do better than that in 2023.",
        "Flight attendants are not there for you to oogle at them, creep.",
        "This is why India cannot have good things. Young people here are discussing transparency in clothes of air hostess instead of transparency Government offices.",
        "Like Hooters airline?",
        "Man this is such a Reddit moment.",
        "More like 4Chan moment.",
        "Number 1 tharki",
        "Creep alert",
        "How does transparency of a saree equal to modernization?\nI would rather see them in comfortable clothes which makes them.mobule to move and help me when I am in the fight , thank you!",
        "NOPE",
        "You know you are a South Indian when the eye automatically goes to the naval . Dear god, I am really ashamed of this !!!!"
    ],
    "cleaned_text": "air india airlines tata owned modernize air hostess saree uniform transparent version compete better fashionable private airlines western outfits since private indian airlines like spice jet indigo etc opted western outfits like short skirts tops uniforms flight attendants air india tata bought recently step fashion modernize air hostess saree uniform transparent version common nowadays indian metropolitan cities compete better fashionable private airlines western outfits share thoughts ",
    "cleaned_title": "air india airlines tata owned modernize air hostess saree uniform transparent version compete better fashionable private airlines western outfits",
    "cleaned_selftext": "since private indian airlines like spice jet indigo etc opted western outfits like short skirts tops uniforms flight attendants air india tata bought recently step fashion modernize air hostess saree uniform transparent version common nowadays indian metropolitan cities compete better fashionable private airlines western outfits share thoughts",
    "cleaned_comments": "photos publicly available google searched transparent sarees perv transparency serve purpose eye candy pervs would much like uniform staff feels comfortable working looks decent time would specifically want objectify women saying getting transparent saree compete fashionable airlines could said different manner make sound like seriously dude allow full pants ban short skirts uniforms private airlines shows legs objectives women stop whole air hostess thing eat airport get board watch video strap fly gtfo longer flights maybe stewards marshalls could phrase differently dude saying competing airlines via dresses women sounds awful atleast could said dress would perfect choice current era air india finally upgrade uniforms give modern touch okay got yeah modernization focus yes short skirts hazard emergency situations outdated practice girls wearing skimpy clothes serving needs stay belongs product patriarchy times need better flight attendants oogle creep india good things young people discussing transparency clothes air hostess instead transparency government offices like hooters airline man reddit moment like chan moment number tharki creep alert transparency saree equal modernization would rather see comfortable clothes makes themmobule move help fight thank nope know south indian eye automatically goes naval dear god really ashamed",
    "light_cleaned_title": "Should Air India Airlines (Tata Owned) modernize their Air hostess Saree uniform to Transparent version to compete better with more fashionable private Airlines with western outfits?",
    "light_cleaned_selftext": "Since other private Indian Airlines like Spice Jet, Indigo, etc, have opted for Western outfits like short skirts and tops as uniforms for their flight attendants, should Air India (as Tata bought it recently) step up their fashion and modernize their Air hostess Saree uniform to Transparent version, which is very common nowadays in Indian metropolitan Cities, to compete better with more fashionable private Airlines with their western outfits? Share your thoughts on this.",
    "light_cleaned_comments": "All photos are publicly available in Google when searched for Transparent sarees. Perv ! No, transparency does not serve any purpose other than being an eye candy to pervs. I would very much like a uniform in which the staff feels comfortable working in and looks decent at the same time. Why would you specifically want to objectify women? Saying that getting transparent saree to compete with more fashionable Airlines!!? You could have said it in different manner to not make it sound like that seriously dude ? Then they should allow only full pants and should ban short skirts as uniforms in private airlines as it shows the legs which objectives women ? No. They should stop with this whole air hostess thing itself. Eat at the airport, get on board, watch video, strap in, fly, and GTFO. For longer flights, maybe have stewards and marshalls. You could have phrase it differently dude. Saying competing with airlines via dresses of women sounds awful to me atleast You could have just said that this dress would be a perfect choice in the current era for air India to finally upgrade their uniforms and give it modern touch Okay, now I got you.. Yeah modernization was the focus here. Yes, because short skirts are a hazard during emergency situations. This outdated practice of having girls wearing skimpy clothes serving you needs to stay in the 1960s where it belongs. It's a product of the patriarchy of those times, and we need to do better than that in 2023. Flight attendants are not there for you to oogle at them, creep. This is why India cannot have good things. Young people here are discussing transparency in clothes of air hostess instead of transparency Government offices. Like Hooters airline? Man this is such a Reddit moment. More like 4Chan moment. Number 1 tharki Creep alert How does transparency of a saree equal to modernization? I would rather see them in comfortable clothes which makes them.mobule to move and help me when I am in the fight , thank you! NOPE You know you are a South Indian when the eye automatically goes to the naval . Dear god, I am really ashamed of this !!!!"
}