{
    "id": "1crmvkt",
    "title": "Deep fake alert! ",
    "url": "https://v.redd.it/zukk7xk3oc0d1",
    "selftext": "Scamsters sponsoring deep fake videos on @facebook India. Featuring Mukesh Ambani, Nandan Nilekani, Narayana Murthy and Rajdeep Sardesai. \n\nSeems too real. You just need to listen to the diction of each of the speakers to know it's not them. And in addition doesn't look like it's been created by Indians (again cue from how they said the names, and Indians rarely speak in terms of millions) \n\nThis came up on my Dad's Facebook feed. Obviously a lot of non tech savvy people could fall prey. ",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1715674153.0,
    "convurl": "https://external-preview.redd.it/YXhpa3hlYzNvYzBkMZqDnll1xx41M4rQKgZtW2vyT_EXKP9VFxckmCdQcDc5.png?format=pjpg&auto=webp&s=2a032dc6545648a32998a4fc2c4db5fb4b2d39b4",
    "comments": [],
    "cleaned_text": "deep fake alert scamsters sponsoring deep fake videos facebook india featuring mukesh ambani nandan nilekani narayana murthy rajdeep sardesai seems real need listen diction speakers know addition doesnt look like created indians cue said names indians rarely speak terms millions came dads facebook feed obviously lot non tech savvy people could fall prey ",
    "cleaned_title": "deep fake alert",
    "cleaned_selftext": "scamsters sponsoring deep fake videos facebook india featuring mukesh ambani nandan nilekani narayana murthy rajdeep sardesai seems real need listen diction speakers know addition doesnt look like created indians cue said names indians rarely speak terms millions came dads facebook feed obviously lot non tech savvy people could fall prey",
    "cleaned_comments": "",
    "light_cleaned_title": "Deep fake alert!",
    "light_cleaned_selftext": "Scamsters sponsoring deep fake videos on @facebook India. Featuring Mukesh Ambani, Nandan Nilekani, Narayana Murthy and Rajdeep Sardesai. Seems too real. You just need to listen to the diction of each of the speakers to know it's not them. And in addition doesn't look like it's been created by Indians (again cue from how they said the names, and Indians rarely speak in terms of millions) This came up on my Dad's Facebook feed. Obviously a lot of non tech savvy people could fall prey.",
    "light_cleaned_comments": ""
}