{
    "id": "159web8",
    "title": "1.5 month old tortie kitten up for adoption!",
    "url": "https://www.reddit.com/gallery/159web8",
    "selftext": "Hi all! My boyfriend found a very small kitten outside in a park. Poor thing was so malnourished and frail. Right now she is with us. We named her Diane, after the Bojack horseman character :)\n\nShe's super affectionate, adorable, loving. She will groom you, sleep with you, sleep on your lap and will give you kisses. My bet is someone dumped her :(\n\nPlease let me know if anyone wants to adopt her! All vaccines, medical bills and sterilization sponsored by me :)\n\nShe literally brightens up our days. Wish we could keep her but we're not going to be in India soon and it sucks. I promise she'll love you forever ❤️",
    "flair": "AskIndia",
    "score": 6,
    "num_comments": 2,
    "created_utc": 1690348742.0,
    "convurl": "https://i.redd.it/6013xxcnu8eb1.jpg",
    "comments": [
        "Cute kitten!",
        "Where are you",
        "Mumbai :)",
        "Holly molly this is cute. I was myself looking for a cat to adopt but unfortunately i am from rajasthan. Wish you were closer man \nI hope you find someone else soon."
    ],
    "cleaned_text": "month old tortie kitten adoption hi boyfriend found small kitten outside park poor thing malnourished frail right us named diane bojack horseman character shes super affectionate adorable loving groom sleep sleep lap give kisses bet someone dumped please let know anyone wants adopt vaccines medical bills sterilization sponsored literally brightens days wish could keep going india soon sucks promise shell love forever ",
    "cleaned_title": "month old tortie kitten adoption",
    "cleaned_selftext": "hi boyfriend found small kitten outside park poor thing malnourished frail right us named diane bojack horseman character shes super affectionate adorable loving groom sleep sleep lap give kisses bet someone dumped please let know anyone wants adopt vaccines medical bills sterilization sponsored literally brightens days wish could keep going india soon sucks promise shell love forever",
    "cleaned_comments": "cute kitten mumbai holly molly cute looking cat adopt unfortunately rajasthan wish closer man hope find someone else soon",
    "light_cleaned_title": "1.5 month old tortie kitten up for adoption!",
    "light_cleaned_selftext": "Hi all! My boyfriend found a very small kitten outside in a park. Poor thing was so malnourished and frail. Right now she is with us. We named her Diane, after the Bojack horseman character :) She's super affectionate, adorable, loving. She will groom you, sleep with you, sleep on your lap and will give you kisses. My bet is someone dumped her :( Please let me know if anyone wants to adopt her! All vaccines, medical bills and sterilization sponsored by me :) She literally brightens up our days. Wish we could keep her but we're not going to be in India soon and it sucks. I promise she'll love you forever ❤️",
    "light_cleaned_comments": "Cute kitten! Where are you Mumbai :) Holly molly this is cute. I was myself looking for a cat to adopt but unfortunately i am from rajasthan. Wish you were closer man I hope you find someone else soon."
}