{
    "id": "150ceu0",
    "title": "Chinese loan app case | Enforcement Directorate chargesheet recounts misery of victims",
    "url": "https://www.reddit.com/r/india/comments/150ceu0/chinese_loan_app_case_enforcement_directorate/",
    "selftext": "This is a 4 month old Hindu article, from March 18, 2023. Sharing it here, because of ignorance displayed by most commenters, and victim blaming by many others in the other thread, where a victim was sharing their story. \n\nhttps://www.thehindu.com/news/national/chinese-loan-app-case-enforcement-directorate-chargesheet-recounts-misery-of-victims/article66635357.ece\n\n> In dire need of money, Vaishali (name changed) installed an app on her mobile phone on July 23, 2020. Having allowed access to her phone data and furnished the details of her Permanent Account Number (PAN), Aadhaar and bank account, she borrowed a meagre sum of about ₹4,500 through the micro-loan digital platform.\n\n> In order to pay back the demanded sum, Ms. Vaishali had to take loans from other apps, such as “Money Box”, “Loan Gram”, “My Bank”, “Coco Cash”, “Cashpot”, “Need Rupee” and “Panda Rupee”.\n\n> “...She stated that in spite of paying the full amount some unknown persons representing the apps started threatening her to pay the extra amount. They also used obscene words and intimidated her through phone calls, SMS messages, WhatsApp, etc. to have sexual intercourse with them,” alleges the Enforcement Directorate (ED), which has charged seven entities and five individuals in the “Chinese loan app” case.\n\n> The accused would also threaten to upload the victim’s photos on “adult” websites. When she ignored the threats, her images with her contact number were circulated in a WhatsApp group created by using her phone contact list. The chargesheet records multiple such instances.\n\n> In another case, Iqbal also took loans from several apps to clear the previous debt. The terms and conditions were modified while sanctioning the loan such that the duration was reduced from 92 to seven days. He received messages that his Aadhaar and PAN would be blocked. His relatives were threatened and his photographs bearing words like “ Chor” (thief) and “Fraud customer” were circulated. His women contacts were targeted and sent obscene messages.\n\n> Explaining the modus operandi, the ED alleged that the apps usually deducted 30%-40% of the sanctioned loan amount as processing fee. “A perusal of sample loan sanction letters by [accused] X10 Financial Service in collaboration with [accused] Mad Elephant Network Technologies revealed that the effective interest rate...comes to 2,233% per annum,” an official said.\n\n> Quoting a report by the Bengaluru Police, the agency said owners of the apps were some front-end Indian entities, for which instructions came from Chinese citizens. They entered into agreements with non-bank financial companies (NBFC) for giving out loans. Each entity had floated several apps that were installed, accessed, used and monitored from cloud-based servers in China.\n\n> Among those charged by the ED are “Chinese controlled” Mad Elephant, Baryonyx Technology and Cloud Atlas Future Technology. Three NBFCs, identified as X10 Financial Services, Track Fin-ed and Jamnadas Morarjee Finance, besides payment gateway Razorpay Software, have also been listed. Mad Elephant was represented by its directors Vidyavati Dhami and Chinese national Yan Peng Qu.\n\n> A look-out circular has been opened against fugitive Qu. In her statement to the agency, Ms. Dhami allegedly said that she had joined as an HR manager. She was also made a director in Yoyo Cash Technology, registered in October 2020. The same year, without any appointment letter, she was told to operate as a director of Mad Elephant by a woman called “Ms. Jin”, who was from a Hong Kong-based parent company, Rumming Tech.\n\n> Ms. Dhami allegedly told the ED that YOYO cash and Mad Elephant operated as service providers to X10 Financial Services and that Mad Elephant helped in loan recovery, provided new borrowers and their KYC (know your customer) documents. She said Ms. Jin and Qu, who went back to China in November 2020, managed the companies from there. Call centres, with about 250 employees, had been set up in India to deal with the borrowers.\n\n> The accused NBFCs would receive their share, ranging from 0.4% to 1.5% of the total disbursement, or a minimum commitment on a monthly basis, of the amount specified in the agreements, whichever was higher.\n\n> As alleged by the ED, in the case of X10 Financial Services-Mad Elephant, loans totalling ₹306.97 crore were sanctioned on an investment of about ₹9.74 crore and ₹89.95 crore was earned, while bad debts amounted to ₹38.05 crore. The final share of Mad Elephant was ₹46.76 crore, and the rest went to X10 Financial Services. Baryonyx Technologies registered pay-in transactions worth over ₹665 crore and pay-outs to the tune of ₹594 crore. Jamnadas Morarjee Finance, which had an agreement with Cloud Atlas, had recorded transactions amounting to over ₹42.44 crore.\n\nEmphasizing the Important bits, since most people who'll comment here too wouldn't have read the article, even when served on a platter\n\nCASE 1\n\n1. allowed access to her phone data and furnished the details of her Permanent Account Number (PAN), Aadhaar and bank account\n\n2.  in spite of paying the full amount some unknown persons representing the apps started threatening her to pay the extra amount.\n\n3. used obscene words and intimidated her through phone calls, SMS messages, WhatsApp, etc. to have sexual intercourse with them\n\n4. When she ignored the threats, her images with her contact number were circulated in a WhatsApp group created by using her phone contact list.\n\nCASE 2\n\n1. terms and conditions were modified while sanctioning the loan such that the duration was reduced from 92 to seven days.\n\n2. His relatives were threatened and his photographs bearing words like “ Chor” (thief) and “Fraud customer” were circulated. His women contacts were targeted and sent obscene messages.\n\nWhat ED Investigation Revealed:\n\n1. \"The chargesheet records multiple such instances.\"\n\n2. apps usually deducted 30%-40% of the sanctioned loan amount as processing fee\n\n3. owners of the apps were some front-end Indian entities, for which instructions came from Chinese citizens.\n\n4. They entered into agreements with non-bank financial companies (NBFC) for giving out loans. Each entity had floated several apps that were installed, accessed, used and monitored from cloud-based servers in China........ NBFCs would receive their share, ranging from 0.4% to 1.5% of the total disbursement.\n\nThis article in Businessline also elaborates on the modus operandi: https://www.thehindubusinessline.com/news/ed-files-chargesheet-in-chinese-loan-app-case/article66564721.ece\n\n> Chinese nationals were diverting money collected by offering loans through various merchant IDs linked to payment gateways and banks. These merchant IDs were front companies as ED inquiry revealed that they did not exist on the addresses declared to ministry of corporate affairs. \n\nSo, Yes, these ARE Chinese Loan apps. \n\nNo, most people who take loan from these apps are not as privileged as you; their victims are mostly poor, they resort to these apps only when they're DESPERATE for money, and NO OTHER AVENUE to get money from. Its not as simple as \"Don't take the loan LOL\".\n\nNO, VICTIMS DO NOT SHARE THE BLAME. They are Victims of a system that is Stacked against them from the beginning.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689428597.0,
    "convurl": "https://external-preview.redd.it/_xP5RzKCKfpATwfZoTadE3-dRkJVY1km_VsY-W-umOE.jpg?auto=webp&s=b753cc39b406c13fa3ddedf522dde269651c788b",
    "comments": [
        "This happened with a neighbour of mine. He says that he hasn't taken any loan but someone else did. He works at a BPO where he had submitted his pan and Adhar details and someone misused it. \n\nIn his case they first started calling him and his parents phone, then one person visited his home who ran away when he was threatened with police action. Then one day three people came and left after colony people gathered to confront them. Since then the calls have stopped. I dunno if it was police action threat or this ongoing investigation.",
        "Can't imagine the stress from something like that. I'd want to do unimaginable things to someone who harasses me like that.\n\nCollective confrontation of these scums and social support for victims is a good way forward to prevent loss of lives from such harassment."
    ],
    "cleaned_text": "chinese loan app case enforcement directorate chargesheet recounts misery victims month old hindu article march sharing ignorance displayed commenters victim blaming many others thread victim sharing story dire need money vaishali name changed installed app mobile phone july allowed access phone data furnished details permanent account number pan aadhaar bank account borrowed meagre sum microloan digital platform order pay back demanded sum ms vaishali take loans apps money box loan gram bank coco cash cashpot need rupee panda rupee stated spite paying full amount unknown persons representing apps started threatening pay extra amount also used obscene words intimidated phone calls sms messages whatsapp etc sexual intercourse alleges enforcement directorate ed charged seven entities five individuals chinese loan app case accused would also threaten upload victims photos adult websites ignored threats images contact number circulated whatsapp group created using phone contact list chargesheet records multiple instances another case iqbal also took loans several apps clear previous debt terms conditions modified sanctioning loan duration reduced seven days received messages aadhaar pan would blocked relatives threatened photographs bearing words like chor thief fraud customer circulated women contacts targeted sent obscene messages explaining modus operandi ed alleged apps usually deducted sanctioned loan amount processing fee perusal sample loan sanction letters accused x financial service collaboration accused mad elephant network technologies revealed effective interest ratecomes per annum official said quoting report bengaluru police agency said owners apps frontend indian entities instructions came chinese citizens entered agreements nonbank financial companies nbfc giving loans entity floated several apps installed accessed used monitored cloudbased servers china among charged ed chinese controlled mad elephant baryonyx technology cloud atlas future technology three nbfcs identified x financial services track fined jamnadas morarjee finance besides payment gateway razorpay software also listed mad elephant represented directors vidyavati dhami chinese national yan peng qu lookout circular opened fugitive qu statement agency ms dhami allegedly said joined hr manager also made director yoyo cash technology registered october year without appointment letter told operate director mad elephant woman called ms jin hong kongbased parent company rumming tech ms dhami allegedly told ed yoyo cash mad elephant operated service providers x financial services mad elephant helped loan recovery provided new borrowers kyc know customer documents said ms jin qu went back china november managed companies call centres employees set india deal borrowers accused nbfcs would receive share ranging total disbursement minimum commitment monthly basis amount specified agreements whichever higher alleged ed case x financial servicesmad elephant loans totalling crore sanctioned investment crore crore earned bad debts amounted crore final share mad elephant crore rest went x financial services baryonyx technologies registered payin transactions worth crore payouts tune crore jamnadas morarjee finance agreement cloud atlas recorded transactions amounting crore emphasizing important bits since people wholl comment wouldnt read article even served platter case allowed access phone data furnished details permanent account number pan aadhaar bank account spite paying full amount unknown persons representing apps started threatening pay extra amount used obscene words intimidated phone calls sms messages whatsapp etc sexual intercourse ignored threats images contact number circulated whatsapp group created using phone contact list case terms conditions modified sanctioning loan duration reduced seven days relatives threatened photographs bearing words like chor thief fraud customer circulated women contacts targeted sent obscene messages ed investigation revealed chargesheet records multiple instances apps usually deducted sanctioned loan amount processing fee owners apps frontend indian entities instructions came chinese citizens entered agreements nonbank financial companies nbfc giving loans entity floated several apps installed accessed used monitored cloudbased servers china nbfcs would receive share ranging total disbursement article businessline also elaborates modus operandi chinese nationals diverting money collected offering loans various merchant ids linked payment gateways banks merchant ids front companies ed inquiry revealed exist addresses declared ministry corporate affairs yes chinese loan apps people take loan apps privileged victims mostly poor resort apps theyre desperate money avenue get money simple dont take loan lol victims share blame victims system stacked beginning ",
    "cleaned_title": "chinese loan app case enforcement directorate chargesheet recounts misery victims",
    "cleaned_selftext": "month old hindu article march sharing ignorance displayed commenters victim blaming many others thread victim sharing story dire need money vaishali name changed installed app mobile phone july allowed access phone data furnished details permanent account number pan aadhaar bank account borrowed meagre sum microloan digital platform order pay back demanded sum ms vaishali take loans apps money box loan gram bank coco cash cashpot need rupee panda rupee stated spite paying full amount unknown persons representing apps started threatening pay extra amount also used obscene words intimidated phone calls sms messages whatsapp etc sexual intercourse alleges enforcement directorate ed charged seven entities five individuals chinese loan app case accused would also threaten upload victims photos adult websites ignored threats images contact number circulated whatsapp group created using phone contact list chargesheet records multiple instances another case iqbal also took loans several apps clear previous debt terms conditions modified sanctioning loan duration reduced seven days received messages aadhaar pan would blocked relatives threatened photographs bearing words like chor thief fraud customer circulated women contacts targeted sent obscene messages explaining modus operandi ed alleged apps usually deducted sanctioned loan amount processing fee perusal sample loan sanction letters accused x financial service collaboration accused mad elephant network technologies revealed effective interest ratecomes per annum official said quoting report bengaluru police agency said owners apps frontend indian entities instructions came chinese citizens entered agreements nonbank financial companies nbfc giving loans entity floated several apps installed accessed used monitored cloudbased servers china among charged ed chinese controlled mad elephant baryonyx technology cloud atlas future technology three nbfcs identified x financial services track fined jamnadas morarjee finance besides payment gateway razorpay software also listed mad elephant represented directors vidyavati dhami chinese national yan peng qu lookout circular opened fugitive qu statement agency ms dhami allegedly said joined hr manager also made director yoyo cash technology registered october year without appointment letter told operate director mad elephant woman called ms jin hong kongbased parent company rumming tech ms dhami allegedly told ed yoyo cash mad elephant operated service providers x financial services mad elephant helped loan recovery provided new borrowers kyc know customer documents said ms jin qu went back china november managed companies call centres employees set india deal borrowers accused nbfcs would receive share ranging total disbursement minimum commitment monthly basis amount specified agreements whichever higher alleged ed case x financial servicesmad elephant loans totalling crore sanctioned investment crore crore earned bad debts amounted crore final share mad elephant crore rest went x financial services baryonyx technologies registered payin transactions worth crore payouts tune crore jamnadas morarjee finance agreement cloud atlas recorded transactions amounting crore emphasizing important bits since people wholl comment wouldnt read article even served platter case allowed access phone data furnished details permanent account number pan aadhaar bank account spite paying full amount unknown persons representing apps started threatening pay extra amount used obscene words intimidated phone calls sms messages whatsapp etc sexual intercourse ignored threats images contact number circulated whatsapp group created using phone contact list case terms conditions modified sanctioning loan duration reduced seven days relatives threatened photographs bearing words like chor thief fraud customer circulated women contacts targeted sent obscene messages ed investigation revealed chargesheet records multiple instances apps usually deducted sanctioned loan amount processing fee owners apps frontend indian entities instructions came chinese citizens entered agreements nonbank financial companies nbfc giving loans entity floated several apps installed accessed used monitored cloudbased servers china nbfcs would receive share ranging total disbursement article businessline also elaborates modus operandi chinese nationals diverting money collected offering loans various merchant ids linked payment gateways banks merchant ids front companies ed inquiry revealed exist addresses declared ministry corporate affairs yes chinese loan apps people take loan apps privileged victims mostly poor resort apps theyre desperate money avenue get money simple dont take loan lol victims share blame victims system stacked beginning",
    "cleaned_comments": "happened neighbour mine says hasnt taken loan someone else works bpo submitted pan adhar details someone misused case first started calling parents phone one person visited home ran away threatened police action one day three people came left colony people gathered confront since calls stopped dunno police action threat ongoing investigation cant imagine stress something like id want unimaginable things someone harasses like collective confrontation scums social support victims good way forward prevent loss lives harassment",
    "light_cleaned_title": "Chinese loan app case | Enforcement Directorate chargesheet recounts misery of victims",
    "light_cleaned_selftext": "This is a 4 month old Hindu article, from March 18, 2023. Sharing it here, because of ignorance displayed by most commenters, and victim blaming by many others in the other thread, where a victim was sharing their story. > In dire need of money, Vaishali (name changed) installed an app on her mobile phone on July 23, 2020. Having allowed access to her phone data and furnished the details of her Permanent Account Number (PAN), Aadhaar and bank account, she borrowed a meagre sum of about ₹4,500 through the micro-loan digital platform. > In order to pay back the demanded sum, Ms. Vaishali had to take loans from other apps, such as “Money Box”, “Loan Gram”, “My Bank”, “Coco Cash”, “Cashpot”, “Need Rupee” and “Panda Rupee”. > “...She stated that in spite of paying the full amount some unknown persons representing the apps started threatening her to pay the extra amount. They also used obscene words and intimidated her through phone calls, SMS messages, WhatsApp, etc. to have sexual intercourse with them,” alleges the Enforcement Directorate (ED), which has charged seven entities and five individuals in the “Chinese loan app” case. > The accused would also threaten to upload the victim’s photos on “adult” websites. When she ignored the threats, her images with her contact number were circulated in a WhatsApp group created by using her phone contact list. The chargesheet records multiple such instances. > In another case, Iqbal also took loans from several apps to clear the previous debt. The terms and conditions were modified while sanctioning the loan such that the duration was reduced from 92 to seven days. He received messages that his Aadhaar and PAN would be blocked. His relatives were threatened and his photographs bearing words like “ Chor” (thief) and “Fraud customer” were circulated. His women contacts were targeted and sent obscene messages. > Explaining the modus operandi, the ED alleged that the apps usually deducted 30%-40% of the sanctioned loan amount as processing fee. “A perusal of sample loan sanction letters by [accused] X10 Financial Service in collaboration with [accused] Mad Elephant Network Technologies revealed that the effective interest rate...comes to 2,233% per annum,” an official said. > Quoting a report by the Bengaluru Police, the agency said owners of the apps were some front-end Indian entities, for which instructions came from Chinese citizens. They entered into agreements with non-bank financial companies (NBFC) for giving out loans. Each entity had floated several apps that were installed, accessed, used and monitored from cloud-based servers in China. > Among those charged by the ED are “Chinese controlled” Mad Elephant, Baryonyx Technology and Cloud Atlas Future Technology. Three NBFCs, identified as X10 Financial Services, Track Fin-ed and Jamnadas Morarjee Finance, besides payment gateway Razorpay Software, have also been listed. Mad Elephant was represented by its directors Vidyavati Dhami and Chinese national Yan Peng Qu. > A look-out circular has been opened against fugitive Qu. In her statement to the agency, Ms. Dhami allegedly said that she had joined as an HR manager. She was also made a director in Yoyo Cash Technology, registered in October 2020. The same year, without any appointment letter, she was told to operate as a director of Mad Elephant by a woman called “Ms. Jin”, who was from a Hong Kong-based parent company, Rumming Tech. > Ms. Dhami allegedly told the ED that YOYO cash and Mad Elephant operated as service providers to X10 Financial Services and that Mad Elephant helped in loan recovery, provided new borrowers and their KYC (know your customer) documents. She said Ms. Jin and Qu, who went back to China in November 2020, managed the companies from there. Call centres, with about 250 employees, had been set up in India to deal with the borrowers. > The accused NBFCs would receive their share, ranging from 0.4% to 1.5% of the total disbursement, or a minimum commitment on a monthly basis, of the amount specified in the agreements, whichever was higher. > As alleged by the ED, in the case of X10 Financial Services-Mad Elephant, loans totalling ₹306.97 crore were sanctioned on an investment of about ₹9.74 crore and ₹89.95 crore was earned, while bad debts amounted to ₹38.05 crore. The final share of Mad Elephant was ₹46.76 crore, and the rest went to X10 Financial Services. Baryonyx Technologies registered pay-in transactions worth over ₹665 crore and pay-outs to the tune of ₹594 crore. Jamnadas Morarjee Finance, which had an agreement with Cloud Atlas, had recorded transactions amounting to over ₹42.44 crore. Emphasizing the Important bits, since most people who'll comment here too wouldn't have read the article, even when served on a platter CASE 1 1. allowed access to her phone data and furnished the details of her Permanent Account Number (PAN), Aadhaar and bank account 2. in spite of paying the full amount some unknown persons representing the apps started threatening her to pay the extra amount. 3. used obscene words and intimidated her through phone calls, SMS messages, WhatsApp, etc. to have sexual intercourse with them 4. When she ignored the threats, her images with her contact number were circulated in a WhatsApp group created by using her phone contact list. CASE 2 1. terms and conditions were modified while sanctioning the loan such that the duration was reduced from 92 to seven days. 2. His relatives were threatened and his photographs bearing words like “ Chor” (thief) and “Fraud customer” were circulated. His women contacts were targeted and sent obscene messages. What ED Investigation Revealed: 1. \"The chargesheet records multiple such instances.\" 2. apps usually deducted 30%-40% of the sanctioned loan amount as processing fee 3. owners of the apps were some front-end Indian entities, for which instructions came from Chinese citizens. 4. They entered into agreements with non-bank financial companies (NBFC) for giving out loans. Each entity had floated several apps that were installed, accessed, used and monitored from cloud-based servers in China........ NBFCs would receive their share, ranging from 0.4% to 1.5% of the total disbursement. This article in Businessline also elaborates on the modus operandi: > Chinese nationals were diverting money collected by offering loans through various merchant IDs linked to payment gateways and banks. These merchant IDs were front companies as ED inquiry revealed that they did not exist on the addresses declared to ministry of corporate affairs. So, Yes, these ARE Chinese Loan apps. No, most people who take loan from these apps are not as privileged as you; their victims are mostly poor, they resort to these apps only when they're DESPERATE for money, and NO OTHER AVENUE to get money from. Its not as simple as \"Don't take the loan LOL\". NO, VICTIMS DO NOT SHARE THE BLAME. They are Victims of a system that is Stacked against them from the beginning.",
    "light_cleaned_comments": "This happened with a neighbour of mine. He says that he hasn't taken any loan but someone else did. He works at a BPO where he had submitted his pan and Adhar details and someone misused it. In his case they first started calling him and his parents phone, then one person visited his home who ran away when he was threatened with police action. Then one day three people came and left after colony people gathered to confront them. Since then the calls have stopped. I dunno if it was police action threat or this ongoing investigation. Can't imagine the stress from something like that. I'd want to do unimaginable things to someone who harasses me like that. Collective confrontation of these scums and social support for victims is a good way forward to prevent loss of lives from such harassment."
}