{
    "id": "1h8ufh6",
    "title": "False accusation at the bank—what should I do now?\nNot A Lawyer",
    "url": "https://www.reddit.com/r/india/comments/1h8ufh6/false_accusation_at_the_bankwhat_should_i_do_now/",
    "selftext": "Hi everyone,\n\nI’m an 18-year-old male, and I had a really humiliating experience at a Bank of India branch yesterday. I need advice on what to do next. Here’s what happened:\n\nI went to deposit some money through the cash deposit machine. The first two attempts were unsuccessful, and I ended up with two useless receipts, which I tore up and threw into the dustbin nearby. A bank employee—a woman—was observing me the entire time.\n\nAfter successfully depositing the money, I went to update my passbook. When I went to get it verified, another agent told me that only the woman I mentioned earlier could handle the verification. So, I approached her.\n\nOut of nowhere, she rudely accused me of spitting in the dustbin! She started yelling at me in front of at least 30 people in the bank, making me feel extremely embarrassed.\n\nI firmly told her I had not spit and asked her to check the CCTV footage to confirm. However, she refused to show the footage and kept scolding me loudly. Despite trying to defend myself, everyone in the bank seemed to believe I was at fault. I even raised my voice a bit in frustration, but honestly, I was so shaken that I couldn’t handle the situation well.\n\nNow, I’m left feeling humiliated and helpless because I know I didn’t do anything wrong.\n\n👉 What should I do next?  \n👉 Should I escalate this to the branch manager or higher authorities?  \n👉 Is it possible to formally request CCTV footage to clear my name?\n\nI am appalled by the service and behavior at [u/BankofIndia\\_IN](https://x.com/BankofIndia_IN) Not only have I been waiting over a year for my ATM card despite multiple applications, but today I faced sheer unprofessionalism. While responsibly disposing of an useless receipt in the dustbin, a staff member falsely accused me of spitting and proceeded to lecture me rudely without verifying facts. When I requested to see the CCTV footage, they outright refused.This is not how customers should be treated. I demand immediate access to the CCTV footage, a formal apology, and swift action to resolve my ATM card issue. This level of harassment is unacceptable! [\\#CustomerRights](https://x.com/hashtag/CustomerRights?src=hashtag_click) [\\#Professionalism](https://x.com/hashtag/Professionalism?src=hashtag_click) [\\#BankingIssues](https://x.com/hashtag/BankingIssues?src=hashtag_click) Additionally, I am utterly shocked by the sheer incompetence and personal vendetta at [u/BankofIndia\\_IN](https://x.com/BankofIndia_IN) After filling out the ATM card application form for the 1000th time and getting my mother’s signature the same agent who previously falsely accused me of spitting intentionally postponed my request and told me to bring my mother again, even though she had already signed. This was nothing but a deliberate attempt to frustrate me and delay my process out of PERSONAL ANGER.  \nThis was my tweet yesterday I got a call from the bank today, but it was on my mom's phone. They mentioned they need her to come in for the ATM card. However, the agent completely ignored my request for the apology letter and the CCTV footage. I was expecting them to address those issues as well, but no mention of it at all. Looks like it’s just about the ATM card for now.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1733584166.0,
    "convurl": "https://external-preview.redd.it/4GKE6j35jJDg5lQk8EdnHu-BAjpDfOzmJm7vPVYPhks.jpg?auto=webp&s=888a3ccb9f577c64aa584d6f63a959415f1a4035",
    "comments": [],
    "cleaned_text": "false accusation bankwhat lawyer hi everyone im yearold male really humiliating experience bank india branch yesterday need advice next heres happened went deposit money cash deposit machine first two attempts unsuccessful ended two useless receipts tore threw dustbin nearby bank employeea womanwas observing entire time successfully depositing money went update passbook went get verified another agent told woman mentioned earlier could handle verification approached nowhere rudely accused spitting dustbin started yelling front least people bank making feel extremely embarrassed firmly told spit asked check cctv footage confirm however refused show footage kept scolding loudly despite trying defend everyone bank seemed believe fault even raised voice bit frustration honestly shaken couldnt handle situation well im left feeling humiliated helpless know didnt anything wrong next escalate branch manager higher authorities possible formally request cctv footage clear name appalled service behavior ubankofindiainhttpsxcombankofindiain waiting year atm card despite multiple applications today faced sheer unprofessionalism responsibly disposing useless receipt dustbin staff member falsely accused spitting proceeded lecture rudely without verifying facts requested see cctv footage outright refusedthis customers treated demand immediate access cctv footage formal apology swift action resolve atm card issue level harassment unacceptable customerrightshttpsxcomhashtagcustomerrightssrchashtagclick professionalismhttpsxcomhashtagprofessionalismsrchashtagclick bankingissueshttpsxcomhashtagbankingissuessrchashtagclick additionally utterly shocked sheer incompetence personal vendetta ubankofindiainhttpsxcombankofindiain filling atm card application form th time getting mothers signature agent previously falsely accused spitting intentionally postponed request told bring mother even though already signed nothing deliberate attempt frustrate delay process personal anger tweet yesterday got call bank today moms phone mentioned need come atm card however agent completely ignored request apology letter cctv footage expecting address issues well mention looks like atm card ",
    "cleaned_title": "false accusation bankwhat lawyer",
    "cleaned_selftext": "hi everyone im yearold male really humiliating experience bank india branch yesterday need advice next heres happened went deposit money cash deposit machine first two attempts unsuccessful ended two useless receipts tore threw dustbin nearby bank employeea womanwas observing entire time successfully depositing money went update passbook went get verified another agent told woman mentioned earlier could handle verification approached nowhere rudely accused spitting dustbin started yelling front least people bank making feel extremely embarrassed firmly told spit asked check cctv footage confirm however refused show footage kept scolding loudly despite trying defend everyone bank seemed believe fault even raised voice bit frustration honestly shaken couldnt handle situation well im left feeling humiliated helpless know didnt anything wrong next escalate branch manager higher authorities possible formally request cctv footage clear name appalled service behavior ubankofindiainhttpsxcombankofindiain waiting year atm card despite multiple applications today faced sheer unprofessionalism responsibly disposing useless receipt dustbin staff member falsely accused spitting proceeded lecture rudely without verifying facts requested see cctv footage outright refusedthis customers treated demand immediate access cctv footage formal apology swift action resolve atm card issue level harassment unacceptable customerrightshttpsxcomhashtagcustomerrightssrchashtagclick professionalismhttpsxcomhashtagprofessionalismsrchashtagclick bankingissueshttpsxcomhashtagbankingissuessrchashtagclick additionally utterly shocked sheer incompetence personal vendetta ubankofindiainhttpsxcombankofindiain filling atm card application form th time getting mothers signature agent previously falsely accused spitting intentionally postponed request told bring mother even though already signed nothing deliberate attempt frustrate delay process personal anger tweet yesterday got call bank today moms phone mentioned need come atm card however agent completely ignored request apology letter cctv footage expecting address issues well mention looks like atm card",
    "cleaned_comments": "",
    "light_cleaned_title": "False accusation at the bank—what should I do now? Not A Lawyer",
    "light_cleaned_selftext": "Hi everyone, I’m an 18-year-old male, and I had a really humiliating experience at a Bank of India branch yesterday. I need advice on what to do next. Here’s what happened: I went to deposit some money through the cash deposit machine. The first two attempts were unsuccessful, and I ended up with two useless receipts, which I tore up and threw into the dustbin nearby. A bank employee—a woman—was observing me the entire time. After successfully depositing the money, I went to update my passbook. When I went to get it verified, another agent told me that only the woman I mentioned earlier could handle the verification. So, I approached her. Out of nowhere, she rudely accused me of spitting in the dustbin! She started yelling at me in front of at least 30 people in the bank, making me feel extremely embarrassed. I firmly told her I had not spit and asked her to check the CCTV footage to confirm. However, she refused to show the footage and kept scolding me loudly. Despite trying to defend myself, everyone in the bank seemed to believe I was at fault. I even raised my voice a bit in frustration, but honestly, I was so shaken that I couldn’t handle the situation well. Now, I’m left feeling humiliated and helpless because I know I didn’t do anything wrong. 👉 What should I do next? 👉 Should I escalate this to the branch manager or higher authorities? 👉 Is it possible to formally request CCTV footage to clear my name? I am appalled by the service and behavior at [u/BankofIndia\\_IN](https://x.com/BankofIndia_IN) Not only have I been waiting over a year for my ATM card despite multiple applications, but today I faced sheer unprofessionalism. While responsibly disposing of an useless receipt in the dustbin, a staff member falsely accused me of spitting and proceeded to lecture me rudely without verifying facts. When I requested to see the CCTV footage, they outright refused.This is not how customers should be treated. I demand immediate access to the CCTV footage, a formal apology, and swift action to resolve my ATM card issue. This level of harassment is unacceptable! [\\#CustomerRights](https://x.com/hashtag/CustomerRights?src=hashtag_click) [\\#Professionalism](https://x.com/hashtag/Professionalism?src=hashtag_click) [\\#BankingIssues](https://x.com/hashtag/BankingIssues?src=hashtag_click) Additionally, I am utterly shocked by the sheer incompetence and personal vendetta at [u/BankofIndia\\_IN](https://x.com/BankofIndia_IN) After filling out the ATM card application form for the 1000th time and getting my mother’s signature the same agent who previously falsely accused me of spitting intentionally postponed my request and told me to bring my mother again, even though she had already signed. This was nothing but a deliberate attempt to frustrate me and delay my process out of PERSONAL ANGER. This was my tweet yesterday I got a call from the bank today, but it was on my mom's phone. They mentioned they need her to come in for the ATM card. However, the agent completely ignored my request for the apology letter and the CCTV footage. I was expecting them to address those issues as well, but no mention of it at all. Looks like it’s just about the ATM card for now.",
    "light_cleaned_comments": ""
}