{
    "id": "14bhdw7",
    "title": "Contribute to Understanding the Role of Mobile Dating Apps in our Lives",
    "url": "https://www.reddit.com/r/india/comments/14bhdw7/contribute_to_understanding_the_role_of_mobile/",
    "selftext": " Hello India,\n\nAs our lives become increasingly digital, many aspects of our social interactions, including dating, are also shifting online. In the spirit of gaining a better understanding of this phenomenon, we, The Dating Team, have created a brief survey regarding mobile dating apps.\n\nWe invite \\*everyone\\* to participate - regardless of whether you've used these apps or not. Your input will help us understand the broad impact of these apps on our social fabric. The survey should take just 1-3 minutes to complete.\n\nHere's the link to the survey: \\[[https://forms.gle/qNfbqGJU2MLPdPDX9](https://forms.gle/qNfbqGJU2MLPdPDX9)\\]([https://forms.gle/qNfbqGJU2MLPdPDX9](https://forms.gle/qNfbqGJU2MLPdPDX9)).\n\nYour participation is greatly appreciated! Your perspective is valuable in helping us understand the bigger picture.\n\nBest,\n\nThe Dating Team",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1686976419.0,
    "convurl": "https://external-preview.redd.it/FIYlgafD9Eq5c_EuibXhKkLvGst0E0YDoATxYe6NsGI.jpg?auto=webp&v=enabled&s=8321a3bf3fcdb8400675df1d1ae4b24b3274d74b",
    "comments": [],
    "cleaned_text": "contribute understanding role mobile dating apps lives hello india lives become increasingly digital many aspects social interactions including dating also shifting online spirit gaining better understanding phenomenon dating team created brief survey regarding mobile dating apps invite everyone participate regardless whether youve used apps input help us understand broad impact apps social fabric survey take minutes complete heres link survey httpsformsgleqnfbqgjumlpdpdxhttpsformsgleqnfbqgjumlpdpdxhttpsformsgleqnfbqgjumlpdpdxhttpsformsgleqnfbqgjumlpdpdx participation greatly appreciated perspective valuable helping us understand bigger picture best dating team ",
    "cleaned_title": "contribute understanding role mobile dating apps lives",
    "cleaned_selftext": "hello india lives become increasingly digital many aspects social interactions including dating also shifting online spirit gaining better understanding phenomenon dating team created brief survey regarding mobile dating apps invite everyone participate regardless whether youve used apps input help us understand broad impact apps social fabric survey take minutes complete heres link survey httpsformsgleqnfbqgjumlpdpdxhttpsformsgleqnfbqgjumlpdpdxhttpsformsgleqnfbqgjumlpdpdxhttpsformsgleqnfbqgjumlpdpdx participation greatly appreciated perspective valuable helping us understand bigger picture best dating team",
    "cleaned_comments": "",
    "light_cleaned_title": "Contribute to Understanding the Role of Mobile Dating Apps in our Lives",
    "light_cleaned_selftext": "Hello India, As our lives become increasingly digital, many aspects of our social interactions, including dating, are also shifting online. In the spirit of gaining a better understanding of this phenomenon, we, The Dating Team, have created a brief survey regarding mobile dating apps. We invite \\*everyone\\* to participate - regardless of whether you've used these apps or not. Your input will help us understand the broad impact of these apps on our social fabric. The survey should take just 1-3 minutes to complete. Here's the link to the survey: \\[[https://forms.gle/qNfbqGJU2MLPdPDX9](https://forms.gle/qNfbqGJU2MLPdPDX9)\\]([https://forms.gle/qNfbqGJU2MLPdPDX9](https://forms.gle/qNfbqGJU2MLPdPDX9)). Your participation is greatly appreciated! Your perspective is valuable in helping us understand the bigger picture. Best, The Dating Team",
    "light_cleaned_comments": ""
}