{
    "id": "125a4p4",
    "title": "Help needed in understanding how eportal of Income Tax works.",
    "url": "https://www.reddit.com/r/india/comments/125a4p4/help_needed_in_understanding_how_eportal_of/",
    "selftext": "Hello folks,  \n\n\nI'm doing my ITR on my own and I find it really strange that the portal on 29 Mar still doesn't show the option to choose the next AY. The reason I say so is because I keep hearing following statements here in there  \n\n\n1. \"You should pay 90% of the tax using Advanced Taxes before 15 Mar.\"  The heck?! How would I? The portal doesn't let me choose the next AY. Of course, this comes from my understanding of \"the earnings you make this FY need to be paid in next.\"\n2. Last time, i.e., for FY 2021-22, I paid my ITR in June before 30th. Everything was okay but I was charged 1% of the income tax that was due for 2 months (Apr and May). It's not much but I need to understand what's the window where they allow us to pay without additional charges?\n\nHiring CA is an option but as of now my tax liabilities aren't that big that I need one so just asking. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/fa5yaiqb5lqa1.png?width=1922&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a351c6c83b3d44c8f6dcd02b1a3744a4a49bacfa",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 4,
    "created_utc": 1680056003,
    "convurl": "https://b.thumbs.redditmedia.com/06YNo5TEWeytLfLf1hw-822lV89vW2YvFPLqnpOb-CE.jpg",
    "comments": [
        "(Disclaimer: Not a CA, just another self-filer)\n\nAdvance tax payment is the actual transfer of money from your a/c to govt. \n\nITR just documents all your income and taxes paid for the previous FY. You don't *pay* ITR, you pay taxes and then *file* ITR some months later.\n\n*\"the earnings you make this FY need to be paid in next\"* =&gt; No, tax on income earned in an FY should be paid by March of that same FY. Only the ITR for previous FY is filed during the next FY.\n\nFrom the screenshot, it looks like you're on the wrong page due to misunderstanding the terms. \n\nIf you want to pay advance tax for current FY22-23, go to eFile &gt; ePay Tax &gt; New Payment &gt; Income Tax &gt; Select AY23-24.\n\nFor current FY22-23, all advance tax payment should have been done by March 15 '23. \n\n+ For most salaried assesses, it should have been paid every quarter between Apr'22 and Mar'23, and the last quarterly payment must be before March 15 '23. \n\n+ For some business income filings like ITR4, just one payment for the year instead of four is possible. That too must be before the same March 15 '23.\n\nAfter that, it's considered late payment and penalty accumulates with time. \n\nI think you got the fine for FY21-22 because you paid it only in June '22  instead of paying it before March 15 '22.",
        "Oh.. thanks. It all makes sense now, lol. The actual *payment* of taxes need to be done asap, yearly once in my case, but the *documentation* or filing can be done later on till whatever the last date is.",
        "Right. \n\nThe ITR filing facility usually opens up in May of next FY and last date is usually July 31 of next FY. Most people file in June/July. \n\nFor FY22-23, you can file your ITR this May-July. Last date for filing is likely to be July 31 '23."
    ],
    "cleaned_text": "help needed understanding eportal income tax works hello folks im itr find really strange portal mar still doesnt show option choose next ay reason say keep hearing following statements pay tax using advanced taxes mar heck would portal doesnt let choose next ay course comes understanding earnings make fy need paid next last time ie fy paid itr june th everything okay charged income tax due months apr may much need understand whats window allow us pay without additional charges hiring ca option tax liabilities arent big need one asking ampxb ",
    "cleaned_title": "help needed understanding eportal income tax works",
    "cleaned_selftext": "hello folks im itr find really strange portal mar still doesnt show option choose next ay reason say keep hearing following statements pay tax using advanced taxes mar heck would portal doesnt let choose next ay course comes understanding earnings make fy need paid next last time ie fy paid itr june th everything okay charged income tax due months apr may much need understand whats window allow us pay without additional charges hiring ca option tax liabilities arent big need one asking ampxb",
    "cleaned_comments": "disclaimer ca another selffiler advance tax payment actual transfer money ac govt itr documents income taxes paid previous fy dont pay itr pay taxes file itr months later earnings make fy need paid next gt tax income earned fy paid march fy itr previous fy filed next fy screenshot looks like youre wrong page due misunderstanding terms want pay advance tax current fy go efile gt epay tax gt new payment gt income tax gt select ay current fy advance tax payment done march salaried assesses paid every quarter apr mar last quarterly payment must march business income filings like itr one payment year instead four possible must march considered late payment penalty accumulates time think got fine fy paid june instead paying march oh thanks makes sense lol actual payment taxes need done asap yearly case documentation filing done later till whatever last date right itr filing facility usually opens may next fy last date usually july next fy people file junejuly fy file itr mayjuly last date filing likely july",
    "light_cleaned_title": "Help needed in understanding how eportal of Income Tax works.",
    "light_cleaned_selftext": "Hello folks, I'm doing my ITR on my own and I find it really strange that the portal on 29 Mar still doesn't show the option to choose the next AY. The reason I say so is because I keep hearing following statements here in there 1. \"You should pay 90% of the tax using Advanced Taxes before 15 Mar.\" The heck?! How would I? The portal doesn't let me choose the next AY. Of course, this comes from my understanding of \"the earnings you make this FY need to be paid in next.\" 2. Last time, i.e., for FY 2021-22, I paid my ITR in June before 30th. Everything was okay but I was charged 1% of the income tax that was due for 2 months (Apr and May). It's not much but I need to understand what's the window where they allow us to pay without additional charges? Hiring CA is an option but as of now my tax liabilities aren't that big that I need one so just asking.",
    "light_cleaned_comments": "(Disclaimer: Not a CA, just another self-filer) Advance tax payment is the actual transfer of money from your a/c to govt. ITR just documents all your income and taxes paid for the previous FY. You don't *pay* ITR, you pay taxes and then *file* ITR some months later. *\"the earnings you make this FY need to be paid in next\"* =&gt; No, tax on income earned in an FY should be paid by March of that same FY. Only the ITR for previous FY is filed during the next FY. From the screenshot, it looks like you're on the wrong page due to misunderstanding the terms. If you want to pay advance tax for current FY22-23, go to eFile &gt; ePay Tax &gt; New Payment &gt; Income Tax &gt; Select AY23-24. For current FY22-23, all advance tax payment should have been done by March 15 '23. + For most salaried assesses, it should have been paid every quarter between Apr'22 and Mar'23, and the last quarterly payment must be before March 15 '23. + For some business income filings like ITR4, just one payment for the year instead of four is possible. That too must be before the same March 15 '23. After that, it's considered late payment and penalty accumulates with time. I think you got the fine for FY21-22 because you paid it only in June '22 instead of paying it before March 15 '22. Oh.. thanks. It all makes sense now, lol. The actual *payment* of taxes need to be done asap, yearly once in my case, but the *documentation* or filing can be done later on till whatever the last date is. Right. The ITR filing facility usually opens up in May of next FY and last date is usually July 31 of next FY. Most people file in June/July. For FY22-23, you can file your ITR this May-July. Last date for filing is likely to be July 31 '23."
}