{
    "id": "18g9dpm",
    "title": "When people themselves are not conscious about security ...",
    "url": "https://www.reddit.com/r/india/comments/18g9dpm/when_people_themselves_are_not_conscious_about/",
    "selftext": "Time and again Law Enforcement, activists, apartment associations and resident welfare groups have been asking people to be self-reliant and ensure to be take at least the minimum measures from each of our side towards securing their personal life and property.\n\nIn our community there is one apartment where two Senior Citizens live alone. Their son is living separately in the next street because they do not seem to be going well with the terms of their daughter-in-law and were thrown out. Their son visits a few times in a week. Everyone have been advising them to have their doors locked during nights though the common lights are on in the community. The Senior Citizen often turns off the common lights citing it is adding to the electricity bill besides that he keeps the door open and sleeps.\n\nWhen any of us are outside during night hours for any reason we ensure to turn back the lights, provide a gentle knock on the door to ask them to lock the same for their own security because they often fall sound asleep. Round the clock we can not afford to keep a watch on them. We have informed their son and he seems to have *advised* him a few number of times too but in no avail. Even the Gurkha who used to come around 2 AM at times has knocked at their door reminding them to lock the door and sleep. But the same day morning the door is wide open again.\n\nThe root of the problem is that he hails from a remote village near Villupuram/Kallakurichi and hence in their village due to lesser number of houses they have got used to keep the doors open and rest due to lack of theft/burglary and/or untoward incidents. However his gesture of trying to emulate the same in a city atmosphere does not seem to be making everyone comfortable.\n\nWhen I saw making others uncomfortable means we can not keep muted seeing some one put themselves in risk due to their own lack of sensitivity to the perils lurking in the atmosphere.\n\nWhen everyone of us have witnessed this kind of insecurity practised by Senior Citizen couple and advised them, definitely con-men would have added them to their watch list too. If something untoward happens (God Forbid!) it is going to be hell let loose in the other calm and collected residential area.\n\nHow else can we make the people to be sensitive enough to take the first step towards being secure?\n\n&#x200B;\n\nhttps://preview.redd.it/9vt59blphr5c1.png?width=1200&format=png&auto=webp&s=2cdd577e3f9e140e303a362348e05d955f776cdd",
    "flair": "Crime",
    "score": 4,
    "num_comments": 1,
    "created_utc": 1702342343.0,
    "convurl": "https://b.thumbs.redditmedia.com/AW2yr-xFqTDh4FT95H7SF3XgtVMI3HtBtfrZ1f1nwHg.jpg",
    "comments": [
        "Nothing to do.. Pattal than buthi varum.. \n\nHear after dont knock gently. Knock the hell out of them like a burglur and run away"
    ],
    "cleaned_text": "people conscious security time law enforcement activists apartment associations resident welfare groups asking people selfreliant ensure take least minimum measures side towards securing personal life property community one apartment two senior citizens live alone son living separately next street seem going well terms daughterinlaw thrown son visits times week everyone advising doors locked nights though common lights community senior citizen often turns common lights citing adding electricity bill besides keeps door open sleeps us outside night hours reason ensure turn back lights provide gentle knock door ask lock security often fall sound asleep round clock afford keep watch informed son seems advised number times avail even gurkha used come around times knocked door reminding lock door sleep day morning door wide open root problem hails remote village near villupuramkallakurichi hence village due lesser number houses got used keep doors open rest due lack theftburglary andor untoward incidents however gesture trying emulate city atmosphere seem making everyone comfortable saw making others uncomfortable means keep muted seeing one put risk due lack sensitivity perils lurking atmosphere everyone us witnessed kind insecurity practised senior citizen couple advised definitely conmen would added watch list something untoward happens god forbid going hell let loose calm collected residential area else make people sensitive enough take first step towards secure xb ",
    "cleaned_title": "people conscious security",
    "cleaned_selftext": "time law enforcement activists apartment associations resident welfare groups asking people selfreliant ensure take least minimum measures side towards securing personal life property community one apartment two senior citizens live alone son living separately next street seem going well terms daughterinlaw thrown son visits times week everyone advising doors locked nights though common lights community senior citizen often turns common lights citing adding electricity bill besides keeps door open sleeps us outside night hours reason ensure turn back lights provide gentle knock door ask lock security often fall sound asleep round clock afford keep watch informed son seems advised number times avail even gurkha used come around times knocked door reminding lock door sleep day morning door wide open root problem hails remote village near villupuramkallakurichi hence village due lesser number houses got used keep doors open rest due lack theftburglary andor untoward incidents however gesture trying emulate city atmosphere seem making everyone comfortable saw making others uncomfortable means keep muted seeing one put risk due lack sensitivity perils lurking atmosphere everyone us witnessed kind insecurity practised senior citizen couple advised definitely conmen would added watch list something untoward happens god forbid going hell let loose calm collected residential area else make people sensitive enough take first step towards secure xb",
    "cleaned_comments": "nothing pattal buthi varum hear dont knock gently knock hell like burglur run away",
    "light_cleaned_title": "When people themselves are not conscious about security ...",
    "light_cleaned_selftext": "Time and again Law Enforcement, activists, apartment associations and resident welfare groups have been asking people to be self-reliant and ensure to be take at least the minimum measures from each of our side towards securing their personal life and property. In our community there is one apartment where two Senior Citizens live alone. Their son is living separately in the next street because they do not seem to be going well with the terms of their daughter-in-law and were thrown out. Their son visits a few times in a week. Everyone have been advising them to have their doors locked during nights though the common lights are on in the community. The Senior Citizen often turns off the common lights citing it is adding to the electricity bill besides that he keeps the door open and sleeps. When any of us are outside during night hours for any reason we ensure to turn back the lights, provide a gentle knock on the door to ask them to lock the same for their own security because they often fall sound asleep. Round the clock we can not afford to keep a watch on them. We have informed their son and he seems to have *advised* him a few number of times too but in no avail. Even the Gurkha who used to come around 2 AM at times has knocked at their door reminding them to lock the door and sleep. But the same day morning the door is wide open again. The root of the problem is that he hails from a remote village near Villupuram/Kallakurichi and hence in their village due to lesser number of houses they have got used to keep the doors open and rest due to lack of theft/burglary and/or untoward incidents. However his gesture of trying to emulate the same in a city atmosphere does not seem to be making everyone comfortable. When I saw making others uncomfortable means we can not keep muted seeing some one put themselves in risk due to their own lack of sensitivity to the perils lurking in the atmosphere. When everyone of us have witnessed this kind of insecurity practised by Senior Citizen couple and advised them, definitely con-men would have added them to their watch list too. If something untoward happens (God Forbid!) it is going to be hell let loose in the other calm and collected residential area. How else can we make the people to be sensitive enough to take the first step towards being secure? &#x200B;",
    "light_cleaned_comments": "Nothing to do.. Pattal than buthi varum.. Hear after dont knock gently. Knock the hell out of them like a burglur and run away"
}