{
    "id": "18b5k07",
    "title": "50 lakhs for a veteran’s life? Stop playing politics with Martyrs, servicemen and ex-servicemen",
    "url": "https://www.reddit.com/r/india/comments/18b5k07/50_lakhs_for_a_veterans_life_stop_playing/",
    "selftext": "A Twitter/X war erupted between [@Tejasvi\\_Surya](https://twitter.com/Tejasvi_Surya/status/1731605785548091457) and [@CMofKarnataka](https://twitter.com/CMofKarnataka/status/1731738222844387549) over an ex-gratia payment of rupees 50 Lakhs promised to parents of martyred Capt Pranjal by the state government. Seems that bureaucrats in the Congress-led state government weren't acting speedily enough (surprise?!) for the youthful BJP MP’s liking and he took to Twitter to vent out his letters.\n\nSo, why am I not surprised when they simply use the media as mouthpiece when politically convenient\n\nAs a son of an ex-servicemen, this *rant* made me cringe because successive governments have shown little regard for the rights of veterans. \n\n---------\n\nTake the case of my dad, who legally purchased a parcel of land in north Bengaluru 25 years ago after honourably retiring from service. The land registration (Katha mutation) had been delayed for over 25 years with revenue officials giving some cock-and-bull excuses. Local bureaucrats and their touts took advantage of his naiveté and trust in governance by bleeding him dry of his savings… until I stepped in and took matters to court. \n\nKeep in mind, this is a legal right my father was fighting for, not any handouts or favours. \n\nAfter three High-court orders and a contempt-of-court filing, the Deputy Commissioner finally passed an order in my favour, but now the Tahisildar - lowest in this totem pole - is dragging his feet on acting on that order. Long story short, I am continuing to use legal tools and [Tweets to highlight the issue](https://twitter.com/PetitionIssue/status/1731491638063861764) and complete that saga.   [TL;DR? check out my earlier post](https://np.reddit.com/r/india/comments/16dw5kk/my_post_about_bribe_and_nepotism_in_india_blew_up/) \n\n---------\n\nServicemen and women are proud of their service to the nation, and their families don't need charity or handouts. \n\nAnd this is why I cringe and gag when I see opportunistic politicians use the lives and sacrifices of servicemen to score brownie points.",
    "flair": "Rant / Vent",
    "score": 5,
    "num_comments": 3,
    "created_utc": 1701756783.0,
    "convurl": "https://external-preview.redd.it/tezDzjF_4tdI7HgYaFEcfjICr35FE6FHJYwioJ2VpFk.jpg?auto=webp&s=a69fabc0a25227daa08efa2aba61d77b07f759f3",
    "comments": [
        "Yeah, I have been seeing news about your father's problems in the Reddit, twitter, newspaper etc.,\n\nAll the best !\n\nProbably you need to file an execution-petition in the court against the DC and the tahsildar to move things, again.\n\nThe citizens *are* proud of servicemen/ex-servicemen and realise their value, but politicians are politicians, they use everyone, including their mothers, to advance their careers.",
        "Thanks. \n\n> Probably you need to file an execution-petition in the court against the DC and the tahsildar to move things, again.\n\nMy lawyer suggested waiting a few week. No point in spending more on legal cost if I can force their hand otherwise :-)"
    ],
    "cleaned_text": "lakhs veterans life stop playing politics martyrs servicemen exservicemen twitterx war erupted tejasvisuryahttpstwittercomtejasvisuryastatus cmofkarnatakahttpstwittercomcmofkarnatakastatus exgratia payment rupees lakhs promised parents martyred capt pranjal state government seems bureaucrats congressled state government werent acting speedily enough surprise youthful bjp mps liking took twitter vent letters surprised simply use media mouthpiece politically convenient son exservicemen rant made cringe successive governments shown little regard rights veterans take case dad legally purchased parcel land north bengaluru years ago honourably retiring service land registration katha mutation delayed years revenue officials giving cockandbull excuses local bureaucrats touts took advantage naivet trust governance bleeding dry savings stepped took matters court keep mind legal right father fighting handouts favours three highcourt orders contemptofcourt filing deputy commissioner finally passed order favour tahisildar lowest totem pole dragging feet acting order long story short continuing use legal tools tweets highlight issuehttpstwittercompetitionissuestatus complete saga tldr check earlier posthttpsnpredditcomrindiacommentsdwkkmypostaboutbribeandnepotisminindiablewup servicemen women proud service nation families dont need charity handouts cringe gag see opportunistic politicians use lives sacrifices servicemen score brownie points ",
    "cleaned_title": "lakhs veterans life stop playing politics martyrs servicemen exservicemen",
    "cleaned_selftext": "twitterx war erupted tejasvisuryahttpstwittercomtejasvisuryastatus cmofkarnatakahttpstwittercomcmofkarnatakastatus exgratia payment rupees lakhs promised parents martyred capt pranjal state government seems bureaucrats congressled state government werent acting speedily enough surprise youthful bjp mps liking took twitter vent letters surprised simply use media mouthpiece politically convenient son exservicemen rant made cringe successive governments shown little regard rights veterans take case dad legally purchased parcel land north bengaluru years ago honourably retiring service land registration katha mutation delayed years revenue officials giving cockandbull excuses local bureaucrats touts took advantage naivet trust governance bleeding dry savings stepped took matters court keep mind legal right father fighting handouts favours three highcourt orders contemptofcourt filing deputy commissioner finally passed order favour tahisildar lowest totem pole dragging feet acting order long story short continuing use legal tools tweets highlight issuehttpstwittercompetitionissuestatus complete saga tldr check earlier posthttpsnpredditcomrindiacommentsdwkkmypostaboutbribeandnepotisminindiablewup servicemen women proud service nation families dont need charity handouts cringe gag see opportunistic politicians use lives sacrifices servicemen score brownie points",
    "cleaned_comments": "yeah seeing news fathers problems reddit twitter newspaper etc best probably need file executionpetition court dc tahsildar move things citizens proud servicemenexservicemen realise value politicians politicians use everyone including mothers advance careers thanks probably need file executionpetition court dc tahsildar move things lawyer suggested waiting week point spending legal cost force hand otherwise",
    "light_cleaned_title": "50 lakhs for a veteran’s life? Stop playing politics with Martyrs, servicemen and ex-servicemen",
    "light_cleaned_selftext": "A Twitter/X war erupted between [@Tejasvi\\_Surya](https://twitter.com/Tejasvi_Surya/status/1731605785548091457) and [@CMofKarnataka](https://twitter.com/CMofKarnataka/status/1731738222844387549) over an ex-gratia payment of rupees 50 Lakhs promised to parents of martyred Capt Pranjal by the state government. Seems that bureaucrats in the Congress-led state government weren't acting speedily enough (surprise?!) for the youthful BJP MP’s liking and he took to Twitter to vent out his letters. So, why am I not surprised when they simply use the media as mouthpiece when politically convenient As a son of an ex-servicemen, this *rant* made me cringe because successive governments have shown little regard for the rights of veterans. --------- Take the case of my dad, who legally purchased a parcel of land in north Bengaluru 25 years ago after honourably retiring from service. The land registration (Katha mutation) had been delayed for over 25 years with revenue officials giving some cock-and-bull excuses. Local bureaucrats and their touts took advantage of his naiveté and trust in governance by bleeding him dry of his savings… until I stepped in and took matters to court. Keep in mind, this is a legal right my father was fighting for, not any handouts or favours. After three High-court orders and a contempt-of-court filing, the Deputy Commissioner finally passed an order in my favour, but now the Tahisildar - lowest in this totem pole - is dragging his feet on acting on that order. Long story short, I am continuing to use legal tools and [Tweets to highlight the issue](https://twitter.com/PetitionIssue/status/1731491638063861764) and complete that saga. [TL;DR? check out my earlier post](https://np.reddit.com/r/india/comments/16dw5kk/my_post_about_bribe_and_nepotism_in_india_blew_up/) --------- Servicemen and women are proud of their service to the nation, and their families don't need charity or handouts. And this is why I cringe and gag when I see opportunistic politicians use the lives and sacrifices of servicemen to score brownie points.",
    "light_cleaned_comments": "Yeah, I have been seeing news about your father's problems in the Reddit, twitter, newspaper etc., All the best ! Probably you need to file an execution-petition in the court against the DC and the tahsildar to move things, again. The citizens *are* proud of servicemen/ex-servicemen and realise their value, but politicians are politicians, they use everyone, including their mothers, to advance their careers. Thanks. > Probably you need to file an execution-petition in the court against the DC and the tahsildar to move things, again. My lawyer suggested waiting a few week. No point in spending more on legal cost if I can force their hand otherwise :-)"
}