{
    "id": "155orie",
    "title": "Firstpost shows how the Meitei claim of violence against them were fake.",
    "url": "https://youtu.be/rYvblohqtlM",
    "selftext": "While I am sure there would have been some self defence or retaliation attacks by the Kukis against the Meitei mobs, this news was pretty clear in where majority of the blame lies.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1689947770.0,
    "convurl": "https://external-preview.redd.it/PQDE-wMIyFv6uOA1tD05p1eXXyBQ2QfH3K0nTnoVR_Y.jpg?auto=webp&s=90d9a1e234261aae350b8837b3f09f3507dd563c",
    "comments": [
        "This lady? She has jumped ship? Wasn't she trying to spread RSS propaganda internationally? Her smugness sounds like nails on chalkboard.",
        "True. Even I was surprised to see her with this news. Maybe, just maybe, the horrific nature of this incident has opened her eyes a bit.",
        "She's doing what she's been told to do by the editors?",
        "Confirmed work of the BJP IT Cell."
    ],
    "cleaned_text": "firstpost shows meitei claim violence fake sure would self defence retaliation attacks kukis meitei mobs news pretty clear majority blame lies ",
    "cleaned_title": "firstpost shows meitei claim violence fake",
    "cleaned_selftext": "sure would self defence retaliation attacks kukis meitei mobs news pretty clear majority blame lies",
    "cleaned_comments": "lady jumped ship wasnt trying spread rss propaganda internationally smugness sounds like nails chalkboard true even surprised see news maybe maybe horrific nature incident opened eyes bit shes shes told editors confirmed work bjp cell",
    "light_cleaned_title": "Firstpost shows how the Meitei claim of violence against them were fake.",
    "light_cleaned_selftext": "While I am sure there would have been some self defence or retaliation attacks by the Kukis against the Meitei mobs, this news was pretty clear in where majority of the blame lies.",
    "light_cleaned_comments": "This lady? She has jumped ship? Wasn't she trying to spread RSS propaganda internationally? Her smugness sounds like nails on chalkboard. True. Even I was surprised to see her with this news. Maybe, just maybe, the horrific nature of this incident has opened her eyes a bit. She's doing what she's been told to do by the editors? Confirmed work of the BJP IT Cell."
}