{
    "id": "17cdooe",
    "title": "Picture yourself as me - “First Time - The Flipkart Big Billion Day iPhone Buyer”",
    "url": "https://www.reddit.com/r/india/comments/17cdooe/picture_yourself_as_me_first_time_the_flipkart/",
    "selftext": " \n\nTwitter/X link of the iPhone scratch images : https://x.com/madhes2310/status/1715287652994596971?s=20\n\nYou guys may think it's minute and smaller than a grain of rice but this is the first thing i bought for myself with the money i earned myself after using a phone for 6 years(Redmi note 5 pro),If you guys have a twitter/X account please retweet it if you can so it can be some hope for me and also tell me Should I move on with my life without caring about that small scratch or do something that you guys suggest\n\nStressed and Worried Rant : \n\nSo on 7th of October i ordered APPLE iphone 14 plus \\[Purple, 128GB\\] Midnight 12 so the next day i received it the same day around 7.30PM,Which was a open box delivery and the delivery agent was opening the main Flipkart box and showed the packaging of the Iphone box.So i asked him to open the Iphone box so that i can check the phone and everything.But he denied it and was in a hurry ,I again insisted him to open the Iphone box but he was not ready to do that,After being fed up i checked the full package and seal of the box which was perfect with no issues of the packaging of Iphone box and he also took the pictures of the iphone box without it being opened so i gave him the otp and when i opened the box and turned on the Phone it was all working fine no issues and I had the tempered glass so when i was about to clean the phone and was looking the side panels i see a scratch on top of left silent button, not gonna lie i was stressed and so worried.So i just checked the warranty and if the phone is new and all that in the apple website it all were legit.So I just turned off the mobile and packed it like i got it.So the next day i raised a complaint for the same i was told that i would get a replacement. So day after that i received a call from the flipkart executive asking me to upload pictures of damage and all other things like IMEI,serial no.,Box pics of both flipkart and Iphone .So I was given the last date as 21.10.2023.But days went by i was not getting any resolution and I tried calling them daily to know the update but each time someone new spoke to me so i have to explain them everything and every time they were saying that's a open box delivery but for that I mentioned what the delivery agent did and I asked them to check the pictures the delivery agent uploaded as proof but after hearing all this I was asked to wait until 21.10.2023.And finally today (20.20.2023) my replacement request has been rejected without any proper justification. And from morning I was trying to speak with customer support I was told there is nothing on their system and when I asked them I want to speak with a senior executive I was put on hold ngl I was once was put on hold for 13 mins and even some senior executive picks the call, it disconnects suddenly and then again I have to explain everything from starting.I posted the same issue in Twitter/X but was only got a message from flipkart bot to DM it along with 3 other scammers pretending to be Flipkart So after being fed up with all these I came here to rant this to you.  \nWhat do you guys do if you are in my situation? It's been 14 days since I got the phone and the screen time of it is just within 7 mins.  \nMock me, Scold me. Say whatever you think of saying go ahead don't hesitate but please also picture yourself in my situation and tell me what i can do.Should I move on with my life without caring about that small scratch or do something about it  \nIf you had patiently read this till this I am thanking you from bottom of my heart and if you have a twitter/X account please retweet it if you can so it can be of some help to me.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697815012.0,
    "convurl": "https://external-preview.redd.it/C3BIUALLrCxXMsuOT9TgHI6BZiiwpkiN1CPd5ycELMU.jpg?auto=webp&s=e1d345400db9c6e28e3acab1a8d0d5c6288176a1",
    "comments": [
        "You are overthinking. it's just tiny dot.\n\nBe glad atleast it's working. Almost every seller on Flipkart is scammer. You made mistake when you ordered from Flipkart.\n\nThere daily one story on reddit by random Flipkart victim.",
        "Flipkart: Another one bites the dust.",
        "Bhai mera already consumer court me case chl rha h flipkart k against. Inke customer care executive se logical baat krna, mtlb dewar me takkr maarne k barabar h, koi resolution provide nhi krte ye. Mera bhot time waste kraya h inhone."
    ],
    "cleaned_text": "picture first time flipkart big billion day iphone buyer twitterx link iphone scratch images guys may think minute smaller grain rice first thing bought money earned using phone yearsredmi note proif guys twitterx account please retweet hope also tell move life without caring small scratch something guys suggest stressed worried rant th october ordered apple iphone plus purple gb midnight next day received day around pmwhich open box delivery delivery agent opening main flipkart box showed packaging iphone boxso asked open iphone box check phone everythingbut denied hurry insisted open iphone box ready thatafter fed checked full package seal box perfect issues packaging iphone box also took pictures iphone box without opened gave otp opened box turned phone working fine issues tempered glass clean phone looking side panels see scratch top left silent button gon na lie stressed worriedso checked warranty phone new apple website legitso turned mobile packed like got itso next day raised complaint told would get replacement day received call flipkart executive asking upload pictures damage things like imeiserial nobox pics flipkart iphone given last date days went getting resolution tried calling daily know update time someone new spoke explain everything every time saying thats open box delivery mentioned delivery agent asked check pictures delivery agent uploaded proof hearing asked wait finally today replacement request rejected without proper justification morning trying speak customer support told nothing system asked want speak senior executive put hold ngl put hold mins even senior executive picks call disconnects suddenly explain everything startingi posted issue twitterx got message flipkart bot dm along scammers pretending flipkart fed came rant guys situation days since got phone screen time within mins mock scold say whatever think saying go ahead dont hesitate please also picture situation tell doshould move life without caring small scratch something patiently read till thanking bottom heart twitterx account please retweet help ",
    "cleaned_title": "picture first time flipkart big billion day iphone buyer",
    "cleaned_selftext": "twitterx link iphone scratch images guys may think minute smaller grain rice first thing bought money earned using phone yearsredmi note proif guys twitterx account please retweet hope also tell move life without caring small scratch something guys suggest stressed worried rant th october ordered apple iphone plus purple gb midnight next day received day around pmwhich open box delivery delivery agent opening main flipkart box showed packaging iphone boxso asked open iphone box check phone everythingbut denied hurry insisted open iphone box ready thatafter fed checked full package seal box perfect issues packaging iphone box also took pictures iphone box without opened gave otp opened box turned phone working fine issues tempered glass clean phone looking side panels see scratch top left silent button gon na lie stressed worriedso checked warranty phone new apple website legitso turned mobile packed like got itso next day raised complaint told would get replacement day received call flipkart executive asking upload pictures damage things like imeiserial nobox pics flipkart iphone given last date days went getting resolution tried calling daily know update time someone new spoke explain everything every time saying thats open box delivery mentioned delivery agent asked check pictures delivery agent uploaded proof hearing asked wait finally today replacement request rejected without proper justification morning trying speak customer support told nothing system asked want speak senior executive put hold ngl put hold mins even senior executive picks call disconnects suddenly explain everything startingi posted issue twitterx got message flipkart bot dm along scammers pretending flipkart fed came rant guys situation days since got phone screen time within mins mock scold say whatever think saying go ahead dont hesitate please also picture situation tell doshould move life without caring small scratch something patiently read till thanking bottom heart twitterx account please retweet help",
    "cleaned_comments": "overthinking tiny dot glad atleast working almost every seller flipkart scammer made mistake ordered flipkart daily one story reddit random flipkart victim flipkart another one bites dust bhai mera already consumer court case chl rha h flipkart k inke customer care executive se logical baat krna mtlb dewar takkr maarne k barabar h koi resolution provide nhi krte ye mera bhot time waste kraya h inhone",
    "light_cleaned_title": "Picture yourself as me - “First Time - The Flipkart Big Billion Day iPhone Buyer”",
    "light_cleaned_selftext": "Twitter/X link of the iPhone scratch images : You guys may think it's minute and smaller than a grain of rice but this is the first thing i bought for myself with the money i earned myself after using a phone for 6 years(Redmi note 5 pro),If you guys have a twitter/X account please retweet it if you can so it can be some hope for me and also tell me Should I move on with my life without caring about that small scratch or do something that you guys suggest Stressed and Worried Rant : So on 7th of October i ordered APPLE iphone 14 plus \\[Purple, 128GB\\] Midnight 12 so the next day i received it the same day around 7.30PM,Which was a open box delivery and the delivery agent was opening the main Flipkart box and showed the packaging of the Iphone box.So i asked him to open the Iphone box so that i can check the phone and everything.But he denied it and was in a hurry ,I again insisted him to open the Iphone box but he was not ready to do that,After being fed up i checked the full package and seal of the box which was perfect with no issues of the packaging of Iphone box and he also took the pictures of the iphone box without it being opened so i gave him the otp and when i opened the box and turned on the Phone it was all working fine no issues and I had the tempered glass so when i was about to clean the phone and was looking the side panels i see a scratch on top of left silent button, not gonna lie i was stressed and so worried.So i just checked the warranty and if the phone is new and all that in the apple website it all were legit.So I just turned off the mobile and packed it like i got it.So the next day i raised a complaint for the same i was told that i would get a replacement. So day after that i received a call from the flipkart executive asking me to upload pictures of damage and all other things like IMEI,serial no.,Box pics of both flipkart and Iphone .So I was given the last date as 21.10.2023.But days went by i was not getting any resolution and I tried calling them daily to know the update but each time someone new spoke to me so i have to explain them everything and every time they were saying that's a open box delivery but for that I mentioned what the delivery agent did and I asked them to check the pictures the delivery agent uploaded as proof but after hearing all this I was asked to wait until 21.10.2023.And finally today (20.20.2023) my replacement request has been rejected without any proper justification. And from morning I was trying to speak with customer support I was told there is nothing on their system and when I asked them I want to speak with a senior executive I was put on hold ngl I was once was put on hold for 13 mins and even some senior executive picks the call, it disconnects suddenly and then again I have to explain everything from starting.I posted the same issue in Twitter/X but was only got a message from flipkart bot to DM it along with 3 other scammers pretending to be Flipkart So after being fed up with all these I came here to rant this to you. What do you guys do if you are in my situation? It's been 14 days since I got the phone and the screen time of it is just within 7 mins. Mock me, Scold me. Say whatever you think of saying go ahead don't hesitate but please also picture yourself in my situation and tell me what i can do.Should I move on with my life without caring about that small scratch or do something about it If you had patiently read this till this I am thanking you from bottom of my heart and if you have a twitter/X account please retweet it if you can so it can be of some help to me.",
    "light_cleaned_comments": "You are overthinking. it's just tiny dot. Be glad atleast it's working. Almost every seller on Flipkart is scammer. You made mistake when you ordered from Flipkart. There daily one story on reddit by random Flipkart victim. Flipkart: Another one bites the dust. Bhai mera already consumer court me case chl rha h flipkart k against. Inke customer care executive se logical baat krna, mtlb dewar me takkr maarne k barabar h, koi resolution provide nhi krte ye. Mera bhot time waste kraya h inhone."
}