{
    "id": "13i6s3m",
    "title": "My Rant about LG and their *own technicians*",
    "url": "https://www.reddit.com/r/india/comments/13i6s3m/my_rant_about_lg_and_their_own_technicians/",
    "selftext": "Just bought my AC today. And I had to file a complaint today only. And don't get me wrong, I hate to be that \"I would like to talk to your manager\" karen type of guy. But the situation was worse than I expected. I bought LG primarily because they are just supposed to provide the best service. With that, let's see what happened -\n\n1. They don't have their own trained technicians with uniforms like you would expect. They also outsource local technicians.\n\n&#x200B;\n\nhttps://preview.redd.it/y8fc08vjlzza1.png?width=1322&format=png&auto=webp&v=enabled&s=93925ed1b59332ba880b7004b3fdad51347d9476\n\n2. They don't do clean installation. I don't know if this is a thing in big cities only, but in mine they certainly did a horrible job.\n\n&#x200B;\n\nhttps://preview.redd.it/ik3u1u3xlzza1.jpg?width=1200&format=pjpg&auto=webp&v=enabled&s=dfd9a78e8b61cb5aa9fc499d76ba3470e5fa4e6e\n\nhttps://preview.redd.it/nm1r9s3xlzza1.jpg?width=1600&format=pjpg&auto=webp&v=enabled&s=99411831434462553ec50638b31b908557b72261\n\n3. They are rude and try to gaslight you. Mine asked me for the satisfaction code company provides us, and when I confronted him by asking him to do the installation first, he said \"Do you consider us theives\". I still held back and gave them the code that time. Ironically, they ran away like thieves after doing the bare minimum. Didn't install my stabilizer and mcb after the confrontation. Take a look at the photos, do you expect me to turn on the AC with a hanging wire?\n\nhttps://preview.redd.it/hw7yebiumzza1.jpg?width=1200&format=pjpg&auto=webp&v=enabled&s=1fb6d12d5587848d30eb121d24c14c8dcb00295d\n\nhttps://preview.redd.it/re571fiumzza1.jpg?width=1200&format=pjpg&auto=webp&v=enabled&s=41aea4108b2bc518db39dcbd4ece6111e6b6a088\n\nUnfortunately, they messed with the wrong guy and I reported them to LG. LG did send a new technician right away who did a fantastic job, so I have to give LG credit for that. The new guy also installed stand for the AC.\n\nhttps://preview.redd.it/s8t0joj8nzza1.jpg?width=1600&format=pjpg&auto=webp&v=enabled&s=7aa120f730947f0083767ded036cc32319820a35\n\nAll I want to say is no brand has exceptionally good service, everybody outsource their technicians and it's just a matter of luck what type of technician you get. But you can do two things, don't give them the satisfaction code unless your work is done no matter what. And report them to the company if you have any complaints.",
    "flair": "Rant / Vent",
    "score": 3,
    "num_comments": 1,
    "created_utc": 1684153559.0,
    "convurl": "https://b.thumbs.redditmedia.com/053_Axz1tmJ2Dp-jIaPE-ETD-KzwDBjsCsS5EZNtgRU.jpg",
    "comments": [],
    "cleaned_text": "rant lg technicians bought ac today file complaint today dont get wrong hate would like talk manager karen type guy situation worse expected bought lg primarily supposed provide best service lets see happened dont trained technicians uniforms like would expect also outsource local technicians xb dont clean installation dont know thing big cities mine certainly horrible job xb rude try gaslight mine asked satisfaction code company provides us confronted asking installation first said consider us theives still held back gave code time ironically ran away like thieves bare minimum didnt install stabilizer mcb confrontation take look photos expect turn ac hanging wire unfortunately messed wrong guy reported lg lg send new technician right away fantastic job give lg credit new guy also installed stand ac want say brand exceptionally good service everybody outsource technicians matter luck type technician get two things dont give satisfaction code unless work done matter report company complaints ",
    "cleaned_title": "rant lg technicians",
    "cleaned_selftext": "bought ac today file complaint today dont get wrong hate would like talk manager karen type guy situation worse expected bought lg primarily supposed provide best service lets see happened dont trained technicians uniforms like would expect also outsource local technicians xb dont clean installation dont know thing big cities mine certainly horrible job xb rude try gaslight mine asked satisfaction code company provides us confronted asking installation first said consider us theives still held back gave code time ironically ran away like thieves bare minimum didnt install stabilizer mcb confrontation take look photos expect turn ac hanging wire unfortunately messed wrong guy reported lg lg send new technician right away fantastic job give lg credit new guy also installed stand ac want say brand exceptionally good service everybody outsource technicians matter luck type technician get two things dont give satisfaction code unless work done matter report company complaints",
    "cleaned_comments": "",
    "light_cleaned_title": "My Rant about LG and their *own technicians*",
    "light_cleaned_selftext": "Just bought my AC today. And I had to file a complaint today only. And don't get me wrong, I hate to be that \"I would like to talk to your manager\" karen type of guy. But the situation was worse than I expected. I bought LG primarily because they are just supposed to provide the best service. With that, let's see what happened - 1. They don't have their own trained technicians with uniforms like you would expect. They also outsource local technicians. &#x200B; 2. They don't do clean installation. I don't know if this is a thing in big cities only, but in mine they certainly did a horrible job. &#x200B; 3. They are rude and try to gaslight you. Mine asked me for the satisfaction code company provides us, and when I confronted him by asking him to do the installation first, he said \"Do you consider us theives\". I still held back and gave them the code that time. Ironically, they ran away like thieves after doing the bare minimum. Didn't install my stabilizer and mcb after the confrontation. Take a look at the photos, do you expect me to turn on the AC with a hanging wire? Unfortunately, they messed with the wrong guy and I reported them to LG. LG did send a new technician right away who did a fantastic job, so I have to give LG credit for that. The new guy also installed stand for the AC. All I want to say is no brand has exceptionally good service, everybody outsource their technicians and it's just a matter of luck what type of technician you get. But you can do two things, don't give them the satisfaction code unless your work is done no matter what. And report them to the company if you have any complaints.",
    "light_cleaned_comments": ""
}