{
    "id": "16wrxg3",
    "title": "Under New Project, Army to ‘Rediscover’ Indigenous Military Systems, Ancient Texts and Kautilya",
    "url": "https://thewire.in/security/new-army-project-to-rediscover-ancient-indian-strategies-holds-first-panel-discussion",
    "selftext": "Well looks like not even the Military is being spared from historical revisionism. Is there no thought to how this might affect the security of India, with using philosophy and tactics developed for the people of the past to be used by a modern military? It might have some merit if it was thaught to politicians or administrators, since Arthashastra is mainly a treatise on statecraft, but it is being rubbed on the Army.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 35,
    "created_utc": 1696135657.0,
    "convurl": "https://external-preview.redd.it/eQPbbuoRey2Wz13hTTGUGh1_PgyMECbGG3kFQHnKr1s.jpg?auto=webp&s=2cea7e7e96c63d11d2ed3bac42b66ee48bdcbe1a",
    "comments": [
        "So back to bows and arrows?",
        "Came here to say that .",
        "The same techniques to that decimated the Mongols, Mughals, Portuguese, and British?",
        "World is moving forward learning and adapting the best what others have to offer,  while we are regressing back to stone age in search of glory. \n\nIt's one of the reason why countries like China, Japan, etc, have been able to turn themselves into a developed nation. They learned from the Europeans and translated it into the local culture while keeping their ancient ways intact.",
        "Guys, this is genius. Close DRDO and start funding Baba Ramdev’s Patanjali Weapons and Tactics Research Division. The Chinese army with its stealth fighters won’t stand a chance against Patanjali Pushpak Viman. Pakistani special forces will not be able to break Indian Chakravyuha formations and will waste their ammo while the fully hindutva certified army launches their sudarshan chakras.",
        "can't wait for the mighty 'GADHA' to make a comeback",
        "Even ignoring the fact that we use different weapons, the ancient war strategies are going to be useless. Having your soldiers stand in formations is cool and all, except when they can easily be penetrated by a tank or blown up by planes or even cheaper drones. And ancient weapons are far inferior to modern ones so no need to even talk of them",
        "We are gradually becoming like Pakistan. Until 80s, Pakistan was relatively prosperous than India for at least a couple of decades after partition.\n\nZia Ul Haq unleashed religious extremists under his dictatorship the results of which started becoming visible in Pakistan after he was dead. 4 decades later you can see how Pakistan is nearing a collapse and sadly, the same fate awaits India.",
        "History books are being slowly revised. In 50 years, yes, same techniques defeated them all.",
        "Gadaa. Gadha is a donkey. We have many mighty gadhas in the parliament.",
        "They will be shown Ramanand Sagar’s Ramayan.\n In a much slower motion.",
        "All of them are, not many.",
        "Who needs stealth aircraft like China and America, when we have flying chariots and mountain shattering maces",
        "Standing in formation was rendered obsolete during the 1910s due to a little thing called machine guns",
        "They must have watched too many re runs of bahubali",
        "Maybe, just maybe they did mean gadha 🤣",
        "Full clown moment.",
        "And ancient battles were all about formations so like I said, they'd be worthless in modern era",
        "Meh. As if BJP cares about India or security. If China takes over parts of arunachal tomorrow, this govt will deny it as fake news, block roads leading to Arunachal and cut off internet. That is the kind of patriotism they have. They only care about power and money.",
        "You got to wonder how much money this joke sucked from the defence budget, and how many full time soldiers they could have recruited (instead of \"agniveers\") with the same amount of money.",
        "Oh it's already back. Thanks to Gobi Govt, the Indian army is going to use Trishul and Vajra instead of machine guns to fight Chinese intrusion.\n\n[From Trishul to Bhadra: Non-lethal weapons ready for Indian forces to tackle Chinese troops](https://www.indiatoday.in/india/story/trishul-vajra-dand-sapper-punch-bhadra-non-lethal-weapons-indian-forces-chinese-troops-1866156-2021-10-18)\n\nOn another point, the Gobi Govt has also taken Chinese donations in the PM Care Fund which is now excluded from the CAG audit\n\n[Congress says PM CARES Fund accepted Chinese donations, asks why Modi not calling China aggresso](https://m.economictimes.com/news/politics-and-nation/congress-says-pm-cares-fund-accepted-chinese-donations-asks-why-modi-not-calling-china-aggressor/articleshow/76674170.cms)"
    ],
    "cleaned_text": "new project army rediscover indigenous military systems ancient texts kautilya well looks like even military spared historical revisionism thought might affect security india using philosophy tactics developed people past used modern military might merit thaught politicians administrators since arthashastra mainly treatise statecraft rubbed army ",
    "cleaned_title": "new project army rediscover indigenous military systems ancient texts kautilya",
    "cleaned_selftext": "well looks like even military spared historical revisionism thought might affect security india using philosophy tactics developed people past used modern military might merit thaught politicians administrators since arthashastra mainly treatise statecraft rubbed army",
    "cleaned_comments": "back bows arrows came say techniques decimated mongols mughals portuguese british world moving forward learning adapting best others offer regressing back stone age search glory one reason countries like china japan etc able turn developed nation learned europeans translated local culture keeping ancient ways intact guys genius close drdo start funding baba ramdevs patanjali weapons tactics research division chinese army stealth fighters wont stand chance patanjali pushpak viman pakistani special forces able break indian chakravyuha formations waste ammo fully hindutva certified army launches sudarshan chakras cant wait mighty gadha make comeback even ignoring fact use different weapons ancient war strategies going useless soldiers stand formations cool except easily penetrated tank blown planes even cheaper drones ancient weapons far inferior modern ones need even talk gradually becoming like pakistan pakistan relatively prosperous india least couple decades partition zia ul haq unleashed religious extremists dictatorship results started becoming visible pakistan dead decades later see pakistan nearing collapse sadly fate awaits india history books slowly revised years yes techniques defeated gadaa gadha donkey many mighty gadhas parliament shown ramanand sagars ramayan much slower motion many needs stealth aircraft like china america flying chariots mountain shattering maces standing formation rendered obsolete due little thing called machine guns must watched many runs bahubali maybe maybe mean gadha full clown moment ancient battles formations like said theyd worthless modern era meh bjp cares india security china takes parts arunachal tomorrow govt deny fake news block roads leading arunachal cut internet kind patriotism care power money got wonder much money joke sucked defence budget many full time soldiers could recruited instead agniveers amount money oh already back thanks gobi govt indian army going use trishul vajra instead machine guns fight chinese intrusion trishul bhadra nonlethal weapons ready indian forces tackle chinese troopshttpswwwindiatodayinindiastorytrishulvajradandsapperpunchbhadranonlethalweaponsindianforceschinesetroops another point gobi govt also taken chinese donations pm care fund excluded cag audit congress says pm cares fund accepted chinese donations asks modi calling china aggressohttpsmeconomictimescomnewspoliticsandnationcongresssayspmcaresfundacceptedchinesedonationsaskswhymodinotcallingchinaaggressorarticleshowcms",
    "light_cleaned_title": "Under New Project, Army to ‘Rediscover’ Indigenous Military Systems, Ancient Texts and Kautilya",
    "light_cleaned_selftext": "Well looks like not even the Military is being spared from historical revisionism. Is there no thought to how this might affect the security of India, with using philosophy and tactics developed for the people of the past to be used by a modern military? It might have some merit if it was thaught to politicians or administrators, since Arthashastra is mainly a treatise on statecraft, but it is being rubbed on the Army.",
    "light_cleaned_comments": "So back to bows and arrows? Came here to say that . The same techniques to that decimated the Mongols, Mughals, Portuguese, and British? World is moving forward learning and adapting the best what others have to offer, while we are regressing back to stone age in search of glory. It's one of the reason why countries like China, Japan, etc, have been able to turn themselves into a developed nation. They learned from the Europeans and translated it into the local culture while keeping their ancient ways intact. Guys, this is genius. Close DRDO and start funding Baba Ramdev’s Patanjali Weapons and Tactics Research Division. The Chinese army with its stealth fighters won’t stand a chance against Patanjali Pushpak Viman. Pakistani special forces will not be able to break Indian Chakravyuha formations and will waste their ammo while the fully hindutva certified army launches their sudarshan chakras. can't wait for the mighty 'GADHA' to make a comeback Even ignoring the fact that we use different weapons, the ancient war strategies are going to be useless. Having your soldiers stand in formations is cool and all, except when they can easily be penetrated by a tank or blown up by planes or even cheaper drones. And ancient weapons are far inferior to modern ones so no need to even talk of them We are gradually becoming like Pakistan. Until 80s, Pakistan was relatively prosperous than India for at least a couple of decades after partition. Zia Ul Haq unleashed religious extremists under his dictatorship the results of which started becoming visible in Pakistan after he was dead. 4 decades later you can see how Pakistan is nearing a collapse and sadly, the same fate awaits India. History books are being slowly revised. In 50 years, yes, same techniques defeated them all. Gadaa. Gadha is a donkey. We have many mighty gadhas in the parliament. They will be shown Ramanand Sagar’s Ramayan. In a much slower motion. All of them are, not many. Who needs stealth aircraft like China and America, when we have flying chariots and mountain shattering maces Standing in formation was rendered obsolete during the 1910s due to a little thing called machine guns They must have watched too many re runs of bahubali Maybe, just maybe they did mean gadha 🤣 Full clown moment. And ancient battles were all about formations so like I said, they'd be worthless in modern era Meh. As if BJP cares about India or security. If China takes over parts of arunachal tomorrow, this govt will deny it as fake news, block roads leading to Arunachal and cut off internet. That is the kind of patriotism they have. They only care about power and money. You got to wonder how much money this joke sucked from the defence budget, and how many full time soldiers they could have recruited (instead of \"agniveers\") with the same amount of money. Oh it's already back. Thanks to Gobi Govt, the Indian army is going to use Trishul and Vajra instead of machine guns to fight Chinese intrusion. [From Trishul to Bhadra: Non-lethal weapons ready for Indian forces to tackle Chinese troops](https://www.indiatoday.in/india/story/trishul-vajra-dand-sapper-punch-bhadra-non-lethal-weapons-indian-forces-chinese-troops-1866156-2021-10-18) On another point, the Gobi Govt has also taken Chinese donations in the PM Care Fund which is now excluded from the CAG audit [Congress says PM CARES Fund accepted Chinese donations, asks why Modi not calling China aggresso](https://m.economictimes.com/news/politics-and-nation/congress-says-pm-cares-fund-accepted-chinese-donations-asks-why-modi-not-calling-china-aggressor/articleshow/76674170.cms)"
}