{
    "id": "17rggxf",
    "title": "Prashant Bhushan interview | ‘The independence of the judiciary has collapsed’",
    "url": "https://www.thehindu.com/society/the-independence-of-the-judiciary-has-collapsed-prashant-bhushan/article33193377.ece",
    "selftext": "Its old interview but still releavant..Some part of it which find IMP is these questions asked to him and his answers:\n\nYou spoke of two reasons why judicial independence has collapsed. What’s the second reason?\n\nLook, earlier too, there have been Chief Justices who had vulnerabilities. But previous governments were not so ruthless. The current regime has used state agencies to prepare a dossier on Chief Justices even before they assume office. They have often tried to have Chief Justices-to-be on tenterhooks till assured that they will kowtow to the government.",
    "flair": "Law & Courts",
    "score": 22,
    "num_comments": 1,
    "created_utc": 1699546396.0,
    "convurl": "https://external-preview.redd.it/XRwskxxeInr2My6cHaWgBzs_mKaMqepz9Opu9OktMvQ.jpg?auto=webp&s=c22adddde2e1a698747c9bd77ce257a652a6bf1c",
    "comments": [
        "[This Judge Was So Outstanding That Narendra Modi Made Sure He Never Made It to the Supreme Court](https://old.reddit.com/r/india/comments/15pyn8g/this_judge_was_so_outstanding_that_narendra_modi/)"
    ],
    "cleaned_text": "prashant bhushan interview independence judiciary collapsed old interview still releavantsome part find imp questions asked answers spoke two reasons judicial independence collapsed whats second reason look earlier chief justices vulnerabilities previous governments ruthless current regime used state agencies prepare dossier chief justices even assume office often tried chief justicestobe tenterhooks till assured kowtow government ",
    "cleaned_title": "prashant bhushan interview independence judiciary collapsed",
    "cleaned_selftext": "old interview still releavantsome part find imp questions asked answers spoke two reasons judicial independence collapsed whats second reason look earlier chief justices vulnerabilities previous governments ruthless current regime used state agencies prepare dossier chief justices even assume office often tried chief justicestobe tenterhooks till assured kowtow government",
    "cleaned_comments": "judge outstanding narendra modi made sure never made supreme courthttpsoldredditcomrindiacommentspyngthisjudgewassooutstandingthatnarendramodi",
    "light_cleaned_title": "Prashant Bhushan interview | ‘The independence of the judiciary has collapsed’",
    "light_cleaned_selftext": "Its old interview but still releavant..Some part of it which find IMP is these questions asked to him and his answers: You spoke of two reasons why judicial independence has collapsed. What’s the second reason? Look, earlier too, there have been Chief Justices who had vulnerabilities. But previous governments were not so ruthless. The current regime has used state agencies to prepare a dossier on Chief Justices even before they assume office. They have often tried to have Chief Justices-to-be on tenterhooks till assured that they will kowtow to the government.",
    "light_cleaned_comments": "[This Judge Was So Outstanding That Narendra Modi Made Sure He Never Made It to the Supreme Court](https://old.reddit.com/r/india/comments/15pyn8g/this_judge_was_so_outstanding_that_narendra_modi/)"
}