{
    "id": "1g57bxq",
    "title": "Star Health data leak: cybersecurity is a joke & privacy is a myth;",
    "url": "https://www.reddit.com/r/india/comments/1g57bxq/star_health_data_leak_cybersecurity_is_a_joke/",
    "selftext": "I know it's a week old news, but stumbled upon more details today.  \n7.2 TB data of 31 million customers.\n\nThis star health one also allegedly has internal involvement as shown in this video - [https://www.youtube.com/watch?v=IFD0s0uYD88](https://www.youtube.com/watch?v=IFD0s0uYD88)\n\nThe leaker claims -\n\n>\n\n>\n\n>\n\n>\n\nIt apparently also includes data of Indian gov officials. And it includes -  \nFull Name, PAN No., Mobile No., Email, Date of Birth, Residential Address, Insured Date of Birth, Insured Name, Gender, Pre-existing Disease, Policy Number, Health Card, Nominee Name, Nominee Age, Nominee Claim %, Nominee Relationship, Insured Height, Weight, BMI, Lots more...\n\nSource: multiple news articles and the leakers website - [https://starhealthleak.st/](https://starhealthleak.st/)  \\[use a VPN\\]\n\nFrom Aadhar to Nuclear plants, SBI, Dominos, the Credit cards on Joker's stash, when will people wake up?  \nWhen will laws get stricter and infra get better?\n\nI'm from Dehradun and last week, Uttarakhand faced a massive cyber attack apparently malware / ransomware.  \nI've heard of some critical gaps and human errors, but don't wanna talk about it as my account is fairly public.\n\nI remember stumbling upon my parent's data and credit card details many years ago in one such leak, when I was 14, on a forum on Tor (Dark web), but could do nothing about it. Earlier I used to use Kali Linux and custom password managers, but had become far less paranoid now. 2FA seems pointless, if you get an identity theft.\n\nI have very high hopes from India, especially in tech and have been building a deeptech startup for 4 years now. But India never fails to disappoint me. The bureaucracy, corruption, mediocrity and careless attitude far outweighs the optimistic goals.",
    "flair": "Law & Courts",
    "score": 62,
    "num_comments": 8,
    "created_utc": 1729105620.0,
    "convurl": "https://external-preview.redd.it/mB-up9JnVtLaewgvT9TRQFaK29N9DMQQTIE8kOrd9ZU.jpg?auto=webp&s=c5b7c7b15fa5fc1f58ad6bf17a96500cae36b201",
    "comments": [
        "Would it be really surprising if later it’s found that they paid off the babus of IRDAI?",
        "I don't think IRDAI can have any involvement, perhaps some negligence maybe.  \nThey should increase scrutiny and take it very seriously though",
        "If an insider decides to do information leak, there is very little you can do. There are MDM softwares like JAMF etc but even they can be disabled to gain access to sensitive data.\n\nIn this case it was CISO, which means there is very little you can do as he would know all the ways to sell data. The problem here is one of punishment. A 99 year solitary jail with no parole should cure that. By the time judiciary wakes up he will be claiming asylum on persecution.",
        "Punishment comes after prosecution and evidence, which in such cyber crimes, seems much harder to collect.   \nNonetheless, yeah stricter laws are perhaps the only solution for such a problem",
        "Cybersecurity comes under Ministry of Information Technology. \n\nThat minister is very busy nowadays.",
        "Comment something without making it political on r/india - level: impossible",
        "But the whole thing is political no?",
        "Yeah it was a joke.\nAnyways, ministers are mostly figure heads, with often little to do with actual work and progress.\nNot surprising they're focused on political campaigns even after being elected, instead of their actual work."
    ],
    "cleaned_text": "star health data leak cybersecurity joke privacy myth know week old news stumbled upon details today tb data million customers star health one also allegedly internal involvement shown video httpswwwyoutubecomwatchvifdsuydhttpswwwyoutubecomwatchvifdsuyd leaker claims apparently also includes data indian gov officials includes full name pan mobile email date birth residential address insured date birth insured name gender preexisting disease policy number health card nominee name nominee age nominee claim nominee relationship insured height weight bmi lots source multiple news articles leakers website httpsstarhealthleaksthttpsstarhealthleakst use vpn aadhar nuclear plants sbi dominos credit cards jokers stash people wake laws get stricter infra get better im dehradun last week uttarakhand faced massive cyber attack apparently malware ransomware ive heard critical gaps human errors dont wan na talk account fairly public remember stumbling upon parents data credit card details many years ago one leak forum tor dark web could nothing earlier used use kali linux custom password managers become far less paranoid fa seems pointless get identity theft high hopes india especially tech building deeptech startup years india never fails disappoint bureaucracy corruption mediocrity careless attitude far outweighs optimistic goals ",
    "cleaned_title": "star health data leak cybersecurity joke privacy myth",
    "cleaned_selftext": "know week old news stumbled upon details today tb data million customers star health one also allegedly internal involvement shown video httpswwwyoutubecomwatchvifdsuydhttpswwwyoutubecomwatchvifdsuyd leaker claims apparently also includes data indian gov officials includes full name pan mobile email date birth residential address insured date birth insured name gender preexisting disease policy number health card nominee name nominee age nominee claim nominee relationship insured height weight bmi lots source multiple news articles leakers website httpsstarhealthleaksthttpsstarhealthleakst use vpn aadhar nuclear plants sbi dominos credit cards jokers stash people wake laws get stricter infra get better im dehradun last week uttarakhand faced massive cyber attack apparently malware ransomware ive heard critical gaps human errors dont wan na talk account fairly public remember stumbling upon parents data credit card details many years ago one leak forum tor dark web could nothing earlier used use kali linux custom password managers become far less paranoid fa seems pointless get identity theft high hopes india especially tech building deeptech startup years india never fails disappoint bureaucracy corruption mediocrity careless attitude far outweighs optimistic goals",
    "cleaned_comments": "would really surprising later found paid babus irdai dont think irdai involvement perhaps negligence maybe increase scrutiny take seriously though insider decides information leak little mdm softwares like jamf etc even disabled gain access sensitive data case ciso means little would know ways sell data problem one punishment year solitary jail parole cure time judiciary wakes claiming asylum persecution punishment comes prosecution evidence cyber crimes seems much harder collect nonetheless yeah stricter laws perhaps solution problem cybersecurity comes ministry information technology minister busy nowadays comment something without making political rindia level impossible whole thing political yeah joke anyways ministers mostly figure heads often little actual work progress surprising theyre focused political campaigns even elected instead actual work",
    "light_cleaned_title": "Star Health data leak: cybersecurity is a joke & privacy is a myth;",
    "light_cleaned_selftext": "I know it's a week old news, but stumbled upon more details today. 7.2 TB data of 31 million customers. This star health one also allegedly has internal involvement as shown in this video - [https://www.youtube.com/watch?v=IFD0s0uYD88](https://www.youtube.com/watch?v=IFD0s0uYD88) The leaker claims - > > > > It apparently also includes data of Indian gov officials. And it includes - Full Name, PAN No., Mobile No., Email, Date of Birth, Residential Address, Insured Date of Birth, Insured Name, Gender, Pre-existing Disease, Policy Number, Health Card, Nominee Name, Nominee Age, Nominee Claim %, Nominee Relationship, Insured Height, Weight, BMI, Lots more... Source: multiple news articles and the leakers website - [https://starhealthleak.st/](https://starhealthleak.st/) \\[use a VPN\\] From Aadhar to Nuclear plants, SBI, Dominos, the Credit cards on Joker's stash, when will people wake up? When will laws get stricter and infra get better? I'm from Dehradun and last week, Uttarakhand faced a massive cyber attack apparently malware / ransomware. I've heard of some critical gaps and human errors, but don't wanna talk about it as my account is fairly public. I remember stumbling upon my parent's data and credit card details many years ago in one such leak, when I was 14, on a forum on Tor (Dark web), but could do nothing about it. Earlier I used to use Kali Linux and custom password managers, but had become far less paranoid now. 2FA seems pointless, if you get an identity theft. I have very high hopes from India, especially in tech and have been building a deeptech startup for 4 years now. But India never fails to disappoint me. The bureaucracy, corruption, mediocrity and careless attitude far outweighs the optimistic goals.",
    "light_cleaned_comments": "Would it be really surprising if later it’s found that they paid off the babus of IRDAI? I don't think IRDAI can have any involvement, perhaps some negligence maybe. They should increase scrutiny and take it very seriously though If an insider decides to do information leak, there is very little you can do. There are MDM softwares like JAMF etc but even they can be disabled to gain access to sensitive data. In this case it was CISO, which means there is very little you can do as he would know all the ways to sell data. The problem here is one of punishment. A 99 year solitary jail with no parole should cure that. By the time judiciary wakes up he will be claiming asylum on persecution. Punishment comes after prosecution and evidence, which in such cyber crimes, seems much harder to collect. Nonetheless, yeah stricter laws are perhaps the only solution for such a problem Cybersecurity comes under Ministry of Information Technology. That minister is very busy nowadays. Comment something without making it political on r/india - level: impossible But the whole thing is political no? Yeah it was a joke. Anyways, ministers are mostly figure heads, with often little to do with actual work and progress. Not surprising they're focused on political campaigns even after being elected, instead of their actual work."
}