{
    "id": "13q1jwb",
    "title": "Are you obliged to show ID to police in India for walking outside at night",
    "url": "https://www.reddit.com/r/india/comments/13q1jwb/are_you_obliged_to_show_id_to_police_in_india_for/",
    "selftext": "So recently police stopped a friend for walking outside at night in India and demanded an ID. Are you obliged to show an ID to the police when there is no suspicion for criminal activity?\n\nI know in US you have a right to be silent and are not obliged to show an Id. I dont know what is the law in India on this. If anybody can help it will be very useful\n\n  \nHere is the video of the interaction:\n\n[https://youtube.com/shorts/yRGJjOj4LEk?feature=share](https://youtube.com/shorts/yRGJjOj4LEk?feature=share)",
    "flair": "Law & Courts",
    "score": 3,
    "num_comments": 10,
    "created_utc": 1684877663.0,
    "convurl": "https://external-preview.redd.it/xUXZ2CKyPY0Hn7M9A__r6FKTSagbW-Oi5AP7cCsqAag.jpg?auto=webp&v=enabled&s=80596069170706886a5fa72c5a4cf3d11087a838",
    "comments": [
        "Law here is whatever the policeman says, that's why no one walks outside late night",
        "Don't see anything wrong unless they are being selective in their stop and search and not random",
        "Have your aadhar in digilocker in your phone! It's not worth the drama going against police anywhere.",
        "“I know in US you have a right to be silent and are not obliged to show an Id.” \n\nTotally irrelevant to the post, but this isn’t actually true. Everyone in the U.S. is entitled to Fifth Amendment protections, which afford the right to remain silent and avoid self-incrimination. \n\nHowever, many individual states do have so-called “Stop & Identify” statutes, under which police officers can compel a detained person to provide I.D. during a traffic stop or other interaction.",
        "Yes, you're required to show them an ID, and give them your name and address. If you don't, then as per CrPC, they can legally detain you for 24 hours to \"ascertain\" your identity, without any warrant.",
        "Bhai batado na, right to privacy public place pe ? Road par Jaa rahe ho usko doubt hai to batake chalte bano . Yeh India hai meri jaan .yaha wo aapko kheech ke 2 rakh dega aur koi chuu na bolega . Aur waise Police wala thik thak baat kar raha hai , to aise logon ko izzat do , Verna 90% Police Wale vardi ka roub jhaadte hai India mei.Just Chill Bhai !!!",
        "If think it would be wise to comply not just for your safety but for safety of others. If you are not guilty idk what the fuss is all about.\n\nHere's the real life scenario from Bangalore. We and our friends used to live along side a no traffic road that was heavily frequented by couples, especially in the event and late at night. It was the perfect place for snatchers/thieves. And so you would always see police roaming around that area. If you happen to walk/drive along that road in the night police would enquire and inform you about the incidents that were happening there. And these incidents sometimes would sometimes would turn fatal for the victim so it felt safe for us they were doing that to everyone roaming odd times at night.\n\nAnd YES, you have got to show them identification if they ask you for it. If you don't, they do have the power to make an arrest without a warrant. \n\nYou on the other hand also have the right to ask them for their identification.\n\nI agree, these are reports of police harrassment and it is night and day when it comes to what on paper and what is in practice. But it is in your best interest simply not to get into an argument with the police."
    ],
    "cleaned_text": "obliged show id police india walking outside night recently police stopped friend walking outside night india demanded id obliged show id police suspicion criminal activity know us right silent obliged show id dont know law india anybody help useful video interaction httpsyoutubecomshortsyrgjjojlekfeaturesharehttpsyoutubecomshortsyrgjjojlekfeatureshare ",
    "cleaned_title": "obliged show id police india walking outside night",
    "cleaned_selftext": "recently police stopped friend walking outside night india demanded id obliged show id police suspicion criminal activity know us right silent obliged show id dont know law india anybody help useful video interaction httpsyoutubecomshortsyrgjjojlekfeaturesharehttpsyoutubecomshortsyrgjjojlekfeatureshare",
    "cleaned_comments": "law whatever policeman says thats one walks outside late night dont see anything wrong unless selective stop search random aadhar digilocker phone worth drama going police anywhere know us right silent obliged show id totally irrelevant post isnt actually true everyone us entitled fifth amendment protections afford right remain silent avoid selfincrimination however many individual states socalled stop identify statutes police officers compel detained person provide id traffic stop interaction yes youre required show id give name address dont per crpc legally detain hours ascertain identity without warrant bhai batado na right privacy public place pe road par jaa rahe ho usko doubt hai batake chalte bano yeh india hai meri jaan yaha wo aapko kheech ke rakh dega aur koi chuu na bolega aur waise police wala thik thak baat kar raha hai aise logon ko izzat verna police wale vardi ka roub jhaadte hai india meijust chill bhai think would wise comply safety safety others guilty idk fuss heres real life scenario bangalore friends used live along side traffic road heavily frequented couples especially event late night perfect place snatchersthieves would always see police roaming around area happen walkdrive along road night police would enquire inform incidents happening incidents sometimes would sometimes would turn fatal victim felt safe us everyone roaming odd times night yes got show identification ask dont power make arrest without warrant hand also right ask identification agree reports police harrassment night day comes paper practice best interest simply get argument police",
    "light_cleaned_title": "Are you obliged to show ID to police in India for walking outside at night",
    "light_cleaned_selftext": "So recently police stopped a friend for walking outside at night in India and demanded an ID. Are you obliged to show an ID to the police when there is no suspicion for criminal activity? I know in US you have a right to be silent and are not obliged to show an Id. I dont know what is the law in India on this. If anybody can help it will be very useful Here is the video of the interaction: [https://youtube.com/shorts/yRGJjOj4LEk?feature=share](https://youtube.com/shorts/yRGJjOj4LEk?feature=share)",
    "light_cleaned_comments": "Law here is whatever the policeman says, that's why no one walks outside late night Don't see anything wrong unless they are being selective in their stop and search and not random Have your aadhar in digilocker in your phone! It's not worth the drama going against police anywhere. “I know in US you have a right to be silent and are not obliged to show an Id.” Totally irrelevant to the post, but this isn’t actually true. Everyone in the U.S. is entitled to Fifth Amendment protections, which afford the right to remain silent and avoid self-incrimination. However, many individual states do have so-called “Stop & Identify” statutes, under which police officers can compel a detained person to provide I.D. during a traffic stop or other interaction. Yes, you're required to show them an ID, and give them your name and address. If you don't, then as per CrPC, they can legally detain you for 24 hours to \"ascertain\" your identity, without any warrant. Bhai batado na, right to privacy public place pe ? Road par Jaa rahe ho usko doubt hai to batake chalte bano . Yeh India hai meri jaan .yaha wo aapko kheech ke 2 rakh dega aur koi chuu na bolega . Aur waise Police wala thik thak baat kar raha hai , to aise logon ko izzat do , Verna 90% Police Wale vardi ka roub jhaadte hai India mei.Just Chill Bhai !!! If think it would be wise to comply not just for your safety but for safety of others. If you are not guilty idk what the fuss is all about. Here's the real life scenario from Bangalore. We and our friends used to live along side a no traffic road that was heavily frequented by couples, especially in the event and late at night. It was the perfect place for snatchers/thieves. And so you would always see police roaming around that area. If you happen to walk/drive along that road in the night police would enquire and inform you about the incidents that were happening there. And these incidents sometimes would sometimes would turn fatal for the victim so it felt safe for us they were doing that to everyone roaming odd times at night. And YES, you have got to show them identification if they ask you for it. If you don't, they do have the power to make an arrest without a warrant. You on the other hand also have the right to ask them for their identification. I agree, these are reports of police harrassment and it is night and day when it comes to what on paper and what is in practice. But it is in your best interest simply not to get into an argument with the police."
}