{
    "id": "13gcfp9",
    "title": "Is a Women-Only Recruitment Portal Fake Empowerment or Discrimination?",
    "url": "https://www.reddit.com/r/india/comments/13gcfp9/is_a_womenonly_recruitment_portal_fake/",
    "selftext": "I recently came across a recruitment portal that exclusively targets women for job opportunities. While the idea of empowering women in the workforce is commendable, it made me wonder about the potential implications of such a platform. Is this women-only recruitment portal truly empowering or does it amount to discrimination? And if it were a men-only recruitment portal, would we view it differently?\n\nI'm interested in hearing various perspectives on this matter. Are women-only recruitment portals a genuine effort to address historical disparities and promote gender equality? Or do they perpetuate a form of discrimination by excluding men from these opportunities? Is it fair to have separate platforms based on gender, or should we strive for more inclusive solutions?\n\nPlease share your thoughts and insights on whether a women-only recruitment portal can be seen as a legitimate empowerment strategy or if it crosses the line into discrimination. How do we strike a balance between promoting gender equality and avoiding the exclusion of any gender? Let's discuss and explore this complex issue together.\n\nhttps://preview.redd.it/hs7fdy9oekza1.png?width=1709&format=png&auto=webp&v=enabled&s=142777b801dd447667641087b0d947e2f2e457b2",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 9,
    "created_utc": 1683968976.0,
    "convurl": "https://b.thumbs.redditmedia.com/qLSKNKRJDdnk-D4gnSyWhLS9muT8gs-X6v1pDitmNmg.jpg",
    "comments": [
        "Indian women workforce participation levels are dropping. They are currently lower than pakistan. This is bad. Very bad. We need focused policy to uplift women",
        "What to expect under modi govt",
        "Women are free to do jobs nowadays even more than before…if women workforce participation is dropping doesn’t it mean that women aren’t willing to climb the corporate ladder anymore…\nOn a separate statistic, women entrepreneurship is on the rise…if they aren’t willing to run 9-5 at the beck and call of her boss…rather they are doing something of their very own? \n\nAnd this drop of women participation in workforce is on the rise since last 15-20 years…and open mindedness and liberalisation is on the rise among Indians…imo women are quitting corporate slavery…they don’t need to be uplifted at this point regarding the job scenario at least…there are other aspects of women’s rights to be worked upon\n\nEdit: feel free to counter I would learn something from that",
        "Incorrect. Women participation has been rising since the 90s and was rising until the 00s. It started dropping in the 10s. \n\nSomething has changed. No idea what, but women need focused policy for their upliftment.",
        "Apologies for messing up the timeline…yeah ur right…yet again…women are free to work…but they aren’t doing corporate office work anymore…rather they are doing business…young girls to old aunties…everyone…and women by nature are entrepreneurial and innovative…I won’t be surprised if offices feel stifling to them…more than what men feel…women aren’t getting suppressed here…u want to force a population in a workplace…the work quality will go down…women are quitting of their own free will…why do u want to project your idea of upliftment on women…you are free to be you…\nGood day sis",
        "I'm a guy. And women focused policy has shown great result in India before. But that was when it was done by the government.\n\nOutside India, IBM has a few notable stories on women focused hiring that have gone on to be white papers and what not.",
        "Is that really a bad thing? \n\nIn extreme poverty, women don't have an option. They have to work to survive, work as house maids, construction labour, factory workers and other low pay excruciating jobs. \n\nAs the family income rises into lower middle class , the compulsion to work menial jobs fades. Now women have a choice to either be a housewife in the comforts of their house or work exhausting jobs 10-12 hours a day, while the men still work long hard hours. \n\nAs the Family Income Rises even further into middle class, basic needs and comforts are no longer a concern. Women are educated well and enter white-collar jobs that pay really well. Engineering Law Medical Architecture , for the women to meet their own demands as well as contribute to family expenses.\n\nAnd as it comes to upper-middle class to rich, we see a trend of trophy wives. As there is now absolutely no need for a second income , men earn high enough to fulfill any and all needs of the family and would much rather prefer their wives to have a life with as little struggle as possible. \n\n\n\n\nGiven the choice between working and being a homemaker, 10/10 i would choose to be a homemaker. Which is much much easier that working 10-12 hours a day. Unfortunately I'm a guy and will have to earn money, even women who earn good money look for husbands earning even more. No one is willing to keep a househusband",
        "Maybe you would choose to be a homemaker. \n\nMany women in the west choose it to. What matters is the choice."
    ],
    "cleaned_text": "womenonly recruitment portal fake empowerment discrimination recently came across recruitment portal exclusively targets women job opportunities idea empowering women workforce commendable made wonder potential implications platform womenonly recruitment portal truly empowering amount discrimination menonly recruitment portal would view differently im interested hearing various perspectives matter womenonly recruitment portals genuine effort address historical disparities promote gender equality perpetuate form discrimination excluding men opportunities fair separate platforms based gender strive inclusive solutions please share thoughts insights whether womenonly recruitment portal seen legitimate empowerment strategy crosses line discrimination strike balance promoting gender equality avoiding exclusion gender lets discuss explore complex issue together ",
    "cleaned_title": "womenonly recruitment portal fake empowerment discrimination",
    "cleaned_selftext": "recently came across recruitment portal exclusively targets women job opportunities idea empowering women workforce commendable made wonder potential implications platform womenonly recruitment portal truly empowering amount discrimination menonly recruitment portal would view differently im interested hearing various perspectives matter womenonly recruitment portals genuine effort address historical disparities promote gender equality perpetuate form discrimination excluding men opportunities fair separate platforms based gender strive inclusive solutions please share thoughts insights whether womenonly recruitment portal seen legitimate empowerment strategy crosses line discrimination strike balance promoting gender equality avoiding exclusion gender lets discuss explore complex issue together",
    "cleaned_comments": "indian women workforce participation levels dropping currently lower pakistan bad bad need focused policy uplift women expect modi govt women free jobs nowadays even beforeif women workforce participation dropping doesnt mean women arent willing climb corporate ladder anymore separate statistic women entrepreneurship riseif arent willing run beck call bossrather something drop women participation workforce rise since last yearsand open mindedness liberalisation rise among indiansimo women quitting corporate slaverythey dont need uplifted point regarding job scenario leastthere aspects womens rights worked upon edit feel free counter would learn something incorrect women participation rising since rising started dropping something changed idea women need focused policy upliftment apologies messing timelineyeah ur rightyet againwomen free workbut arent corporate office work anymorerather businessyoung girls old auntieseveryoneand women nature entrepreneurial innovativei wont surprised offices feel stifling themmore men feelwomen arent getting suppressed hereu want force population workplacethe work quality go downwomen quitting free willwhy u want project idea upliftment womenyou free good day sis im guy women focused policy shown great result india done government outside india ibm notable stories women focused hiring gone white papers really bad thing extreme poverty women dont option work survive work house maids construction labour factory workers low pay excruciating jobs family income rises lower middle class compulsion work menial jobs fades women choice either housewife comforts house work exhausting jobs hours day men still work long hard hours family income rises even middle class basic needs comforts longer concern women educated well enter whitecollar jobs pay really well engineering law medical architecture women meet demands well contribute family expenses comes uppermiddle class rich see trend trophy wives absolutely need second income men earn high enough fulfill needs family would much rather prefer wives life little struggle possible given choice working homemaker would choose homemaker much much easier working hours day unfortunately im guy earn money even women earn good money look husbands earning even one willing keep househusband maybe would choose homemaker many women west choose matters choice",
    "light_cleaned_title": "Is a Women-Only Recruitment Portal Fake Empowerment or Discrimination?",
    "light_cleaned_selftext": "I recently came across a recruitment portal that exclusively targets women for job opportunities. While the idea of empowering women in the workforce is commendable, it made me wonder about the potential implications of such a platform. Is this women-only recruitment portal truly empowering or does it amount to discrimination? And if it were a men-only recruitment portal, would we view it differently? I'm interested in hearing various perspectives on this matter. Are women-only recruitment portals a genuine effort to address historical disparities and promote gender equality? Or do they perpetuate a form of discrimination by excluding men from these opportunities? Is it fair to have separate platforms based on gender, or should we strive for more inclusive solutions? Please share your thoughts and insights on whether a women-only recruitment portal can be seen as a legitimate empowerment strategy or if it crosses the line into discrimination. How do we strike a balance between promoting gender equality and avoiding the exclusion of any gender? Let's discuss and explore this complex issue together.",
    "light_cleaned_comments": "Indian women workforce participation levels are dropping. They are currently lower than pakistan. This is bad. Very bad. We need focused policy to uplift women What to expect under modi govt Women are free to do jobs nowadays even more than before…if women workforce participation is dropping doesn’t it mean that women aren’t willing to climb the corporate ladder anymore… On a separate statistic, women entrepreneurship is on the rise…if they aren’t willing to run 9-5 at the beck and call of her boss…rather they are doing something of their very own? And this drop of women participation in workforce is on the rise since last 15-20 years…and open mindedness and liberalisation is on the rise among Indians…imo women are quitting corporate slavery…they don’t need to be uplifted at this point regarding the job scenario at least…there are other aspects of women’s rights to be worked upon Edit: feel free to counter I would learn something from that Incorrect. Women participation has been rising since the 90s and was rising until the 00s. It started dropping in the 10s. Something has changed. No idea what, but women need focused policy for their upliftment. Apologies for messing up the timeline…yeah ur right…yet again…women are free to work…but they aren’t doing corporate office work anymore…rather they are doing business…young girls to old aunties…everyone…and women by nature are entrepreneurial and innovative…I won’t be surprised if offices feel stifling to them…more than what men feel…women aren’t getting suppressed here…u want to force a population in a workplace…the work quality will go down…women are quitting of their own free will…why do u want to project your idea of upliftment on women…you are free to be you… Good day sis I'm a guy. And women focused policy has shown great result in India before. But that was when it was done by the government. Outside India, IBM has a few notable stories on women focused hiring that have gone on to be white papers and what not. Is that really a bad thing? In extreme poverty, women don't have an option. They have to work to survive, work as house maids, construction labour, factory workers and other low pay excruciating jobs. As the family income rises into lower middle class , the compulsion to work menial jobs fades. Now women have a choice to either be a housewife in the comforts of their house or work exhausting jobs 10-12 hours a day, while the men still work long hard hours. As the Family Income Rises even further into middle class, basic needs and comforts are no longer a concern. Women are educated well and enter white-collar jobs that pay really well. Engineering Law Medical Architecture , for the women to meet their own demands as well as contribute to family expenses. And as it comes to upper-middle class to rich, we see a trend of trophy wives. As there is now absolutely no need for a second income , men earn high enough to fulfill any and all needs of the family and would much rather prefer their wives to have a life with as little struggle as possible. Given the choice between working and being a homemaker, 10/10 i would choose to be a homemaker. Which is much much easier that working 10-12 hours a day. Unfortunately I'm a guy and will have to earn money, even women who earn good money look for husbands earning even more. No one is willing to keep a househusband Maybe you would choose to be a homemaker. Many women in the west choose it to. What matters is the choice."
}