{
    "id": "13xai2m",
    "title": "Graphs/Graphics on Modi vs Rahul, Govt performance, Economic conditions etc from CSDS-Lokniti - The Print's recent article",
    "url": "https://www.reddit.com/gallery/13xai2m",
    "selftext": "1. https://theprint.in/opinion/rahul-gandhis-acceptability-as-pm-nearly-doubled-since-2014-more-than-half-are-non-congress/1599274/\n\n2. https://theprint.in/opinion/most-indians-think-modi-govt-has-made-india-vishwaguru-but-worsened-economics-at-home/1601694/",
    "flair": "Politics",
    "score": 179,
    "num_comments": 37,
    "created_utc": 1685602383.0,
    "convurl": "https://i.redd.it/1oagtx89tc3b1.jpg",
    "comments": [
        "https://theprint.in/opinion/rahul-gandhis-acceptability-as-pm-nearly-doubled-since-2014-more-than-half-are-non-congress/1599274/\n\nhttps://theprint.in/opinion/most-indians-think-modi-govt-has-made-india-vishwaguru-but-worsened-economics-at-home/1601694/",
        "Out of 1.4 billion people why is that it’s just these 2 who are meant to be leaders🤦🏽‍♂️….and why does media portray as if there is no one better than them? Most populated country and we only got 2 idiots to choose.",
        "These graphics, depending on the sample size showcase 2 important things:\n\n1. Rahul Gandhi still lags behind NaMo to be considered as a challenger\n2. There are enough problems and issues on which the opposition parties can combine to make a serious dent in 2024 elections, if not go for an outright win \n\nI still think that Rahul Gandhi has that stigma that needs to be washed off with consistency in his election results. One win in Karnataka is not enough to warrant making him the face again for the PM and he shouldn't aspire for it either. However, the general public definitely has been feeling a pinch, and if the messaging can be done correctly, a savvy political manager can drive the opposition to a very strong foothold in the 2024 elections. \n\nOptimistic, but not hopeful about the future.",
        "I'd rather see tharoor as pm than rg.",
        "Any other idiot you would like to nominate",
        "Tharoor's appeal only exists on the internet",
        "A win in MP, RJ and CG can set the narrative and momentum for opposition. At least they'll be in a good position to challenge the current incumbent.",
        "Hopeful for Modi in 2024, common man in India is much more smarter than internet community who don't even cast a vote, lmao.",
        "Bjp mukt Bharat",
        "Naveen Pattnaik",
        "Interesting last graph, larger percentage of people including BJP voters agree with giving freebies to the poor.",
        "Fuck it.. Meself",
        "So practically no difference between the popularity of the two leaders between 2019 and now?",
        "Yes the unknown 20% will play the big part if Raga can get at least 50% of the unknown 20% then they can make some serious dent otherwise  other party has loyal fanbase, given the time remaining at max they can go down to 40%.",
        "Rahul Gandhi won't even qualify to stand in the 2024 LS election. He will not be the PM's face. If (and this is a humongous if) UPA makes a comeback, PM would either be Kharge or Nitish.",
        "sarcasm guarranteed",
        "It doesn't matter, he needs to focus on what he's doing do another yatra keep connecting with people and spread his vision and agenda. Talk about issues not ram and his lackeys",
        "**not sure why the article does not mention anything about how the survey was done, how many people were surveryed and which geogrpahic areas were they from.**\n\n/u/HindiHeinHum any idea how to access this?",
        "Not easy for congress to win all three.",
        "That information is indeed missing. I tried searching on csds-lokniti's sites and accounts as well but only found links to these articles. They're clearly not very reliable but one can take the face value of csds.",
        "I don't think a grand alliance will let a main figure from any party take the top spot, or it'll become a fight between parties wanting their leader to be pm. They might agree on someone like kharge",
        "They are hosting a launch of general election prep on 12 June with nitish as face.",
        "Thanks for sharing, great graphics.  \n\n\nLooks like we're headed towards one more Modi term (hopefully this next one is the last one).",
        "The real question is does Rahul G wants to be PM and for that matter take up any administrative responsibility?\n\nHe has learnt that power of a King maker is bigger than the king himself. You get to enjoy the powers of the king without carrying the baggage of responsibility and accountability.",
        "u/Outrageous_Humor_313"
    ],
    "cleaned_text": "graphsgraphics modi vs rahul govt performance economic conditions etc csdslokniti prints recent article  ",
    "cleaned_title": "graphsgraphics modi vs rahul govt performance economic conditions etc csdslokniti prints recent article",
    "cleaned_selftext": "",
    "cleaned_comments": "billion people meant leadersand media portray one better populated country got idiots choose graphics depending sample size showcase important things rahul gandhi still lags behind namo considered challenger enough problems issues opposition parties combine make serious dent elections go outright win still think rahul gandhi stigma needs washed consistency election results one win karnataka enough warrant making face pm shouldnt aspire either however general public definitely feeling pinch messaging done correctly savvy political manager drive opposition strong foothold elections optimistic hopeful future id rather see tharoor pm rg idiot would like nominate tharoors appeal exists internet win mp rj cg set narrative momentum opposition least theyll good position challenge current incumbent hopeful modi common man india much smarter internet community dont even cast vote lmao bjp mukt bharat naveen pattnaik interesting last graph larger percentage people including bjp voters agree giving freebies poor fuck meself practically difference popularity two leaders yes unknown play big part raga get least unknown make serious dent otherwise party loyal fanbase given time remaining max go rahul gandhi wont even qualify stand ls election pms face humongous upa makes comeback pm would either kharge nitish sarcasm guarranteed doesnt matter needs focus hes another yatra keep connecting people spread vision agenda talk issues ram lackeys sure article mention anything survey done many people surveryed geogrpahic areas uhindiheinhum idea access easy congress win three information indeed missing tried searching csdsloknitis sites accounts well found links articles theyre clearly reliable one take face value csds dont think grand alliance let main figure party take top spot itll become fight parties wanting leader pm might agree someone like kharge hosting launch general election prep june nitish face thanks sharing great graphics looks like headed towards one modi term hopefully next one last one real question rahul g wants pm matter take administrative responsibility learnt power king maker bigger king get enjoy powers king without carrying baggage responsibility accountability uoutrageoushumor",
    "light_cleaned_title": "Graphs/Graphics on Modi vs Rahul, Govt performance, Economic conditions etc from CSDS-Lokniti - The Print's recent article",
    "light_cleaned_selftext": "1. 2.",
    "light_cleaned_comments": "Out of 1.4 billion people why is that it’s just these 2 who are meant to be leaders🤦🏽‍♂️….and why does media portray as if there is no one better than them? Most populated country and we only got 2 idiots to choose. These graphics, depending on the sample size showcase 2 important things: 1. Rahul Gandhi still lags behind NaMo to be considered as a challenger 2. There are enough problems and issues on which the opposition parties can combine to make a serious dent in 2024 elections, if not go for an outright win I still think that Rahul Gandhi has that stigma that needs to be washed off with consistency in his election results. One win in Karnataka is not enough to warrant making him the face again for the PM and he shouldn't aspire for it either. However, the general public definitely has been feeling a pinch, and if the messaging can be done correctly, a savvy political manager can drive the opposition to a very strong foothold in the 2024 elections. Optimistic, but not hopeful about the future. I'd rather see tharoor as pm than rg. Any other idiot you would like to nominate Tharoor's appeal only exists on the internet A win in MP, RJ and CG can set the narrative and momentum for opposition. At least they'll be in a good position to challenge the current incumbent. Hopeful for Modi in 2024, common man in India is much more smarter than internet community who don't even cast a vote, lmao. Bjp mukt Bharat Naveen Pattnaik Interesting last graph, larger percentage of people including BJP voters agree with giving freebies to the poor. Fuck it.. Meself So practically no difference between the popularity of the two leaders between 2019 and now? Yes the unknown 20% will play the big part if Raga can get at least 50% of the unknown 20% then they can make some serious dent otherwise other party has loyal fanbase, given the time remaining at max they can go down to 40%. Rahul Gandhi won't even qualify to stand in the 2024 LS election. He will not be the PM's face. If (and this is a humongous if) UPA makes a comeback, PM would either be Kharge or Nitish. sarcasm guarranteed It doesn't matter, he needs to focus on what he's doing do another yatra keep connecting with people and spread his vision and agenda. Talk about issues not ram and his lackeys **not sure why the article does not mention anything about how the survey was done, how many people were surveryed and which geogrpahic areas were they from.** /u/HindiHeinHum any idea how to access this? Not easy for congress to win all three. That information is indeed missing. I tried searching on csds-lokniti's sites and accounts as well but only found links to these articles. They're clearly not very reliable but one can take the face value of csds. I don't think a grand alliance will let a main figure from any party take the top spot, or it'll become a fight between parties wanting their leader to be pm. They might agree on someone like kharge They are hosting a launch of general election prep on 12 June with nitish as face. Thanks for sharing, great graphics. Looks like we're headed towards one more Modi term (hopefully this next one is the last one). The real question is does Rahul G wants to be PM and for that matter take up any administrative responsibility? He has learnt that power of a King maker is bigger than the king himself. You get to enjoy the powers of the king without carrying the baggage of responsibility and accountability. u/Outrageous_Humor_313"
}