{
    "id": "1bd5u4e",
    "title": "Qnet infinity scam",
    "url": "https://www.reddit.com/r/india/comments/1bd5u4e/qnet_infinity_scam/",
    "selftext": "Hello people. I know this is an old scam but I've come across this recently in my engineering college. \n\nPlease Google \" qnet scam \" and read quora articles and reddit posts. I can't post quora links here due to privacy issues. \n\nJSS engineering college in Bengaluru already has 3 people that I know off but was pitched about this to many. \n\nThe scam amount is in Lakhs and nation wide, it's more than 2000cr.\n\nThey won't tell the company name ( qnet Infiniti) at all unless you invest and after you invest it's too late.\n\nThey will tell that they went to international trips from the company and the places will be Malaysia, Dubai, hong kong, Sri Lanka and Thailand. \nAll the international trips are self sponsored or credit card loan and are ways to get \"business partners\".\n\nIf you've been pitched about this by someone, please inform all of their friends that this is a scam and you also be safe. \n\nAnyone that says \" you'll get rich quick, be my business partner \", or \"an opportunity opened up just for you, come meet my senior partner and we'll discuss\" ,\" come to Starbucks/third wave coffee/ etc\" especially near BTM layout or UB City. They'll also mention direct selling, marketing and franchise for high luxury items. Run from them, they are trying to scam you because they got scammed. They will even be very close friends or childhood friends or colleagues a while back. \n\nTheir Target is recent graduates (who can get loans easily), or teens with rich parents or children of recently retired parents. If you've invested recently, you can get your money back within 30 days. Just ask for it and run for your life.\n\nIf you have invested and it's been more than 30 days, don't worry there are many people online saying that they will help you get your money back\n\nThey on purpose give you multiple books to read so that you waste your time (30 days) and don't ask for refund. \n\nPlease stay away and share it to all your friends and family.\n \n\nWatch this [last part](https://youtu.be/0DH3yr6_MSI) where they don't deny that this is a scam and previous videos if interested \nWatch this [channel](https://youtube.com/@scam-reporter) God bless him, he's saved many people from this scam. Swapnil if you're reading this, thanks for everything you've done. \n\nRead [this](https://www.moneylife.in/article/qnet-and-vihaan-fail-to-make-entry-in-the-list-of-direct-selling-entities-in-india/55707.html) as well \n\nThanks for reading.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1710271027.0,
    "convurl": "https://external-preview.redd.it/SbTYyeQotb5Z6I7iO-4QrKR8VDunbN3HYFdRfi_jJPg.jpg?auto=webp&s=10f677b1409277e5ae6eb4d9db354b55ac470eb5",
    "comments": [
        "Yo, need some help with this bit"
    ],
    "cleaned_text": "qnet infinity scam hello people know old scam ive come across recently engineering college please google qnet scam read quora articles reddit posts cant post quora links due privacy issues jss engineering college bengaluru already people know pitched many scam amount lakhs nation wide cr wont tell company name qnet infiniti unless invest invest late tell went international trips company places malaysia dubai hong kong sri lanka thailand international trips self sponsored credit card loan ways get business partners youve pitched someone please inform friends scam also safe anyone says youll get rich quick business partner opportunity opened come meet senior partner well discuss come starbucksthird wave coffee etc especially near btm layout ub city theyll also mention direct selling marketing franchise high luxury items run trying scam got scammed even close friends childhood friends colleagues back target recent graduates get loans easily teens rich parents children recently retired parents youve invested recently get money back within days ask run life invested days dont worry many people online saying help get money back purpose give multiple books read waste time days dont ask refund please stay away share friends family watch last parthttpsyoutubedhyrmsi dont deny scam previous videos interested watch channelhttpsyoutubecomscamreporter god bless hes saved many people scam swapnil youre reading thanks everything youve done read thishttpswwwmoneylifeinarticleqnetandvihaanfailtomakeentryinthelistofdirectsellingentitiesinindiahtml well thanks reading ",
    "cleaned_title": "qnet infinity scam",
    "cleaned_selftext": "hello people know old scam ive come across recently engineering college please google qnet scam read quora articles reddit posts cant post quora links due privacy issues jss engineering college bengaluru already people know pitched many scam amount lakhs nation wide cr wont tell company name qnet infiniti unless invest invest late tell went international trips company places malaysia dubai hong kong sri lanka thailand international trips self sponsored credit card loan ways get business partners youve pitched someone please inform friends scam also safe anyone says youll get rich quick business partner opportunity opened come meet senior partner well discuss come starbucksthird wave coffee etc especially near btm layout ub city theyll also mention direct selling marketing franchise high luxury items run trying scam got scammed even close friends childhood friends colleagues back target recent graduates get loans easily teens rich parents children recently retired parents youve invested recently get money back within days ask run life invested days dont worry many people online saying help get money back purpose give multiple books read waste time days dont ask refund please stay away share friends family watch last parthttpsyoutubedhyrmsi dont deny scam previous videos interested watch channelhttpsyoutubecomscamreporter god bless hes saved many people scam swapnil youre reading thanks everything youve done read thishttpswwwmoneylifeinarticleqnetandvihaanfailtomakeentryinthelistofdirectsellingentitiesinindiahtml well thanks reading",
    "cleaned_comments": "yo need help bit",
    "light_cleaned_title": "Qnet infinity scam",
    "light_cleaned_selftext": "Hello people. I know this is an old scam but I've come across this recently in my engineering college. Please Google \" qnet scam \" and read quora articles and reddit posts. I can't post quora links here due to privacy issues. JSS engineering college in Bengaluru already has 3 people that I know off but was pitched about this to many. The scam amount is in Lakhs and nation wide, it's more than 2000cr. They won't tell the company name ( qnet Infiniti) at all unless you invest and after you invest it's too late. They will tell that they went to international trips from the company and the places will be Malaysia, Dubai, hong kong, Sri Lanka and Thailand. All the international trips are self sponsored or credit card loan and are ways to get \"business partners\". If you've been pitched about this by someone, please inform all of their friends that this is a scam and you also be safe. Anyone that says \" you'll get rich quick, be my business partner \", or \"an opportunity opened up just for you, come meet my senior partner and we'll discuss\" ,\" come to Starbucks/third wave coffee/ etc\" especially near BTM layout or UB City. They'll also mention direct selling, marketing and franchise for high luxury items. Run from them, they are trying to scam you because they got scammed. They will even be very close friends or childhood friends or colleagues a while back. Their Target is recent graduates (who can get loans easily), or teens with rich parents or children of recently retired parents. If you've invested recently, you can get your money back within 30 days. Just ask for it and run for your life. If you have invested and it's been more than 30 days, don't worry there are many people online saying that they will help you get your money back They on purpose give you multiple books to read so that you waste your time (30 days) and don't ask for refund. Please stay away and share it to all your friends and family. Watch this [last part](https://youtu.be/0DH3yr6_MSI) where they don't deny that this is a scam and previous videos if interested Watch this [channel](https://youtube.com/@scam-reporter) God bless him, he's saved many people from this scam. Swapnil if you're reading this, thanks for everything you've done. Read [this](https://www.moneylife.in/article/qnet-and-vihaan-fail-to-make-entry-in-the-list-of-direct-selling-entities-in-india/55707.html) as well Thanks for reading.",
    "light_cleaned_comments": "Yo, need some help with this bit"
}