{
    "id": "1640cga",
    "title": "Could we make a list of all companies and projects that failed because of protests and government incompetency?",
    "url": "https://www.reddit.com/r/india/comments/1640cga/could_we_make_a_list_of_all_companies_and/",
    "selftext": " E.g POSCO India\n\nI was watching a video by Charlie Munger on India learning from Singapore and that led me to wonder how many such projects failed because of our inept system.\n\nCould we work on a list, please? I will add them to this post based on your comments.\n\n[(128) Charlie Munger on Lee Kuan Yew and Singapore's Success | Daily Journal 2017 【C:C.M Ep.263】 - YouTube](https://www.youtube.com/watch?v=y3M4uKKVuEo)\n\n[POSCO India - Wikipedia](https://en.wikipedia.org/wiki/POSCO_India)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693261947.0,
    "convurl": "https://external-preview.redd.it/GbEHduZxRZQ6Z0HTmzL6p2zb8uc4VsQQ7kndRH4CV18.jpg?auto=webp&s=849487a71f522c7d1757047fcedbd48422ccb5b0",
    "comments": [
        "It is an accurate summary. What more should I add to the title? What should I remove? Just tell me already.",
        "incompetency and corruption*\n\nBSNL\nand private telecom companies too.\nAsking for crores of money by making a rule change in back date has a major role in weakening of Vodafone to the extent to be forced to merge with other company."
    ],
    "cleaned_text": "could make list companies projects failed protests government incompetency eg posco india watching video charlie munger india learning singapore led wonder many projects failed inept system could work list please add post based comments charlie munger lee kuan yew singapores success daily journal ccm ep youtubehttpswwwyoutubecomwatchvymukkvueo posco india wikipediahttpsenwikipediaorgwikiposcoindia ",
    "cleaned_title": "could make list companies projects failed protests government incompetency",
    "cleaned_selftext": "eg posco india watching video charlie munger india learning singapore led wonder many projects failed inept system could work list please add post based comments charlie munger lee kuan yew singapores success daily journal ccm ep youtubehttpswwwyoutubecomwatchvymukkvueo posco india wikipediahttpsenwikipediaorgwikiposcoindia",
    "cleaned_comments": "accurate summary add title remove tell already incompetency corruption bsnl private telecom companies asking crores money making rule change back date major role weakening vodafone extent forced merge company",
    "light_cleaned_title": "Could we make a list of all companies and projects that failed because of protests and government incompetency?",
    "light_cleaned_selftext": "E.g POSCO India I was watching a video by Charlie Munger on India learning from Singapore and that led me to wonder how many such projects failed because of our inept system. Could we work on a list, please? I will add them to this post based on your comments. [(128) Charlie Munger on Lee Kuan Yew and Singapore's Success | Daily Journal 2017 【C:C.M Ep.263】 - YouTube](https://www.youtube.com/watch?v=y3M4uKKVuEo) [POSCO India - Wikipedia](https://en.wikipedia.org/wiki/POSCO_India)",
    "light_cleaned_comments": "It is an accurate summary. What more should I add to the title? What should I remove? Just tell me already. incompetency and corruption* BSNL and private telecom companies too. Asking for crores of money by making a rule change in back date has a major role in weakening of Vodafone to the extent to be forced to merge with other company."
}