{
    "id": "177ubfk",
    "title": "Pencil Packaging WFH job scam",
    "url": "https://www.reddit.com/r/india/comments/177ubfk/pencil_packaging_wfh_job_scam/",
    "selftext": "As the title suggests, this is post about scammers pretending to be Hindustan Pencils employees and offering WFH pencil packaging jobs. \n\nI am a CS graduate and my family's go to technology solutions guy. My aunt saw some Ad on Facebook where Sonu sood promised WFH opportunities and in the link(WA chat)the job was for pencil packaging. \n\nThey say a shipment of pencils/pens will be delivered to you, after packing them the courier partner will pick it up from you and you can earn upwards of ₹30,000 every month. \n\nMy aunt initially paid ₹620 to guys who pretended to be employees of Hindustan Pencils and said they were retired Army personnels. They sent her an ID card to gain trust. The ID was totally fake. \n\nToday morning they said the shipment will be delivered, and while the driver was at the outskirts of the city my aunt will have to pay ₹2,550 of which ₹2,500 will be refunded instantly. \n\nShe does not have a bank account so she asked her tenant to pay them, which could not happen as SBI servers were down this morning. Eventually she came to me and asked me to make a payment for her and she'll give me cash to which I agreed. I tried too but since I too have an SBI account the payment failed. To make small talk I asked her why is she making an online transaction. \n\nShe told me the scammers have been pestering her to make the payment by calling her every 15-20 minutes. With the next call, I picked up and the guy had the audacity to threaten me while impersonating a Army personnel he then said he has a meeting and within 1/2 hr I'd see the repercussions of my actions. \n\nHe then sent an edited video of a policemen where he added his voice to the background in which he said that we should be very careful as he'd file a police complaints. Next he send a screenshot of the website to check police FIRs. \n\nI texted him that I'm filing a complaint as well and we'll see him in court. He understood that he's caught and didn't text back. \n\nMy aunt won't register a complaint as she doesn't want her husband to find out. I logged into her UIDAI account and locked her biometrics. \n\nPlease beware of this scam, I am adding some links to article over the Internet about this scam. \n\nBeing a marketer I've come to realize that digital ads have gained trust among our parents generation and they don't fact check. Try to take a minute of your time and tell your relatives who scroll through social media, about this scam. \n\n\n\n[Financial Express](https://www.financialexpress.com/jobs-career/education-hindustan-pencils-denies-offering-wfh-pencil-packing-jobs-takes-legal-action-against-scammers-falsely-attributing-nataraj-and-apsara-3221187/) \n\n[Deccan Herald](https://www.deccanherald.com/india/hindustan-pencils-takes-a-stand-against-scammers-urges-public-awareness-on-fake-job-offers-2667562)",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697303839.0,
    "convurl": "https://external-preview.redd.it/FHe6O1DJa9AT76wsnnRNLpNPGyrN57xsELr6indI8IQ.jpg?auto=webp&s=099fb00ba0df3b07d9e70cd4e5ad10633bdfe94c",
    "comments": [],
    "cleaned_text": "pencil packaging wfh job scam title suggests post scammers pretending hindustan pencils employees offering wfh pencil packaging jobs cs graduate familys go technology solutions guy aunt saw ad facebook sonu sood promised wfh opportunities linkwa chatthe job pencil packaging say shipment pencilspens delivered packing courier partner pick earn upwards every month aunt initially paid guys pretended employees hindustan pencils said retired army personnels sent id card gain trust id totally fake today morning said shipment delivered driver outskirts city aunt pay refunded instantly bank account asked tenant pay could happen sbi servers morning eventually came asked make payment shell give cash agreed tried since sbi account payment failed make small talk asked making online transaction told scammers pestering make payment calling every minutes next call picked guy audacity threaten impersonating army personnel said meeting within hr id see repercussions actions sent edited video policemen added voice background said careful hed file police complaints next send screenshot website check police firs texted im filing complaint well well see court understood hes caught didnt text back aunt wont register complaint doesnt want husband find logged uidai account locked biometrics please beware scam adding links article internet scam marketer ive come realize digital ads gained trust among parents generation dont fact check try take minute time tell relatives scroll social media scam financial expresshttpswwwfinancialexpresscomjobscareereducationhindustanpencilsdeniesofferingwfhpencilpackingjobstakeslegalactionagainstscammersfalselyattributingnatarajandapsara deccan heraldhttpswwwdeccanheraldcomindiahindustanpencilstakesastandagainstscammersurgespublicawarenessonfakejoboffers ",
    "cleaned_title": "pencil packaging wfh job scam",
    "cleaned_selftext": "title suggests post scammers pretending hindustan pencils employees offering wfh pencil packaging jobs cs graduate familys go technology solutions guy aunt saw ad facebook sonu sood promised wfh opportunities linkwa chatthe job pencil packaging say shipment pencilspens delivered packing courier partner pick earn upwards every month aunt initially paid guys pretended employees hindustan pencils said retired army personnels sent id card gain trust id totally fake today morning said shipment delivered driver outskirts city aunt pay refunded instantly bank account asked tenant pay could happen sbi servers morning eventually came asked make payment shell give cash agreed tried since sbi account payment failed make small talk asked making online transaction told scammers pestering make payment calling every minutes next call picked guy audacity threaten impersonating army personnel said meeting within hr id see repercussions actions sent edited video policemen added voice background said careful hed file police complaints next send screenshot website check police firs texted im filing complaint well well see court understood hes caught didnt text back aunt wont register complaint doesnt want husband find logged uidai account locked biometrics please beware scam adding links article internet scam marketer ive come realize digital ads gained trust among parents generation dont fact check try take minute time tell relatives scroll social media scam financial expresshttpswwwfinancialexpresscomjobscareereducationhindustanpencilsdeniesofferingwfhpencilpackingjobstakeslegalactionagainstscammersfalselyattributingnatarajandapsara deccan heraldhttpswwwdeccanheraldcomindiahindustanpencilstakesastandagainstscammersurgespublicawarenessonfakejoboffers",
    "cleaned_comments": "",
    "light_cleaned_title": "Pencil Packaging WFH job scam",
    "light_cleaned_selftext": "As the title suggests, this is post about scammers pretending to be Hindustan Pencils employees and offering WFH pencil packaging jobs. I am a CS graduate and my family's go to technology solutions guy. My aunt saw some Ad on Facebook where Sonu sood promised WFH opportunities and in the link(WA chat)the job was for pencil packaging. They say a shipment of pencils/pens will be delivered to you, after packing them the courier partner will pick it up from you and you can earn upwards of ₹30,000 every month. My aunt initially paid ₹620 to guys who pretended to be employees of Hindustan Pencils and said they were retired Army personnels. They sent her an ID card to gain trust. The ID was totally fake. Today morning they said the shipment will be delivered, and while the driver was at the outskirts of the city my aunt will have to pay ₹2,550 of which ₹2,500 will be refunded instantly. She does not have a bank account so she asked her tenant to pay them, which could not happen as SBI servers were down this morning. Eventually she came to me and asked me to make a payment for her and she'll give me cash to which I agreed. I tried too but since I too have an SBI account the payment failed. To make small talk I asked her why is she making an online transaction. She told me the scammers have been pestering her to make the payment by calling her every 15-20 minutes. With the next call, I picked up and the guy had the audacity to threaten me while impersonating a Army personnel he then said he has a meeting and within 1/2 hr I'd see the repercussions of my actions. He then sent an edited video of a policemen where he added his voice to the background in which he said that we should be very careful as he'd file a police complaints. Next he send a screenshot of the website to check police FIRs. I texted him that I'm filing a complaint as well and we'll see him in court. He understood that he's caught and didn't text back. My aunt won't register a complaint as she doesn't want her husband to find out. I logged into her UIDAI account and locked her biometrics. Please beware of this scam, I am adding some links to article over the Internet about this scam. Being a marketer I've come to realize that digital ads have gained trust among our parents generation and they don't fact check. Try to take a minute of your time and tell your relatives who scroll through social media, about this scam. [Financial Express](https://www.financialexpress.com/jobs-career/education-hindustan-pencils-denies-offering-wfh-pencil-packing-jobs-takes-legal-action-against-scammers-falsely-attributing-nataraj-and-apsara-3221187/) [Deccan Herald](https://www.deccanherald.com/india/hindustan-pencils-takes-a-stand-against-scammers-urges-public-awareness-on-fake-job-offers-2667562)",
    "light_cleaned_comments": ""
}