{
    "id": "12lo5zl",
    "title": "Need help finding a really old hindi song",
    "url": "https://www.reddit.com/r/india/comments/12lo5zl/need_help_finding_a_really_old_hindi_song/",
    "selftext": "I can't seem to remember either the lyrics or the melody for this song. So here's everything that I can remember about it:\n\n1. It's very old. Black and white old.\n2. It's a duet.\n3. In the song, the woman is trying to convince the man that they can make their relationship work but he feels like it's doomed to fail because of their differences.\nShe compares herself to a cloud (pretty sure 'badli' word was used) and him to a river and that their destinies are intertwined and that it's her fate to eventually meet him, like when clouds rain & end up in the river.\n\nPlease help me!! I loved this song and cannot remember it at all. It's like a brain itch that doesn't go away.\n\nEdit: [Found it](https://youtu.be/ClAXd0itpsA) 😬",
    "flair": "AskIndia",
    "score": 4,
    "num_comments": 3,
    "created_utc": 1681457110.0,
    "convurl": "https://external-preview.redd.it/7meTllfFoaAcpKOFLKkH4bgfJmlc9rRt5kzWzfiqMp4.jpg?auto=webp&v=enabled&s=67b1fc49a187a7f1c0c487fedf03fb6c10f72828",
    "comments": [
        "I just found the song. Not even a minute ago. The feeling is orgasmic 🤭🤭\n\nI had been trying to Google it for the past 2 hours. Only to find out I had everything wrong about it. The actors, the male singer, the lyricist. All I had right was the year lol.\nI just went through 200 songs by Mukesh before giving up and going back to search on YouTube. All I did was play 2 3 similar songs so the algorithm does the magic. I did have to scroll a lot but eventually found it. \n\nThe song is Itna Na Mujh Se Tu from Chhaya (1961).\nPicturised on Sunil Dutt and Asha Parekh, sung by Lata and Talat Mahmood. Never in my life I would have thought to search for Talat Mahmood songs.\nEven the lyricist name I haven't heard before.",
        "Thanks for sharing the song, I have been listening to some classics this entire evening and this was a new one for me."
    ],
    "cleaned_text": "need help finding really old hindi song cant seem remember either lyrics melody song heres everything remember old black white old duet song woman trying convince man make relationship work feels like doomed fail differences compares cloud pretty sure badli word used river destinies intertwined fate eventually meet like clouds rain end river please help loved song remember like brain itch doesnt go away edit found ithttpsyoutubeclaxditpsa ",
    "cleaned_title": "need help finding really old hindi song",
    "cleaned_selftext": "cant seem remember either lyrics melody song heres everything remember old black white old duet song woman trying convince man make relationship work feels like doomed fail differences compares cloud pretty sure badli word used river destinies intertwined fate eventually meet like clouds rain end river please help loved song remember like brain itch doesnt go away edit found ithttpsyoutubeclaxditpsa",
    "cleaned_comments": "found song even minute ago feeling orgasmic trying google past hours find everything wrong actors male singer lyricist right year lol went songs mukesh giving going back search youtube play similar songs algorithm magic scroll lot eventually found song itna na mujh se tu chhaya picturised sunil dutt asha parekh sung lata talat mahmood never life would thought search talat mahmood songs even lyricist name havent heard thanks sharing song listening classics entire evening new one",
    "light_cleaned_title": "Need help finding a really old hindi song",
    "light_cleaned_selftext": "I can't seem to remember either the lyrics or the melody for this song. So here's everything that I can remember about it: 1. It's very old. Black and white old. 2. It's a duet. 3. In the song, the woman is trying to convince the man that they can make their relationship work but he feels like it's doomed to fail because of their differences. She compares herself to a cloud (pretty sure 'badli' word was used) and him to a river and that their destinies are intertwined and that it's her fate to eventually meet him, like when clouds rain & end up in the river. Please help me!! I loved this song and cannot remember it at all. It's like a brain itch that doesn't go away. Edit: [Found it](https://youtu.be/ClAXd0itpsA) 😬",
    "light_cleaned_comments": "I just found the song. Not even a minute ago. The feeling is orgasmic 🤭🤭 I had been trying to Google it for the past 2 hours. Only to find out I had everything wrong about it. The actors, the male singer, the lyricist. All I had right was the year lol. I just went through 200 songs by Mukesh before giving up and going back to search on YouTube. All I did was play 2 3 similar songs so the algorithm does the magic. I did have to scroll a lot but eventually found it. The song is Itna Na Mujh Se Tu from Chhaya (1961). Picturised on Sunil Dutt and Asha Parekh, sung by Lata and Talat Mahmood. Never in my life I would have thought to search for Talat Mahmood songs. Even the lyricist name I haven't heard before. Thanks for sharing the song, I have been listening to some classics this entire evening and this was a new one for me."
}