{
    "id": "16qr029",
    "title": "Shower thoughts- Therapy from desi victimhood, hypocrisy and the colonial mindset",
    "url": "https://www.reddit.com/r/india/comments/16qr029/shower_thoughts_therapy_from_desi_victimhood/",
    "selftext": "**This is a shower thought that I wanted to express for a while but it feels like the need of the hour.**\n\nGoing to therapy lets you identify repeating thought patterns that no longer serve you, and notice them the next time they come in so you can avoid going down the same road. Unfortunately, we can't afford therapy (broke AF), and were never had therapy for our colonial trauma.\n\nThe whole India-Canada debacle has exposed some aspects of our desi culture (be it Indian, Pakistani, or Bangladeshi). This culture, which was engineered by the colonial mindset to always stack things in the favor of our white rulers.   \n\n\nA culture, irrespective of religion, which makes us think that:\n\n1. Our religion is in the right, no matter the logical or evidence presented\n2. People of other religions have persecuted us and we are the victims. Therefore, the whole community must be evil, and we face an existential threat so we must counter/eliminate them\n3. We are in competition with every single person, and we must prove our worthiness by showing that we are better than them on every level- individually, community wise, and nationally\n4. If we show the white people this evidence of persecution, they will do the right thing and take action against them\n\nThe narrative was wipes out nuance out of every situation, where the narrative wants you to cast an entire group of people behind an event, even if they had literally nothing to do with it (could be just born into the community). \n\nYou can play a fun game yourself as an exercise- let X be your religion, and Y be a religion that has interacted with your religion, where is X and Y are religions of significant populations. You can do permutations and combinations and come up with this same exact format.\n\nOur politicians use this formula every time they want to engineer things into their favour. \n\n[https://imgflip.com/i/807x6s](https://imgflip.com/i/807x6s)\n\n&#x200B;",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695539069.0,
    "convurl": "https://external-preview.redd.it/vpkOXh1VX0skovr0sAKuLqU8oN9l9kfymRkBaC0oi98.jpg?auto=webp&s=a3efca29af917132feb91a71f0b0360f33a2186f",
    "comments": [],
    "cleaned_text": "shower thoughts therapy desi victimhood hypocrisy colonial mindset shower thought wanted express feels like need hour going therapy lets identify repeating thought patterns longer serve notice next time come avoid going road unfortunately cant afford therapy broke af never therapy colonial trauma whole indiacanada debacle exposed aspects desi culture indian pakistani bangladeshi culture engineered colonial mindset always stack things favor white rulers culture irrespective religion makes us think religion right matter logical evidence presented people religions persecuted us victims therefore whole community must evil face existential threat must countereliminate competition every single person must prove worthiness showing better every level individually community wise nationally show white people evidence persecution right thing take action narrative wipes nuance every situation narrative wants cast entire group people behind event even literally nothing could born community play fun game exercise let x religion religion interacted religion x religions significant populations permutations combinations come exact format politicians use formula every time want engineer things favour httpsimgflipcomixshttpsimgflipcomixs xb ",
    "cleaned_title": "shower thoughts therapy desi victimhood hypocrisy colonial mindset",
    "cleaned_selftext": "shower thought wanted express feels like need hour going therapy lets identify repeating thought patterns longer serve notice next time come avoid going road unfortunately cant afford therapy broke af never therapy colonial trauma whole indiacanada debacle exposed aspects desi culture indian pakistani bangladeshi culture engineered colonial mindset always stack things favor white rulers culture irrespective religion makes us think religion right matter logical evidence presented people religions persecuted us victims therefore whole community must evil face existential threat must countereliminate competition every single person must prove worthiness showing better every level individually community wise nationally show white people evidence persecution right thing take action narrative wipes nuance every situation narrative wants cast entire group people behind event even literally nothing could born community play fun game exercise let x religion religion interacted religion x religions significant populations permutations combinations come exact format politicians use formula every time want engineer things favour httpsimgflipcomixshttpsimgflipcomixs xb",
    "cleaned_comments": "",
    "light_cleaned_title": "Shower thoughts- Therapy from desi victimhood, hypocrisy and the colonial mindset",
    "light_cleaned_selftext": "**This is a shower thought that I wanted to express for a while but it feels like the need of the hour.** Going to therapy lets you identify repeating thought patterns that no longer serve you, and notice them the next time they come in so you can avoid going down the same road. Unfortunately, we can't afford therapy (broke AF), and were never had therapy for our colonial trauma. The whole India-Canada debacle has exposed some aspects of our desi culture (be it Indian, Pakistani, or Bangladeshi). This culture, which was engineered by the colonial mindset to always stack things in the favor of our white rulers. A culture, irrespective of religion, which makes us think that: 1. Our religion is in the right, no matter the logical or evidence presented 2. People of other religions have persecuted us and we are the victims. Therefore, the whole community must be evil, and we face an existential threat so we must counter/eliminate them 3. We are in competition with every single person, and we must prove our worthiness by showing that we are better than them on every level- individually, community wise, and nationally 4. If we show the white people this evidence of persecution, they will do the right thing and take action against them The narrative was wipes out nuance out of every situation, where the narrative wants you to cast an entire group of people behind an event, even if they had literally nothing to do with it (could be just born into the community). You can play a fun game yourself as an exercise- let X be your religion, and Y be a religion that has interacted with your religion, where is X and Y are religions of significant populations. You can do permutations and combinations and come up with this same exact format. Our politicians use this formula every time they want to engineer things into their favour. [https://imgflip.com/i/807x6s](https://imgflip.com/i/807x6s) &#x200B;",
    "light_cleaned_comments": ""
}