{
    "id": "1fl6zmc",
    "title": "Supreme Court criticises judge's Pak remark on Bengaluru area, seeks report | India News - Business Standard",
    "url": "https://www.business-standard.com/india-news/supreme-court-criticises-judge-s-pak-remark-on-bengaluru-area-seeks-report-124092000500_1.html",
    "selftext": "In one clip, Justice Srishananda is heard referring to a Muslim-dominated locality in West Bengaluru as \"Pakistan.\" In another, the judge is seen reprimanding a woman lawyer for responding to a question posed to the opposing counsel. In a light-hearted but inappropriate manner, he remarks that she seems to know so much about the opposite party that she might even reveal the colour of his undergarments.\n\n\nDuring the hearing, while discussing traffic issues near the Mysore Road flyover, Justice Srishananda allegedly remarked, “Go to the Mysore Road flyover, every auto rickshaw has 10 people. It is not applicable because the Mysore flyover head left to the market from Gori Palya is in Pakistan, not in India. This is the reality. No matter how strict a police officer you put there, they will be beaten up there.”",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1726820105.0,
    "convurl": "https://external-preview.redd.it/f6iRc7y6DEYfe6im0fhlS-E7qFjPo3vH_6lfdGGFJEs.jpg",
    "comments": [],
    "cleaned_text": "supreme court criticises judges pak remark bengaluru area seeks report india news business standard one clip justice srishananda heard referring muslimdominated locality west bengaluru pakistan another judge seen reprimanding woman lawyer responding question posed opposing counsel lighthearted inappropriate manner remarks seems know much opposite party might even reveal colour undergarments hearing discussing traffic issues near mysore road flyover justice srishananda allegedly remarked go mysore road flyover every auto rickshaw people applicable mysore flyover head left market gori palya pakistan india reality matter strict police officer put beaten ",
    "cleaned_title": "supreme court criticises judges pak remark bengaluru area seeks report india news business standard",
    "cleaned_selftext": "one clip justice srishananda heard referring muslimdominated locality west bengaluru pakistan another judge seen reprimanding woman lawyer responding question posed opposing counsel lighthearted inappropriate manner remarks seems know much opposite party might even reveal colour undergarments hearing discussing traffic issues near mysore road flyover justice srishananda allegedly remarked go mysore road flyover every auto rickshaw people applicable mysore flyover head left market gori palya pakistan india reality matter strict police officer put beaten",
    "cleaned_comments": "",
    "light_cleaned_title": "Supreme Court criticises judge's Pak remark on Bengaluru area, seeks report | India News - Business Standard",
    "light_cleaned_selftext": "In one clip, Justice Srishananda is heard referring to a Muslim-dominated locality in West Bengaluru as \"Pakistan.\" In another, the judge is seen reprimanding a woman lawyer for responding to a question posed to the opposing counsel. In a light-hearted but inappropriate manner, he remarks that she seems to know so much about the opposite party that she might even reveal the colour of his undergarments. During the hearing, while discussing traffic issues near the Mysore Road flyover, Justice Srishananda allegedly remarked, “Go to the Mysore Road flyover, every auto rickshaw has 10 people. It is not applicable because the Mysore flyover head left to the market from Gori Palya is in Pakistan, not in India. This is the reality. No matter how strict a police officer you put there, they will be beaten up there.”",
    "light_cleaned_comments": ""
}