{
    "id": "12b5wqx",
    "title": "\"We have equal rights\" | Muslims stopped from Ramadan prayers in Noida housing complex",
    "url": "https://youtu.be/mx4SdJWKzxM",
    "selftext": "Amritkal.",
    "flair": "Politics",
    "score": 105,
    "num_comments": 8,
    "created_utc": 1680573839.0,
    "convurl": "https://external-preview.redd.it/tFdK5By7s-XmNql0uZeyzscgpjdYtDn81BJHPzLZkCI.jpg?auto=webp&v=enabled&s=dd9a7e24a84f400930e31b611deeea0ce5b4e3b4",
    "comments": [
        "Articulate, educated and peaceful request following proper channels.\n\nThis approach will always win hearts and minds.",
        "We do all kinds of community Pujas in our homes - Satya Narayan Puja, navratri, vat Savitri, Shani mela,  Ganesh chaturthi. \n\nSo No Logic in denying \"them\"  their religious gatherings - \"in their own homes.\"",
        "Modi hai toh mumkin haiðŸ˜",
        "Well there is a logic. They are not comfortable saying it aloud.",
        ">This approach will always win hearts and minds.\n\nWill it? Their neighbours are the kind of people who cheer at the news of massacre of muslims.",
        "Gunde apartment me rande nachayein tab Noida waalon ko dikkat nahi. But few people peacefully praying without disturbing them is an infringement of their rights."
    ],
    "cleaned_text": "equal rights muslims stopped ramadan prayers noida housing complex amritkal ",
    "cleaned_title": "equal rights muslims stopped ramadan prayers noida housing complex",
    "cleaned_selftext": "amritkal",
    "cleaned_comments": "articulate educated peaceful request following proper channels approach always win hearts minds kinds community pujas homes satya narayan puja navratri vat savitri shani mela ganesh chaturthi logic denying religious gatherings homes modi hai toh mumkin hai well logic comfortable saying aloud approach always win hearts minds neighbours kind people cheer news massacre muslims gunde apartment rande nachayein tab noida waalon ko dikkat nahi people peacefully praying without disturbing infringement rights",
    "light_cleaned_title": "\"We have equal rights\" | Muslims stopped from Ramadan prayers in Noida housing complex",
    "light_cleaned_selftext": "Amritkal.",
    "light_cleaned_comments": "Articulate, educated and peaceful request following proper channels. This approach will always win hearts and minds. We do all kinds of community Pujas in our homes - Satya Narayan Puja, navratri, vat Savitri, Shani mela, Ganesh chaturthi. So No Logic in denying \"them\" their religious gatherings - \"in their own homes.\" Modi hai toh mumkin haiðŸ˜ Well there is a logic. They are not comfortable saying it aloud. >This approach will always win hearts and minds. Will it? Their neighbours are the kind of people who cheer at the news of massacre of muslims. Gunde apartment me rande nachayein tab Noida waalon ko dikkat nahi. But few people peacefully praying without disturbing them is an infringement of their rights."
}