{
    "id": "p2316a",
    "title": "Weekly Mental Health Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/p2316a/weekly_mental_health_discussion_thread/",
    "selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here.\n\nYou may find someone who has gone through a similar episode and might be able to help/guide you.\n\nPlease be civil and maintain Reddiquette while participating or replying/helping out someone.\n\nHere's an article on what you should do if if you see someone who is talking about suicide or self-harm on the site.\n\nYou can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic.\n\n**If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**.\n\n* **Helplines**: AASRA: 91-22-27546669 (24 hours)\n* **Sneha Foundation**: 91-44-24640050 (24 hours)\n* **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours)\n* **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm)\n* **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm)\n\n**The Mental Health Thread is posted every Wednesday morning.**\n\nhttps://preview.redd.it/1fqd80djw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=a1c77fa439c6564d49fe03ebbbb17f7912ce8d58",
    "flair": "Scheduled",
    "score": 20,
    "num_comments": 9,
    "created_utc": 1628645418,
    "convurl": "https://a.thumbs.redditmedia.com/gNJZMm9aGqgPv5G-HynS9HZ3V2aN5G64HxcOekLgbS8.jpg",
    "comments": [
        "How tf do I get into college (T20)",
        "Job market is so crappy in India right now. It's very tough to even get an interview. I have been unemployed now since March 2021. In the time since then, I have just had 3 interviews. \nIt's taking toll on me. But I am staying positive.",
        "What kind of work do you do?",
        "I worked in govt on contract basis",
        "Going through tough breakup .",
        "Has anyone tried seeing psychiatrists on Practo app?",
        "breezed through the first 16-17 months of the pandemic, but finally I feel it has started to take a toll on me.",
        "I am just angry and hopeless. My girlfriend's mum told her that she would put poison and kill her some day. \n\nShe is emotionally depressed and feeling suicidal everyday due to their abusive parents."
    ],
    "cleaned_text": "weekly mental health discussion thread anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone heres article see someone talking suicide selfharm site also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning ",
    "cleaned_title": "weekly mental health discussion thread",
    "cleaned_selftext": "anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone heres article see someone talking suicide selfharm site also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning",
    "cleaned_comments": "tf get college job market crappy india right tough even get interview unemployed since march time since interviews taking toll staying positive kind work worked govt contract basis going tough breakup anyone tried seeing psychiatrists practo app breezed first months pandemic finally feel started take toll angry hopeless girlfriends mum told would put poison kill day emotionally depressed feeling suicidal everyday due abusive parents",
    "light_cleaned_title": "Weekly Mental Health Discussion Thread",
    "light_cleaned_selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here. You may find someone who has gone through a similar episode and might be able to help/guide you. Please be civil and maintain Reddiquette while participating or replying/helping out someone. Here's an article on what you should do if if you see someone who is talking about suicide or self-harm on the site. You can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic. **If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**. * **Helplines**: AASRA: 91-22-27546669 (24 hours) * **Sneha Foundation**: 91-44-24640050 (24 hours) * **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours) * **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm) * **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm) **The Mental Health Thread is posted every Wednesday morning.**",
    "light_cleaned_comments": "How tf do I get into college (T20) Job market is so crappy in India right now. It's very tough to even get an interview. I have been unemployed now since March 2021. In the time since then, I have just had 3 interviews. It's taking toll on me. But I am staying positive. What kind of work do you do? I worked in govt on contract basis Going through tough breakup . Has anyone tried seeing psychiatrists on Practo app? breezed through the first 16-17 months of the pandemic, but finally I feel it has started to take a toll on me. I am just angry and hopeless. My girlfriend's mum told her that she would put poison and kill her some day. She is emotionally depressed and feeling suicidal everyday due to their abusive parents."
}