{
    "id": "1b0amg8",
    "title": "Railways brings down the curtain on passenger trains",
    "url": "https://www.thehindu.com/news/national/no-more-passenger-trains-they-are-redesignated-as-express-specials/article67885525.ece",
    "selftext": "“They have been redesignated as express specials; the ‘second class ordinary fare’ meant for passenger trains has been dispensed with and commuters are being charged express fares”. \n\nMany many congratulations India! Everyone except ultra rich is getting shafted by our Government. ",
    "flair": "Policy/Economy",
    "score": 55,
    "num_comments": 16,
    "created_utc": 1708928185.0,
    "convurl": "https://external-preview.redd.it/asYbID62UdjEKSbNSut5cADZ79bfpPRXV-K98lSu2sU.jpg?auto=webp&s=bbb735463a84fd17e6a4b2eca52768963a150df1",
    "comments": [
        "Sher paala hai to ...",
        "r/leopardatemyface",
        "Since express trains run at passenger speeds, passenger train passengers should pay express fares. \n\n\n---- Parampujya Shri Gautamdas Panauti Ji CloudCoverWale",
        "Ab bole to bole kya. \nKare to kare kya.",
        "Andher nagari....",
        "Chaupat raja ...",
        ">Everyone except ultra rich is getting shafted by our Government. \n\n:) Bhakts waving flags.",
        "This now clears the deck for ending cross-subsidy on freight, sure base fares would increase for all passengers but look at it this way. Cheaper freight charges means more freight on trains, cheaper coal transport which means chepaer fuel for electricity etc. \n\nThe knockdown effect of cross subsidy have been hurting India's industrial competitiveness for a long time, where China went the opposite way in subsidizing the logisitics we actively taxed it.",
        "Until you realise nothing is going to become cheaper.  We have been paying 100+ for petrol for so long now irrespective of global oil prices.\nIndustrial competitiveness even if it improves will not translate to benefit for consumer.",
        "Waah MudiXi Waah",
        "Kharcha toh hoga",
        ">Until you realise nothing is going to become cheaper. \n\nNot for you, however coal for power companies (biggest component of rail freight) would become cheaper which should result in less cost of production. \n\n>We have been paying 100+ for petrol for so long now irrespective of global oil prices.\n\nI am for decerease in fuel tax but you must also suggest which welfare programme to cut across state and central level for the fiscal math to make sense. I guess we can increase Corporate tax but their are limitations on how much. \n\n>Industrial competitiveness even if it improves will not translate to benefit for consumer.\n\nIt's not suppose to, it's supposed to help generate employment which I think is a bigger concern.",
        "I will agree on the industrial competitiveness part alone. Rest are already possible if we stop the massive  drain due to crony capitalism.  See how adani or other power companies inflate coal prices to get more money from government. We reduced corporate tax from 30 to 22 under this government.  Fuel is inelastic demand wrt lower strata of society. Reduce fuel prices will also lead to lower cost of frieght bringing down cost of consumer goods. Instead we bleed people dry with high fuel prices and protests are also pointless with the amount of power and media control a majority government has. I lead a comfortable life but I know people who are barely keeping it together cos of inflation and how costly medical and education costs are."
    ],
    "cleaned_text": "railways brings curtain passenger trains redesignated express specials second class ordinary fare meant passenger trains dispensed commuters charged express fares many many congratulations india everyone except ultra rich getting shafted government ",
    "cleaned_title": "railways brings curtain passenger trains",
    "cleaned_selftext": "redesignated express specials second class ordinary fare meant passenger trains dispensed commuters charged express fares many many congratulations india everyone except ultra rich getting shafted government",
    "cleaned_comments": "sher paala hai rleopardatemyface since express trains run passenger speeds passenger train passengers pay express fares parampujya shri gautamdas panauti ji cloudcoverwale ab bole bole kya kare kare kya andher nagari chaupat raja everyone except ultra rich getting shafted government bhakts waving flags clears deck ending crosssubsidy freight sure base fares would increase passengers look way cheaper freight charges means freight trains cheaper coal transport means chepaer fuel electricity etc knockdown effect cross subsidy hurting indias industrial competitiveness long time china went opposite way subsidizing logisitics actively taxed realise nothing going become cheaper paying petrol long irrespective global oil prices industrial competitiveness even improves translate benefit consumer waah mudixi waah kharcha toh hoga realise nothing going become cheaper however coal power companies biggest component rail freight would become cheaper result less cost production paying petrol long irrespective global oil prices decerease fuel tax must also suggest welfare programme cut across state central level fiscal math make sense guess increase corporate tax limitations much industrial competitiveness even improves translate benefit consumer suppose supposed help generate employment think bigger concern agree industrial competitiveness part alone rest already possible stop massive drain due crony capitalism see adani power companies inflate coal prices get money government reduced corporate tax government fuel inelastic demand wrt lower strata society reduce fuel prices also lead lower cost frieght bringing cost consumer goods instead bleed people dry high fuel prices protests also pointless amount power media control majority government lead comfortable life know people barely keeping together cos inflation costly medical education costs",
    "light_cleaned_title": "Railways brings down the curtain on passenger trains",
    "light_cleaned_selftext": "“They have been redesignated as express specials; the ‘second class ordinary fare’ meant for passenger trains has been dispensed with and commuters are being charged express fares”. Many many congratulations India! Everyone except ultra rich is getting shafted by our Government.",
    "light_cleaned_comments": "Sher paala hai to ... r/leopardatemyface Since express trains run at passenger speeds, passenger train passengers should pay express fares. ---- Parampujya Shri Gautamdas Panauti Ji CloudCoverWale Ab bole to bole kya. Kare to kare kya. Andher nagari.... Chaupat raja ... >Everyone except ultra rich is getting shafted by our Government. :) Bhakts waving flags. This now clears the deck for ending cross-subsidy on freight, sure base fares would increase for all passengers but look at it this way. Cheaper freight charges means more freight on trains, cheaper coal transport which means chepaer fuel for electricity etc. The knockdown effect of cross subsidy have been hurting India's industrial competitiveness for a long time, where China went the opposite way in subsidizing the logisitics we actively taxed it. Until you realise nothing is going to become cheaper. We have been paying 100+ for petrol for so long now irrespective of global oil prices. Industrial competitiveness even if it improves will not translate to benefit for consumer. Waah MudiXi Waah Kharcha toh hoga >Until you realise nothing is going to become cheaper. Not for you, however coal for power companies (biggest component of rail freight) would become cheaper which should result in less cost of production. >We have been paying 100+ for petrol for so long now irrespective of global oil prices. I am for decerease in fuel tax but you must also suggest which welfare programme to cut across state and central level for the fiscal math to make sense. I guess we can increase Corporate tax but their are limitations on how much. >Industrial competitiveness even if it improves will not translate to benefit for consumer. It's not suppose to, it's supposed to help generate employment which I think is a bigger concern. I will agree on the industrial competitiveness part alone. Rest are already possible if we stop the massive drain due to crony capitalism. See how adani or other power companies inflate coal prices to get more money from government. We reduced corporate tax from 30 to 22 under this government. Fuel is inelastic demand wrt lower strata of society. Reduce fuel prices will also lead to lower cost of frieght bringing down cost of consumer goods. Instead we bleed people dry with high fuel prices and protests are also pointless with the amount of power and media control a majority government has. I lead a comfortable life but I know people who are barely keeping it together cos of inflation and how costly medical and education costs are."
}