{
    "id": "1fmwkph",
    "title": "Isn't this outrageous? (Internet blackout in jharkhand on 21st September and 22nd September) ",
    "url": "https://www.reddit.com/r/india/comments/1fmwkph/isnt_this_outrageous_internet_blackout_in/",
    "selftext": "Hey everyone, this is something important we need to talk about\n\nThe Jharkhand government had decided to suspend mobile internet services across the entire state(and in my experience broadband services as well) on September 21st and 22nd from 8:00 AM to 1:30 PM each day. This shutdown was enforced to ensure a fair and transparent Jharkhand Staff Selection Commission, Combined Graduate Level JSSC(CGL) Examinations.\n\nWhile ensuring exam integrity is crucial, is a state-wide internet shutdown the right solution? How do you all feel about such drastic measures for preventing exam malpractices?\n\nReferences:\n\n* [TOI](https://timesofindia.indiatimes.com/city/ranchi/internet-blackout-during-exam-period-hc-issues-notice-to-govt/articleshow/113560400.cms)\n* [etvbharat](https://www.etvbharat.com/en/!state/jharkhand-internet-shutdown-and-high-court-intervention-enn24092104593)\n* [thehindu](https://www.thehindu.com/news/national/jharkhand/suspension-of-mobile-internet-for-examination-arbitrary-decree-to-hide-jharkhand-government-failure-bjp/article68666807.ece)",
    "flair": "Policy/Economy",
    "score": 71,
    "num_comments": 16,
    "created_utc": 1727020656.0,
    "convurl": "https://external-preview.redd.it/9C3BMmQufhPV43NJXZMiPcxoVPvSCwxA3OwJUqTMf1g.jpg?auto=webp&s=860b57a8ebfae352d1436c319be118568307967c",
    "comments": [
        "Internet is blamed for paper leak🐍\n\n\nAlcohol is blamed for crime against women🐍\n\n\nRupees is not weakening, dollar is strengthening🐍\n\n\nAmen",
        "What if the culprits make phone call and relay the questions🥹😂",
        "When you need to block internet for a government exam - ouch. What will these candidates govern if they can't even pass without cheating.",
        "It's completely outrageous ",
        "Pehli bar h lgta h there in up and Rajasthan roz ka h",
        "I got the message on my phone that the internet would be shut down and my first thought was that some riot happened for this to be imposed and it turns out it was an exam.",
        "Incompetent at every level, remember guys why east is not developed compared to north south and west , people think the internet is for watching reels ,",
        "VishwaGuru",
        "This happened in NCR whee I live recently. Contain your hate loser."
    ],
    "cleaned_text": "isnt outrageous internet blackout jharkhand st september nd september hey everyone something important need talk jharkhand government decided suspend mobile internet services across entire stateand experience broadband services well september st nd pm day shutdown enforced ensure fair transparent jharkhand staff selection commission combined graduate level jssccgl examinations ensuring exam integrity crucial statewide internet shutdown right solution feel drastic measures preventing exam malpractices references toihttpstimesofindiaindiatimescomcityranchiinternetblackoutduringexamperiodhcissuesnoticetogovtarticleshowcms etvbharathttpswwwetvbharatcomenstatejharkhandinternetshutdownandhighcourtinterventionenn thehinduhttpswwwthehinducomnewsnationaljharkhandsuspensionofmobileinternetforexaminationarbitrarydecreetohidejharkhandgovernmentfailurebjparticleece ",
    "cleaned_title": "isnt outrageous internet blackout jharkhand st september nd september",
    "cleaned_selftext": "hey everyone something important need talk jharkhand government decided suspend mobile internet services across entire stateand experience broadband services well september st nd pm day shutdown enforced ensure fair transparent jharkhand staff selection commission combined graduate level jssccgl examinations ensuring exam integrity crucial statewide internet shutdown right solution feel drastic measures preventing exam malpractices references toihttpstimesofindiaindiatimescomcityranchiinternetblackoutduringexamperiodhcissuesnoticetogovtarticleshowcms etvbharathttpswwwetvbharatcomenstatejharkhandinternetshutdownandhighcourtinterventionenn thehinduhttpswwwthehinducomnewsnationaljharkhandsuspensionofmobileinternetforexaminationarbitrarydecreetohidejharkhandgovernmentfailurebjparticleece",
    "cleaned_comments": "internet blamed paper leak alcohol blamed crime women rupees weakening dollar strengthening amen culprits make phone call relay questions need block internet government exam ouch candidates govern cant even pass without cheating completely outrageous pehli bar h lgta h rajasthan roz ka h got message phone internet would shut first thought riot happened imposed turns exam incompetent every level remember guys east developed compared north south west people think internet watching reels vishwaguru happened ncr whee live recently contain hate loser",
    "light_cleaned_title": "Isn't this outrageous? (Internet blackout in jharkhand on 21st September and 22nd September)",
    "light_cleaned_selftext": "Hey everyone, this is something important we need to talk about The Jharkhand government had decided to suspend mobile internet services across the entire state(and in my experience broadband services as well) on September 21st and 22nd from 8:00 AM to 1:30 PM each day. This shutdown was enforced to ensure a fair and transparent Jharkhand Staff Selection Commission, Combined Graduate Level JSSC(CGL) Examinations. While ensuring exam integrity is crucial, is a state-wide internet shutdown the right solution? How do you all feel about such drastic measures for preventing exam malpractices? References: * [TOI](https://timesofindia.indiatimes.com/city/ranchi/internet-blackout-during-exam-period-hc-issues-notice-to-govt/articleshow/113560400.cms) * [etvbharat](https://www.etvbharat.com/en/!state/jharkhand-internet-shutdown-and-high-court-intervention-enn24092104593) * [thehindu](https://www.thehindu.com/news/national/jharkhand/suspension-of-mobile-internet-for-examination-arbitrary-decree-to-hide-jharkhand-government-failure-bjp/article68666807.ece)",
    "light_cleaned_comments": "Internet is blamed for paper leak🐍 Alcohol is blamed for crime against women🐍 Rupees is not weakening, dollar is strengthening🐍 Amen What if the culprits make phone call and relay the questions🥹😂 When you need to block internet for a government exam - ouch. What will these candidates govern if they can't even pass without cheating. It's completely outrageous Pehli bar h lgta h there in up and Rajasthan roz ka h I got the message on my phone that the internet would be shut down and my first thought was that some riot happened for this to be imposed and it turns out it was an exam. Incompetent at every level, remember guys why east is not developed compared to north south and west , people think the internet is for watching reels , VishwaGuru This happened in NCR whee I live recently. Contain your hate loser."
}