{
    "id": "10u9btg",
    "title": "People are sharing this image and creating hate for north indians and north-east indians so I want to give my opinion.",
    "url": "https://www.reddit.com/r/india/comments/10u9btg/people_are_sharing_this_image_and_creating_hate/",
    "selftext": "There are multiple reasons for this:  \n1. South India has a lot of tax-payers but most people in the northern states are not in the tax bracket that is supposed to pay the income tax that is why this ratio.  \n2. The government has to build infrastructure in all states and not just limit themselves in South India where there are already a lot of tax-payers.  \n3. Now people would be saying \"What benefit does it bring trying to invest in the poorer states and not invest more in already rich states\". The thing is, the more the income that increases for the poor income states, the more no. of people will have to pay income tax, which will only help in the long run. Currently only 5% of people in India pay income tax because the other 95% people in India earn less than 3,00,000 per annum. That is why if the government puts money in those states which will push the non-tax payers to tax-payers population. Jobs will be created, which will help people earn more money which will eventually increase tax payers.   \n4. (I'm not sure about this one I read this in a comment) Many companies are registered in Maharashtra , TN Gurgaon.. Their GST returns , tax returns are filed from HQs..\n\nSo it shows as collection from that particular state.  \n\n\nI also saw many people also compare Chhatrapati Shivaji Maharaj and our PM Modi, wtf. Stop doing this we cannot compare a true hero whose heroic deeds are not only limited to South India but are known and respected by many North Indians as well and a person.... well I can't speak much about him (You know why) but you get the point.  \n\n\n[P.S- All this stuff actually sounds good but the thing is we still have a lot of corruption.](https://preview.redd.it/9cgswpc1ecga1.png?width=800&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=6d4300bbc180250cccdf044dde67252cd50d5b1d)",
    "flair": "Rant / Vent",
    "score": 160,
    "num_comments": 93,
    "created_utc": 1675592113,
    "convurl": "https://b.thumbs.redditmedia.com/hg8lSyGYNRjOIPwjGlkvw0W2OhrJ0i0b6c2zyVu55qM.jpg",
    "comments": [
        "The reason for the hate is that it will take a lot of time and it's not even sure people there will come clean and start paying taxes even if they have money. It's not fair for the people who live and die with this sacrifice and not get anything in return in this lifetime.",
        "Agree, also it ignores the fact that a lot of these people paying taxes in southern cities such as Bangalore, Hyderabad are from north. Especially in IT where the number of people from north is huge",
        "Oh wow, how kind of you to explain us something we never knew!",
        "Most of the MNCs are registered / operating from these States (Metro Cities). Thus logically the tax collection will be higher from these States. But it's not uniform across each city of these States.\n\nFor example in Karnataka Tax collection from Bangalore will be 100 times higher than Bellari. Or in Haryana Tax Collection from Gurgaon will be 10 times more than the combined Tax of Panipat Sonipat Kurukshetra.\n\nSo, If you think Marathwada is paying a similar tax as Noida in UP or Bhopal / Gwalior / Indore in MP then it's delusional.\n\nAs for spending the Infrastructure development especially Expressway / Highway development is done on Border areas hence majority chunk is spent on that.\n\nThis Graphics doesn't portray the real picture.",
        "Also, if the map of number of central government institutions operating in various states along with their date of establishment is presented, it would give this stand alone image some context.",
        "Ah, this wont make any sense to haters. \n\nWe beam with pride when we see NRIs and Indian migrants making a life for them abroad. But look down upon people who come to our own cities. \n\nThose sitting on high horses just by looking at this image, are actually in intellectual poverty and I wish them well. \nIts not if the Hindi mainland wanted this for their kids. But its too complex a thing for \"direct tax payers\" to fathom",
        "Oh wow, how kind of you to contribute to the thread with sarcasm.\n\nIt might be the lowest form of wit, but hey - atleast you possess some wit.",
        "Agee, I grew up in rural up village, and after years of hardwork was able to make a career after college. I stayed in Bangalore for 2 years before moving out to london and in those two years I have probably paid more taxes then a lot of people make in year in WITCH companies and still continue to contribute via investing and remittance but according to some people , we are just leeches  🤦‍♂️",
        "Don't pay attention to them. These people will do anything to justify their hate towards north, and piss their pants when someone calls them out for it.",
        "That's not the reason for hate at all. Look at the comments telling bihar should be seperate from India, and calling Biharis \"bimaru\". Stop trying to justify their hate.",
        "Thanks for the compliment!",
        "If only i was a South Indian mate",
        "Well what does it say about you to respond to the \"lowest form of wit\" with more of the same? And an unoriginal one at that.",
        "You can mention a fact without being condescending or shaming. You can try a different word with more respect.",
        "According to 2011 census, I think the Hindi speaking population in BLR is around 10%. First majority is Kannadigas, 2nd Tamil, 3rd Telugu and then the North Indians. Even if you consider Akshay kumar's \"double money in 25 days, \" logic, it's gonna be 20%.\n\nSo please, tape your thoughts",
        "LMAO no. The vast majority of IT employees in Hyderabad are Telugus. That is the same reason you often find northies in Hyderabad who are employed in IT complain that everyone speaks in Telugu in their office.",
        "That's bad comparison why not including the indirect taxes in it ?",
        "They will happily accept cheap labour from Bihar and cheap coal from jharkhand for producing cheap electricity.",
        "Exactly, bunch of hypocrites lol.",
        "This has been happening since 1971. Since then South india has grown but north India hasn’t grown at all. Is 50 years not enough for north indian states to grow ? Or do they still need more time ?",
        "&gt;South India has a lot of tax-payers but most people in the northern states are not in the tax bracket that is supposed to pay the income tax that is why this ratio.  \n&gt;  \n&gt;The government has to build infrastructure in all states and not just limit themselves in South India where there are already a lot of tax-payers.\n\nIt's been more than 75 years since independence, why is it still this skewed? Can understand about the Northeast , due to rebels, but the North was quite stable.\n\nWhy are industries not yet set up in Northern states? Why is the income lower?\n\nGiven the amount of population, proportionally how many entrepreneurs does it generate?\n\n&gt;(I'm not sure about this one I read this in a comment) Many companies are registered in Maharashtra , TN Gurgaon.. Their GST returns , tax returns are filed from HQs..\n\nEver wondered what's the reason for that?\n\nThat post didn't create hate, it was just to show, that north needs to get its shit together.",
        "No! I think your opinion is missing a key factor - lot of South and also western Indians - including Guj and Maharashtra don’t hate the BIMARU states but really are pained by the pace at which BIMARU states have developed - despite spending so much on them.\n\nAfter 7 decades of independence - these places HDI indexes are slightly better than sub sharan Africa. The lawlessness, the defiance to authority in the states is rampant - add to that crime and jungle raj. \n\nWhy aren’t these states incentivised to develop like the rest of India? What is holding them back? To what end ,do these states need money? \nWhy isn’t there a better distribution scheme - so that allocation of money can happen through meritocracy. Reward those states, who are efficient and improving their HDI metrics.\n\nSouth and West Indians feel pained that our money is diverted to these places, where we are not seeing returns for decades. Unfortunately, we don’t see any trend pointing upwards",
        "I'm not justifying hate, you can't really stop what people think and say online. But that's definitely the reason for the hate.",
        "To the people who oppose the unequal distribution of funds I ask you, do you also oppose a wealth tax for the rich which can be used to fund social programs for the poor?",
        "Someone in the comments said North needs to get its shit together and develop since it has been so since independence. Might be an unpopular truth and without going into details, North was dealing much more damage in colonial India than the South. Damage not just fiscal or infrastructural but one which also shapes a society differently. \nOne can research on it for sure",
        "This is not just income tax. It is also commercial tax, sales tax, vat etc etc \n\nThe Hindi region has a lot of people. Which means they should consume more and pay taxes. This is the region with utmost natural resources the subcontinent. They have perennial rivers, minerals etc.\n\nMy argument is people in TN don't live in the USA like environment. They have problems too. Water problems for eg. Why can't the govt fix that problem for them?",
        "And the north will have more votes/seats and hence more say in the parliament. I see more north and south divide coming soon to India...back to the janapadas my friends.",
        "There should be no hate for anything. It's just a fact.",
        "Man I don’t understand. The whole point of taxes is to bring equality and redistribute wealth. Ofcourse the benefits of taxes go to poorer regions. That’s the whole goddamn point!",
        "Except a lot of people native speakers doesn’t work in tech. Bangalore’s majority of direct income tax comes from tech scene. Of course there is a lot more people that speak Kannada but how much work in tech ? If you think there are only 10% people from north in tech filed then you are grossly mistaken",
        "Not sure about Hyderabad but in Bangalore there are lot of North Indian.\nAlso if you work In tech and use any native language to talk in professional setting be it Hindi or Telugu then they are stupid. That’s really unprofessional",
        "The exception here is Kerala, whjch doesn't have big metropolises that drive all the tax collection but is a wealthy state with the highest HDI in the country",
        "North was affected by Nehru's misplaced freight Equalization act",
        "I do. Because Wealth tax empirically a very poor record. It has been removed in almost every place it has been tried.",
        "More than that the real reason for the disparity between the North and South is Nehru's misplaced Frieght Equalization Act",
        "The real reason for the disparity between the North and South is Nehru's misplaced Frieght Equalization Act\n\nEdit: For people who don't believe me, here is agood economics literature review on Frieght Equalization Act from Cornell University which explains it pretty well\n\nhttp://barrett.dyson.cornell.edu/NEUDC/paper_316.pdf\n\nIt was a dumb policy which affected both North and India as a whole",
        "&gt;The whole point of taxes is to bring equality and redistribute wealth.\n\nNo, it's not. The point of taxes is to raise revenue for public goods.",
        "South Indians still dominate Bangalore's tech scene.",
        "OK so do you don't believe that wealthier individuals should be taxed at a higher rate than poorer ones?",
        "EVERYBODY... Read 'North Vs South' by Nilakantan RS. This will provide so much context for the negativity arising out of this graphic. \n\nJust basic things like education, Healthcare stats and their impact on overall economic outcomes...",
        "Yes, I do.",
        "Right, so why then don't you believe that South Indian states (the rich in this case) should pay more than North Indian ones (the poor)?",
        "What makes you think I don't believe that?",
        "Can’t compete in export driven industries due to freight - then what stopped them from bringing in industries like IT services or pharma/engineering services? Stop making excuses for poor planning and blame Nehru and the British and the Mughals for the pathetic state of affairs. \n\nTake responsibility- that’s the first step towards reaching somewhere relevant.",
        "Because you said \"I do\" to my question. So you either have a very weak grasp of the English language or you do actually believe that the rich should not be taxed more.\n\nRegardless, I would love to see a source which states that a higher tax rate on the rich does not reduce inequality.",
        "You know that South Indian states didn't have an IT sector when Frieght Equalization Act was introduced right. It was something that developed much later when capital accumulation happened which was prevented by freight Equalization\n\nI'm from Kerala but I totally understand the reason why North Eastern states lag South-Western ststes. It's pretty established in economics literature that freight Equalization is the culprit",
        "Buddy you need to read my original comment again, it's seemingly you who have a problem with reading comprehension. I'm not against progressiveness in taxes, I'm just against wealth taxes specifically because it has a well established history of failure. If redistribution is your goal then use a property tax or even better a land value tax that has a much support among actual economist.\n\nThe article below gives a good overview on the best way to restructure Indian tax system to make it more efficient and progressive. The devil is in the details\n\nhttps://www.livemint.com/Opinion/z2DURCdrbtLjCPnutKs3gJ/Rethinking-Indias-tax-system.html?facet=amp",
        "Alright so I believe we both agree that South Indian states should pay more than North Indian ones.",
        "Sure, but only as long as South India gets enough funding for their public infrastructure which is what enables this redistribution in the first place. But that's not happening, so I'm inclined to side with South Indians in this debate. If you kill South India's ability to generate revenue then even redistribution ro the North won't happen. The issue is that the national politics is held hostage by North Indian polticians.\n\nPS: I actually don't blame North India for their underperformance. They were a victim of Nehru's misplaced Frieght Equalization Act, which is what created this disparity in the first place.",
        "I’m not talking about South developing the IT service sector- fortunately there were leaders like SM Krishna or CB Naidu to recognise that and proactively take steps. \n\nI challenged the premise of the freight equalisation problem.If there’s a problem - you focus on a solution. Not harp about it for time immemorial. Yeah we have been wronged. So what - even China was wronged. I don’t see them blaming the Japanese for the ills in their society. \n\nIf freight equalisation happened - then why didn’t these states focus on building up services? What stopped these states to develop a vision or foresight - when freight equalisation happened?",
        "Keep popping 5+ kids. Keep not sending your children to schools. Keep following your corrupted politicians who wage wars between caste and religion like sheeple. Don’t educate yourselves with current times at all. Don’t bring IT services or start your own at all. Don’t better your infrastructure. Keep blaming nehru and the british for your shit and keep stealing tax money from the people who do because hey 50 years is not enough time for development at all.",
        "I don't think people have any issues with folks from North-east India,",
        "&gt;I’m not talking about South developing the IT service sector- fortunately there were leaders like SM Krishna or CB Naidu to recognise that and proactively take steps. \n\nAll of which happened long after Frieght Equalization Act was introduced by which South Indian states had a huge lead in both fiscal and human capital\n\n&gt;I challenged the premise of the freight equalisation problem.If there’s a problem - you focus on a solution. Not harp about it for time immemorial. Yeah we have wronged. So what - even China was wronged. I don’t see them blaming the Japanese for the ills in their society. \n\nSure, but people out here are blaming BIMARU state's own policy as the reason why they are poor. It's not. Freight Equalization went on into the 90s. It's only since the 2000s that the catch up growth has begun. BIMARU states actually have very good growth rates now but it will take many years before the convergence actually happens. \n\n&gt;If freight equalisation happened - then why didnt. these states focus on building up services? What stopped these states to develop a vision or foresight - when freight equalisation happened? \n\nBecause a thriving service industry requires human capital which can only be developed if you actual capital to support it. Look up Nobel prize Winning Solow Swann growth model\n\nhttps://en.m.wikipedia.org/wiki/Solow%E2%80%93Swan_model",
        "All of the stuff that you describes require actual capital to implement, which was denied to North and Eastern states due to Frieght Equalization Act. I don't know why you're arguing about this, it's quite well established in economics literature that Frieght Equalization Act explains much of the disparity in wealth between South and North India (apart from South's access to maritime trade). It was a dumb policy which affected both North and India as a whole\n\nHere is agood economics literature review on Frieght Equalization Act from Cornell University which explains it pretty well\n\nhttp://barrett.dyson.cornell.edu/NEUDC/paper_316.pdf\n\nPS: I'm from Kerala, so I don't have a North Indian bias in this debate. I'm just stating what the academic evidence says about this topic. Also, I'm with South Indians in this debate largely. Freight Equalization was repealed in the 90s but national politics is controlled by North Indian polticians which deny infrastructure to South Indian states. Without infrastructure, South Indian tap of revenue will dry out and there won't be anything to redistribute either. There are a lot of nuances in this debate.",
        "Haters gonna hate. People love to make everything a \"us vs them\" scenario. It is not logical and thus you cannot argue using logic.\n\nDislclaimer: I am not from a state which recieves more than it pays (have never even resided in such states).",
        "Liberalisation was in 1991 and Freight Equalisation was stopped in 1993. What's the excuse now, 30 years later?",
        "On the Contrary, Kerala has a very high number of Expats and the remittance makes it a wealthy State. Also the Tourism Sector is also one factor.",
        "We live in a welfare society. So you’re objectively wrong. What public goods is free food bringing on table? The point is no one should die of hunger. And guess which areas have higher hunger rates, karnataka or Bihar?",
        "Okay let’s take everything at face value. Freight equalisation bad and these states shouldn’t be blamed and have great policies. \n\nBut have we seen any great governance measures and any policy to promote industry from these states? Not much so far.\n\nFrom what I know, no industry wants to set up shop in these places? Why’s that?\n\nAs per you based on growth in metrics, when do you think these states will be self sufficient? \n\nBecause I’d argue that spending money on poorer districts in Maharashtra, Karnataka, Andra, Gujarat, Telangana and TN will yield better results and better outcomes for people. \n\nThese BIMARU regions need to make a better case if they need money and support from the nation. And the nation should incentivise states that are actively improving HDI metrics.",
        "The lack of connectivity/resources/difficulty in setting up industries in the north eastern states is still understandable. \n\nThere is no excuse for UP/Bihar to not have progressed. The only reason is lack of political will. \n\nPS: Before people start jumping on me for saying that, I am from the UP/Bihar belt.",
        "If the Hindi belt was seperated same as Pakistan during 1947 they would be the same as them maybe even worse( key similarities:- religion 1st and they never learn)",
        "Abolish the income tax (its only 15% of govt revenues anyways) and enhance indirect taxes for the potential deficit.\n\nNow, lets see who buys more !?",
        "There is no excuse. BIMARU states are growing very fast actually but the lag crested by decades of Frieght Equalization still persists. Ofc wealthier and more educated stated have a better informed populace and hence would vote for better policies too. It's a positive feedback loop.",
        "It's not about hypocrisy. When on earth will BIMARU start doing better and come anywhere close to the rest of the country? It's exhausting. \n\nYear after year, money gets diverted to these places with zero improvement.",
        "Why no one talking about harayana, we are getting robbed too 😂",
        "Specifically in the tech scene, south indians far outnumber North Indians. Just look at the density of engineering colleges in AP/TS/TN compared to other states in India.",
        "Same logic applies- do all North Indians in Bangalore work in tech? You see more marwadis running odd businesses than in tech.",
        "Exactly, everyone just went oh yea, they got like a fuckton of developmental projects they need it, people didn't take it lightly to the fact that \"backward\" states like UP and Bihar which have a significant population are unable to develop the state in the manner that other states have struggled to. It's more like, we've done it why can't you even after so long without understanding other factors that might hinder their development right now",
        "Why can’t they go to poorer districts in Maharashtra, Guj and south India. \n\nWhy should they be diverted to BIMARU states? \n\nI’d argue that the western and southern states will make better use of the investment since people are more educated and good policies are in place",
        "Sure you can argue about the nitty gritties. Problem is you clubbed the entire poor region with a very rich state. Bimaru states are definitely much poorer with less local resources than south",
        "That’s exactly the point. For every 100 Rs Maharashtra is contributing - it’s getting 7 Rs back. It’s a travesty - when the whole Saurashtra region is backward. Similarly in Karnataka, the whole North Eastern part is not developed. Same with Telangana, TN and Andra. Why shouldn’t atleast 80 Rs be given back to all these states - so that these regions can get developed?\n\nWhy should it go to BIMARU - who have shown very little signs of progress or forward thinking policy? Money should be given based on incentives.",
        "Idk what map you’re saying but the entire north east is getting funded. These areas are massively underdeveloped. Maharastra might be getting 7 out of 100, but if you remove Mumbai it would be much much more. Only because people in Mumbai pay a lot of tax. Overall state allocation of taxes should be pretty balanced",
        "Yeah ? Don’t u know what happened in Bangalore with north-east people. Bloody ugly faced people.",
        "Hahaha sure South India doesn't have any poverty or its own people to look after for?"
    ],
    "cleaned_text": "people sharing image creating hate north indians northeast indians want give opinion multiple reasons south india lot taxpayers people northern states tax bracket supposed pay income tax ratio government build infrastructure states limit south india already lot taxpayers people would saying benefit bring trying invest poorer states invest already rich states thing income increases poor income states people pay income tax help long run currently people india pay income tax people india earn less per annum government puts money states push nontax payers taxpayers population jobs created help people earn money eventually increase tax payers im sure one read comment many companies registered maharashtra tn gurgaon gst returns tax returns filed hqs shows collection particular state also saw many people also compare chhatrapati shivaji maharaj pm modi wtf stop compare true hero whose heroic deeds limited south india known respected many north indians well person well cant speak much know get point ps stuff actually sounds good thing still lot corruptionhttpspreviewredditcgswpcecgapngwidthampformatpngampautowebpampvenabledampsdbbccccdfddecddbd ",
    "cleaned_title": "people sharing image creating hate north indians northeast indians want give opinion",
    "cleaned_selftext": "multiple reasons south india lot taxpayers people northern states tax bracket supposed pay income tax ratio government build infrastructure states limit south india already lot taxpayers people would saying benefit bring trying invest poorer states invest already rich states thing income increases poor income states people pay income tax help long run currently people india pay income tax people india earn less per annum government puts money states push nontax payers taxpayers population jobs created help people earn money eventually increase tax payers im sure one read comment many companies registered maharashtra tn gurgaon gst returns tax returns filed hqs shows collection particular state also saw many people also compare chhatrapati shivaji maharaj pm modi wtf stop compare true hero whose heroic deeds limited south india known respected many north indians well person well cant speak much know get point ps stuff actually sounds good thing still lot corruptionhttpspreviewredditcgswpcecgapngwidthampformatpngampautowebpampvenabledampsdbbccccdfddecddbd",
    "cleaned_comments": "reason hate take lot time even sure people come clean start paying taxes even money fair people live die sacrifice get anything return lifetime agree also ignores fact lot people paying taxes southern cities bangalore hyderabad north especially number people north huge oh wow kind explain us something never knew mncs registered operating states metro cities thus logically tax collection higher states uniform across city states example karnataka tax collection bangalore times higher bellari haryana tax collection gurgaon times combined tax panipat sonipat kurukshetra think marathwada paying similar tax noida bhopal gwalior indore mp delusional spending infrastructure development especially expressway highway development done border areas hence majority chunk spent graphics doesnt portray real picture also map number central government institutions operating various states along date establishment presented would give stand alone image context ah wont make sense haters beam pride see nris indian migrants making life abroad look upon people come cities sitting high horses looking image actually intellectual poverty wish well hindi mainland wanted kids complex thing direct tax payers fathom oh wow kind contribute thread sarcasm might lowest form wit hey atleast possess wit agee grew rural village years hardwork able make career college stayed bangalore years moving london two years probably paid taxes lot people make year witch companies still continue contribute via investing remittance according people leeches dont pay attention people anything justify hate towards north piss pants someone calls thats reason hate look comments telling bihar seperate india calling biharis bimaru stop trying justify hate thanks compliment south indian mate well say respond lowest form wit unoriginal one mention fact without condescending shaming try different word respect according census think hindi speaking population blr around first majority kannadigas nd tamil rd telugu north indians even consider akshay kumars double money days logic gon na please tape thoughts lmao vast majority employees hyderabad telugus reason often find northies hyderabad employed complain everyone speaks telugu office thats bad comparison including indirect taxes happily accept cheap labour bihar cheap coal jharkhand producing cheap electricity exactly bunch hypocrites lol happening since since south india grown north india hasnt grown years enough north indian states grow still need time gtsouth india lot taxpayers people northern states tax bracket supposed pay income tax ratio gt gtthe government build infrastructure states limit south india already lot taxpayers years since independence still skewed understand northeast due rebels north quite stable industries yet set northern states income lower given amount population proportionally many entrepreneurs generate gtim sure one read comment many companies registered maharashtra tn gurgaon gst returns tax returns filed hqs ever wondered whats reason post didnt create hate show north needs get shit together think opinion missing key factor lot south also western indians including guj maharashtra dont hate bimaru states really pained pace bimaru states developed despite spending much decades independence places hdi indexes slightly better sub sharan africa lawlessness defiance authority states rampant add crime jungle raj arent states incentivised develop like rest india holding back end states need money isnt better distribution scheme allocation money happen meritocracy reward states efficient improving hdi metrics south west indians feel pained money diverted places seeing returns decades unfortunately dont see trend pointing upwards im justifying hate cant really stop people think say online thats definitely reason hate people oppose unequal distribution funds ask also oppose wealth tax rich used fund social programs poor someone comments said north needs get shit together develop since since independence might unpopular truth without going details north dealing much damage colonial india south damage fiscal infrastructural one also shapes society differently one research sure income tax also commercial tax sales tax vat etc etc hindi region lot people means consume pay taxes region utmost natural resources subcontinent perennial rivers minerals etc argument people tn dont live usa like environment problems water problems eg cant govt fix problem north votesseats hence say parliament see north south divide coming soon indiaback janapadas friends hate anything fact man dont understand whole point taxes bring equality redistribute wealth ofcourse benefits taxes go poorer regions thats whole goddamn point except lot people native speakers doesnt work tech bangalores majority direct income tax comes tech scene course lot people speak kannada much work tech think people north tech filed grossly mistaken sure hyderabad bangalore lot north indian also work tech use native language talk professional setting hindi telugu stupid thats really unprofessional exception kerala whjch doesnt big metropolises drive tax collection wealthy state highest hdi country north affected nehrus misplaced freight equalization act wealth tax empirically poor record removed almost every place tried real reason disparity north south nehrus misplaced frieght equalization act real reason disparity north south nehrus misplaced frieght equalization act edit people dont believe agood economics literature review frieght equalization act cornell university explains pretty well dumb policy affected north india whole gtthe whole point taxes bring equality redistribute wealth point taxes raise revenue public goods south indians still dominate bangalores tech scene ok dont believe wealthier individuals taxed higher rate poorer ones everybody read north vs south nilakantan rs provide much context negativity arising graphic basic things like education healthcare stats impact overall economic outcomes yes right dont believe south indian states rich case pay north indian ones poor makes think dont believe cant compete export driven industries due freight stopped bringing industries like services pharmaengineering services stop making excuses poor planning blame nehru british mughals pathetic state affairs take responsibility thats first step towards reaching somewhere relevant said question either weak grasp english language actually believe rich taxed regardless would love see source states higher tax rate rich reduce inequality know south indian states didnt sector frieght equalization act introduced right something developed much later capital accumulation happened prevented freight equalization im kerala totally understand reason north eastern states lag southwestern ststes pretty established economics literature freight equalization culprit buddy need read original comment seemingly problem reading comprehension im progressiveness taxes im wealth taxes specifically well established history failure redistribution goal use property tax even better land value tax much support among actual economist article gives good overview best way restructure indian tax system make efficient progressive devil details alright believe agree south indian states pay north indian ones sure long south india gets enough funding public infrastructure enables redistribution first place thats happening im inclined side south indians debate kill south indias ability generate revenue even redistribution ro north wont happen issue national politics held hostage north indian polticians ps actually dont blame north india underperformance victim nehrus misplaced frieght equalization act created disparity first place im talking south developing service sector fortunately leaders like sm krishna cb naidu recognise proactively take steps challenged premise freight equalisation problemif theres problem focus solution harp time immemorial yeah wronged even china wronged dont see blaming japanese ills society freight equalisation happened didnt states focus building services stopped states develop vision foresight freight equalisation happened keep popping kids keep sending children schools keep following corrupted politicians wage wars caste religion like sheeple dont educate current times dont bring services start dont better infrastructure keep blaming nehru british shit keep stealing tax money people hey years enough time development dont think people issues folks northeast india gtim talking south developing service sector fortunately leaders like sm krishna cb naidu recognise proactively take steps happened long frieght equalization act introduced south indian states huge lead fiscal human capital gti challenged premise freight equalisation problemif theres problem focus solution harp time immemorial yeah wronged even china wronged dont see blaming japanese ills society sure people blaming bimaru states policy reason poor freight equalization went since catch growth begun bimaru states actually good growth rates take many years convergence actually happens gtif freight equalisation happened didnt states focus building services stopped states develop vision foresight freight equalisation happened thriving service industry requires human capital developed actual capital support look nobel prize winning solow swann growth model stuff describes require actual capital implement denied north eastern states due frieght equalization act dont know youre arguing quite well established economics literature frieght equalization act explains much disparity wealth south north india apart souths access maritime trade dumb policy affected north india whole agood economics literature review frieght equalization act cornell university explains pretty well ps im kerala dont north indian bias debate im stating academic evidence says topic also im south indians debate largely freight equalization repealed national politics controlled north indian polticians deny infrastructure south indian states without infrastructure south indian tap revenue dry wont anything redistribute either lot nuances debate haters gon na hate people love make everything us vs scenario logical thus argue using logic dislclaimer state recieves pays never even resided states liberalisation freight equalisation stopped whats excuse years later contrary kerala high number expats remittance makes wealthy state also tourism sector also one factor live welfare society youre objectively wrong public goods free food bringing table point one die hunger guess areas higher hunger rates karnataka bihar okay lets take everything face value freight equalisation bad states shouldnt blamed great policies seen great governance measures policy promote industry states much far know industry wants set shop places whys per based growth metrics think states self sufficient id argue spending money poorer districts maharashtra karnataka andra gujarat telangana tn yield better results better outcomes people bimaru regions need make better case need money support nation nation incentivise states actively improving hdi metrics lack connectivityresourcesdifficulty setting industries north eastern states still understandable excuse upbihar progressed reason lack political ps people start jumping saying upbihar belt hindi belt seperated pakistan would maybe even worse key similarities religion st never learn abolish income tax govt revenues anyways enhance indirect taxes potential deficit lets see buys excuse bimaru states growing fast actually lag crested decades frieght equalization still persists ofc wealthier educated stated better informed populace hence would vote better policies positive feedback loop hypocrisy earth bimaru start better come anywhere close rest country exhausting year year money gets diverted places zero improvement one talking harayana getting robbed specifically tech scene south indians far outnumber north indians look density engineering colleges aptstn compared states india logic applies north indians bangalore work tech see marwadis running odd businesses tech exactly everyone went oh yea got like fuckton developmental projects need people didnt take lightly fact backward states like bihar significant population unable develop state manner states struggled like weve done cant even long without understanding factors might hinder development right cant go poorer districts maharashtra guj south india diverted bimaru states id argue western southern states make better use investment since people educated good policies place sure argue nitty gritties problem clubbed entire poor region rich state bimaru states definitely much poorer less local resources south thats exactly point every rs maharashtra contributing getting rs back travesty whole saurashtra region backward similarly karnataka whole north eastern part developed telangana tn andra shouldnt atleast rs given back states regions get developed go bimaru shown little signs progress forward thinking policy money given based incentives idk map youre saying entire north east getting funded areas massively underdeveloped maharastra might getting remove mumbai would much much people mumbai pay lot tax overall state allocation taxes pretty balanced yeah dont u know happened bangalore northeast people bloody ugly faced people hahaha sure south india doesnt poverty people look",
    "light_cleaned_title": "People are sharing this image and creating hate for north indians and north-east indians so I want to give my opinion.",
    "light_cleaned_selftext": "There are multiple reasons for this: 1. South India has a lot of tax-payers but most people in the northern states are not in the tax bracket that is supposed to pay the income tax that is why this ratio. 2. The government has to build infrastructure in all states and not just limit themselves in South India where there are already a lot of tax-payers. 3. Now people would be saying \"What benefit does it bring trying to invest in the poorer states and not invest more in already rich states\". The thing is, the more the income that increases for the poor income states, the more no. of people will have to pay income tax, which will only help in the long run. Currently only 5% of people in India pay income tax because the other 95% people in India earn less than 3,00,000 per annum. That is why if the government puts money in those states which will push the non-tax payers to tax-payers population. Jobs will be created, which will help people earn more money which will eventually increase tax payers. 4. (I'm not sure about this one I read this in a comment) Many companies are registered in Maharashtra , TN Gurgaon.. Their GST returns , tax returns are filed from HQs.. So it shows as collection from that particular state. I also saw many people also compare Chhatrapati Shivaji Maharaj and our PM Modi, wtf. Stop doing this we cannot compare a true hero whose heroic deeds are not only limited to South India but are known and respected by many North Indians as well and a person.... well I can't speak much about him (You know why) but you get the point. [P.S- All this stuff actually sounds good but the thing is we still have a lot of corruption.](https://preview.redd.it/9cgswpc1ecga1.png?width=800&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=6d4300bbc180250cccdf044dde67252cd50d5b1d)",
    "light_cleaned_comments": "The reason for the hate is that it will take a lot of time and it's not even sure people there will come clean and start paying taxes even if they have money. It's not fair for the people who live and die with this sacrifice and not get anything in return in this lifetime. Agree, also it ignores the fact that a lot of these people paying taxes in southern cities such as Bangalore, Hyderabad are from north. Especially in IT where the number of people from north is huge Oh wow, how kind of you to explain us something we never knew! Most of the MNCs are registered / operating from these States (Metro Cities). Thus logically the tax collection will be higher from these States. But it's not uniform across each city of these States. For example in Karnataka Tax collection from Bangalore will be 100 times higher than Bellari. Or in Haryana Tax Collection from Gurgaon will be 10 times more than the combined Tax of Panipat Sonipat Kurukshetra. So, If you think Marathwada is paying a similar tax as Noida in UP or Bhopal / Gwalior / Indore in MP then it's delusional. As for spending the Infrastructure development especially Expressway / Highway development is done on Border areas hence majority chunk is spent on that. This Graphics doesn't portray the real picture. Also, if the map of number of central government institutions operating in various states along with their date of establishment is presented, it would give this stand alone image some context. Ah, this wont make any sense to haters. We beam with pride when we see NRIs and Indian migrants making a life for them abroad. But look down upon people who come to our own cities. Those sitting on high horses just by looking at this image, are actually in intellectual poverty and I wish them well. Its not if the Hindi mainland wanted this for their kids. But its too complex a thing for \"direct tax payers\" to fathom Oh wow, how kind of you to contribute to the thread with sarcasm. It might be the lowest form of wit, but hey - atleast you possess some wit. Agee, I grew up in rural up village, and after years of hardwork was able to make a career after college. I stayed in Bangalore for 2 years before moving out to london and in those two years I have probably paid more taxes then a lot of people make in year in WITCH companies and still continue to contribute via investing and remittance but according to some people , we are just leeches 🤦‍♂️ Don't pay attention to them. These people will do anything to justify their hate towards north, and piss their pants when someone calls them out for it. That's not the reason for hate at all. Look at the comments telling bihar should be seperate from India, and calling Biharis \"bimaru\". Stop trying to justify their hate. Thanks for the compliment! If only i was a South Indian mate Well what does it say about you to respond to the \"lowest form of wit\" with more of the same? And an unoriginal one at that. You can mention a fact without being condescending or shaming. You can try a different word with more respect. According to 2011 census, I think the Hindi speaking population in BLR is around 10%. First majority is Kannadigas, 2nd Tamil, 3rd Telugu and then the North Indians. Even if you consider Akshay kumar's \"double money in 25 days, \" logic, it's gonna be 20%. So please, tape your thoughts LMAO no. The vast majority of IT employees in Hyderabad are Telugus. That is the same reason you often find northies in Hyderabad who are employed in IT complain that everyone speaks in Telugu in their office. That's bad comparison why not including the indirect taxes in it ? They will happily accept cheap labour from Bihar and cheap coal from jharkhand for producing cheap electricity. Exactly, bunch of hypocrites lol. This has been happening since 1971. Since then South india has grown but north India hasn’t grown at all. Is 50 years not enough for north indian states to grow ? Or do they still need more time ? &gt;South India has a lot of tax-payers but most people in the northern states are not in the tax bracket that is supposed to pay the income tax that is why this ratio. &gt; &gt;The government has to build infrastructure in all states and not just limit themselves in South India where there are already a lot of tax-payers. It's been more than 75 years since independence, why is it still this skewed? Can understand about the Northeast , due to rebels, but the North was quite stable. Why are industries not yet set up in Northern states? Why is the income lower? Given the amount of population, proportionally how many entrepreneurs does it generate? &gt;(I'm not sure about this one I read this in a comment) Many companies are registered in Maharashtra , TN Gurgaon.. Their GST returns , tax returns are filed from HQs.. Ever wondered what's the reason for that? That post didn't create hate, it was just to show, that north needs to get its shit together. No! I think your opinion is missing a key factor - lot of South and also western Indians - including Guj and Maharashtra don’t hate the BIMARU states but really are pained by the pace at which BIMARU states have developed - despite spending so much on them. After 7 decades of independence - these places HDI indexes are slightly better than sub sharan Africa. The lawlessness, the defiance to authority in the states is rampant - add to that crime and jungle raj. Why aren’t these states incentivised to develop like the rest of India? What is holding them back? To what end ,do these states need money? Why isn’t there a better distribution scheme - so that allocation of money can happen through meritocracy. Reward those states, who are efficient and improving their HDI metrics. South and West Indians feel pained that our money is diverted to these places, where we are not seeing returns for decades. Unfortunately, we don’t see any trend pointing upwards I'm not justifying hate, you can't really stop what people think and say online. But that's definitely the reason for the hate. To the people who oppose the unequal distribution of funds I ask you, do you also oppose a wealth tax for the rich which can be used to fund social programs for the poor? Someone in the comments said North needs to get its shit together and develop since it has been so since independence. Might be an unpopular truth and without going into details, North was dealing much more damage in colonial India than the South. Damage not just fiscal or infrastructural but one which also shapes a society differently. One can research on it for sure This is not just income tax. It is also commercial tax, sales tax, vat etc etc The Hindi region has a lot of people. Which means they should consume more and pay taxes. This is the region with utmost natural resources the subcontinent. They have perennial rivers, minerals etc. My argument is people in TN don't live in the USA like environment. They have problems too. Water problems for eg. Why can't the govt fix that problem for them? And the north will have more votes/seats and hence more say in the parliament. I see more north and south divide coming soon to India...back to the janapadas my friends. There should be no hate for anything. It's just a fact. Man I don’t understand. The whole point of taxes is to bring equality and redistribute wealth. Ofcourse the benefits of taxes go to poorer regions. That’s the whole goddamn point! Except a lot of people native speakers doesn’t work in tech. Bangalore’s majority of direct income tax comes from tech scene. Of course there is a lot more people that speak Kannada but how much work in tech ? If you think there are only 10% people from north in tech filed then you are grossly mistaken Not sure about Hyderabad but in Bangalore there are lot of North Indian. Also if you work In tech and use any native language to talk in professional setting be it Hindi or Telugu then they are stupid. That’s really unprofessional The exception here is Kerala, whjch doesn't have big metropolises that drive all the tax collection but is a wealthy state with the highest HDI in the country North was affected by Nehru's misplaced freight Equalization act I do. Because Wealth tax empirically a very poor record. It has been removed in almost every place it has been tried. More than that the real reason for the disparity between the North and South is Nehru's misplaced Frieght Equalization Act The real reason for the disparity between the North and South is Nehru's misplaced Frieght Equalization Act Edit: For people who don't believe me, here is agood economics literature review on Frieght Equalization Act from Cornell University which explains it pretty well It was a dumb policy which affected both North and India as a whole &gt;The whole point of taxes is to bring equality and redistribute wealth. No, it's not. The point of taxes is to raise revenue for public goods. South Indians still dominate Bangalore's tech scene. OK so do you don't believe that wealthier individuals should be taxed at a higher rate than poorer ones? EVERYBODY... Read 'North Vs South' by Nilakantan RS. This will provide so much context for the negativity arising out of this graphic. Just basic things like education, Healthcare stats and their impact on overall economic outcomes... Yes, I do. Right, so why then don't you believe that South Indian states (the rich in this case) should pay more than North Indian ones (the poor)? What makes you think I don't believe that? Can’t compete in export driven industries due to freight - then what stopped them from bringing in industries like IT services or pharma/engineering services? Stop making excuses for poor planning and blame Nehru and the British and the Mughals for the pathetic state of affairs. Take responsibility- that’s the first step towards reaching somewhere relevant. Because you said \"I do\" to my question. So you either have a very weak grasp of the English language or you do actually believe that the rich should not be taxed more. Regardless, I would love to see a source which states that a higher tax rate on the rich does not reduce inequality. You know that South Indian states didn't have an IT sector when Frieght Equalization Act was introduced right. It was something that developed much later when capital accumulation happened which was prevented by freight Equalization I'm from Kerala but I totally understand the reason why North Eastern states lag South-Western ststes. It's pretty established in economics literature that freight Equalization is the culprit Buddy you need to read my original comment again, it's seemingly you who have a problem with reading comprehension. I'm not against progressiveness in taxes, I'm just against wealth taxes specifically because it has a well established history of failure. If redistribution is your goal then use a property tax or even better a land value tax that has a much support among actual economist. The article below gives a good overview on the best way to restructure Indian tax system to make it more efficient and progressive. The devil is in the details Alright so I believe we both agree that South Indian states should pay more than North Indian ones. Sure, but only as long as South India gets enough funding for their public infrastructure which is what enables this redistribution in the first place. But that's not happening, so I'm inclined to side with South Indians in this debate. If you kill South India's ability to generate revenue then even redistribution ro the North won't happen. The issue is that the national politics is held hostage by North Indian polticians. PS: I actually don't blame North India for their underperformance. They were a victim of Nehru's misplaced Frieght Equalization Act, which is what created this disparity in the first place. I’m not talking about South developing the IT service sector- fortunately there were leaders like SM Krishna or CB Naidu to recognise that and proactively take steps. I challenged the premise of the freight equalisation problem.If there’s a problem - you focus on a solution. Not harp about it for time immemorial. Yeah we have been wronged. So what - even China was wronged. I don’t see them blaming the Japanese for the ills in their society. If freight equalisation happened - then why didn’t these states focus on building up services? What stopped these states to develop a vision or foresight - when freight equalisation happened? Keep popping 5+ kids. Keep not sending your children to schools. Keep following your corrupted politicians who wage wars between caste and religion like sheeple. Don’t educate yourselves with current times at all. Don’t bring IT services or start your own at all. Don’t better your infrastructure. Keep blaming nehru and the british for your shit and keep stealing tax money from the people who do because hey 50 years is not enough time for development at all. I don't think people have any issues with folks from North-east India, &gt;I’m not talking about South developing the IT service sector- fortunately there were leaders like SM Krishna or CB Naidu to recognise that and proactively take steps. All of which happened long after Frieght Equalization Act was introduced by which South Indian states had a huge lead in both fiscal and human capital &gt;I challenged the premise of the freight equalisation problem.If there’s a problem - you focus on a solution. Not harp about it for time immemorial. Yeah we have wronged. So what - even China was wronged. I don’t see them blaming the Japanese for the ills in their society. Sure, but people out here are blaming BIMARU state's own policy as the reason why they are poor. It's not. Freight Equalization went on into the 90s. It's only since the 2000s that the catch up growth has begun. BIMARU states actually have very good growth rates now but it will take many years before the convergence actually happens. &gt;If freight equalisation happened - then why didnt. these states focus on building up services? What stopped these states to develop a vision or foresight - when freight equalisation happened? Because a thriving service industry requires human capital which can only be developed if you actual capital to support it. Look up Nobel prize Winning Solow Swann growth model All of the stuff that you describes require actual capital to implement, which was denied to North and Eastern states due to Frieght Equalization Act. I don't know why you're arguing about this, it's quite well established in economics literature that Frieght Equalization Act explains much of the disparity in wealth between South and North India (apart from South's access to maritime trade). It was a dumb policy which affected both North and India as a whole Here is agood economics literature review on Frieght Equalization Act from Cornell University which explains it pretty well PS: I'm from Kerala, so I don't have a North Indian bias in this debate. I'm just stating what the academic evidence says about this topic. Also, I'm with South Indians in this debate largely. Freight Equalization was repealed in the 90s but national politics is controlled by North Indian polticians which deny infrastructure to South Indian states. Without infrastructure, South Indian tap of revenue will dry out and there won't be anything to redistribute either. There are a lot of nuances in this debate. Haters gonna hate. People love to make everything a \"us vs them\" scenario. It is not logical and thus you cannot argue using logic. Dislclaimer: I am not from a state which recieves more than it pays (have never even resided in such states). Liberalisation was in 1991 and Freight Equalisation was stopped in 1993. What's the excuse now, 30 years later? On the Contrary, Kerala has a very high number of Expats and the remittance makes it a wealthy State. Also the Tourism Sector is also one factor. We live in a welfare society. So you’re objectively wrong. What public goods is free food bringing on table? The point is no one should die of hunger. And guess which areas have higher hunger rates, karnataka or Bihar? Okay let’s take everything at face value. Freight equalisation bad and these states shouldn’t be blamed and have great policies. But have we seen any great governance measures and any policy to promote industry from these states? Not much so far. From what I know, no industry wants to set up shop in these places? Why’s that? As per you based on growth in metrics, when do you think these states will be self sufficient? Because I’d argue that spending money on poorer districts in Maharashtra, Karnataka, Andra, Gujarat, Telangana and TN will yield better results and better outcomes for people. These BIMARU regions need to make a better case if they need money and support from the nation. And the nation should incentivise states that are actively improving HDI metrics. The lack of connectivity/resources/difficulty in setting up industries in the north eastern states is still understandable. There is no excuse for UP/Bihar to not have progressed. The only reason is lack of political will. PS: Before people start jumping on me for saying that, I am from the UP/Bihar belt. If the Hindi belt was seperated same as Pakistan during 1947 they would be the same as them maybe even worse( key similarities:- religion 1st and they never learn) Abolish the income tax (its only 15% of govt revenues anyways) and enhance indirect taxes for the potential deficit. Now, lets see who buys more !? There is no excuse. BIMARU states are growing very fast actually but the lag crested by decades of Frieght Equalization still persists. Ofc wealthier and more educated stated have a better informed populace and hence would vote for better policies too. It's a positive feedback loop. It's not about hypocrisy. When on earth will BIMARU start doing better and come anywhere close to the rest of the country? It's exhausting. Year after year, money gets diverted to these places with zero improvement. Why no one talking about harayana, we are getting robbed too 😂 Specifically in the tech scene, south indians far outnumber North Indians. Just look at the density of engineering colleges in AP/TS/TN compared to other states in India. Same logic applies- do all North Indians in Bangalore work in tech? You see more marwadis running odd businesses than in tech. Exactly, everyone just went oh yea, they got like a fuckton of developmental projects they need it, people didn't take it lightly to the fact that \"backward\" states like UP and Bihar which have a significant population are unable to develop the state in the manner that other states have struggled to. It's more like, we've done it why can't you even after so long without understanding other factors that might hinder their development right now Why can’t they go to poorer districts in Maharashtra, Guj and south India. Why should they be diverted to BIMARU states? I’d argue that the western and southern states will make better use of the investment since people are more educated and good policies are in place Sure you can argue about the nitty gritties. Problem is you clubbed the entire poor region with a very rich state. Bimaru states are definitely much poorer with less local resources than south That’s exactly the point. For every 100 Rs Maharashtra is contributing - it’s getting 7 Rs back. It’s a travesty - when the whole Saurashtra region is backward. Similarly in Karnataka, the whole North Eastern part is not developed. Same with Telangana, TN and Andra. Why shouldn’t atleast 80 Rs be given back to all these states - so that these regions can get developed? Why should it go to BIMARU - who have shown very little signs of progress or forward thinking policy? Money should be given based on incentives. Idk what map you’re saying but the entire north east is getting funded. These areas are massively underdeveloped. Maharastra might be getting 7 out of 100, but if you remove Mumbai it would be much much more. Only because people in Mumbai pay a lot of tax. Overall state allocation of taxes should be pretty balanced Yeah ? Don’t u know what happened in Bangalore with north-east people. Bloody ugly faced people. Hahaha sure South India doesn't have any poverty or its own people to look after for?"
}