{
    "id": "1d9f00r",
    "title": "Indian-American charged with hate crime for threatening employees of Sikh body",
    "url": "https://www.indiatoday.in/world/story/indian-american-charged-with-hate-crime-for-threatening-employees-of-sikh-body-2549643-2024-06-06",
    "selftext": "Accused Bhushan Athale allegedly expressed extreme hatred towards employees of a Sikh organisation, an official statement said. ",
    "flair": "Law & Courts",
    "score": 39,
    "num_comments": 6,
    "created_utc": 1717669903.0,
    "convurl": "https://external-preview.redd.it/caNyUQfnbcveX1KmW9GadATYwJll-OQX57lXA-Ze1IU.jpg?auto=webp&s=91fa8f02a0fc636c10b7147a4537538bdb323f23",
    "comments": [
        "[Coverage from U.S. Department of Justice](https://www.justice.gov/opa/pr/texas-man-charged-federal-hate-crime-making-threats-against-employees-sikh-organization)\n\n> Bhushan Athale, 48, of Dallas, was charged by complaint with one count of interfering with federally protected activities through the threatened use of a dangerous weapon and one count of transmitting an interstate threat to injure another person.\n\n> According to the criminal complaint, on or about Sept. 17, 2022, Athale called the main number of an organization that advocates for the civil rights of Sikh individuals within the United States. Over the next hour, Athale left seven voicemails expressing extreme hatred toward Sikh individuals working at this same organization and threatening to injure or kill these individuals with a razor. Athale’s voicemails, which were filled with violent imagery and obscenity, contained references to places, people and tenets that are particularly significant within the Sikh religion. Among other things, Athale stated his intention to “catch” the Sikhs at the organization, forcibly “shave” the “top and bottom hair” of these individuals, use a “razor” to forcibly “cut” these individuals’ hair and “make” them bald, forcibly “make” them smoke and eat tobacco and “show [them] the heaven.”\n\n> In March, Athale again called the same Sikh organization and left two more voicemails. In these voicemails, Athale again used violent imagery to express his hatred toward Sikhs as well as Muslims, suggesting, among other things, that the Indian Government and Mumbai Police should “catch them and beat their ass” and “f*ck these rascals’ mothers.” \n\n> The investigation reflects that Athale has a long history of making religious-based comments and threats, such as when he previously used a professional networking site to express to a former co-worker that he “hate[d] Pakistan” and “hate[d] Muslims,” and he told the co-worker “I hate you, I just don’t know how to kill your whole family including you?  Tell me???  I will figure it out […] Probably I will hire a Jew, they will be most happy.”",
        "Deport deport deport",
        "> u/heybuddy13\n\n> Deport deport deport\n\nI think he should stay there and face the justice system.\n\nIf he will be deported before facing the justice, garland will be put around his neck and then he will contest election on the ruling party ticket.\n\nAlso as we know the justice system in India. In case of minorities even the highest investigative agency will refuse to investigate [6733 extrajudicial killings of Sikhs.](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544)",
        "> u/heybuddy13\n\n> Deport deport deport\n\nI think he should stay there and face the justice system.\n\nIf he will be deported before facing the justice, garland will be put around his neck and then he will contest election on the ruling party ticket.\n\nAlso as we know the justice system in India. In case of minorities even the highest investigative agency will refuse to investigate [6733 extrajudicial killings of Sikhs.](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544)",
        "> I think he should stay there and face the justice system\n\nThat’s how deportations work. He will be tried, sentenced and then deportation after serving his jail term. They’re not immediately going to deport him.",
        "Deranged NRI Bhakt..",
        "Why deport? He’s going to be charged and serve years in a federal max prison for terrorizing threats then you can have him back to make a hero."
    ],
    "cleaned_text": "indianamerican charged hate crime threatening employees sikh body accused bhushan athale allegedly expressed extreme hatred towards employees sikh organisation official statement said ",
    "cleaned_title": "indianamerican charged hate crime threatening employees sikh body",
    "cleaned_selftext": "accused bhushan athale allegedly expressed extreme hatred towards employees sikh organisation official statement said",
    "cleaned_comments": "coverage us department justicehttpswwwjusticegovopaprtexasmanchargedfederalhatecrimemakingthreatsagainstemployeessikhorganization bhushan athale dallas charged complaint one count interfering federally protected activities threatened use dangerous weapon one count transmitting interstate threat injure another person according criminal complaint sept athale called main number organization advocates civil rights sikh individuals within united states next hour athale left seven voicemails expressing extreme hatred toward sikh individuals working organization threatening injure kill individuals razor athales voicemails filled violent imagery obscenity contained references places people tenets particularly significant within sikh religion among things athale stated intention catch sikhs organization forcibly shave top bottom hair individuals use razor forcibly cut individuals hair make bald forcibly make smoke eat tobacco show heaven march athale called sikh organization left two voicemails voicemails athale used violent imagery express hatred toward sikhs well muslims suggesting among things indian government mumbai police catch beat ass fck rascals mothers investigation reflects athale long history making religiousbased comments threats previously used professional networking site express former coworker hated pakistan hated muslims told coworker hate dont know kill whole family including tell figure probably hire jew happy deport deport deport uheybuddy deport deport deport think stay face justice system deported facing justice garland put around neck contest election ruling party ticket also know justice system india case minorities even highest investigative agency refuse investigate extrajudicial killings sikhshttpswwwlivelawinhighcourtpunjabandharyanahighcourtpunjabharyanahighcourtenforceddisappearanceencounterkillingsinpunjabduringincidentsdecadesoldnoeyewitnessinitiationofinvestigationnotfeasible uheybuddy deport deport deport think stay face justice system deported facing justice garland put around neck contest election ruling party ticket also know justice system india case minorities even highest investigative agency refuse investigate extrajudicial killings sikhshttpswwwlivelawinhighcourtpunjabandharyanahighcourtpunjabharyanahighcourtenforceddisappearanceencounterkillingsinpunjabduringincidentsdecadesoldnoeyewitnessinitiationofinvestigationnotfeasible think stay face justice system thats deportations work tried sentenced deportation serving jail term theyre immediately going deport deranged nri bhakt deport hes going charged serve years federal max prison terrorizing threats back make hero",
    "light_cleaned_title": "Indian-American charged with hate crime for threatening employees of Sikh body",
    "light_cleaned_selftext": "Accused Bhushan Athale allegedly expressed extreme hatred towards employees of a Sikh organisation, an official statement said.",
    "light_cleaned_comments": "[Coverage from U.S. Department of Justice](https://www.justice.gov/opa/pr/texas-man-charged-federal-hate-crime-making-threats-against-employees-sikh-organization) > Bhushan Athale, 48, of Dallas, was charged by complaint with one count of interfering with federally protected activities through the threatened use of a dangerous weapon and one count of transmitting an interstate threat to injure another person. > According to the criminal complaint, on or about Sept. 17, 2022, Athale called the main number of an organization that advocates for the civil rights of Sikh individuals within the United States. Over the next hour, Athale left seven voicemails expressing extreme hatred toward Sikh individuals working at this same organization and threatening to injure or kill these individuals with a razor. Athale’s voicemails, which were filled with violent imagery and obscenity, contained references to places, people and tenets that are particularly significant within the Sikh religion. Among other things, Athale stated his intention to “catch” the Sikhs at the organization, forcibly “shave” the “top and bottom hair” of these individuals, use a “razor” to forcibly “cut” these individuals’ hair and “make” them bald, forcibly “make” them smoke and eat tobacco and “show [them] the heaven.” > In March, Athale again called the same Sikh organization and left two more voicemails. In these voicemails, Athale again used violent imagery to express his hatred toward Sikhs as well as Muslims, suggesting, among other things, that the Indian Government and Mumbai Police should “catch them and beat their ass” and “f*ck these rascals’ mothers.” > The investigation reflects that Athale has a long history of making religious-based comments and threats, such as when he previously used a professional networking site to express to a former co-worker that he “hate[d] Pakistan” and “hate[d] Muslims,” and he told the co-worker “I hate you, I just don’t know how to kill your whole family including you? Tell me??? I will figure it out […] Probably I will hire a Jew, they will be most happy.” Deport deport deport > u/heybuddy13 > Deport deport deport I think he should stay there and face the justice system. If he will be deported before facing the justice, garland will be put around his neck and then he will contest election on the ruling party ticket. Also as we know the justice system in India. In case of minorities even the highest investigative agency will refuse to investigate [6733 extrajudicial killings of Sikhs.](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544) > u/heybuddy13 > Deport deport deport I think he should stay there and face the justice system. If he will be deported before facing the justice, garland will be put around his neck and then he will contest election on the ruling party ticket. Also as we know the justice system in India. In case of minorities even the highest investigative agency will refuse to investigate [6733 extrajudicial killings of Sikhs.](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544) > I think he should stay there and face the justice system That’s how deportations work. He will be tried, sentenced and then deportation after serving his jail term. They’re not immediately going to deport him. Deranged NRI Bhakt.. Why deport? He’s going to be charged and serve years in a federal max prison for terrorizing threats then you can have him back to make a hero."
}