{
    "id": "f9owi4",
    "title": "Cyber democracy finds answers to some of our most pressing digital rights questions",
    "url": "https://www.reddit.com/r/india/comments/f9owi4/cyber_democracy_finds_answers_to_some_of_our_most/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/d3o0otn7n7j41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=1b572b5e86173d21090af728db1de252cf182b70\n\n&amp;#x200B;\n\nThere is a dearth of platforms and people who are interested in delving deep into the multitude of issues that plague digital Indians today. What’s even more difficult is finding people who do it in an accessible manner. A large part of my job is to ensure that the work we do reaches people and finding partners who can help us make everyone informed about their digital rights and the threats to it.   \n\n\nCollaboration has been a central function of growing awareness and providing a basis of civic engagement for more Indians. One of the first attempts we made was when the generous and excellent team from the independent digital media platform, [**Suno India**](https://www.sunoindia.in/)reached out to us with their, “[**Cyber Democracy**](https://www.sunoindia.in/cyber-democracy/)” podcast.   \n\n\n***Suno India’s “Cyber Democracy” explores our digital fears and desires***  \n\n\nIn December last year, we decided to collaborate with Suno India on Cyber Democracy, a podcast that seeks to find out what democracy means in the digital age. This podcast is hosted by Srinivas Kodali, an independent, public interest technologist who has been relentlessly researching and documenting the development of public policy and regulations around tech in India.   \n\n\nHe uses the audio medium effectively by holding succinct and in-depth conversations with experts and activists alike, making it accessible for the larger public. From using drones to surveil protestors to [**mass deployment of facial recognition technologies**](https://internetfreedom.in/facial-recognition-in-india-part-i/)\\- just when you think we have seen it all, something newer and crazier comes up. The worst part? The everyday Indian knows very little of these developments. This is precisely why collaborations like these become even more important to help us scale our impact. As a community-centric organisation, we need to focus on working with people and communities. Platforms like Suno India and shows like Cyber Democracy help us bridge the gap between our work and people’s understanding of their fundamental rights.   \n\n\n***A podcast that talks about technology policy without being boring***   \n\n\nOne of the first episodes of Cyber Democracy throws light on the government’s reluctance to own up to data leaks and bugs as part of their systems. The episode is called Bugs in Cyberspace and you can listen to it [**here**](https://www.sunoindia.in/cyber-democracy/bugs-in-cyberspace/). It talks about one of the most persistent problems that plague us - the government’s vehement denial in the face of data leaks. A lot of the times, when these bugs have been brought to the attention of the authorities, the researchers simply don’t hear back from them. This is particularly scary in these times of rampant data breaches.   \n\n\nAnother one of such eye-opening episodes is about the increased use of drones and how their use is regulated and *if* these regulations are implemented. The episode was called Mechanical Birds. It discovers the history of regulations and how their use has changed over the years. It also speaks about the illegal use of drones during protests (more on this, [**here**](https://internetfreedom.in/its-a-bird-its-a-plane-oh-no-its-a-surveillance-drone-we-write-to-the-dgca-to-take-action/)) and how these regulations apply to authorities and if they even need permits in the first place. Listen to the whole episode [**here**](https://www.sunoindia.in/cyber-democracy/mechanical-birds/).   \n\n\nAs someone who hasn’t studied law, I’m not familiar with a lot of the technical and legal terms that are often thrown around when we discuss these issues. It’s important that people understand what’s exactly at stake so they can fight back and help us fight back. One of the bugs that Karan from the Bugs In Cyberspace episode found in the Indian Gases web API impacted 600 million potential users whose records were stored in the database.  \n\n\n***Tune*** ***in,*** ***today.***  \n\n\nAnd now, after a series of insightful episodes and discovering things that make you wonder if you heard that right - This season of Cyber Democracy is going to end soon. Podcasts like these help us find newer ways to engage with people and communities. In other words, they have our back when we need it the most.  \n\n\nThe entire team at IFF is so thankful to have worked with Srinivas Kodali and Suno India on Cyber Democracy and we look can’t wait to see what’s in store for season two.   \n\n\n[***Cyber Democracy is available on all streaming platforms*****.**](https://www.sunoindia.in/cyber-democracy/)",
    "flair": "Policy/Economy",
    "score": 12,
    "num_comments": 0,
    "created_utc": 1582697727,
    "convurl": "https://b.thumbs.redditmedia.com/p_vwf8u17sW246_z8tkP2cT9ZMcFOBp6S6Mr-ZZ72pY.jpg",
    "comments": [],
    "cleaned_text": "cyber democracy finds answers pressing digital rights questions ampxb ampxb dearth platforms people interested delving deep multitude issues plague digital indians today whats even difficult finding people accessible manner large part job ensure work reaches people finding partners help us make everyone informed digital rights threats collaboration central function growing awareness providing basis civic engagement indians one first attempts made generous excellent team independent digital media platform suno indiahttpswwwsunoindiainreached us cyber democracyhttpswwwsunoindiaincyberdemocracy podcast suno indias cyber democracy explores digital fears desires december last year decided collaborate suno india cyber democracy podcast seeks find democracy means digital age podcast hosted srinivas kodali independent public interest technologist relentlessly researching documenting development public policy regulations around tech india uses audio medium effectively holding succinct indepth conversations experts activists alike making accessible larger public using drones surveil protestors mass deployment facial recognition technologieshttpsinternetfreedominfacialrecognitioninindiaparti think seen something newer crazier comes worst part everyday indian knows little developments precisely collaborations like become even important help us scale impact communitycentric organisation need focus working people communities platforms like suno india shows like cyber democracy help us bridge gap work peoples understanding fundamental rights podcast talks technology policy without boring one first episodes cyber democracy throws light governments reluctance data leaks bugs part systems episode called bugs cyberspace listen herehttpswwwsunoindiaincyberdemocracybugsincyberspace talks one persistent problems plague us governments vehement denial face data leaks lot times bugs brought attention authorities researchers simply dont hear back particularly scary times rampant data breaches another one eyeopening episodes increased use drones use regulated regulations implemented episode called mechanical birds discovers history regulations use changed years also speaks illegal use drones protests herehttpsinternetfreedominitsabirditsaplaneohnoitsasurveillancedronewewritetothedgcatotakeaction regulations apply authorities even need permits first place listen whole episode herehttpswwwsunoindiaincyberdemocracymechanicalbirds someone hasnt studied law im familiar lot technical legal terms often thrown around discuss issues important people understand whats exactly stake fight back help us fight back one bugs karan bugs cyberspace episode found indian gases web api impacted million potential users whose records stored database tune today series insightful episodes discovering things make wonder heard right season cyber democracy going end soon podcasts like help us find newer ways engage people communities words back need entire team iff thankful worked srinivas kodali suno india cyber democracy look cant wait see whats store season two cyber democracy available streaming platformshttpswwwsunoindiaincyberdemocracy ",
    "cleaned_title": "cyber democracy finds answers pressing digital rights questions",
    "cleaned_selftext": "ampxb ampxb dearth platforms people interested delving deep multitude issues plague digital indians today whats even difficult finding people accessible manner large part job ensure work reaches people finding partners help us make everyone informed digital rights threats collaboration central function growing awareness providing basis civic engagement indians one first attempts made generous excellent team independent digital media platform suno indiahttpswwwsunoindiainreached us cyber democracyhttpswwwsunoindiaincyberdemocracy podcast suno indias cyber democracy explores digital fears desires december last year decided collaborate suno india cyber democracy podcast seeks find democracy means digital age podcast hosted srinivas kodali independent public interest technologist relentlessly researching documenting development public policy regulations around tech india uses audio medium effectively holding succinct indepth conversations experts activists alike making accessible larger public using drones surveil protestors mass deployment facial recognition technologieshttpsinternetfreedominfacialrecognitioninindiaparti think seen something newer crazier comes worst part everyday indian knows little developments precisely collaborations like become even important help us scale impact communitycentric organisation need focus working people communities platforms like suno india shows like cyber democracy help us bridge gap work peoples understanding fundamental rights podcast talks technology policy without boring one first episodes cyber democracy throws light governments reluctance data leaks bugs part systems episode called bugs cyberspace listen herehttpswwwsunoindiaincyberdemocracybugsincyberspace talks one persistent problems plague us governments vehement denial face data leaks lot times bugs brought attention authorities researchers simply dont hear back particularly scary times rampant data breaches another one eyeopening episodes increased use drones use regulated regulations implemented episode called mechanical birds discovers history regulations use changed years also speaks illegal use drones protests herehttpsinternetfreedominitsabirditsaplaneohnoitsasurveillancedronewewritetothedgcatotakeaction regulations apply authorities even need permits first place listen whole episode herehttpswwwsunoindiaincyberdemocracymechanicalbirds someone hasnt studied law im familiar lot technical legal terms often thrown around discuss issues important people understand whats exactly stake fight back help us fight back one bugs karan bugs cyberspace episode found indian gases web api impacted million potential users whose records stored database tune today series insightful episodes discovering things make wonder heard right season cyber democracy going end soon podcasts like help us find newer ways engage people communities words back need entire team iff thankful worked srinivas kodali suno india cyber democracy look cant wait see whats store season two cyber democracy available streaming platformshttpswwwsunoindiaincyberdemocracy",
    "cleaned_comments": "",
    "light_cleaned_title": "Cyber democracy finds answers to some of our most pressing digital rights questions",
    "light_cleaned_selftext": "There is a dearth of platforms and people who are interested in delving deep into the multitude of issues that plague digital Indians today. What’s even more difficult is finding people who do it in an accessible manner. A large part of my job is to ensure that the work we do reaches people and finding partners who can help us make everyone informed about their digital rights and the threats to it. Collaboration has been a central function of growing awareness and providing a basis of civic engagement for more Indians. One of the first attempts we made was when the generous and excellent team from the independent digital media platform, [**Suno India**](https://www.sunoindia.in/)reached out to us with their, “[**Cyber Democracy**](https://www.sunoindia.in/cyber-democracy/)” podcast. ***Suno India’s “Cyber Democracy” explores our digital fears and desires*** In December last year, we decided to collaborate with Suno India on Cyber Democracy, a podcast that seeks to find out what democracy means in the digital age. This podcast is hosted by Srinivas Kodali, an independent, public interest technologist who has been relentlessly researching and documenting the development of public policy and regulations around tech in India. He uses the audio medium effectively by holding succinct and in-depth conversations with experts and activists alike, making it accessible for the larger public. From using drones to surveil protestors to [**mass deployment of facial recognition technologies**](https://internetfreedom.in/facial-recognition-in-india-part-i/)\\- just when you think we have seen it all, something newer and crazier comes up. The worst part? The everyday Indian knows very little of these developments. This is precisely why collaborations like these become even more important to help us scale our impact. As a community-centric organisation, we need to focus on working with people and communities. Platforms like Suno India and shows like Cyber Democracy help us bridge the gap between our work and people’s understanding of their fundamental rights. ***A podcast that talks about technology policy without being boring*** One of the first episodes of Cyber Democracy throws light on the government’s reluctance to own up to data leaks and bugs as part of their systems. The episode is called Bugs in Cyberspace and you can listen to it [**here**](https://www.sunoindia.in/cyber-democracy/bugs-in-cyberspace/). It talks about one of the most persistent problems that plague us - the government’s vehement denial in the face of data leaks. A lot of the times, when these bugs have been brought to the attention of the authorities, the researchers simply don’t hear back from them. This is particularly scary in these times of rampant data breaches. Another one of such eye-opening episodes is about the increased use of drones and how their use is regulated and *if* these regulations are implemented. The episode was called Mechanical Birds. It discovers the history of regulations and how their use has changed over the years. It also speaks about the illegal use of drones during protests (more on this, [**here**](https://internetfreedom.in/its-a-bird-its-a-plane-oh-no-its-a-surveillance-drone-we-write-to-the-dgca-to-take-action/)) and how these regulations apply to authorities and if they even need permits in the first place. Listen to the whole episode [**here**](https://www.sunoindia.in/cyber-democracy/mechanical-birds/). As someone who hasn’t studied law, I’m not familiar with a lot of the technical and legal terms that are often thrown around when we discuss these issues. It’s important that people understand what’s exactly at stake so they can fight back and help us fight back. One of the bugs that Karan from the Bugs In Cyberspace episode found in the Indian Gases web API impacted 600 million potential users whose records were stored in the database. ***Tune*** ***in,*** ***today.*** And now, after a series of insightful episodes and discovering things that make you wonder if you heard that right - This season of Cyber Democracy is going to end soon. Podcasts like these help us find newer ways to engage with people and communities. In other words, they have our back when we need it the most. The entire team at IFF is so thankful to have worked with Srinivas Kodali and Suno India on Cyber Democracy and we look can’t wait to see what’s in store for season two. [***Cyber Democracy is available on all streaming platforms*****.**](https://www.sunoindia.in/cyber-democracy/)",
    "light_cleaned_comments": ""
}