{
    "id": "15a89km",
    "title": "India’s Judges Could Suffer the Same Fate as Israel’s",
    "url": "https://www.bloomberg.com/opinion/articles/2023-01-19/india-s-supreme-court-is-under-pressure-just-like-israel-s",
    "selftext": "Israeli parliament just passed the first of many ‘Judicial reforms’ into law yesterday. Is India heading in the same direction?",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1690383836.0,
    "convurl": "https://external-preview.redd.it/0a9pYmSiaWHFxEqUbct6piM6420dCa49y8ARjfJ4oZQ.jpg?auto=webp&s=d01c4439c0baeb39a447af930456669842664ff3",
    "comments": [
        "I'm surprised it didn't happen officially yet. They do have judges in pocket unofficially anyway",
        "Our previous law minister was very critical of the judges, Courts and the whole Collegium process, Its on their list of things but elections are in between.",
        "They will plan accordingly to implement it. They will lose some cases and then will show to their blind followers how the judiciary is against the government and how judiciary is interfering with legislative powers. And when they have spread this propaganda enough they will introduce the bill.",
        "India has a constitution, Israel don't. So the Israel govt can make up literally any law, but Indian govt can, unless they amend it. However even an amendment to our constitution can be struck down if it violates the basic principles."
    ],
    "cleaned_text": "indias judges could suffer fate israels israeli parliament passed first many judicial reforms law yesterday india heading direction ",
    "cleaned_title": "indias judges could suffer fate israels",
    "cleaned_selftext": "israeli parliament passed first many judicial reforms law yesterday india heading direction",
    "cleaned_comments": "im surprised didnt happen officially yet judges pocket unofficially anyway previous law minister critical judges courts whole collegium process list things elections plan accordingly implement lose cases show blind followers judiciary government judiciary interfering legislative powers spread propaganda enough introduce bill india constitution israel dont israel govt make literally law indian govt unless amend however even amendment constitution struck violates basic principles",
    "light_cleaned_title": "India’s Judges Could Suffer the Same Fate as Israel’s",
    "light_cleaned_selftext": "Israeli parliament just passed the first of many ‘Judicial reforms’ into law yesterday. Is India heading in the same direction?",
    "light_cleaned_comments": "I'm surprised it didn't happen officially yet. They do have judges in pocket unofficially anyway Our previous law minister was very critical of the judges, Courts and the whole Collegium process, Its on their list of things but elections are in between. They will plan accordingly to implement it. They will lose some cases and then will show to their blind followers how the judiciary is against the government and how judiciary is interfering with legislative powers. And when they have spread this propaganda enough they will introduce the bill. India has a constitution, Israel don't. So the Israel govt can make up literally any law, but Indian govt can, unless they amend it. However even an amendment to our constitution can be struck down if it violates the basic principles."
}