{
    "id": "156aik0",
    "title": "How bjp does whataboutism with help of media and youtubers",
    "url": "https://www.reddit.com/r/india/comments/156aik0/how_bjp_does_whataboutism_with_help_of_media_and/",
    "selftext": "Recently when manipur incident happened, bjp stooped so low that they started whatboutism.\n\n1) Jodhpur rape - Bjp said that rapes are happening in rajasthan referring to Jodhpur rape . The accused are abvp members and all accused are arrested within three days. But bjp was trying to make issue out of it without mentioning abvp link. Himanta biswa sharma tweeted without mentioning any name. Usually , when it is muslim, he mentions name. Also he didnt mention that all were arrested within three days unlike manipur. \n\n[https://www.ndtv.com/india-news/jodhpur-gang-rape-dalit-minor-gang-raped-boyfriend-assaulted-at-jodhpur-field-4-arrested-4213639](https://www.ndtv.com/india-news/jodhpur-gang-rape-dalit-minor-gang-raped-boyfriend-assaulted-at-jodhpur-field-4-arrested-4213639)\n\n2) Jodhpur murder- In jodhpur , 4 members of family were hacked to death. The main criminal pappu ram has been arrested within 2 days. This was \" property dispute \" and not any rape case or ethnic violence case . Still bjp and youtubers like abhi and niyu tweeted without mentioning that the accused has been arrested and it was \"property dispute\".\n\n[https://www.hindustantimes.com/india-news/19yearold-arrested-for-killing-4-family-members-over-land-dispute-in-jodhpur-bjp-blames-deteriorating-law-and-order-101689792544186.html](https://www.hindustantimes.com/india-news/19yearold-arrested-for-killing-4-family-members-over-land-dispute-in-jodhpur-bjp-blames-deteriorating-law-and-order-101689792544186.html)\n\n3) Bengal fake news- After manipur incident came out , Bjp spread fake news with help of ANI , that bjp woman was paraded naked in bengal . All media anchors tweeted ANI and bjp was spreading that fake news . Bjp  made a poster on it . But later DGP of bengal clarified it is fake news.\n\n[https://english.jagran.com/india/no-such-incident-happened-bengal-dgp-refutes-allegations-of-bjp-candidate-paraded-naked-on-poll-day-10089203](https://english.jagran.com/india/no-such-incident-happened-bengal-dgp-refutes-allegations-of-bjp-candidate-paraded-naked-on-poll-day-10089203)\n\n https://twitter.com/zoo\\_bear/status/1682435788980768768?s=20 \n\n4) Manipur fake news by ANI- ANI spread fake news of muslim being involved in manipur violence. But later it was found that ANI mixed two different news. The person named abdul hilim was a member of PREPAK ( separatist organization demanding for different state) and completely different from the rape case. But ANI said that abdul hilim is responsible for rape. The news was tweeted by bjp IT cell. Later after 12 hours, ANI gives apology and says that they made mistake. Then , they deleted old tweet.\n\n[https://www.altnews.in/manipur-video-misreport-by-ani-sets-off-false-communal-claims-on-social-media-none-of-the-4-arrested-so-far-is-a-muslim/](https://www.altnews.in/manipur-video-misreport-by-ani-sets-off-false-communal-claims-on-social-media-none-of-the-4-arrested-so-far-is-a-muslim/)\n\nNow in Manipur, incident happened in May. No one was arrested till video came out in public. CM is openly saying that 100 incidents like this have happened and was defending delay in arrest . 7 year old boy was burnt alive in ambulance and no one was arrested , but PM didnt speak anything on Manipur. This state was burning since 3 months , but PM only spoke only after video came out.\n\n[https://www.telegraphindia.com/north-east/seven-year-old-boy-mother-relative-burnt-alive-in-ambulance-in-outskirts-of-imphal/cid/1942840](https://www.telegraphindia.com/north-east/seven-year-old-boy-mother-relative-burnt-alive-in-ambulance-in-outskirts-of-imphal/cid/1942840)\n\n[https://www.outlookindia.com/national/manipur-women-paraded-naked-video-100s-of-similar-cases-happened-chief-minister-n-biren-singh-defends-delay-in-arrest-news-304517](https://www.outlookindia.com/national/manipur-women-paraded-naked-video-100s-of-similar-cases-happened-chief-minister-n-biren-singh-defends-delay-in-arrest-news-304517)\n\nThey are not angry for the crime. They are just angry that the video came out in public.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690001605.0,
    "convurl": "https://external-preview.redd.it/9lWbacYUO7r1wZ4CbabATBqkzKAh3moYkj4Hsy0hSRQ.jpg?auto=webp&s=202cb00451baed61ed08a8791454c966b9139e26",
    "comments": [
        "Lol people believing bengal rape is fake coz bengal police which functions under tmc said so. Bunch of hypocrites",
        "u didnt read the article .\" \n\n## The DGP said the police have not received any such complaint from the central forces personnel who were on duty outside polling booths or from a fact-finding team of the BJP that visited the area concerned recently\n\n The bjp fact finding team  and central forces personnel visited bengal but didnt file any complaint at that time",
        "Well if it wasn't fake, the counter point would have come from everywhere. No-one, much less BJP isn't doing that. So it proves that the intent was malicious and was done for distracting us.",
        "Well, the pm himself did whataboutism",
        "I am from Jodhpur and let me correct you, it was not three days, it was less than 3 hours that Jodhpur Police arrested the alleged rapists, in morning  people found the minor girl and her friend they called police, police with their best officers on the case, arrested the culprits within 3 hours, 2 of them jumped the hill to escape but caught. In other case it was family land dispute. BJP still says that government is making ABVP a scapegoat, but those who know, know.",
        "Dekho saari galti Nehru ki hai, aur usne maan bhi li hai.    /s",
        "Abhi and niyu???? Hahahahaaha hahahahaha",
        "Who are they?",
        "Jocks",
        "It's all Nehru's fault /s",
        "It's both ways. No one has guts to accept their failure because no one takes samajseva that seriously. Even if they do, it's for the specific group of people. BJP is good but only for BJP workers and BJP circle, same for congress.",
        "community note added by twitter by tweet still not deleted by rishi bagree. He is followed directly by PM. (see photo attached)\n\n&#x200B;\n\nhttps://preview.redd.it/17n0fdy1ggdb1.png?width=661&format=png&auto=webp&s=bf5671099707305602b77a725f75c0ce390b564b",
        "Not really. The main reason Manipur unnao kathua etc made people angry wasn't just due to crime that happened but because government ignored the crime for a very long time. Comparing these to cases where police and government responded as they should have is like comparing \"being locked in a room and cut every day for weeks\"  and \"being stabbed once and getting treatment immediately afterwards\". Yeah both are bad but one is much worst and people responsible for much worst just wait to look better",
        "Hamare culture me hai, chahe kuch bhi ho lekin apni galti kabhi nahi maanenge. Hamara ego itna chhota hai ki maafi mangne se ghat sakta hai.",
        "Fact finding team lmao",
        "Saari galti Nehru ki kaise ho gayi? Kuch to Mughalon ke liye chor bhai.",
        "Mugal kon??? Aisi koi cheez hai he nhi, chhahe toh history books utha kar dekh le.",
        "Hai kon ei fatherchod Rishi Bagree?",
        "Ah yes centre forces. There are literal videos of booth capturing in bengal elections with crpf outside the booth.",
        "We have a married PM who doesn’t even have the guts to divorce his wife Jashodaben. I am raking this up because it shows the thinking of the person sitting at the most critical position. He hid away his marriage and then for whatever reason the narrative is that he the marriage was not “consummated”. As if claiming to not have had sex increases Modi’s manliness.\n\nIn fact it shows how pervert Modi is. Jashodaben is living a secluded life under the security protection. Can’t even get a [passport](https://www.thequint.com/news/hot-news/jashodaben-files-rti-for-pm-modis-passport-application-details).\n\nModi BJP RSS are all about the show of masculinity and the Manipur mob is just a manifestation of their pervert outlook.",
        "They used to make good videos when they started out, but now they are just spokespersons of the BJP",
        "ret8rds",
        "Nahi bhai mai nahi maanta. Mereko bhatsapp pe aaya tha message. Kuch galti to mughalon ki bhi rahi hi hogi. Aise thode hi na bhatsapp pe aa jata kuch bhi. Arey pura system hota hai bhai. Tumhe nahi pata par jaan jaoge. Number do apna, ek group mein add karta hun.",
        "Congress is just lesser of the two evils is what I'll say",
        "What did dgp say about this? \n\nhttps://twitter.com/sudhir_mish/status/1682596002673627136?s=46&t=sxCX411zWw0W2v30wKmVuQ\n\nhttps://twitter.com/aquibmir71/status/1682616542364831744?s=46&t=sxCX411zWw0W2v30wKmVuQ",
        "Hey, what did they share?",
        "snowflakes here pretending that only bjp does this. All the parties do this and all of them should be called out. That said their handling of Manipur case is a fucking atrocity. At the very minimum, Biren Singh should resign from Manipur asap and they should start calming the populace down instead of this bullshit internet lockdown. shit likes this makes me even less willing to vote for them in the elections but question is who can we even vote for.",
        "i didnt say post poll violence didnt happen. Tmc is full of goons and used same tactics of violence which CPM used to use. But bjp spread fake news that \"women was paraded naked in bengal\". Even the fact finding of bjp didnt file any such complaint.",
        "Lol. Back in 2020 my friend used to live in the same society they lived and sent me their channel, their following was very small at that point, it took me just a  few videos to figure what they are. Maybe reset your moral compass a bit?",
        "Are bhai mai he us group ka admin hu, aur aaj galti sirf aur sirf Nehru ki batani hai, usne mujhe personally bheji hai apology, Edwina ne bhi sign kiya hai, maine letter ka photo bhi dala hai group me. Bhatsapp msg tumse dhang se padhe nhi jaate, aise banoge vishw guru????",
        "They haven't taken out rallies in support of rapists and I wish we didn't live in a world where that was a criteria some groups failed.",
        "Dude I have given a link which shows woman being paraded naked . Watch it before writing useless paragraphs",
        "They are \"proud\" bull shitters and justify every psudo scientific horse crap out there. We all know where that road leads to.",
        "Oh acha acha. Arey sorry sir. Wo lagta hai aapka message miss ho gaya. To aaj Nehru pe hi khali focus karna hai na. Mai apne circle mein phaila deta hun ye baat.\n\n\nHaan bhai log. Aaj sirf Nehru ko zimmedar thehrana hai. Upar se order hai.",
        "Order vorder kuch nhi hota yaar!!! Sirf sach ko sach batana hai. Rastr ko bachana hai toh sabko Nehru ka sach batana hai!!!",
        "lol. do u even know the context of video.\n\n https://twitter.com/RoshanKrRaii/status/1682621655271591937?s=20 \n\n\" According to the West Bengal Police, “The incident happened in Pakua hat area in Malda 3 to 4 days back. Two women were caught in suspicion of theft by local traders. Both women were thrashed by the local female traders. Later both women left or escaped from the area and did not lodge any police complaints”   \n \n\nhow is it related to post poll violence? There is no use debating if u cant be civil and stop spreading fake news",
        "Abbi & Niyu are the split AC variant of Beer Biceps",
        "Haan Sir samajh gaya. Naya naya join kiya hai na. Thoda upar neeche ho jata. \n\nAur sir, ek request hai, wo thoda is baar 2 rupiya advance mil jaata to..... Kaam hum pura karenge. Haan, ei baat hai. Kaam mein koi chori nahi. Jo boliyega karenge. Bus thoda advance de dete du rupaiyya.",
        "I think they knew this manipur story was going to break and thats why they invested in youtubers",
        "Galat..in sbki responsibility Goldie Brar ne le li h",
        "Everyone spreads fake news. Only you are the true beacon of truth, is it not?!",
        "WB should file FIRs",
        ">!Gay!<",
        "neither i am beacon of truth nor did i say everyone spreads fake news. But if i spread fake news and it gets community rated by twitter, i will surely delete it asap. \n\nAnd it is not first time , channels like ANI are spreading fake news. They knowingly did it and give apology after 12 hours. It was fake news itself, which caused rape of the women in manipur. The person below has not deleted his tweet even after getting community rated. He is directly followed by PM.\n\n&#x200B;\n\nhttps://preview.redd.it/4omxext3qgdb1.png?width=661&format=png&auto=webp&s=28c29bb8d00cb133f48c82ee16863558a8ac7bc5",
        "I don't watch a lot of their political videos. Their videos about pseudoscience are what made me see them in a bad light.",
        "How have we gotten to this point ?\n\nSaw an Arnab clip where he brought SP BJP amd AAP spokespersons to discuss MANIPUR, and he was bashing SP, AAP about how they are making this POLITICAL",
        "Are you claiming ANI is being funded by the BJP? Pretty bold!\nYes this dude is based out of kolkata and is associated with the bjp. Do you want me to take up the names of similar accounts working for the INC? \nThe NDA may be in power, but the UPA has social media by the balls.",
        "ANI should be renamed to Apology News India",
        "Very Kartavya Kaal from Modiji.",
        "They don't hold rallies in support of rapists, \nthey give tickets to rape accused, they say 59℅ of rape cases are false when asked about growing rape rates.",
        "They also hold rallies in support of rapists.\n\nhttps://www.indiatoday.in/amp/india/story/kathua-rape-case-2-bjp-ministers-attend-rally-in-support-of-accused-1181788-2018-03-04\n\nhttps://www.news18.com/amp/news/india/unnao-residents-take-out-rally-supporting-rape-accused-bjp-mla-kuldeep-singh-sengar-1726795.html",
        "Omegalul, this guy thinks UPA has the social media by the balls. Goddam I wish I could be this dumb and braindead in real life, life would feel so much more easier. Just crawl back into whatever rock you came out of .",
        "I can't begin to imagine how much Zubair is harassed every minute by teen brained trolls. He has never broken in public. Balls of steel.",
        "Like Gaurav Taneja but without kids.",
        "Listen shit-head, there is no reason for your opinion to hold any significance over my opinion. At best, they are both equal points of view. Think about that, while finding your head out of your ass.",
        "Vote for INDIA.",
        "lmao no, those fuckers are even worse",
        "The last line. This is the only truth.",
        "Awww poor WhatsApp University follower living in his mom's basement for the past 8 years is finally crawling out screaming how the media is in the oppositions hands\n Rofl, keep screaming kiddo. You are dumb and your opinion is just bullshit. What i stated is an actual fact. If the social media was actually in UPAs control, BJP would have already lost a lot more including a no confidence motion moved against the PM already with all the shit that has happened. Braindead bottom dweller talking out of his ass, rofl. So much fun to see.",
        "BJP is the one currently doing this.\n\nYou're in an abusive relationship with your government who has convinced you that there is no alternative. \n\n> question is who can we even vote for.\n\nAnswer: A party that stands against the BJP. \n\nYou don't need a politician to agree with your every stance or be the perfect candidate. You need them to be better than the alternative. \n\nYou can easily choose between eating horseradish (a root vegetable you don't like the taste of) and eating horseshit (actual equine fecal matter.)\n\nOne is objectively better than the other. You won't lose face if you admit to having logical thought.",
        "Not only that whenever people questions the media saying they are biased, acts like chamchas bjp twitterattis often asks what about media in Bengal? Let me tell you i am from Bengal, i read one of the oldest newspaper in country\"anadabazar patrika\" regularly, telegraphs big brother.it criticised bengal govt ruthlessly during bengal violence, almost 3 pages out of 10 for 5-10 days regularly.just like this manipur incident.i dont like this tmc govt for its policies..but man bengali news channels have spine!",
        "They live somewhere in andheri west mumbai \n\nSeen them recording propaganda irl",
        "as of now mostly media / social media inful. funded hai \n\nkon funding kar raha hai pata nahi /s",
        "*Jokers is a more suitable word.",
        "They work on the principle of finding similar cases in opposition states.",
        "If everything fails, they try to establish BJP is lesser of the evils or discredit all political parties and process. It is a common tactic among fascists to spread that democracy isn’t working so undecided people stay out of elections and very dedicated bigots keep voting to bring fascists back to power.",
        "Udta Darinda..",
        "the real question is which party is better? Congress have amply proved they are incompetent morons stunk high with nepotism. Kejriwal is a slimy hypocrite. if Didi were allowed to be in rule the whole country will descend into anarchy. Just look at the West Bengal elections.\n\nNow you want all of these fuckers to be in a team together? are you kidding me? they will be even worse together. I am against Gatbandhans from the start anyways. it looks good on paper but in India it does more damage than any good things. those idiots will keep fighting with each other in a Gatbandhan, each party wanting more benefits for themselves with differing agendas so even if one party wanted to benefit us, the others would simply refuse to agree to it on principle. And in the end it's us the common people who suffer the must\n\nI am not losing any face by speaking logically. it's you people who would rather support these fuckers when they have amply proved just how much bullshit they can shovel down our throats. Even BJP isn't better than them my much, they are the same as them but they have atleast done something. it's not picking the best party out of good ones, it's rather choosing the best out of worst",
        "I'm actually glad that many of them now feel the need to be apologetic about their support for the BJP. \n\nNice to know they outwardly feel shame for it even if they're still in too deep to change their stance.",
        "heh, how many examples do you want me to provide along with news articles to prove my point?",
        "also do you even know the meaning of fascism?",
        ">I am not losing any face by speaking logically\n\nThat is correct. You're losing face by speaking like an idiot.\n\n>BJP isn't better than them my much, they are the same as them but they have atleast done something.\n\nRight again. So what if they've mismanaged everything about the country? At least they've made sure that Indian minorities are murdered, raped, discriminated against, generally endangered and relegated to second class residents for electoral gains.\n\nI see where you're coming from. Sorry I thought you had half a brain.",
        "Was talking about Congress\nCongress directly gives tickets",
        "That's the exact reason I don't buy whatever bullshit they try to peddle.",
        "More like sewage version of the commode.",
        "Ye sab lib*andu logo ka failaya hua propaganda hai, hum kisi ko 1 rupaiyaa bhi nhi dete. Hum sirf or sirf vishudh chutiyon k talant ka use krte hai.",
        "Nhi yaar, pehle Goldie bhai ne bola tha k wo lenge responsibility, par fir Mauji ji me aa kar statement de diya k politics nhi karni aur dusri country ka naam nhi lena hai to fir wo piche hatt gaye. Ab zimmedari Nehru ji ko di gayi hai.",
        "Just came across an Instagram page which was making the Manipur story Sound like the locals (Meitei) and the illegal outsiders (Myanmar Bangladesh etc) clearly overlooking the long standing tribal dispute.",
        "Recently Mohak has also started making center-right opinions. Reported the wrong 30min collision on the Odisha train story. Uses half truths like disparaging Gandhi at opportune times to benefit bhakts.",
        "sham sharma show also falls under this",
        "Recently Mohak has also started making center-right opinions. Reported the wrong 30min collision on the Odisha train story. Uses half truths like disparaging Gandhi at opportune times to benefit bhakts.",
        "Desperation, when everyone else is making big you just stop caring about the means.",
        "\"You Couldn't Live with Your Own Failure, Where Did that Bring You? Back to Me\"",
        "You destroyed that user. \n\nBJP has brainwashed people. People don't even fact check.",
        "I agree that mohak started to appease the right-wing viewers slightly. But Gandhi video was true too. Dude wrote them all in his autobiography. Come on.",
        "I didn't say Gandhi piece was a lie, he requoted what Ambedkar said in his BBC interview. I have the same complaints on Gandhi too, but his timing does not benefit leftists or Ambedkarites, instead benefits bhakts who will quote any comment to discredit Nehru, Gandhi and Ambedkar in that order.",
        "Mughal Nehru sab ka sab same hai. His name was Jawahar Khan Nehru. To fool Hindus and rule India, his family replaced Khan with lal. /s\n\n\nFor some reason, I think if we send this in pro-right wing groups and Twitter, this will actually become viral and andhbhakts will accept it as a fact.",
        "We the citizens need to organize a silent blackout protest. On Sunday at 9:00 PM let’s shutdown all the lights in our houses and businesses \n\nI know it is symbolic but we have a PM who is into symbols",
        "That's 100% bigotry. I'm a Hindu and I myself feel unsafe if I see their sub.",
        "ANI - Amit and Narendra Institute of Fake News",
        "What a sad world we live in.",
        "I am currently watching web series Scoop.\nReal nice crime journalist story. Based in 2011 Mumbai.\n\nThere is a part where the main protagonist wants to run a story without getting the on record statement, her editor denies it and she becomes upset.\nAfter a day, a rival newspaper breaks the story without getting the statement from the concerned person.\n\n2 days later it is found that the concerned person was lying. This leads to the firing of the reporter who is working in rival newspaper company.\n\nThe protagonist thanks her editor for not going forward with the half baked story.\n\n\nThat simple 10 minute sequence showed how important fact checking is for news media outlet. People not only just lose their job, there are also defamation and criminal charges for spreading fake news.\n\n\nToday's media outlet should learn something from this.\n\nThere should be a class on fake news in the journalism college.",
        "What I don't understand about these excuses is that how do  bhakts think these absolve Modi-Shah from responsibility.\n\nIf it is a cross border issue, it is central govt failure.\n\nIf it is illegal immigrant issue again it is a central govt failure, they have been in power for 9 years.\n\nAnyway you see it, it is a failure of Modi-Shah.",
        "Start reporting channels for fake news. Youtube can remove monetization and listings.",
        "Don't forget Snoopgate where Mod \"Saheb\"i had a woman \"Madhuri\" put on surviellance by Shai. The state machinery was put to use to invade the privacy of a citizen. Shah’s apparent interest in the men Madhuri met, and whether she was alone or with a man when she checked into a hotel were told in real time to Shah who would in turn would relay it to ‘Saheb’.",
        "‘Paroud’",
        "The whole 2014 campaign about Gujrat model, Modi's image, photoshopped images of Gujarat are all fake. Faking is the foundation of this party",
        "Bataiyye. Ei to naya khulasa hua. Humko maloome nahi tha. Kitna kuch chupaya gaya hai hum logon se history mein.",
        "Most of India are experts at whataboutery. It reeks sometimes.",
        "Mohak is unbiased and doesnt spreads extreme left/right agenda like Dhruv/Sham Sharma",
        "Lets not pretend that Zubair doesnt even have an agenda. But atleast he doesnt spread fake news.",
        "And the new Twitter algorithm sucks previously i used to get tweets related to my interest only now i get all the it cells tweets",
        "The protagonist was arrested on shady grounds and made to suffer in jail. That's what happens when citizens don't demand strong free-speech laws.",
        "The situation is due to Nehru and Mughals collab, and their hidden agenda to bring disrepute in the western world.",
        "I was honestly disappointed by Mohak. Always thought of him as rational, but now it seems he just follows trends. Stopped following him.\n\nPeople here hate Dhruv Rathee , but I want to applaud him that he actually kept his spine straight despite all the hate he receives.",
        "I always gets suprised when people talk about our local media. Bengali media has ALWAYS criticised the government, whether it's CPM/TMC and shows all the news of violence happening.",
        "Yea basically this",
        "Chutad sharma show\nGaurav pakistani arya\nFlying tatti \nLodu biceps \nSanghi and niyu \n\nJust a few of the churad sanghis"
    ],
    "cleaned_text": "bjp whataboutism help media youtubers recently manipur incident happened bjp stooped low started whatboutism jodhpur rape bjp said rapes happening rajasthan referring jodhpur rape accused abvp members accused arrested within three days bjp trying make issue without mentioning abvp link himanta biswa sharma tweeted without mentioning name usually muslim mentions name also didnt mention arrested within three days unlike manipur httpswwwndtvcomindianewsjodhpurgangrapedalitminorgangrapedboyfriendassaultedatjodhpurfieldarrestedhttpswwwndtvcomindianewsjodhpurgangrapedalitminorgangrapedboyfriendassaultedatjodhpurfieldarrested jodhpur murder jodhpur members family hacked death main criminal pappu ram arrested within days property dispute rape case ethnic violence case still bjp youtubers like abhi niyu tweeted without mentioning accused arrested property dispute httpswwwhindustantimescomindianewsyearoldarrestedforkillingfamilymembersoverlanddisputeinjodhpurbjpblamesdeterioratinglawandorderhtmlhttpswwwhindustantimescomindianewsyearoldarrestedforkillingfamilymembersoverlanddisputeinjodhpurbjpblamesdeterioratinglawandorderhtml bengal fake news manipur incident came bjp spread fake news help ani bjp woman paraded naked bengal media anchors tweeted ani bjp spreading fake news bjp made poster later dgp bengal clarified fake news httpsenglishjagrancomindianosuchincidenthappenedbengaldgprefutesallegationsofbjpcandidateparadednakedonpolldayhttpsenglishjagrancomindianosuchincidenthappenedbengaldgprefutesallegationsofbjpcandidateparadednakedonpollday manipur fake news ani ani spread fake news muslim involved manipur violence later found ani mixed two different news person named abdul hilim member prepak separatist organization demanding different state completely different rape case ani said abdul hilim responsible rape news tweeted bjp cell later hours ani gives apology says made mistake deleted old tweet httpswwwaltnewsinmanipurvideomisreportbyanisetsofffalsecommunalclaimsonsocialmedianoneofthearrestedsofarisamuslimhttpswwwaltnewsinmanipurvideomisreportbyanisetsofffalsecommunalclaimsonsocialmedianoneofthearrestedsofarisamuslim manipur incident happened may one arrested till video came public cm openly saying incidents like happened defending delay arrest year old boy burnt alive ambulance one arrested pm didnt speak anything manipur state burning since months pm spoke video came httpswwwtelegraphindiacomnortheastsevenyearoldboymotherrelativeburntaliveinambulanceinoutskirtsofimphalcidhttpswwwtelegraphindiacomnortheastsevenyearoldboymotherrelativeburntaliveinambulanceinoutskirtsofimphalcid httpswwwoutlookindiacomnationalmanipurwomenparadednakedvideosofsimilarcaseshappenedchiefministernbirensinghdefendsdelayinarrestnewshttpswwwoutlookindiacomnationalmanipurwomenparadednakedvideosofsimilarcaseshappenedchiefministernbirensinghdefendsdelayinarrestnews angry crime angry video came public ",
    "cleaned_title": "bjp whataboutism help media youtubers",
    "cleaned_selftext": "recently manipur incident happened bjp stooped low started whatboutism jodhpur rape bjp said rapes happening rajasthan referring jodhpur rape accused abvp members accused arrested within three days bjp trying make issue without mentioning abvp link himanta biswa sharma tweeted without mentioning name usually muslim mentions name also didnt mention arrested within three days unlike manipur httpswwwndtvcomindianewsjodhpurgangrapedalitminorgangrapedboyfriendassaultedatjodhpurfieldarrestedhttpswwwndtvcomindianewsjodhpurgangrapedalitminorgangrapedboyfriendassaultedatjodhpurfieldarrested jodhpur murder jodhpur members family hacked death main criminal pappu ram arrested within days property dispute rape case ethnic violence case still bjp youtubers like abhi niyu tweeted without mentioning accused arrested property dispute httpswwwhindustantimescomindianewsyearoldarrestedforkillingfamilymembersoverlanddisputeinjodhpurbjpblamesdeterioratinglawandorderhtmlhttpswwwhindustantimescomindianewsyearoldarrestedforkillingfamilymembersoverlanddisputeinjodhpurbjpblamesdeterioratinglawandorderhtml bengal fake news manipur incident came bjp spread fake news help ani bjp woman paraded naked bengal media anchors tweeted ani bjp spreading fake news bjp made poster later dgp bengal clarified fake news httpsenglishjagrancomindianosuchincidenthappenedbengaldgprefutesallegationsofbjpcandidateparadednakedonpolldayhttpsenglishjagrancomindianosuchincidenthappenedbengaldgprefutesallegationsofbjpcandidateparadednakedonpollday manipur fake news ani ani spread fake news muslim involved manipur violence later found ani mixed two different news person named abdul hilim member prepak separatist organization demanding different state completely different rape case ani said abdul hilim responsible rape news tweeted bjp cell later hours ani gives apology says made mistake deleted old tweet httpswwwaltnewsinmanipurvideomisreportbyanisetsofffalsecommunalclaimsonsocialmedianoneofthearrestedsofarisamuslimhttpswwwaltnewsinmanipurvideomisreportbyanisetsofffalsecommunalclaimsonsocialmedianoneofthearrestedsofarisamuslim manipur incident happened may one arrested till video came public cm openly saying incidents like happened defending delay arrest year old boy burnt alive ambulance one arrested pm didnt speak anything manipur state burning since months pm spoke video came httpswwwtelegraphindiacomnortheastsevenyearoldboymotherrelativeburntaliveinambulanceinoutskirtsofimphalcidhttpswwwtelegraphindiacomnortheastsevenyearoldboymotherrelativeburntaliveinambulanceinoutskirtsofimphalcid httpswwwoutlookindiacomnationalmanipurwomenparadednakedvideosofsimilarcaseshappenedchiefministernbirensinghdefendsdelayinarrestnewshttpswwwoutlookindiacomnationalmanipurwomenparadednakedvideosofsimilarcaseshappenedchiefministernbirensinghdefendsdelayinarrestnews angry crime angry video came public",
    "cleaned_comments": "lol people believing bengal rape fake coz bengal police functions tmc said bunch hypocrites u didnt read article dgp said police received complaint central forces personnel duty outside polling booths factfinding team bjp visited area concerned recently bjp fact finding team central forces personnel visited bengal didnt file complaint time well wasnt fake counter point would come everywhere noone much less bjp isnt proves intent malicious done distracting us well pm whataboutism jodhpur let correct three days less hours jodhpur police arrested alleged rapists morning people found minor girl friend called police police best officers case arrested culprits within hours jumped hill escape caught case family land dispute bjp still says government making abvp scapegoat know know dekho saari galti nehru ki hai aur usne maan bhi li hai abhi niyu hahahahaaha hahahahaha jocks nehrus fault ways one guts accept failure one takes samajseva seriously even specific group people bjp good bjp workers bjp circle congress community note added twitter tweet still deleted rishi bagree followed directly pm see photo attached xb really main reason manipur unnao kathua etc made people angry wasnt due crime happened government ignored crime long time comparing cases police government responded like comparing locked room cut every day weeks stabbed getting treatment immediately afterwards yeah bad one much worst people responsible much worst wait look better hamare culture hai chahe kuch bhi ho lekin apni galti kabhi nahi maanenge hamara ego itna chhota hai ki maafi mangne se ghat sakta hai fact finding team lmao saari galti nehru ki kaise ho gayi kuch mughalon ke liye chor bhai mugal kon aisi koi cheez hai nhi chhahe toh history books utha kar dekh le hai kon ei fatherchod rishi bagree ah yes centre forces literal videos booth capturing bengal elections crpf outside booth married pm doesnt even guts divorce wife jashodaben raking shows thinking person sitting critical position hid away marriage whatever reason narrative marriage consummated claiming sex increases modis manliness fact shows pervert modi jashodaben living secluded life security protection cant even get passporthttpswwwthequintcomnewshotnewsjashodabenfilesrtiforpmmodispassportapplicationdetails modi bjp rss show masculinity manipur mob manifestation pervert outlook used make good videos started spokespersons bjp retrds nahi bhai mai nahi maanta mereko bhatsapp pe aaya tha message kuch galti mughalon ki bhi rahi hi hogi aise thode hi na bhatsapp pe aa jata kuch bhi arey pura system hota hai bhai tumhe nahi pata par jaan jaoge number apna ek group mein add karta hun congress lesser two evils ill say dgp say hey share snowflakes pretending bjp parties called said handling manipur case fucking atrocity minimum biren singh resign manipur asap start calming populace instead bullshit internet lockdown shit likes makes even less willing vote elections question even vote didnt say post poll violence didnt happen tmc full goons used tactics violence cpm used use bjp spread fake news women paraded naked bengal even fact finding bjp didnt file complaint lol back friend used live society lived sent channel following small point took videos figure maybe reset moral compass bit bhai mai us group ka admin hu aur aaj galti sirf aur sirf nehru ki batani hai usne mujhe personally bheji hai apology edwina ne bhi sign kiya hai maine letter ka photo bhi dala hai group bhatsapp msg tumse dhang se padhe nhi jaate aise banoge vishw guru havent taken rallies support rapists wish didnt live world criteria groups failed dude given link shows woman paraded naked watch writing useless paragraphs proud bull shitters justify every psudo scientific horse crap know road leads oh acha acha arey sorry sir wo lagta hai aapka message miss ho gaya aaj nehru pe hi khali focus karna hai na mai apne circle mein phaila deta hun ye baat haan bhai log aaj sirf nehru ko zimmedar thehrana hai upar se order hai order vorder kuch nhi hota yaar sirf sach ko sach batana hai rastr ko bachana hai toh sabko nehru ka sach batana hai lol u even know context video according west bengal police incident happened pakua hat area malda days back two women caught suspicion theft local traders women thrashed local female traders later women left escaped area lodge police complaints related post poll violence use debating u cant civil stop spreading fake news abbi niyu split ac variant beer biceps haan sir samajh gaya naya naya join kiya hai na thoda upar neeche ho jata aur sir ek request hai wo thoda baar rupiya advance mil jaata kaam hum pura karenge haan ei baat hai kaam mein koi chori nahi jo boliyega karenge bus thoda advance de dete du rupaiyya think knew manipur story going break thats invested youtubers galatin sbki responsibility goldie brar ne le li h everyone spreads fake news true beacon truth wb file firs gay neither beacon truth say everyone spreads fake news spread fake news gets community rated twitter surely delete asap first time channels like ani spreading fake news knowingly give apology hours fake news caused rape women manipur person deleted tweet even getting community rated directly followed pm xb dont watch lot political videos videos pseudoscience made see bad light gotten point saw arnab clip brought sp bjp amd aap spokespersons discuss manipur bashing sp aap making political claiming ani funded bjp pretty bold yes dude based kolkata associated bjp want take names similar accounts working inc nda may power upa social media balls ani renamed apology news india kartavya kaal modiji dont hold rallies support rapists give tickets rape accused say rape cases false asked growing rape rates also hold rallies support rapists omegalul guy thinks upa social media balls goddam wish could dumb braindead real life life would feel much easier crawl back whatever rock came cant begin imagine much zubair harassed every minute teen brained trolls never broken public balls steel like gaurav taneja without kids listen shithead reason opinion hold significance opinion best equal points view think finding head ass vote india lmao fuckers even worse last line truth awww poor whatsapp university follower living moms basement past years finally crawling screaming media oppositions hands rofl keep screaming kiddo dumb opinion bullshit stated actual fact social media actually upas control bjp would already lost lot including confidence motion moved pm already shit happened braindead bottom dweller talking ass rofl much fun see bjp one currently youre abusive relationship government convinced alternative question even vote answer party stands bjp dont need politician agree every stance perfect candidate need better alternative easily choose eating horseradish root vegetable dont like taste eating horseshit actual equine fecal matter one objectively better wont lose face admit logical thought whenever people questions media saying biased acts like chamchas bjp twitterattis often asks media bengal let tell bengal read one oldest newspaper countryanadabazar patrika regularly telegraphs big brotherit criticised bengal govt ruthlessly bengal violence almost pages days regularlyjust like manipur incidenti dont like tmc govt policiesbut man bengali news channels spine live somewhere andheri west mumbai seen recording propaganda irl mostly media social media inful funded hai kon funding kar raha hai pata nahi jokers suitable word work principle finding similar cases opposition states everything fails try establish bjp lesser evils discredit political parties process common tactic among fascists spread democracy isnt working undecided people stay elections dedicated bigots keep voting bring fascists back power udta darinda real question party better congress amply proved incompetent morons stunk high nepotism kejriwal slimy hypocrite didi allowed rule whole country descend anarchy look west bengal elections want fuckers team together kidding even worse together gatbandhans start anyways looks good paper india damage good things idiots keep fighting gatbandhan party wanting benefits differing agendas even one party wanted benefit us others would simply refuse agree principle end us common people suffer must losing face speaking logically people would rather support fuckers amply proved much bullshit shovel throats even bjp isnt better much atleast done something picking best party good ones rather choosing best worst im actually glad many feel need apologetic support bjp nice know outwardly feel shame even theyre still deep change stance heh many examples want provide along news articles prove point also even know meaning fascism losing face speaking logically correct youre losing face speaking like idiot bjp isnt better much atleast done something right theyve mismanaged everything country least theyve made sure indian minorities murdered raped discriminated generally endangered relegated second class residents electoral gains see youre coming sorry thought half brain talking congress congress directly gives tickets thats exact reason dont buy whatever bullshit try peddle like sewage version commode ye sab libandu logo ka failaya hua propaganda hai hum kisi ko rupaiyaa bhi nhi dete hum sirf sirf vishudh chutiyon k talant ka use krte hai nhi yaar pehle goldie bhai ne bola tha k wo lenge responsibility par fir mauji ji aa kar statement de diya k politics nhi karni aur dusri country ka naam nhi lena hai fir wo piche hatt gaye ab zimmedari nehru ji ko di gayi hai came across instagram page making manipur story sound like locals meitei illegal outsiders myanmar bangladesh etc clearly overlooking long standing tribal dispute recently mohak also started making centerright opinions reported wrong min collision odisha train story uses half truths like disparaging gandhi opportune times benefit bhakts sham sharma show also falls recently mohak also started making centerright opinions reported wrong min collision odisha train story uses half truths like disparaging gandhi opportune times benefit bhakts desperation everyone else making big stop caring means couldnt live failure bring back destroyed user bjp brainwashed people people dont even fact check agree mohak started appease rightwing viewers slightly gandhi video true dude wrote autobiography come didnt say gandhi piece lie requoted ambedkar said bbc interview complaints gandhi timing benefit leftists ambedkarites instead benefits bhakts quote comment discredit nehru gandhi ambedkar order mughal nehru sab ka sab hai name jawahar khan nehru fool hindus rule india family replaced khan lal reason think send proright wing groups twitter actually become viral andhbhakts accept fact citizens need organize silent blackout protest sunday pm lets shutdown lights houses businesses know symbolic pm symbols thats bigotry im hindu feel unsafe see sub ani amit narendra institute fake news sad world live currently watching web series scoop real nice crime journalist story based mumbai part main protagonist wants run story without getting record statement editor denies becomes upset day rival newspaper breaks story without getting statement concerned person days later found concerned person lying leads firing reporter working rival newspaper company protagonist thanks editor going forward half baked story simple minute sequence showed important fact checking news media outlet people lose job also defamation criminal charges spreading fake news todays media outlet learn something class fake news journalism college dont understand excuses bhakts think absolve modishah responsibility cross border issue central govt failure illegal immigrant issue central govt failure power years anyway see failure modishah start reporting channels fake news youtube remove monetization listings dont forget snoopgate mod sahebi woman madhuri put surviellance shai state machinery put use invade privacy citizen shahs apparent interest men madhuri met whether alone man checked hotel told real time shah would turn would relay saheb paroud whole campaign gujrat model modis image photoshopped images gujarat fake faking foundation party bataiyye ei naya khulasa hua humko maloome nahi tha kitna kuch chupaya gaya hai hum logon se history mein india experts whataboutery reeks sometimes mohak unbiased doesnt spreads extreme leftright agenda like dhruvsham sharma lets pretend zubair doesnt even agenda atleast doesnt spread fake news new twitter algorithm sucks previously used get tweets related interest get cells tweets protagonist arrested shady grounds made suffer jail thats happens citizens dont demand strong freespeech laws situation due nehru mughals collab hidden agenda bring disrepute western world honestly disappointed mohak always thought rational seems follows trends stopped following people hate dhruv rathee want applaud actually kept spine straight despite hate receives always gets suprised people talk local media bengali media always criticised government whether cpmtmc shows news violence happening yea basically chutad sharma show gaurav pakistani arya flying tatti lodu biceps sanghi niyu churad sanghis",
    "light_cleaned_title": "How bjp does whataboutism with help of media and youtubers",
    "light_cleaned_selftext": "Recently when manipur incident happened, bjp stooped so low that they started whatboutism. 1) Jodhpur rape - Bjp said that rapes are happening in rajasthan referring to Jodhpur rape . The accused are abvp members and all accused are arrested within three days. But bjp was trying to make issue out of it without mentioning abvp link. Himanta biswa sharma tweeted without mentioning any name. Usually , when it is muslim, he mentions name. Also he didnt mention that all were arrested within three days unlike manipur. [https://www.ndtv.com/india-news/jodhpur-gang-rape-dalit-minor-gang-raped-boyfriend-assaulted-at-jodhpur-field-4-arrested-4213639](https://www.ndtv.com/india-news/jodhpur-gang-rape-dalit-minor-gang-raped-boyfriend-assaulted-at-jodhpur-field-4-arrested-4213639) 2) Jodhpur murder- In jodhpur , 4 members of family were hacked to death. The main criminal pappu ram has been arrested within 2 days. This was \" property dispute \" and not any rape case or ethnic violence case . Still bjp and youtubers like abhi and niyu tweeted without mentioning that the accused has been arrested and it was \"property dispute\". [https://www.hindustantimes.com/india-news/19yearold-arrested-for-killing-4-family-members-over-land-dispute-in-jodhpur-bjp-blames-deteriorating-law-and-order-101689792544186.html](https://www.hindustantimes.com/india-news/19yearold-arrested-for-killing-4-family-members-over-land-dispute-in-jodhpur-bjp-blames-deteriorating-law-and-order-101689792544186.html) 3) Bengal fake news- After manipur incident came out , Bjp spread fake news with help of ANI , that bjp woman was paraded naked in bengal . All media anchors tweeted ANI and bjp was spreading that fake news . Bjp made a poster on it . But later DGP of bengal clarified it is fake news. [https://english.jagran.com/india/no-such-incident-happened-bengal-dgp-refutes-allegations-of-bjp-candidate-paraded-naked-on-poll-day-10089203](https://english.jagran.com/india/no-such-incident-happened-bengal-dgp-refutes-allegations-of-bjp-candidate-paraded-naked-on-poll-day-10089203) 4) Manipur fake news by ANI- ANI spread fake news of muslim being involved in manipur violence. But later it was found that ANI mixed two different news. The person named abdul hilim was a member of PREPAK ( separatist organization demanding for different state) and completely different from the rape case. But ANI said that abdul hilim is responsible for rape. The news was tweeted by bjp IT cell. Later after 12 hours, ANI gives apology and says that they made mistake. Then , they deleted old tweet. [https://www.altnews.in/manipur-video-misreport-by-ani-sets-off-false-communal-claims-on-social-media-none-of-the-4-arrested-so-far-is-a-muslim/](https://www.altnews.in/manipur-video-misreport-by-ani-sets-off-false-communal-claims-on-social-media-none-of-the-4-arrested-so-far-is-a-muslim/) Now in Manipur, incident happened in May. No one was arrested till video came out in public. CM is openly saying that 100 incidents like this have happened and was defending delay in arrest . 7 year old boy was burnt alive in ambulance and no one was arrested , but PM didnt speak anything on Manipur. This state was burning since 3 months , but PM only spoke only after video came out. [https://www.telegraphindia.com/north-east/seven-year-old-boy-mother-relative-burnt-alive-in-ambulance-in-outskirts-of-imphal/cid/1942840](https://www.telegraphindia.com/north-east/seven-year-old-boy-mother-relative-burnt-alive-in-ambulance-in-outskirts-of-imphal/cid/1942840) [https://www.outlookindia.com/national/manipur-women-paraded-naked-video-100s-of-similar-cases-happened-chief-minister-n-biren-singh-defends-delay-in-arrest-news-304517](https://www.outlookindia.com/national/manipur-women-paraded-naked-video-100s-of-similar-cases-happened-chief-minister-n-biren-singh-defends-delay-in-arrest-news-304517) They are not angry for the crime. They are just angry that the video came out in public.",
    "light_cleaned_comments": "Lol people believing bengal rape is fake coz bengal police which functions under tmc said so. Bunch of hypocrites u didnt read the article .\" ## The DGP said the police have not received any such complaint from the central forces personnel who were on duty outside polling booths or from a fact-finding team of the BJP that visited the area concerned recently The bjp fact finding team and central forces personnel visited bengal but didnt file any complaint at that time Well if it wasn't fake, the counter point would have come from everywhere. No-one, much less BJP isn't doing that. So it proves that the intent was malicious and was done for distracting us. Well, the pm himself did whataboutism I am from Jodhpur and let me correct you, it was not three days, it was less than 3 hours that Jodhpur Police arrested the alleged rapists, in morning people found the minor girl and her friend they called police, police with their best officers on the case, arrested the culprits within 3 hours, 2 of them jumped the hill to escape but caught. In other case it was family land dispute. BJP still says that government is making ABVP a scapegoat, but those who know, know. Dekho saari galti Nehru ki hai, aur usne maan bhi li hai. /s Abhi and niyu???? Hahahahaaha hahahahaha Who are they? Jocks It's all Nehru's fault /s It's both ways. No one has guts to accept their failure because no one takes samajseva that seriously. Even if they do, it's for the specific group of people. BJP is good but only for BJP workers and BJP circle, same for congress. community note added by twitter by tweet still not deleted by rishi bagree. He is followed directly by PM. (see photo attached) &#x200B; Not really. The main reason Manipur unnao kathua etc made people angry wasn't just due to crime that happened but because government ignored the crime for a very long time. Comparing these to cases where police and government responded as they should have is like comparing \"being locked in a room and cut every day for weeks\" and \"being stabbed once and getting treatment immediately afterwards\". Yeah both are bad but one is much worst and people responsible for much worst just wait to look better Hamare culture me hai, chahe kuch bhi ho lekin apni galti kabhi nahi maanenge. Hamara ego itna chhota hai ki maafi mangne se ghat sakta hai. Fact finding team lmao Saari galti Nehru ki kaise ho gayi? Kuch to Mughalon ke liye chor bhai. Mugal kon??? Aisi koi cheez hai he nhi, chhahe toh history books utha kar dekh le. Hai kon ei fatherchod Rishi Bagree? Ah yes centre forces. There are literal videos of booth capturing in bengal elections with crpf outside the booth. We have a married PM who doesn’t even have the guts to divorce his wife Jashodaben. I am raking this up because it shows the thinking of the person sitting at the most critical position. He hid away his marriage and then for whatever reason the narrative is that he the marriage was not “consummated”. As if claiming to not have had sex increases Modi’s manliness. In fact it shows how pervert Modi is. Jashodaben is living a secluded life under the security protection. Can’t even get a [passport](https://www.thequint.com/news/hot-news/jashodaben-files-rti-for-pm-modis-passport-application-details). Modi BJP RSS are all about the show of masculinity and the Manipur mob is just a manifestation of their pervert outlook. They used to make good videos when they started out, but now they are just spokespersons of the BJP ret8rds Nahi bhai mai nahi maanta. Mereko bhatsapp pe aaya tha message. Kuch galti to mughalon ki bhi rahi hi hogi. Aise thode hi na bhatsapp pe aa jata kuch bhi. Arey pura system hota hai bhai. Tumhe nahi pata par jaan jaoge. Number do apna, ek group mein add karta hun. Congress is just lesser of the two evils is what I'll say What did dgp say about this? Hey, what did they share? snowflakes here pretending that only bjp does this. All the parties do this and all of them should be called out. That said their handling of Manipur case is a fucking atrocity. At the very minimum, Biren Singh should resign from Manipur asap and they should start calming the populace down instead of this bullshit internet lockdown. shit likes this makes me even less willing to vote for them in the elections but question is who can we even vote for. i didnt say post poll violence didnt happen. Tmc is full of goons and used same tactics of violence which CPM used to use. But bjp spread fake news that \"women was paraded naked in bengal\". Even the fact finding of bjp didnt file any such complaint. Lol. Back in 2020 my friend used to live in the same society they lived and sent me their channel, their following was very small at that point, it took me just a few videos to figure what they are. Maybe reset your moral compass a bit? Are bhai mai he us group ka admin hu, aur aaj galti sirf aur sirf Nehru ki batani hai, usne mujhe personally bheji hai apology, Edwina ne bhi sign kiya hai, maine letter ka photo bhi dala hai group me. Bhatsapp msg tumse dhang se padhe nhi jaate, aise banoge vishw guru???? They haven't taken out rallies in support of rapists and I wish we didn't live in a world where that was a criteria some groups failed. Dude I have given a link which shows woman being paraded naked . Watch it before writing useless paragraphs They are \"proud\" bull shitters and justify every psudo scientific horse crap out there. We all know where that road leads to. Oh acha acha. Arey sorry sir. Wo lagta hai aapka message miss ho gaya. To aaj Nehru pe hi khali focus karna hai na. Mai apne circle mein phaila deta hun ye baat. Haan bhai log. Aaj sirf Nehru ko zimmedar thehrana hai. Upar se order hai. Order vorder kuch nhi hota yaar!!! Sirf sach ko sach batana hai. Rastr ko bachana hai toh sabko Nehru ka sach batana hai!!! lol. do u even know the context of video. \" According to the West Bengal Police, “The incident happened in Pakua hat area in Malda 3 to 4 days back. Two women were caught in suspicion of theft by local traders. Both women were thrashed by the local female traders. Later both women left or escaped from the area and did not lodge any police complaints” how is it related to post poll violence? There is no use debating if u cant be civil and stop spreading fake news Abbi & Niyu are the split AC variant of Beer Biceps Haan Sir samajh gaya. Naya naya join kiya hai na. Thoda upar neeche ho jata. Aur sir, ek request hai, wo thoda is baar 2 rupiya advance mil jaata to..... Kaam hum pura karenge. Haan, ei baat hai. Kaam mein koi chori nahi. Jo boliyega karenge. Bus thoda advance de dete du rupaiyya. I think they knew this manipur story was going to break and thats why they invested in youtubers Galat..in sbki responsibility Goldie Brar ne le li h Everyone spreads fake news. Only you are the true beacon of truth, is it not?! WB should file FIRs >!Gay!< neither i am beacon of truth nor did i say everyone spreads fake news. But if i spread fake news and it gets community rated by twitter, i will surely delete it asap. And it is not first time , channels like ANI are spreading fake news. They knowingly did it and give apology after 12 hours. It was fake news itself, which caused rape of the women in manipur. The person below has not deleted his tweet even after getting community rated. He is directly followed by PM. &#x200B; I don't watch a lot of their political videos. Their videos about pseudoscience are what made me see them in a bad light. How have we gotten to this point ? Saw an Arnab clip where he brought SP BJP amd AAP spokespersons to discuss MANIPUR, and he was bashing SP, AAP about how they are making this POLITICAL Are you claiming ANI is being funded by the BJP? Pretty bold! Yes this dude is based out of kolkata and is associated with the bjp. Do you want me to take up the names of similar accounts working for the INC? The NDA may be in power, but the UPA has social media by the balls. ANI should be renamed to Apology News India Very Kartavya Kaal from Modiji. They don't hold rallies in support of rapists, they give tickets to rape accused, they say 59℅ of rape cases are false when asked about growing rape rates. They also hold rallies in support of rapists. Omegalul, this guy thinks UPA has the social media by the balls. Goddam I wish I could be this dumb and braindead in real life, life would feel so much more easier. Just crawl back into whatever rock you came out of . I can't begin to imagine how much Zubair is harassed every minute by teen brained trolls. He has never broken in public. Balls of steel. Like Gaurav Taneja but without kids. Listen shit-head, there is no reason for your opinion to hold any significance over my opinion. At best, they are both equal points of view. Think about that, while finding your head out of your ass. Vote for INDIA. lmao no, those fuckers are even worse The last line. This is the only truth. Awww poor WhatsApp University follower living in his mom's basement for the past 8 years is finally crawling out screaming how the media is in the oppositions hands Rofl, keep screaming kiddo. You are dumb and your opinion is just bullshit. What i stated is an actual fact. If the social media was actually in UPAs control, BJP would have already lost a lot more including a no confidence motion moved against the PM already with all the shit that has happened. Braindead bottom dweller talking out of his ass, rofl. So much fun to see. BJP is the one currently doing this. You're in an abusive relationship with your government who has convinced you that there is no alternative. > question is who can we even vote for. Answer: A party that stands against the BJP. You don't need a politician to agree with your every stance or be the perfect candidate. You need them to be better than the alternative. You can easily choose between eating horseradish (a root vegetable you don't like the taste of) and eating horseshit (actual equine fecal matter.) One is objectively better than the other. You won't lose face if you admit to having logical thought. Not only that whenever people questions the media saying they are biased, acts like chamchas bjp twitterattis often asks what about media in Bengal? Let me tell you i am from Bengal, i read one of the oldest newspaper in country\"anadabazar patrika\" regularly, telegraphs big brother.it criticised bengal govt ruthlessly during bengal violence, almost 3 pages out of 10 for 5-10 days regularly.just like this manipur incident.i dont like this tmc govt for its policies..but man bengali news channels have spine! They live somewhere in andheri west mumbai Seen them recording propaganda irl as of now mostly media / social media inful. funded hai kon funding kar raha hai pata nahi /s *Jokers is a more suitable word. They work on the principle of finding similar cases in opposition states. If everything fails, they try to establish BJP is lesser of the evils or discredit all political parties and process. It is a common tactic among fascists to spread that democracy isn’t working so undecided people stay out of elections and very dedicated bigots keep voting to bring fascists back to power. Udta Darinda.. the real question is which party is better? Congress have amply proved they are incompetent morons stunk high with nepotism. Kejriwal is a slimy hypocrite. if Didi were allowed to be in rule the whole country will descend into anarchy. Just look at the West Bengal elections. Now you want all of these fuckers to be in a team together? are you kidding me? they will be even worse together. I am against Gatbandhans from the start anyways. it looks good on paper but in India it does more damage than any good things. those idiots will keep fighting with each other in a Gatbandhan, each party wanting more benefits for themselves with differing agendas so even if one party wanted to benefit us, the others would simply refuse to agree to it on principle. And in the end it's us the common people who suffer the must I am not losing any face by speaking logically. it's you people who would rather support these fuckers when they have amply proved just how much bullshit they can shovel down our throats. Even BJP isn't better than them my much, they are the same as them but they have atleast done something. it's not picking the best party out of good ones, it's rather choosing the best out of worst I'm actually glad that many of them now feel the need to be apologetic about their support for the BJP. Nice to know they outwardly feel shame for it even if they're still in too deep to change their stance. heh, how many examples do you want me to provide along with news articles to prove my point? also do you even know the meaning of fascism? >I am not losing any face by speaking logically That is correct. You're losing face by speaking like an idiot. >BJP isn't better than them my much, they are the same as them but they have atleast done something. Right again. So what if they've mismanaged everything about the country? At least they've made sure that Indian minorities are murdered, raped, discriminated against, generally endangered and relegated to second class residents for electoral gains. I see where you're coming from. Sorry I thought you had half a brain. Was talking about Congress Congress directly gives tickets That's the exact reason I don't buy whatever bullshit they try to peddle. More like sewage version of the commode. Ye sab lib*andu logo ka failaya hua propaganda hai, hum kisi ko 1 rupaiyaa bhi nhi dete. Hum sirf or sirf vishudh chutiyon k talant ka use krte hai. Nhi yaar, pehle Goldie bhai ne bola tha k wo lenge responsibility, par fir Mauji ji me aa kar statement de diya k politics nhi karni aur dusri country ka naam nhi lena hai to fir wo piche hatt gaye. Ab zimmedari Nehru ji ko di gayi hai. Just came across an Instagram page which was making the Manipur story Sound like the locals (Meitei) and the illegal outsiders (Myanmar Bangladesh etc) clearly overlooking the long standing tribal dispute. Recently Mohak has also started making center-right opinions. Reported the wrong 30min collision on the Odisha train story. Uses half truths like disparaging Gandhi at opportune times to benefit bhakts. sham sharma show also falls under this Recently Mohak has also started making center-right opinions. Reported the wrong 30min collision on the Odisha train story. Uses half truths like disparaging Gandhi at opportune times to benefit bhakts. Desperation, when everyone else is making big you just stop caring about the means. \"You Couldn't Live with Your Own Failure, Where Did that Bring You? Back to Me\" You destroyed that user. BJP has brainwashed people. People don't even fact check. I agree that mohak started to appease the right-wing viewers slightly. But Gandhi video was true too. Dude wrote them all in his autobiography. Come on. I didn't say Gandhi piece was a lie, he requoted what Ambedkar said in his BBC interview. I have the same complaints on Gandhi too, but his timing does not benefit leftists or Ambedkarites, instead benefits bhakts who will quote any comment to discredit Nehru, Gandhi and Ambedkar in that order. Mughal Nehru sab ka sab same hai. His name was Jawahar Khan Nehru. To fool Hindus and rule India, his family replaced Khan with lal. /s For some reason, I think if we send this in pro-right wing groups and Twitter, this will actually become viral and andhbhakts will accept it as a fact. We the citizens need to organize a silent blackout protest. On Sunday at 9:00 PM let’s shutdown all the lights in our houses and businesses I know it is symbolic but we have a PM who is into symbols That's 100% bigotry. I'm a Hindu and I myself feel unsafe if I see their sub. ANI - Amit and Narendra Institute of Fake News What a sad world we live in. I am currently watching web series Scoop. Real nice crime journalist story. Based in 2011 Mumbai. There is a part where the main protagonist wants to run a story without getting the on record statement, her editor denies it and she becomes upset. After a day, a rival newspaper breaks the story without getting the statement from the concerned person. 2 days later it is found that the concerned person was lying. This leads to the firing of the reporter who is working in rival newspaper company. The protagonist thanks her editor for not going forward with the half baked story. That simple 10 minute sequence showed how important fact checking is for news media outlet. People not only just lose their job, there are also defamation and criminal charges for spreading fake news. Today's media outlet should learn something from this. There should be a class on fake news in the journalism college. What I don't understand about these excuses is that how do bhakts think these absolve Modi-Shah from responsibility. If it is a cross border issue, it is central govt failure. If it is illegal immigrant issue again it is a central govt failure, they have been in power for 9 years. Anyway you see it, it is a failure of Modi-Shah. Start reporting channels for fake news. Youtube can remove monetization and listings. Don't forget Snoopgate where Mod \"Saheb\"i had a woman \"Madhuri\" put on surviellance by Shai. The state machinery was put to use to invade the privacy of a citizen. Shah’s apparent interest in the men Madhuri met, and whether she was alone or with a man when she checked into a hotel were told in real time to Shah who would in turn would relay it to ‘Saheb’. ‘Paroud’ The whole 2014 campaign about Gujrat model, Modi's image, photoshopped images of Gujarat are all fake. Faking is the foundation of this party Bataiyye. Ei to naya khulasa hua. Humko maloome nahi tha. Kitna kuch chupaya gaya hai hum logon se history mein. Most of India are experts at whataboutery. It reeks sometimes. Mohak is unbiased and doesnt spreads extreme left/right agenda like Dhruv/Sham Sharma Lets not pretend that Zubair doesnt even have an agenda. But atleast he doesnt spread fake news. And the new Twitter algorithm sucks previously i used to get tweets related to my interest only now i get all the it cells tweets The protagonist was arrested on shady grounds and made to suffer in jail. That's what happens when citizens don't demand strong free-speech laws. The situation is due to Nehru and Mughals collab, and their hidden agenda to bring disrepute in the western world. I was honestly disappointed by Mohak. Always thought of him as rational, but now it seems he just follows trends. Stopped following him. People here hate Dhruv Rathee , but I want to applaud him that he actually kept his spine straight despite all the hate he receives. I always gets suprised when people talk about our local media. Bengali media has ALWAYS criticised the government, whether it's CPM/TMC and shows all the news of violence happening. Yea basically this Chutad sharma show Gaurav pakistani arya Flying tatti Lodu biceps Sanghi and niyu Just a few of the churad sanghis"
}