{
    "id": "1ei7gsh",
    "title": "Humtree Honey Shop, delivering pain and depression in place of honey. ",
    "url": "https://www.reddit.com/gallery/1ei7gsh",
    "selftext": "Hello everyone,  So after reading and researching through various reddit posts in hunt of buying decent honey i locked on to this humtree.shop website. \n\nThe website is broken, but still managed to make the order. The login is not working and upon resetting the password it throws an error saying no user found with that name. \n\nThe payment have to be manually sent on a upi id and that screenshot needs to be submitted on the website for verification, first of a kind encounter. \n\n\nStill proceeded given the reviews, well today after many delays and chasing the courier for own order. Got to know that the order has been cancelled by the client on 1st Aug 9:44am and is bound to return to origin. \n\nThier insta handle is not giving any reply on the this matter for the same. Mailed them as well on hello.humtree.shop. \n\nAttaching the screenshots for more details. \n\nRant over. \n\nNeed delays and headaches, please do consider them for your order. \n\nThank you.\n",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1722597503.0,
    "convurl": "https://i.redd.it/djdwxxvri8gd1.jpg",
    "comments": [
        "I crossed checked. All the personal information are hidden, no hospitals are shown."
    ],
    "cleaned_text": "humtree honey shop delivering pain depression place honey hello everyone reading researching various reddit posts hunt buying decent honey locked humtreeshop website website broken still managed make order login working upon resetting password throws error saying user found name payment manually sent upi id screenshot needs submitted website verification first kind encounter still proceeded given reviews well today many delays chasing courier order got know order cancelled client st aug bound return origin thier insta handle giving reply matter mailed well hellohumtreeshop attaching screenshots details rant need delays headaches please consider order thank ",
    "cleaned_title": "humtree honey shop delivering pain depression place honey",
    "cleaned_selftext": "hello everyone reading researching various reddit posts hunt buying decent honey locked humtreeshop website website broken still managed make order login working upon resetting password throws error saying user found name payment manually sent upi id screenshot needs submitted website verification first kind encounter still proceeded given reviews well today many delays chasing courier order got know order cancelled client st aug bound return origin thier insta handle giving reply matter mailed well hellohumtreeshop attaching screenshots details rant need delays headaches please consider order thank",
    "cleaned_comments": "crossed checked personal information hidden hospitals shown",
    "light_cleaned_title": "Humtree Honey Shop, delivering pain and depression in place of honey.",
    "light_cleaned_selftext": "Hello everyone, So after reading and researching through various reddit posts in hunt of buying decent honey i locked on to this humtree.shop website. The website is broken, but still managed to make the order. The login is not working and upon resetting the password it throws an error saying no user found with that name. The payment have to be manually sent on a upi id and that screenshot needs to be submitted on the website for verification, first of a kind encounter. Still proceeded given the reviews, well today after many delays and chasing the courier for own order. Got to know that the order has been cancelled by the client on 1st Aug 9:44am and is bound to return to origin. Thier insta handle is not giving any reply on the this matter for the same. Mailed them as well on hello.humtree.shop. Attaching the screenshots for more details. Rant over. Need delays and headaches, please do consider them for your order. Thank you.",
    "light_cleaned_comments": "I crossed checked. All the personal information are hidden, no hospitals are shown."
}