{
    "id": "11txnvd",
    "title": "Why do my videos/photos in India have a brownish tint but not in the USA?",
    "url": "https://www.reddit.com/r/india/comments/11txnvd/why_do_my_videosphotos_in_india_have_a_brownish/",
    "selftext": " both roads are pretty much empty and the weather is almost the same but still there is brownish tint in india.. how should i solve this problem? (i am from india) i am fedup of the dullness in india, whenever i see something from UK or US video's feel really clean....\n\nPS: i live in one of the cleanest cities in india (chandigarh) which have less pollution comparatively, but still.... i am facing this issue\n\n[USA](https://preview.redd.it/fjzrnpin3coa1.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=08640c06f5c67e0c0bde2b67c5944a5853e0f2e0)\n\n&amp;#x200B;\n\n[INDIA](https://preview.redd.it/q52jwqho3coa1.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=0ae7013a86e25dd992940cfd61bb50523425b560)",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 13,
    "created_utc": 1679074055,
    "convurl": "https://b.thumbs.redditmedia.com/Sgsz42cFDnF1-SRApk3Bv9pMSQbMnCeT8RyDXkvg-bo.jpg",
    "comments": [
        "Dust in the wind.....(literally).",
        "&gt;Current AQI in Chandigarh is 80-90.\n\nig it's cleaner than big cities",
        "The other answers are honestly really bad.\n \nTo understand why the Chandigarh image appears browner as compared to the American image, you need to understand how the sensor of a digital camera 'detects' and 'composes' the colours of an image. \n\nWhenever you capture a picture, the sensor of the camera, makes an estimate of and averages the range of colours in the picture captured to produce the final image. The image that is produced by a digital camera is generally based on the 'average' of range of colours in the image. The greater the range of colours, the more 'average' the final output would be and vice versa. \n\nIn the American image, where the sky dominates the major part of the image, the range of colours is comparatively lesser than that of the Chandigarh image. For example, check out the shade of green in the Chandigarh image as compared to the American image. When the final image was produced, the digital camera, in the American image, has rendered the colours more prominently as compared to the Chandigarh image, in which the camera averages out the wide variety of colours to produce an acceptable image. Since the colours are more prominent, the American image feels more 'cleaner' since the colours are rendered more accurately as compared to the Chandigarh image, which feels 'duller' since the camera has averaged the different hues of green resulting in a 'browner' image. \n\nAlthough, we assume that a digital camera sees and captures colour in the same way as the human eye does, the digital camera fails to do so since the sensors, even that of the most advanced digital cameras,  don't have the same capabilities as the human eye. \n\nhttps://www.shortcourses.com/guide/guide1-3.html\n\nIf you have to improve the Chandigarh image to make the colours in it appear more prominent, you may edit the image to change the white balance and the colour temperature (frankly, the image is pretty good and doesn't need correction). \n\nTo prevent 'dullness' i.e. rendering of image by camera differently from how it is seen by your eye, I would recommend you to change the white balance as per the changes in the lighting conditions. You should also change the 'metering mode', if your camera has it, to get the desired final image output.  If you are using a basic camera, change to a more modern camera with a better sensor. Also, try brushing up your photo editing skills since digital images can be edited easily to render the images as close to how the human eye sees. \n\nhttps://photographylife.com/understanding-metering-modes\n\nI am hobby photographer and I have never faced any problems of 'dullness' in any image that I have captured in India. In fact, the images in India seem to have more vividness of colours since the incidence of sunlight is much greater than in countries with temperate climates - the brighter the sun, the more vividly the image is captured by the camera.   \n\nTo be sure, the two images are not comparable since they are composed entirely differently and in different places. Further, the meta data of the images has not been shared and I am not even sure if the same camera has been used to capture these images. Something as apparently insignificant such as the time of the day can affect how the image is rendered by the camera. \n\nIt may seem surprising to many but different cameras in different contexts render the same picture differently - try capturing a rose against different backgrounds, you will be surprised how the same camera renders the colour of the rose differently as the colour of the background changes.\n\nhttps://feltmagnet.com/photography/How-to-capture-the-correct-color-in-your-photos-from-your-digital-camera\n\nI have taken many images like the American road picture in India and the images came out pretty much the same as the American image without any hint of brownness or dullness. Find out 'why' the photos that you capture look dull - it hasn't anything to do with pollution but more to do with white balance, composition and sensors.",
        "White balance",
        "Chandigarh is not as clean as you think.",
        "वातावरण व प्रदूषण का प्रभाव लगता है, मित्र !",
        "ChatGPT at work.",
        "Unfortunately, that ain't true. Wrote a long reply because the claims of pollution resulting in brown-coloured pictures was blatantly misleading.",
        "thank you so much for this explanation... this is the answer i was finding since long, it will definitely help me thanks.",
        "cleaner than 95% of india",
        "u/globetrotter9999 has a really good answer, there are a few nuances though.\n\nWhile that answer is quite accurate from the perspective of a person with good camera equipment, eg with DSLRs / mirrorless or RAW-capable phones, I read OP’s question as “I point and shoot in an urban area, why do my pictures have a brown tinge”? (OP could also be using a phone camera!)\n\nAnd of course the way cameras, particularly mobile cameras, pick up signals from what’s in front of them is something he’s explained well.\n\n&gt; I have never faced any problems of 'dullness' in any image that I have captured in India.\n\nThere’s two parts here: one, a good photographer can avoid “dullness” in almost any environment, and equally, point and shoot users can’t.\n\nBut if you believe that a landscape photo should recreate what you’d see if you were standing there under similar conditions, then — there’s an artistic / philosophical issue.\n\nMany Indian urban areas have significantly more pollution than places in W Europe / N America. It’s also dustier. You can see it visually in the tree leaves, and in the haze — OP’s India photo has haze for instance. Chandigarh actually has good AQI by Indian standards but its PM10 and particularly PM2.5 is still pretty high: PM10 2X+ London’s and PM2.5 **5X**. That PM2.5 is fine particulate matter and has an impact on landscapes — but not on closeup photos of flowers.\n\nThis only impacts *urban* landscapes — if you go to a national park it’ll be different because pollution will be lower there.\n\n&gt; In fact, the images in India seem to have more vividness of colours since the incidence of sunlight is much greater than in countries with temperate climates - the brighter the sun, the more vividly the image is captured by the camera.\n\nThis is somewhat irrelevant for landscape photography, if you have daylight anywhere in the world, you can get great photos. Even with clouds — in fact, clouds can add a touch of drama to landscape photography.\n\nThat said, when capturing natural landscapes, **the sunlight/heat has an impact on the greenery.** As an example, compare Swiss landscapes in mid-spring (late April / early May) vs taken in late summer (August). Forget about photos. If you’re there, August will be browner. The heat has an effect, eg if there’s a heat wave (more common these days, thanks Global Warming).\n\nIf the goal is to create landscapes that look like “typical” temperate-region photos, India’s problem is too much sun &amp; heat — it has an effect on the greenery. But it varies with time, eg shortly after rains you’ll get much better greens. And equally, even in temperate regions, the colours you see in Spring vs what you see in late Summer will vary, especially if there’s a heat wave.\n\nAs a tip for point and shoot landscape photographers in India, take a photo just after rains, everything will look much better.",
        "&gt;As a tip for point and shoot landscape photographers in India, take a photo just after rains, everything will look much better.\n\nthank you so much, i figured this out lately too.... dust settles down and everything becomes clear with bt of scattering sunlight coming through the clouds"
    ],
    "cleaned_text": "videosphotos india brownish tint usa roads pretty much empty weather almost still brownish tint india solve problem india fedup dullness india whenever see something uk us videos feel really clean ps live one cleanest cities india chandigarh less pollution comparatively still facing issue usahttpspreviewredditfjzrnpincoajpgwidthampformatpjpgampautowebpampvenabledampscfcecbdebcaefe ampxb indiahttpspreviewredditqjwqhocoajpgwidthampformatpjpgampautowebpampvenabledampsaeaeddcfdbbb ",
    "cleaned_title": "videosphotos india brownish tint usa",
    "cleaned_selftext": "roads pretty much empty weather almost still brownish tint india solve problem india fedup dullness india whenever see something uk us videos feel really clean ps live one cleanest cities india chandigarh less pollution comparatively still facing issue usahttpspreviewredditfjzrnpincoajpgwidthampformatpjpgampautowebpampvenabledampscfcecbdebcaefe ampxb indiahttpspreviewredditqjwqhocoajpgwidthampformatpjpgampautowebpampvenabledampsaeaeddcfdbbb",
    "cleaned_comments": "dust windliterally gtcurrent aqi chandigarh ig cleaner big cities answers honestly really bad understand chandigarh image appears browner compared american image need understand sensor digital camera detects composes colours image whenever capture picture sensor camera makes estimate averages range colours picture captured produce final image image produced digital camera generally based average range colours image greater range colours average final output would vice versa american image sky dominates major part image range colours comparatively lesser chandigarh image example check shade green chandigarh image compared american image final image produced digital camera american image rendered colours prominently compared chandigarh image camera averages wide variety colours produce acceptable image since colours prominent american image feels cleaner since colours rendered accurately compared chandigarh image feels duller since camera averaged different hues green resulting browner image although assume digital camera sees captures colour way human eye digital camera fails since sensors even advanced digital cameras dont capabilities human eye improve chandigarh image make colours appear prominent may edit image change white balance colour temperature frankly image pretty good doesnt need correction prevent dullness ie rendering image camera differently seen eye would recommend change white balance per changes lighting conditions also change metering mode camera get desired final image output using basic camera change modern camera better sensor also try brushing photo editing skills since digital images edited easily render images close human eye sees hobby photographer never faced problems dullness image captured india fact images india seem vividness colours since incidence sunlight much greater countries temperate climates brighter sun vividly image captured camera sure two images comparable since composed entirely differently different places meta data images shared even sure camera used capture images something apparently insignificant time day affect image rendered camera may seem surprising many different cameras different contexts render picture differently try capturing rose different backgrounds surprised camera renders colour rose differently colour background changes taken many images like american road picture india images came pretty much american image without hint brownness dullness find photos capture look dull hasnt anything pollution white balance composition sensors white balance chandigarh clean think chatgpt work unfortunately aint true wrote long reply claims pollution resulting browncoloured pictures blatantly misleading thank much explanation answer finding since long definitely help thanks cleaner india uglobetrotter really good answer nuances though answer quite accurate perspective person good camera equipment eg dslrs mirrorless rawcapable phones read ops question point shoot urban area pictures brown tinge op could also using phone camera course way cameras particularly mobile cameras pick signals whats front something hes explained well gt never faced problems dullness image captured india theres two parts one good photographer avoid dullness almost environment equally point shoot users cant believe landscape photo recreate youd see standing similar conditions theres artistic philosophical issue many indian urban areas significantly pollution places w europe n america also dustier see visually tree leaves haze ops india photo haze instance chandigarh actually good aqi indian standards pm particularly pm still pretty high pm x londons pm x pm fine particulate matter impact landscapes closeup photos flowers impacts urban landscapes go national park itll different pollution lower gt fact images india seem vividness colours since incidence sunlight much greater countries temperate climates brighter sun vividly image captured camera somewhat irrelevant landscape photography daylight anywhere world get great photos even clouds fact clouds add touch drama landscape photography said capturing natural landscapes sunlightheat impact greenery example compare swiss landscapes midspring late april early may vs taken late summer august forget photos youre august browner heat effect eg theres heat wave common days thanks global warming goal create landscapes look like typical temperateregion photos indias problem much sun amp heat effect greenery varies time eg shortly rains youll get much better greens equally even temperate regions colours see spring vs see late summer vary especially theres heat wave tip point shoot landscape photographers india take photo rains everything look much better gtas tip point shoot landscape photographers india take photo rains everything look much better thank much figured lately dust settles everything becomes clear bt scattering sunlight coming clouds",
    "light_cleaned_title": "Why do my videos/photos in India have a brownish tint but not in the USA?",
    "light_cleaned_selftext": "both roads are pretty much empty and the weather is almost the same but still there is brownish tint in india.. how should i solve this problem? (i am from india) i am fedup of the dullness in india, whenever i see something from UK or US video's feel really clean.... PS: i live in one of the cleanest cities in india (chandigarh) which have less pollution comparatively, but still.... i am facing this issue [USA](https://preview.redd.it/fjzrnpin3coa1.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=08640c06f5c67e0c0bde2b67c5944a5853e0f2e0)  [INDIA](https://preview.redd.it/q52jwqho3coa1.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=0ae7013a86e25dd992940cfd61bb50523425b560)",
    "light_cleaned_comments": "Dust in the wind.....(literally). &gt;Current AQI in Chandigarh is 80-90. ig it's cleaner than big cities The other answers are honestly really bad. To understand why the Chandigarh image appears browner as compared to the American image, you need to understand how the sensor of a digital camera 'detects' and 'composes' the colours of an image. Whenever you capture a picture, the sensor of the camera, makes an estimate of and averages the range of colours in the picture captured to produce the final image. The image that is produced by a digital camera is generally based on the 'average' of range of colours in the image. The greater the range of colours, the more 'average' the final output would be and vice versa. In the American image, where the sky dominates the major part of the image, the range of colours is comparatively lesser than that of the Chandigarh image. For example, check out the shade of green in the Chandigarh image as compared to the American image. When the final image was produced, the digital camera, in the American image, has rendered the colours more prominently as compared to the Chandigarh image, in which the camera averages out the wide variety of colours to produce an acceptable image. Since the colours are more prominent, the American image feels more 'cleaner' since the colours are rendered more accurately as compared to the Chandigarh image, which feels 'duller' since the camera has averaged the different hues of green resulting in a 'browner' image. Although, we assume that a digital camera sees and captures colour in the same way as the human eye does, the digital camera fails to do so since the sensors, even that of the most advanced digital cameras, don't have the same capabilities as the human eye. If you have to improve the Chandigarh image to make the colours in it appear more prominent, you may edit the image to change the white balance and the colour temperature (frankly, the image is pretty good and doesn't need correction). To prevent 'dullness' i.e. rendering of image by camera differently from how it is seen by your eye, I would recommend you to change the white balance as per the changes in the lighting conditions. You should also change the 'metering mode', if your camera has it, to get the desired final image output. If you are using a basic camera, change to a more modern camera with a better sensor. Also, try brushing up your photo editing skills since digital images can be edited easily to render the images as close to how the human eye sees. I am hobby photographer and I have never faced any problems of 'dullness' in any image that I have captured in India. In fact, the images in India seem to have more vividness of colours since the incidence of sunlight is much greater than in countries with temperate climates - the brighter the sun, the more vividly the image is captured by the camera. To be sure, the two images are not comparable since they are composed entirely differently and in different places. Further, the meta data of the images has not been shared and I am not even sure if the same camera has been used to capture these images. Something as apparently insignificant such as the time of the day can affect how the image is rendered by the camera. It may seem surprising to many but different cameras in different contexts render the same picture differently - try capturing a rose against different backgrounds, you will be surprised how the same camera renders the colour of the rose differently as the colour of the background changes. I have taken many images like the American road picture in India and the images came out pretty much the same as the American image without any hint of brownness or dullness. Find out 'why' the photos that you capture look dull - it hasn't anything to do with pollution but more to do with white balance, composition and sensors. White balance Chandigarh is not as clean as you think. वातावरण व प्रदूषण का प्रभाव लगता है, मित्र ! ChatGPT at work. Unfortunately, that ain't true. Wrote a long reply because the claims of pollution resulting in brown-coloured pictures was blatantly misleading. thank you so much for this explanation... this is the answer i was finding since long, it will definitely help me thanks. cleaner than 95% of india u/globetrotter9999 has a really good answer, there are a few nuances though. While that answer is quite accurate from the perspective of a person with good camera equipment, eg with DSLRs / mirrorless or RAW-capable phones, I read OP’s question as “I point and shoot in an urban area, why do my pictures have a brown tinge”? (OP could also be using a phone camera!) And of course the way cameras, particularly mobile cameras, pick up signals from what’s in front of them is something he’s explained well. &gt; I have never faced any problems of 'dullness' in any image that I have captured in India. There’s two parts here: one, a good photographer can avoid “dullness” in almost any environment, and equally, point and shoot users can’t. But if you believe that a landscape photo should recreate what you’d see if you were standing there under similar conditions, then — there’s an artistic / philosophical issue. Many Indian urban areas have significantly more pollution than places in W Europe / N America. It’s also dustier. You can see it visually in the tree leaves, and in the haze — OP’s India photo has haze for instance. Chandigarh actually has good AQI by Indian standards but its PM10 and particularly PM2.5 is still pretty high: PM10 2X+ London’s and PM2.5 **5X**. That PM2.5 is fine particulate matter and has an impact on landscapes — but not on closeup photos of flowers. This only impacts *urban* landscapes — if you go to a national park it’ll be different because pollution will be lower there. &gt; In fact, the images in India seem to have more vividness of colours since the incidence of sunlight is much greater than in countries with temperate climates - the brighter the sun, the more vividly the image is captured by the camera. This is somewhat irrelevant for landscape photography, if you have daylight anywhere in the world, you can get great photos. Even with clouds — in fact, clouds can add a touch of drama to landscape photography. That said, when capturing natural landscapes, **the sunlight/heat has an impact on the greenery.** As an example, compare Swiss landscapes in mid-spring (late April / early May) vs taken in late summer (August). Forget about photos. If you’re there, August will be browner. The heat has an effect, eg if there’s a heat wave (more common these days, thanks Global Warming). If the goal is to create landscapes that look like “typical” temperate-region photos, India’s problem is too much sun &amp; heat — it has an effect on the greenery. But it varies with time, eg shortly after rains you’ll get much better greens. And equally, even in temperate regions, the colours you see in Spring vs what you see in late Summer will vary, especially if there’s a heat wave. As a tip for point and shoot landscape photographers in India, take a photo just after rains, everything will look much better. &gt;As a tip for point and shoot landscape photographers in India, take a photo just after rains, everything will look much better. thank you so much, i figured this out lately too.... dust settles down and everything becomes clear with bt of scattering sunlight coming through the clouds"
}