{
    "id": "m864b8",
    "title": "Bi-Weekly Food, Restaurants, &amp; Nightlife Thread",
    "url": "https://www.reddit.com/r/india/comments/m864b8/biweekly_food_restaurants_nightlife_thread/",
    "selftext": "Foodies of r/India! Been to any fancy restaurant, or a roadside fast food truck lately? Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nPlanning to eat out or have an important date coming up this weekend? Ask for recommendations in your city!\n\nFeel free to share recipes, and if you tried out something new, you can also share pictures!\n\n**The Food Thread is posted every two weeks on Friday mornings.**\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=899972afbc4bab665798a0f5917960a98ec4f4d5",
    "flair": "Scheduled",
    "score": 17,
    "num_comments": 8,
    "created_utc": 1616117425,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        "Biryani at Paradise in HYD is overrated AF",
        "Swiggy started adding Rs. 89 as delivery charges among other charges on one of my fav restaurants in Pune.",
        "time to join the #SwiggyHataoDeshBachao andolan",
        "Would like to give shout outs to excellent places I have discovered in Hyderabad:\n\n1. Davangere Benne Dosa in Madhapur for amazing Dosas originating in Karnataka of the same name.\n\n2. Pancha Kattu Dosa in Jubilee hills for amazing ghee dosas in Andhra style\n\n3. Up Cup Cafe in VIP Hills, for an amazing place to hangout with delicious coffee and continental food.\n\n4. House of Dosas in Jubilee hills for amazing Ghee idlis.",
        "Thanks for this list man! I’ll be moving to Hyderabad in April from Bangalore. And I’m a huge dosa fan so good to know there are so many choices.",
        "You are welcome!! Feel free to ask anytime about food options in Hyderabad!! I hope you like the city.",
        "Will definitely, I’ll DM you for some more help."
    ],
    "cleaned_text": "biweekly food restaurants amp nightlife thread foodies rindia fancy restaurant roadside fast food truck lately tried new dish experimented cooking lived tell story share planning eat important date coming weekend ask recommendations city feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings ",
    "cleaned_title": "biweekly food restaurants amp nightlife thread",
    "cleaned_selftext": "foodies rindia fancy restaurant roadside fast food truck lately tried new dish experimented cooking lived tell story share planning eat important date coming weekend ask recommendations city feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings",
    "cleaned_comments": "biryani paradise hyd overrated af swiggy started adding rs delivery charges among charges one fav restaurants pune time join swiggyhataodeshbachao andolan would like give shout outs excellent places discovered hyderabad davangere benne dosa madhapur amazing dosas originating karnataka name pancha kattu dosa jubilee hills amazing ghee dosas andhra style cup cafe vip hills amazing place hangout delicious coffee continental food house dosas jubilee hills amazing ghee idlis thanks list man ill moving hyderabad april bangalore im huge dosa fan good know many choices welcome feel free ask anytime food options hyderabad hope like city definitely ill dm help",
    "light_cleaned_title": "Bi-Weekly Food, Restaurants, &amp; Nightlife Thread",
    "light_cleaned_selftext": "Foodies of r/India! Been to any fancy restaurant, or a roadside fast food truck lately? Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Planning to eat out or have an important date coming up this weekend? Ask for recommendations in your city! Feel free to share recipes, and if you tried out something new, you can also share pictures! **The Food Thread is posted every two weeks on Friday mornings.**",
    "light_cleaned_comments": "Biryani at Paradise in HYD is overrated AF Swiggy started adding Rs. 89 as delivery charges among other charges on one of my fav restaurants in Pune. time to join the #SwiggyHataoDeshBachao andolan Would like to give shout outs to excellent places I have discovered in Hyderabad: 1. Davangere Benne Dosa in Madhapur for amazing Dosas originating in Karnataka of the same name. 2. Pancha Kattu Dosa in Jubilee hills for amazing ghee dosas in Andhra style 3. Up Cup Cafe in VIP Hills, for an amazing place to hangout with delicious coffee and continental food. 4. House of Dosas in Jubilee hills for amazing Ghee idlis. Thanks for this list man! I’ll be moving to Hyderabad in April from Bangalore. And I’m a huge dosa fan so good to know there are so many choices. You are welcome!! Feel free to ask anytime about food options in Hyderabad!! I hope you like the city. Will definitely, I’ll DM you for some more help."
}