{
    "id": "1b8vlqi",
    "title": "State benefits doled on caste lines are also leading to ‘caste ferocity’ in society: Madras High Court",
    "url": "https://www.thehindu.com/news/national/tamil-nadu/state-benefits-doled-on-caste-lines-are-also-leading-to-caste-ferocity-in-society-madras-high-court/article67923481.ece",
    "selftext": "Thankfully the courts have pointed thsis out ",
    "flair": "Law & Courts",
    "score": 3,
    "num_comments": 2,
    "created_utc": 1709820682.0,
    "convurl": "https://external-preview.redd.it/fFkQHAJVKBbAtcF7D77tblGqD5ieDWQvyRyIS2yCjwY.jpg?auto=webp&s=f2dca3de9baa4e04dc6661c93dbeb6a5199264a8",
    "comments": [
        "Madam was heard saying to a colleague that women asserting their rights is leading to violence against women. /s",
        "I don't get her logic, she claims caste discrimination is not more than 100 years old, and also claims it can't be inferred that the system mentioned in ancient texts has no basis for discrimination seen today, rather it's because of the attempts to provide representation to minorities, which is still lacking. \n\nThis feels like a dog whistle to post retirement benefits.",
        "This is not a dog whistle. this is Creta honking."
    ],
    "cleaned_text": "state benefits doled caste lines also leading caste ferocity society madras high court thankfully courts pointed thsis ",
    "cleaned_title": "state benefits doled caste lines also leading caste ferocity society madras high court",
    "cleaned_selftext": "thankfully courts pointed thsis",
    "cleaned_comments": "madam heard saying colleague women asserting rights leading violence women dont get logic claims caste discrimination years old also claims cant inferred system mentioned ancient texts basis discrimination seen today rather attempts provide representation minorities still lacking feels like dog whistle post retirement benefits dog whistle creta honking",
    "light_cleaned_title": "State benefits doled on caste lines are also leading to ‘caste ferocity’ in society: Madras High Court",
    "light_cleaned_selftext": "Thankfully the courts have pointed thsis out",
    "light_cleaned_comments": "Madam was heard saying to a colleague that women asserting their rights is leading to violence against women. /s I don't get her logic, she claims caste discrimination is not more than 100 years old, and also claims it can't be inferred that the system mentioned in ancient texts has no basis for discrimination seen today, rather it's because of the attempts to provide representation to minorities, which is still lacking. This feels like a dog whistle to post retirement benefits. This is not a dog whistle. this is Creta honking."
}