{
    "id": "hhuz9z",
    "title": "Joint Statement : The Government of Kerala must withdraw compulsory Aadhaar for state government jobs",
    "url": "https://www.reddit.com/r/india/comments/hhuz9z/joint_statement_the_government_of_kerala_must/",
    "selftext": "## TLDR\n\nLast week Kalyani Menon Sen, a citizen, and petitioner in the Aadhaar case sent a legal notice to the Government of Kerala which has made Aadhaar mandatory for all state government jobs. We are issuing a joint statement supporting this action alongwith Rethink Aadhaar, Article 21 and Swathanthra Malayalam Computing.\n\nhttps://preview.redd.it/p9lo5vhups751.png?width=1024&amp;format=png&amp;auto=webp&amp;s=d93daf142e5554de4f17547b65c4f2c01afcb409\n\n## Joint Statement\n\nThe joint statement prepared by [**RethinkAadhaar**](https://internetfreedom.in/p/f6798a23-680b-4b45-a606-acec95c701e5/rethinkaadhaar.in) in english is given below. A malayalam version has also been prepared by Anivar Aravind from Swathanthra Malayalam Computing for circulation. All relevant documents, such as the legal notice by Kalyani Menon Sen are also available at the end as links.\n\n&gt;\"Kalyani Menon Sen, a citizen, and petitioner in the batch of writ petitions challenging the constitutionality of Aadhaar in *KS Puttaswamy v Union of India* (2019 10 SCC 1) has sent the Government of Kerala a legal notice demanding that it withdraw a recent order mandating compulsory Aadhaar verification for all new applicants and recent appointees to state government jobs. Internet Freedom Foundation, Rethink Aadhaar, Article 21 and Swathanthra Malayalam Computing endorse this legal notice, and call on the Kerala Government to withdraw this order.  \n&gt;  \n&gt;The order dated 11.06.2020, which was issued by the Kerala Government's Department of Personnel &amp; Administrative Reforms, relates to applicants and new appointments to the Kerala Public Service Commission. As Ms. Menon Sen's legal notice notes, mandating Aadhaar verification for new appointees and applicants violates the order of the Supreme Court relating to Aadhaar, *KS Puttaswamy v Union of India* (2019 10 SCC 1).  \n&gt;  \n&gt;The 5 judge bench  specified that mandating the use of Aadhaar numbers, whether for verification or any other purpose, was constitutionally valid for two purposes only: for linking with PAN numbers, and for obtaining welfare benefits in the nature of a subsidy which is funded from the Consolidated Fund of India. The Hon’ble Supreme Court also read down Section 57 of the Aadhaar Act (as it then stood), and specified that the State could use Aadhaar only if it met the following two conditions: that such use was voluntary, and that such use was covered by primary legislation for that purpose.  \n&gt;  \n&gt;The purpose of preventing fraud cannot and should not be carried out by breaches to privacy, dignity and autonomy of individuals, especially in the absence of any clear basis in law. As a constitutional body, the Government of Kerala, and the KPSC are bound to uphold the rule of law and the judgements of the Supreme Court, and should withdraw the notification, and clarify that Aadhaar verification remains optional.\"\n\n## IFF's work on Aadhaar and Digital Identity\n\nOrganisationally the Internet Freedom Foundation has had a clear stand on Aadhaar in which we support the leadership of diverse campaigns, collectives and individuals and seek to learn and offer support. These come from rooted and lived experiences of activists who have worked on issues of right to food, subsidies, privacy and surveillance.\n\nMore information on this is available in an [**organisational statement dated November 23, 2017**](https://internetfreedom.in/aadhaar-undermines-informational-privacy-and-data-protection/) and a s[**tatement on the Supreme's Court's judgement on Aadhaar**](https://internetfreedom.in/reactions-to-the-aadhaar-judgement/). We have [**after September, 2018**](https://internetfreedom.in/looking-towards-the-future/) been able to utilise growing capacity through dedicated staff  to more actively engage on issues of privacy, surveillance and digital identity. Specifically towards Aadhaar this has meant some [**strategic litigation** ](https://internetfreedom.in/vanakkam-updates-on-the-aadhaar-social-media-linkage-and-encryption-pil-before-the-madras-hc/)before the High Court of Madras, and we have cautioned against the possibility of [**Aadhaar linking with the National Population Register**](https://internetfreedom.in/data-protection-and-the-national-population-register/).\n\nIFF believes that any digital technology should lead to greater human freedom that is achieved through individual liberty and social justice. We recognise the leadership of others and hope to continue provide them support and resources wherever and whenever we can. We encourage diverse groups and collectives to reach out to us to inform and deepen our advocacy and analysis.\n\n## Important documents\n\n1. Joint Statement dated June 29, 2020 in malayalam ([**link**](https://drive.google.com/file/d/1WuJMhfcoGW6dCV-KmItHzo_pbu7hFpCj/view?usp=sharing))\n2. Legal Notice dated June 26, 2020 sent by Kalyani Menon Sen ([**link**](https://drive.google.com/file/d/1OMmus9lzytp5sjpEH4sc6vNmGIP-TRTL/view?usp=sharing))",
    "flair": "Policy/Economy",
    "score": 15,
    "num_comments": 0,
    "created_utc": 1593413157,
    "convurl": "https://b.thumbs.redditmedia.com/_3hIx4vveFO53GQaG67k1DIMhNowKNWx80DCu4Cnr_A.jpg",
    "comments": [],
    "cleaned_text": "joint statement government kerala must withdraw compulsory aadhaar state government jobs tldr last week kalyani menon sen citizen petitioner aadhaar case sent legal notice government kerala made aadhaar mandatory state government jobs issuing joint statement supporting action alongwith rethink aadhaar article swathanthra malayalam computing joint statement joint statement prepared rethinkaadhaarhttpsinternetfreedominpfabbaaceccerethinkaadhaarin english given malayalam version also prepared anivar aravind swathanthra malayalam computing circulation relevant documents legal notice kalyani menon sen also available end links gtkalyani menon sen citizen petitioner batch writ petitions challenging constitutionality aadhaar ks puttaswamy v union india scc sent government kerala legal notice demanding withdraw recent order mandating compulsory aadhaar verification new applicants recent appointees state government jobs internet freedom foundation rethink aadhaar article swathanthra malayalam computing endorse legal notice call kerala government withdraw order gt gtthe order dated issued kerala governments department personnel amp administrative reforms relates applicants new appointments kerala public service commission ms menon sens legal notice notes mandating aadhaar verification new appointees applicants violates order supreme court relating aadhaar ks puttaswamy v union india scc gt gtthe judge bench specified mandating use aadhaar numbers whether verification purpose constitutionally valid two purposes linking pan numbers obtaining welfare benefits nature subsidy funded consolidated fund india honble supreme court also read section aadhaar act stood specified state could use aadhaar met following two conditions use voluntary use covered primary legislation purpose gt gtthe purpose preventing fraud carried breaches privacy dignity autonomy individuals especially absence clear basis law constitutional body government kerala kpsc bound uphold rule law judgements supreme court withdraw notification clarify aadhaar verification remains optional iffs work aadhaar digital identity organisationally internet freedom foundation clear stand aadhaar support leadership diverse campaigns collectives individuals seek learn offer support come rooted lived experiences activists worked issues right food subsidies privacy surveillance information available organisational statement dated november httpsinternetfreedominaadhaarunderminesinformationalprivacyanddataprotection statement supremes courts judgement aadhaarhttpsinternetfreedominreactionstotheaadhaarjudgement september httpsinternetfreedominlookingtowardsthefuture able utilise growing capacity dedicated staff actively engage issues privacy surveillance digital identity specifically towards aadhaar meant strategic litigation httpsinternetfreedominvanakkamupdatesontheaadhaarsocialmedialinkageandencryptionpilbeforethemadrashcbefore high court madras cautioned possibility aadhaar linking national population registerhttpsinternetfreedomindataprotectionandthenationalpopulationregister iff believes digital technology lead greater human freedom achieved individual liberty social justice recognise leadership others hope continue provide support resources wherever whenever encourage diverse groups collectives reach us inform deepen advocacy analysis important documents joint statement dated june malayalam linkhttpsdrivegooglecomfiledwujmhfcogwdcvkmithzopbuhfpcjviewuspsharing legal notice dated june sent kalyani menon sen linkhttpsdrivegooglecomfiledommuslzytpsjpehscvnmgiptrtlviewuspsharing ",
    "cleaned_title": "joint statement government kerala must withdraw compulsory aadhaar state government jobs",
    "cleaned_selftext": "tldr last week kalyani menon sen citizen petitioner aadhaar case sent legal notice government kerala made aadhaar mandatory state government jobs issuing joint statement supporting action alongwith rethink aadhaar article swathanthra malayalam computing joint statement joint statement prepared rethinkaadhaarhttpsinternetfreedominpfabbaaceccerethinkaadhaarin english given malayalam version also prepared anivar aravind swathanthra malayalam computing circulation relevant documents legal notice kalyani menon sen also available end links gtkalyani menon sen citizen petitioner batch writ petitions challenging constitutionality aadhaar ks puttaswamy v union india scc sent government kerala legal notice demanding withdraw recent order mandating compulsory aadhaar verification new applicants recent appointees state government jobs internet freedom foundation rethink aadhaar article swathanthra malayalam computing endorse legal notice call kerala government withdraw order gt gtthe order dated issued kerala governments department personnel amp administrative reforms relates applicants new appointments kerala public service commission ms menon sens legal notice notes mandating aadhaar verification new appointees applicants violates order supreme court relating aadhaar ks puttaswamy v union india scc gt gtthe judge bench specified mandating use aadhaar numbers whether verification purpose constitutionally valid two purposes linking pan numbers obtaining welfare benefits nature subsidy funded consolidated fund india honble supreme court also read section aadhaar act stood specified state could use aadhaar met following two conditions use voluntary use covered primary legislation purpose gt gtthe purpose preventing fraud carried breaches privacy dignity autonomy individuals especially absence clear basis law constitutional body government kerala kpsc bound uphold rule law judgements supreme court withdraw notification clarify aadhaar verification remains optional iffs work aadhaar digital identity organisationally internet freedom foundation clear stand aadhaar support leadership diverse campaigns collectives individuals seek learn offer support come rooted lived experiences activists worked issues right food subsidies privacy surveillance information available organisational statement dated november httpsinternetfreedominaadhaarunderminesinformationalprivacyanddataprotection statement supremes courts judgement aadhaarhttpsinternetfreedominreactionstotheaadhaarjudgement september httpsinternetfreedominlookingtowardsthefuture able utilise growing capacity dedicated staff actively engage issues privacy surveillance digital identity specifically towards aadhaar meant strategic litigation httpsinternetfreedominvanakkamupdatesontheaadhaarsocialmedialinkageandencryptionpilbeforethemadrashcbefore high court madras cautioned possibility aadhaar linking national population registerhttpsinternetfreedomindataprotectionandthenationalpopulationregister iff believes digital technology lead greater human freedom achieved individual liberty social justice recognise leadership others hope continue provide support resources wherever whenever encourage diverse groups collectives reach us inform deepen advocacy analysis important documents joint statement dated june malayalam linkhttpsdrivegooglecomfiledwujmhfcogwdcvkmithzopbuhfpcjviewuspsharing legal notice dated june sent kalyani menon sen linkhttpsdrivegooglecomfiledommuslzytpsjpehscvnmgiptrtlviewuspsharing",
    "cleaned_comments": "",
    "light_cleaned_title": "Joint Statement : The Government of Kerala must withdraw compulsory Aadhaar for state government jobs",
    "light_cleaned_selftext": "## TLDR Last week Kalyani Menon Sen, a citizen, and petitioner in the Aadhaar case sent a legal notice to the Government of Kerala which has made Aadhaar mandatory for all state government jobs. We are issuing a joint statement supporting this action alongwith Rethink Aadhaar, Article 21 and Swathanthra Malayalam Computing. ## Joint Statement The joint statement prepared by [**RethinkAadhaar**](https://internetfreedom.in/p/f6798a23-680b-4b45-a606-acec95c701e5/rethinkaadhaar.in) in english is given below. A malayalam version has also been prepared by Anivar Aravind from Swathanthra Malayalam Computing for circulation. All relevant documents, such as the legal notice by Kalyani Menon Sen are also available at the end as links. &gt;\"Kalyani Menon Sen, a citizen, and petitioner in the batch of writ petitions challenging the constitutionality of Aadhaar in *KS Puttaswamy v Union of India* (2019 10 SCC 1) has sent the Government of Kerala a legal notice demanding that it withdraw a recent order mandating compulsory Aadhaar verification for all new applicants and recent appointees to state government jobs. Internet Freedom Foundation, Rethink Aadhaar, Article 21 and Swathanthra Malayalam Computing endorse this legal notice, and call on the Kerala Government to withdraw this order. &gt; &gt;The order dated 11.06.2020, which was issued by the Kerala Government's Department of Personnel &amp; Administrative Reforms, relates to applicants and new appointments to the Kerala Public Service Commission. As Ms. Menon Sen's legal notice notes, mandating Aadhaar verification for new appointees and applicants violates the order of the Supreme Court relating to Aadhaar, *KS Puttaswamy v Union of India* (2019 10 SCC 1). &gt; &gt;The 5 judge bench specified that mandating the use of Aadhaar numbers, whether for verification or any other purpose, was constitutionally valid for two purposes only: for linking with PAN numbers, and for obtaining welfare benefits in the nature of a subsidy which is funded from the Consolidated Fund of India. The Hon’ble Supreme Court also read down Section 57 of the Aadhaar Act (as it then stood), and specified that the State could use Aadhaar only if it met the following two conditions: that such use was voluntary, and that such use was covered by primary legislation for that purpose. &gt; &gt;The purpose of preventing fraud cannot and should not be carried out by breaches to privacy, dignity and autonomy of individuals, especially in the absence of any clear basis in law. As a constitutional body, the Government of Kerala, and the KPSC are bound to uphold the rule of law and the judgements of the Supreme Court, and should withdraw the notification, and clarify that Aadhaar verification remains optional.\" ## IFF's work on Aadhaar and Digital Identity Organisationally the Internet Freedom Foundation has had a clear stand on Aadhaar in which we support the leadership of diverse campaigns, collectives and individuals and seek to learn and offer support. These come from rooted and lived experiences of activists who have worked on issues of right to food, subsidies, privacy and surveillance. More information on this is available in an [**organisational statement dated November 23, 2017**](https://internetfreedom.in/aadhaar-undermines-informational-privacy-and-data-protection/) and a s[**tatement on the Supreme's Court's judgement on Aadhaar**](https://internetfreedom.in/reactions-to-the-aadhaar-judgement/). We have [**after September, 2018**](https://internetfreedom.in/looking-towards-the-future/) been able to utilise growing capacity through dedicated staff to more actively engage on issues of privacy, surveillance and digital identity. Specifically towards Aadhaar this has meant some [**strategic litigation** ](https://internetfreedom.in/vanakkam-updates-on-the-aadhaar-social-media-linkage-and-encryption-pil-before-the-madras-hc/)before the High Court of Madras, and we have cautioned against the possibility of [**Aadhaar linking with the National Population Register**](https://internetfreedom.in/data-protection-and-the-national-population-register/). IFF believes that any digital technology should lead to greater human freedom that is achieved through individual liberty and social justice. We recognise the leadership of others and hope to continue provide them support and resources wherever and whenever we can. We encourage diverse groups and collectives to reach out to us to inform and deepen our advocacy and analysis. ## Important documents 1. Joint Statement dated June 29, 2020 in malayalam ([**link**](https://drive.google.com/file/d/1WuJMhfcoGW6dCV-KmItHzo_pbu7hFpCj/view?usp=sharing)) 2. Legal Notice dated June 26, 2020 sent by Kalyani Menon Sen ([**link**](https://drive.google.com/file/d/1OMmus9lzytp5sjpEH4sc6vNmGIP-TRTL/view?usp=sharing))",
    "light_cleaned_comments": ""
}