{
    "id": "15qghli",
    "title": "Bi-Weekly Financial Advice/Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/15qghli/biweekly_financial_advicediscussion_thread/",
    "selftext": "Discuss banking tips, ask questions and share recommendations on security, investments and other banking products: accounts, credit cards, and insurance.\n\nYou can also ask for help if you are facing any financial problems and need legal help.\n\nAlso, do check out our friendly neighborhood subs r/IndiaInvestments and r/LegalAdviceIndia.\n\nWant to discuss about financial advice when this thread isn't stickied? Join our [Discord](https://discord.gg/6V29X7f) server. We have a separate channel, #financial-advice, exclusively for this topic.\n\n***Disclaimer:*** *Any advice given by our community members shouldn't be the only source to make your final decision, please contact a fee only SEBI registered advisor if you are in doubt or need a more personal approach to your situation. We are in no way responsible for your loss if such arises in future.*\n\n**Financial Advice Thread is posted every two weeks on Monday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Financial+Advice%2FDiscussion+Thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/767j6zz3y8n61.png?width=1487&format=png&auto=webp&s=381d57898ff1eec2aaf4afa6b9f757ba13a31534",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691976609.0,
    "convurl": "https://b.thumbs.redditmedia.com/-_9OALlbMlZcmvZM6wpUTthbFQs6ehPdfU8fjgKHyFw.jpg",
    "comments": [],
    "cleaned_text": "biweekly financial advicediscussion thread discuss banking tips ask questions share recommendations security investments banking products accounts credit cards insurance also ask help facing financial problems need legal help also check friendly neighborhood subs rindiainvestments rlegaladviceindia want discuss financial advice thread isnt stickied join discordhttpsdiscordggvxf server separate channel financialadvice exclusively topic disclaimer advice given community members shouldnt source make final decision please contact fee sebi registered advisor doubt need personal approach situation way responsible loss arises future financial advice thread posted every two weeks monday mornings old threadshttpsredditcomrindiasearchqbiweeklyfinancialadvicefdiscussionthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly financial advicediscussion thread",
    "cleaned_selftext": "discuss banking tips ask questions share recommendations security investments banking products accounts credit cards insurance also ask help facing financial problems need legal help also check friendly neighborhood subs rindiainvestments rlegaladviceindia want discuss financial advice thread isnt stickied join discordhttpsdiscordggvxf server separate channel financialadvice exclusively topic disclaimer advice given community members shouldnt source make final decision please contact fee sebi registered advisor doubt need personal approach situation way responsible loss arises future financial advice thread posted every two weeks monday mornings old threadshttpsredditcomrindiasearchqbiweeklyfinancialadvicefdiscussionthreadrestrictsronsortnewtall",
    "cleaned_comments": "",
    "light_cleaned_title": "Bi-Weekly Financial Advice/Discussion Thread",
    "light_cleaned_selftext": "Discuss banking tips, ask questions and share recommendations on security, investments and other banking products: accounts, credit cards, and insurance. You can also ask for help if you are facing any financial problems and need legal help. Also, do check out our friendly neighborhood subs r/IndiaInvestments and r/LegalAdviceIndia. Want to discuss about financial advice when this thread isn't stickied? Join our [Discord](https://discord.gg/6V29X7f) server. We have a separate channel, #financial-advice, exclusively for this topic. ***Disclaimer:*** *Any advice given by our community members shouldn't be the only source to make your final decision, please contact a fee only SEBI registered advisor if you are in doubt or need a more personal approach to your situation. We are in no way responsible for your loss if such arises in future.* **Financial Advice Thread is posted every two weeks on Monday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Financial+Advice%2FDiscussion+Thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": ""
}