{
    "id": "s6kwbh",
    "title": "Bi-Weekly Gaming Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/s6kwbh/biweekly_gaming_discussion_thread/",
    "selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!)\n\nWhat game are you looking forward to? Are you a developer? Show us your wares!\n\nPlease don't just list the names of games, make sure to write a word or two about them as well.\n\nCheck out r/IndianGaming! They are an active community and also host a few co-op sessions.\n\n**Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/xagdqefyv8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=f975f1c3093a3d9598a1da39854b03d1250bd55d",
    "flair": "Scheduled",
    "score": 9,
    "num_comments": 35,
    "created_utc": 1642469417,
    "convurl": "https://b.thumbs.redditmedia.com/1yW1vnOXXLbj7GjIDC4BNEociU_mAxBuQABJNbaBbBc.jpg",
    "comments": [
        "I play modded Skyrim, fallout 4 and fallout new Vegas.",
        " No gaming. Got tennis elbow",
        "Hades is addictive af",
        "where do you get your Skyrim mods from?",
        "Anyone trying God Of War for PC?",
        "I completed God of war PC, now back to online games fortnite, pubg and rainbow six",
        "Picked up bloodborne from gamesloot, getting my ass handed by that vagina of a boss called blood starved beast, but love the atmosphere and the lore.",
        "Making slow progress on Deathloop. \nJust got the shift slab. Hopefully the game picks up now.",
        "I just got 3 of my friends to buy Age of Empires 2 Definitive Edition",
        "Yes! Its amazing. Very well optimised too",
        "Ahh, very well. I shall give it a try. I haven't played any previous parts. Do i have to understand the story up untill now?",
        "Trying Monster Hunter world waiting for Elden Ring",
        "Hello, good hunter. I am a Bot, here in this dream to look after you, this is a fine note:\n\n&gt; *“I, Siegward of the Knights of Catarina, have come to fulfill my promise. Let the sun shine upon this Lord of Cinder.”* - Siegward of Catarina\n\nHave a good one and praise the sun \\\\[T]/",
        "Can I steal your friends? :D",
        "One was a fan of AOE. One wanted to play with us. Last one, I had no idea. We didn't invite nor has that person played the game. Like ever.",
        "looking a team for PUBG Ranked or Valorant, just PM for any game...",
        "Never owned any console.\n\nIs a console worth it? For PS4/5  you get to play exclusives like Spiderman, Uncharted but buying new games is expensive especially when you can get the same games for cheap through Steam",
        "Isn't that just an xbox thing what about for PS?",
        "What about Switch?",
        "Nexus",
        "**Please don't break this thread!**  \n\n\nPC or Gamin Console?",
        "Console gaming is a hassle free couch friendly mode. It's easy to setup,convenient and comfy. It's definitely fun, the controller and TV gaming was quite a nice experience for a person like me who has been PC only for so long. I bought a ps4 just to play the exclusives. But I won't say it's a necessity tho, you do miss out on a few good games and that controller experience(unless you game with a controller on pc) but that's about it\n\nIf you're keen on getting one and tight on budget you could buy a used ps4 and used games",
        "How much would a used PS4 cost?",
        "Idk sorry",
        "Posting a board game that was recently released - **Go Goa**. It's now available on Amazon India.",
        "PC",
        "No, not really",
        "Here's a casual game I created. \n\nhttps://play.google.com/store/apps/details?id=com.hermitowl.tunneled",
        "God of bur",
        "a used ps4 could come from 18000 with only console and 1 controller",
        "switch is like the last option i would go for. What type of games/gaming you do? it could help a lot in choosing consoles",
        "That is true. But some games can be played solo too, including this one. We should be playing more board games. :)\n\n&amp;#x200B;\n\nAnd encouraging games made in India."
    ],
    "cleaned_text": "biweekly gaming discussion thread playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly gaming discussion thread",
    "cleaned_selftext": "playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "play modded skyrim fallout fallout new vegas gaming got tennis elbow hades addictive af get skyrim mods anyone trying god war pc completed god war pc back online games fortnite pubg rainbow six picked bloodborne gamesloot getting ass handed vagina boss called blood starved beast love atmosphere lore making slow progress deathloop got shift slab hopefully game picks got friends buy age empires definitive edition yes amazing well optimised ahh well shall give try havent played previous parts understand story untill trying monster hunter world waiting elden ring hello good hunter bot dream look fine note gt siegward knights catarina come fulfill promise let sun shine upon lord cinder siegward catarina good one praise sun steal friends one fan aoe one wanted play us last one idea didnt invite person played game like ever looking team pubg ranked valorant pm game never owned console console worth ps get play exclusives like spiderman uncharted buying new games expensive especially get games cheap steam isnt xbox thing ps switch nexus please dont break thread pc gamin console console gaming hassle free couch friendly mode easy setupconvenient comfy definitely fun controller tv gaming quite nice experience person like pc long bought ps play exclusives wont say necessity tho miss good games controller experienceunless game controller pc thats youre keen getting one tight budget could buy used ps used games much would used ps cost idk sorry posting board game recently released go goa available amazon india pc really heres casual game created god bur used ps could come console controller switch like last option would go type gamesgaming could help lot choosing consoles true games played solo including one playing board games ampxb encouraging games made india",
    "light_cleaned_title": "Bi-Weekly Gaming Discussion Thread",
    "light_cleaned_selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!) What game are you looking forward to? Are you a developer? Show us your wares! Please don't just list the names of games, make sure to write a word or two about them as well. Check out r/IndianGaming! They are an active community and also host a few co-op sessions. **Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "I play modded Skyrim, fallout 4 and fallout new Vegas. No gaming. Got tennis elbow Hades is addictive af where do you get your Skyrim mods from? Anyone trying God Of War for PC? I completed God of war PC, now back to online games fortnite, pubg and rainbow six Picked up bloodborne from gamesloot, getting my ass handed by that vagina of a boss called blood starved beast, but love the atmosphere and the lore. Making slow progress on Deathloop. Just got the shift slab. Hopefully the game picks up now. I just got 3 of my friends to buy Age of Empires 2 Definitive Edition Yes! Its amazing. Very well optimised too Ahh, very well. I shall give it a try. I haven't played any previous parts. Do i have to understand the story up untill now? Trying Monster Hunter world waiting for Elden Ring Hello, good hunter. I am a Bot, here in this dream to look after you, this is a fine note: &gt; *“I, Siegward of the Knights of Catarina, have come to fulfill my promise. Let the sun shine upon this Lord of Cinder.”* - Siegward of Catarina Have a good one and praise the sun \\\\[T]/ Can I steal your friends? :D One was a fan of AOE. One wanted to play with us. Last one, I had no idea. We didn't invite nor has that person played the game. Like ever. looking a team for PUBG Ranked or Valorant, just PM for any game... Never owned any console. Is a console worth it? For PS4/5 you get to play exclusives like Spiderman, Uncharted but buying new games is expensive especially when you can get the same games for cheap through Steam Isn't that just an xbox thing what about for PS? What about Switch? Nexus **Please don't break this thread!** PC or Gamin Console? Console gaming is a hassle free couch friendly mode. It's easy to setup,convenient and comfy. It's definitely fun, the controller and TV gaming was quite a nice experience for a person like me who has been PC only for so long. I bought a ps4 just to play the exclusives. But I won't say it's a necessity tho, you do miss out on a few good games and that controller experience(unless you game with a controller on pc) but that's about it If you're keen on getting one and tight on budget you could buy a used ps4 and used games How much would a used PS4 cost? Idk sorry Posting a board game that was recently released - **Go Goa**. It's now available on Amazon India. PC No, not really Here's a casual game I created. God of bur a used ps4 could come from 18000 with only console and 1 controller switch is like the last option i would go for. What type of games/gaming you do? it could help a lot in choosing consoles That is true. But some games can be played solo too, including this one. We should be playing more board games. :)  And encouraging games made in India."
}