{
    "id": "17o3hdc",
    "title": "Startup owner claims ‘extortion’ in Bengaluru-Indore flight. IndiGo responds",
    "url": "https://www.hindustantimes.com/cities/bengaluru-news/startup-owner-claims-extortion-in-bengaluru-indore-flight-indigo-responds-101699001939600.html",
    "selftext": "Indigo scam",
    "flair": "Crime",
    "score": 127,
    "num_comments": 31,
    "created_utc": 1699155470.0,
    "convurl": "https://external-preview.redd.it/vEnkh-317cdiEPs4stbuFYK705q9gv920_6p5JUq38Y.jpg?auto=webp&s=68f7a816e75d9c8eeb8c0cf735a39a33389df0df",
    "comments": [
        "inspired by Apple, you buy a ticket , now buy a seat, now buy a round trip to washroom. And finally you have to pay for exit!!",
        "Paying extra for seat after buying ticket is frustrating. High time government take some action",
        "Indigo with 65% of the domestic avaition market in India, is moving towards monopoly. In most of the tier-2 cities, only Indigo is offering more flight options maling them to take customers for granted. Their service was degraded, flights are not clean and offering tickets at exorbitant prices. \n\nProblem is that Indigo is charging more (like non-budget airlines) and on top if it, they are charging everything extra. If you take any budget carriers like Ryanair, Frontier, Spirit, usually prices are less compared to other carriers, but charges more for everything other than ticket ( seat, food).",
        "> The web-check-in system was not allowing me to complete the process without selection of seats for the flight from Ahmedabad to Indore. And the system did not allot any random seat to me.”   \n\n> “Also, CO-INCIDENTALLY, all the seats that were available were up for payment only. No seat was available for free, whatever the preference.   \n\nAs no seat was allocated on buying the ticket, what was the ticket price for, to travel standing?",
        "Crypto scammer got scammed by aviation scammer. Peak capitalism.",
        "As if PM CARES .",
        "In theory - a free workaround is that you do the check in at the airport in person at the airline counter, and ask for a seat of preference. \n\nBut yes - this is an inconvenience specifically arranged for by the airline, that part is undeniable",
        "He says he was not able to book ticket in first place without taking a seat. He was not able to pay without that part. When you dont have PNR how are you going to go to airport and check in?! Also Indigo is such an evilish company they will charge you for booking tickets at their reservation counter. If you want print of your booking ticket, they charge you 100₹, at the airport. Recently they stopped selling cold drinks too. If you want cold drinks buy their combo meal.",
        "Don't they charge for in person check in though?",
        "The ticket price does not include a seat. You need to pay an additional 200-300 bucks for a seat of your choice. If you want a free seat then you will automatically be assigned one when the boarding pass is generated.",
        "Who pays for the paper, water, air etc in the washroom? Pay for it too! Round trip only includes the walk way/aisle usage.",
        "Extras are better.. more GST!",
        "That i didn’t know!",
        "They charge.",
        "DGCA did say something the other day about this",
        "Extra amount is for the choice of choosing a seat.",
        "That's why I mentioned if you want a free seat you have to wait for one to be assigned automatically.",
        "“Crypto Gabbar” crying about fairness.",
        "They've started charging an extra fee for checking in at the airport",
        "The original comment literally mentions “I was not able to get a random free seat and I was forced to pay extra for seats”",
        "My bad, I misunderstood",
        "Ahh, cool. That makes sense.",
        "I don't understand. I have never been charged for in person check-in, that doesn't make sense. I'm travelling Indigo regularly since 4-5 years. What gives?",
        "since when? And when do they charge it, at the check in counters?",
        "They've stopped charging for check-in at counters since last year.",
        "What’s wrong with the Hindustan Times? \n\nI’m not sure if I’m alone in having these issues, but every time I try to open this article—or any other page on the same site—I keep getting McDonald’s pop-up ads that continuously reappear after being cleared.",
        "> round trip to washroom\n\nAs opposed to a one-way ticket where you're locked in the toilet for the rest of the journey :)",
        "Fuck you I'm staying",
        "Inspired by modi. Pay road tax and gst . Then pay toll tax and 300% fuel taxes"
    ],
    "cleaned_text": "startup owner claims extortion bengaluruindore flight indigo responds indigo scam ",
    "cleaned_title": "startup owner claims extortion bengaluruindore flight indigo responds",
    "cleaned_selftext": "indigo scam",
    "cleaned_comments": "inspired apple buy ticket buy seat buy round trip washroom finally pay exit paying extra seat buying ticket frustrating high time government take action indigo domestic avaition market india moving towards monopoly tier cities indigo offering flight options maling take customers granted service degraded flights clean offering tickets exorbitant prices problem indigo charging like nonbudget airlines top charging everything extra take budget carriers like ryanair frontier spirit usually prices less compared carriers charges everything ticket seat food webcheckin system allowing complete process without selection seats flight ahmedabad indore system allot random seat also coincidentally seats available payment seat available free whatever preference seat allocated buying ticket ticket price travel standing crypto scammer got scammed aviation scammer peak capitalism pm cares theory free workaround check airport person airline counter ask seat preference yes inconvenience specifically arranged airline part undeniable says able book ticket first place without taking seat able pay without part dont pnr going go airport check also indigo evilish company charge booking tickets reservation counter want print booking ticket charge airport recently stopped selling cold drinks want cold drinks buy combo meal dont charge person check though ticket price include seat need pay additional bucks seat choice want free seat automatically assigned one boarding pass generated pays paper water air etc washroom pay round trip includes walk wayaisle usage extras better gst didnt know charge dgca say something day extra amount choice choosing seat thats mentioned want free seat wait one assigned automatically crypto gabbar crying fairness theyve started charging extra fee checking airport original comment literally mentions able get random free seat forced pay extra seats bad misunderstood ahh cool makes sense dont understand never charged person checkin doesnt make sense im travelling indigo regularly since years gives since charge check counters theyve stopped charging checkin counters since last year whats wrong hindustan times im sure im alone issues every time try open articleor page sitei keep getting mcdonalds popup ads continuously reappear cleared round trip washroom opposed oneway ticket youre locked toilet rest journey fuck im staying inspired modi pay road tax gst pay toll tax fuel taxes",
    "light_cleaned_title": "Startup owner claims ‘extortion’ in Bengaluru-Indore flight. IndiGo responds",
    "light_cleaned_selftext": "Indigo scam",
    "light_cleaned_comments": "inspired by Apple, you buy a ticket , now buy a seat, now buy a round trip to washroom. And finally you have to pay for exit!! Paying extra for seat after buying ticket is frustrating. High time government take some action Indigo with 65% of the domestic avaition market in India, is moving towards monopoly. In most of the tier-2 cities, only Indigo is offering more flight options maling them to take customers for granted. Their service was degraded, flights are not clean and offering tickets at exorbitant prices. Problem is that Indigo is charging more (like non-budget airlines) and on top if it, they are charging everything extra. If you take any budget carriers like Ryanair, Frontier, Spirit, usually prices are less compared to other carriers, but charges more for everything other than ticket ( seat, food). > The web-check-in system was not allowing me to complete the process without selection of seats for the flight from Ahmedabad to Indore. And the system did not allot any random seat to me.” > “Also, CO-INCIDENTALLY, all the seats that were available were up for payment only. No seat was available for free, whatever the preference. As no seat was allocated on buying the ticket, what was the ticket price for, to travel standing? Crypto scammer got scammed by aviation scammer. Peak capitalism. As if PM CARES . In theory - a free workaround is that you do the check in at the airport in person at the airline counter, and ask for a seat of preference. But yes - this is an inconvenience specifically arranged for by the airline, that part is undeniable He says he was not able to book ticket in first place without taking a seat. He was not able to pay without that part. When you dont have PNR how are you going to go to airport and check in?! Also Indigo is such an evilish company they will charge you for booking tickets at their reservation counter. If you want print of your booking ticket, they charge you 100₹, at the airport. Recently they stopped selling cold drinks too. If you want cold drinks buy their combo meal. Don't they charge for in person check in though? The ticket price does not include a seat. You need to pay an additional 200-300 bucks for a seat of your choice. If you want a free seat then you will automatically be assigned one when the boarding pass is generated. Who pays for the paper, water, air etc in the washroom? Pay for it too! Round trip only includes the walk way/aisle usage. Extras are better.. more GST! That i didn’t know! They charge. DGCA did say something the other day about this Extra amount is for the choice of choosing a seat. That's why I mentioned if you want a free seat you have to wait for one to be assigned automatically. “Crypto Gabbar” crying about fairness. They've started charging an extra fee for checking in at the airport The original comment literally mentions “I was not able to get a random free seat and I was forced to pay extra for seats” My bad, I misunderstood Ahh, cool. That makes sense. I don't understand. I have never been charged for in person check-in, that doesn't make sense. I'm travelling Indigo regularly since 4-5 years. What gives? since when? And when do they charge it, at the check in counters? They've stopped charging for check-in at counters since last year. What’s wrong with the Hindustan Times? I’m not sure if I’m alone in having these issues, but every time I try to open this article—or any other page on the same site—I keep getting McDonald’s pop-up ads that continuously reappear after being cleared. > round trip to washroom As opposed to a one-way ticket where you're locked in the toilet for the rest of the journey :) Fuck you I'm staying Inspired by modi. Pay road tax and gst . Then pay toll tax and 300% fuel taxes"
}