{
    "id": "15uhlo6",
    "title": "Academics of India, what's the situation on the ground?",
    "url": "https://www.reddit.com/r/india/comments/15uhlo6/academics_of_india_whats_the_situation_on_the/",
    "selftext": "The recent [firing](https://www.hindustantimes.com/india-news/who-is-karan-sangwan-the-educator-sacked-by-unacademy-over-viral-video-101692334880910.html) of a teacher from Unacademy and the [resignations](https://www.telegraphindia.com/india/ashoka-university-economics-professor-speaks-up-on-his-decision-to-step-down/cid/1959706) from Ashoka University have made quite a dent to academic freedom. These have been covered extensively by non-mainstream media outlets. But again, there is the ground reality which is different from what gets reported and what does not. \n\nSo I have the following questions.\n1) How is it like for you to publish work related to the Indian government? \n2) How does the international research community view you these days? \n3) How much do you have to censor your work?\n4) What is your opinion on overall academic freedom in India?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692357159.0,
    "convurl": "https://external-preview.redd.it/u9-lGL2tx3rqFwPBnceh7UW1IkQ_X21B7E80Bf9rc8I.jpg?auto=webp&s=fc793700ed87d1f37ddbf33757c64f1cdb63b1b9",
    "comments": [
        "This is nothing new in India. For years any real capitalism was intentionally and forcefully kept out of academia because we were a dedicated socialist country. The only thing that has changed thanks to social media is that now even regular citizens are getting involved in the cancel culture and putting pressure on institutions to follow their ideology and bar those against the prevailing ideology"
    ],
    "cleaned_text": "academics india whats situation ground recent firinghttpswwwhindustantimescomindianewswhoiskaransangwantheeducatorsackedbyunacademyoverviralvideohtml teacher unacademy resignationshttpswwwtelegraphindiacomindiaashokauniversityeconomicsprofessorspeaksuponhisdecisiontostepdowncid ashoka university made quite dent academic freedom covered extensively nonmainstream media outlets ground reality different gets reported following questions like publish work related indian government international research community view days much censor work opinion overall academic freedom india ",
    "cleaned_title": "academics india whats situation ground",
    "cleaned_selftext": "recent firinghttpswwwhindustantimescomindianewswhoiskaransangwantheeducatorsackedbyunacademyoverviralvideohtml teacher unacademy resignationshttpswwwtelegraphindiacomindiaashokauniversityeconomicsprofessorspeaksuponhisdecisiontostepdowncid ashoka university made quite dent academic freedom covered extensively nonmainstream media outlets ground reality different gets reported following questions like publish work related indian government international research community view days much censor work opinion overall academic freedom india",
    "cleaned_comments": "nothing new india years real capitalism intentionally forcefully kept academia dedicated socialist country thing changed thanks social media even regular citizens getting involved cancel culture putting pressure institutions follow ideology bar prevailing ideology",
    "light_cleaned_title": "Academics of India, what's the situation on the ground?",
    "light_cleaned_selftext": "The recent [firing](https://www.hindustantimes.com/india-news/who-is-karan-sangwan-the-educator-sacked-by-unacademy-over-viral-video-101692334880910.html) of a teacher from Unacademy and the [resignations](https://www.telegraphindia.com/india/ashoka-university-economics-professor-speaks-up-on-his-decision-to-step-down/cid/1959706) from Ashoka University have made quite a dent to academic freedom. These have been covered extensively by non-mainstream media outlets. But again, there is the ground reality which is different from what gets reported and what does not. So I have the following questions. 1) How is it like for you to publish work related to the Indian government? 2) How does the international research community view you these days? 3) How much do you have to censor your work? 4) What is your opinion on overall academic freedom in India?",
    "light_cleaned_comments": "This is nothing new in India. For years any real capitalism was intentionally and forcefully kept out of academia because we were a dedicated socialist country. The only thing that has changed thanks to social media is that now even regular citizens are getting involved in the cancel culture and putting pressure on institutions to follow their ideology and bar those against the prevailing ideology"
}