{
    "id": "1d44vii",
    "title": "Looks like someone’s mocking through someone with the Indian Trade Policies",
    "url": "https://www.financialexpress.com/business/defence-no-proposal-made-mea-rejects-maldives-ministers-claim-on-fta-3507513/",
    "selftext": "No Proposal Made: MEA Rejects Maldives Minister’s Claim on FTA\n\nThe recent romance between China & Maldives. The recent removal of Indian Defense forces from the islands, officially, then this. It’s clear that someone’s toying around with the already dented trade policies of our country. This is just a beginning of trade war, maybe?\n",
    "flair": "Policy/Economy",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1717077983.0,
    "convurl": "https://external-preview.redd.it/OtZD0v571ZgJc-eD2dEma-Od3u6WecVZcoAolSzH69E.jpg?auto=webp&s=5ee1a5ce12ede2ccbe7dd147e3cffbf14d56268a",
    "comments": [],
    "cleaned_text": "looks like someones mocking someone indian trade policies proposal made mea rejects maldives ministers claim fta recent romance china maldives recent removal indian defense forces islands officially clear someones toying around already dented trade policies country beginning trade war maybe ",
    "cleaned_title": "looks like someones mocking someone indian trade policies",
    "cleaned_selftext": "proposal made mea rejects maldives ministers claim fta recent romance china maldives recent removal indian defense forces islands officially clear someones toying around already dented trade policies country beginning trade war maybe",
    "cleaned_comments": "",
    "light_cleaned_title": "Looks like someone’s mocking through someone with the Indian Trade Policies",
    "light_cleaned_selftext": "No Proposal Made: MEA Rejects Maldives Minister’s Claim on FTA The recent romance between China & Maldives. The recent removal of Indian Defense forces from the islands, officially, then this. It’s clear that someone’s toying around with the already dented trade policies of our country. This is just a beginning of trade war, maybe?",
    "light_cleaned_comments": ""
}