{
    "id": "12gfc2c",
    "title": "I'm appalled that cancers like this are spreading throughout India without any resistance.",
    "url": "https://www.reddit.com/r/india/comments/12gfc2c/im_appalled_that_cancers_like_this_are_spreading/",
    "selftext": "Video 1: [Rome was named after ram](https://www.youtube.com/shorts/lIm7rpdecoU)\n\nVideo 2: [Egypt was named after ram's grandfather](https://www.youtube.com/shorts/F7N8IE4nsdg)\n\nVideo 3: [Rome was named after ram part 2 (ft. how it was established on ram navami)](https://shorturl.at/bhnU0)\n\nI feel like this is the perfect example of \"presentation matters more than content\". You can say shit like this and people will eat it up.\n\nMany people follow ISKCON and this liar, and a lot of them accept these without hesitation. I don't know what to feel, whether to be angry at this cheat or be sad for the people agreeing to this.",
    "flair": "Rant / Vent",
    "score": 177,
    "num_comments": 60,
    "created_utc": 1681035233.0,
    "convurl": "https://external-preview.redd.it/lw5twm1fEZvwC7H2wJZlQdpJrlsC3qythDSSAAOye4o.jpg?auto=webp&v=enabled&s=27849f1ac30987f2acac7cf71188cbe153b692c6",
    "comments": [
        "Ahahahaha it is shocking but that's the truth\n\nThese days, religion stuff sells like water... no one cares \n\nAnd above all, the mass agrees",
        "Just for fun - https://twitter.com/adityavnayak/status/1643202754004017152.",
        "Indians were always like this. Now government support is there, that's the only difference.",
        "Is this the same guy who promoted child marriage?",
        "100% ...u don't need any credibility to spread info and people take things at face value. Such a bad time to be on internet 🥲",
        "Yes, this is the same douchebag",
        "Most people are braindead, just use their dumbness to your advantage, let them be, dont complain.",
        "By this logic  Ram is a sheep because male sheep are called Ram",
        "Easiest way to become rich: become an educated baba and spread bullshit. Just have to be bit knowledgeable about vedas and show a few gimmick chamatkars. Andh viswas is the downfall of our country.",
        "Now they atleast can't call Sonia Gandhi, a foreigner. She's from land of Ram.",
        "And when you try to tell the idiots who believe this that is is nonsense, they will say Western media is brainwashing us.",
        "Vatican city is named after Ashok Vatika.  \n\n\n(PS: Vatican and Vatika both mean garden though)",
        "Romulus to this guy - \"Am I a joke to you?\"",
        "😅",
        "but it´s 100% confirmed... \n\nclever to mute the comments, so nobody can call him liar....",
        "Samajh me nahi aata ki hasu ya roun ye sab dekhke\n\nAndher nagri chaupat raja",
        "[Ye sab kya dekhna pad raha hai. Acha hai mai andha hoon.](https://www.youtube.com/watch?v=jYJFYrCvZ4s)",
        "Iskcon is just better off and accurate without the Isk. \n\nComplete dumbshits.",
        "What is this?????",
        "Looks like someone hasn't heard of Remus and Romulus",
        "Bewkufo ki koi kami nhi hamare Desh mein aur unhi bewkufo ko bewkuf banane walon ki bhi koi kami nhi hai.",
        "Do they have English versions anywhere?",
        "Fun fact - “Romulus was named after Ram”",
        "Wait...the majority population in MizoRAM is christian...!!!",
        "What a time to be alive in the country, you can pedal any shit in the name of religion. \n\nPs - only upside, the memes are fun",
        "Battering ram",
        "I thought you were gonna discuss about the actual cancer.\n\nThis shit is prevalent and idc about it.",
        "Wasn't this guy on beer biceps podcast.  Bro that podcast has turned into a mouthpiece for misinformation smh",
        "Uno Reverse",
        "Whataboutism 101",
        "We have our own versions of Zakir Naik.",
        "NO actually English just a cheap rip off of sanskrit, Duh\n\n/s",
        "Thanks to BeeJayyPeee.",
        "Computers can not run without RAM.",
        "Something like video 1 in OP’s description!",
        "Tejo Mahalaya?\n\nMade by Aliens.\n\nFor RAM...",
        "That’s deep XD",
        "Whataboutism is the only thing one have to say about it, ????\n\never heard about chattambi swamikal, he has written a book on church misdeeds almost a hundred years back.\n\nSo one can endorse some and one can hate others do the thing for decades? Around 25000 churches are there in kerala, and number was growing till the current central govt wanted details of how these foreign funds be used.\n\nNot even the current state govt wont allow; even forced a minister to apologise formally when he publicly visited Guruvayoor temple and prayed, at the same time allows hajj and churches missdeeds.\n\nHindus in kerala is forced to be part of CPM and live like underdogs and are being abused\n\nI hate both!",
        "Converted them, in TNAndra it is happening",
        "Whataboutism is the only thing one have to say about it, ????\n\never heard about chattambi swamikal, he has written a book on church misdeeds almost a hundred years back.\n\nSo one can endorse some and one can hate others do the thing for decades? Around 25000 churches are there in kerala, and number was growing till the current central govt wanted details of how these foreign funds be used.\n\nNot even the current state govt wont allow; even forced a minister to apologise formally when he publicly visited Guruvayoor temple and prayed, at the same time allows hajj and churches missdeeds.\n\nHindus in kerala is forced to be part of CPM and live like underdogs and are being abused\n\nI hate both!",
        "Australia - अस्त्र लिया ( रामायण कालीन आयुध भंडार)",
        "Luxembourg - लक्ष्मण वर्ग ( इसके पर के भू भाग पर लक्ष्मण का अधिकार था)",
        "I have a question. Who is he?",
        "You know, there's this concept of average IQ of a country. Not sure how they measure it, but shall we put it this way that Indians did not amaze anyone. We were probably not even in the top 50.\n\nI'm not saying all of us are dumb, I'm sure you there's a bell shaped curve to this distribution. The point is that even the top 0.1% of us = 14 lakh people which is a huge number. These are the people who go on to achieve something brilliant. The rest of us are there to cheer and forward it amongst ourselves on WhatsApp.\n\n/end of rant",
        "Gotta start one of those.",
        "By that logic Great White Sharks are Hindus, cause they breathe through Ram Ventilation.",
        "I am more of a siege ram guy",
        "But at the same time some people still believe that one messenger flew from A to B on a donkey and only witness of the miracle was, the donkey. While another messenger walked on water.",
        "Idk about Rome cause Greeks had connection to India through Alexander The Great. But Egypt was named wayyy before hindu civilization or mythology indus mythology is a near it.",
        "Duh he was Ramulus",
        "Wow! Is that just a coincidence or is there some reason behind it?",
        "My guess is Proto-Indo-European languages family root. Same source for both the words.",
        "Ok so I searched for the meaning of Vatican and got nothing about gardens lol",
        "Waiting for RAM = Ram’s Ayodhya Memories",
        "Haha, I stand corrected.  \n\n\nI had checked this some time back. Now it seems all sources have changed :D",
        "8gb Ram"
    ],
    "cleaned_text": "im appalled cancers like spreading throughout india without resistance video rome named ramhttpswwwyoutubecomshortslimrpdecou video egypt named rams grandfatherhttpswwwyoutubecomshortsfniensdg video rome named ram part ft established ram navamihttpsshorturlatbhnu feel like perfect example presentation matters content say shit like people eat many people follow iskcon liar lot accept without hesitation dont know feel whether angry cheat sad people agreeing ",
    "cleaned_title": "im appalled cancers like spreading throughout india without resistance",
    "cleaned_selftext": "video rome named ramhttpswwwyoutubecomshortslimrpdecou video egypt named rams grandfatherhttpswwwyoutubecomshortsfniensdg video rome named ram part ft established ram navamihttpsshorturlatbhnu feel like perfect example presentation matters content say shit like people eat many people follow iskcon liar lot accept without hesitation dont know feel whether angry cheat sad people agreeing",
    "cleaned_comments": "ahahahaha shocking thats truth days religion stuff sells like water one cares mass agrees fun indians always like government support thats difference guy promoted child marriage u dont need credibility spread info people take things face value bad time internet yes douchebag people braindead use dumbness advantage let dont complain logic ram sheep male sheep called ram easiest way become rich become educated baba spread bullshit bit knowledgeable vedas show gimmick chamatkars andh viswas downfall country atleast cant call sonia gandhi foreigner shes land ram try tell idiots believe nonsense say western media brainwashing us vatican city named ashok vatika ps vatican vatika mean garden though romulus guy joke confirmed clever mute comments nobody call liar samajh nahi aata ki hasu ya roun ye sab dekhke andher nagri chaupat raja ye sab kya dekhna pad raha hai acha hai mai andha hoonhttpswwwyoutubecomwatchvjyjfyrcvzs iskcon better accurate without isk complete dumbshits looks like someone hasnt heard remus romulus bewkufo ki koi kami nhi hamare desh mein aur unhi bewkufo ko bewkuf banane walon ki bhi koi kami nhi hai english versions anywhere fun fact romulus named ram waitthe majority population mizoram christian time alive country pedal shit name religion ps upside memes fun battering ram thought gon na discuss actual cancer shit prevalent idc wasnt guy beer biceps podcast bro podcast turned mouthpiece misinformation smh uno reverse whataboutism versions zakir naik actually english cheap rip sanskrit duh thanks beejayypeee computers run without ram something like video ops description tejo mahalaya made aliens ram thats deep xd whataboutism thing one say ever heard chattambi swamikal written book church misdeeds almost hundred years back one endorse one hate others thing decades around churches kerala number growing till current central govt wanted details foreign funds used even current state govt wont allow even forced minister apologise formally publicly visited guruvayoor temple prayed time allows hajj churches missdeeds hindus kerala forced part cpm live like underdogs abused hate converted tnandra happening whataboutism thing one say ever heard chattambi swamikal written book church misdeeds almost hundred years back one endorse one hate others thing decades around churches kerala number growing till current central govt wanted details foreign funds used even current state govt wont allow even forced minister apologise formally publicly visited guruvayoor temple prayed time allows hajj churches missdeeds hindus kerala forced part cpm live like underdogs abused hate australia luxembourg question know theres concept average iq country sure measure shall put way indians amaze anyone probably even top im saying us dumb im sure theres bell shaped curve distribution point even top us lakh people huge number people go achieve something brilliant rest us cheer forward amongst whatsapp end rant got ta start one logic great white sharks hindus cause breathe ram ventilation siege ram guy time people still believe one messenger flew b donkey witness miracle donkey another messenger walked water idk rome cause greeks connection india alexander great egypt named wayyy hindu civilization mythology indus mythology near duh ramulus wow coincidence reason behind guess protoindoeuropean languages family root source words ok searched meaning vatican got nothing gardens lol waiting ram rams ayodhya memories haha stand corrected checked time back seems sources changed gb ram",
    "light_cleaned_title": "I'm appalled that cancers like this are spreading throughout India without any resistance.",
    "light_cleaned_selftext": "Video 1: [Rome was named after ram](https://www.youtube.com/shorts/lIm7rpdecoU) Video 2: [Egypt was named after ram's grandfather](https://www.youtube.com/shorts/F7N8IE4nsdg) Video 3: [Rome was named after ram part 2 (ft. how it was established on ram navami)](https://shorturl.at/bhnU0) I feel like this is the perfect example of \"presentation matters more than content\". You can say shit like this and people will eat it up. Many people follow ISKCON and this liar, and a lot of them accept these without hesitation. I don't know what to feel, whether to be angry at this cheat or be sad for the people agreeing to this.",
    "light_cleaned_comments": "Ahahahaha it is shocking but that's the truth These days, religion stuff sells like water... no one cares And above all, the mass agrees Just for fun - Indians were always like this. Now government support is there, that's the only difference. Is this the same guy who promoted child marriage? 100% ...u don't need any credibility to spread info and people take things at face value. Such a bad time to be on internet 🥲 Yes, this is the same douchebag Most people are braindead, just use their dumbness to your advantage, let them be, dont complain. By this logic Ram is a sheep because male sheep are called Ram Easiest way to become rich: become an educated baba and spread bullshit. Just have to be bit knowledgeable about vedas and show a few gimmick chamatkars. Andh viswas is the downfall of our country. Now they atleast can't call Sonia Gandhi, a foreigner. She's from land of Ram. And when you try to tell the idiots who believe this that is is nonsense, they will say Western media is brainwashing us. Vatican city is named after Ashok Vatika. (PS: Vatican and Vatika both mean garden though) Romulus to this guy - \"Am I a joke to you?\" 😅 but it´s 100% confirmed... clever to mute the comments, so nobody can call him liar.... Samajh me nahi aata ki hasu ya roun ye sab dekhke Andher nagri chaupat raja [Ye sab kya dekhna pad raha hai. Acha hai mai andha hoon.](https://www.youtube.com/watch?v=jYJFYrCvZ4s) Iskcon is just better off and accurate without the Isk. Complete dumbshits. What is this????? Looks like someone hasn't heard of Remus and Romulus Bewkufo ki koi kami nhi hamare Desh mein aur unhi bewkufo ko bewkuf banane walon ki bhi koi kami nhi hai. Do they have English versions anywhere? Fun fact - “Romulus was named after Ram” Wait...the majority population in MizoRAM is christian...!!! What a time to be alive in the country, you can pedal any shit in the name of religion. Ps - only upside, the memes are fun Battering ram I thought you were gonna discuss about the actual cancer. This shit is prevalent and idc about it. Wasn't this guy on beer biceps podcast. Bro that podcast has turned into a mouthpiece for misinformation smh Uno Reverse Whataboutism 101 We have our own versions of Zakir Naik. NO actually English just a cheap rip off of sanskrit, Duh /s Thanks to BeeJayyPeee. Computers can not run without RAM. Something like video 1 in OP’s description! Tejo Mahalaya? Made by Aliens. For RAM... That’s deep XD Whataboutism is the only thing one have to say about it, ???? ever heard about chattambi swamikal, he has written a book on church misdeeds almost a hundred years back. So one can endorse some and one can hate others do the thing for decades? Around 25000 churches are there in kerala, and number was growing till the current central govt wanted details of how these foreign funds be used. Not even the current state govt wont allow; even forced a minister to apologise formally when he publicly visited Guruvayoor temple and prayed, at the same time allows hajj and churches missdeeds. Hindus in kerala is forced to be part of CPM and live like underdogs and are being abused I hate both! Converted them, in TNAndra it is happening Whataboutism is the only thing one have to say about it, ???? ever heard about chattambi swamikal, he has written a book on church misdeeds almost a hundred years back. So one can endorse some and one can hate others do the thing for decades? Around 25000 churches are there in kerala, and number was growing till the current central govt wanted details of how these foreign funds be used. Not even the current state govt wont allow; even forced a minister to apologise formally when he publicly visited Guruvayoor temple and prayed, at the same time allows hajj and churches missdeeds. Hindus in kerala is forced to be part of CPM and live like underdogs and are being abused I hate both! Australia - अस्त्र लिया ( रामायण कालीन आयुध भंडार) Luxembourg - लक्ष्मण वर्ग ( इसके पर के भू भाग पर लक्ष्मण का अधिकार था) I have a question. Who is he? You know, there's this concept of average IQ of a country. Not sure how they measure it, but shall we put it this way that Indians did not amaze anyone. We were probably not even in the top 50. I'm not saying all of us are dumb, I'm sure you there's a bell shaped curve to this distribution. The point is that even the top 0.1% of us = 14 lakh people which is a huge number. These are the people who go on to achieve something brilliant. The rest of us are there to cheer and forward it amongst ourselves on WhatsApp. /end of rant Gotta start one of those. By that logic Great White Sharks are Hindus, cause they breathe through Ram Ventilation. I am more of a siege ram guy But at the same time some people still believe that one messenger flew from A to B on a donkey and only witness of the miracle was, the donkey. While another messenger walked on water. Idk about Rome cause Greeks had connection to India through Alexander The Great. But Egypt was named wayyy before hindu civilization or mythology indus mythology is a near it. Duh he was Ramulus Wow! Is that just a coincidence or is there some reason behind it? My guess is Proto-Indo-European languages family root. Same source for both the words. Ok so I searched for the meaning of Vatican and got nothing about gardens lol Waiting for RAM = Ram’s Ayodhya Memories Haha, I stand corrected. I had checked this some time back. Now it seems all sources have changed :D 8gb Ram"
}