{
    "id": "gx7i0p",
    "title": "RWA : Install Aarogya Sety now! Our response, \"Uncle Please Sit!\". Meant for Whatsapp RWA Groups!",
    "url": "https://www.reddit.com/r/india/comments/gx7i0p/rwa_install_aarogya_sety_now_our_response_uncle/",
    "selftext": "Our RWA’s have over the course of the pandemic morphed from the genial coercion of comparison (“sharma jee ka beta”) to more direct  forms of control. Nothing typecasts this more than the compulsion to  install Aarogya Setu.\n\nAs we explained in this post, they are not only being incredibly  annoying but this is also illegal. Now, to help you organize a friendly  set of residents to push back we have created info-graphics. They are  aimed for social and Whatsapp sharing. All facts and assertions are  legally vetted.\n\nSo share away. And if it triggers your judgemental RWA president or secretary, just respond with the hashtag, #UnclePleaseSit!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/77u4nfzr84351.jpg?width=1241&amp;format=pjpg&amp;auto=webp&amp;s=be679ecfa933548fd317033118932d9800fbdb81\n\n&amp;#x200B;\n\nhttps://preview.redd.it/81bvphys84351.jpg?width=1241&amp;format=pjpg&amp;auto=webp&amp;s=1fbbe480358f48393ee1349949db565192e80617",
    "flair": "Policy/Economy",
    "score": 108,
    "num_comments": 23,
    "created_utc": 1591373535,
    "convurl": "https://b.thumbs.redditmedia.com/NNuokaV_vj3Lkdbl7EbARWbIUxILp6FWYsC4cymI86A.jpg",
    "comments": [
        "“Theek hai”",
        "Elders must be respected in the group. ^(/s)",
        "Umm, the readability of the posts is not good. I am not trying to shit on you. I am a designer and I am suggesting you do something about the typeface for the non-headings or at least darken the orange you have used for the background. Please don't get offended.",
        "This upvote is solely for your profile name.",
        "Thank you! This is our first infographic and we will try to do better. Would you like to try your hand at a version of this? It would be of great value not only to us but the wider community!",
        "Make these in Hindi too. I can tell almost 95% of the unkills who see this won't even read it in English but maybe if it's in Hindi they'll read.",
        "I'm currently working on something, but I'll send you a modified version in a bit.",
        "Thank you! We will certainly circulate it with proper credits!",
        "Thanks, we hope to done another version of this next week.",
        "Here you go. It's not the Mona Lisa, but I think it reads better than the original posts.\n\n[One](https://i.imgur.com/0Cn9b1a.jpg) and [Two.](https://i.imgur.com/EqBSi8U.jpg).\n\nEdit: I just added a social media (square version) of the same thing. I was too tired to create a new one, so I did some jugaad. [First one](https://i.imgur.com/aVLf6yu.jpg) and the [second one.](https://i.imgur.com/VndUJDE.jpg). Hope this helps.",
        "It's great. I was not able to point what exactly was wrong, but it was hurting my eyes",
        "It's great. I was not able to point what exactly was wrong, but it was hurting my eyes",
        "Wow, much better than the original ones.",
        "Do you mean the original one? I think it's because the background is relatively light, and the text is white, so your eyes have to work a little harder. Furthermore, the typeface being too thin and the spacing between each letter being more pours out the light background from between the letters.\n\nIs the readability in the newer version better? I can't honestly judge it because I have been staring at that whilst working on it.",
        "Yes, new one is far better",
        "Funniest shit I have seen today, thanks for pointing it out..",
        "Right? Had a ROFL moment myself after seeing this.",
        "That name gets an upvote.",
        "Ekkees toppon ki salaami for President RamnathCovid-19",
        "Lmao. Where's the laughing emoji when you need one?!",
        "😁😁",
        "Put some Modi faces on it to make people listen lol",
        "RWA are going to become Khap Panchayats in the future",
        "This is so good!! We are posting this on forum.internetfreedom.in and also circulating it!"
    ],
    "cleaned_text": "rwa install aarogya sety response uncle please sit meant whatsapp rwa groups rwas course pandemic morphed genial coercion comparison sharma jee ka beta direct forms control nothing typecasts compulsion install aarogya setu explained post incredibly annoying also illegal help organize friendly set residents push back created infographics aimed social whatsapp sharing facts assertions legally vetted share away triggers judgemental rwa president secretary respond hashtag unclepleasesit ampxb ampxb ",
    "cleaned_title": "rwa install aarogya sety response uncle please sit meant whatsapp rwa groups",
    "cleaned_selftext": "rwas course pandemic morphed genial coercion comparison sharma jee ka beta direct forms control nothing typecasts compulsion install aarogya setu explained post incredibly annoying also illegal help organize friendly set residents push back created infographics aimed social whatsapp sharing facts assertions legally vetted share away triggers judgemental rwa president secretary respond hashtag unclepleasesit ampxb ampxb",
    "cleaned_comments": "theek hai elders must respected group umm readability posts good trying shit designer suggesting something typeface nonheadings least darken orange used background please dont get offended upvote solely profile name thank first infographic try better would like try hand version would great value us wider community make hindi tell almost unkills see wont even read english maybe hindi theyll read im currently working something ill send modified version bit thank certainly circulate proper credits thanks hope done another version next week go mona lisa think reads better original posts onehttpsiimgurcomcnbajpg twohttpsiimgurcomeqbsiujpg edit added social media square version thing tired create new one jugaad first onehttpsiimgurcomavlfyujpg second onehttpsiimgurcomvndujdejpg hope helps great able point exactly wrong hurting eyes great able point exactly wrong hurting eyes wow much better original ones mean original one think background relatively light text white eyes work little harder furthermore typeface thin spacing letter pours light background letters readability newer version better cant honestly judge staring whilst working yes new one far better funniest shit seen today thanks pointing right rofl moment seeing name gets upvote ekkees toppon ki salaami president ramnathcovid lmao wheres laughing emoji need one put modi faces make people listen lol rwa going become khap panchayats future good posting foruminternetfreedomin also circulating",
    "light_cleaned_title": "RWA : Install Aarogya Sety now! Our response, \"Uncle Please Sit!\". Meant for Whatsapp RWA Groups!",
    "light_cleaned_selftext": "Our RWA’s have over the course of the pandemic morphed from the genial coercion of comparison (“sharma jee ka beta”) to more direct forms of control. Nothing typecasts this more than the compulsion to install Aarogya Setu. As we explained in this post, they are not only being incredibly annoying but this is also illegal. Now, to help you organize a friendly set of residents to push back we have created info-graphics. They are aimed for social and Whatsapp sharing. All facts and assertions are legally vetted. So share away. And if it triggers your judgemental RWA president or secretary, just respond with the hashtag, #UnclePleaseSit!",
    "light_cleaned_comments": "“Theek hai” Elders must be respected in the group. ^(/s) Umm, the readability of the posts is not good. I am not trying to shit on you. I am a designer and I am suggesting you do something about the typeface for the non-headings or at least darken the orange you have used for the background. Please don't get offended. This upvote is solely for your profile name. Thank you! This is our first infographic and we will try to do better. Would you like to try your hand at a version of this? It would be of great value not only to us but the wider community! Make these in Hindi too. I can tell almost 95% of the unkills who see this won't even read it in English but maybe if it's in Hindi they'll read. I'm currently working on something, but I'll send you a modified version in a bit. Thank you! We will certainly circulate it with proper credits! Thanks, we hope to done another version of this next week. Here you go. It's not the Mona Lisa, but I think it reads better than the original posts. [One](https://i.imgur.com/0Cn9b1a.jpg) and [Two.](https://i.imgur.com/EqBSi8U.jpg). Edit: I just added a social media (square version) of the same thing. I was too tired to create a new one, so I did some jugaad. [First one](https://i.imgur.com/aVLf6yu.jpg) and the [second one.](https://i.imgur.com/VndUJDE.jpg). Hope this helps. It's great. I was not able to point what exactly was wrong, but it was hurting my eyes It's great. I was not able to point what exactly was wrong, but it was hurting my eyes Wow, much better than the original ones. Do you mean the original one? I think it's because the background is relatively light, and the text is white, so your eyes have to work a little harder. Furthermore, the typeface being too thin and the spacing between each letter being more pours out the light background from between the letters. Is the readability in the newer version better? I can't honestly judge it because I have been staring at that whilst working on it. Yes, new one is far better Funniest shit I have seen today, thanks for pointing it out.. Right? Had a ROFL moment myself after seeing this. That name gets an upvote. Ekkees toppon ki salaami for President RamnathCovid-19 Lmao. Where's the laughing emoji when you need one?! 😁😁 Put some Modi faces on it to make people listen lol RWA are going to become Khap Panchayats in the future This is so good!! We are posting this on forum.internetfreedom.in and also circulating it!"
}