{
    "id": "1b1rw4q",
    "title": "Punjab Police fail to prove high-profile UAPA case using SGPC magazine copies, 3 acquitted",
    "url": "https://indianexpress.com/article/cities/chandigarh/punjab-police-fail-prove-uapa-case-sgpc-magazine-copies-9184231/",
    "selftext": "Additional Sessions Judge Karunesh Kumar acquitted one accused, Satwinder Singh, of all charges",
    "flair": "Law & Courts",
    "score": 23,
    "num_comments": 1,
    "created_utc": 1709079795.0,
    "convurl": "https://external-preview.redd.it/eSHYiCzO4LfHpaDndHsDT8HHJT8fznhBDCVC5quhXW4.jpg?auto=webp&s=33c1baea592ce8bf3a03147efb0f08de194b8b91",
    "comments": [
        "From the article:\n\nA court in Punjab’s Shaheed Bhagat Singh Nagar district on Monday acquitted three men accused of being trained and tasked by Pakistan’s Inter-Services Intelligence (ISI) to carry out terror attacks in India of charges under the Unlawful Activities (Prevention) Act.\n\nAdditional Sessions Judge Karunesh Kumar acquitted one accused, Satwinder Singh, of all charges. The court found the other two — Gurdial Singh and Jagroop Singh — guilty under Section 25 of the Arms Act and sentenced them to one year’s imprisonment.\n\nHowever, since both accused had already served more than three years in jail, the court maintained that the period of imprisonment already undergone by the convicts during inquiry, investigation or trial of this case be set off from the substantiate sentences to be undergone by them.\nWhat was the case about?\n\nWith the arrest of Gurdial Singh, Jagroop Singh and Satwinder Singh on June 4, 2017, the Punjab Police claimed to have busted a terror module having links with the ISI-backed banned outfit International Sikh Youth Federation (ISYF).\nThis was a high-profile case as it was also part of the 23-page dossier on alleged terror activity from Pakistan against India and handed over to neighbour county diplomats on July 14, 2019, during the Kartarpur Corridor talks at the Wagah border.\n\nAll the accused were allegedly linked to Pakistan-based Lakhbir Singh Rode and Harmeet Singh alias Happy, both dead now, and the trio had been charge-sheeted under Sections 15, 16, 17 & 18 of UAPA.\n\nApart from their bank account and passbooks, the police produced documents, including Shiromani Gurdwara Parbandhak Committee (SGPC) monthly magazine Gurmat Parkash copies of September 2004, August 2004 and July 2001. Gurmat Parkash is a monthly Punjabi magazine published by SGPC’s Dharam Prachar Committee since 1957.\nApart from this, a diary for 2011 published by the Pakistan Sikh Gurdwara Parbandhak Committee (PSGPC), and copies of the monthly magazine Vangaar from February, March, April, May, July, September, October and December 2016 and January 2017 were recovered from the accused. Vangar is considered a pro-Khalistan monthly magazine.\n\nNothing incriminating found, says court\nThe judgment reads, “But the mere recovery of these above-referred documents from the possession of the accused is not sufficient to fulfill the ingredients of Sections 121, 121-A, 120-B of IPC and Sections 15, 16, 17 & 18 of Unlawful Activities Prevention Act, 1967.”\n\n“Sub Inspector Rajiv Kumar has admitted during cross-examination that bank account and passbooks are not incriminating in nature. He further admits that copies of Gurmat Prakash and the diary of PSGPC are not incriminating in nature. Though he has stated that copies of Vangar magazine can be incriminating in nature but investigating officer of the case, namely DSP Gagandeep Singh, has categorically admitted during his cross-examination that all the magazines of ‘Gurmukh Prakash’ and ‘Vangaar’ are registered magazines and not prohibited by any government. Thus, meaning thereby, these magazines titled as ‘Gurmukh Prakash’ and ‘Vangaar’ can not be taken as incriminating substance, which has been allegedly got recovered from the possession of accused,” the court said.\nThe court said the case’s investigating officer admitted in clear terms that no evidence was collected during the investigation regarding the participation of the accused in the unlawful activities or otherwise.\n\nThe accused had visited Gurudwaras in Pakistan and they were accused of developing terror links during their visit. On this, the court said, “DSP further admits that to visit Pakistan for the visit of Gurudwara and other religious places is not illegal and it is not a crime. It has further been admitted by this witness that at the time of arrest of accused, nothing incriminating was found from them.”\n\n“Thus, from the above-discussed evidence, this fact has become crystal clear that there is absolutely no evidence on the file that all the three accused conspired together to commit wage war against the Government of India and other states of India or they had committed an act with intent to threaten or likely to threat the unity, integrity, security or sovereignty of India or with intent to strike terror or likely to strike terror in people of India.”\n\n“Even, the documents/magazines allegedly got recovered from the possession of the accused were not prohibited by the Government of India. Not even an iota of evidence has come on record that the accused ever raised any funds from a foreign country for committing any terrorist act in India, rather, it has been admitted by the investigating officer that the accused Gurdial Singh, Jagroop Singh and Satwinder Singh never raised or collected any funds.”\n\n“Even, the prosecution has failed to establish on record that all these accused were members of any Banned Organization International Sikh Youth Federation. Thus, prosecution has utterly failed to prove the ingredient of Sections 121, 121-A, 120-B of IPC and Section 15, 16, 17 and 18 of Unlawful Activities Prevention Act, 1967,” concluded the court."
    ],
    "cleaned_text": "punjab police fail prove highprofile uapa case using sgpc magazine copies acquitted additional sessions judge karunesh kumar acquitted one accused satwinder singh charges ",
    "cleaned_title": "punjab police fail prove highprofile uapa case using sgpc magazine copies acquitted",
    "cleaned_selftext": "additional sessions judge karunesh kumar acquitted one accused satwinder singh charges",
    "cleaned_comments": "article court punjabs shaheed bhagat singh nagar district monday acquitted three men accused trained tasked pakistans interservices intelligence isi carry terror attacks india charges unlawful activities prevention act additional sessions judge karunesh kumar acquitted one accused satwinder singh charges court found two gurdial singh jagroop singh guilty section arms act sentenced one years imprisonment however since accused already served three years jail court maintained period imprisonment already undergone convicts inquiry investigation trial case set substantiate sentences undergone case arrest gurdial singh jagroop singh satwinder singh june punjab police claimed busted terror module links isibacked banned outfit international sikh youth federation isyf highprofile case also part page dossier alleged terror activity pakistan india handed neighbour county diplomats july kartarpur corridor talks wagah border accused allegedly linked pakistanbased lakhbir singh rode harmeet singh alias happy dead trio chargesheeted sections uapa apart bank account passbooks police produced documents including shiromani gurdwara parbandhak committee sgpc monthly magazine gurmat parkash copies september august july gurmat parkash monthly punjabi magazine published sgpcs dharam prachar committee since apart diary published pakistan sikh gurdwara parbandhak committee psgpc copies monthly magazine vangaar february march april may july september october december january recovered accused vangar considered prokhalistan monthly magazine nothing incriminating found says court judgment reads mere recovery abovereferred documents possession accused sufficient fulfill ingredients sections b ipc sections unlawful activities prevention act sub inspector rajiv kumar admitted crossexamination bank account passbooks incriminating nature admits copies gurmat prakash diary psgpc incriminating nature though stated copies vangar magazine incriminating nature investigating officer case namely dsp gagandeep singh categorically admitted crossexamination magazines gurmukh prakash vangaar registered magazines prohibited government thus meaning thereby magazines titled gurmukh prakash vangaar taken incriminating substance allegedly got recovered possession accused court said court said cases investigating officer admitted clear terms evidence collected investigation regarding participation accused unlawful activities otherwise accused visited gurudwaras pakistan accused developing terror links visit court said dsp admits visit pakistan visit gurudwara religious places illegal crime admitted witness time arrest accused nothing incriminating found thus abovediscussed evidence fact become crystal clear absolutely evidence file three accused conspired together commit wage war government india states india committed act intent threaten likely threat unity integrity security sovereignty india intent strike terror likely strike terror people india even documentsmagazines allegedly got recovered possession accused prohibited government india even iota evidence come record accused ever raised funds foreign country committing terrorist act india rather admitted investigating officer accused gurdial singh jagroop singh satwinder singh never raised collected funds even prosecution failed establish record accused members banned organization international sikh youth federation thus prosecution utterly failed prove ingredient sections b ipc section unlawful activities prevention act concluded court",
    "light_cleaned_title": "Punjab Police fail to prove high-profile UAPA case using SGPC magazine copies, 3 acquitted",
    "light_cleaned_selftext": "Additional Sessions Judge Karunesh Kumar acquitted one accused, Satwinder Singh, of all charges",
    "light_cleaned_comments": "From the article: A court in Punjab’s Shaheed Bhagat Singh Nagar district on Monday acquitted three men accused of being trained and tasked by Pakistan’s Inter-Services Intelligence (ISI) to carry out terror attacks in India of charges under the Unlawful Activities (Prevention) Act. Additional Sessions Judge Karunesh Kumar acquitted one accused, Satwinder Singh, of all charges. The court found the other two — Gurdial Singh and Jagroop Singh — guilty under Section 25 of the Arms Act and sentenced them to one year’s imprisonment. However, since both accused had already served more than three years in jail, the court maintained that the period of imprisonment already undergone by the convicts during inquiry, investigation or trial of this case be set off from the substantiate sentences to be undergone by them. What was the case about? With the arrest of Gurdial Singh, Jagroop Singh and Satwinder Singh on June 4, 2017, the Punjab Police claimed to have busted a terror module having links with the ISI-backed banned outfit International Sikh Youth Federation (ISYF). This was a high-profile case as it was also part of the 23-page dossier on alleged terror activity from Pakistan against India and handed over to neighbour county diplomats on July 14, 2019, during the Kartarpur Corridor talks at the Wagah border. All the accused were allegedly linked to Pakistan-based Lakhbir Singh Rode and Harmeet Singh alias Happy, both dead now, and the trio had been charge-sheeted under Sections 15, 16, 17 & 18 of UAPA. Apart from their bank account and passbooks, the police produced documents, including Shiromani Gurdwara Parbandhak Committee (SGPC) monthly magazine Gurmat Parkash copies of September 2004, August 2004 and July 2001. Gurmat Parkash is a monthly Punjabi magazine published by SGPC’s Dharam Prachar Committee since 1957. Apart from this, a diary for 2011 published by the Pakistan Sikh Gurdwara Parbandhak Committee (PSGPC), and copies of the monthly magazine Vangaar from February, March, April, May, July, September, October and December 2016 and January 2017 were recovered from the accused. Vangar is considered a pro-Khalistan monthly magazine. Nothing incriminating found, says court The judgment reads, “But the mere recovery of these above-referred documents from the possession of the accused is not sufficient to fulfill the ingredients of Sections 121, 121-A, 120-B of IPC and Sections 15, 16, 17 & 18 of Unlawful Activities Prevention Act, 1967.” “Sub Inspector Rajiv Kumar has admitted during cross-examination that bank account and passbooks are not incriminating in nature. He further admits that copies of Gurmat Prakash and the diary of PSGPC are not incriminating in nature. Though he has stated that copies of Vangar magazine can be incriminating in nature but investigating officer of the case, namely DSP Gagandeep Singh, has categorically admitted during his cross-examination that all the magazines of ‘Gurmukh Prakash’ and ‘Vangaar’ are registered magazines and not prohibited by any government. Thus, meaning thereby, these magazines titled as ‘Gurmukh Prakash’ and ‘Vangaar’ can not be taken as incriminating substance, which has been allegedly got recovered from the possession of accused,” the court said. The court said the case’s investigating officer admitted in clear terms that no evidence was collected during the investigation regarding the participation of the accused in the unlawful activities or otherwise. The accused had visited Gurudwaras in Pakistan and they were accused of developing terror links during their visit. On this, the court said, “DSP further admits that to visit Pakistan for the visit of Gurudwara and other religious places is not illegal and it is not a crime. It has further been admitted by this witness that at the time of arrest of accused, nothing incriminating was found from them.” “Thus, from the above-discussed evidence, this fact has become crystal clear that there is absolutely no evidence on the file that all the three accused conspired together to commit wage war against the Government of India and other states of India or they had committed an act with intent to threaten or likely to threat the unity, integrity, security or sovereignty of India or with intent to strike terror or likely to strike terror in people of India.” “Even, the documents/magazines allegedly got recovered from the possession of the accused were not prohibited by the Government of India. Not even an iota of evidence has come on record that the accused ever raised any funds from a foreign country for committing any terrorist act in India, rather, it has been admitted by the investigating officer that the accused Gurdial Singh, Jagroop Singh and Satwinder Singh never raised or collected any funds.” “Even, the prosecution has failed to establish on record that all these accused were members of any Banned Organization International Sikh Youth Federation. Thus, prosecution has utterly failed to prove the ingredient of Sections 121, 121-A, 120-B of IPC and Section 15, 16, 17 and 18 of Unlawful Activities Prevention Act, 1967,” concluded the court."
}