{
    "id": "vu2ygx",
    "title": "The fraud of vaccination drive",
    "url": "https://www.reddit.com/r/india/comments/vu2ygx/the_fraud_of_vaccination_drive/",
    "selftext": "My mother got her second dose of vaccination on April 2021, but she received a message a few months later saying her second dose of vaccination was done on October 2021. And when I finally login to the Cowin website, I found out the fraud going on in the name of the vaccination drive. \n\nThese guys have made two different certificates for my mother one with the surname and the other without the surname, both registered under the same Aadhar card. So according to the records, they have vaccinated two individuals when in fact it's not true.\n\nI wonder how many others have faced this situation, and what are the actual numbers as opposed to the numbers claimed by the government.\n\nhttps://preview.redd.it/72j574v14aa91.png?width=1366&amp;format=png&amp;auto=webp&amp;s=f439b97aebdce404b084ae2591864d6ff471453f",
    "flair": "Rant / Vent",
    "score": 0,
    "num_comments": 1,
    "created_utc": 1657257568,
    "convurl": "https://a.thumbs.redditmedia.com/uW0NTqkbJLN1Bck_iGeSYcW_bJvOxorczmk7s_Ink_0.jpg",
    "comments": [
        "In a database of the size of cowin duplication is not impossible. The data is based on entry by the person at the vaccination center. \n\nSure it's incompetence, poor control etc. but where is the  fraud ? Also the government's job is to ensure vaccine availability and let's be fair availability is not a concern anymore. They took perhaps some wrong decisions along the way , messed up a bit but hindsight is always perfect. Considering the creaky governmental apparatus we have done reasonably okay in many parts of the country. \n\nAlso in today's scenario no one wanting a vaccine is denied it to the best of my belief. So if a person is unvaccinated today it's out of choice and not due to circumstances."
    ],
    "cleaned_text": "fraud vaccination drive mother got second dose vaccination april received message months later saying second dose vaccination done october finally login cowin website found fraud going name vaccination drive guys made two different certificates mother one surname without surname registered aadhar card according records vaccinated two individuals fact true wonder many others faced situation actual numbers opposed numbers claimed government ",
    "cleaned_title": "fraud vaccination drive",
    "cleaned_selftext": "mother got second dose vaccination april received message months later saying second dose vaccination done october finally login cowin website found fraud going name vaccination drive guys made two different certificates mother one surname without surname registered aadhar card according records vaccinated two individuals fact true wonder many others faced situation actual numbers opposed numbers claimed government",
    "cleaned_comments": "database size cowin duplication impossible data based entry person vaccination center sure incompetence poor control etc fraud also governments job ensure vaccine availability lets fair availability concern anymore took perhaps wrong decisions along way messed bit hindsight always perfect considering creaky governmental apparatus done reasonably okay many parts country also todays scenario one wanting vaccine denied best belief person unvaccinated today choice due circumstances",
    "light_cleaned_title": "The fraud of vaccination drive",
    "light_cleaned_selftext": "My mother got her second dose of vaccination on April 2021, but she received a message a few months later saying her second dose of vaccination was done on October 2021. And when I finally login to the Cowin website, I found out the fraud going on in the name of the vaccination drive. These guys have made two different certificates for my mother one with the surname and the other without the surname, both registered under the same Aadhar card. So according to the records, they have vaccinated two individuals when in fact it's not true. I wonder how many others have faced this situation, and what are the actual numbers as opposed to the numbers claimed by the government.",
    "light_cleaned_comments": "In a database of the size of cowin duplication is not impossible. The data is based on entry by the person at the vaccination center. Sure it's incompetence, poor control etc. but where is the fraud ? Also the government's job is to ensure vaccine availability and let's be fair availability is not a concern anymore. They took perhaps some wrong decisions along the way , messed up a bit but hindsight is always perfect. Considering the creaky governmental apparatus we have done reasonably okay in many parts of the country. Also in today's scenario no one wanting a vaccine is denied it to the best of my belief. So if a person is unvaccinated today it's out of choice and not due to circumstances."
}