{
    "id": "1cxvij7",
    "title": "Finally some good news in the Pune car crash case",
    "url": "https://www.ndtv.com/india-news/15-day-punishment-for-teen-shocking-devendra-fadnavis-on-pune-porsche-crash-5713424?fbclid=PAZXh0bgNhZW0CMTEAAaatYNS_bOuWeMum7YU7FDYp6Y-K8pMz1f7hkzQGiXv4q6gTX1qdt0OGowQ_aem_AfaPz_Ff2kqXNQww698pYc_Cw0yT22DewUpnIikm3tbOsMZ9WAwSFjK1SajsCTsDsuC8sqhHGIT4EcyFyc9Gigjw",
    "selftext": "I read article recently, and honestly it felt really positive given all the negative news I've been seeing. I've seen outrage all across social media, and maybe that was one of the reasons it caught the deputy CM's eye. I hope justice will be served.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1716367510.0,
    "convurl": "https://external-preview.redd.it/ZKxY6hGJhTIjbTSe_qPwGn0gAeRQ5gZuZlua_99A9og.jpg?auto=webp&s=136d8488b498758b314a0241d72a5ec25c8adcf0",
    "comments": [
        "It's us. We have stopped outrage. People in power are now not scared of indian people's outrage. \nIt's a shame that the value of two lives is a 300 word essay.\nSeriously, this is our country's sad state.",
        "Apparently the head of the justice board and other members weren't consulted by the judge who granted those bail conditions. He was probably bought off by the builder",
        "That's what. But then again how can we trust these people. Everyone will now work to make them look like they had no part in this."
    ],
    "cleaned_text": "finally good news pune car crash case read article recently honestly felt really positive given negative news ive seeing ive seen outrage across social media maybe one reasons caught deputy cms eye hope justice served ",
    "cleaned_title": "finally good news pune car crash case",
    "cleaned_selftext": "read article recently honestly felt really positive given negative news ive seeing ive seen outrage across social media maybe one reasons caught deputy cms eye hope justice served",
    "cleaned_comments": "us stopped outrage people power scared indian peoples outrage shame value two lives word essay seriously countrys sad state apparently head justice board members werent consulted judge granted bail conditions probably bought builder thats trust people everyone work make look like part",
    "light_cleaned_title": "Finally some good news in the Pune car crash case",
    "light_cleaned_selftext": "I read article recently, and honestly it felt really positive given all the negative news I've been seeing. I've seen outrage all across social media, and maybe that was one of the reasons it caught the deputy CM's eye. I hope justice will be served.",
    "light_cleaned_comments": "It's us. We have stopped outrage. People in power are now not scared of indian people's outrage. It's a shame that the value of two lives is a 300 word essay. Seriously, this is our country's sad state. Apparently the head of the justice board and other members weren't consulted by the judge who granted those bail conditions. He was probably bought off by the builder That's what. But then again how can we trust these people. Everyone will now work to make them look like they had no part in this."
}