{
    "id": "125igjs",
    "title": "People of India, This our young generation. Advocating for their fav. by abusing their own families &amp; player/actor families.",
    "url": "https://www.reddit.com/r/india/comments/125igjs/people_of_india_this_our_young_generation/",
    "selftext": "I too follow many people, actors, sportsman etc. But I'm not blind &amp; brainwashed enough to do this bulshit on twitter or anyother platform. \n\nhttps://preview.redd.it/ewms5ogucnqa1.png?width=1072&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a932743c9d956124ac5dc7b6a713bf62ff10c2d3\n\nhttps://preview.redd.it/bn9tgjgucnqa1.png?width=990&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=bdb8e096331ae084534e3e8f45c9c6d9bfc15a1b\n\nhttps://preview.redd.it/aly6vhgucnqa1.png?width=1444&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8eba88a339b58cade582acb060497e8746c57f3c",
    "flair": "Rant / Vent",
    "score": 10,
    "num_comments": 4,
    "created_utc": 1680082160,
    "convurl": "https://b.thumbs.redditmedia.com/dnQcAQhjJ2HKG0IyuLuR4N2g3sarrnsWLvKPsSeOcks.jpg",
    "comments": [
        "It's called jobless-ness",
        "Toxic fan bois/chappris of Hafeezpet",
        "Teenagers srk - kohli  ke fan nahi hai balki srk - kohli unki poori duniya hai. Abhi uu log bacha hai jisko lagta hai usko sab kuch pta hai lekin ghanta kuch nhi pta hai real world ke baare me. Internet par uu log ko equal voice mil gya hai to apne gods(celebrities) ko defend kar rha. \nJyada load mat lo memes dekho khus raho. And ee baat yaad rakho ki uu log bacha hai maaf kar do baad me khud bda hoga to yeh sab chiz khud cringe lagega."
    ],
    "cleaned_text": "people india young generation advocating fav abusing families amp playeractor families follow many people actors sportsman etc im blind amp brainwashed enough bulshit twitter anyother platform ",
    "cleaned_title": "people india young generation advocating fav abusing families amp playeractor families",
    "cleaned_selftext": "follow many people actors sportsman etc im blind amp brainwashed enough bulshit twitter anyother platform",
    "cleaned_comments": "called joblessness toxic fan boischappris hafeezpet teenagers srk kohli ke fan nahi hai balki srk kohli unki poori duniya hai abhi uu log bacha hai jisko lagta hai usko sab kuch pta hai lekin ghanta kuch nhi pta hai real world ke baare internet par uu log ko equal voice mil gya hai apne godscelebrities ko defend kar rha jyada load mat lo memes dekho khus raho ee baat yaad rakho ki uu log bacha hai maaf kar baad khud bda hoga yeh sab chiz khud cringe lagega",
    "light_cleaned_title": "People of India, This our young generation. Advocating for their fav. by abusing their own families &amp; player/actor families.",
    "light_cleaned_selftext": "I too follow many people, actors, sportsman etc. But I'm not blind &amp; brainwashed enough to do this bulshit on twitter or anyother platform.",
    "light_cleaned_comments": "It's called jobless-ness Toxic fan bois/chappris of Hafeezpet Teenagers srk - kohli ke fan nahi hai balki srk - kohli unki poori duniya hai. Abhi uu log bacha hai jisko lagta hai usko sab kuch pta hai lekin ghanta kuch nhi pta hai real world ke baare me. Internet par uu log ko equal voice mil gya hai to apne gods(celebrities) ko defend kar rha. Jyada load mat lo memes dekho khus raho. And ee baat yaad rakho ki uu log bacha hai maaf kar do baad me khud bda hoga to yeh sab chiz khud cringe lagega."
}