{
    "id": "19f52ng",
    "title": "Rajasthan man rapes minor daughter for a year, court denies abortion plea",
    "url": "https://www.indiatoday.in/law/high-courts/story/rajasthan-man-impregnates-minor-daughter-high-court-refuses-to-terminate-8-month-pregnancy-2493311-2024-01-25?utm_source=taboola&utm_medium=recirculation",
    "selftext": "Meanwhile, the Rajasthan High Court has turned down the rape victim’s petition to terminate her 32-week pregnancy, ruling that abortion at such an advanced stage could \"endanger\" her life. The court noted that a fully developed foetus also has a right to life under Article 21 of the Constitution.",
    "flair": "Crime",
    "score": 648,
    "num_comments": 168,
    "created_utc": 1706172905.0,
    "convurl": "https://external-preview.redd.it/uk8gWulCz4C8_Yrk4laldD5FvRypHcShfvaSMKQ-UzY.jpg?auto=webp&s=23b07aae239e9abe302736ae2990b4545c0499d8",
    "comments": [
        "32 weeks cannot be terminated.\n\n Right decision",
        "I'm pro choice but that's an 8 month old baby. Such a tough decision and disgusting act but I think this is the right call. If the baby was born today it would most likely survive with no intervention so an abortion would be pure cruelty.",
        "Rape itself is disgusting! What kind of a sick monster one has to be to do it to his own child..rip his nails,eyes,teeth, tongue out one by one.",
        "Is there no saturation point for these kind of stories? It always amazes me",
        "If the doctors think termination was safer. then that should have been allowed.",
        "Which child? The poor little girl or the newborn baby?",
        "It’s really a shitty situation from both sides.\n\nThird trimester abortions are generally associated with a lot of complications for the mother and there’s also the moral/ethical aspect of it.\n\nBut on the other side. This is a 11 year old CHILD. Child birth at such a small age will certainly be very difficult. And the changes the body undergoes after delivery are basically occurring in her even before teenage. \nAnd then there’s the mental and emotional aspect.\n\nEither option leads to the suffering of on innocent child.\nI just hope she has people around who will support and protect her. I can’t even imagine someone having to go through this.",
        "I agree. But nevertheless what a monster that man is. I hope he has to pay for his sins, one way or the other.",
        "How can they force a 11 year old to give birth? They ignore the real victim here",
        "It's not that simple we have to also think about the baby's right to live \n\nWe can't just murderer the baby at this stage when it's been 8 months.",
        "Forcing a 11 year old to give birth even for a 8 month old is certainly a decision \n\nPoor girl never had any choice",
        "just sitting here thinking about what if the man was from THAT one specific religion.",
        "Can we please castrate ( or simply cut private parts ) man who rape women in India from now on. Please. It's not a lot to ask and our country's population is the highest in the world anyway. \n\nI would really like the govt to put the same energy they put in Ram Mandir. \n\nAlso, i understand why this rulling was made. As much as I'm pro choice, the baby inside her is 8 months old and at this point it'll be commuting a murder if they do abortion. And it'll do nothing much for the girl anyway because she has already suffered the trauma of being raped and carrying the baby for 8 months.",
        "what the fuck?! \n\nThis is the main issue with the country. I am fucking tired of everything revolving around religion. Why the fuck can't we do better for women safety?",
        "But aborting at this stage will probably kill the victim too :(",
        "And giving birth won't?",
        "Can’t even imagine the act💔. That guy should be hanged and the girl should get all types of help she needs. Doctors should be consulted about keeping the baby or not and she definitely doesn’t deserve any of this at such a young age.",
        "The baby doesn't have conscience yet to be innocent. It's a fetus. Couple of cells. They're ruining a fully developed and functional human's life for an unborn bunch of cells. She could die while giving birth. And why should she birth the child of such a monster? If she wishes to have the kid she can. But if she doesn't, no one has the right to stop her fr getting it aborted.",
        "That's appalling. Also, if it's safe for her to get aborted then she should have the right to get aborted.",
        "Baby  ke karan use maoom bacchi ke bare mein bhi sochana chahie.",
        "At 32 weeks it's normally a full grown baby, which can survive outside the womb.",
        "Newborn",
        "You would be no different than the rapist if you did that. Just lock him up and give him a just punishment. Medieval torture isn't the solution.",
        "I agree but she's 11. Her body isn't even developed enough to go through labor. There's many after affects of pregnancy and labor, some being permanent. At this age, delivery a baby is risky, she could face permanent issues due to this. Why risk it?",
        "I think the doctors have a bit of a more expert opinion about this than you do",
        "It wasn't doctors who denied it, it was the courts which denied it. You do need a doctor to even file a petition like this.",
        "https://preview.redd.it/5ibc15udxkec1.png?width=815&format=png&auto=webp&s=c9c9da4d5ce2bdef23e8b7800941efe4022cf7a7",
        "Bhai civil code hai, sharia nahi.  \nThere are better and more civilised ways available to deal with such miscreants.",
        "Peak Rajasthan moment.",
        "Bc, Pehle har cheez to country ka color dena band karo, absolute chutias like you are ruining all important national discourses into the gutter.",
        "India has quite liberal abortion laws when compared with many first world countries. So unless you are a doctor or a lawyer, pl refrain from making a judgement. But yes, I am sure we can do a whole lot better for ensuring such incidents don't happen again and that the victim gets good support system later.",
        "This is totally a logical way to deal with these kind of people\n And the kinder approach. I'm not asking them to be stoned to death which is what they deserve.",
        "What does this have to do with religion it literally says right there its safer for her to deliver not abort do yk how dangerous aborting an 8month old would be? Take a lil time to think before comment mindlessly. Read before you get all worked up please",
        "Any reason why this motherfucker is not named and shamed, or would revealing name bring shame to their brethren 💀",
        "Yeah but if we do this we have to be 100% sure with no reasonable doubt about the offense. A lot of false cases also get attached so have to think how that will be addressed.",
        "According to atheists this is normal and they would throw some Freudian bs at you justifying it .",
        "I don't want to be different then. No mercy to rapists.\n\n1)Use a knife\n2) Cut them somewhere with it so they bleed\n3) Then stitch it without anaesthesia.\n4) Repeat Steps from 1 to 3 untill he starts begging for death.\n\nAfter he starts begging tie his legs and hands on a pole and let the dogs eat him alive.",
        "I did not mean that this is about religion. I meant the only thing people think of and the thing that the media, government and people revolve around is religion and not extreme issues like this.",
        ">In its order, the bench of Justice Anoop Kumar Dhand said the delay by the child in approaching the court \"has only further aggravated the said aspect\" of termination of pregnancy, and relied on the Medical Board's statement and existing judgments to turn down the request\n\n\"And relied on the medical board's statement and existing judgements\" read before getting mad 🤦‍♂️",
        "omg",
        "New evidence comes out proving his Innocence. Then you just torture a innocent man.\n\nPeople like you hold these country back.",
        "What is his name ?",
        "A paternity testing can easily prove him guilty",
        "Okay not gonna debate you about that but the fuck does that have to do with this case bro 😂",
        "Let me get this straight. They are forcing a child to give birth to a baby who will be removed from its mother and put in a state-run institution? And so it begins.",
        "A test that was not taken. Ya all have not read the article did you?",
        "I guess because the victim's name (the daughter) will easily come up if the man is named. So, protecting the victim's identity in a way?",
        "In-fucking-sane!",
        "Since it's so brutal thing and getting justice take so long ..in many countries , doctors themselves give some sort of medicine to terminate pregnancy to rape victims after taking consent from family members or the victim so there is no pregnancy to began with like turkey and etc...\nWhy to make abortion so difficult that you need judicial people and then there is committee which will take the decision...such news will encourage the rapists ..rapists are sadist , they don't care if they get punishment , all they want to destroy the victim's life ...by doing he gets what he wants ..he trapped her with the baby for her entire life..and somewhere also destroy the baby life ..",
        "I am talking about testing after the birth of baby since the victim has been denied abortion anyway.",
        "Should they let  mother die..?",
        "Capital Punishment is the only way",
        "Bro! The other guy was asking a rhetorical question.",
        "Rapists should be hanged to death they don’t deserve anything better (after being found guilty)",
        "This has always been the policy, fuck you mean “so it begins?”\n\nThe rules have actually gotten looser over the last few years.",
        "Wtf are you even talking about? What does atheism even have to do with any of this?",
        "What else do you want? Terminating at this point would be dangerous plus an 11 year old should not be burdened with motherhood.",
        "It's never been proven Capital Punishment reduces rape. Effective policing, victims not being afraid to come forward, rehabilitation for the victim, judicial system, consent based sex education (you'll be surprised how few people know what consent is) among are more effective.",
        "32 weeks is risky",
        "It’s not at 32 weeks",
        "Can't blame the court it's better to save hem than risking both of their lives",
        "considering their is a huge number of fake rape cases, no they can’t simply just castrate someone.",
        "considering their is a huge number of fake rape cases in india, no they can’t simply just castrate someone.",
        "does it actually endanger her life? Just asking a question",
        "Ram mandir ko beech me mat laa...stop inserting it everywhere...mamla kya hai tu baat kya karra...your point wouldn't have made any less sense had you excluded ram mandir topic...tum logo ko sab jageh use lana hai...smh",
        "As a woman who keeps hearing about these cases every single day and also can't even feel safe to step out of her house in this country because of how men keep staring and harassing even if not all of them are raping women, I can't feel sorry. \n\nYou get stared at so much. Harassment has become so common that some of the things men do aren't even considering too much anymore. Like groping and rubbing in trains and buses is \"normal\" now. 😑😑",
        "Incest thing is taking troll, this not good.",
        "I’m pro choice as well but at 8 months it seems just too late? I myself was born pre term at 28 weeks.",
        "that kind of behaviour of some lowlifers disgust the shit out of me, but look at the other side of the coin too and no one deserves to be punished for something they never did. \n(aint no way i’m justifying rapists, they deserve to fucking burned alive)",
        "Yes because the amount of enthusiasm and attention  ram mandir got from politicians is huge , there are many REAL issues out there which needs that much attention but politicians ko sirf ram ram karna hai, fucking clowns",
        "USA banta jara hai ye vo in the wrong sense",
        "No, there is a reason we have evolved to unlearn that kind of thought, maybe you need to complete your process.",
        "Her Body is also Not ready to Bear the risk of Abortion and infact there is High chance she might loose her Life Aborting the child rather than giving birth and Its Not new there have been  past instances of Delivering at young age. But Aborting a 32 week is too risky that is almost a whole Fetues. So Govt made the right call Her life>>>childs life. Although these sick bastards should be hanged for raping her own daughter and Tramatizing her for life",
        "Thats not going to do anything other than inflict pain.  The punishment for murder os death and yet people commit murder its not about the punishment. Even if you change the punishment its not going to change how many rapes occur.",
        "First men can evolve themselves into understanding consent and respect. Not sure why we women are expected to do the work on mankind's evolution while men still behave like animals.",
        "nahh.. populus punishment is better… let the people decide what fate he deserves… and by that i mean the victims",
        "Violating anyone's bodily autonamy is *not* normal. But, so is discrediting the perils of the men who go through false accusations despite being innocent. \n\nHave you seen the documentry, *Martyrs of the Marriage*? It clearly outlines the predicament that men face when women misuse those laws. I could make a counterpoint to your argument that women mostly marry men to use them, dump them, and run off with their money -- or threaten them with imprisonment over false accusations. The generalization doesn't feel nice now does it?\n\nIf you watch the documentry, it would clearly show that false cases are overtaking a real ones by alot. \n\nShould I stop feeling sorry for the *real* women who go through such predicaments because women mostly just use men for their benfit? \n\nWhat we *need* to work on is developing our education system, spreading awareness of mutual consent, proper rehabilitation system. Making people aware of the gravity of such offences and its consequences on the victims -- men and women both. \n\nAny form of punishment -- physical, and capital -- isn't acting as a proper deterrent now, is it? We can clearly see that the ingrained system is flawed. \n\nOf course, after proper judicial trial, capital punishment/'castration' would be fine because they were *found* guilty.",
        "If that's how it is then broadcast it so everyone can see what will happen to them if they did so.\n\nStrong punishments or strong rewards can bring out any desired behaviour from any human being.\n\nBulldozer action and Atik Ahmed death stopped dropped the crime rates in UP to all time low. Why is that?",
        "My statement wasn't for that man. I clearly mentioned no mercy to rapists. If he is a rapist then he deserves that, if he is innocent then it implies he isn't a rapist which further implies no punishment for him.",
        "Like no one knows what the punishment is. Punishment doesn't solve crime.\n\nNo amount of punishment can not change the behaviour of a person. \n\nHave you seen the data. By how much has it dropped. Please show source.",
        "Men ?  \nYou just had to go full retard didn't you ?\n\n  \nUs v/s Them ka ye joh tum facade bana dete ho har cheez ko, yehi adaat tumhe le doobegi ek din.",
        "https://timesofindia.indiatimes.com/city/lucknow/crime-rate-in-uttar-pradesh-lowest-since-2013-ncrb-data/articleshow/86249864.cms",
        "Indian state doesn't have the money to bring them to right path . Keep the capital punishment intact get rid of trash from society india has enough cheap labour and unemployment issues",
        "We need to bring back public executions for child rapists. I can’t wrap my head around a father raping his own daughter. Only monsters are capable of such things.",
        "Depends on your end goal. If you want the rapist to suffer and regret what they did, hell, public execution might be helpful. For me, it's about reducing and eliminating child rapes and rapes in general. For that there are multiple changes that need to be brought about.",
        "I think that misusing rights that are meant for your protection and grants you power to confront the crime should be a crime itself.\n\nIf some women 'X' filed false rape case against some man then if that man is found innocent then the woman 'X' who filed the case will face the punishment of raping someone.",
        "Everyday... We stoop even lower",
        "I think once these type of men see the consequences of raping people, they’ll be more scared to commit such crimes. But the consequences need to be severe in the first place in order to deter these men. Jail for a few years won’t cut it.",
        "I'm talking about structural changes before rapes are even committed. \n\nI personally don't think rapists are born, a misogynistic society that makes them view women as objects creates them. With capital punishment you will kill one rapist, but what about the thousands being pumped into the world because they never understood what consent is, because it was never taught to them.",
        "Thank fucking god people like you are not responsible for justice. Your line of thinking is extremely barbaric and medieval. Your suggestion is entirely out of anger without considering anything else. \n\nImagine if rape laws in India were equal for women and women couple be punished for rape. Now imagine a women gets convicted of rape and we apply your methods to her. The equivalent would be to permanently stitch her vaginal opening to the point it will only ever be able to pass menstrual blood from a tiny opening. Sounds gruesome but justified to you? Now imagine a few years later it turns out she was wrongly prosecuted. You will never be able to undo what you did to her. That person has to live her only life with a useless stitched up vagina. You cannot take a chance with your judgement when the punishment is so gruesome.\n\nThe only reason I am flipping genders here is because believe it or not, it is easier to understand this from your own genders perspective. You can directly relate to it. \n\nPunishments like castration or any kind of mutilations are absolutely stupid, it breeds a society where these things start to feel normal to people. These kinds of punishments are unnatural and should always be treated as extreme and not the norm no matter how 'justified' they may seem in individual cases.Imagine the mutilation the mob would start doing because well the government does it in some cases so why not do the same to our enemies? The future generations will start using these kinds of mutilations to retaliate against each other for crimes of much lesser degree. In 50 years from now you will have people castrating/mutilating each other for theft. There is no going back once you open that gate. Now you are living in the dark ages. The fabric of society is more delicate than you think.",
        "Poor girl",
        "End goal is him feeling the pain. So yes, capital punishment is a start. That \" reducing and eliminating child rapes and rapes in general \" are just plain words with no action. We can go on about talking in circles but the victim needs immediate justice, not the law of averages and sweet words about how society needs multiple changes.",
        "Yea at 32 week is dangerous",
        "In that case i guess keeping the kid is fine.  What matters is her health. \n \n> Govt made the right call Her life>>>childs life\n\nA lot of the time govt is pro life which is why it was concerning cause it should be as she wishes. In this case yes the gov is right (as long as the decision was made based on medical conditions and not their opinion on abortions :) )",
        "Lmao what does atheism have to do with this?? 🤣",
        "hinduism? yeah same",
        "yall want ram mandhir to be this international event that lasts days but if someone says something you don’t like “calm down it’s just a mandhir vroo”",
        "Ok so how are u going to change them , everything needs money Sweden with its correction hardly manges to change 5 percent of its rapist and their percapita income is beyond 50k USD and has highest rape rate even by indian standards. In Large country like india govt can't realistically save every soul even usa with 80k percapita decides to imprison people for years for every single step of rape to keep them in prison for most amount of time most of your arguments philosophica and not practical and their population is hardly 400mil. You want Sweden style sel correction system with ess than 3k usd, it hasn't worked yet and it will never work.",
        "Normal day in Rajasthan",
        "What I want to know is - how long did the judicial (police, courts etc) procedure took to make this conclusion?\nWe are known for running the case for a long time unless you are a VIP (like Arnab Goswami)",
        "Putting people who rape in prison for life also hasn’t reduced the number of rapes. What’s your point? Should imprisoning rapists be gotten rid off as punishment well? Should they all be sent to a “Rapist Rehabilitation Centre”?\n\nCapital punishment for the most heinous crimes is not to deter future behaviour, but to offer moral objectivity and getting rid of people who from society who don’t deserve to be in it. \n\nWho said what you want in terms of policing etc cannot be done while capital punishment is implemented upon perpetrators of the worst crimes?",
        "You’re right that rapists are to a degree probably a result of a misogynist society. But some are born that way. Same way that psychopaths are born and sociopaths are moulded in to be that way. \n\nSocieties that aren’t misogynist overall have rapists too. Rich and highly educated people rose too. Epstein and his cabal of high-powered people abused underaged girls, the cabal being comprised of some of the most popular liberals on the planet.",
        "32 weeks is too high for abortion.",
        "Once these type of men see the consequences of raping people, they’ll be more prone to murdering the victims, so they don't come forward and accuse them.",
        "Please end this world.",
        "wow, the down vote said what words cannot describe. proves the point.",
        "Yes but at 32 weeks it's well beyond the safety limit",
        "It's already.....going to........ The progress is already posted",
        "Both I say, not like the mother is safe in her own home anyway.",
        "cut him into pieces",
        "I don’t fully agree with that. Sure, that could be the case, but I’ve lived in countries like UAE and Qatar with strict laws that result in very low crime rates and safe cities. I think having lax laws, a snail-paced justice system, and low conviction rates, gives rapists and criminals in general the confidence to commit crimes. \n\nLook at El Salvador, a country that once had the world’s highest homicide rate and was pretty much ruled by gangs is now enjoying relative peace and safety after hundreds of thousands of men were thrown into prison after a new President came into power with a strong no-nonsense approach to gang violence. El Salvador's homicide rate thus decreased by nearly 70% percent in 2023. Of course, the way in which this was done was controversial internationally but the citizens of El Salvador themselves support the President because he was able to bring safety to the previously violence-torn country by doing this. We need such a leader in India too, who is able to swiftly make heinous criminals pay for their actions and bring safety back to the innocent citizens of the nation. But it’s just a pipe dream because that’s not what the common people care about.",
        "Even if she lives she has to relocate to another state or country \n\nHer life will be worse than death",
        "Do men who claim this genuinely not understand the difference between a false case and an acquittal?",
        "Do you have a medical source for this claim?",
        "Yes you can just search it online",
        "WTF .. should be in jail for life",
        "after 8 months? that's straight up murdering a baby, just because it's inside a womb doesn't change that",
        "abortion cases are fast tracked for obvious reasons  \nfor similar urgent pleas the provision is known as writ petition",
        "Sadly, It's true. A fully developed fetus brings hormonal changes in a mother's body. Despite how enraging this situation is, the poor girl will have to endure it. I do hope they don't try to get the fetus aborted by some baba or dai. That's even more dangerous and can be fatal for the girl.\n\nAs for the man, there are ways for someone to 'die naturally' without anyone realizing what actually happened.",
        "I start ripping off something else, then go to the nails, eyes, etc",
        "From my experience on reddit: No.",
        "google and common sense... A pregnancy is 40 weeks so by week 32 its far too late to terminate a pregnancy",
        "do women like you even read and understand the whole situation before commenting shit about it?\nshe’s talking about all the cases, not specifically about this one.",
        "This.",
        "For a country like ours, where politics absolves all crimes and where crime is the backbone of people in power, a drastic and hard hand approach is next to impossible. Rather it is the empowerment of the masses - via education, awareness and the legal support - which can give us a fighting chance of removing the muck of crime where those in power feel they can get away with everything without any consequential baggage.",
        "More punishment is not an effective deterrent to crime. Many studies have proven this. Rather, conviction rates go down because it’s hard to prove most crimes (including rape) to a degree of certainty to justify death penalty.",
        "I disagree with your first sentence entirely. I have lived most of my life in countries with extremely strict laws and could walk around alone late at night without any fear of getting murdered or raped. And in cases of incestual rape (like this one), it’s very easy to prove with certainty who the rapist was with a DNA test.",
        "No. But because capital punishment does nothing to reduce criminality, and the potential for harm due to mistakes by the state are greater, extending it to other crimes is a regressive act that has no value for anyone.\n\nBesides which, it can even incentivize worse crimes. If the punishment for rape and murder are the same, the rapist has even less incentive to keep their victim alive if they fear them testifying.",
        "Humans are animals too. And we’re such a large sample size of 8 billion. Every behaviour you can and cannot imagine exists.",
        "I want to cry.",
        "Yeah but you have upi so you're advanced enough for a little judgment. ",
        "The girl had 8 months. Can you hear yourself or are you so fucking dumb. She is freaking 11. She didn't know anything. She got raped. It was her mom and relatives who realised and took her to the doctor. Please refrain from commenting if you can't use your brain on such sensitive topics. She can die during child birth as she is just 11.",
        "For a normal adult woman. For a 11 year old with severe mental trauma it would be different according to my common sense. \n\nFunny thing, I googled abortion 32 weeks and some cases came up instantly: \n\nhttps://www.google.com/amp/s/www.livelaw.in/amp/high-court/kerala-high-court/kerala-high-court-allows-termination-32-week-pregnancy-foetal-abnormality-mothers-history-depression-241730\n\n\nhttps://laterabortion.org/research/termination-pregnancy-due-fetal-abnormalities-performed-after-32-weeks-gestation-survey-57\n\nI am sure I can find more.",
        "North Indians getting good name and credit for South Indians. Keep doing more damage hats off!!",
        "https://www.reddit.com/r/india/s/QLFAiWsXZg",
        "Wouldn’t Childbirth be more dangerous for a 11 year old than an abortion :/",
        "The 11 year is a a fully grown baby too, she’s an autonomous child & childbirth is dangerous.",
        "Are you ok?",
        "Don't kill him to reduce rape. Kill him to punish raping his daughter\n\nEverything else I agree with",
        "I replied to you, not her. This “huge number of fake rape cases” comes from the failure to understand the very basic distinction between a fake case and an acquittal.",
        "Man, it would be even more dangerous for the little girl due to her age",
        "It would depend on the girl's condition and the doctors recommendations. In any case I don't support any legal interference to patient care (whatever that may be).",
        "I would think that under rape circumstances, especially this one, she should be able to abort her baby because she never wanted it in the first place, and the father won't even be there to take care of the baby. Gross. \n#Womensrights",
        "https://www.indiatoday.in/crime/story/tamil-nadu-father-rapes-14-year-old-daughter-repeatedly-impregnates-her-1685186-2020-06-03\n\nReally brother",
        "and i replied to her, not you. it was in the context of her original comment.",
        "Convert 32 weeks into months if you're finding it hard to understand.",
        "dumbfuck",
        "And?",
        "Then stop being idiot.",
        "Lmfao ok troll. Don't waste my time anymore with ad hominems.",
        "We need to start killing these rapists, nothing would change otherwise, monsters",
        "Stfu, adopt children if you care that much. \n\nThe victim is 11,wtf is wrong with you.",
        "Exactly. It makes you no different from the monsters you are trying to punish. It shouldn't be normal to \"enjoy\" torturing someone. \n\nCapital punishments make sense but not torture.",
        "You made an incorrect statement, which I have quoted in my previous reply. I corrected that statement, nothing else.",
        "Bro how hard is to to comprehend how dangerous it would be to abort that late????",
        "Lmfao you still haven't provided a single medical source to support your statement. This is really pathetic. This is what happrns when People uneducated in medicine comment about the safety of medical procedures.\n\nhttps://np.reddit.com/r/prochoice/s/fAqSRIMUnW",
        "Interesting read but why does it sound so extrême",
        "There is no extreme really. Again no legal interference in people's private medical decisions."
    ],
    "cleaned_text": "rajasthan man rapes minor daughter year court denies abortion plea meanwhile rajasthan high court turned rape victims petition terminate week pregnancy ruling abortion advanced stage could endanger life court noted fully developed foetus also right life article constitution ",
    "cleaned_title": "rajasthan man rapes minor daughter year court denies abortion plea",
    "cleaned_selftext": "meanwhile rajasthan high court turned rape victims petition terminate week pregnancy ruling abortion advanced stage could endanger life court noted fully developed foetus also right life article constitution",
    "cleaned_comments": "weeks terminated right decision im pro choice thats month old baby tough decision disgusting act think right call baby born today would likely survive intervention abortion would pure cruelty rape disgusting kind sick monster one childrip nailseyesteeth tongue one one saturation point kind stories always amazes doctors think termination safer allowed child poor little girl newborn baby really shitty situation sides third trimester abortions generally associated lot complications mother theres also moralethical aspect side year old child child birth small age certainly difficult changes body undergoes delivery basically occurring even teenage theres mental emotional aspect either option leads suffering innocent child hope people around support protect cant even imagine someone go agree nevertheless monster man hope pay sins one way force year old give birth ignore real victim simple also think babys right live cant murderer baby stage months forcing year old give birth even month old certainly decision poor girl never choice sitting thinking man one specific religion please castrate simply cut private parts man rape women india please lot ask countrys population highest world anyway would really like govt put energy put ram mandir also understand rulling made much im pro choice baby inside months old point itll commuting murder abortion itll nothing much girl anyway already suffered trauma raped carrying baby months fuck main issue country fucking tired everything revolving around religion fuck cant better women safety aborting stage probably kill victim giving birth wont cant even imagine act guy hanged girl get types help needs doctors consulted keeping baby definitely doesnt deserve young age baby doesnt conscience yet innocent fetus couple cells theyre ruining fully developed functional humans life unborn bunch cells could die giving birth birth child monster wishes kid doesnt one right stop fr getting aborted thats appalling also safe get aborted right get aborted baby ke karan use maoom bacchi ke bare mein bhi sochana chahie weeks normally full grown baby survive outside womb newborn would different rapist lock give punishment medieval torture isnt solution agree shes body isnt even developed enough go labor theres many affects pregnancy labor permanent age delivery baby risky could face permanent issues due risk think doctors bit expert opinion wasnt doctors denied courts denied need doctor even file petition like bhai civil code hai sharia nahi better civilised ways available deal miscreants peak rajasthan moment bc pehle har cheez country ka color dena band karo absolute chutias like ruining important national discourses gutter india quite liberal abortion laws compared many first world countries unless doctor lawyer pl refrain making judgement yes sure whole lot better ensuring incidents dont happen victim gets good support system later totally logical way deal kind people kinder approach im asking stoned death deserve religion literally says right safer deliver abort yk dangerous aborting month old would take lil time think comment mindlessly read get worked please reason motherfucker named shamed would revealing name bring shame brethren yeah sure reasonable doubt offense lot false cases also get attached think addressed according atheists normal would throw freudian bs justifying dont want different mercy rapists use knife cut somewhere bleed stitch without anaesthesia repeat steps untill starts begging death starts begging tie legs hands pole let dogs eat alive mean religion meant thing people think thing media government people revolve around religion extreme issues like order bench justice anoop kumar dhand said delay child approaching court aggravated said aspect termination pregnancy relied medical boards statement existing judgments turn request relied medical boards statement existing judgements read getting mad omg new evidence comes proving innocence torture innocent man people like hold country back name paternity testing easily prove guilty okay gon na debate fuck case bro let get straight forcing child give birth baby removed mother put staterun institution begins test taken ya read article guess victims name daughter easily come man named protecting victims identity way infuckingsane since brutal thing getting justice take long many countries doctors give sort medicine terminate pregnancy rape victims taking consent family members victim pregnancy began like turkey etc make abortion difficult need judicial people committee take decisionsuch news encourage rapists rapists sadist dont care get punishment want destroy victims life gets wants trapped baby entire lifeand somewhere also destroy baby life talking testing birth baby since victim denied abortion anyway let mother die capital punishment way bro guy asking rhetorical question rapists hanged death dont deserve anything better found guilty always policy fuck mean begins rules actually gotten looser last years wtf even talking atheism even else want terminating point would dangerous plus year old burdened motherhood never proven capital punishment reduces rape effective policing victims afraid come forward rehabilitation victim judicial system consent based sex education youll surprised people know consent among effective weeks risky weeks cant blame court better save hem risking lives considering huge number fake rape cases cant simply castrate someone considering huge number fake rape cases india cant simply castrate someone actually endanger life asking question ram mandir ko beech mat laastop inserting everywheremamla kya hai tu baat kya karrayour point wouldnt made less sense excluded ram mandir topictum logo ko sab jageh use lana haismh woman keeps hearing cases every single day also cant even feel safe step house country men keep staring harassing even raping women cant feel sorry get stared much harassment become common things men arent even considering much anymore like groping rubbing trains buses normal incest thing taking troll good im pro choice well months seems late born pre term weeks kind behaviour lowlifers disgust shit look side coin one deserves punished something never aint way im justifying rapists deserve fucking burned alive yes amount enthusiasm attention ram mandir got politicians huge many real issues needs much attention politicians ko sirf ram ram karna hai fucking clowns usa banta jara hai ye vo wrong sense reason evolved unlearn kind thought maybe need complete process body also ready bear risk abortion infact high chance might loose life aborting child rather giving birth new past instances delivering young age aborting week risky almost whole fetues govt made right call lifechilds life although sick bastards hanged raping daughter tramatizing life thats going anything inflict pain punishment murder os death yet people commit murder punishment even change punishment going change many rapes occur first men evolve understanding consent respect sure women expected work mankinds evolution men still behave like animals nahh populus punishment better let people decide fate deserves mean victims violating anyones bodily autonamy normal discrediting perils men go false accusations despite innocent seen documentry martyrs marriage clearly outlines predicament men face women misuse laws could make counterpoint argument women mostly marry men use dump run money threaten imprisonment false accusations generalization doesnt feel nice watch documentry would clearly show false cases overtaking real ones alot stop feeling sorry real women go predicaments women mostly use men benfit need work developing education system spreading awareness mutual consent proper rehabilitation system making people aware gravity offences consequences victims men women form punishment physical capital isnt acting proper deterrent clearly see ingrained system flawed course proper judicial trial capital punishmentcastration would fine found guilty thats broadcast everyone see happen strong punishments strong rewards bring desired behaviour human bulldozer action atik ahmed death stopped dropped crime rates time low statement wasnt man clearly mentioned mercy rapists rapist deserves innocent implies isnt rapist implies punishment like one knows punishment punishment doesnt solve crime amount punishment change behaviour person seen data much dropped please show source men go full retard didnt us vs ka ye joh tum facade bana dete ho har cheez ko yehi adaat tumhe le doobegi ek din indian state doesnt money bring right path keep capital punishment intact get rid trash society india enough cheap labour unemployment issues need bring back public executions child rapists cant wrap head around father raping daughter monsters capable things depends end goal want rapist suffer regret hell public execution might helpful reducing eliminating child rapes rapes general multiple changes need brought think misusing rights meant protection grants power confront crime crime women x filed false rape case man man found innocent woman x filed case face punishment raping someone everyday stoop even lower think type men see consequences raping people theyll scared commit crimes consequences need severe first place order deter men jail years wont cut im talking structural changes rapes even committed personally dont think rapists born misogynistic society makes view women objects creates capital punishment kill one rapist thousands pumped world never understood consent never taught thank fucking god people like responsible justice line thinking extremely barbaric medieval suggestion entirely anger without considering anything else imagine rape laws india equal women women couple punished rape imagine women gets convicted rape apply methods equivalent would permanently stitch vaginal opening point ever able pass menstrual blood tiny opening sounds gruesome justified imagine years later turns wrongly prosecuted never able undo person live life useless stitched vagina take chance judgement punishment gruesome reason flipping genders believe easier understand genders perspective directly relate punishments like castration kind mutilations absolutely stupid breeds society things start feel normal people kinds punishments unnatural always treated extreme norm matter justified may seem individual casesimagine mutilation mob would start well government cases enemies future generations start using kinds mutilations retaliate crimes much lesser degree years people castratingmutilating theft going back open gate living dark ages fabric society delicate think poor girl end goal feeling pain yes capital punishment start reducing eliminating child rapes rapes general plain words action go talking circles victim needs immediate justice law averages sweet words society needs multiple changes yea week dangerous case guess keeping kid fine matters health govt made right call lifechilds life lot time govt pro life concerning cause wishes case yes gov right long decision made based medical conditions opinion abortions lmao atheism hinduism yeah yall want ram mandhir international event lasts days someone says something dont like calm mandhir vroo ok u going change everything needs money sweden correction hardly manges change percent rapist percapita income beyond k usd highest rape rate even indian standards large country like india govt cant realistically save every soul even usa k percapita decides imprison people years every single step rape keep prison amount time arguments philosophica practical population hardly mil want sweden style sel correction system ess k usd hasnt worked yet never work normal day rajasthan want know long judicial police courts etc procedure took make conclusion known running case long time unless vip like arnab goswami putting people rape prison life also hasnt reduced number rapes whats point imprisoning rapists gotten rid punishment well sent rapist rehabilitation centre capital punishment heinous crimes deter future behaviour offer moral objectivity getting rid people society dont deserve said want terms policing etc done capital punishment implemented upon perpetrators worst crimes youre right rapists degree probably result misogynist society born way way psychopaths born sociopaths moulded way societies arent misogynist overall rapists rich highly educated people rose epstein cabal highpowered people abused underaged girls cabal comprised popular liberals planet weeks high abortion type men see consequences raping people theyll prone murdering victims dont come forward accuse please end world wow vote said words describe proves point yes weeks well beyond safety limit alreadygoing progress already posted say like mother safe home anyway cut pieces dont fully agree sure could case ive lived countries like uae qatar strict laws result low crime rates safe cities think lax laws snailpaced justice system low conviction rates gives rapists criminals general confidence commit crimes look el salvador country worlds highest homicide rate pretty much ruled gangs enjoying relative peace safety hundreds thousands men thrown prison new president came power strong nononsense approach gang violence el salvadors homicide rate thus decreased nearly percent course way done controversial internationally citizens el salvador support president able bring safety previously violencetorn country need leader india able swiftly make heinous criminals pay actions bring safety back innocent citizens nation pipe dream thats common people care even lives relocate another state country life worse death men claim genuinely understand difference false case acquittal medical source claim yes search online wtf jail life months thats straight murdering baby inside womb doesnt change abortion cases fast tracked obvious reasons similar urgent pleas provision known writ petition sadly true fully developed fetus brings hormonal changes mothers body despite enraging situation poor girl endure hope dont try get fetus aborted baba dai thats even dangerous fatal girl man ways someone die naturally without anyone realizing actually happened start ripping something else go nails eyes etc experience reddit google common sense pregnancy weeks week far late terminate pregnancy women like even read understand whole situation commenting shit shes talking cases specifically one country like politics absolves crimes crime backbone people power drastic hard hand approach next impossible rather empowerment masses via education awareness legal support give us fighting chance removing muck crime power feel get away everything without consequential baggage punishment effective deterrent crime many studies proven rather conviction rates go hard prove crimes including rape degree certainty justify death penalty disagree first sentence entirely lived life countries extremely strict laws could walk around alone late night without fear getting murdered raped cases incestual rape like one easy prove certainty rapist dna test capital punishment nothing reduce criminality potential harm due mistakes state greater extending crimes regressive act value anyone besides even incentivize worse crimes punishment rape murder rapist even less incentive keep victim alive fear testifying humans animals large sample size billion every behaviour imagine exists want cry yeah upi youre advanced enough little judgment girl months hear fucking dumb freaking didnt know anything got raped mom relatives realised took doctor please refrain commenting cant use brain sensitive topics die child birth normal adult woman year old severe mental trauma would different according common sense funny thing googled abortion weeks cases came instantly sure find north indians getting good name credit south indians keep damage hats wouldnt childbirth dangerous year old abortion year fully grown baby shes autonomous child childbirth dangerous ok dont kill reduce rape kill punish raping daughter everything else agree replied huge number fake rape cases comes failure understand basic distinction fake case acquittal man would even dangerous little girl due age would depend girls condition doctors recommendations case dont support legal interference patient care whatever may would think rape circumstances especially one able abort baby never wanted first place father wont even take care baby gross womensrights really brother replied context original comment convert weeks months youre finding hard understand dumbfuck stop idiot lmfao ok troll dont waste time anymore ad hominems need start killing rapists nothing would change otherwise monsters stfu adopt children care much victim wtf wrong exactly makes different monsters trying punish shouldnt normal enjoy torturing someone capital punishments make sense torture made incorrect statement quoted previous reply corrected statement nothing else bro hard comprehend dangerous would abort late lmfao still havent provided single medical source support statement really pathetic happrns people uneducated medicine comment safety medical procedures interesting read sound extrme extreme really legal interference peoples private medical decisions",
    "light_cleaned_title": "Rajasthan man rapes minor daughter for a year, court denies abortion plea",
    "light_cleaned_selftext": "Meanwhile, the Rajasthan High Court has turned down the rape victim’s petition to terminate her 32-week pregnancy, ruling that abortion at such an advanced stage could \"endanger\" her life. The court noted that a fully developed foetus also has a right to life under Article 21 of the Constitution.",
    "light_cleaned_comments": "32 weeks cannot be terminated. Right decision I'm pro choice but that's an 8 month old baby. Such a tough decision and disgusting act but I think this is the right call. If the baby was born today it would most likely survive with no intervention so an abortion would be pure cruelty. Rape itself is disgusting! What kind of a sick monster one has to be to do it to his own child..rip his nails,eyes,teeth, tongue out one by one. Is there no saturation point for these kind of stories? It always amazes me If the doctors think termination was safer. then that should have been allowed. Which child? The poor little girl or the newborn baby? It’s really a shitty situation from both sides. Third trimester abortions are generally associated with a lot of complications for the mother and there’s also the moral/ethical aspect of it. But on the other side. This is a 11 year old CHILD. Child birth at such a small age will certainly be very difficult. And the changes the body undergoes after delivery are basically occurring in her even before teenage. And then there’s the mental and emotional aspect. Either option leads to the suffering of on innocent child. I just hope she has people around who will support and protect her. I can’t even imagine someone having to go through this. I agree. But nevertheless what a monster that man is. I hope he has to pay for his sins, one way or the other. How can they force a 11 year old to give birth? They ignore the real victim here It's not that simple we have to also think about the baby's right to live We can't just murderer the baby at this stage when it's been 8 months. Forcing a 11 year old to give birth even for a 8 month old is certainly a decision Poor girl never had any choice just sitting here thinking about what if the man was from THAT one specific religion. Can we please castrate ( or simply cut private parts ) man who rape women in India from now on. Please. It's not a lot to ask and our country's population is the highest in the world anyway. I would really like the govt to put the same energy they put in Ram Mandir. Also, i understand why this rulling was made. As much as I'm pro choice, the baby inside her is 8 months old and at this point it'll be commuting a murder if they do abortion. And it'll do nothing much for the girl anyway because she has already suffered the trauma of being raped and carrying the baby for 8 months. what the fuck?! This is the main issue with the country. I am fucking tired of everything revolving around religion. Why the fuck can't we do better for women safety? But aborting at this stage will probably kill the victim too :( And giving birth won't? Can’t even imagine the act💔. That guy should be hanged and the girl should get all types of help she needs. Doctors should be consulted about keeping the baby or not and she definitely doesn’t deserve any of this at such a young age. The baby doesn't have conscience yet to be innocent. It's a fetus. Couple of cells. They're ruining a fully developed and functional human's life for an unborn bunch of cells. She could die while giving birth. And why should she birth the child of such a monster? If she wishes to have the kid she can. But if she doesn't, no one has the right to stop her fr getting it aborted. That's appalling. Also, if it's safe for her to get aborted then she should have the right to get aborted. Baby ke karan use maoom bacchi ke bare mein bhi sochana chahie. At 32 weeks it's normally a full grown baby, which can survive outside the womb. Newborn You would be no different than the rapist if you did that. Just lock him up and give him a just punishment. Medieval torture isn't the solution. I agree but she's 11. Her body isn't even developed enough to go through labor. There's many after affects of pregnancy and labor, some being permanent. At this age, delivery a baby is risky, she could face permanent issues due to this. Why risk it? I think the doctors have a bit of a more expert opinion about this than you do It wasn't doctors who denied it, it was the courts which denied it. You do need a doctor to even file a petition like this. Bhai civil code hai, sharia nahi. There are better and more civilised ways available to deal with such miscreants. Peak Rajasthan moment. Bc, Pehle har cheez to country ka color dena band karo, absolute chutias like you are ruining all important national discourses into the gutter. India has quite liberal abortion laws when compared with many first world countries. So unless you are a doctor or a lawyer, pl refrain from making a judgement. But yes, I am sure we can do a whole lot better for ensuring such incidents don't happen again and that the victim gets good support system later. This is totally a logical way to deal with these kind of people And the kinder approach. I'm not asking them to be stoned to death which is what they deserve. What does this have to do with religion it literally says right there its safer for her to deliver not abort do yk how dangerous aborting an 8month old would be? Take a lil time to think before comment mindlessly. Read before you get all worked up please Any reason why this motherfucker is not named and shamed, or would revealing name bring shame to their brethren 💀 Yeah but if we do this we have to be 100% sure with no reasonable doubt about the offense. A lot of false cases also get attached so have to think how that will be addressed. According to atheists this is normal and they would throw some Freudian bs at you justifying it . I don't want to be different then. No mercy to rapists. 1)Use a knife 2) Cut them somewhere with it so they bleed 3) Then stitch it without anaesthesia. 4) Repeat Steps from 1 to 3 untill he starts begging for death. After he starts begging tie his legs and hands on a pole and let the dogs eat him alive. I did not mean that this is about religion. I meant the only thing people think of and the thing that the media, government and people revolve around is religion and not extreme issues like this. >In its order, the bench of Justice Anoop Kumar Dhand said the delay by the child in approaching the court \"has only further aggravated the said aspect\" of termination of pregnancy, and relied on the Medical Board's statement and existing judgments to turn down the request \"And relied on the medical board's statement and existing judgements\" read before getting mad 🤦‍♂️ omg New evidence comes out proving his Innocence. Then you just torture a innocent man. People like you hold these country back. What is his name ? A paternity testing can easily prove him guilty Okay not gonna debate you about that but the fuck does that have to do with this case bro 😂 Let me get this straight. They are forcing a child to give birth to a baby who will be removed from its mother and put in a state-run institution? And so it begins. A test that was not taken. Ya all have not read the article did you? I guess because the victim's name (the daughter) will easily come up if the man is named. So, protecting the victim's identity in a way? In-fucking-sane! Since it's so brutal thing and getting justice take so long ..in many countries , doctors themselves give some sort of medicine to terminate pregnancy to rape victims after taking consent from family members or the victim so there is no pregnancy to began with like turkey and etc... Why to make abortion so difficult that you need judicial people and then there is committee which will take the decision...such news will encourage the rapists ..rapists are sadist , they don't care if they get punishment , all they want to destroy the victim's life ...by doing he gets what he wants ..he trapped her with the baby for her entire life..and somewhere also destroy the baby life .. I am talking about testing after the birth of baby since the victim has been denied abortion anyway. Should they let mother die..? Capital Punishment is the only way Bro! The other guy was asking a rhetorical question. Rapists should be hanged to death they don’t deserve anything better (after being found guilty) This has always been the policy, fuck you mean “so it begins?” The rules have actually gotten looser over the last few years. Wtf are you even talking about? What does atheism even have to do with any of this? What else do you want? Terminating at this point would be dangerous plus an 11 year old should not be burdened with motherhood. It's never been proven Capital Punishment reduces rape. Effective policing, victims not being afraid to come forward, rehabilitation for the victim, judicial system, consent based sex education (you'll be surprised how few people know what consent is) among are more effective. 32 weeks is risky It’s not at 32 weeks Can't blame the court it's better to save hem than risking both of their lives considering their is a huge number of fake rape cases, no they can’t simply just castrate someone. considering their is a huge number of fake rape cases in india, no they can’t simply just castrate someone. does it actually endanger her life? Just asking a question Ram mandir ko beech me mat laa...stop inserting it everywhere...mamla kya hai tu baat kya karra...your point wouldn't have made any less sense had you excluded ram mandir topic...tum logo ko sab jageh use lana hai...smh As a woman who keeps hearing about these cases every single day and also can't even feel safe to step out of her house in this country because of how men keep staring and harassing even if not all of them are raping women, I can't feel sorry. You get stared at so much. Harassment has become so common that some of the things men do aren't even considering too much anymore. Like groping and rubbing in trains and buses is \"normal\" now. 😑😑 Incest thing is taking troll, this not good. I’m pro choice as well but at 8 months it seems just too late? I myself was born pre term at 28 weeks. that kind of behaviour of some lowlifers disgust the shit out of me, but look at the other side of the coin too and no one deserves to be punished for something they never did. (aint no way i’m justifying rapists, they deserve to fucking burned alive) Yes because the amount of enthusiasm and attention ram mandir got from politicians is huge , there are many REAL issues out there which needs that much attention but politicians ko sirf ram ram karna hai, fucking clowns USA banta jara hai ye vo in the wrong sense No, there is a reason we have evolved to unlearn that kind of thought, maybe you need to complete your process. Her Body is also Not ready to Bear the risk of Abortion and infact there is High chance she might loose her Life Aborting the child rather than giving birth and Its Not new there have been past instances of Delivering at young age. But Aborting a 32 week is too risky that is almost a whole Fetues. So Govt made the right call Her life>>>childs life. Although these sick bastards should be hanged for raping her own daughter and Tramatizing her for life Thats not going to do anything other than inflict pain. The punishment for murder os death and yet people commit murder its not about the punishment. Even if you change the punishment its not going to change how many rapes occur. First men can evolve themselves into understanding consent and respect. Not sure why we women are expected to do the work on mankind's evolution while men still behave like animals. nahh.. populus punishment is better… let the people decide what fate he deserves… and by that i mean the victims Violating anyone's bodily autonamy is *not* normal. But, so is discrediting the perils of the men who go through false accusations despite being innocent. Have you seen the documentry, *Martyrs of the Marriage*? It clearly outlines the predicament that men face when women misuse those laws. I could make a counterpoint to your argument that women mostly marry men to use them, dump them, and run off with their money -- or threaten them with imprisonment over false accusations. The generalization doesn't feel nice now does it? If you watch the documentry, it would clearly show that false cases are overtaking a real ones by alot. Should I stop feeling sorry for the *real* women who go through such predicaments because women mostly just use men for their benfit? What we *need* to work on is developing our education system, spreading awareness of mutual consent, proper rehabilitation system. Making people aware of the gravity of such offences and its consequences on the victims -- men and women both. Any form of punishment -- physical, and capital -- isn't acting as a proper deterrent now, is it? We can clearly see that the ingrained system is flawed. Of course, after proper judicial trial, capital punishment/'castration' would be fine because they were *found* guilty. If that's how it is then broadcast it so everyone can see what will happen to them if they did so. Strong punishments or strong rewards can bring out any desired behaviour from any human being. Bulldozer action and Atik Ahmed death stopped dropped the crime rates in UP to all time low. Why is that? My statement wasn't for that man. I clearly mentioned no mercy to rapists. If he is a rapist then he deserves that, if he is innocent then it implies he isn't a rapist which further implies no punishment for him. Like no one knows what the punishment is. Punishment doesn't solve crime. No amount of punishment can not change the behaviour of a person. Have you seen the data. By how much has it dropped. Please show source. Men ? You just had to go full retard didn't you ? Us v/s Them ka ye joh tum facade bana dete ho har cheez ko, yehi adaat tumhe le doobegi ek din. Indian state doesn't have the money to bring them to right path . Keep the capital punishment intact get rid of trash from society india has enough cheap labour and unemployment issues We need to bring back public executions for child rapists. I can’t wrap my head around a father raping his own daughter. Only monsters are capable of such things. Depends on your end goal. If you want the rapist to suffer and regret what they did, hell, public execution might be helpful. For me, it's about reducing and eliminating child rapes and rapes in general. For that there are multiple changes that need to be brought about. I think that misusing rights that are meant for your protection and grants you power to confront the crime should be a crime itself. If some women 'X' filed false rape case against some man then if that man is found innocent then the woman 'X' who filed the case will face the punishment of raping someone. Everyday... We stoop even lower I think once these type of men see the consequences of raping people, they’ll be more scared to commit such crimes. But the consequences need to be severe in the first place in order to deter these men. Jail for a few years won’t cut it. I'm talking about structural changes before rapes are even committed. I personally don't think rapists are born, a misogynistic society that makes them view women as objects creates them. With capital punishment you will kill one rapist, but what about the thousands being pumped into the world because they never understood what consent is, because it was never taught to them. Thank fucking god people like you are not responsible for justice. Your line of thinking is extremely barbaric and medieval. Your suggestion is entirely out of anger without considering anything else. Imagine if rape laws in India were equal for women and women couple be punished for rape. Now imagine a women gets convicted of rape and we apply your methods to her. The equivalent would be to permanently stitch her vaginal opening to the point it will only ever be able to pass menstrual blood from a tiny opening. Sounds gruesome but justified to you? Now imagine a few years later it turns out she was wrongly prosecuted. You will never be able to undo what you did to her. That person has to live her only life with a useless stitched up vagina. You cannot take a chance with your judgement when the punishment is so gruesome. The only reason I am flipping genders here is because believe it or not, it is easier to understand this from your own genders perspective. You can directly relate to it. Punishments like castration or any kind of mutilations are absolutely stupid, it breeds a society where these things start to feel normal to people. These kinds of punishments are unnatural and should always be treated as extreme and not the norm no matter how 'justified' they may seem in individual cases.Imagine the mutilation the mob would start doing because well the government does it in some cases so why not do the same to our enemies? The future generations will start using these kinds of mutilations to retaliate against each other for crimes of much lesser degree. In 50 years from now you will have people castrating/mutilating each other for theft. There is no going back once you open that gate. Now you are living in the dark ages. The fabric of society is more delicate than you think. Poor girl End goal is him feeling the pain. So yes, capital punishment is a start. That \" reducing and eliminating child rapes and rapes in general \" are just plain words with no action. We can go on about talking in circles but the victim needs immediate justice, not the law of averages and sweet words about how society needs multiple changes. Yea at 32 week is dangerous In that case i guess keeping the kid is fine. What matters is her health. > Govt made the right call Her life>>>childs life A lot of the time govt is pro life which is why it was concerning cause it should be as she wishes. In this case yes the gov is right (as long as the decision was made based on medical conditions and not their opinion on abortions :) ) Lmao what does atheism have to do with this?? 🤣 hinduism? yeah same yall want ram mandhir to be this international event that lasts days but if someone says something you don’t like “calm down it’s just a mandhir vroo” Ok so how are u going to change them , everything needs money Sweden with its correction hardly manges to change 5 percent of its rapist and their percapita income is beyond 50k USD and has highest rape rate even by indian standards. In Large country like india govt can't realistically save every soul even usa with 80k percapita decides to imprison people for years for every single step of rape to keep them in prison for most amount of time most of your arguments philosophica and not practical and their population is hardly 400mil. You want Sweden style sel correction system with ess than 3k usd, it hasn't worked yet and it will never work. Normal day in Rajasthan What I want to know is - how long did the judicial (police, courts etc) procedure took to make this conclusion? We are known for running the case for a long time unless you are a VIP (like Arnab Goswami) Putting people who rape in prison for life also hasn’t reduced the number of rapes. What’s your point? Should imprisoning rapists be gotten rid off as punishment well? Should they all be sent to a “Rapist Rehabilitation Centre”? Capital punishment for the most heinous crimes is not to deter future behaviour, but to offer moral objectivity and getting rid of people who from society who don’t deserve to be in it. Who said what you want in terms of policing etc cannot be done while capital punishment is implemented upon perpetrators of the worst crimes? You’re right that rapists are to a degree probably a result of a misogynist society. But some are born that way. Same way that psychopaths are born and sociopaths are moulded in to be that way. Societies that aren’t misogynist overall have rapists too. Rich and highly educated people rose too. Epstein and his cabal of high-powered people abused underaged girls, the cabal being comprised of some of the most popular liberals on the planet. 32 weeks is too high for abortion. Once these type of men see the consequences of raping people, they’ll be more prone to murdering the victims, so they don't come forward and accuse them. Please end this world. wow, the down vote said what words cannot describe. proves the point. Yes but at 32 weeks it's well beyond the safety limit It's already.....going to........ The progress is already posted Both I say, not like the mother is safe in her own home anyway. cut him into pieces I don’t fully agree with that. Sure, that could be the case, but I’ve lived in countries like UAE and Qatar with strict laws that result in very low crime rates and safe cities. I think having lax laws, a snail-paced justice system, and low conviction rates, gives rapists and criminals in general the confidence to commit crimes. Look at El Salvador, a country that once had the world’s highest homicide rate and was pretty much ruled by gangs is now enjoying relative peace and safety after hundreds of thousands of men were thrown into prison after a new President came into power with a strong no-nonsense approach to gang violence. El Salvador's homicide rate thus decreased by nearly 70% percent in 2023. Of course, the way in which this was done was controversial internationally but the citizens of El Salvador themselves support the President because he was able to bring safety to the previously violence-torn country by doing this. We need such a leader in India too, who is able to swiftly make heinous criminals pay for their actions and bring safety back to the innocent citizens of the nation. But it’s just a pipe dream because that’s not what the common people care about. Even if she lives she has to relocate to another state or country Her life will be worse than death Do men who claim this genuinely not understand the difference between a false case and an acquittal? Do you have a medical source for this claim? Yes you can just search it online WTF .. should be in jail for life after 8 months? that's straight up murdering a baby, just because it's inside a womb doesn't change that abortion cases are fast tracked for obvious reasons for similar urgent pleas the provision is known as writ petition Sadly, It's true. A fully developed fetus brings hormonal changes in a mother's body. Despite how enraging this situation is, the poor girl will have to endure it. I do hope they don't try to get the fetus aborted by some baba or dai. That's even more dangerous and can be fatal for the girl. As for the man, there are ways for someone to 'die naturally' without anyone realizing what actually happened. I start ripping off something else, then go to the nails, eyes, etc From my experience on reddit: No. google and common sense... A pregnancy is 40 weeks so by week 32 its far too late to terminate a pregnancy do women like you even read and understand the whole situation before commenting shit about it? she’s talking about all the cases, not specifically about this one. This. For a country like ours, where politics absolves all crimes and where crime is the backbone of people in power, a drastic and hard hand approach is next to impossible. Rather it is the empowerment of the masses - via education, awareness and the legal support - which can give us a fighting chance of removing the muck of crime where those in power feel they can get away with everything without any consequential baggage. More punishment is not an effective deterrent to crime. Many studies have proven this. Rather, conviction rates go down because it’s hard to prove most crimes (including rape) to a degree of certainty to justify death penalty. I disagree with your first sentence entirely. I have lived most of my life in countries with extremely strict laws and could walk around alone late at night without any fear of getting murdered or raped. And in cases of incestual rape (like this one), it’s very easy to prove with certainty who the rapist was with a DNA test. No. But because capital punishment does nothing to reduce criminality, and the potential for harm due to mistakes by the state are greater, extending it to other crimes is a regressive act that has no value for anyone. Besides which, it can even incentivize worse crimes. If the punishment for rape and murder are the same, the rapist has even less incentive to keep their victim alive if they fear them testifying. Humans are animals too. And we’re such a large sample size of 8 billion. Every behaviour you can and cannot imagine exists. I want to cry. Yeah but you have upi so you're advanced enough for a little judgment. The girl had 8 months. Can you hear yourself or are you so fucking dumb. She is freaking 11. She didn't know anything. She got raped. It was her mom and relatives who realised and took her to the doctor. Please refrain from commenting if you can't use your brain on such sensitive topics. She can die during child birth as she is just 11. For a normal adult woman. For a 11 year old with severe mental trauma it would be different according to my common sense. Funny thing, I googled abortion 32 weeks and some cases came up instantly: I am sure I can find more. North Indians getting good name and credit for South Indians. Keep doing more damage hats off!! Wouldn’t Childbirth be more dangerous for a 11 year old than an abortion :/ The 11 year is a a fully grown baby too, she’s an autonomous child & childbirth is dangerous. Are you ok? Don't kill him to reduce rape. Kill him to punish raping his daughter Everything else I agree with I replied to you, not her. This “huge number of fake rape cases” comes from the failure to understand the very basic distinction between a fake case and an acquittal. Man, it would be even more dangerous for the little girl due to her age It would depend on the girl's condition and the doctors recommendations. In any case I don't support any legal interference to patient care (whatever that may be). I would think that under rape circumstances, especially this one, she should be able to abort her baby because she never wanted it in the first place, and the father won't even be there to take care of the baby. Gross. #Womensrights Really brother and i replied to her, not you. it was in the context of her original comment. Convert 32 weeks into months if you're finding it hard to understand. dumbfuck And? Then stop being idiot. Lmfao ok troll. Don't waste my time anymore with ad hominems. We need to start killing these rapists, nothing would change otherwise, monsters Stfu, adopt children if you care that much. The victim is 11,wtf is wrong with you. Exactly. It makes you no different from the monsters you are trying to punish. It shouldn't be normal to \"enjoy\" torturing someone. Capital punishments make sense but not torture. You made an incorrect statement, which I have quoted in my previous reply. I corrected that statement, nothing else. Bro how hard is to to comprehend how dangerous it would be to abort that late???? Lmfao you still haven't provided a single medical source to support your statement. This is really pathetic. This is what happrns when People uneducated in medicine comment about the safety of medical procedures. Interesting read but why does it sound so extrême There is no extreme really. Again no legal interference in people's private medical decisions."
}