{
    "id": "10x477c",
    "title": "Workplace situation",
    "url": "https://www.reddit.com/r/india/comments/10x477c/workplace_situation/",
    "selftext": "This is a sort-of follow up to one of my previous posts in this SR.\n\nCan I know what you'll make of this workplace situation, what you'll think of it, &amp; how to deal with it?\n\nLast Monday (30 Jan) my supervisor asked me to create a doc in OneDrive to make a list of all the issues that our team had been facing with this software (he asked me to do it cos I use that software the most so face the most issues - this is actually the software I'm trained in, it's what I bring to the team), &amp; he asked me to share this doc in Teams so everyone could add to it as needed. By Monday afternoon I had created the doc &amp; shared it with the team on Teams.\n\nThis Monday (6 Feb) he asked me to check for an update, so we could proceed to inform our vendor &amp; start resolving the issues. When I went to check on the doc, I noticed that this one girl from our team who I'll refer to as \"T\" had added a column \"category\" to the doc that I had created (I had created columns \"Sr, Issue, Requested by\").\n\nI've previously mentioned T in my old post [https://www.reddit.com/r/india/comments/ysgss4/office\\_promotions\\_situation/](https://www.reddit.com/r/india/comments/ysgss4/office_promotions_situation/).\n\nWhat do you make of T creating this additional column in my doc?\n\nWhen I saw it, I immediately deleted it, &amp; created an additional column \"Notes\" where I added my notes to a couple of her issues saying that they had been previously resolved by me as part of an umbrella issue that I was facing in Jan &amp; that it works fine now (my note was not quite this long, was only 5-6 words, just have to explain it longer here cos I'm also trying not to give specifics).\n\nImo, T has a history of speaking up to show herself up even when she doesn't know things (this software is not something she knows well, actually has barely used it) &amp; making herself look good by making others look bad. Every office has one of these, &amp; T is the one at my office. But that's my opinion, I'd like your unbiased opinion.\n\nYesterday, my supervisor messaged me again that if the list is ready I should email it to the vendor &amp; start resolving things. &amp; right when he sent that message in Teams, T messaged me privately in Teams &amp; told me that she's deleted my \"Notes\" column because some of the issues haven't been resolved. I immediately removed her access from my doc &amp; re-added my \"Notes\" column. I also replied to her msg saying that I had used the software that day &amp; those particular issues haven't shown up &amp; those things work. Then after a while she replied back saying \"she had spoken to the vendor &amp; he said they had removed access for a little while because of security concerns, but they've re-added everything &amp; it all works now\". I've attached a screenshot of her msgs below.\n\nSince then, she hasn't asked me about her lost access to the doc.\n\nWhat do you'll make of T adding &amp; deleted columns from my doc &amp; also this situation?\n\n(Edited last sentence for clarity)\n\nhttps://preview.redd.it/4y5l9arcuzga1.jpg?width=416&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=15fb7b1c83d8f6928626a17ce28da5e81f9f2c5e",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 2,
    "created_utc": 1675874753,
    "convurl": "https://b.thumbs.redditmedia.com/PHPufNHfMh2-f0uDV6r7dIW2GMBK5xTjTIL7uUjBokY.jpg",
    "comments": [
        "you guys are just being immature. Why not resolve your conflicts like an adult? Work on your communication. It is essential at the workplace.",
        "You shouldn't have deleted the column. Instead you should have let it be and added your column of notes. In the notes you should have written when each of these issues were resolved.\n\nThis would allow the entire team and supervisor to see that she was out of sync with the developments in the team and consequently shown her poor work."
    ],
    "cleaned_text": "workplace situation sortof follow one previous posts sr know youll make workplace situation youll think amp deal last monday jan supervisor asked create doc onedrive make list issues team facing software asked cos use software face issues actually software im trained bring team amp asked share doc teams everyone could add needed monday afternoon created doc amp shared team teams monday feb asked check update could proceed inform vendor amp start resolving issues went check doc noticed one girl team ill refer added column category doc created created columns sr issue requested ive previously mentioned old post httpswwwredditcomrindiacommentsysgssofficepromotionssituationhttpswwwredditcomrindiacommentsysgssofficepromotionssituation make creating additional column doc saw immediately deleted amp created additional column notes added notes couple issues saying previously resolved part umbrella issue facing jan amp works fine note quite long words explain longer cos im also trying give specifics imo history speaking show even doesnt know things software something knows well actually barely used amp making look good making others look bad every office one amp one office thats opinion id like unbiased opinion yesterday supervisor messaged list ready email vendor amp start resolving things amp right sent message teams messaged privately teams amp told shes deleted notes column issues havent resolved immediately removed access doc amp readded notes column also replied msg saying used software day amp particular issues havent shown amp things work replied back saying spoken vendor amp said removed access little security concerns theyve readded everything amp works ive attached screenshot msgs since hasnt asked lost access doc youll make adding amp deleted columns doc amp also situation edited last sentence clarity ",
    "cleaned_title": "workplace situation",
    "cleaned_selftext": "sortof follow one previous posts sr know youll make workplace situation youll think amp deal last monday jan supervisor asked create doc onedrive make list issues team facing software asked cos use software face issues actually software im trained bring team amp asked share doc teams everyone could add needed monday afternoon created doc amp shared team teams monday feb asked check update could proceed inform vendor amp start resolving issues went check doc noticed one girl team ill refer added column category doc created created columns sr issue requested ive previously mentioned old post httpswwwredditcomrindiacommentsysgssofficepromotionssituationhttpswwwredditcomrindiacommentsysgssofficepromotionssituation make creating additional column doc saw immediately deleted amp created additional column notes added notes couple issues saying previously resolved part umbrella issue facing jan amp works fine note quite long words explain longer cos im also trying give specifics imo history speaking show even doesnt know things software something knows well actually barely used amp making look good making others look bad every office one amp one office thats opinion id like unbiased opinion yesterday supervisor messaged list ready email vendor amp start resolving things amp right sent message teams messaged privately teams amp told shes deleted notes column issues havent resolved immediately removed access doc amp readded notes column also replied msg saying used software day amp particular issues havent shown amp things work replied back saying spoken vendor amp said removed access little security concerns theyve readded everything amp works ive attached screenshot msgs since hasnt asked lost access doc youll make adding amp deleted columns doc amp also situation edited last sentence clarity",
    "cleaned_comments": "guys immature resolve conflicts like adult work communication essential workplace shouldnt deleted column instead let added column notes notes written issues resolved would allow entire team supervisor see sync developments team consequently shown poor work",
    "light_cleaned_title": "Workplace situation",
    "light_cleaned_selftext": "This is a sort-of follow up to one of my previous posts in this SR. Can I know what you'll make of this workplace situation, what you'll think of it, &amp; how to deal with it? Last Monday (30 Jan) my supervisor asked me to create a doc in OneDrive to make a list of all the issues that our team had been facing with this software (he asked me to do it cos I use that software the most so face the most issues - this is actually the software I'm trained in, it's what I bring to the team), &amp; he asked me to share this doc in Teams so everyone could add to it as needed. By Monday afternoon I had created the doc &amp; shared it with the team on Teams. This Monday (6 Feb) he asked me to check for an update, so we could proceed to inform our vendor &amp; start resolving the issues. When I went to check on the doc, I noticed that this one girl from our team who I'll refer to as \"T\" had added a column \"category\" to the doc that I had created (I had created columns \"Sr, Issue, Requested by\"). I've previously mentioned T in my old post [https://www.reddit.com/r/india/comments/ysgss4/office\\_promotions\\_situation/](https://www.reddit.com/r/india/comments/ysgss4/office_promotions_situation/). What do you make of T creating this additional column in my doc? When I saw it, I immediately deleted it, &amp; created an additional column \"Notes\" where I added my notes to a couple of her issues saying that they had been previously resolved by me as part of an umbrella issue that I was facing in Jan &amp; that it works fine now (my note was not quite this long, was only 5-6 words, just have to explain it longer here cos I'm also trying not to give specifics). Imo, T has a history of speaking up to show herself up even when she doesn't know things (this software is not something she knows well, actually has barely used it) &amp; making herself look good by making others look bad. Every office has one of these, &amp; T is the one at my office. But that's my opinion, I'd like your unbiased opinion. Yesterday, my supervisor messaged me again that if the list is ready I should email it to the vendor &amp; start resolving things. &amp; right when he sent that message in Teams, T messaged me privately in Teams &amp; told me that she's deleted my \"Notes\" column because some of the issues haven't been resolved. I immediately removed her access from my doc &amp; re-added my \"Notes\" column. I also replied to her msg saying that I had used the software that day &amp; those particular issues haven't shown up &amp; those things work. Then after a while she replied back saying \"she had spoken to the vendor &amp; he said they had removed access for a little while because of security concerns, but they've re-added everything &amp; it all works now\". I've attached a screenshot of her msgs below. Since then, she hasn't asked me about her lost access to the doc. What do you'll make of T adding &amp; deleted columns from my doc &amp; also this situation? (Edited last sentence for clarity)",
    "light_cleaned_comments": "you guys are just being immature. Why not resolve your conflicts like an adult? Work on your communication. It is essential at the workplace. You shouldn't have deleted the column. Instead you should have let it be and added your column of notes. In the notes you should have written when each of these issues were resolved. This would allow the entire team and supervisor to see that she was out of sync with the developments in the team and consequently shown her poor work."
}