{
    "id": "13ilfov",
    "title": "The Broken: ‘Dalit’ Sikhs Fight Back Against Land Discrimination In Punjab",
    "url": "https://religionunplugged.com/news/2023/5/1/the-broken-dalit-sikhs-fight-back-in-punjab",
    "selftext": "The caste system’s legacy has prohibited dalits from owning land nationwide, and this pattern remains prominent in India’s Sikh-majority state of Punjab, which has a population of about 30 million. Despite accounting for nearly one-third (32%) of Punjab’s population, Dalits own a mere 3.5% of private land. Meanwhile, the dominant agricultural jat caste, which comprises 20% of the state’s population, holds over 80% of the land…",
    "flair": "Law & Courts",
    "score": 58,
    "num_comments": 1,
    "created_utc": 1684186751.0,
    "convurl": "https://external-preview.redd.it/YMVB4iAxFivCA6hpwN6kwQS78UmtJQec2CsUROm6WnY.jpg?auto=webp&v=enabled&s=4ed98d2b787588270efbbf5549f7f950594bffe3",
    "comments": [
        "Heard a lot about the discrimination there. Moving to cities and making our education, intelligence and risk taking aptitude speak for itself is the only option. All the best."
    ],
    "cleaned_text": "broken dalit sikhs fight back land discrimination punjab caste systems legacy prohibited dalits owning land nationwide pattern remains prominent indias sikhmajority state punjab population million despite accounting nearly onethird punjabs population dalits mere private land meanwhile dominant agricultural jat caste comprises states population holds land ",
    "cleaned_title": "broken dalit sikhs fight back land discrimination punjab",
    "cleaned_selftext": "caste systems legacy prohibited dalits owning land nationwide pattern remains prominent indias sikhmajority state punjab population million despite accounting nearly onethird punjabs population dalits mere private land meanwhile dominant agricultural jat caste comprises states population holds land",
    "cleaned_comments": "heard lot discrimination moving cities making education intelligence risk taking aptitude speak option best",
    "light_cleaned_title": "The Broken: ‘Dalit’ Sikhs Fight Back Against Land Discrimination In Punjab",
    "light_cleaned_selftext": "The caste system’s legacy has prohibited dalits from owning land nationwide, and this pattern remains prominent in India’s Sikh-majority state of Punjab, which has a population of about 30 million. Despite accounting for nearly one-third (32%) of Punjab’s population, Dalits own a mere 3.5% of private land. Meanwhile, the dominant agricultural jat caste, which comprises 20% of the state’s population, holds over 80% of the land…",
    "light_cleaned_comments": "Heard a lot about the discrimination there. Moving to cities and making our education, intelligence and risk taking aptitude speak for itself is the only option. All the best."
}