{
    "id": "18oaqw5",
    "title": "Lok Sabha passes Chief Election Commissioner Bill",
    "url": "https://www.reddit.com/r/india/comments/18oaqw5/lok_sabha_passes_chief_election_commissioner_bill/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/yk7cb2lrat7c1.png?width=960&format=png&auto=webp&s=5391268561b9e3d0859f1df17060c5c9d72403b7\n\n \n\nThe new bill has dropped the CJI from the selection committee of Election Commissioners.\n\nSupreme Court had ruled that the election commissioners shall be selected by a committee comprising the PM, Leader of the Opposition & the Chief Justice of India.\n\nA per the passed bill, The panel will now include Prime Minister, Leader of Opposition & a cabinet minister nominated by Prime Minister\n\nSource- [https://www.hindustantimes.com/india-news/what-does-newly-passed-bill-on-appointment-of-top-three-election-officials-say-101703157427974.html](https://www.hindustantimes.com/india-news/what-does-newly-passed-bill-on-appointment-of-top-three-election-officials-say-101703157427974.html)\n\n&#x200B;",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1703236071.0,
    "convurl": "https://external-preview.redd.it/2FwIliipSkf7yekLONwOcB1uTAUEZxLgOHaIJZfNMxc.jpg?auto=webp&s=8fbc9bb3a72dafe1dac2621422a415f39fde3cd4",
    "comments": [],
    "cleaned_text": "lok sabha passes chief election commissioner bill xb new bill dropped cji selection committee election commissioners supreme court ruled election commissioners shall selected committee comprising pm leader opposition chief justice india per passed bill panel include prime minister leader opposition cabinet minister nominated prime minister source httpswwwhindustantimescomindianewswhatdoesnewlypassedbillonappointmentoftopthreeelectionofficialssayhtmlhttpswwwhindustantimescomindianewswhatdoesnewlypassedbillonappointmentoftopthreeelectionofficialssayhtml xb ",
    "cleaned_title": "lok sabha passes chief election commissioner bill",
    "cleaned_selftext": "xb new bill dropped cji selection committee election commissioners supreme court ruled election commissioners shall selected committee comprising pm leader opposition chief justice india per passed bill panel include prime minister leader opposition cabinet minister nominated prime minister source httpswwwhindustantimescomindianewswhatdoesnewlypassedbillonappointmentoftopthreeelectionofficialssayhtmlhttpswwwhindustantimescomindianewswhatdoesnewlypassedbillonappointmentoftopthreeelectionofficialssayhtml xb",
    "cleaned_comments": "",
    "light_cleaned_title": "Lok Sabha passes Chief Election Commissioner Bill",
    "light_cleaned_selftext": "&#x200B; The new bill has dropped the CJI from the selection committee of Election Commissioners. Supreme Court had ruled that the election commissioners shall be selected by a committee comprising the PM, Leader of the Opposition & the Chief Justice of India. A per the passed bill, The panel will now include Prime Minister, Leader of Opposition & a cabinet minister nominated by Prime Minister Source- [https://www.hindustantimes.com/india-news/what-does-newly-passed-bill-on-appointment-of-top-three-election-officials-say-101703157427974.html](https://www.hindustantimes.com/india-news/what-does-newly-passed-bill-on-appointment-of-top-three-election-officials-say-101703157427974.html) &#x200B;",
    "light_cleaned_comments": ""
}