{
    "id": "1b9n0t2",
    "title": "Hindutva k dalaal",
    "url": "https://youtu.be/9Hd505j2rSw?si=bNH20Zc2Jmw6BpuX",
    "selftext": "Such secularism and freedom!",
    "flair": "Crime",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1709901753.0,
    "convurl": "https://external-preview.redd.it/9im8l69RGrH9MqcB0TejaOUmNtXpWQtW2ve8BohAcIQ.jpg?auto=webp&s=c99f8f32d1281e0d7fe4785bc135e1504c3e9e9a",
    "comments": [
        "This is not the way to enforce law and order. I want him to try the same tactics when the \"majority\" does a procession and he might leave without a few limbs or head. \n\nAs the government itself approves his methods,instead of being punished he will get promoted or become next BJ Pee candidate.\n\nI believe religion has no right to block roads,but the \"selective\" law and order is a bigger problem.",
        "💯 No religion has the right to block roads and inconvenience the public, whoever may be the majority. He is lucky to get merely suspended, could've very well lost his skull to the pavement if the worshippers got violent",
        "Looking at his demeanor, I advice checking his service history. He's not fit to be in police service at all. \n\n\nGood thing that this mf is suspended and departmental enquiry is underway ",
        "It is a good thing no one except the Police behaved stupid.\n\nWhen Police is filled with terrorists,never expect them to be impartial in their duty."
    ],
    "cleaned_text": "hindutva k dalaal secularism freedom ",
    "cleaned_title": "hindutva k dalaal",
    "cleaned_selftext": "secularism freedom",
    "cleaned_comments": "way enforce law order want try tactics majority procession might leave without limbs head government approves methodsinstead punished get promoted become next bj pee candidate believe religion right block roadsbut selective law order bigger problem religion right block roads inconvenience public whoever may majority lucky get merely suspended couldve well lost skull pavement worshippers got violent looking demeanor advice checking service history hes fit police service good thing mf suspended departmental enquiry underway good thing one except police behaved stupid police filled terroristsnever expect impartial duty",
    "light_cleaned_title": "Hindutva k dalaal",
    "light_cleaned_selftext": "Such secularism and freedom!",
    "light_cleaned_comments": "This is not the way to enforce law and order. I want him to try the same tactics when the \"majority\" does a procession and he might leave without a few limbs or head. As the government itself approves his methods,instead of being punished he will get promoted or become next BJ Pee candidate. I believe religion has no right to block roads,but the \"selective\" law and order is a bigger problem. 💯 No religion has the right to block roads and inconvenience the public, whoever may be the majority. He is lucky to get merely suspended, could've very well lost his skull to the pavement if the worshippers got violent Looking at his demeanor, I advice checking his service history. He's not fit to be in police service at all. Good thing that this mf is suspended and departmental enquiry is underway It is a good thing no one except the Police behaved stupid. When Police is filled with terrorists,never expect them to be impartial in their duty."
}