{
    "id": "1cau6id",
    "title": "Need an Election Commissioner like him",
    "url": "https://i.redd.it/gv3mod8za5wc1.jpeg",
    "selftext": "With the kind of stuff that is going on, we need an Election Commissioner that gives politicians 'The Belt Treatment '. Sad that we are left with spineless puppets ",
    "flair": "Rant / Vent",
    "score": 1324,
    "num_comments": 104,
    "created_utc": 1713841596.0,
    "convurl": "https://i.redd.it/gv3mod8za5wc1.jpeg",
    "comments": [
        "ED department will show up at his house if he doesn't listen to Supreme Leader",
        "Not many PPL know but he contested against advani in 1999 in gandhinagar gujrat",
        "Earlier rule was CJI, Ruling Party member and Opposition member together will chose election commissioner.\n\nMudizi and co changed it to 2 ruling party members and 1 opposition member.\n\nIf the Current CJI was the part of it then we could have expected something.",
        "What do you expect from a place like Gujarat 🤣. The G stands for where their brains lie",
        "Then vote for the right party",
        "hey captain, any context? was he badass or something, enlighten us",
        "That spineless puppets belongs to Modi Ka Parivar ✅",
        "The saddest part is, things will only get worse even if bjp will lose. Simply because no party in power would want to strengthen institutions which may go against them in the future. This was a slippery slope to start on and now we are sliding down. Need a revolutionary leader, who actually cares about the country to take power and restore the balance (not happening i know).",
        "It's like expecting a buffet When we haven't gotten anything to eat, expecting even chapatis would be a big deal now.",
        "To those who don't know, he is the same person who said \"mai nashte me netao ko khata hu\"  \nTranslation: \"I eat politicians in breakfast\"",
        "Dude was a freaking badass. Today the level of transparency is high because of him, he identified more than hundred of malpractices and brought reforms.",
        "it takes immense fearlessness to say something like that.   \nSadly our generation got some spineless meatriders as ECI officials.",
        "I don't think many anti BJP people are prepared for the level of rot the next government will have to deal with. Like this whole hateful partisan media won't disappear overnight. Either the next government will have to do a reverse of Modi did or basically allow them to forment an insurrection like Fox did in the US.\n\nThis is why fascism ruins country. Once certain moral lines are crossed it is very hard to go back to a state of normalcy. But this country's buddhas wanted our own Hitler and we fucking got one.",
        ">  The G stands for where their brains lie\n\nLMAO that's a good one",
        "https://preview.redd.it/83coi830s5wc1.jpeg?width=1280&format=pjpg&auto=webp&s=554b2e62d8632689ac8d75d9b471a247f9cdd73b",
        "We deserve nothing !\n\nhttps://preview.redd.it/mlr9n6t0u5wc1.jpeg?width=1080&format=pjpg&auto=webp&s=100c529ac2f75df7409e9aea3113b7d06bd9788f",
        "OKAY THEN. DESPERATE TIMES NEEDS BADASS LIKE HIM. Or else we’re doomed now -_-",
        "What did Mr Seshan do? Any stories or articles?",
        "Modiji will ensure that these types of officers will never come into power.",
        "Yoo LMAO 🤣🤣",
        "He should have contested from his home state of Kerala, the political scene would have been different if he was a minister in the UPA.",
        "Do you think men like him don't exist anymore or aren't in service ? It's just govts earlier, despite all the taunts ch#t!ya moi may hurl on them, followed rule book and weren't as besharam as current one. \n\nIf he was in current era, Seshan would be a faceless diligent officer and never rise to rank of CEC. Remember Ashok Lavasa, he just 'dissented' & then suddenly resigned..",
        "I was one of the few lucky ones to have couple of classes with him at Great Lakes. He used to teach Leadership there for a short while.",
        "Please don't take it personally, but I am a teacher so I cannot let that pass: it's either \"for breakfast\", or \"at breakfast time\" :)",
        "More words reduce the impact of the dialogue",
        "You're right; but I don't quite see how \"for\" instead of \"in\" would lengthen the dialogue.",
        "To have an EC like him you need a conducive environment as well where the ruling powers do not have a chokehold on the system and an IT cell promoting and providing misinformation to citizens and a broadcast media which only does what the rulers tell them to do.",
        "What sort of teacher thinks “at breakfast time” fits here? That’s just plain wrong.",
        "You like to antagonize don't you?\nI was clearly talking of grammatical correctness. Just replace \"in\" by \"for\" and give me a break already.",
        "Grammar ❌\nDialogue Impact ✅\n\nAre you a mass masala movie script writer by any chance?",
        "No, just a common movie watcher",
        "Before he took charge, most indians didn't know there was something called ECI.\n\nPure Legend.",
        "The phrase is “I eat x for breakfast” anything else is non standard\n\nAlso “at breakfast time” is almost never used. I can’t think of a single sentence with “at breakfast time” in it.",
        "So what if one does not have any illegal wealth then what is issue. One thing he should not have any Personnel computer connected to Internet as it can be hacked",
        "I really thought to write \"for\" there, and then just wrote \"in\", but hey thanks for correcting :)",
        "This country needs organisations which actively hunts politicians across the spectrum. They need to be afraid.",
        "But he used \"in\" instead of \"for\", hence my intervention.\nAnd the fact that according to you \"at... time\" is almost never used doesn't make it any less correct. You can't just manipulate grammar according to your rethorical taste. Semantic and rethoric are not to be confused, mind you.",
        "You're very welcome. As I said, it was not nothing personal, merely a teacher's reflex :)",
        "Agreed",
        "*for breakfast.\n\n\nThis is the second time on an Indian subreddit Ive seen this error. What the fuck is in breakfast. You are eating politicians inside your poha??!",
        "[Remembering Seshan: His iron fist led the game-changing electoral reforms in the 90s](https://www.theweek.in/news/india/2019/11/11/remembering-seshan-a-ruthless-enforcer-who-led-the-game-changing-90s-electoral-reforms.html)   \n\n> Till he took over, political parties ferrying people to the polling stations were considered quite \"normal,\" and **it was during Seshan's stint that it became impossible with the model code being made sacrosanct**. Also, he ensured that bogus voting was averted to a large extent.   \n\n[‘Through the Broken Glass: An Autobiography’ by TN Seshan: Moves and moods of a ‘reluctant CEC’](https://www.tribuneindia.com/news/reviews/story/through-the-broken-glass-an-autobiography-by-tn-seshan-moves-and-moods-of-a-reluctant-cec-519964)    \n\n> Seshan’s epic order left India’s political system vulnerable to one man’s whim. The deadlock was, he argued, “solely the making of the government”. Postponement of “all and every election” was a **Seshanesque response to the government’s ploys to render the Election Commission into one of its departments**. Seshan’s mission was to recover its autonomy.",
        "On top of it, the entirety of the bureaucracy is filled with rot, it’s unimaginable, the way South Korea is still struggling with systematic demolition of democracy after Park Chung Hee, we will spend the next century dealing with this.",
        "Abhi to ec comm. govt ka chusne me lage hai",
        "Yeah people use Hitler as the only example of Fascism. But Germany is actually one of the few countries that has managed to fix their institutions after fascism. Spain, Argentina and Italy - reel from the after effects to this day.",
        "Bro bjp have changed the rule, first they will put you in jail, then if you have proven innocent after only you will get the bail, just like kejriwal",
        "PMLA is all about jailing opposition and keeping them inside until \"proven\" innocent.",
        "This country needs civil society organisations that are powerful and media that is independent",
        "That approach will only work if those organisations have teeth. Mere memorandums and complaints to the SC will not work.",
        "We don’t need characters we need institutions & process, not more of Gandhis and Modis!",
        "Probably a direct translation of “me khaata” to in",
        "Because they bothered to acknowledge where they went wrong and made it a point to teach it in their school, we otoh like Japan are going neck deep into revisionism, aren’t we? This zed-alpha generation is done for.",
        "And citizens",
        "Yeah the RIGHT party",
        "Yes.. the RIGHT RIGHT one.. not the RIGHT one.. I agree..",
        "BJP's chess rule:  When BJP captures a pawn, the pawn is pressed into play for BJP.\n\nThey've captured almost everything.",
        "Also, because Allied nations ruled Germany for a brief period and created the narrative that all Germans are to be blamed for the Nazis.",
        "True. They were very effective in that too. \n\nNow, when I see a German, the first thought that crosses my mind is Nazism, second - Hitler, third - concentration camps and finally, their cars.\n\nCrazy how one man changed the perspective of a country indefinitely.",
        "How's South Korea struggling? Is it something to do with the inequality caused by the chaebols?",
        "You spelled rhetorical and rhetoric wrong. Just wanted to point that out.",
        "are you a English teacher",
        "Thank you for the correction, I didn't check my message as I was a little annoyed with that interlocutor.",
        "Lol misinfo ka chods",
        "But I thought the Supreme Court and the CJI were already in Modi's pocket. At least that's what I believe reading posts here.\n\nOn other subs though, it's the exact opposite.",
        "*an",
        "Gobi ji has done damage to the country so much so that its effect is going to stay for decades.\n\nThey need to lose at least once for balance, else we're heading towards absolute power.",
        "The one with democracy, RIGHT?",
        "Abhi hota to iske peeche ED CBI lag jaati aur arrest kar liya jaata.",
        "Right! Exactly! Not the other type!! We don't want the other type!",
        "Nope. The rule you are stating was brought by a SC Judgement on May 2023. Before that it was PM who directly selected Election Commissioners"
    ],
    "cleaned_text": "need election commissioner like kind stuff going need election commissioner gives politicians belt treatment sad left spineless puppets ",
    "cleaned_title": "need election commissioner like",
    "cleaned_selftext": "kind stuff going need election commissioner gives politicians belt treatment sad left spineless puppets",
    "cleaned_comments": "ed department show house doesnt listen supreme leader many ppl know contested advani gandhinagar gujrat earlier rule cji ruling party member opposition member together chose election commissioner mudizi co changed ruling party members opposition member current cji part could expected something expect place like gujarat g stands brains lie vote right party hey captain context badass something enlighten us spineless puppets belongs modi ka parivar saddest part things get worse even bjp lose simply party power would want strengthen institutions may go future slippery slope start sliding need revolutionary leader actually cares country take power restore balance happening know like expecting buffet havent gotten anything eat expecting even chapatis would big deal dont know person said mai nashte netao ko khata hu translation eat politicians breakfast dude freaking badass today level transparency high identified hundred malpractices brought reforms takes immense fearlessness say something like sadly generation got spineless meatriders eci officials dont think many anti bjp people prepared level rot next government deal like whole hateful partisan media wont disappear overnight either next government reverse modi basically allow forment insurrection like fox us fascism ruins country certain moral lines crossed hard go back state normalcy countrys buddhas wanted hitler fucking got one g stands brains lie lmao thats good one deserve nothing okay desperate times needs badass like else doomed mr seshan stories articles modiji ensure types officers never come power yoo lmao contested home state kerala political scene would different minister upa think men like dont exist anymore arent service govts earlier despite taunts chtya moi may hurl followed rule book werent besharam current one current era seshan would faceless diligent officer never rise rank cec remember ashok lavasa dissented suddenly resigned one lucky ones couple classes great lakes used teach leadership short please dont take personally teacher let pass either breakfast breakfast time words reduce impact dialogue youre right dont quite see instead would lengthen dialogue ec like need conducive environment well ruling powers chokehold system cell promoting providing misinformation citizens broadcast media rulers tell sort teacher thinks breakfast time fits thats plain wrong like antagonize dont clearly talking grammatical correctness replace give break already grammar dialogue impact mass masala movie script writer chance common movie watcher took charge indians didnt know something called eci pure legend phrase eat x breakfast anything else non standard also breakfast time almost never used cant think single sentence breakfast time one illegal wealth issue one thing personnel computer connected internet hacked really thought write wrote hey thanks correcting country needs organisations actively hunts politicians across spectrum need afraid used instead hence intervention fact according time almost never used doesnt make less correct cant manipulate grammar according rethorical taste semantic rethoric confused mind youre welcome said nothing personal merely teachers reflex agreed breakfast second time indian subreddit ive seen error fuck breakfast eating politicians inside poha remembering seshan iron fist led gamechanging electoral reforms shttpswwwtheweekinnewsindiarememberingseshanaruthlessenforcerwholedthegamechangingselectoralreformshtml till took political parties ferrying people polling stations considered quite normal seshans stint became impossible model code made sacrosanct also ensured bogus voting averted large extent broken glass autobiography tn seshan moves moods reluctant cechttpswwwtribuneindiacomnewsreviewsstorythroughthebrokenglassanautobiographybytnseshanmovesandmoodsofareluctantcec seshans epic order left indias political system vulnerable one mans whim deadlock argued solely making government postponement every election seshanesque response governments ploys render election commission one departments seshans mission recover autonomy top entirety bureaucracy filled rot unimaginable way south korea still struggling systematic demolition democracy park chung hee spend next century dealing abhi ec comm govt ka chusne lage hai yeah people use hitler example fascism germany actually one countries managed fix institutions fascism spain argentina italy reel effects day bro bjp changed rule first put jail proven innocent get bail like kejriwal pmla jailing opposition keeping inside proven innocent country needs civil society organisations powerful media independent approach work organisations teeth mere memorandums complaints sc work dont need characters need institutions process gandhis modis probably direct translation khaata bothered acknowledge went wrong made point teach school otoh like japan going neck deep revisionism arent zedalpha generation done citizens yeah right party yes right right one right one agree bjps chess rule bjp captures pawn pawn pressed play bjp theyve captured almost everything also allied nations ruled germany brief period created narrative germans blamed nazis true effective see german first thought crosses mind nazism second hitler third concentration camps finally cars crazy one man changed perspective country indefinitely hows south korea struggling something inequality caused chaebols spelled rhetorical rhetoric wrong wanted point english teacher thank correction didnt check message little annoyed interlocutor lol misinfo ka chods thought supreme court cji already modis pocket least thats believe reading posts subs though exact opposite gobi ji done damage country much effect going stay decades need lose least balance else heading towards absolute power one democracy right abhi hota iske peeche ed cbi lag jaati aur arrest kar liya jaata right exactly type dont want type nope rule stating brought sc judgement may pm directly selected election commissioners",
    "light_cleaned_title": "Need an Election Commissioner like him",
    "light_cleaned_selftext": "With the kind of stuff that is going on, we need an Election Commissioner that gives politicians 'The Belt Treatment '. Sad that we are left with spineless puppets",
    "light_cleaned_comments": "ED department will show up at his house if he doesn't listen to Supreme Leader Not many PPL know but he contested against advani in 1999 in gandhinagar gujrat Earlier rule was CJI, Ruling Party member and Opposition member together will chose election commissioner. Mudizi and co changed it to 2 ruling party members and 1 opposition member. If the Current CJI was the part of it then we could have expected something. What do you expect from a place like Gujarat 🤣. The G stands for where their brains lie Then vote for the right party hey captain, any context? was he badass or something, enlighten us That spineless puppets belongs to Modi Ka Parivar ✅ The saddest part is, things will only get worse even if bjp will lose. Simply because no party in power would want to strengthen institutions which may go against them in the future. This was a slippery slope to start on and now we are sliding down. Need a revolutionary leader, who actually cares about the country to take power and restore the balance (not happening i know). It's like expecting a buffet When we haven't gotten anything to eat, expecting even chapatis would be a big deal now. To those who don't know, he is the same person who said \"mai nashte me netao ko khata hu\" Translation: \"I eat politicians in breakfast\" Dude was a freaking badass. Today the level of transparency is high because of him, he identified more than hundred of malpractices and brought reforms. it takes immense fearlessness to say something like that. Sadly our generation got some spineless meatriders as ECI officials. I don't think many anti BJP people are prepared for the level of rot the next government will have to deal with. Like this whole hateful partisan media won't disappear overnight. Either the next government will have to do a reverse of Modi did or basically allow them to forment an insurrection like Fox did in the US. This is why fascism ruins country. Once certain moral lines are crossed it is very hard to go back to a state of normalcy. But this country's buddhas wanted our own Hitler and we fucking got one. > The G stands for where their brains lie LMAO that's a good one We deserve nothing ! OKAY THEN. DESPERATE TIMES NEEDS BADASS LIKE HIM. Or else we’re doomed now -_- What did Mr Seshan do? Any stories or articles? Modiji will ensure that these types of officers will never come into power. Yoo LMAO 🤣🤣 He should have contested from his home state of Kerala, the political scene would have been different if he was a minister in the UPA. Do you think men like him don't exist anymore or aren't in service ? It's just govts earlier, despite all the taunts ch#t!ya moi may hurl on them, followed rule book and weren't as besharam as current one. If he was in current era, Seshan would be a faceless diligent officer and never rise to rank of CEC. Remember Ashok Lavasa, he just 'dissented' & then suddenly resigned.. I was one of the few lucky ones to have couple of classes with him at Great Lakes. He used to teach Leadership there for a short while. Please don't take it personally, but I am a teacher so I cannot let that pass: it's either \"for breakfast\", or \"at breakfast time\" :) More words reduce the impact of the dialogue You're right; but I don't quite see how \"for\" instead of \"in\" would lengthen the dialogue. To have an EC like him you need a conducive environment as well where the ruling powers do not have a chokehold on the system and an IT cell promoting and providing misinformation to citizens and a broadcast media which only does what the rulers tell them to do. What sort of teacher thinks “at breakfast time” fits here? That’s just plain wrong. You like to antagonize don't you? I was clearly talking of grammatical correctness. Just replace \"in\" by \"for\" and give me a break already. Grammar ❌ Dialogue Impact ✅ Are you a mass masala movie script writer by any chance? No, just a common movie watcher Before he took charge, most indians didn't know there was something called ECI. Pure Legend. The phrase is “I eat x for breakfast” anything else is non standard Also “at breakfast time” is almost never used. I can’t think of a single sentence with “at breakfast time” in it. So what if one does not have any illegal wealth then what is issue. One thing he should not have any Personnel computer connected to Internet as it can be hacked I really thought to write \"for\" there, and then just wrote \"in\", but hey thanks for correcting :) This country needs organisations which actively hunts politicians across the spectrum. They need to be afraid. But he used \"in\" instead of \"for\", hence my intervention. And the fact that according to you \"at... time\" is almost never used doesn't make it any less correct. You can't just manipulate grammar according to your rethorical taste. Semantic and rethoric are not to be confused, mind you. You're very welcome. As I said, it was not nothing personal, merely a teacher's reflex :) Agreed *for breakfast. This is the second time on an Indian subreddit Ive seen this error. What the fuck is in breakfast. You are eating politicians inside your poha??! [Remembering Seshan: His iron fist led the game-changing electoral reforms in the 90s](https://www.theweek.in/news/india/2019/11/11/remembering-seshan-a-ruthless-enforcer-who-led-the-game-changing-90s-electoral-reforms.html) > Till he took over, political parties ferrying people to the polling stations were considered quite \"normal,\" and **it was during Seshan's stint that it became impossible with the model code being made sacrosanct**. Also, he ensured that bogus voting was averted to a large extent. [‘Through the Broken Glass: An Autobiography’ by TN Seshan: Moves and moods of a ‘reluctant CEC’](https://www.tribuneindia.com/news/reviews/story/through-the-broken-glass-an-autobiography-by-tn-seshan-moves-and-moods-of-a-reluctant-cec-519964) > Seshan’s epic order left India’s political system vulnerable to one man’s whim. The deadlock was, he argued, “solely the making of the government”. Postponement of “all and every election” was a **Seshanesque response to the government’s ploys to render the Election Commission into one of its departments**. Seshan’s mission was to recover its autonomy. On top of it, the entirety of the bureaucracy is filled with rot, it’s unimaginable, the way South Korea is still struggling with systematic demolition of democracy after Park Chung Hee, we will spend the next century dealing with this. Abhi to ec comm. govt ka chusne me lage hai Yeah people use Hitler as the only example of Fascism. But Germany is actually one of the few countries that has managed to fix their institutions after fascism. Spain, Argentina and Italy - reel from the after effects to this day. Bro bjp have changed the rule, first they will put you in jail, then if you have proven innocent after only you will get the bail, just like kejriwal PMLA is all about jailing opposition and keeping them inside until \"proven\" innocent. This country needs civil society organisations that are powerful and media that is independent That approach will only work if those organisations have teeth. Mere memorandums and complaints to the SC will not work. We don’t need characters we need institutions & process, not more of Gandhis and Modis! Probably a direct translation of “me khaata” to in Because they bothered to acknowledge where they went wrong and made it a point to teach it in their school, we otoh like Japan are going neck deep into revisionism, aren’t we? This zed-alpha generation is done for. And citizens Yeah the RIGHT party Yes.. the RIGHT RIGHT one.. not the RIGHT one.. I agree.. BJP's chess rule: When BJP captures a pawn, the pawn is pressed into play for BJP. They've captured almost everything. Also, because Allied nations ruled Germany for a brief period and created the narrative that all Germans are to be blamed for the Nazis. True. They were very effective in that too. Now, when I see a German, the first thought that crosses my mind is Nazism, second - Hitler, third - concentration camps and finally, their cars. Crazy how one man changed the perspective of a country indefinitely. How's South Korea struggling? Is it something to do with the inequality caused by the chaebols? You spelled rhetorical and rhetoric wrong. Just wanted to point that out. are you a English teacher Thank you for the correction, I didn't check my message as I was a little annoyed with that interlocutor. Lol misinfo ka chods But I thought the Supreme Court and the CJI were already in Modi's pocket. At least that's what I believe reading posts here. On other subs though, it's the exact opposite. *an Gobi ji has done damage to the country so much so that its effect is going to stay for decades. They need to lose at least once for balance, else we're heading towards absolute power. The one with democracy, RIGHT? Abhi hota to iske peeche ED CBI lag jaati aur arrest kar liya jaata. Right! Exactly! Not the other type!! We don't want the other type! Nope. The rule you are stating was brought by a SC Judgement on May 2023. Before that it was PM who directly selected Election Commissioners"
}