{
    "id": "13xopsw",
    "title": "Dumbing down of India",
    "url": "https://www.reddit.com/r/india/comments/13xopsw/dumbing_down_of_india/",
    "selftext": "NCERT has \" rationalised \" huge syllabus from class 6th to class 12th. They have dropped some of the most important chapters and topics which are needed to shape your logical thinking and problem solving skills irrespective of what stream you choose. Please look at the syllabus removed from Maths and Science. This is extremely dangerous.\n\nClass 10\n\nhttps://preview.redd.it/3n4ihn1z4g3b1.jpg?width=2050&format=pjpg&auto=webp&v=enabled&s=2c1fe1ab868f1616ef379fe4b21856167ee232cc\n\nhttps://preview.redd.it/x6telb3z4g3b1.jpg?width=2050&format=pjpg&auto=webp&v=enabled&s=9c5715a740353f66fa92ab25be2ae13412223857\n\nhttps://preview.redd.it/uxs21m1z4g3b1.jpg?width=2050&format=pjpg&auto=webp&v=enabled&s=94c30688927728a01efff1ce0037901e53477605\n\nhttps://preview.redd.it/alpl5b3z4g3b1.jpg?width=2050&format=pjpg&auto=webp&v=enabled&s=6f83f59073ed290de861c098d5741db87be852a6\n\nhttps://preview.redd.it/aqbozs1z4g3b1.jpg?width=2050&format=pjpg&auto=webp&v=enabled&s=7adfe0dd2e6bc2eda4cab04b76db91fbdfe1e556\n\nClass 9\n\nhttps://preview.redd.it/23skbue15g3b1.jpg?width=2050&format=pjpg&auto=webp&v=enabled&s=713caa5f94d470cfa0224b35df41d61886eb058b\n\nhttps://preview.redd.it/55fmzye15g3b1.jpg?width=2050&format=pjpg&auto=webp&v=enabled&s=38fe1be7b48f1e0bc9e98ce6f45cee091cedc062\n\nhttps://preview.redd.it/9p4h1ve15g3b1.jpg?width=2050&format=pjpg&auto=webp&v=enabled&s=901f4012f1d358008c6274a2e8b40ae03bc4665c\n\nhttps://preview.redd.it/1nej0we15g3b1.jpg?width=2050&format=pjpg&auto=webp&v=enabled&s=651cfa023f965396190b8f814f6170b7184a5e39\n\nSource: [https://ncert.nic.in/rationalised-content.php](https://ncert.nic.in/rationalised-content.php)\n\n&#x200B;\n\nEdit: \n\nTopics removed In text form\n\n**Class X**\n\n1062 MATHEMATICS \n\n Chapter 1: Real Number 2–7 15–18 1.2 Euclid’s division lemma 1.5 Revisiting rational numbers and their decimal expansions  \n\n Chapter 2: Polynomials 33–37 2.4 Division algorithm for polynomials  \n\n Chapter 3: Pair of Linear Equations in Two Variables 39–46 57–69 3.2 Pair of linear equations in two variables 3.3 Graphical method of solution of a pair of linear equations 3.4.3 Cross-multiplication method 3.5 equation reducible to a pair of linear equations in two variables \n\n Chapter 4: Quadratic Equations 76–88 91–92 4.4 Solution of a quadratic equation by completing the squares  \n\n Chapter 6: Triangles 141–144 144–154 6.5 Areas of similar triangles 6.6 Pythagoras theorem \n\n Chapter 7: Coordinate Geometry 168–172 7.4 Area of a triangle \n\n Chapter 8: Introduction to Trigonometry 187–190 193–194 8.4 Trigonometric ratios of complementary angles  \n\n Chapter 9: Some Applications of Trigonometry 195–196 205 9.1 Introduction \n\n Chapter 11: Construction 216–222 11.1Introduction 11.2 Division of a line segment 11.3 Construction of tangents to a circle 11.4 Summary \n\n Chapter 12: Areas Related to Circles 223 224–226 231–238 12.1 Introduction 12.2 Perimeter and area of a circle — A review 12.4 Areas of combinations of plane figures \n\n Chapter 13: Surface Areas and Volumes 248–252 252–259 13.4 Conversion of solid from one shape to another 13.5 Frustum of a cone \n\n Chapter 14: Statistics 289–294 14.5 Graphical representation of cumulative frequency distribution  \n\n Chapter 15: Probability 295–296 311–312 15.1 Introduction Exercise 15.2 (Optional) \n\n **1064 – Science** \n\n Chapter 5: Periodic Classification of Elements 79–92 Full chapter \n\n Chapter: 9 Heredity and Evolution (Chapter name replaced with: Heredity) 147–158 Box item: Charles Robert Darwin Box item: Origin of life on earth Box item: How do fossils form layer by layer Box item: Molecular phylogeny 9.3 Evolution 9.3.1 An Illustration 9.3.2 Acquired and Inherited Traits 9.4 Speciation 9.5 Evolution and Classification 9.5.1 Tracing Evolutionary Relationships 9.5.2 Fossils 9.5.3 Evolution by Stages 9.6 Evolution Should Not Be Equated With ‘Progress’ 9.6.1 Human Evolution \n\n Chapter: 11 The Human Eye and the Colourful World 188, 189, 196 and 197 Two box items: •\t Damage to or malfunction of any part of the visual system... •\t Why do we have two eyes for vision and not just one? 11.6.3 Colour of the Sun at Sunrise and Sunset \n\n Chapter: 12 Electricity 201 Box item: ‘Flow’ of charges inside a wire \n\n Chapter: 13 Magnetic Effects of Electric Current 232–237 Box item: Michael Faraday 3.4 Electric Motor 3.5 Electromagnetic Induction 3.6 Electric Generator  \n\n Chapter: 14 Sources of Energy 242–255 Full chapter \n\n Chapter: 16 Sustainable Management of Natural Resources 266–280 Full chapter \n\n **1068 — Contemporary India-II**\n\n Chapter 1: Resources and Development 2–3 11–12 Types of Resources, Box information \n\n Chapter 2: Forest and Wildlife Resources 14–18 From second paragraph of ‘Flora and Fauna in India’ to ‘The Himalayan Yew in Trouble’, box information, Figs 2.1 and 2.2 \n\n Chapter 4: Agriculture 43–46 Contribution of agriculture to the national economy, employment and output, Impact of globalisation on agriculture \n\n Chapter 6: Manufacturing Industries 64–66 68–69 71–73 Contribution of industry to national economy, paragraphs from cotton textiles (India exports... fibre industry), Jute textiles (Challenges... products), Sugar industry (Major... baggase), Iron Steel industry (In 2019... consumer of steel; Though... and discuss), Cement industry (Improvement... industry) and Activity (pg. 72), Table 6.1, Figs 6.1, 6.2 and 6.5 \n\n **1072 – Democratic Politics-II**\n\n Chapter 3: Democracy and Diversity 29–38 Full chapter \n\n Chapter 4: Gender, Religion and Caste 46–48 49 Images on page 46, 48 and 49 \n\n Chapter 5: Popular Struggles and Movements 57–70 Full chapter \n\n Chapter 6: Political Parties 76 Full page \n\n Chapter 8: Challenges to Democracy 101–112 Full chapter ",
    "flair": "Policy/Economy",
    "score": 708,
    "num_comments": 229,
    "created_utc": 1685642708.0,
    "convurl": "https://b.thumbs.redditmedia.com/_MigmgM7ncAG7HIOXZZDfyeLpmR3x-WIh9JRUg1qGUY.jpg",
    "comments": [
        "What was removed in maths?",
        "Boy, after the Karnataka whipping they are in a rush eh?",
        "Check whatever is under dropped topic/chapter",
        "No brain drain if no brain\n\n![gif](giphy|d3mlE7uhX8KFgEmY)",
        "I think it’s good, there was so much trigonometry and calculus that you run out of steam before you get to Linear Alzebra",
        "Meanwhile in China: https://youtu.be/XV-fIslPBsc\n\nAlso laughs in Gao kao exams.",
        "&#x200B;\n\n![gif](giphy|2WCFRat6q9etZJfQor)",
        "It's downright disgusting.",
        "No brain, No drain.",
        "Interesting the topics they've removed in Civics",
        "A dumbed down population is so much easier to manipulate and control.The bright ones will pack up and go abroad .",
        "I don’t know. I always felt the mainstream Matha were way harder for us than most of the developed world. They have advanced courses you could take if you were good but not everyone was forced to go through them. \n\nDumping down science is alright too but to take out core subjects like evolution is where you start seeing the evil intent",
        "We only teach mathematics that Indians discovered / created..\n\n\n##0",
        "Exactly. Keep us dumb, how else will they whip the public in a religious frenzy come election time? And sadly they don't have much work to do. Even facts like our supreme leader not having the decency to make one public announcement about the wrestler's protests, never holding unscripted press conferences, openly opposing gay rights don't seem to outright disgust the majority of this country's population.",
        "My neighbours who are bhakts, voted Congress in the Karnataka state election only because of the saffronisation syllabus change in their son's text books. Indian parents are not to be messed with.",
        "When everyone mugs anything anyways I see this as simply less shit to mug",
        "It's really dangerous and people are not realizing it. I was shocked to see that my cousin did not study many important chapters in class 12 because they were chucked out of the syllabus. He's already weak at studying so he struggled to prepare for competitive exams. This move by the GOBARment will result in academic devastation of the coming generations. I hope that we get an educated PM and government soon so that such dumb decisions are taken back and the country's future is safe.",
        "Balls, you can't see other topics ahh?",
        "What saffronisation are you talking about?",
        "Future voter bank secured!\n\nSo even if they lose 2024, they don’t have to worry as 2-3 generations will already have become dumb, compared to their seniors.",
        "The topics that they have removed from civics tells you the whole story.",
        "Humare school me bhi ek aisa teacher tha. Usko jo chapter nahi aata tha wo ye bolkar chod deta tha ki its not important.",
        "We all know that real evolution happened in 2014. That's when we became Independent. Why to study anything else.",
        "They want to transform the entire country into Bihar/ UP",
        "Why even teach at this point?",
        "Only CBSE board has to follow NCERT, right? People will want to enroll their kids in other boards.",
        "Future Indians when dealer sells them a 4000 sq ft junta flat:\n\n![gif](giphy|fRhSHzQ4NXOdrHIZJd)",
        "No democracy. We just had coronation.\n\n/S",
        "Less syllabus, more marks for students = happy parents who would vote for you know who.",
        "It's high time to introduce the 5 basic tatva from which the entire universe is created. \n\nThe periodic table will be replaced by Gaumutra Table \n\n/s",
        "This is for protection of your kids only. Imagine your kid getting lynched because he was debating evolution.",
        "Can’t teach kids about equality and democracy. This shit can get them killed in the new India.",
        "Man I remember those topics from maths and science. How is a student going to go for further studies with all important topics removed",
        "Making things dumber and saffronisation are the same thing.\n\nNOT /s",
        "Why are images being removed?? That too in important topics like gender religion and caste. I remember appreciating how impactful the images in the ncert books were compared to our state textbooks",
        "But how will economic development happen then? I don't understand this twisted logic. CBSE was anyways so far behind other boards, for NCERT to do this is just insanely dangerous. I'm really not able to see the big picture here?",
        "Linear algebra and linear equations in two variables are two vastly different topics in math.\n\nOne lays the foundation for quantum physics, the other is literally basic algebra.\n\nSeems like someone didn’t pay much attention in school. Linear algebra is a college level course for those pursuing STEM.",
        "How can they remove statistics and probability. It is soooo sooo incredibly important for taking decisions in your everyday life. I wish they'd introduce these topics sooner so children can be molded into logical thinking. This is crazyyy.",
        "I am in the field of biology and so can only speak for that. It is embarrassing that they are removing evolution. Having done postgraduate and currently Ph.D. studies in biology, I cannot think of a course where the words \"evolution\" or \"evolutionary\" do not come up.",
        "That's a frightening list of democracy chapters",
        "Knowledge is a redundant process for humans in the age of AI. Subconsciously we all know it and that's why there will be very little resistance to something like this.",
        "Most of the things that has been removed in Class 10 Mathematics like Pythagoras Theorem, Area of Triangle, various things around constructions (dividing a line segment etc.), volumes, real numbers etc. is already taught in lower classes. I remember learning all these things in Class 7 for sure.\n\nI think the only new thing which is introduced in 10th itself is Trigonometry, and in that also the only thing of importance is application of Trigonometry which, I guess is covered in 11th and 12th class where Trigonometry will be repeated.",
        "Now I really wonder if reputed overseas universities will still accept Indian students",
        "There's a reason why India tried out with PISA once and said, Never Again.",
        "Who wants economic development? The politicians just want control and money.",
        "How will THEY get money if WE can't make money because we stupid??",
        "Exactly, they will follow their agenda at all costs",
        "As they have always done.. take tax income to give away contracts with kickbacks. Obviously, in the long term, the amount of tax income itself will reduce, but who's thinking about the long term",
        "Yeah I was talking about trigonometry/calculus in high school and linear algebra in college….. Idk why lotta folks find it unusual to get burnt out in high school with differentiation and integration….",
        "Calculus is taught in 11th and 12th grade for students who take math. Again, it’s an essential tool in mathematics to know if you want to pursue higher studies in most fields of STEM.",
        "Wth have they done to maths. They've removed nearly every important topic by the looks of it",
        "Yall, they removed liek couple concepts here and there and you guys talking like they fkin changed entire syllabus or something, chill out.\n\nPlus, Lotta stuff they removed was useless anyways, completing the squares method? Who tf still uses that?",
        "Bro tbh I don't think anyone taking decisions based on what they learnt from that specific probability chapter lol",
        "The AndhBhakts will call it as Masterstroke because everyone will stay in India for work (If there's any jobs)",
        "The exclusion of evolution is worrying too",
        "Linear algebra is more useful to do anything practical.",
        "Just admit you’ve never studied linear algebra in your life. Linear algebra is used to study 3D Euclidean spaces and matrices and sets of linear equations and their transformations. It is not taught in school.",
        "Yeah yeah the fancy terms… this is how they teach that’s the problem",
        "Mate you’re the one throwing terms around without knowing what they mean. You’re literally confusing linear equations with linear algebra.\n\nThey do teach linear algebra this way, because I’ve actually studied it in college during undergrad. :/\n\nThey don’t teach it in schools because school students have no use for it. Linear algebra is fundamental real analysis.\n\nLinear equations are fundamental, basic algebra. Again, my befuddled young one, they are not the same.\n\nDon’t embarrass yourself in real life by claiming they are.",
        "It gives you a sense of logic. Logic always helps.",
        "Are geometry and linear algebra same?",
        "I would say our syllabus was larger than it should be. So i welcome it",
        "Easy to control if everyone becomes dumb like them..Afterall they don't like people who question.. They want a herd of sheep who follows them.. Lol this is will put India far behind and they will manipulate us either by saying we are doing far better than other countries or say that other countries are \"afraid\" of our growth or this is an \"act of God\"",
        "Linear algebra and linear equation are completely different terms",
        "One doubt.. Can't the next government (highly likely it will be pee jay pee) nullify these efforts?",
        "In future investments will play a major role than now and we need logical thinking if we ever want to build our economy",
        "Nope they won't... As far as I know.. The number of medical colleges recognised by foreign countries has gone down.. In near future it will extend to other fields as well... Like someone said earlier.. No brain drain",
        "The changes to civics is very clear. But the changes for math seem to stump me. They removed very basic topics like Trig, probability etc. Why?",
        "Read the first line of linear algebra on Wikipedia mate 🤦‍♂️",
        "Okay let's use Bayes theorem now to help get more investments into our country👍👍",
        "You do realise that there is more to maths and logistics than that one theorem you mentioned? Do you know about investments??",
        "Besides in future AI will be more prominent than now.. So you need that Bayes theorem...",
        "r/whoooosh\n\nMy friend, you are linking removing a few relatively irrelevant topics from 9th and 10th grades to the reduction of logical thinking of an entire populace. While yes, I do understand this sets a bad precedent for future removal of some important topics(maybe even entire subjects) but let's be honest the probability of something like that happening is pretty low. \n\nAlso I'm still noy sure if you got it so I'm reiterating here, my last comment was actually a sarcastic joke.",
        ">My friend, you are linking removing a few relatively irrelevant topics from 9th and 10th grades to the reduction of logical thinking of an entire populace. While yes, I do understand this sets a bad precedent for future removal of some important topics(maybe even entire subjects) but let's be honest the probability of something like that happening is pretty low. \n\n\nI wouldn't say it will be pretty low.. We are talking about the future thinking brains of the society and We all know how students are.. We have been students ourselves.. How many of us actually understood or tried to understand everything that was taught.. Even when teaching from basic concepts, the interest and the motivation to study isn't high (this is true globally) And now when we remove some important topics which would be building blocks for other high level topics/concepts.. It will be like blindfolding someone and leaving him in a forest.. \nThey should have focused on teaching relevant topics without making us study a hell of an information and not removing important basics that will actually make students live better.. This will only make student hate learning even more.. \n\n\n\n>Also I'm still noy sure if you got it so I'm reiterating here, my last comment was actually a sarcastic joke.\n\nOh sorry I m not good at understanding the tone/nuance a person speaks over the internet., especially on reddit.. My apologises if I sounded rude",
        "Yeah dude, that's why I'm saying it's fine to remove a few non-essential topics from 10th grade, not everyone needs to know the extreme specifics of say the periodic table, saponification or something at that level. \n\nMost people are making it seem like they're removing these topics all together, while all that is happening right now is that they've removed them at the common 10th grade level, which I believe is just fine.\n\nI hope we can reform the education system to more holistically develop and judge a child, though it does seem like a far fetched possibility seeing how the country is headed. Let's hope for the best",
        "Bcoz we will be too stupid to understand that they are looting whatever remains",
        "Probability is a very non-intuitive way of thinking which if ingrained from early years becomes intuitive. Its like saying how common sense is very uncommon. All of us use probability in almost all decisions of our daily lives without actually applying the mathematical calculations to it. However, if we were to know the basic principles, maybe we would be making better decisions. Like if the person who decided to scrap these chapters from our books understood probability, she would know that the chances of this country collapsing on itself are 100%.",
        "Embarrassing really. God forbid if somebody decides to study physics or statistics.",
        "I understand that logical/rational thinking should be ingrained in studies from an early age, but was just contemplating on the overreaction some people were having over removing a few topics from math."
    ],
    "cleaned_text": "dumbing india ncert rationalised huge syllabus class th class th dropped important chapters topics needed shape logical thinking problem solving skills irrespective stream choose please look syllabus removed maths science extremely dangerous class class source httpsncertnicinrationalisedcontentphphttpsncertnicinrationalisedcontentphp xb edit topics removed text form class x mathematics chapter real number euclids division lemma revisiting rational numbers decimal expansions chapter polynomials division algorithm polynomials chapter pair linear equations two variables pair linear equations two variables graphical method solution pair linear equations crossmultiplication method equation reducible pair linear equations two variables chapter quadratic equations solution quadratic equation completing squares chapter triangles areas similar triangles pythagoras theorem chapter coordinate geometry area triangle chapter introduction trigonometry trigonometric ratios complementary angles chapter applications trigonometry introduction chapter construction introduction division line segment construction tangents circle summary chapter areas related circles introduction perimeter area circle review areas combinations plane figures chapter surface areas volumes conversion solid one shape another frustum cone chapter statistics graphical representation cumulative frequency distribution chapter probability introduction exercise optional science chapter periodic classification elements full chapter chapter heredity evolution chapter name replaced heredity box item charles robert darwin box item origin life earth box item fossils form layer layer box item molecular phylogeny evolution illustration acquired inherited traits speciation evolution classification tracing evolutionary relationships fossils evolution stages evolution equated progress human evolution chapter human eye colourful world two box items damage malfunction part visual system two eyes vision one colour sun sunrise sunset chapter electricity box item flow charges inside wire chapter magnetic effects electric current box item michael faraday electric motor electromagnetic induction electric generator chapter sources energy full chapter chapter sustainable management natural resources full chapter contemporary indiaii chapter resources development types resources box information chapter forest wildlife resources second paragraph flora fauna india himalayan yew trouble box information figs chapter agriculture contribution agriculture national economy employment output impact globalisation agriculture chapter manufacturing industries contribution industry national economy paragraphs cotton textiles india exports fibre industry jute textiles challenges products sugar industry major baggase iron steel industry consumer steel though discuss cement industry improvement industry activity pg table figs democratic politicsii chapter democracy diversity full chapter chapter gender religion caste images page chapter popular struggles movements full chapter chapter political parties full page chapter challenges democracy full chapter ",
    "cleaned_title": "dumbing india",
    "cleaned_selftext": "ncert rationalised huge syllabus class th class th dropped important chapters topics needed shape logical thinking problem solving skills irrespective stream choose please look syllabus removed maths science extremely dangerous class class source httpsncertnicinrationalisedcontentphphttpsncertnicinrationalisedcontentphp xb edit topics removed text form class x mathematics chapter real number euclids division lemma revisiting rational numbers decimal expansions chapter polynomials division algorithm polynomials chapter pair linear equations two variables pair linear equations two variables graphical method solution pair linear equations crossmultiplication method equation reducible pair linear equations two variables chapter quadratic equations solution quadratic equation completing squares chapter triangles areas similar triangles pythagoras theorem chapter coordinate geometry area triangle chapter introduction trigonometry trigonometric ratios complementary angles chapter applications trigonometry introduction chapter construction introduction division line segment construction tangents circle summary chapter areas related circles introduction perimeter area circle review areas combinations plane figures chapter surface areas volumes conversion solid one shape another frustum cone chapter statistics graphical representation cumulative frequency distribution chapter probability introduction exercise optional science chapter periodic classification elements full chapter chapter heredity evolution chapter name replaced heredity box item charles robert darwin box item origin life earth box item fossils form layer layer box item molecular phylogeny evolution illustration acquired inherited traits speciation evolution classification tracing evolutionary relationships fossils evolution stages evolution equated progress human evolution chapter human eye colourful world two box items damage malfunction part visual system two eyes vision one colour sun sunrise sunset chapter electricity box item flow charges inside wire chapter magnetic effects electric current box item michael faraday electric motor electromagnetic induction electric generator chapter sources energy full chapter chapter sustainable management natural resources full chapter contemporary indiaii chapter resources development types resources box information chapter forest wildlife resources second paragraph flora fauna india himalayan yew trouble box information figs chapter agriculture contribution agriculture national economy employment output impact globalisation agriculture chapter manufacturing industries contribution industry national economy paragraphs cotton textiles india exports fibre industry jute textiles challenges products sugar industry major baggase iron steel industry consumer steel though discuss cement industry improvement industry activity pg table figs democratic politicsii chapter democracy diversity full chapter chapter gender religion caste images page chapter popular struggles movements full chapter chapter political parties full page chapter challenges democracy full chapter",
    "cleaned_comments": "removed maths boy karnataka whipping rush eh check whatever dropped topicchapter brain drain brain gifgiphydmleuhxkfgemy think good much trigonometry calculus run steam get linear alzebra meanwhile china also laughs gao kao exams xb gifgiphywcfratqetzjfqor downright disgusting brain drain interesting topics theyve removed civics dumbed population much easier manipulate controlthe bright ones pack go abroad dont know always felt mainstream matha way harder us developed world advanced courses could take good everyone forced go dumping science alright take core subjects like evolution start seeing evil intent teach mathematics indians discovered created exactly keep us dumb else whip public religious frenzy come election time sadly dont much work even facts like supreme leader decency make one public announcement wrestlers protests never holding unscripted press conferences openly opposing gay rights dont seem outright disgust majority countrys population neighbours bhakts voted congress karnataka state election saffronisation syllabus change sons text books indian parents messed everyone mugs anything anyways see simply less shit mug really dangerous people realizing shocked see cousin study many important chapters class chucked syllabus hes already weak studying struggled prepare competitive exams move gobarment result academic devastation coming generations hope get educated pm government soon dumb decisions taken back countrys future safe balls cant see topics ahh saffronisation talking future voter bank secured even lose dont worry generations already become dumb compared seniors topics removed civics tells whole story humare school bhi ek aisa teacher tha usko jo chapter nahi aata tha wo ye bolkar chod deta tha ki important know real evolution happened thats became independent study anything else want transform entire country bihar even teach point cbse board follow ncert right people want enroll kids boards future indians dealer sells sq ft junta flat gifgiphyfrhshzqnxodrhizjd democracy coronation less syllabus marks students happy parents would vote know high time introduce basic tatva entire universe created periodic table replaced gaumutra table protection kids imagine kid getting lynched debating evolution cant teach kids equality democracy shit get killed new india man remember topics maths science student going go studies important topics removed making things dumber saffronisation thing images removed important topics like gender religion caste remember appreciating impactful images ncert books compared state textbooks economic development happen dont understand twisted logic cbse anyways far behind boards ncert insanely dangerous im really able see big picture linear algebra linear equations two variables two vastly different topics math one lays foundation quantum physics literally basic algebra seems like someone didnt pay much attention school linear algebra college level course pursuing stem remove statistics probability soooo sooo incredibly important taking decisions everyday life wish theyd introduce topics sooner children molded logical thinking crazyyy field biology speak embarrassing removing evolution done postgraduate currently phd studies biology think course words evolution evolutionary come thats frightening list democracy chapters knowledge redundant process humans age ai subconsciously know thats little resistance something like things removed class mathematics like pythagoras theorem area triangle various things around constructions dividing line segment etc volumes real numbers etc already taught lower classes remember learning things class sure think new thing introduced th trigonometry also thing importance application trigonometry guess covered th th class trigonometry repeated really wonder reputed overseas universities still accept indian students theres reason india tried pisa said never wants economic development politicians want control money get money cant make money stupid exactly follow agenda costs always done take tax income give away contracts kickbacks obviously long term amount tax income reduce whos thinking long term yeah talking trigonometrycalculus high school linear algebra college idk lotta folks find unusual get burnt high school differentiation integration calculus taught th th grade students take math essential tool mathematics know want pursue higher studies fields stem wth done maths theyve removed nearly every important topic looks yall removed liek couple concepts guys talking like fkin changed entire syllabus something chill plus lotta stuff removed useless anyways completing squares method tf still uses bro tbh dont think anyone taking decisions based learnt specific probability chapter lol andhbhakts call masterstroke everyone stay india work theres jobs exclusion evolution worrying linear algebra useful anything practical admit youve never studied linear algebra life linear algebra used study euclidean spaces matrices sets linear equations transformations taught school yeah yeah fancy terms teach thats problem mate youre one throwing terms around without knowing mean youre literally confusing linear equations linear algebra teach linear algebra way ive actually studied college undergrad dont teach schools school students use linear algebra fundamental real analysis linear equations fundamental basic algebra befuddled young one dont embarrass real life claiming gives sense logic logic always helps geometry linear algebra would say syllabus larger welcome easy control everyone becomes dumb like themafterall dont like people question want herd sheep follows lol put india far behind manipulate us either saying far better countries say countries afraid growth act god linear algebra linear equation completely different terms one doubt cant next government highly likely pee jay pee nullify efforts future investments play major role need logical thinking ever want build economy nope wont far know number medical colleges recognised foreign countries gone near future extend fields well like someone said earlier brain drain changes civics clear changes math seem stump removed basic topics like trig probability etc read first line linear algebra wikipedia mate okay lets use bayes theorem help get investments country realise maths logistics one theorem mentioned know investments besides future ai prominent need bayes theorem rwhoooosh friend linking removing relatively irrelevant topics th th grades reduction logical thinking entire populace yes understand sets bad precedent future removal important topicsmaybe even entire subjects lets honest probability something like happening pretty low also im still noy sure got im reiterating last comment actually sarcastic joke friend linking removing relatively irrelevant topics th th grades reduction logical thinking entire populace yes understand sets bad precedent future removal important topicsmaybe even entire subjects lets honest probability something like happening pretty low wouldnt say pretty low talking future thinking brains society know students students many us actually understood tried understand everything taught even teaching basic concepts interest motivation study isnt high true globally remove important topics would building blocks high level topicsconcepts like blindfolding someone leaving forest focused teaching relevant topics without making us study hell information removing important basics actually make students live better make student hate learning even also im still noy sure got im reiterating last comment actually sarcastic joke oh sorry good understanding tonenuance person speaks internet especially reddit apologises sounded rude yeah dude thats im saying fine remove nonessential topics th grade everyone needs know extreme specifics say periodic table saponification something level people making seem like theyre removing topics together happening right theyve removed common th grade level believe fine hope reform education system holistically develop judge child though seem like far fetched possibility seeing country headed lets hope best bcoz stupid understand looting whatever remains probability nonintuitive way thinking ingrained early years becomes intuitive like saying common sense uncommon us use probability almost decisions daily lives without actually applying mathematical calculations however know basic principles maybe would making better decisions like person decided scrap chapters books understood probability would know chances country collapsing embarrassing really god forbid somebody decides study physics statistics understand logicalrational thinking ingrained studies early age contemplating overreaction people removing topics math",
    "light_cleaned_title": "Dumbing down of India",
    "light_cleaned_selftext": "NCERT has \" rationalised \" huge syllabus from class 6th to class 12th. They have dropped some of the most important chapters and topics which are needed to shape your logical thinking and problem solving skills irrespective of what stream you choose. Please look at the syllabus removed from Maths and Science. This is extremely dangerous. Class 10 Class 9 Source: [https://ncert.nic.in/rationalised-content.php](https://ncert.nic.in/rationalised-content.php) &#x200B; Edit: Topics removed In text form **Class X** 1062 MATHEMATICS Chapter 1: Real Number 2–7 15–18 1.2 Euclid’s division lemma 1.5 Revisiting rational numbers and their decimal expansions Chapter 2: Polynomials 33–37 2.4 Division algorithm for polynomials Chapter 3: Pair of Linear Equations in Two Variables 39–46 57–69 3.2 Pair of linear equations in two variables 3.3 Graphical method of solution of a pair of linear equations 3.4.3 Cross-multiplication method 3.5 equation reducible to a pair of linear equations in two variables Chapter 4: Quadratic Equations 76–88 91–92 4.4 Solution of a quadratic equation by completing the squares Chapter 6: Triangles 141–144 144–154 6.5 Areas of similar triangles 6.6 Pythagoras theorem Chapter 7: Coordinate Geometry 168–172 7.4 Area of a triangle Chapter 8: Introduction to Trigonometry 187–190 193–194 8.4 Trigonometric ratios of complementary angles Chapter 9: Some Applications of Trigonometry 195–196 205 9.1 Introduction Chapter 11: Construction 216–222 11.1Introduction 11.2 Division of a line segment 11.3 Construction of tangents to a circle 11.4 Summary Chapter 12: Areas Related to Circles 223 224–226 231–238 12.1 Introduction 12.2 Perimeter and area of a circle — A review 12.4 Areas of combinations of plane figures Chapter 13: Surface Areas and Volumes 248–252 252–259 13.4 Conversion of solid from one shape to another 13.5 Frustum of a cone Chapter 14: Statistics 289–294 14.5 Graphical representation of cumulative frequency distribution Chapter 15: Probability 295–296 311–312 15.1 Introduction Exercise 15.2 (Optional) **1064 – Science** Chapter 5: Periodic Classification of Elements 79–92 Full chapter Chapter: 9 Heredity and Evolution (Chapter name replaced with: Heredity) 147–158 Box item: Charles Robert Darwin Box item: Origin of life on earth Box item: How do fossils form layer by layer Box item: Molecular phylogeny 9.3 Evolution 9.3.1 An Illustration 9.3.2 Acquired and Inherited Traits 9.4 Speciation 9.5 Evolution and Classification 9.5.1 Tracing Evolutionary Relationships 9.5.2 Fossils 9.5.3 Evolution by Stages 9.6 Evolution Should Not Be Equated With ‘Progress’ 9.6.1 Human Evolution Chapter: 11 The Human Eye and the Colourful World 188, 189, 196 and 197 Two box items: • Damage to or malfunction of any part of the visual system... • Why do we have two eyes for vision and not just one? 11.6.3 Colour of the Sun at Sunrise and Sunset Chapter: 12 Electricity 201 Box item: ‘Flow’ of charges inside a wire Chapter: 13 Magnetic Effects of Electric Current 232–237 Box item: Michael Faraday 3.4 Electric Motor 3.5 Electromagnetic Induction 3.6 Electric Generator Chapter: 14 Sources of Energy 242–255 Full chapter Chapter: 16 Sustainable Management of Natural Resources 266–280 Full chapter **1068 — Contemporary India-II** Chapter 1: Resources and Development 2–3 11–12 Types of Resources, Box information Chapter 2: Forest and Wildlife Resources 14–18 From second paragraph of ‘Flora and Fauna in India’ to ‘The Himalayan Yew in Trouble’, box information, Figs 2.1 and 2.2 Chapter 4: Agriculture 43–46 Contribution of agriculture to the national economy, employment and output, Impact of globalisation on agriculture Chapter 6: Manufacturing Industries 64–66 68–69 71–73 Contribution of industry to national economy, paragraphs from cotton textiles (India exports... fibre industry), Jute textiles (Challenges... products), Sugar industry (Major... baggase), Iron Steel industry (In 2019... consumer of steel; Though... and discuss), Cement industry (Improvement... industry) and Activity (pg. 72), Table 6.1, Figs 6.1, 6.2 and 6.5 **1072 – Democratic Politics-II** Chapter 3: Democracy and Diversity 29–38 Full chapter Chapter 4: Gender, Religion and Caste 46–48 49 Images on page 46, 48 and 49 Chapter 5: Popular Struggles and Movements 57–70 Full chapter Chapter 6: Political Parties 76 Full page Chapter 8: Challenges to Democracy 101–112 Full chapter",
    "light_cleaned_comments": "What was removed in maths? Boy, after the Karnataka whipping they are in a rush eh? Check whatever is under dropped topic/chapter No brain drain if no brain ![gif](giphy|d3mlE7uhX8KFgEmY) I think it’s good, there was so much trigonometry and calculus that you run out of steam before you get to Linear Alzebra Meanwhile in China: Also laughs in Gao kao exams. &#x200B; ![gif](giphy|2WCFRat6q9etZJfQor) It's downright disgusting. No brain, No drain. Interesting the topics they've removed in Civics A dumbed down population is so much easier to manipulate and control.The bright ones will pack up and go abroad . I don’t know. I always felt the mainstream Matha were way harder for us than most of the developed world. They have advanced courses you could take if you were good but not everyone was forced to go through them. Dumping down science is alright too but to take out core subjects like evolution is where you start seeing the evil intent We only teach mathematics that Indians discovered / created.. ##0 Exactly. Keep us dumb, how else will they whip the public in a religious frenzy come election time? And sadly they don't have much work to do. Even facts like our supreme leader not having the decency to make one public announcement about the wrestler's protests, never holding unscripted press conferences, openly opposing gay rights don't seem to outright disgust the majority of this country's population. My neighbours who are bhakts, voted Congress in the Karnataka state election only because of the saffronisation syllabus change in their son's text books. Indian parents are not to be messed with. When everyone mugs anything anyways I see this as simply less shit to mug It's really dangerous and people are not realizing it. I was shocked to see that my cousin did not study many important chapters in class 12 because they were chucked out of the syllabus. He's already weak at studying so he struggled to prepare for competitive exams. This move by the GOBARment will result in academic devastation of the coming generations. I hope that we get an educated PM and government soon so that such dumb decisions are taken back and the country's future is safe. Balls, you can't see other topics ahh? What saffronisation are you talking about? Future voter bank secured! So even if they lose 2024, they don’t have to worry as 2-3 generations will already have become dumb, compared to their seniors. The topics that they have removed from civics tells you the whole story. Humare school me bhi ek aisa teacher tha. Usko jo chapter nahi aata tha wo ye bolkar chod deta tha ki its not important. We all know that real evolution happened in 2014. That's when we became Independent. Why to study anything else. They want to transform the entire country into Bihar/ UP Why even teach at this point? Only CBSE board has to follow NCERT, right? People will want to enroll their kids in other boards. Future Indians when dealer sells them a 4000 sq ft junta flat: ![gif](giphy|fRhSHzQ4NXOdrHIZJd) No democracy. We just had coronation. /S Less syllabus, more marks for students = happy parents who would vote for you know who. It's high time to introduce the 5 basic tatva from which the entire universe is created. The periodic table will be replaced by Gaumutra Table /s This is for protection of your kids only. Imagine your kid getting lynched because he was debating evolution. Can’t teach kids about equality and democracy. This shit can get them killed in the new India. Man I remember those topics from maths and science. How is a student going to go for further studies with all important topics removed Making things dumber and saffronisation are the same thing. NOT /s Why are images being removed?? That too in important topics like gender religion and caste. I remember appreciating how impactful the images in the ncert books were compared to our state textbooks But how will economic development happen then? I don't understand this twisted logic. CBSE was anyways so far behind other boards, for NCERT to do this is just insanely dangerous. I'm really not able to see the big picture here? Linear algebra and linear equations in two variables are two vastly different topics in math. One lays the foundation for quantum physics, the other is literally basic algebra. Seems like someone didn’t pay much attention in school. Linear algebra is a college level course for those pursuing STEM. How can they remove statistics and probability. It is soooo sooo incredibly important for taking decisions in your everyday life. I wish they'd introduce these topics sooner so children can be molded into logical thinking. This is crazyyy. I am in the field of biology and so can only speak for that. It is embarrassing that they are removing evolution. Having done postgraduate and currently Ph.D. studies in biology, I cannot think of a course where the words \"evolution\" or \"evolutionary\" do not come up. That's a frightening list of democracy chapters Knowledge is a redundant process for humans in the age of AI. Subconsciously we all know it and that's why there will be very little resistance to something like this. Most of the things that has been removed in Class 10 Mathematics like Pythagoras Theorem, Area of Triangle, various things around constructions (dividing a line segment etc.), volumes, real numbers etc. is already taught in lower classes. I remember learning all these things in Class 7 for sure. I think the only new thing which is introduced in 10th itself is Trigonometry, and in that also the only thing of importance is application of Trigonometry which, I guess is covered in 11th and 12th class where Trigonometry will be repeated. Now I really wonder if reputed overseas universities will still accept Indian students There's a reason why India tried out with PISA once and said, Never Again. Who wants economic development? The politicians just want control and money. How will THEY get money if WE can't make money because we stupid?? Exactly, they will follow their agenda at all costs As they have always done.. take tax income to give away contracts with kickbacks. Obviously, in the long term, the amount of tax income itself will reduce, but who's thinking about the long term Yeah I was talking about trigonometry/calculus in high school and linear algebra in college….. Idk why lotta folks find it unusual to get burnt out in high school with differentiation and integration…. Calculus is taught in 11th and 12th grade for students who take math. Again, it’s an essential tool in mathematics to know if you want to pursue higher studies in most fields of STEM. Wth have they done to maths. They've removed nearly every important topic by the looks of it Yall, they removed liek couple concepts here and there and you guys talking like they fkin changed entire syllabus or something, chill out. Plus, Lotta stuff they removed was useless anyways, completing the squares method? Who tf still uses that? Bro tbh I don't think anyone taking decisions based on what they learnt from that specific probability chapter lol The AndhBhakts will call it as Masterstroke because everyone will stay in India for work (If there's any jobs) The exclusion of evolution is worrying too Linear algebra is more useful to do anything practical. Just admit you’ve never studied linear algebra in your life. Linear algebra is used to study 3D Euclidean spaces and matrices and sets of linear equations and their transformations. It is not taught in school. Yeah yeah the fancy terms… this is how they teach that’s the problem Mate you’re the one throwing terms around without knowing what they mean. You’re literally confusing linear equations with linear algebra. They do teach linear algebra this way, because I’ve actually studied it in college during undergrad. :/ They don’t teach it in schools because school students have no use for it. Linear algebra is fundamental real analysis. Linear equations are fundamental, basic algebra. Again, my befuddled young one, they are not the same. Don’t embarrass yourself in real life by claiming they are. It gives you a sense of logic. Logic always helps. Are geometry and linear algebra same? I would say our syllabus was larger than it should be. So i welcome it Easy to control if everyone becomes dumb like them..Afterall they don't like people who question.. They want a herd of sheep who follows them.. Lol this is will put India far behind and they will manipulate us either by saying we are doing far better than other countries or say that other countries are \"afraid\" of our growth or this is an \"act of God\" Linear algebra and linear equation are completely different terms One doubt.. Can't the next government (highly likely it will be pee jay pee) nullify these efforts? In future investments will play a major role than now and we need logical thinking if we ever want to build our economy Nope they won't... As far as I know.. The number of medical colleges recognised by foreign countries has gone down.. In near future it will extend to other fields as well... Like someone said earlier.. No brain drain The changes to civics is very clear. But the changes for math seem to stump me. They removed very basic topics like Trig, probability etc. Why? Read the first line of linear algebra on Wikipedia mate 🤦‍♂️ Okay let's use Bayes theorem now to help get more investments into our country👍👍 You do realise that there is more to maths and logistics than that one theorem you mentioned? Do you know about investments?? Besides in future AI will be more prominent than now.. So you need that Bayes theorem... r/whoooosh My friend, you are linking removing a few relatively irrelevant topics from 9th and 10th grades to the reduction of logical thinking of an entire populace. While yes, I do understand this sets a bad precedent for future removal of some important topics(maybe even entire subjects) but let's be honest the probability of something like that happening is pretty low. Also I'm still noy sure if you got it so I'm reiterating here, my last comment was actually a sarcastic joke. >My friend, you are linking removing a few relatively irrelevant topics from 9th and 10th grades to the reduction of logical thinking of an entire populace. While yes, I do understand this sets a bad precedent for future removal of some important topics(maybe even entire subjects) but let's be honest the probability of something like that happening is pretty low. I wouldn't say it will be pretty low.. We are talking about the future thinking brains of the society and We all know how students are.. We have been students ourselves.. How many of us actually understood or tried to understand everything that was taught.. Even when teaching from basic concepts, the interest and the motivation to study isn't high (this is true globally) And now when we remove some important topics which would be building blocks for other high level topics/concepts.. It will be like blindfolding someone and leaving him in a forest.. They should have focused on teaching relevant topics without making us study a hell of an information and not removing important basics that will actually make students live better.. This will only make student hate learning even more.. >Also I'm still noy sure if you got it so I'm reiterating here, my last comment was actually a sarcastic joke. Oh sorry I m not good at understanding the tone/nuance a person speaks over the internet., especially on reddit.. My apologises if I sounded rude Yeah dude, that's why I'm saying it's fine to remove a few non-essential topics from 10th grade, not everyone needs to know the extreme specifics of say the periodic table, saponification or something at that level. Most people are making it seem like they're removing these topics all together, while all that is happening right now is that they've removed them at the common 10th grade level, which I believe is just fine. I hope we can reform the education system to more holistically develop and judge a child, though it does seem like a far fetched possibility seeing how the country is headed. Let's hope for the best Bcoz we will be too stupid to understand that they are looting whatever remains Probability is a very non-intuitive way of thinking which if ingrained from early years becomes intuitive. Its like saying how common sense is very uncommon. All of us use probability in almost all decisions of our daily lives without actually applying the mathematical calculations to it. However, if we were to know the basic principles, maybe we would be making better decisions. Like if the person who decided to scrap these chapters from our books understood probability, she would know that the chances of this country collapsing on itself are 100%. Embarrassing really. God forbid if somebody decides to study physics or statistics. I understand that logical/rational thinking should be ingrained in studies from an early age, but was just contemplating on the overreaction some people were having over removing a few topics from math."
}