{
    "id": "154hc6m",
    "title": "Emergency alert?",
    "url": "https://i.redd.it/v2em5hu3x1db1.jpg",
    "selftext": "I just received this notification, it's been popping up on whatever app I open. When I click \"ok\" it asks if I wish to continue to receive such notifications. I looked up this alert on Google but I couldn't find any sources. Must be a scam. Has anyone else received the same?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689828969.0,
    "convurl": "https://i.redd.it/v2em5hu3x1db1.jpg",
    "comments": [
        "Me!! I just received it and made a post here too 😅\n\nSame stuff, I am confused too",
        "It’s just a test alert dude. Ignore it.",
        "I received it too! But no other phones in my house recieved it.",
        "I didn't but saw three screenshots",
        "https://indianexpress.com/article/cities/mumbai/emergency-agencie-alert-mode-maharashtra-cm-eknath-shinde-incessant-rain-8848901/\n\nIt's probably for rain alert. I live in Pune btw.",
        " \n\nNo,  this is very common in countries like Japan, US, etc where govt send  emergency alert in case of any emergency like for ex earthquake. They  were just testing if their system is working or not, this is also a  common practice in the countries I mentioned above.\n\nFun Fact-In Japan, TV opens up itself and start the emergency alert like in case of earthquake or missile alert from NK.",
        "Oh ok. Cool. Let's hope I don't have to see it again.",
        "Yeah\n\nIn Japan these alerts were so common as earthquake keeps happening. We were taught a few things if there's an alert, leave the building immediately and assist old people in getting out.",
        "Ohh, alright, thanks for the info!",
        "Test alert hai . Chillax",
        "It is a Test alert, As they are just checking if they have installed the bug in all devices or not. Nothing to worry just a Standard Procedure :)",
        "Happened same with me",
        "Depends on Android version too, only latest Androids support the Emergency Alert system.",
        "Spam from the government. Could have given a notification indicating this test, but clearly lost in the bureaucratic maze."
    ],
    "cleaned_text": "emergency alert received notification popping whatever app open click ok asks wish continue receive notifications looked alert google couldnt find sources must scam anyone else received ",
    "cleaned_title": "emergency alert",
    "cleaned_selftext": "received notification popping whatever app open click ok asks wish continue receive notifications looked alert google couldnt find sources must scam anyone else received",
    "cleaned_comments": "received made post stuff confused test alert dude ignore received phones house recieved didnt saw three screenshots probably rain alert live pune btw common countries like japan us etc govt send emergency alert case emergency like ex earthquake testing system working also common practice countries mentioned fun factin japan tv opens start emergency alert like case earthquake missile alert nk oh ok cool lets hope dont see yeah japan alerts common earthquake keeps happening taught things theres alert leave building immediately assist old people getting ohh alright thanks info test alert hai chillax test alert checking installed bug devices nothing worry standard procedure happened depends android version latest androids support emergency alert system spam government could given notification indicating test clearly lost bureaucratic maze",
    "light_cleaned_title": "Emergency alert?",
    "light_cleaned_selftext": "I just received this notification, it's been popping up on whatever app I open. When I click \"ok\" it asks if I wish to continue to receive such notifications. I looked up this alert on Google but I couldn't find any sources. Must be a scam. Has anyone else received the same?",
    "light_cleaned_comments": "Me!! I just received it and made a post here too 😅 Same stuff, I am confused too It’s just a test alert dude. Ignore it. I received it too! But no other phones in my house recieved it. I didn't but saw three screenshots It's probably for rain alert. I live in Pune btw. No, this is very common in countries like Japan, US, etc where govt send emergency alert in case of any emergency like for ex earthquake. They were just testing if their system is working or not, this is also a common practice in the countries I mentioned above. Fun Fact-In Japan, TV opens up itself and start the emergency alert like in case of earthquake or missile alert from NK. Oh ok. Cool. Let's hope I don't have to see it again. Yeah In Japan these alerts were so common as earthquake keeps happening. We were taught a few things if there's an alert, leave the building immediately and assist old people in getting out. Ohh, alright, thanks for the info! Test alert hai . Chillax It is a Test alert, As they are just checking if they have installed the bug in all devices or not. Nothing to worry just a Standard Procedure :) Happened same with me Depends on Android version too, only latest Androids support the Emergency Alert system. Spam from the government. Could have given a notification indicating this test, but clearly lost in the bureaucratic maze."
}