{
    "id": "186sh0r",
    "title": "this new law can shut down youtube journalists",
    "url": "https://youtu.be/xcrbfkv--io?si=kdJGabwNeqocRLGk",
    "selftext": "Hmm... It's like looking at a tsunami coming at you and you are just like.. I will run when it gets closer..\nBTW this youtube chanel is of Meghnad. Can confirm he has good knowledge and not some random guy who speaks jibberish.",
    "flair": "Politics",
    "score": 99,
    "num_comments": 26,
    "created_utc": 1701272800.0,
    "convurl": "https://external-preview.redd.it/xocpdLwdad82OGWbz78pJrYttqksqmFO2XV232BzQtE.jpg?auto=webp&s=ee78ec9c034aebbb7b02abdfe3013b16df772e03",
    "comments": [
        "this is scary but bhakts don't care.\n\n\nG20 ORGANIZEEE KARAAAAA....MODIIIIIIIIII",
        "Wth man, we are becoming china but not in good way",
        "Since, youtubers like Dhruv are based outside of India, does that mean there will be restrictions on international content’s availability on YouTube as well?",
        "Nice, didnt know Meghnad had a channel!",
        "This really shows how insecure is BJP in upcoming elections",
        "I think people in India still might not be able to view the content",
        "Is it absolutely necessary to use clickbait titles on Reddit as well?",
        "Just watched Meghnad's take down. He is spot on.\n\nOn a related note, can someone help me get out of this country. I have a master's, gainfully employed, financially solvent, work in tech. Any tips or guidance on getting out of this hell hole on a work or investment visa is appreciated.\n\nOn a related note on the flip side, I low key look forward to implementation of such draconian laws. If it downgrades India's democratic rating as \"not free,\" I can use this opportunity to file for asylum in white nations.",
        "We still have supreme courts in our country, they tackled Indira Gandhi and she had to implement rules in Parliament amd If modi again going to do some harm to democracy, I believe in judiciary, and to save dead pillar of media and journalism....media houses are under cancer now youtube too🤦🏻‍♂️🤦🏻‍♂️",
        "The left loves censorship",
        "How is this bill not breaking freedom of speech provided in constitution?",
        "Atta at ₹15,000/kg but will still vote for Modi.",
        "i think it is just to shutdown ravish",
        "I don't have any advice, as I am still a student. But I recall there was a wiki/megathread on the sub about getting a job moving to foreign countries",
        "If this comes to force I guess we will have to rely on that idiot BeerBiceps for 'news'. It's already staggering how many ministers, politicians and celebrities are on that show.\n\nAnd how the media then reports on the content. You see a headline like 'Jaishankar said...' and think maybe it's a press conference or media interview but no. It's a on a platform where tantrics and ghostbusters are interviewed with the same seriousness.",
        "At least China is atheist.",
        "We have the worst of both worlds - Censorship of China and Economic development of Africa!",
        "It's part of official policy.",
        "Content availability is always based on regional laws. So yes, they will probably be forced to make some content unavailable for India if the govt. asks them. There is some hope with VPN until they come up with some new telecommunication bill as well.",
        "**Rumble,Odysee** alternatives hai na",
        "I use Youtube for accessing video streams international conferences and lectures. Applying geo location driven restrictions would be like imposing the equivalent of the Chinese firewall would be terrible for anybody who relies on Youtube as a learning source."
    ],
    "cleaned_text": "new law shut youtube journalists hmm like looking tsunami coming like run gets closer btw youtube chanel meghnad confirm good knowledge random guy speaks jibberish ",
    "cleaned_title": "new law shut youtube journalists",
    "cleaned_selftext": "hmm like looking tsunami coming like run gets closer btw youtube chanel meghnad confirm good knowledge random guy speaks jibberish",
    "cleaned_comments": "scary bhakts dont care g organizeee karaaaaamodiiiiiiiiii wth man becoming china good way since youtubers like dhruv based outside india mean restrictions international contents availability youtube well nice didnt know meghnad channel really shows insecure bjp upcoming elections think people india still might able view content absolutely necessary use clickbait titles reddit well watched meghnads take spot related note someone help get country masters gainfully employed financially solvent work tech tips guidance getting hell hole work investment visa appreciated related note flip side low key look forward implementation draconian laws downgrades indias democratic rating free use opportunity file asylum white nations still supreme courts country tackled indira gandhi implement rules parliament amd modi going harm democracy believe judiciary save dead pillar media journalismmedia houses cancer youtube left loves censorship bill breaking freedom speech provided constitution atta kg still vote modi think shutdown ravish dont advice still student recall wikimegathread sub getting job moving foreign countries comes force guess rely idiot beerbiceps news already staggering many ministers politicians celebrities show media reports content see headline like jaishankar said think maybe press conference media interview platform tantrics ghostbusters interviewed seriousness least china atheist worst worlds censorship china economic development africa part official policy content availability always based regional laws yes probably forced make content unavailable india govt asks hope vpn come new telecommunication bill well rumbleodysee alternatives hai na use youtube accessing video streams international conferences lectures applying geo location driven restrictions would like imposing equivalent chinese firewall would terrible anybody relies youtube learning source",
    "light_cleaned_title": "this new law can shut down youtube journalists",
    "light_cleaned_selftext": "Hmm... It's like looking at a tsunami coming at you and you are just like.. I will run when it gets closer.. BTW this youtube chanel is of Meghnad. Can confirm he has good knowledge and not some random guy who speaks jibberish.",
    "light_cleaned_comments": "this is scary but bhakts don't care. G20 ORGANIZEEE KARAAAAA....MODIIIIIIIIII Wth man, we are becoming china but not in good way Since, youtubers like Dhruv are based outside of India, does that mean there will be restrictions on international content’s availability on YouTube as well? Nice, didnt know Meghnad had a channel! This really shows how insecure is BJP in upcoming elections I think people in India still might not be able to view the content Is it absolutely necessary to use clickbait titles on Reddit as well? Just watched Meghnad's take down. He is spot on. On a related note, can someone help me get out of this country. I have a master's, gainfully employed, financially solvent, work in tech. Any tips or guidance on getting out of this hell hole on a work or investment visa is appreciated. On a related note on the flip side, I low key look forward to implementation of such draconian laws. If it downgrades India's democratic rating as \"not free,\" I can use this opportunity to file for asylum in white nations. We still have supreme courts in our country, they tackled Indira Gandhi and she had to implement rules in Parliament amd If modi again going to do some harm to democracy, I believe in judiciary, and to save dead pillar of media and journalism....media houses are under cancer now youtube too🤦🏻‍♂️🤦🏻‍♂️ The left loves censorship How is this bill not breaking freedom of speech provided in constitution? Atta at ₹15,000/kg but will still vote for Modi. i think it is just to shutdown ravish I don't have any advice, as I am still a student. But I recall there was a wiki/megathread on the sub about getting a job moving to foreign countries If this comes to force I guess we will have to rely on that idiot BeerBiceps for 'news'. It's already staggering how many ministers, politicians and celebrities are on that show. And how the media then reports on the content. You see a headline like 'Jaishankar said...' and think maybe it's a press conference or media interview but no. It's a on a platform where tantrics and ghostbusters are interviewed with the same seriousness. At least China is atheist. We have the worst of both worlds - Censorship of China and Economic development of Africa! It's part of official policy. Content availability is always based on regional laws. So yes, they will probably be forced to make some content unavailable for India if the govt. asks them. There is some hope with VPN until they come up with some new telecommunication bill as well. **Rumble,Odysee** alternatives hai na I use Youtube for accessing video streams international conferences and lectures. Applying geo location driven restrictions would be like imposing the equivalent of the Chinese firewall would be terrible for anybody who relies on Youtube as a learning source."
}