{
    "id": "1egrjh7",
    "title": "A Student in IIIT Agartala Died. Due to Negligence of Medicat Staff At NIT Agartala",
    "url": "https://www.reddit.com/r/india/comments/1egrjh7/a_student_in_iiit_agartala_died_due_to_negligence/",
    "selftext": "\\*\\*Dear Everyone,\\*\\*\n\nWe are deeply saddened and outraged by the tragic loss of our friend, Abhijeet Panda, a student of IIIT Agartala, who passed away after severe negligence at NIT Agartala hospital. This is not just a loss; it is a serious failure of duty.\n\nHere are the facts:\n\n* \\*\\*Ambulance Denied\\*\\*: Despite Abhijeet experiencing excruciating pain, an ambulance was not provided. Friends had to transport him in an auto-rickshaw, while Deans falsely claimed the ambulance service was available 24/7 but was “unavailable” when needed.\n* \\*\\*Minimal Medical Care\\*\\*: At the NIT Agartala hospital, doctors offered minimal care, using expired Volini spray and dismissing his severe pain with a recommendation to drink ORS, despite his distress.\n* \\*\\*Neglect and Cover-Up\\*\\*: Following his death, there are attempts to cover up the negligence, with claims of a pre-existing condition that friends and roommates deny. There are also attempts to coerce false statements.\n* \\*\\*Inadequate Treatment\\*\\*: The student’s hemoglobin level was critically low (6.8, compared to the normal range of 14-16), but no proper attention or treatment was provided.\n* \\*\\*Request for Action\\*\\*: We request everyone to join us at Knowledge Park on urgent notice to address these serious issues.\n\nLet’s come together to demand justice and accountability.\n\nhttps://preview.redd.it/mbept419svfd1.png?width=508&format=png&auto=webp&s=8155402c26aac9f1160e8d713e165e6131c9c5b1\n\nhttps://preview.redd.it/dsk44519svfd1.png?width=276&format=png&auto=webp&s=1a6d8500f1c809434828da6c079c6565a9399507\n\n",
    "flair": "Crime",
    "score": 52,
    "num_comments": 4,
    "created_utc": 1722443315.0,
    "convurl": "https://b.thumbs.redditmedia.com/ubAHr9HG1GhpgxiAruDe3YUyojOUbbFjwJ8a0jvZyko.jpg",
    "comments": [
        "That level of Hb indicates starvation, severe malnutrition or some pre existing condition for sure. But other than that this is serious negligence if proper medical care was not provided on time."
    ],
    "cleaned_text": "student iiit agartala died due negligence medicat staff nit agartala dear everyone deeply saddened outraged tragic loss friend abhijeet panda student iiit agartala passed away severe negligence nit agartala hospital loss serious failure duty facts ambulance denied despite abhijeet experiencing excruciating pain ambulance provided friends transport autorickshaw deans falsely claimed ambulance service available unavailable needed minimal medical care nit agartala hospital doctors offered minimal care using expired volini spray dismissing severe pain recommendation drink ors despite distress neglect coverup following death attempts cover negligence claims preexisting condition friends roommates deny also attempts coerce false statements inadequate treatment students hemoglobin level critically low compared normal range proper attention treatment provided request action request everyone join us knowledge park urgent notice address serious issues lets come together demand justice accountability ",
    "cleaned_title": "student iiit agartala died due negligence medicat staff nit agartala",
    "cleaned_selftext": "dear everyone deeply saddened outraged tragic loss friend abhijeet panda student iiit agartala passed away severe negligence nit agartala hospital loss serious failure duty facts ambulance denied despite abhijeet experiencing excruciating pain ambulance provided friends transport autorickshaw deans falsely claimed ambulance service available unavailable needed minimal medical care nit agartala hospital doctors offered minimal care using expired volini spray dismissing severe pain recommendation drink ors despite distress neglect coverup following death attempts cover negligence claims preexisting condition friends roommates deny also attempts coerce false statements inadequate treatment students hemoglobin level critically low compared normal range proper attention treatment provided request action request everyone join us knowledge park urgent notice address serious issues lets come together demand justice accountability",
    "cleaned_comments": "level hb indicates starvation severe malnutrition pre existing condition sure serious negligence proper medical care provided time",
    "light_cleaned_title": "A Student in IIIT Agartala Died. Due to Negligence of Medicat Staff At NIT Agartala",
    "light_cleaned_selftext": "\\*\\*Dear Everyone,\\*\\* We are deeply saddened and outraged by the tragic loss of our friend, Abhijeet Panda, a student of IIIT Agartala, who passed away after severe negligence at NIT Agartala hospital. This is not just a loss; it is a serious failure of duty. Here are the facts: * \\*\\*Ambulance Denied\\*\\*: Despite Abhijeet experiencing excruciating pain, an ambulance was not provided. Friends had to transport him in an auto-rickshaw, while Deans falsely claimed the ambulance service was available 24/7 but was “unavailable” when needed. * \\*\\*Minimal Medical Care\\*\\*: At the NIT Agartala hospital, doctors offered minimal care, using expired Volini spray and dismissing his severe pain with a recommendation to drink ORS, despite his distress. * \\*\\*Neglect and Cover-Up\\*\\*: Following his death, there are attempts to cover up the negligence, with claims of a pre-existing condition that friends and roommates deny. There are also attempts to coerce false statements. * \\*\\*Inadequate Treatment\\*\\*: The student’s hemoglobin level was critically low (6.8, compared to the normal range of 14-16), but no proper attention or treatment was provided. * \\*\\*Request for Action\\*\\*: We request everyone to join us at Knowledge Park on urgent notice to address these serious issues. Let’s come together to demand justice and accountability.",
    "light_cleaned_comments": "That level of Hb indicates starvation, severe malnutrition or some pre existing condition for sure. But other than that this is serious negligence if proper medical care was not provided on time."
}