{
    "id": "14xcyxi",
    "title": "Smart City washed away in a single rain (English translation of the Hindi Title)",
    "url": "https://youtu.be/92QXacoxAqc",
    "selftext": "एक ही बारिश में \"स्मार्ट सिटी\" की धुलाई | \"Smart city\" claims fall flat",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 28,
    "created_utc": 1689133405.0,
    "convurl": "https://external-preview.redd.it/dJ53Cyo77VVpOuGTqD7vaRUPWyBXBXMGPbDHvLx-ysQ.jpg?auto=webp&s=005ac93d8c11b4337df858eeab5f25181f68b8af",
    "comments": [
        "Ravish has raised all valid points. How many people will protest the administration’s performance using our tax? The same people come out to protest religion related issues, lynch minorities, mistreat based on castes, but will not hold the government accountable.\n\nWhat’s happening in Himachal is climate related AND equally related to the unparalleled and unstructured construction in the name of development. Go anywhere there’s a dam ona river and downstream there are mafia openly stealing sand and rocks from the riverbed. Rains levels may be high but it is the robbing of our environment that protects us is what is increasing the impact on all of us.\n\nGovernment will just blame on the “act of god”",
        "I have a problem with all these unkils first they voted for congress and never asked questions Now they want us to vote for bjp and don't ask question desh barbad kar diya hai unkilo ne.",
        "Which city?",
        "It's not just unkils. It is scary to see how many of the younger generation think similarly.",
        "I will not lie when I was young bcoz of riots and misinformation I used to hate Muslim. Later in life I made some good muslim friends and realised such an idiot I was blaming the whole community for one person's crime. Young minds are getting corrupted bcoz of this unkils and media misinformation. I was corrupted by uneducated PPL and I use think they are wise.",
        "Have you seen the dankmemer crowd? They talk like uneducated idiots and make some low class hate content towards Muslims etc. Most of them can't frame a single coherent sentence in any language.",
        "I agree I hate to see India's bright minds and talent PPL getting brainwashed",
        "I was watching Aaj Tak with my father during breakfast. The headline on the screen was \"Paryatan ke naam oar Khilwad\". I was genuinely perplexed as to what do they mean by that? Are they criticizing the government? Coz it's been 1 year since the election. Aren't they criticizing the previous governments too?",
        "What do you mean no one asked? Both during UPA1 and UPA 2 the media was free and was keeping the then government on their toes, if you are saying no one back then asked questions, you are essentially saying...you didn't pay attention (or was too young)",
        "Hence they created good infrastructure and fixed all the basic govt schools and govt hospitals. Basic necessities no one asked no one questioned we never got .",
        "To save your fav political party PPL of India are runing this beautiful country",
        "They are blaming the citizens. They're saying it's tourists and tour operators who are to blame. \n\nThis is what India is in 2023. Whenever something good happens - it's because of Modiji Vishwaguru. But if something bad happens it's because the people are lazy,corrupt and generally dispensable. \n\nWhen they say Godi media - that's what it means. The media is not working for the BJP against Congress and AAP. They're working against the people.",
        "You don't really need smart city or much sensors. Just, proper drainage system, but that doesn't get you votes or projects to get money out of the system.",
        "Well at congress regime Media had balls and freedom to ask questions from government and criticize government but now with bjp regime Whole media have became pet dogs for government. \n\nSomething happens and media be like Congress, nehru, rahul, pakistan, foreign countries, and even blame on people but never blame on government and modi but yeah if India wins or achieves something then modi will be first in line to receive credits",
        "I agree that the media was independent in the  Congress governance  The media is a shame now. I remember laughing at Pakistani news channel and sudershan news.",
        "This. The kind of hate that can be hidden in content thats supposed to be funny honestly scared me. And a disturbingly large number of the people who share them are literal school kids. Yikes. So much for the next generation.",
        "Woh bhi unkil hi hue na fir toh",
        "why Hindi is full of hai, hai, hai"
    ],
    "cleaned_text": "smart city washed away single rain english translation hindi title smart city claims fall flat ",
    "cleaned_title": "smart city washed away single rain english translation hindi title",
    "cleaned_selftext": "smart city claims fall flat",
    "cleaned_comments": "ravish raised valid points many people protest administrations performance using tax people come protest religion related issues lynch minorities mistreat based castes hold government accountable whats happening himachal climate related equally related unparalleled unstructured construction name development go anywhere theres dam ona river downstream mafia openly stealing sand rocks riverbed rains levels may high robbing environment protects us increasing impact us government blame act god problem unkils first voted congress never asked questions want us vote bjp dont ask question desh barbad kar diya hai unkilo ne city unkils scary see many younger generation think similarly lie young bcoz riots misinformation used hate muslim later life made good muslim friends realised idiot blaming whole community one persons crime young minds getting corrupted bcoz unkils media misinformation corrupted uneducated ppl use think wise seen dankmemer crowd talk like uneducated idiots make low class hate content towards muslims etc cant frame single coherent sentence language agree hate see indias bright minds talent ppl getting brainwashed watching aaj tak father breakfast headline screen paryatan ke naam oar khilwad genuinely perplexed mean criticizing government coz year since election arent criticizing previous governments mean one asked upa upa media free keeping government toes saying one back asked questions essentially sayingyou didnt pay attention young hence created good infrastructure fixed basic govt schools govt hospitals basic necessities one asked one questioned never got save fav political party ppl india runing beautiful country blaming citizens theyre saying tourists tour operators blame india whenever something good happens modiji vishwaguru something bad happens people lazycorrupt generally dispensable say godi media thats means media working bjp congress aap theyre working people dont really need smart city much sensors proper drainage system doesnt get votes projects get money system well congress regime media balls freedom ask questions government criticize government bjp regime whole media became pet dogs government something happens media like congress nehru rahul pakistan foreign countries even blame people never blame government modi yeah india wins achieves something modi first line receive credits agree media independent congress governance media shame remember laughing pakistani news channel sudershan news kind hate hidden content thats supposed funny honestly scared disturbingly large number people share literal school kids yikes much next generation woh bhi unkil hi hue na fir toh hindi full hai hai hai",
    "light_cleaned_title": "Smart City washed away in a single rain (English translation of the Hindi Title)",
    "light_cleaned_selftext": "एक ही बारिश में \"स्मार्ट सिटी\" की धुलाई | \"Smart city\" claims fall flat",
    "light_cleaned_comments": "Ravish has raised all valid points. How many people will protest the administration’s performance using our tax? The same people come out to protest religion related issues, lynch minorities, mistreat based on castes, but will not hold the government accountable. What’s happening in Himachal is climate related AND equally related to the unparalleled and unstructured construction in the name of development. Go anywhere there’s a dam ona river and downstream there are mafia openly stealing sand and rocks from the riverbed. Rains levels may be high but it is the robbing of our environment that protects us is what is increasing the impact on all of us. Government will just blame on the “act of god” I have a problem with all these unkils first they voted for congress and never asked questions Now they want us to vote for bjp and don't ask question desh barbad kar diya hai unkilo ne. Which city? It's not just unkils. It is scary to see how many of the younger generation think similarly. I will not lie when I was young bcoz of riots and misinformation I used to hate Muslim. Later in life I made some good muslim friends and realised such an idiot I was blaming the whole community for one person's crime. Young minds are getting corrupted bcoz of this unkils and media misinformation. I was corrupted by uneducated PPL and I use think they are wise. Have you seen the dankmemer crowd? They talk like uneducated idiots and make some low class hate content towards Muslims etc. Most of them can't frame a single coherent sentence in any language. I agree I hate to see India's bright minds and talent PPL getting brainwashed I was watching Aaj Tak with my father during breakfast. The headline on the screen was \"Paryatan ke naam oar Khilwad\". I was genuinely perplexed as to what do they mean by that? Are they criticizing the government? Coz it's been 1 year since the election. Aren't they criticizing the previous governments too? What do you mean no one asked? Both during UPA1 and UPA 2 the media was free and was keeping the then government on their toes, if you are saying no one back then asked questions, you are essentially saying...you didn't pay attention (or was too young) Hence they created good infrastructure and fixed all the basic govt schools and govt hospitals. Basic necessities no one asked no one questioned we never got . To save your fav political party PPL of India are runing this beautiful country They are blaming the citizens. They're saying it's tourists and tour operators who are to blame. This is what India is in 2023. Whenever something good happens - it's because of Modiji Vishwaguru. But if something bad happens it's because the people are lazy,corrupt and generally dispensable. When they say Godi media - that's what it means. The media is not working for the BJP against Congress and AAP. They're working against the people. You don't really need smart city or much sensors. Just, proper drainage system, but that doesn't get you votes or projects to get money out of the system. Well at congress regime Media had balls and freedom to ask questions from government and criticize government but now with bjp regime Whole media have became pet dogs for government. Something happens and media be like Congress, nehru, rahul, pakistan, foreign countries, and even blame on people but never blame on government and modi but yeah if India wins or achieves something then modi will be first in line to receive credits I agree that the media was independent in the Congress governance The media is a shame now. I remember laughing at Pakistani news channel and sudershan news. This. The kind of hate that can be hidden in content thats supposed to be funny honestly scared me. And a disturbingly large number of the people who share them are literal school kids. Yikes. So much for the next generation. Woh bhi unkil hi hue na fir toh why Hindi is full of hai, hai, hai"
}