{
    "id": "1aw6iv3",
    "title": "Beware of numbers starting with +92",
    "url": "https://www.reddit.com/gallery/1aw6iv3",
    "selftext": "I was in college and I had Exam. I got Multiple calls from my Mother. As I had my Unit Tests in 10 Minutes My phone was on Silent. When I checked the Phone my Mother Told me \"Someone claimed that I was raped by them, And were asking money from my Parents\" I am 19M Btw. Their was a Person trying to Mimic me and crying. But my Mother recognized it was not me. So yeah beware from WhatsApp Calls starting with 92.",
    "flair": "Crime",
    "score": 11,
    "num_comments": 7,
    "created_utc": 1708501713.0,
    "convurl": "https://i.redd.it/k7kp3zbr8wjc1.jpg",
    "comments": [
        "Beware of any number unknown that's not from +91...",
        "Indian telecom and ISPs really need to come up with something to deter scams. It's insane the amount of fraud that happens these days.",
        "I once had a Pakistani guy call me on WhatsApp with Amitabh Bachhan's voice and saying I had won a lucky draw on KBC.",
        "I see, I guess they atleast Went through the Effort to Use AI. These guys made a Dumb Mistake. Which made my Mother Réalise right away.",
        "No AI. he was just miming Bachhan",
        "Oooh..... 😭😭😭 I see. Sorry for assuming."
    ],
    "cleaned_text": "beware numbers starting college exam got multiple calls mother unit tests minutes phone silent checked phone mother told someone claimed raped asking money parents btw person trying mimic crying mother recognized yeah beware whatsapp calls starting ",
    "cleaned_title": "beware numbers starting",
    "cleaned_selftext": "college exam got multiple calls mother unit tests minutes phone silent checked phone mother told someone claimed raped asking money parents btw person trying mimic crying mother recognized yeah beware whatsapp calls starting",
    "cleaned_comments": "beware number unknown thats indian telecom isps really need come something deter scams insane amount fraud happens days pakistani guy call whatsapp amitabh bachhans voice saying lucky draw kbc see guess atleast went effort use ai guys made dumb mistake made mother ralise right away ai miming bachhan oooh see sorry assuming",
    "light_cleaned_title": "Beware of numbers starting with +92",
    "light_cleaned_selftext": "I was in college and I had Exam. I got Multiple calls from my Mother. As I had my Unit Tests in 10 Minutes My phone was on Silent. When I checked the Phone my Mother Told me \"Someone claimed that I was raped by them, And were asking money from my Parents\" I am 19M Btw. Their was a Person trying to Mimic me and crying. But my Mother recognized it was not me. So yeah beware from WhatsApp Calls starting with 92.",
    "light_cleaned_comments": "Beware of any number unknown that's not from +91... Indian telecom and ISPs really need to come up with something to deter scams. It's insane the amount of fraud that happens these days. I once had a Pakistani guy call me on WhatsApp with Amitabh Bachhan's voice and saying I had won a lucky draw on KBC. I see, I guess they atleast Went through the Effort to Use AI. These guys made a Dumb Mistake. Which made my Mother Réalise right away. No AI. he was just miming Bachhan Oooh..... 😭😭😭 I see. Sorry for assuming."
}