{
    "id": "163yh3q",
    "title": "Could we make a list of all companies, projects and plans that failed because of protests, government incompetency, etc? E.g POSCO India",
    "url": "https://www.reddit.com/r/india/comments/163yh3q/could_we_make_a_list_of_all_companies_projects/",
    "selftext": "I was watching a video by Charlie Munger on India learning from Singapore and that led me to wonder how many such projects failed because of our inept system. \n\nCould we work on a list, please? I will add them to this post based on your comments. \n\nI will post the video link in the comments section. \n\n&#x200B;",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693257674.0,
    "convurl": "https://external-preview.redd.it/GbEHduZxRZQ6Z0HTmzL6p2zb8uc4VsQQ7kndRH4CV18.jpg",
    "comments": [
        " [(128) Charlie Munger on Lee Kuan Yew and Singapore's Success | Daily Journal 2017 【C:C.M Ep.263】 - YouTube](https://www.youtube.com/watch?v=y3M4uKKVuEo) \n\n [POSCO India - Wikipedia](https://en.wikipedia.org/wiki/POSCO_India)",
        "Comparing Singapore to India is dumb. If tomorrow Bangalore becomes independent , the GDP per capita will cross 20000 dollars per capita. Why we aren’t is the Central Government steals the corporate tax, income tax from the city to feed the entire country and the State Government steals the GST from the city to feed the state. There are numerous Singapores in the country. It’s just that they are slaving for the illiterate rural population",
        "It's not about the comparison itself. It's about us turning away investors and companies from our shores. \n\nI understand that splitting the country up will improve the per capita GDP but that is not the end goal is it? If so, we should just split up Altamount Road then.",
        "Another paid stupid leftist garbage. Take your political mudslinging elsewhere idiot",
        "Stfu you’re speaking garbage",
        "Why are you so angry? Either contribute or ignore. This post is a bust so I will be deleting it anyway."
    ],
    "cleaned_text": "could make list companies projects plans failed protests government incompetency etc eg posco india watching video charlie munger india learning singapore led wonder many projects failed inept system could work list please add post based comments post video link comments section xb ",
    "cleaned_title": "could make list companies projects plans failed protests government incompetency etc eg posco india",
    "cleaned_selftext": "watching video charlie munger india learning singapore led wonder many projects failed inept system could work list please add post based comments post video link comments section xb",
    "cleaned_comments": "charlie munger lee kuan yew singapores success daily journal ccm ep youtubehttpswwwyoutubecomwatchvymukkvueo posco india wikipediahttpsenwikipediaorgwikiposcoindia comparing singapore india dumb tomorrow bangalore becomes independent gdp per capita cross dollars per capita arent central government steals corporate tax income tax city feed entire country state government steals gst city feed state numerous singapores country slaving illiterate rural population comparison us turning away investors companies shores understand splitting country improve per capita gdp end goal split altamount road another paid stupid leftist garbage take political mudslinging elsewhere idiot stfu youre speaking garbage angry either contribute ignore post bust deleting anyway",
    "light_cleaned_title": "Could we make a list of all companies, projects and plans that failed because of protests, government incompetency, etc? E.g POSCO India",
    "light_cleaned_selftext": "I was watching a video by Charlie Munger on India learning from Singapore and that led me to wonder how many such projects failed because of our inept system. Could we work on a list, please? I will add them to this post based on your comments. I will post the video link in the comments section. &#x200B;",
    "light_cleaned_comments": "[(128) Charlie Munger on Lee Kuan Yew and Singapore's Success | Daily Journal 2017 【C:C.M Ep.263】 - YouTube](https://www.youtube.com/watch?v=y3M4uKKVuEo) [POSCO India - Wikipedia](https://en.wikipedia.org/wiki/POSCO_India) Comparing Singapore to India is dumb. If tomorrow Bangalore becomes independent , the GDP per capita will cross 20000 dollars per capita. Why we aren’t is the Central Government steals the corporate tax, income tax from the city to feed the entire country and the State Government steals the GST from the city to feed the state. There are numerous Singapores in the country. It’s just that they are slaving for the illiterate rural population It's not about the comparison itself. It's about us turning away investors and companies from our shores. I understand that splitting the country up will improve the per capita GDP but that is not the end goal is it? If so, we should just split up Altamount Road then. Another paid stupid leftist garbage. Take your political mudslinging elsewhere idiot Stfu you’re speaking garbage Why are you so angry? Either contribute or ignore. This post is a bust so I will be deleting it anyway."
}