{
    "id": "14taf5p",
    "title": "Are these jerseys even real?",
    "url": "https://www.reddit.com/r/india/comments/14taf5p/are_these_jerseys_even_real/",
    "selftext": " I found really cheap jerseys on amazon/ flip cart with no genuine reviews in it. Have you guys ever tried it? Are they real or scam?  \n\n&#x200B;\n\nhttps://preview.redd.it/kuh2kjfw9kab1.png?width=1515&format=png&auto=webp&s=37b8b6a0d18676e9bc27c21012cc61710cfa093c",
    "flair": "AskIndia",
    "score": 6,
    "num_comments": 7,
    "created_utc": 1688743683.0,
    "convurl": "https://b.thumbs.redditmedia.com/B04ftCgyjB3JEZLIoI3uIucjk7_idDPGGL1BxV6Ksms.jpg",
    "comments": [
        "Mujhe toh scam jaisa laga ishliye purchase nahi kiya",
        "Mujhe bhi bhai",
        "Did u find any other online store?",
        "I think these are very low quality fake jerseys that you get on streets.",
        "U got any recommendations? Like jerseys within 500? A grade nahi ho toh bhi decent saa koi website hey?",
        "Idk man. I could only comment on these because I've seen some people I know buy similar jerseys and know how they turned out to be. It's better to buy jerseys from a physical shop even if they are not authentic. At least you get to see what they exactly look like. Quite a few shops in Mumbai sell good jerseys for a decent price (the jerseys are still copies and not orginal).",
        "The prices are around 800 but the jerseys are of good quality...try thehouseofjersey.com",
        "have you ever bought anything from [thehouseofjersey.com](http://thehouseofjersey.com) ? if yes then can you tell me about the quality",
        "yes the quality of the jerseys are very good for the price tbh.\nThere are 2 versions, player and fan. I would suggest the player version as it's better as the material is nice and logos feel official. It's more expensive as compared to fan version but still worth it imo.\nAlso the delivery is pretty quick, ranging from 4 days - 10 days (depends on where you live, the package is sent from Mumbai/Pune can't recall)"
    ],
    "cleaned_text": "jerseys even real found really cheap jerseys amazon flip cart genuine reviews guys ever tried real scam xb ",
    "cleaned_title": "jerseys even real",
    "cleaned_selftext": "found really cheap jerseys amazon flip cart genuine reviews guys ever tried real scam xb",
    "cleaned_comments": "mujhe toh scam jaisa laga ishliye purchase nahi kiya mujhe bhi bhai u find online store think low quality fake jerseys get streets u got recommendations like jerseys within grade nahi ho toh bhi decent saa koi website hey idk man could comment ive seen people know buy similar jerseys know turned better buy jerseys physical shop even authentic least get see exactly look like quite shops mumbai sell good jerseys decent price jerseys still copies orginal prices around jerseys good qualitytry thehouseofjerseycom ever bought anything thehouseofjerseycomhttpthehouseofjerseycom yes tell quality yes quality jerseys good price tbh versions player fan would suggest player version better material nice logos feel official expensive compared fan version still worth imo also delivery pretty quick ranging days days depends live package sent mumbaipune cant recall",
    "light_cleaned_title": "Are these jerseys even real?",
    "light_cleaned_selftext": "I found really cheap jerseys on amazon/ flip cart with no genuine reviews in it. Have you guys ever tried it? Are they real or scam? &#x200B;",
    "light_cleaned_comments": "Mujhe toh scam jaisa laga ishliye purchase nahi kiya Mujhe bhi bhai Did u find any other online store? I think these are very low quality fake jerseys that you get on streets. U got any recommendations? Like jerseys within 500? A grade nahi ho toh bhi decent saa koi website hey? Idk man. I could only comment on these because I've seen some people I know buy similar jerseys and know how they turned out to be. It's better to buy jerseys from a physical shop even if they are not authentic. At least you get to see what they exactly look like. Quite a few shops in Mumbai sell good jerseys for a decent price (the jerseys are still copies and not orginal). The prices are around 800 but the jerseys are of good quality...try thehouseofjersey.com have you ever bought anything from [thehouseofjersey.com](http://thehouseofjersey.com) ? if yes then can you tell me about the quality yes the quality of the jerseys are very good for the price tbh. There are 2 versions, player and fan. I would suggest the player version as it's better as the material is nice and logos feel official. It's more expensive as compared to fan version but still worth it imo. Also the delivery is pretty quick, ranging from 4 days - 10 days (depends on where you live, the package is sent from Mumbai/Pune can't recall)"
}