{
    "id": "144t1l8",
    "title": "BJP bid to revive NDA for 2024: JD(S), TDP, Akalis back on table; new outreach to current friends",
    "url": "https://indianexpress.com/article/political-pulse/bjp-bid-to-revive-nda-for-2024-new-outreach-to-current-friends-8653271/",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Findianexpress.com%2Farticle%2Fpolitical-pulse%2Fbjp-bid-to-revive-nda-for-2024-new-outreach-to-current-friends-8653271%2F",
    "flair": "Politics",
    "score": 31,
    "num_comments": 14,
    "created_utc": 1686278585.0,
    "convurl": "https://external-preview.redd.it/liIzSYOeaLSkAtHpGEuHDXJnvDyd_lR9PDzc8GIYXaQ.jpg?auto=webp&v=enabled&s=721fa5fcc7c1f2b0d5bb9f852664fb6e8488a7bb",
    "comments": [
        "Oh so now they remember their allies.",
        "And here I thought - Ek akela sab pe bhari 😂",
        "Politics makes for strange bedfellows..!!",
        "so the indian juggernaut needs friends hmm who would have thought?  \nso you are telling me even after dividing the whole fucking country you need friends. lmao",
        "Gaand fati to BJP bola haajmola.",
        "Modi hai to mumkin nahi?",
        "Subha ka bhula",
        "Janata Dal (Secular) - lol",
        "If the regional parties have any common sense, they would steer clear of BJP. Friendship with BJP is akin to sheep befriending the wolf, it will come back to bite given the opportunity.",
        "\"Doodh ka jala\" logic hona chahiye abhi regional parties ka",
        "They will do what they have to, to survive. \n\nCongress is not their friend either. Remember when congress fucked over its UPA partner RJD in the 2005 Bihar election, it brought Nitish and BJP to power in Bihar. RJD hasnt formed its own government since then.",
        "Dividing People. Uniting Parties.",
        "They know. But they want to stay relevant in politics. So going with the BJP is the only option for them."
    ],
    "cleaned_text": "bjp bid revive nda jds tdp akalis back table new outreach current friends  ",
    "cleaned_title": "bjp bid revive nda jds tdp akalis back table new outreach current friends",
    "cleaned_selftext": "",
    "cleaned_comments": "oh remember allies thought ek akela sab pe bhari politics makes strange bedfellows indian juggernaut needs friends hmm would thought telling even dividing whole fucking country need friends lmao gaand fati bjp bola haajmola modi hai mumkin nahi subha ka bhula janata dal secular lol regional parties common sense would steer clear bjp friendship bjp akin sheep befriending wolf come back bite given opportunity doodh ka jala logic hona chahiye abhi regional parties ka survive congress friend either remember congress fucked upa partner rjd bihar election brought nitish bjp power bihar rjd hasnt formed government since dividing people uniting parties know want stay relevant politics going bjp option",
    "light_cleaned_title": "BJP bid to revive NDA for 2024: JD(S), TDP, Akalis back on table; new outreach to current friends",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "Oh so now they remember their allies. And here I thought - Ek akela sab pe bhari 😂 Politics makes for strange bedfellows..!! so the indian juggernaut needs friends hmm who would have thought? so you are telling me even after dividing the whole fucking country you need friends. lmao Gaand fati to BJP bola haajmola. Modi hai to mumkin nahi? Subha ka bhula Janata Dal (Secular) - lol If the regional parties have any common sense, they would steer clear of BJP. Friendship with BJP is akin to sheep befriending the wolf, it will come back to bite given the opportunity. \"Doodh ka jala\" logic hona chahiye abhi regional parties ka They will do what they have to, to survive. Congress is not their friend either. Remember when congress fucked over its UPA partner RJD in the 2005 Bihar election, it brought Nitish and BJP to power in Bihar. RJD hasnt formed its own government since then. Dividing People. Uniting Parties. They know. But they want to stay relevant in politics. So going with the BJP is the only option for them."
}