{
    "id": "phi8of",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/phi8of/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 5,
    "num_comments": 14,
    "created_utc": 1630719012,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Little terrorist is a damn good film. Just 15 min long and we had to write a movie report on it in school. I highly recommend it",
        "Watching Jujutsu Kaisen, such a good shounen",
        "Watched Le Prénom (Whats in the name?) its french movie about get together of childhood friends in which on them chooses his unborn Son name Adolf, story revolving around all friends life. Seriously yhis is one of best comedy drama.",
        "Hi! I've just finished FMA: Brotherhood\n\nWould like recommendations on what to watch next? \n\nSo far I've watched Naruto + Shippuden, Demon Slayer, Ju Jutsu Kaisen, Noragami, Promised Wonderland.\n\n\nOn the other hand I've watched Incendies this week, very good movie. I suggest you guys to go in blind. \n\nBrawl in Cell Block 99, Wind River, Bone Tomahawk were all amazing. But I personally loved bone tomahawk the most among them. I do suggest them.",
        "Watched Newsroom. You often hear about freedom that western media enjoys. Guess what, it's as polarizing as the Indian counterpart.",
        "newsroom is not the real-world depiction. more idealistic in nature, but fantastic series nonetheless. Ended too soon.\n\nBut you are right about the polarizing media part of it in general. Indian politics and media seems to learn from them.",
        "Of course, it's fiction but my point was that we usually idealize western media, but it is far from ideal. In any case, it is a good light serial. Nothing great, but if you enjoy light humor mixed with drama, it's pretty good.",
        "&gt;idealize western media\n\nOh, I have seen the western media from up close. The mainstream is so shit! I guess those who idealizes their media must have only seen the niche, good quality journalism. I'm sure if someone saw their mainstream media, they will vomit.\n\nBy the way, if you liked Newsroom, you might also like other works by Aaron Sorkin. Also try the 'The morning show' from Apple TV.",
        "I’ve been listening to the Khooni podcast and the TOI podcast.",
        "Hi! For Anime it seems like you're enjoying shounen rn, I recommend Haikyuu (my favorite shounen, it's about Volleyball but you'll love it for sure), My hero Academia, and Death Note if you haven't already.\n\nAs for anime not shounen try Steins;Gate, One Punch man. Have fun!",
        "Finished Money Heist volume 5 part 1.... Heavy in action, Weak in Plot ...still a decent watch...",
        "Yes, I have been meaning to give a try to The Morning Show.",
        "If you're into less action, more fantasy/adventure related Japanese anime, you should definitely check out Studio Ghibli films. Definitely an interesting list of films to watch.\n\nIn the TV show section, watch One-Punch Man (shorter seasons), Bleach (series has ended, last set of anime being produced) and Attack on Titan (wow dude, very well done).",
        "Distractible Podcast and Conan O Brien Needs a Friend"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "little terrorist damn good film min long write movie report school highly recommend watching jujutsu kaisen good shounen watched le prnom whats name french movie get together childhood friends chooses unborn son name adolf story revolving around friends life seriously yhis one best comedy drama hi ive finished fma brotherhood would like recommendations watch next far ive watched naruto shippuden demon slayer ju jutsu kaisen noragami promised wonderland hand ive watched incendies week good movie suggest guys go blind brawl cell block wind river bone tomahawk amazing personally loved bone tomahawk among suggest watched newsroom often hear freedom western media enjoys guess polarizing indian counterpart newsroom realworld depiction idealistic nature fantastic series nonetheless ended soon right polarizing media part general indian politics media seems learn course fiction point usually idealize western media far ideal case good light serial nothing great enjoy light humor mixed drama pretty good gtidealize western media oh seen western media close mainstream shit guess idealizes media must seen niche good quality journalism im sure someone saw mainstream media vomit way liked newsroom might also like works aaron sorkin also try morning show apple tv ive listening khooni podcast toi podcast hi anime seems like youre enjoying shounen rn recommend haikyuu favorite shounen volleyball youll love sure hero academia death note havent already anime shounen try steinsgate one punch man fun finished money heist volume part heavy action weak plot still decent watch yes meaning give try morning show youre less action fantasyadventure related japanese anime definitely check studio ghibli films definitely interesting list films watch tv show section watch onepunch man shorter seasons bleach series ended last set anime produced attack titan wow dude well done distractible podcast conan brien needs friend",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Little terrorist is a damn good film. Just 15 min long and we had to write a movie report on it in school. I highly recommend it Watching Jujutsu Kaisen, such a good shounen Watched Le Prénom (Whats in the name?) its french movie about get together of childhood friends in which on them chooses his unborn Son name Adolf, story revolving around all friends life. Seriously yhis is one of best comedy drama. Hi! I've just finished FMA: Brotherhood Would like recommendations on what to watch next? So far I've watched Naruto + Shippuden, Demon Slayer, Ju Jutsu Kaisen, Noragami, Promised Wonderland. On the other hand I've watched Incendies this week, very good movie. I suggest you guys to go in blind. Brawl in Cell Block 99, Wind River, Bone Tomahawk were all amazing. But I personally loved bone tomahawk the most among them. I do suggest them. Watched Newsroom. You often hear about freedom that western media enjoys. Guess what, it's as polarizing as the Indian counterpart. newsroom is not the real-world depiction. more idealistic in nature, but fantastic series nonetheless. Ended too soon. But you are right about the polarizing media part of it in general. Indian politics and media seems to learn from them. Of course, it's fiction but my point was that we usually idealize western media, but it is far from ideal. In any case, it is a good light serial. Nothing great, but if you enjoy light humor mixed with drama, it's pretty good. &gt;idealize western media Oh, I have seen the western media from up close. The mainstream is so shit! I guess those who idealizes their media must have only seen the niche, good quality journalism. I'm sure if someone saw their mainstream media, they will vomit. By the way, if you liked Newsroom, you might also like other works by Aaron Sorkin. Also try the 'The morning show' from Apple TV. I’ve been listening to the Khooni podcast and the TOI podcast. Hi! For Anime it seems like you're enjoying shounen rn, I recommend Haikyuu (my favorite shounen, it's about Volleyball but you'll love it for sure), My hero Academia, and Death Note if you haven't already. As for anime not shounen try Steins;Gate, One Punch man. Have fun! Finished Money Heist volume 5 part 1.... Heavy in action, Weak in Plot ...still a decent watch... Yes, I have been meaning to give a try to The Morning Show. If you're into less action, more fantasy/adventure related Japanese anime, you should definitely check out Studio Ghibli films. Definitely an interesting list of films to watch. In the TV show section, watch One-Punch Man (shorter seasons), Bleach (series has ended, last set of anime being produced) and Attack on Titan (wow dude, very well done). Distractible Podcast and Conan O Brien Needs a Friend"
}