{
    "id": "16p4j2b",
    "title": "Health ministry reduces NEET PG cut-off to zero percentile for this year - Times of India",
    "url": "https://timesofindia.indiatimes.com/education/health-ministry-reduces-neet-pg-cut-off-to-zero-percentile-for-this-year/articleshow/103822314.cms",
    "selftext": "You conduct an exam\n\nYou claim the exam will \"filter\" bad candidates\n\nYou also claim rich people with loads of money do not get seats automatically in private colleges\n\nFinally you let everyone in.\n\nWhat kind of fuckery is this? If you are letting everyone in, why need an entrance test?",
    "flair": "Politics",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1695370286.0,
    "convurl": "https://external-preview.redd.it/MCp9Qz6u9fH6UZyTlXDggazlveq5qdDNIBaAF58pcWg.jpg?auto=webp&s=68d3438af9bbb62ab8f682ef7dc99587329fc9f0",
    "comments": [
        "What the actual fuck!",
        "why should the government be concerned if rich people automatically get seats in private colleges ? I do not understand whats wrong with it.",
        "Exactly, when a particular section can go-ahead with negative marks in various fields, what's wrong with money power? Atleast some medical colleges will make money.",
        "And it will give employment to teachers. Not a bad idea to reduce unemployment.",
        "Not only teachers, non teaching staff i.e. Drivers, Admin, Accountants, Cleaners etc along with informal jobs in that area.Plus, the multiplier effect thereof.\n\nAnother masterstroke.",
        "Because rich and influential get automatic entry into fields like Politics and Bollywood. You should recognise how fucked up they are...\nI don't think spreading this to all areas is good.",
        "It will spread to all areas. LET IT. Not like they are gonna work in government sector because if their score. If they work in private sector and take money from other rich people, aint a problem. Why should we be bothered whether they become doctors or not ?"
    ],
    "cleaned_text": "health ministry reduces neet pg cutoff zero percentile year times india conduct exam claim exam filter bad candidates also claim rich people loads money get seats automatically private colleges finally let everyone kind fuckery letting everyone need entrance test ",
    "cleaned_title": "health ministry reduces neet pg cutoff zero percentile year times india",
    "cleaned_selftext": "conduct exam claim exam filter bad candidates also claim rich people loads money get seats automatically private colleges finally let everyone kind fuckery letting everyone need entrance test",
    "cleaned_comments": "actual fuck government concerned rich people automatically get seats private colleges understand whats wrong exactly particular section goahead negative marks various fields whats wrong money power atleast medical colleges make money give employment teachers bad idea reduce unemployment teachers non teaching staff ie drivers admin accountants cleaners etc along informal jobs areaplus multiplier effect thereof another masterstroke rich influential get automatic entry fields like politics bollywood recognise fucked dont think spreading areas good spread areas let like gon na work government sector score work private sector take money rich people aint problem bothered whether become doctors",
    "light_cleaned_title": "Health ministry reduces NEET PG cut-off to zero percentile for this year - Times of India",
    "light_cleaned_selftext": "You conduct an exam You claim the exam will \"filter\" bad candidates You also claim rich people with loads of money do not get seats automatically in private colleges Finally you let everyone in. What kind of fuckery is this? If you are letting everyone in, why need an entrance test?",
    "light_cleaned_comments": "What the actual fuck! why should the government be concerned if rich people automatically get seats in private colleges ? I do not understand whats wrong with it. Exactly, when a particular section can go-ahead with negative marks in various fields, what's wrong with money power? Atleast some medical colleges will make money. And it will give employment to teachers. Not a bad idea to reduce unemployment. Not only teachers, non teaching staff i.e. Drivers, Admin, Accountants, Cleaners etc along with informal jobs in that area.Plus, the multiplier effect thereof. Another masterstroke. Because rich and influential get automatic entry into fields like Politics and Bollywood. You should recognise how fucked up they are... I don't think spreading this to all areas is good. It will spread to all areas. LET IT. Not like they are gonna work in government sector because if their score. If they work in private sector and take money from other rich people, aint a problem. Why should we be bothered whether they become doctors or not ?"
}