{
    "id": "1gdb7nq",
    "title": "Airtel providing very limited data only plans with existing validity now",
    "url": "https://www.reddit.com/gallery/1gdb7nq",
    "selftext": "I use my phone data for work only when there is a power failure at my home. Today I connected my phone hotspot to tv an my phone got disconnected from wifi. Needless to say, it just sucked out all my data. Now I have my previous plan without any data left in it but it has a validity of 50+ days left and airtel is only giving me 1gb for 149₹ all others being very limited validity, one being even for an hour.\n",
    "flair": "Rant / Vent",
    "score": 16,
    "num_comments": 4,
    "created_utc": 1730036489.0,
    "convurl": "https://i.redd.it/7cerzxapyaxd1.jpg",
    "comments": [
        "From the Beginning they used to Loot people it's still continuing, Recently I shifted my house and I used 1 month and 2 days they send 1600 bill refused to reduce it and there recovery agents were calling like 10 times a day like Loan Sharks , Never ever takes any Post paid connection fiber or mobile.",
        "So, we should have thought about it when Ambani was giving out free data. Everyone took it without any thought. And what did that do? Eliminated competition. Now there's only two major options airtel or jio, no other option. So, obviously, they are gonna do something like this",
        "I say we collectively each buy vi and bsnl sims bring back the competition 😅\nI am tired of this",
        "Few years back, they had previously ported my moms number into post paid with the pretext of doing something else. For some months we paid the bills but later one sunday we went to the service centre and got that ported into prepaid again. That was a whole other story where the agents kept on saying that the sim can't be ported on sunday giving some vague reasons. Finally after an hour they just gave up."
    ],
    "cleaned_text": "airtel providing limited data plans existing validity use phone data work power failure home today connected phone hotspot tv phone got disconnected wifi needless say sucked data previous plan without data left validity days left airtel giving gb others limited validity one even hour ",
    "cleaned_title": "airtel providing limited data plans existing validity",
    "cleaned_selftext": "use phone data work power failure home today connected phone hotspot tv phone got disconnected wifi needless say sucked data previous plan without data left validity days left airtel giving gb others limited validity one even hour",
    "cleaned_comments": "beginning used loot people still continuing recently shifted house used month days send bill refused reduce recovery agents calling like times day like loan sharks never ever takes post paid connection fiber mobile thought ambani giving free data everyone took without thought eliminated competition theres two major options airtel jio option obviously gon na something like say collectively buy vi bsnl sims bring back competition tired years back previously ported moms number post paid pretext something else months paid bills later one sunday went service centre got ported prepaid whole story agents kept saying sim cant ported sunday giving vague reasons finally hour gave",
    "light_cleaned_title": "Airtel providing very limited data only plans with existing validity now",
    "light_cleaned_selftext": "I use my phone data for work only when there is a power failure at my home. Today I connected my phone hotspot to tv an my phone got disconnected from wifi. Needless to say, it just sucked out all my data. Now I have my previous plan without any data left in it but it has a validity of 50+ days left and airtel is only giving me 1gb for 149₹ all others being very limited validity, one being even for an hour.",
    "light_cleaned_comments": "From the Beginning they used to Loot people it's still continuing, Recently I shifted my house and I used 1 month and 2 days they send 1600 bill refused to reduce it and there recovery agents were calling like 10 times a day like Loan Sharks , Never ever takes any Post paid connection fiber or mobile. So, we should have thought about it when Ambani was giving out free data. Everyone took it without any thought. And what did that do? Eliminated competition. Now there's only two major options airtel or jio, no other option. So, obviously, they are gonna do something like this I say we collectively each buy vi and bsnl sims bring back the competition 😅 I am tired of this Few years back, they had previously ported my moms number into post paid with the pretext of doing something else. For some months we paid the bills but later one sunday we went to the service centre and got that ported into prepaid again. That was a whole other story where the agents kept on saying that the sim can't be ported on sunday giving some vague reasons. Finally after an hour they just gave up."
}