{
    "id": "1ee46w6",
    "title": "Income tax clearance mandatory to leave India? Centre issues a clarification. Here's what it says",
    "url": "https://www.businesstoday.in/personal-finance/tax/story/income-tax-clearance-mandatory-to-leave-india-centre-issues-a-clarification-heres-what-it-says-439138-2024-07-28",
    "selftext": "> Responding to the reports, which created a significant stir, the CBDT said Section 230 does not mandate every individual domiciled in India to secure a tax clearance certificate before departure.\n>\n> The requirement applies only under specific circumstances. According to the CBDT’s Instruction No. 1/2004, dated February 5, 2004, a tax clearance certificate is necessary only for individuals involved in serious financial irregularities or those with significant direct tax arrears exceeding Rs. 10 lakh, provided these arrears have not been stayed by any authority. ",
    "flair": "Policy/Economy",
    "score": 9,
    "num_comments": 2,
    "created_utc": 1722161552.0,
    "convurl": "https://external-preview.redd.it/JYlUHBfTeAO0HBzB1JbkYmzmvsC6pdQTCupQaanHb8w.jpg?auto=webp&s=f32ff2c4b6bcce39d8d6ecdb370081e7668ac52b",
    "comments": [
        "They have backed out after seeing the public reaction. The finance bill clearly says: *\"No person who is domiciled in India, shall leave India, unless he obtains a certificate from the income-tax authorities stating that he has no liabilities under the Income-tax Act ...\"* Now they say it only applies to those who have pending tax notices.",
        "Just convert everyone officially to bonded labour. Why this charade of freedom when anyway government takes everything."
    ],
    "cleaned_text": "income tax clearance mandatory leave india centre issues clarification heres says responding reports created significant stir cbdt said section mandate every individual domiciled india secure tax clearance certificate departure requirement applies specific circumstances according cbdts instruction dated february tax clearance certificate necessary individuals involved serious financial irregularities significant direct tax arrears exceeding rs lakh provided arrears stayed authority ",
    "cleaned_title": "income tax clearance mandatory leave india centre issues clarification heres says",
    "cleaned_selftext": "responding reports created significant stir cbdt said section mandate every individual domiciled india secure tax clearance certificate departure requirement applies specific circumstances according cbdts instruction dated february tax clearance certificate necessary individuals involved serious financial irregularities significant direct tax arrears exceeding rs lakh provided arrears stayed authority",
    "cleaned_comments": "backed seeing public reaction finance bill clearly says person domiciled india shall leave india unless obtains certificate incometax authorities stating liabilities incometax act say applies pending tax notices convert everyone officially bonded labour charade freedom anyway government takes everything",
    "light_cleaned_title": "Income tax clearance mandatory to leave India? Centre issues a clarification. Here's what it says",
    "light_cleaned_selftext": "> Responding to the reports, which created a significant stir, the CBDT said Section 230 does not mandate every individual domiciled in India to secure a tax clearance certificate before departure. > > The requirement applies only under specific circumstances. According to the CBDT’s Instruction No. 1/2004, dated February 5, 2004, a tax clearance certificate is necessary only for individuals involved in serious financial irregularities or those with significant direct tax arrears exceeding Rs. 10 lakh, provided these arrears have not been stayed by any authority.",
    "light_cleaned_comments": "They have backed out after seeing the public reaction. The finance bill clearly says: *\"No person who is domiciled in India, shall leave India, unless he obtains a certificate from the income-tax authorities stating that he has no liabilities under the Income-tax Act ...\"* Now they say it only applies to those who have pending tax notices. Just convert everyone officially to bonded labour. Why this charade of freedom when anyway government takes everything."
}