{
    "id": "18f0nsf",
    "title": "Karnataka orders beer makers to halt third shift of operations",
    "url": "https://economictimes.indiatimes.com/industry/cons-products/liquor/karnataka-orders-beer-makers-to-halt-third-shift-of-operations/articleshow/105845152.cms",
    "selftext": "India IMO is impossibly regressive and the gov totally incompetent at providing any kind of stable policy",
    "flair": "Policy/Economy",
    "score": 99,
    "num_comments": 12,
    "created_utc": 1702203865.0,
    "convurl": "https://external-preview.redd.it/Amc7qnd1kKFxOsmP4MzwcCtO8K-5w8XmSgxDH2nr0hU.jpg?auto=webp&s=3eab2a4b8d42e7e958235cdc58f3db685d3338ee",
    "comments": [
        "Sticks for the more productive, carrots for the less productive. I am sure we'll become a developed country with this approach.",
        "Most people in this sub know very little about economy . Lemme explain \n\nMost states in South India depend on alcohol tax for revenue. It funds a lot of consumption taxes which States charge . Essentially they have officers to keep track of the supply so that there is no revenue shortfall. But because it's difficult to find government employees who are ready to do the third shift, government has decided to stop third shift. \n\n\nOtherwise scummy alcohol companies can fiddle with stats by producing more in shifts where officials are not likely to be present. Essentially Karnataka government is protecting its revenue source . I don't see anything wrong with this. Alcohol is not price sensitive to that extent. They can produce the same quantity in two shifts . My opinion is that all breweries were scamming the govt",
        "If all the breweries were scamming the govt, I think that'd be a great incentive for the govt to go after the breweries for the lost revenue. Since alcohol is still looked down upon by society in general, there would not be much blow back from it also.\nIMO, finding officers for the 3rd shift can be achieved by offering higher wages/compensation and since this would bring in more revenue, should not be difficult to get the wages approved. \nAlso, brewery capacity expansion is capital intensive and the machinery and brewery tanks are crazy expensive (source: dad worked in engg firms which produce these) so don't think alco producers can easily produce 150% the quantity they are currently set up for\n\nEdit: missed a word",
        ">My opinion is that all breweries were scamming the govt\n\nIsn't it weird that you operate with the presumption that the companies *must* be doing something bad even when it's the government failing to do its job? Employees will lose jobs, companies will lose revenue, and they will be forced to curtail production because the government first insisted that they have a nanny sitting at production doing nothing but supervising them, and then they can't find enough nannies?\n\nInstead of punishing the companies, why don't they pay their excise supervisors more for doing third shifts? The government simply doesn't want to do its work so someone else should suffer for it rather than the government fix itself?",
        "Presumption of guilt is the standard operating procedure when it comes to the government dealing with companies. The amount of compliance and audit companies have to go through is freaking insane. I know a startup that dissolved its India entity and decided to pay all its employees as contractors for their US company simply because they could not keep up with the paperwork.",
        "This is true, there are startups that have moved people to Dubai/Singapore simply because paperwork is easier and taxes are low enough at senior levels that the move actually is cheaper for the companies.",
        "Hire enough staff to get people. Noway is a new guy rejecting night duty when ordered.",
        ">Essentially they have officers to keep track of the supply so that there is no revenue shortfall.\n\nDude, we have a very high labour force.\n\nGovt could at least hire people on contract to do these jobs.\n\nThis sounds like a lame excuse tbh.",
        "Yes all breweries are scamming the innocent government 🙄. /s",
        "fuck with beer now ?",
        "Third shift got bribed too much /s",
        "In another news govt publishes an article saying binge drinking causing heart attack in young Indians \n\nSell alcohol n then expect people not to get addicted lol."
    ],
    "cleaned_text": "karnataka orders beer makers halt third shift operations india imo impossibly regressive gov totally incompetent providing kind stable policy ",
    "cleaned_title": "karnataka orders beer makers halt third shift operations",
    "cleaned_selftext": "india imo impossibly regressive gov totally incompetent providing kind stable policy",
    "cleaned_comments": "sticks productive carrots less productive sure well become developed country approach people sub know little economy lem explain states south india depend alcohol tax revenue funds lot consumption taxes states charge essentially officers keep track supply revenue shortfall difficult find government employees ready third shift government decided stop third shift otherwise scummy alcohol companies fiddle stats producing shifts officials likely present essentially karnataka government protecting revenue source dont see anything wrong alcohol price sensitive extent produce quantity two shifts opinion breweries scamming govt breweries scamming govt think thatd great incentive govt go breweries lost revenue since alcohol still looked upon society general would much blow back also imo finding officers rd shift achieved offering higher wagescompensation since would bring revenue difficult get wages approved also brewery capacity expansion capital intensive machinery brewery tanks crazy expensive source dad worked engg firms produce dont think alco producers easily produce quantity currently set edit missed word opinion breweries scamming govt isnt weird operate presumption companies must something bad even government failing job employees lose jobs companies lose revenue forced curtail production government first insisted nanny sitting production nothing supervising cant find enough nannies instead punishing companies dont pay excise supervisors third shifts government simply doesnt want work someone else suffer rather government fix presumption guilt standard operating procedure comes government dealing companies amount compliance audit companies go freaking insane know startup dissolved india entity decided pay employees contractors us company simply could keep paperwork true startups moved people dubaisingapore simply paperwork easier taxes low enough senior levels move actually cheaper companies hire enough staff get people noway new guy rejecting night duty ordered essentially officers keep track supply revenue shortfall dude high labour force govt could least hire people contract jobs sounds like lame excuse tbh yes breweries scamming innocent government fuck beer third shift got bribed much another news govt publishes article saying binge drinking causing heart attack young indians sell alcohol n expect people get addicted lol",
    "light_cleaned_title": "Karnataka orders beer makers to halt third shift of operations",
    "light_cleaned_selftext": "India IMO is impossibly regressive and the gov totally incompetent at providing any kind of stable policy",
    "light_cleaned_comments": "Sticks for the more productive, carrots for the less productive. I am sure we'll become a developed country with this approach. Most people in this sub know very little about economy . Lemme explain Most states in South India depend on alcohol tax for revenue. It funds a lot of consumption taxes which States charge . Essentially they have officers to keep track of the supply so that there is no revenue shortfall. But because it's difficult to find government employees who are ready to do the third shift, government has decided to stop third shift. Otherwise scummy alcohol companies can fiddle with stats by producing more in shifts where officials are not likely to be present. Essentially Karnataka government is protecting its revenue source . I don't see anything wrong with this. Alcohol is not price sensitive to that extent. They can produce the same quantity in two shifts . My opinion is that all breweries were scamming the govt If all the breweries were scamming the govt, I think that'd be a great incentive for the govt to go after the breweries for the lost revenue. Since alcohol is still looked down upon by society in general, there would not be much blow back from it also. IMO, finding officers for the 3rd shift can be achieved by offering higher wages/compensation and since this would bring in more revenue, should not be difficult to get the wages approved. Also, brewery capacity expansion is capital intensive and the machinery and brewery tanks are crazy expensive (source: dad worked in engg firms which produce these) so don't think alco producers can easily produce 150% the quantity they are currently set up for Edit: missed a word >My opinion is that all breweries were scamming the govt Isn't it weird that you operate with the presumption that the companies *must* be doing something bad even when it's the government failing to do its job? Employees will lose jobs, companies will lose revenue, and they will be forced to curtail production because the government first insisted that they have a nanny sitting at production doing nothing but supervising them, and then they can't find enough nannies? Instead of punishing the companies, why don't they pay their excise supervisors more for doing third shifts? The government simply doesn't want to do its work so someone else should suffer for it rather than the government fix itself? Presumption of guilt is the standard operating procedure when it comes to the government dealing with companies. The amount of compliance and audit companies have to go through is freaking insane. I know a startup that dissolved its India entity and decided to pay all its employees as contractors for their US company simply because they could not keep up with the paperwork. This is true, there are startups that have moved people to Dubai/Singapore simply because paperwork is easier and taxes are low enough at senior levels that the move actually is cheaper for the companies. Hire enough staff to get people. Noway is a new guy rejecting night duty when ordered. >Essentially they have officers to keep track of the supply so that there is no revenue shortfall. Dude, we have a very high labour force. Govt could at least hire people on contract to do these jobs. This sounds like a lame excuse tbh. Yes all breweries are scamming the innocent government 🙄. /s fuck with beer now ? Third shift got bribed too much /s In another news govt publishes an article saying binge drinking causing heart attack in young Indians Sell alcohol n then expect people not to get addicted lol."
}