{
    "id": "1c9ax4s",
    "title": "The #justiceforneha movement happening in karnataka is just full of communal hypocrisy",
    "url": "https://www.reddit.com/r/india/comments/1c9ax4s/the_justiceforneha_movement_happening_in/",
    "selftext": "Recently a woman named Neha was stabbed to death by a named named Fayaz because she rejected his proposal. The attacker should be brought to justice, but the people don't actually care about what happened and are only outraged that the attacker was a Muslim. The love jihad spin has taken off at full speed where protests for Neha's murder is done by the hindutva crowd with people waving saffron flags at these protests. \n\nThe hypocrisy exists because in this very same month of April another similar incident occured in Bangalore, where a man named Girish stabbed a woman named Farida for the exact same reason of her rejecting him. Where is the outrage for Farida? Where are the protests for her? In fact there was pin drop silence about this incident. Notice how the victim here is muslim. \n\nhttps://timesofindia.indiatimes.com/city/bengaluru/after-failed-marriage-proposal-man-stabs-girlfriend-15-times/amp_articleshow/108928890.cms \n\nThis selective outrage really shows the moral bankruptcy of this society. Nobody actually cares about Neha, they only care that the attacker was Muslim and that's the extent of it. Every tragedy is simply used as a tool to spread communal hatred and its just sickening. Where is justice for Farida? Or justice for the hundreds of other women victims? People only care if the attacker is a Muslim and the victim is Hindu. ",
    "flair": "Crime",
    "score": 2,
    "num_comments": 76,
    "created_utc": 1713679981.0,
    "convurl": "https://external-preview.redd.it/wHvLHFyLJTRf4utNo6R0OxU7QyPKrfot_jU7hQH6CnU.jpg?auto=webp&s=e17e099f9709856a4b4678bc5f6d03f417fe591e",
    "comments": [
        "https://preview.redd.it/i31uyb850svc1.jpeg?width=1080&format=pjpg&auto=webp&s=eb1de569c3135ebb80c4d5368857250c3b3beeec",
        "Man you just blew away op's game 😆",
        "Love jihad exist also Muslim men hardly kill Muslim girls for refusing proposal",
        "op is bootlicking muslims can't interfere in this, hopefully in future dhaake khane ke baad smjh aaye we were right from beginning",
        "Hehe, few words more impact !",
        "There is this trend developed in the 21st century (this wasn’t the case in 90s) that whenever there is a murder involving people belonging to different castes / communities, the names of the communities started to get called out. \n\nOriginally this trend only mentioned the names of the communities when the perpetrator belonged to Dominant Castes of the Hindu community and the victim belonged to any other community. \n\nMany people were by and large fine with it and whenever someone questioned this, they were always accused to being apologists for caste / communal violence. \n\nNow there is a shift in the narrative where the names of the communities have started getting highlighted **regardless** of who is the victim and who is the perpetrators. Interestingly, the same cohort who started this trend earlier are now complaining about it.\n\nBut the genie is well and truly out of the bottle now. And we know exactly how it got to this stage.",
        "I guess Farida deserved to get killed and shouldn't get any outrage then. Fine.",
        "Lol he is muslim",
        "Its not about farida getting killed. Its about you trying to frame a religious picture. If her own community doesnt stand for her, why do you except others to take a stand.",
        "That’s exactly what I was saying. Is this the only crime that has happened that needs this much attention?? No, it’s the elections and the corporatar or whoever is the father is completely fine putting his dead daughter on display for money and spin this into a narrative in a state where bjp is not in power",
        "More like both of you are just demonstrating how stupid and immature both of you are that a serious social issue is seen as a \"game\" and that both of you seriously think the reply \"blew away that game.\"",
        "They should get called out irrespective of any caste. Murderers are murderers. No if and buts.",
        "I'm not the one painting a picture of love jihad. I thought you cared about women more than which community they're from. Guess not.",
        "Demolished.",
        "BJP IT cell is working !",
        "Check the title, op is speaking about hypocrisy. I just shared the complete truth. Dont hate the player, just hate the game!",
        "I care about truth, and i shared it. Why are you getting all worked up on a screenshot. Or maybe you should have shared the complete truth.",
        "It's fine you shared the truth, I posted the entire article with that information already there for people to read. Everything I said is still true though, people only care if it looks like a religious attack. I'm calling out people jumping to the love jihad angle with literally nothing. \n\nI assumed people cared more about women than which religion the attacker or victim was but I was gravely mistaken. That's my fault.",
        "People who believe that love jihad is a big threat are the ones who believe that women are so easily swayed for religious terrorism. Any instance including a muslim guy is love jihad and this is a very North indian way of thinking to be honest",
        "No , because one community has a tendency to stab others. The cases have culprits proportionally from a single community,but you will conveniently ignore it.",
        "It isn't a stupid reply.",
        "women's safety is a joke in this country don't think they consider us humans",
        "Your minds need acid",
        "Haha, funny game right.",
        "Overtime",
        "You seem excited.",
        "Haven't you heard about the grooming gangs? I suggest you to read about them and then comment.",
        "2 incidents with attacker having some similarity why cant i put my finger on it?\n\nAlso, Neha is politician's daughter so chances of organize a protest is much higher there. You also are the same my friend pointing out what others are doing doesn't make you different",
        "People missing the point that people care more about the religion of the perpetrators than the victim",
        "Being outraged is one thing, but using the attackers to paint a picture of the entire community is just a race to the bottom. Not too hard to find hindu mobs raping Muslim women, bilkis bono and many stories are quite abound. \n\nThe communal angle and selective outrage is what I'm pointing out.",
        "Three incidents came to light in Karnataka on same day. In Hubli- Fayaz  killed girl Neha. In Bangalore - Pradeep murdered his Ruksana. In Bangalore again - 45 yr old Suresh stabbed 25 yr old Anusha to death in a Public Park in JP nagar. \n\nOnly one incident is being talked all over news and social media.\n\n[https://twitter.com/drunkJournalist/status/1781195740905382331](https://twitter.com/drunkJournalist/status/1781195740905382331)",
        "Haven't your heard about political Hindu extremist? I suggest you to read about them and then comment.",
        "Stop your whataboutism. There should no excuse for such dangerous things. Grooming gang thing is real and well documented. How people from that particular religion targets young girl from other religion is really a matter of concern. Trapping young girl from other religion for conversion. Isn't it a Love Jihad. Few day ago I saw a post in Punjab subs,which describes how young Sikh girls are trapped by those people. Political extremism and communalism exists in every religion. It's not a unique phenomenon in Hinduism. You're talking as if there were no political extremism in other religion.",
        "Inform the President, inform the press, this redditor have successfully invented a device that can read others emotions",
        "Disgusting",
        "Yes Hindu extremism is the reason Hindus are successful in India and abroad. Economically and politically. I can name Indian leaders and CEOs abroad, can you name one Muslim country with democracy?",
        "I'm deflecting of your rhetoric, you provide nothing of substance yet you claim it with such confidence. Just a conspiracy theory. \n\nThere is no love jihad recognised by the government or courts. That is the final line, there has been 10 years to prove it, 10 years to stop it. \n\nNothing has been done since nothing of that sort exists. \n\nIf everything you have to say is anecdotal maybe just maybe it's an issue that only affects you, and probably try to introspect on why that is. \n\nStfu with your conspiracy theories.",
        "What kind of an argument is this 🤣 \n\nBlud thinks Americans are indians. Brother if you've to appropriate some randos to chest thump your pride then you've already lost this game. \n\nCome back with a coherent argument and maybe I'll entertain a conversation with you, if not have a nice weekend.",
        "Give me any statistic for this in India, if you don't have any, stfu before spreading lies.",
        "Don’t we already know that Bhakt hang is hypocrite? They will fight only when they have an agenda. Have noticed the same with leftists. They see an agenda when something crime is committed by Hindu or at temple kind of places. When a muslim man commits crime or anything is mosque related, they go silent. India is filled with religious extremists. There is no middle ground anymore.",
        "Dude, just think for a minute for how inefficient this whole love jihad thing is anyway. People are struggling to get laid on tinder when this terrorist is allegedly tasked with converting another girl by making her fall in love, after enduring her familys beatings and societal risk to elope to fucking Afghanistan. \n\nI mean sure this might have happened in some rare cases but I wouldn't take any terrorist orgs seriously if that's their best method for recruitment. Paying money is far easier wouldn't you think? \n\nThe BJP has created this illusion among the majority that their women are being stolen (how dare they steal our propertttaay) and riles people up.",
        "You are the same victim as everyone else. You only see the negative news and what trends on the top. So get down off your high horse and step into reality. Regular hindus, muslims sikhs etc etc are living happily together.\n\nIts the people who have a personal agenda are the problem. In this case love jihad is a real thing if you choose to not look at it then you are the problem as well.\n\nEvery year there are stories of men killing women because they rejected them which is a problem on its own. \n\nAnd right now you are calling others out for blaming actions of one on the entire community but you are happily used \"HINDU MOBS\" to prove your point\n\nThis is why Liberals are losing everywhere.",
        "It's a counter point you bufoon, which is why I said using attackers to paint the entire community is a race to the bottom in either case. Have some reading comprehension. \n\nGod it's so easy being a dumb bhakt when you don't have to think for anything.",
        "You want to use religion for your argument but it doesn't work for mine? \n\nStrange. You want to talk about extremist Hindu, which you can find in negligible margins, same can't be said for Muslims though can you? \n\nThey can't live peacefully in India, US, Germany, Canada, Europe, hell even Russia. Everywhere I mentioned, they are tired of Muslim extremists, Hindu extremism exists literally in your mind.",
        "Yours isn't an argument blud, it's just some garbage that you think makes sense.",
        "Liberal we support free speech only till it benefits us. If we dont like what we hear then free speech ends there. You're bais is clear dude. Calling me a andh bhakt and says others not to do it.\n\nMatlab insult karke khudko bhetar dikhana hai\n\nKuch bhi",
        "Blud? Man is using London slang without realizing the irony of my first comment. Then I realized he doesn't even know the meaning of extremists. Do you not understand it goes both ways unless explicitly specified? \n\nIf it was garbage you could've ignored. It must have done something for you to tell me whatever BS you came up with instead of actually engaging.",
        "Where did I infringe your free speech snowflake? I called you a fool for not following simple English. Don't cry about. \n\nIf you can criticise a whole community by the actions of one man then the same can be done the other way for other's too. It's not at all complex to understand but only you were the one struggling with simple things.",
        "This should be at the top. But the bhakt brigade has already done their damage.",
        "Keep attacking what ever you can grasp, doesn't matter. Either present a coherent argument or stfu. \n\nThis isn't irony, it isn't even related, if I were chest thumping sure it could be. Go get an education, if you already did. Apologize to your parents for wasting their time and money and fund yourself another one. \n\n>whatever BS you came up with instead of actually engaging.\nLol the deflection, have a nice Sunday \n\nBe better",
        "Pathetic response",
        "My excitement has such immense Range that, it has traveled the wast Web of World Wide Web to your brain and that through 4 written words. Such is power of human consciousness.",
        "classic liberal moves\n\nCherrypicking and goal posting moving and name calling.\n\nGG brother keep chasing your tail",
        "Don't use fallacies if you don't know how they work. \n\nIf you can accuse the entire Muslim community for this man then I can accuse the entire community due to hindutvadis. \n\nEven after so much logical hand holding you're still going yap then you're just another right wing example.",
        "bhai im never in a single comment blamed the muslim community. I'm calling you out with your bais.",
        "Similar thing happened in Tamilnadu a few years back. Triggered a series of event. \n\nDalit boy and a BC girl love affair. The guy was stabbed to death obviously because he’s Dalit. \n\nThen a political party politicised it. ( party - P*K) They claimed, the Dalit guys wear jeans pant and cooling glass to romanticise with upper caste girls. \n\nBelieve it or not, the party had a roaring victory in that constituency. People should be ashamed about this for generations. \n\nThis event is being portrayed in a similar manner, playing the Islamophobia card.",
        "What bias do I have? I'm not the one jumping to calling a murder a love jihad when so many other murders have also taken place. \n\nWhy don't you show your scepticism equally to all sides? No only be sceptical when it's convenient. \n\nOther murders have taken place but people are only angry because it's a Muslim killer and they want to now paint the Muslims community as killers. Tell me how is that not biased?",
        "With every news opposite exist. For evey case people make about hindus a simple Google search will give 2 more against other religion and vice versa. Doing what Aboutsim here just diminish value as for every case that's highlighted same logic can apply as no matter what side you think most cases won't reach public eye \n\n Doing what Aboutsim like this won't help your case . \nAnd I appreciate your concern but from next time be accurate about your facts in other subs people would have eaten you alive fir giving such wrong example lol.  \n\nAnd If its due to love jigad, should be taken as such",
        "I guess apart from religion her being politician  daughter also helps",
        "You must be ashamed of writing that.",
        "Because there are clear video where are they announcing that they are teaching love jihad across the country then why should I not be sceptical about his intentions. once is an accident second time might be a accident but mutliple times across the country. nope and I never blamed him or brought it up you did and now you are sticking the blame on me. Classic liberal moves\n\nAlso, you need step outside your bubble. Also, Your bais which is fueled with articles with ill intentions vagera vagera. You can choose to bury your head in sand and selective see what you want. I wont",
        "You're no better. Shame on you for downplaying one incident to shine light on a different incident. Both are humans at the end of the day. People like you are the reason why Sanghis justify the shit they do. You go out of your way to prove that love jihad doesn't exist when reality says otherwise. Stop with the tunnel vision and minority appeasement. Crime is a crime. You might not acknowledge it but love jihad is real and it exists. I have seen it with my own eyes.",
        "You Illiterate ignorant jackass, all over the news the politicians and protesters are calling this a love jihad. That was the whole purpose of this post. \n\nNow you need to officially shut your fucking mouth because you've proven your stupidity more than numerous times. Enough move on now. \n\nRight wing fools like you always speaking shit without knowing a God damn thing has been the case since time immemorial. You're so damn lucky youre behind your screen...",
        "What proof do you have this is love was jihad? Sanghis have fools like you to thank for always kissing their asses whenever its convenient for them.",
        "I have literally seen two cases where the guys openly confessed to it. They made the girl fall in love madly but then told her that the parents won't accept if you won't convert. Maybe try spending more time outside of reddit. No ideology is perfect - be it right or left.\n\nOne more thing, you didn't answer another question like why are you trying to downplay what happened to Neha? Because you're the opposite side of Sanghi. You both are extremists. Our country needs to be free from both right and left extremists. \n\n>Sanghis have fools like you to thank for always kissing their asses\n\nHate to break it to you but you're the one who's kissing ass here. A girl died and you're trying to downplay it because of the communal angle. Get a life. More importantly, go out once in a while.",
        "oooooohhh.... im shaking. HAHAHAHA\n\nYou cant prove a single point without name calling or logic and all your replies are that and now you asking me to not say anything cause you painted yourself in the corner.\n\nYou are the ones who say we support free speech but are the first ones to silence someone when you dont like what you are listening this whole time you have not acknowledged Love jihad as a real problem, While I the so called right winger have acknowledged and explained it is happening. \n\nOkay ill accept i dont know anything will you accept that you are brainwashed by liberal propaganda and will not accept anything which doesn't align with your agenda and bias?\n\nofficially im not shuting my mouth kar le jo kar na hai and you are the lucky one who is behind the screen or else tera toh moye moye ho ja ta. Rahul Gandhi ka competition keh la ta.",
        "In many instances, individuals tend to prioritize their religious affiliation above all else. When identities are stripped away, you'll notice a significant decrease in people's level of concern. Despite occasional moments of unity, the prevailing tendency is to prioritize those within their religious community."
    ],
    "cleaned_text": "justiceforneha movement happening karnataka full communal hypocrisy recently woman named neha stabbed death named named fayaz rejected proposal attacker brought justice people dont actually care happened outraged attacker muslim love jihad spin taken full speed protests nehas murder done hindutva crowd people waving saffron flags protests hypocrisy exists month april another similar incident occured bangalore man named girish stabbed woman named farida exact reason rejecting outrage farida protests fact pin drop silence incident notice victim muslim selective outrage really shows moral bankruptcy society nobody actually cares neha care attacker muslim thats extent every tragedy simply used tool spread communal hatred sickening justice farida justice hundreds women victims people care attacker muslim victim hindu ",
    "cleaned_title": "justiceforneha movement happening karnataka full communal hypocrisy",
    "cleaned_selftext": "recently woman named neha stabbed death named named fayaz rejected proposal attacker brought justice people dont actually care happened outraged attacker muslim love jihad spin taken full speed protests nehas murder done hindutva crowd people waving saffron flags protests hypocrisy exists month april another similar incident occured bangalore man named girish stabbed woman named farida exact reason rejecting outrage farida protests fact pin drop silence incident notice victim muslim selective outrage really shows moral bankruptcy society nobody actually cares neha care attacker muslim thats extent every tragedy simply used tool spread communal hatred sickening justice farida justice hundreds women victims people care attacker muslim victim hindu",
    "cleaned_comments": "man blew away ops game love jihad exist also muslim men hardly kill muslim girls refusing proposal op bootlicking muslims cant interfere hopefully future dhaake khane ke baad smjh aaye right beginning hehe words impact trend developed st century wasnt case whenever murder involving people belonging different castes communities names communities started get called originally trend mentioned names communities perpetrator belonged dominant castes hindu community victim belonged community many people large fine whenever someone questioned always accused apologists caste communal violence shift narrative names communities started getting highlighted regardless victim perpetrators interestingly cohort started trend earlier complaining genie well truly bottle know exactly got stage guess farida deserved get killed shouldnt get outrage fine lol muslim farida getting killed trying frame religious picture community doesnt stand except others take stand thats exactly saying crime happened needs much attention elections corporatar whoever father completely fine putting dead daughter display money spin narrative state bjp power like demonstrating stupid immature serious social issue seen game seriously think reply blew away game get called irrespective caste murderers murderers buts im one painting picture love jihad thought cared women community theyre guess demolished bjp cell working check title op speaking hypocrisy shared complete truth dont hate player hate game care truth shared getting worked screenshot maybe shared complete truth fine shared truth posted entire article information already people read everything said still true though people care looks like religious attack im calling people jumping love jihad angle literally nothing assumed people cared women religion attacker victim gravely mistaken thats fault people believe love jihad big threat ones believe women easily swayed religious terrorism instance including muslim guy love jihad north indian way thinking honest one community tendency stab others cases culprits proportionally single communitybut conveniently ignore isnt stupid reply womens safety joke country dont think consider us humans minds need acid haha funny game right overtime seem excited havent heard grooming gangs suggest read comment incidents attacker similarity cant put finger also neha politicians daughter chances organize protest much higher also friend pointing others doesnt make different people missing point people care religion perpetrators victim outraged one thing using attackers paint picture entire community race bottom hard find hindu mobs raping muslim women bilkis bono many stories quite abound communal angle selective outrage im pointing three incidents came light karnataka day hubli fayaz killed girl neha bangalore pradeep murdered ruksana bangalore yr old suresh stabbed yr old anusha death public park jp nagar one incident talked news social media httpstwittercomdrunkjournaliststatushttpstwittercomdrunkjournaliststatus havent heard political hindu extremist suggest read comment stop whataboutism excuse dangerous things grooming gang thing real well documented people particular religion targets young girl religion really matter concern trapping young girl religion conversion isnt love jihad day ago saw post punjab subswhich describes young sikh girls trapped people political extremism communalism exists every religion unique phenomenon hinduism youre talking political extremism religion inform president inform press redditor successfully invented device read others emotions disgusting yes hindu extremism reason hindus successful india abroad economically politically name indian leaders ceos abroad name one muslim country democracy im deflecting rhetoric provide nothing substance yet claim confidence conspiracy theory love jihad recognised government courts final line years prove years stop nothing done since nothing sort exists everything say anecdotal maybe maybe issue affects probably try introspect stfu conspiracy theories kind argument blud thinks americans indians brother youve appropriate randos chest thump pride youve already lost game come back coherent argument maybe ill entertain conversation nice weekend give statistic india dont stfu spreading lies dont already know bhakt hang hypocrite fight agenda noticed leftists see agenda something crime committed hindu temple kind places muslim man commits crime anything mosque related go silent india filled religious extremists middle ground anymore dude think minute inefficient whole love jihad thing anyway people struggling get laid tinder terrorist allegedly tasked converting another girl making fall love enduring familys beatings societal risk elope fucking afghanistan mean sure might happened rare cases wouldnt take terrorist orgs seriously thats best method recruitment paying money far easier wouldnt think bjp created illusion among majority women stolen dare steal propertttaay riles people victim everyone else see negative news trends top get high horse step reality regular hindus muslims sikhs etc etc living happily together people personal agenda problem case love jihad real thing choose look problem well every year stories men killing women rejected problem right calling others blaming actions one entire community happily used hindu mobs prove point liberals losing everywhere counter point bufoon said using attackers paint entire community race bottom either case reading comprehension god easy dumb bhakt dont think anything want use religion argument doesnt work mine strange want talk extremist hindu find negligible margins cant said muslims though cant live peacefully india us germany canada europe hell even russia everywhere mentioned tired muslim extremists hindu extremism exists literally mind isnt argument blud garbage think makes sense liberal support free speech till benefits us dont like hear free speech ends youre bais clear dude calling andh bhakt says others matlab insult karke khudko bhetar dikhana hai kuch bhi blud man using london slang without realizing irony first comment realized doesnt even know meaning extremists understand goes ways unless explicitly specified garbage couldve ignored must done something tell whatever bs came instead actually engaging infringe free speech snowflake called fool following simple english dont cry criticise whole community actions one man done way others complex understand one struggling simple things top bhakt brigade already done damage keep attacking ever grasp doesnt matter either present coherent argument stfu isnt irony isnt even related chest thumping sure could go get education already apologize parents wasting time money fund another one whatever bs came instead actually engaging lol deflection nice sunday better pathetic response excitement immense range traveled wast web world wide web brain written words power human consciousness classic liberal moves cherrypicking goal posting moving name calling gg brother keep chasing tail dont use fallacies dont know work accuse entire muslim community man accuse entire community due hindutvadis even much logical hand holding youre still going yap youre another right wing example bhai im never single comment blamed muslim community im calling bais similar thing happened tamilnadu years back triggered series event dalit boy bc girl love affair guy stabbed death obviously hes dalit political party politicised party pk claimed dalit guys wear jeans pant cooling glass romanticise upper caste girls believe party roaring victory constituency people ashamed generations event portrayed similar manner playing islamophobia card bias im one jumping calling murder love jihad many murders also taken place dont show scepticism equally sides sceptical convenient murders taken place people angry muslim killer want paint muslims community killers tell biased every news opposite exist evey case people make hindus simple google search give religion vice versa aboutsim diminish value every case thats highlighted logic apply matter side think cases wont reach public eye aboutsim like wont help case appreciate concern next time accurate facts subs people would eaten alive fir giving wrong example lol due love jigad taken guess apart religion politician daughter also helps must ashamed writing clear video announcing teaching love jihad across country sceptical intentions accident second time might accident mutliple times across country nope never blamed brought sticking blame classic liberal moves also need step outside bubble also bais fueled articles ill intentions vagera vagera choose bury head sand selective see want wont youre better shame downplaying one incident shine light different incident humans end day people like reason sanghis justify shit go way prove love jihad doesnt exist reality says otherwise stop tunnel vision minority appeasement crime crime might acknowledge love jihad real exists seen eyes illiterate ignorant jackass news politicians protesters calling love jihad whole purpose post need officially shut fucking mouth youve proven stupidity numerous times enough move right wing fools like always speaking shit without knowing god damn thing case since time immemorial youre damn lucky youre behind screen proof love jihad sanghis fools like thank always kissing asses whenever convenient literally seen two cases guys openly confessed made girl fall love madly told parents wont accept wont convert maybe try spending time outside reddit ideology perfect right left one thing didnt answer another question like trying downplay happened neha youre opposite side sanghi extremists country needs free right left extremists sanghis fools like thank always kissing asses hate break youre one whos kissing ass girl died youre trying downplay communal angle get life importantly go oooooohhh im shaking hahahaha cant prove single point without name calling logic replies asking say anything cause painted corner ones say support free speech first ones silence someone dont like listening whole time acknowledged love jihad real problem called right winger acknowledged explained happening okay ill accept dont know anything accept brainwashed liberal propaganda accept anything doesnt align agenda bias officially im shuting mouth kar le jo kar na hai lucky one behind screen else tera toh moye moye ho ja ta rahul gandhi ka competition keh la ta many instances individuals tend prioritize religious affiliation else identities stripped away youll notice significant decrease peoples level concern despite occasional moments unity prevailing tendency prioritize within religious community",
    "light_cleaned_title": "The #justiceforneha movement happening in karnataka is just full of communal hypocrisy",
    "light_cleaned_selftext": "Recently a woman named Neha was stabbed to death by a named named Fayaz because she rejected his proposal. The attacker should be brought to justice, but the people don't actually care about what happened and are only outraged that the attacker was a Muslim. The love jihad spin has taken off at full speed where protests for Neha's murder is done by the hindutva crowd with people waving saffron flags at these protests. The hypocrisy exists because in this very same month of April another similar incident occured in Bangalore, where a man named Girish stabbed a woman named Farida for the exact same reason of her rejecting him. Where is the outrage for Farida? Where are the protests for her? In fact there was pin drop silence about this incident. Notice how the victim here is muslim. This selective outrage really shows the moral bankruptcy of this society. Nobody actually cares about Neha, they only care that the attacker was Muslim and that's the extent of it. Every tragedy is simply used as a tool to spread communal hatred and its just sickening. Where is justice for Farida? Or justice for the hundreds of other women victims? People only care if the attacker is a Muslim and the victim is Hindu.",
    "light_cleaned_comments": "Man you just blew away op's game 😆 Love jihad exist also Muslim men hardly kill Muslim girls for refusing proposal op is bootlicking muslims can't interfere in this, hopefully in future dhaake khane ke baad smjh aaye we were right from beginning Hehe, few words more impact ! There is this trend developed in the 21st century (this wasn’t the case in 90s) that whenever there is a murder involving people belonging to different castes / communities, the names of the communities started to get called out. Originally this trend only mentioned the names of the communities when the perpetrator belonged to Dominant Castes of the Hindu community and the victim belonged to any other community. Many people were by and large fine with it and whenever someone questioned this, they were always accused to being apologists for caste / communal violence. Now there is a shift in the narrative where the names of the communities have started getting highlighted **regardless** of who is the victim and who is the perpetrators. Interestingly, the same cohort who started this trend earlier are now complaining about it. But the genie is well and truly out of the bottle now. And we know exactly how it got to this stage. I guess Farida deserved to get killed and shouldn't get any outrage then. Fine. Lol he is muslim Its not about farida getting killed. Its about you trying to frame a religious picture. If her own community doesnt stand for her, why do you except others to take a stand. That’s exactly what I was saying. Is this the only crime that has happened that needs this much attention?? No, it’s the elections and the corporatar or whoever is the father is completely fine putting his dead daughter on display for money and spin this into a narrative in a state where bjp is not in power More like both of you are just demonstrating how stupid and immature both of you are that a serious social issue is seen as a \"game\" and that both of you seriously think the reply \"blew away that game.\" They should get called out irrespective of any caste. Murderers are murderers. No if and buts. I'm not the one painting a picture of love jihad. I thought you cared about women more than which community they're from. Guess not. Demolished. BJP IT cell is working ! Check the title, op is speaking about hypocrisy. I just shared the complete truth. Dont hate the player, just hate the game! I care about truth, and i shared it. Why are you getting all worked up on a screenshot. Or maybe you should have shared the complete truth. It's fine you shared the truth, I posted the entire article with that information already there for people to read. Everything I said is still true though, people only care if it looks like a religious attack. I'm calling out people jumping to the love jihad angle with literally nothing. I assumed people cared more about women than which religion the attacker or victim was but I was gravely mistaken. That's my fault. People who believe that love jihad is a big threat are the ones who believe that women are so easily swayed for religious terrorism. Any instance including a muslim guy is love jihad and this is a very North indian way of thinking to be honest No , because one community has a tendency to stab others. The cases have culprits proportionally from a single community,but you will conveniently ignore it. It isn't a stupid reply. women's safety is a joke in this country don't think they consider us humans Your minds need acid Haha, funny game right. Overtime You seem excited. Haven't you heard about the grooming gangs? I suggest you to read about them and then comment. 2 incidents with attacker having some similarity why cant i put my finger on it? Also, Neha is politician's daughter so chances of organize a protest is much higher there. You also are the same my friend pointing out what others are doing doesn't make you different People missing the point that people care more about the religion of the perpetrators than the victim Being outraged is one thing, but using the attackers to paint a picture of the entire community is just a race to the bottom. Not too hard to find hindu mobs raping Muslim women, bilkis bono and many stories are quite abound. The communal angle and selective outrage is what I'm pointing out. Three incidents came to light in Karnataka on same day. In Hubli- Fayaz killed girl Neha. In Bangalore - Pradeep murdered his Ruksana. In Bangalore again - 45 yr old Suresh stabbed 25 yr old Anusha to death in a Public Park in JP nagar. Only one incident is being talked all over news and social media. [https://twitter.com/drunkJournalist/status/1781195740905382331](https://twitter.com/drunkJournalist/status/1781195740905382331) Haven't your heard about political Hindu extremist? I suggest you to read about them and then comment. Stop your whataboutism. There should no excuse for such dangerous things. Grooming gang thing is real and well documented. How people from that particular religion targets young girl from other religion is really a matter of concern. Trapping young girl from other religion for conversion. Isn't it a Love Jihad. Few day ago I saw a post in Punjab subs,which describes how young Sikh girls are trapped by those people. Political extremism and communalism exists in every religion. It's not a unique phenomenon in Hinduism. You're talking as if there were no political extremism in other religion. Inform the President, inform the press, this redditor have successfully invented a device that can read others emotions Disgusting Yes Hindu extremism is the reason Hindus are successful in India and abroad. Economically and politically. I can name Indian leaders and CEOs abroad, can you name one Muslim country with democracy? I'm deflecting of your rhetoric, you provide nothing of substance yet you claim it with such confidence. Just a conspiracy theory. There is no love jihad recognised by the government or courts. That is the final line, there has been 10 years to prove it, 10 years to stop it. Nothing has been done since nothing of that sort exists. If everything you have to say is anecdotal maybe just maybe it's an issue that only affects you, and probably try to introspect on why that is. Stfu with your conspiracy theories. What kind of an argument is this 🤣 Blud thinks Americans are indians. Brother if you've to appropriate some randos to chest thump your pride then you've already lost this game. Come back with a coherent argument and maybe I'll entertain a conversation with you, if not have a nice weekend. Give me any statistic for this in India, if you don't have any, stfu before spreading lies. Don’t we already know that Bhakt hang is hypocrite? They will fight only when they have an agenda. Have noticed the same with leftists. They see an agenda when something crime is committed by Hindu or at temple kind of places. When a muslim man commits crime or anything is mosque related, they go silent. India is filled with religious extremists. There is no middle ground anymore. Dude, just think for a minute for how inefficient this whole love jihad thing is anyway. People are struggling to get laid on tinder when this terrorist is allegedly tasked with converting another girl by making her fall in love, after enduring her familys beatings and societal risk to elope to fucking Afghanistan. I mean sure this might have happened in some rare cases but I wouldn't take any terrorist orgs seriously if that's their best method for recruitment. Paying money is far easier wouldn't you think? The BJP has created this illusion among the majority that their women are being stolen (how dare they steal our propertttaay) and riles people up. You are the same victim as everyone else. You only see the negative news and what trends on the top. So get down off your high horse and step into reality. Regular hindus, muslims sikhs etc etc are living happily together. Its the people who have a personal agenda are the problem. In this case love jihad is a real thing if you choose to not look at it then you are the problem as well. Every year there are stories of men killing women because they rejected them which is a problem on its own. And right now you are calling others out for blaming actions of one on the entire community but you are happily used \"HINDU MOBS\" to prove your point This is why Liberals are losing everywhere. It's a counter point you bufoon, which is why I said using attackers to paint the entire community is a race to the bottom in either case. Have some reading comprehension. God it's so easy being a dumb bhakt when you don't have to think for anything. You want to use religion for your argument but it doesn't work for mine? Strange. You want to talk about extremist Hindu, which you can find in negligible margins, same can't be said for Muslims though can you? They can't live peacefully in India, US, Germany, Canada, Europe, hell even Russia. Everywhere I mentioned, they are tired of Muslim extremists, Hindu extremism exists literally in your mind. Yours isn't an argument blud, it's just some garbage that you think makes sense. Liberal we support free speech only till it benefits us. If we dont like what we hear then free speech ends there. You're bais is clear dude. Calling me a andh bhakt and says others not to do it. Matlab insult karke khudko bhetar dikhana hai Kuch bhi Blud? Man is using London slang without realizing the irony of my first comment. Then I realized he doesn't even know the meaning of extremists. Do you not understand it goes both ways unless explicitly specified? If it was garbage you could've ignored. It must have done something for you to tell me whatever BS you came up with instead of actually engaging. Where did I infringe your free speech snowflake? I called you a fool for not following simple English. Don't cry about. If you can criticise a whole community by the actions of one man then the same can be done the other way for other's too. It's not at all complex to understand but only you were the one struggling with simple things. This should be at the top. But the bhakt brigade has already done their damage. Keep attacking what ever you can grasp, doesn't matter. Either present a coherent argument or stfu. This isn't irony, it isn't even related, if I were chest thumping sure it could be. Go get an education, if you already did. Apologize to your parents for wasting their time and money and fund yourself another one. >whatever BS you came up with instead of actually engaging. Lol the deflection, have a nice Sunday Be better Pathetic response My excitement has such immense Range that, it has traveled the wast Web of World Wide Web to your brain and that through 4 written words. Such is power of human consciousness. classic liberal moves Cherrypicking and goal posting moving and name calling. GG brother keep chasing your tail Don't use fallacies if you don't know how they work. If you can accuse the entire Muslim community for this man then I can accuse the entire community due to hindutvadis. Even after so much logical hand holding you're still going yap then you're just another right wing example. bhai im never in a single comment blamed the muslim community. I'm calling you out with your bais. Similar thing happened in Tamilnadu a few years back. Triggered a series of event. Dalit boy and a BC girl love affair. The guy was stabbed to death obviously because he’s Dalit. Then a political party politicised it. ( party - P*K) They claimed, the Dalit guys wear jeans pant and cooling glass to romanticise with upper caste girls. Believe it or not, the party had a roaring victory in that constituency. People should be ashamed about this for generations. This event is being portrayed in a similar manner, playing the Islamophobia card. What bias do I have? I'm not the one jumping to calling a murder a love jihad when so many other murders have also taken place. Why don't you show your scepticism equally to all sides? No only be sceptical when it's convenient. Other murders have taken place but people are only angry because it's a Muslim killer and they want to now paint the Muslims community as killers. Tell me how is that not biased? With every news opposite exist. For evey case people make about hindus a simple Google search will give 2 more against other religion and vice versa. Doing what Aboutsim here just diminish value as for every case that's highlighted same logic can apply as no matter what side you think most cases won't reach public eye Doing what Aboutsim like this won't help your case . And I appreciate your concern but from next time be accurate about your facts in other subs people would have eaten you alive fir giving such wrong example lol. And If its due to love jigad, should be taken as such I guess apart from religion her being politician daughter also helps You must be ashamed of writing that. Because there are clear video where are they announcing that they are teaching love jihad across the country then why should I not be sceptical about his intentions. once is an accident second time might be a accident but mutliple times across the country. nope and I never blamed him or brought it up you did and now you are sticking the blame on me. Classic liberal moves Also, you need step outside your bubble. Also, Your bais which is fueled with articles with ill intentions vagera vagera. You can choose to bury your head in sand and selective see what you want. I wont You're no better. Shame on you for downplaying one incident to shine light on a different incident. Both are humans at the end of the day. People like you are the reason why Sanghis justify the shit they do. You go out of your way to prove that love jihad doesn't exist when reality says otherwise. Stop with the tunnel vision and minority appeasement. Crime is a crime. You might not acknowledge it but love jihad is real and it exists. I have seen it with my own eyes. You Illiterate ignorant jackass, all over the news the politicians and protesters are calling this a love jihad. That was the whole purpose of this post. Now you need to officially shut your fucking mouth because you've proven your stupidity more than numerous times. Enough move on now. Right wing fools like you always speaking shit without knowing a God damn thing has been the case since time immemorial. You're so damn lucky youre behind your screen... What proof do you have this is love was jihad? Sanghis have fools like you to thank for always kissing their asses whenever its convenient for them. I have literally seen two cases where the guys openly confessed to it. They made the girl fall in love madly but then told her that the parents won't accept if you won't convert. Maybe try spending more time outside of reddit. No ideology is perfect - be it right or left. One more thing, you didn't answer another question like why are you trying to downplay what happened to Neha? Because you're the opposite side of Sanghi. You both are extremists. Our country needs to be free from both right and left extremists. >Sanghis have fools like you to thank for always kissing their asses Hate to break it to you but you're the one who's kissing ass here. A girl died and you're trying to downplay it because of the communal angle. Get a life. More importantly, go out once in a while. oooooohhh.... im shaking. HAHAHAHA You cant prove a single point without name calling or logic and all your replies are that and now you asking me to not say anything cause you painted yourself in the corner. You are the ones who say we support free speech but are the first ones to silence someone when you dont like what you are listening this whole time you have not acknowledged Love jihad as a real problem, While I the so called right winger have acknowledged and explained it is happening. Okay ill accept i dont know anything will you accept that you are brainwashed by liberal propaganda and will not accept anything which doesn't align with your agenda and bias? officially im not shuting my mouth kar le jo kar na hai and you are the lucky one who is behind the screen or else tera toh moye moye ho ja ta. Rahul Gandhi ka competition keh la ta. In many instances, individuals tend to prioritize their religious affiliation above all else. When identities are stripped away, you'll notice a significant decrease in people's level of concern. Despite occasional moments of unity, the prevailing tendency is to prioritize those within their religious community."
}