{
    "id": "15uu3pe",
    "title": "Book on Demonetization",
    "url": "https://www.goodreads.com/book/show/39084618",
    "selftext": "I wanted to share one of the very insightful books that I found on demonetization (2016). \n\nThe book “Demonetization and the Black Economy” has been a great resource on what occurred during the demonetization event. It’s helped me ground a lot of conversations into reality when discussing with family and friends. \n\nWhile a some of the reviews on good reads say that none of the predictions were accurate, I do think that there’s an ample amount data on the exact sequence of events during the aftermath. \n\nI’m also curious to know if there are any more books / papers people might want to recommend in this thread. \n\nIf you’ve read the book and can contend precisely on any of the points highlighted with references please leave a response here. I’d prefer it people don’t brigade the post.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1692387482.0,
    "convurl": "https://external-preview.redd.it/_LMwMDkxlK-cKL6lKs6PMIPvOLtaOR4qUJFchKUcE9Y.jpg?auto=webp&s=bf02b26d429cca7b2035a91d16e589ffd6787a1d",
    "comments": [],
    "cleaned_text": "book demonetization wanted share one insightful books found demonetization book demonetization black economy great resource occurred demonetization event helped ground lot conversations reality discussing family friends reviews good reads say none predictions accurate think theres ample amount data exact sequence events aftermath im also curious know books papers people might want recommend thread youve read book contend precisely points highlighted references please leave response id prefer people dont brigade post ",
    "cleaned_title": "book demonetization",
    "cleaned_selftext": "wanted share one insightful books found demonetization book demonetization black economy great resource occurred demonetization event helped ground lot conversations reality discussing family friends reviews good reads say none predictions accurate think theres ample amount data exact sequence events aftermath im also curious know books papers people might want recommend thread youve read book contend precisely points highlighted references please leave response id prefer people dont brigade post",
    "cleaned_comments": "",
    "light_cleaned_title": "Book on Demonetization",
    "light_cleaned_selftext": "I wanted to share one of the very insightful books that I found on demonetization (2016). The book “Demonetization and the Black Economy” has been a great resource on what occurred during the demonetization event. It’s helped me ground a lot of conversations into reality when discussing with family and friends. While a some of the reviews on good reads say that none of the predictions were accurate, I do think that there’s an ample amount data on the exact sequence of events during the aftermath. I’m also curious to know if there are any more books / papers people might want to recommend in this thread. If you’ve read the book and can contend precisely on any of the points highlighted with references please leave a response here. I’d prefer it people don’t brigade the post.",
    "light_cleaned_comments": ""
}