{
    "id": "1e5iw51",
    "title": "What explains the surge in terror attacks in Jammu?",
    "url": "https://indianexpress.com/article/explained/what-explains-the-surge-in-terror-attacks-in-jammu-9457764/?ref=hometop_hp",
    "selftext": "While there were three attacks each in Jammu region against security forces in 2022 and 2023, six attacks have been recorded so far this year.",
    "flair": "Crime",
    "score": 9,
    "num_comments": 1,
    "created_utc": 1721224762.0,
    "convurl": "https://external-preview.redd.it/b4Cg03Ez1APMNt2ZBVL6i-qfoGpKOvJ8tCUCNsefp_8.jpg?auto=webp&s=581ec93e3c42df407b9ef75d00071e1900572a03",
    "comments": [
        "The latest encounter in Jammu and Kashmir’s Doda district has once again laid bare the gaps in the security infrastructure of a belt that saw long stretches of peace until recent years.\nSince 2021, areas south of the Pir Panjal range, including Poonch, Rajouri and Jammu, have seen a surge in high-intensity terror targeting security forces and civilians.\n\nIn January, former Army Chief General Manoj Pande acknowledged that terrorism in that area had been brought under control by 2003, and the region saw peace till 2017-18. However, he admitted that India’s adversaries have been actively abetting terrorism and encouraging “proxy tanzeems (groups with a common objective)” in this area, even as the situation in the Kashmir Valley was getting back to normal.\nWhile there were three attacks each in the Jammu region against security forces in 2022 and 2023, six attacks have been recorded so far this year.\n\nSignificantly, six security force personnel were killed in separate attacks in 2022. This increased to 21 last year, and stands at 11 this year. Five militants have been killed in the region so far this year. In 2023, this figure was 20, and in 2022, 14 militants were killed. Eleven civilians have also lost their lives in the attacks this year.\n\nThe Indian Express spoke to defence and security sources as well as J&K Police officers to understand the reasons for this surge in violence. They pointed to a few possible factors.\n\n🔴 With peace lasting for several years, and the Valley being more active, some amount of complacency may have crept into the counter-insurgency mindset of the forces deployed in Jammu division, leading to inadequate number of proactive operations.\n\n“The level of alertness in the Valley has remained higher, both in terms of military preparedness and mental anticipation of likely militant actions,” an official said. “Counter-insurgency forces have their drills fine-tuned for all operational tasks, such as patrolling, ambush and even routine activities like convoy movement. Even minor slippages in the drills have been known to cause major losses,” the official said.\n\nMoreover, the troop reduction in the region with the movement of forces to the Line of Actual Control in 2021 led to an increased area of responsibility for each battalion, contributing to an increased revisit time by every patrol. It is understood that around 4,000 to 5,000 troops, mostly involved in counter-terror duties, were moved out of the area in 2021.\n\n🔴 The recent attacks westwards of Jammu in the Kathua-Samba region also point towards another trend – of carrying out attacks close to the International Border. “Unlike Rajouri and Poonch, these areas, even though part of Jammu region, come under the Army Western Command, which does not undertake counter-terror operations,” an official said.\n\nThe official added that while additional troops may be deployed in the region in the days to come from peacetime locations, they will first need to be trained and will need a familiarisation period.\n\nSources in the state police too said that Jammu has been made the new theatre of operations against security forces by militant outfits as a planned strategy. “After the changes to J&K’s constitutional status in 2019, the Valley settled into a quieter state and then Galwan (Eastern Ladakh) flared up in 2020. After that, attacks began more frequently in Jammu. So there’s three fronts open for the forces, including Kashmir,” the source said.\n\nAdditionally, sources said, “infiltration along the IB is comparatively easier than the LoC”. The attacks, police sources said, are being led by cadres of the Jaish-e-Mohammad and the Lashkar-e-Taiba.\n\nAfter 2007, when militancy ebbed in the Jammu region, deployment patterns changed, and in the last few years, “thin deployment led to some gaps geographically and subsequently to poor intelligence”, officials said. They emphasised that border management is key to handling the increased militant activity in the region, while “also remaining cautious in the Valley, since the shifting focus on Jammu allows militant outfits to regroup in Kashmir”.\n\n🔴 A top security official also pointed out that with increased dependence on technology, there is a likelihood of a reduced ground connect, which has been known to deliver the best operational intelligence. As a result, there may be efforts soon to “reorient the operational philosophy to basic source counter-insurgency operations”, sources said.\n\n“Lack of adequate ground-level intelligence and hardened and motivated terrorists with meticulous planning are major contributing factors,” an official said.\n\nSources in the J&K Police too linked the uptick in incidents of terror violence in Jammu to a lack of “human intelligence” feeding security forces. And while “that is changing, developing these networks will take time”, they said.\n\nOfficials also said that nearly all the attacks in the Jammu region have been carried out by foreign terrorists. “They are mainly using Kathua and parts of Samba to infiltrate into Indian territory and carry out these attacks using the dense forest cover. What would be most useful here is human intelligence and that has been lacking in Jammu for the last few years,” a senior security official said.\n\nOfficials further said that “motivational incentives” for the forces, such as “promotion of SPOs to constables”, are on the “back-burner due to centralisation of powers in the police”, which can further reduce incentives for developing human intelligence.\n\n🔴 Officials also said militants are bringing sophisticated equipment such as night-vision glasses and M4 rifles. Plus, there have also been increased instances of narco-terrorism, facilitated both by people and drones, generating adequate funds for distribution to locals and to fund terror activities. Several drones transporting drugs, explosives, weapons and money have been caught in the region by security forces in the last few years.\n\nAn increased inflow of funds can enhance the network of overground workers (OWGs), officials said."
    ],
    "cleaned_text": "explains surge terror attacks jammu three attacks jammu region security forces six attacks recorded far year ",
    "cleaned_title": "explains surge terror attacks jammu",
    "cleaned_selftext": "three attacks jammu region security forces six attacks recorded far year",
    "cleaned_comments": "latest encounter jammu kashmirs doda district laid bare gaps security infrastructure belt saw long stretches peace recent years since areas south pir panjal range including poonch rajouri jammu seen surge highintensity terror targeting security forces civilians january former army chief general manoj pande acknowledged terrorism area brought control region saw peace till however admitted indias adversaries actively abetting terrorism encouraging proxy tanzeems groups common objective area even situation kashmir valley getting back normal three attacks jammu region security forces six attacks recorded far year significantly six security force personnel killed separate attacks increased last year stands year five militants killed region far year figure militants killed eleven civilians also lost lives attacks year indian express spoke defence security sources well jk police officers understand reasons surge violence pointed possible factors peace lasting several years valley active amount complacency may crept counterinsurgency mindset forces deployed jammu division leading inadequate number proactive operations level alertness valley remained higher terms military preparedness mental anticipation likely militant actions official said counterinsurgency forces drills finetuned operational tasks patrolling ambush even routine activities like convoy movement even minor slippages drills known cause major losses official said moreover troop reduction region movement forces line actual control led increased area responsibility battalion contributing increased revisit time every patrol understood around troops mostly involved counterterror duties moved area recent attacks westwards jammu kathuasamba region also point towards another trend carrying attacks close international border unlike rajouri poonch areas even though part jammu region come army western command undertake counterterror operations official said official added additional troops may deployed region days come peacetime locations first need trained need familiarisation period sources state police said jammu made new theatre operations security forces militant outfits planned strategy changes jks constitutional status valley settled quieter state galwan eastern ladakh flared attacks began frequently jammu theres three fronts open forces including kashmir source said additionally sources said infiltration along ib comparatively easier loc attacks police sources said led cadres jaishemohammad lashkaretaiba militancy ebbed jammu region deployment patterns changed last years thin deployment led gaps geographically subsequently poor intelligence officials said emphasised border management key handling increased militant activity region also remaining cautious valley since shifting focus jammu allows militant outfits regroup kashmir top security official also pointed increased dependence technology likelihood reduced ground connect known deliver best operational intelligence result may efforts soon reorient operational philosophy basic source counterinsurgency operations sources said lack adequate groundlevel intelligence hardened motivated terrorists meticulous planning major contributing factors official said sources jk police linked uptick incidents terror violence jammu lack human intelligence feeding security forces changing developing networks take time said officials also said nearly attacks jammu region carried foreign terrorists mainly using kathua parts samba infiltrate indian territory carry attacks using dense forest cover would useful human intelligence lacking jammu last years senior security official said officials said motivational incentives forces promotion spos constables backburner due centralisation powers police reduce incentives developing human intelligence officials also said militants bringing sophisticated equipment nightvision glasses rifles plus also increased instances narcoterrorism facilitated people drones generating adequate funds distribution locals fund terror activities several drones transporting drugs explosives weapons money caught region security forces last years increased inflow funds enhance network overground workers owgs officials said",
    "light_cleaned_title": "What explains the surge in terror attacks in Jammu?",
    "light_cleaned_selftext": "While there were three attacks each in Jammu region against security forces in 2022 and 2023, six attacks have been recorded so far this year.",
    "light_cleaned_comments": "The latest encounter in Jammu and Kashmir’s Doda district has once again laid bare the gaps in the security infrastructure of a belt that saw long stretches of peace until recent years. Since 2021, areas south of the Pir Panjal range, including Poonch, Rajouri and Jammu, have seen a surge in high-intensity terror targeting security forces and civilians. In January, former Army Chief General Manoj Pande acknowledged that terrorism in that area had been brought under control by 2003, and the region saw peace till 2017-18. However, he admitted that India’s adversaries have been actively abetting terrorism and encouraging “proxy tanzeems (groups with a common objective)” in this area, even as the situation in the Kashmir Valley was getting back to normal. While there were three attacks each in the Jammu region against security forces in 2022 and 2023, six attacks have been recorded so far this year. Significantly, six security force personnel were killed in separate attacks in 2022. This increased to 21 last year, and stands at 11 this year. Five militants have been killed in the region so far this year. In 2023, this figure was 20, and in 2022, 14 militants were killed. Eleven civilians have also lost their lives in the attacks this year. The Indian Express spoke to defence and security sources as well as J&K Police officers to understand the reasons for this surge in violence. They pointed to a few possible factors. 🔴 With peace lasting for several years, and the Valley being more active, some amount of complacency may have crept into the counter-insurgency mindset of the forces deployed in Jammu division, leading to inadequate number of proactive operations. “The level of alertness in the Valley has remained higher, both in terms of military preparedness and mental anticipation of likely militant actions,” an official said. “Counter-insurgency forces have their drills fine-tuned for all operational tasks, such as patrolling, ambush and even routine activities like convoy movement. Even minor slippages in the drills have been known to cause major losses,” the official said. Moreover, the troop reduction in the region with the movement of forces to the Line of Actual Control in 2021 led to an increased area of responsibility for each battalion, contributing to an increased revisit time by every patrol. It is understood that around 4,000 to 5,000 troops, mostly involved in counter-terror duties, were moved out of the area in 2021. 🔴 The recent attacks westwards of Jammu in the Kathua-Samba region also point towards another trend – of carrying out attacks close to the International Border. “Unlike Rajouri and Poonch, these areas, even though part of Jammu region, come under the Army Western Command, which does not undertake counter-terror operations,” an official said. The official added that while additional troops may be deployed in the region in the days to come from peacetime locations, they will first need to be trained and will need a familiarisation period. Sources in the state police too said that Jammu has been made the new theatre of operations against security forces by militant outfits as a planned strategy. “After the changes to J&K’s constitutional status in 2019, the Valley settled into a quieter state and then Galwan (Eastern Ladakh) flared up in 2020. After that, attacks began more frequently in Jammu. So there’s three fronts open for the forces, including Kashmir,” the source said. Additionally, sources said, “infiltration along the IB is comparatively easier than the LoC”. The attacks, police sources said, are being led by cadres of the Jaish-e-Mohammad and the Lashkar-e-Taiba. After 2007, when militancy ebbed in the Jammu region, deployment patterns changed, and in the last few years, “thin deployment led to some gaps geographically and subsequently to poor intelligence”, officials said. They emphasised that border management is key to handling the increased militant activity in the region, while “also remaining cautious in the Valley, since the shifting focus on Jammu allows militant outfits to regroup in Kashmir”. 🔴 A top security official also pointed out that with increased dependence on technology, there is a likelihood of a reduced ground connect, which has been known to deliver the best operational intelligence. As a result, there may be efforts soon to “reorient the operational philosophy to basic source counter-insurgency operations”, sources said. “Lack of adequate ground-level intelligence and hardened and motivated terrorists with meticulous planning are major contributing factors,” an official said. Sources in the J&K Police too linked the uptick in incidents of terror violence in Jammu to a lack of “human intelligence” feeding security forces. And while “that is changing, developing these networks will take time”, they said. Officials also said that nearly all the attacks in the Jammu region have been carried out by foreign terrorists. “They are mainly using Kathua and parts of Samba to infiltrate into Indian territory and carry out these attacks using the dense forest cover. What would be most useful here is human intelligence and that has been lacking in Jammu for the last few years,” a senior security official said. Officials further said that “motivational incentives” for the forces, such as “promotion of SPOs to constables”, are on the “back-burner due to centralisation of powers in the police”, which can further reduce incentives for developing human intelligence. 🔴 Officials also said militants are bringing sophisticated equipment such as night-vision glasses and M4 rifles. Plus, there have also been increased instances of narco-terrorism, facilitated both by people and drones, generating adequate funds for distribution to locals and to fund terror activities. Several drones transporting drugs, explosives, weapons and money have been caught in the region by security forces in the last few years. An increased inflow of funds can enhance the network of overground workers (OWGs), officials said."
}