{
    "id": "jstve0",
    "title": "Amendment to the Telecom Suspension Rules offers little protection against arbitrary and prolonged internet shutdowns #KeepUsOnline",
    "url": "https://www.reddit.com/r/india/comments/jstve0/amendment_to_the_telecom_suspension_rules_offers/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/vmvmlpuwzsy51.png?width=1024&amp;format=png&amp;auto=webp&amp;s=61b1f1a0272062239c32b21fc57232daf177e46c\n\n### Tl;dr\n\nThe central government recently amended the Telecom Suspension Rules 2017 to insert Rule 2A which specifies that an internet shutdown order can remain in operation for a maximum period of 15 days. This amendment represents a missed opportunity for wider reform because it fails to incorporate directions issued by the Supreme Court in *Anuradha Bhasin v. Union of India* requiring proactive publication of internet shutdown orders and periodic review by the Review Committee every seven working days. Further, the choice of 15 days as the appropriate length of time for the validity of a suspension order will limit the utility of the recent amendment since most internet shutdowns do not last 15 days. Finally, the amendment was notified without any public consultation and the  government cannot shirk its duty to comprehensively evaluate and reform the legal framework for internet shutdowns by implementing such cosmetic changes.\n\n### What is the legal procedure for ordering internet shutdowns?\n\nOn 10 November 2020, the Central Government issued a [**gazette notification**](https://www.livelaw.in/pdf_upload/pdf_upload-384462.pdf) inserting Rule 2A into the Temporary Suspension of Telecom Services (Public Emergency or Public Safety) Rules, 2017. The newly inserted Rule 2A states that *“the suspension order issued by the competent authority under sub-rule (1) shall not be in operation for more than fifteen days.”* Before we analyse the impact of this amendment, we must first understand the legal framework for internet shutdowns in India. Prior to 2017, internet shutdowns were routinely ordered by District Magistrates under Section 144, Code of Criminal Procedure 1973. However, as the Supreme Court has noted in [***Anuradha Bhasin v. Union of India***](https://indiankanoon.org/doc/82461587/), the legal position changed after the Telecom Suspension Rules were notified in 2017 and “*with the promulgation of the Suspension Rules, the States are using the aforesaid Rules to restrict telecom services including access to the internet.”*\n\nUnder Rule 2(1) of the [**Telecom Suspension Rules**](https://dot.gov.in/sites/default/files/Suspension%20Rules.pdf), an internet shutdown order should be issued by the Home Secretary of the central or state government. Under Rule 2(6) of the Telecom Suspension Rules, the central or state level Review Committee is required to review internet shutdown orders issued by the Home Secretary within five working days and determine whether the orders demonstrate a ‘public emergency’ or threat to ‘public safety’ under Section 5(2) of the Indian Telegraph Act, 1885. These limited procedural safeguards present in the text of the Telecom Suspension Rules were found to be inadequate by the Supreme Court in *Anuradha Bhasin v. Union of India,* and additional requirements were read into the Rules by the judiciary to perform a gap filling role till the legislature stepped in. In particular, the Supreme Court issued directions requiring (a) proactive publication, (b) time limitation and (c) periodic review of internet shutdown orders.\n\n[\\[Extracts from judgement in Anuradha Bhasin v. Union of India\\]](https://preview.redd.it/g3e2wyj20ty51.png?width=1136&amp;format=png&amp;auto=webp&amp;s=f3b7f81151f77bcf60f387b596bdd8a896e274f3)\n\nThe final position which emerges upon reading Rule 2(6) of the Telecom Suspension Rules with the judgement of the Supreme Court in *Anuradha Bhasin v. Union of India* is that an internet shutdown order must be reviewed by the Review Committee within five working days of its issuance and it should subsequently be reviewed every seven working days from the date of the last review. With insertion of Rule 2A, this would mean that each internet shutdown order should be reviewed only once by the Review Committee during its 15 day life span. For instance, if an internet shutdown order was issued today i.e. 12 November 2020, it could only remain in operation till 26 November 2020 (15 days time limit under Rule 2A). If we assume Saturday and Sunday to be non-working days, the order would have to be reviewed by the Review Committee but only once on 18 November 2020 (first review within five working days under Rule 2(6)) since the second review would be due on 27 November (periodic review after every seven working days of last review as per *Anuradha Bhasin v. Union of India*) by when the order would have expired.\n\n### Amendment represents missed opportunity for wider reform\n\nBy limiting the duration of each suspension order to 15 days, the recent amendment provides statutory recognition to the Supreme Court’s direction that internet shutdowns must be temporary only and any indefinite suspension of telecom services is not permissible under the law. However, the amendment fails to incorporate other directions issued by the Supreme Court requiring proactive publication of internet shutdown orders and periodic review by the Review Committee every seven working days from the date of the last review.\n\n**(i) Fails to promote compliance with** ***Anuradha Bhasin v. Union of India***  \nAs we have [**uncovered** ](https://internetfreedom.in/rti-responses-from-andhra-pradesh-and-gujarat-show-compliance-failure-with-the-anuradha-bhasin-internet-shutdown-decision/)through the RTI Act, compliance by state governments with the judgment of the Supreme Court in *Anuradha Bhasin v. Union of India* remains low. For instance, several state governments have imposed internet shutdowns in 2020 without publishing the underlying orders and they have even refused to provide this information in response to RTI applications. Therefore, the recent amendment represents a missed opportunity to incorporate proactive publication and periodic review as a mandatory duty within the text of the Telecom Suspension Rules which would have increased awareness about these judicially introduced requirements and boosted compliance by state governments.\n\n**(ii) Adopts prolonged internet shutdowns as the baseline**  \nThe choice of 15 days as the appropriate length of time for the validity of an internet shutdown order will limit the utility of the recent amendment. While regions like Jammu &amp; Kashmir and Darjeeling, West Bengal have experienced very prolonged restrictions, most internet shutdowns in India do not last for 15 days. Therefore, the amendment appears to have been drafted using extreme cases as the baseline and it will not create any additional obligations for government authorities in the vast majority of cases. Even in regions like Jammu &amp; Kashmir, the amendment may lead to a nominal increase in paperwork for government officials who will have to issue orders more frequently to extend the ongoing internet shutdown but it does not prevent the government from routinely issuing boilerplate orders every 15 days.\n\n**(iii) Lack of stakeholder consultation and public participation**  \nWhile reform of the Telecom Suspension Rules is undoubtedly necessary, such an exercise will not be meaningful unless it is preceded by stakeholder engagement and public consultation. On 06 February 2020, the Minister of State for Communications had stated in Rajya Sabha that the central government will review the Telecom Suspension Rules and conduct stakeholder consultation in view of the Supreme Court’s observations in *Anuradha Bhasin v. Union of India.* Earlier this year, IFF had also [**written**](https://internetfreedom.in/cant-drop-the-ball-on-internet-shutdown-reform/) to the Department of Telecommunications and Ministry of Parliamentary Affairs to follow up on this assurance and urged the government to commence the public consultation process for review of the Telecom Suspension Rules. However, till date, this promise has not been fulfilled and Rule 2A was unilaterally inserted into Telecom Suspension Rules without any stakeholder consultation or public participation.\n\nIn conclusion, the recent amendments to the Telecom Suspension Rules may be characterized as a bandaid applied on a bullet wound which does little to prevent the patient from bleeding out. The central government cannot shirk its duty to comprehensively evaluate and reform the legal framework for internet shutdowns by implementing such cosmetic changes. Most importantly, any credible legal reform process should involve public consultation and it must also address wider problems such as economic damage caused by internet shutdowns and the ineffectiveness of internet shutdowns at preventing violence.\n\n### Important Links\n\n1. Gazette notification dated 10.11.2020 issued by DoT amending Telecom Suspension Rules ([**link**](https://www.livelaw.in/pdf_upload/pdf_upload-384462.pdf))\n2. Judgement of the Supreme Court in Anuradha Bhasin v. Union of India dated 10.01.2020 ([**link**](https://indiankanoon.org/doc/82461587/))\n3. Previous post titled ‘RTI responses from Andhra Pradesh and Gujarat show compliance failure with the Anuradha Bhasin Internet Shutdown decision’ dated 10.11.2020 ([**link**](https://internetfreedom.in/rti-responses-from-andhra-pradesh-and-gujarat-show-compliance-failure-with-the-anuradha-bhasin-internet-shutdown-decision/))\n4. Previous post titled ‘Can’t Drop the Ball on Internet Shutdown Reform’ dated 04.04.2020 ([**link**](https://internetfreedom.in/cant-drop-the-ball-on-internet-shutdown-reform/))\n\n **You can support our work by clicking here:**  [**internetfreedom.in/donate/**](https://t.co/HYJIJBrVN5)",
    "flair": "Policy/Economy",
    "score": 174,
    "num_comments": 16,
    "created_utc": 1605184613,
    "convurl": "https://a.thumbs.redditmedia.com/9Jwd6-vuLgoqfSmrqdmExkvghJf4m92YrcsY6Wvwm50.jpg",
    "comments": [
        "Can someone ELI5?",
        "The government can easily shut down internet if it feels “necessary”",
        "Yeah we're screwed.",
        "And I thought things couldn't get any worse.",
        "Why?",
        "Hmm let's see.What really happens when you put the power to see and gather information from around  the world solely in the hands of a central government?",
        "Okay. I'll wait.",
        "Eh. People should just get those satellite mod covers for their android or apple phones! #ProblemSolved! Bunch of old dudes trying to out think me on tech! Bro i was born holding a remote!",
        "You'll what? How's that even a reply.",
        "Thanks for making me smile. Our future is secure af. :) Keep it up.",
        "I don't think they will do it anytime soon, sepcially considering the pandemic, because most of us are doing our work/studies online.\n\nBut still, who knows",
        "Mayteras said Hmm let's see. To which I said okay, I'll wait. Which meant I'll wait to see what happens, when it does happen.  Does the sentence have to be written out in detail to convey a simple point? Y'all are talking about fictional scenarios where the Govt. will be able to control the internet all over the country. I decided to entertain the impending sense of doom Mayteras was trying to portray.",
        "What are satelite mod covers dude?",
        "It’s a dongle type device (phone cover) that makes phone satellite capable! Also! Google is your friend!",
        "Thanks man for the info"
    ],
    "cleaned_text": "amendment telecom suspension rules offers little protection arbitrary prolonged internet shutdowns keepusonline ampxb tldr central government recently amended telecom suspension rules insert rule specifies internet shutdown order remain operation maximum period days amendment represents missed opportunity wider reform fails incorporate directions issued supreme court anuradha bhasin v union india requiring proactive publication internet shutdown orders periodic review review committee every seven working days choice days appropriate length time validity suspension order limit utility recent amendment since internet shutdowns last days finally amendment notified without public consultation government shirk duty comprehensively evaluate reform legal framework internet shutdowns implementing cosmetic changes legal procedure ordering internet shutdowns november central government issued gazette notificationhttpswwwlivelawinpdfuploadpdfuploadpdf inserting rule temporary suspension telecom services public emergency public safety rules newly inserted rule states suspension order issued competent authority subrule shall operation fifteen days analyse impact amendment must first understand legal framework internet shutdowns india prior internet shutdowns routinely ordered district magistrates section code criminal procedure however supreme court noted anuradha bhasin v union indiahttpsindiankanoonorgdoc legal position changed telecom suspension rules notified promulgation suspension rules states using aforesaid rules restrict telecom services including access internet rule telecom suspension ruleshttpsdotgovinsitesdefaultfilessuspensionrulespdf internet shutdown order issued home secretary central state government rule telecom suspension rules central state level review committee required review internet shutdown orders issued home secretary within five working days determine whether orders demonstrate public emergency threat public safety section indian telegraph act limited procedural safeguards present text telecom suspension rules found inadequate supreme court anuradha bhasin v union india additional requirements read rules judiciary perform gap filling role till legislature stepped particular supreme court issued directions requiring proactive publication b time limitation c periodic review internet shutdown orders extracts judgement anuradha bhasin v union indiahttpspreviewredditgewyjtypngwidthampformatpngampautowebpampsfbffbcffbbddaef final position emerges upon reading rule telecom suspension rules judgement supreme court anuradha bhasin v union india internet shutdown order must reviewed review committee within five working days issuance subsequently reviewed every seven working days date last review insertion rule would mean internet shutdown order reviewed review committee day life span instance internet shutdown order issued today ie november could remain operation till november days time limit rule assume saturday sunday nonworking days order would reviewed review committee november first review within five working days rule since second review would due november periodic review every seven working days last review per anuradha bhasin v union india order would expired amendment represents missed opportunity wider reform limiting duration suspension order days recent amendment provides statutory recognition supreme courts direction internet shutdowns must temporary indefinite suspension telecom services permissible law however amendment fails incorporate directions issued supreme court requiring proactive publication internet shutdown orders periodic review review committee every seven working days date last review fails promote compliance anuradha bhasin v union india uncovered httpsinternetfreedominrtiresponsesfromandhrapradeshandgujaratshowcompliancefailurewiththeanuradhabhasininternetshutdowndecisionthrough rti act compliance state governments judgment supreme court anuradha bhasin v union india remains low instance several state governments imposed internet shutdowns without publishing underlying orders even refused provide information response rti applications therefore recent amendment represents missed opportunity incorporate proactive publication periodic review mandatory duty within text telecom suspension rules would increased awareness judicially introduced requirements boosted compliance state governments ii adopts prolonged internet shutdowns baseline choice days appropriate length time validity internet shutdown order limit utility recent amendment regions like jammu amp kashmir darjeeling west bengal experienced prolonged restrictions internet shutdowns india last days therefore amendment appears drafted using extreme cases baseline create additional obligations government authorities vast majority cases even regions like jammu amp kashmir amendment may lead nominal increase paperwork government officials issue orders frequently extend ongoing internet shutdown prevent government routinely issuing boilerplate orders every days iii lack stakeholder consultation public participation reform telecom suspension rules undoubtedly necessary exercise meaningful unless preceded stakeholder engagement public consultation february minister state communications stated rajya sabha central government review telecom suspension rules conduct stakeholder consultation view supreme courts observations anuradha bhasin v union india earlier year iff also writtenhttpsinternetfreedomincantdroptheballoninternetshutdownreform department telecommunications ministry parliamentary affairs follow assurance urged government commence public consultation process review telecom suspension rules however till date promise fulfilled rule unilaterally inserted telecom suspension rules without stakeholder consultation public participation conclusion recent amendments telecom suspension rules may characterized bandaid applied bullet wound little prevent patient bleeding central government shirk duty comprehensively evaluate reform legal framework internet shutdowns implementing cosmetic changes importantly credible legal reform process involve public consultation must also address wider problems economic damage caused internet shutdowns ineffectiveness internet shutdowns preventing violence important links gazette notification dated issued dot amending telecom suspension rules linkhttpswwwlivelawinpdfuploadpdfuploadpdf judgement supreme court anuradha bhasin v union india dated linkhttpsindiankanoonorgdoc previous post titled rti responses andhra pradesh gujarat show compliance failure anuradha bhasin internet shutdown decision dated linkhttpsinternetfreedominrtiresponsesfromandhrapradeshandgujaratshowcompliancefailurewiththeanuradhabhasininternetshutdowndecision previous post titled cant drop ball internet shutdown reform dated linkhttpsinternetfreedomincantdroptheballoninternetshutdownreform support work clicking internetfreedomindonatehttpstcohyjijbrvn ",
    "cleaned_title": "amendment telecom suspension rules offers little protection arbitrary prolonged internet shutdowns keepusonline",
    "cleaned_selftext": "ampxb tldr central government recently amended telecom suspension rules insert rule specifies internet shutdown order remain operation maximum period days amendment represents missed opportunity wider reform fails incorporate directions issued supreme court anuradha bhasin v union india requiring proactive publication internet shutdown orders periodic review review committee every seven working days choice days appropriate length time validity suspension order limit utility recent amendment since internet shutdowns last days finally amendment notified without public consultation government shirk duty comprehensively evaluate reform legal framework internet shutdowns implementing cosmetic changes legal procedure ordering internet shutdowns november central government issued gazette notificationhttpswwwlivelawinpdfuploadpdfuploadpdf inserting rule temporary suspension telecom services public emergency public safety rules newly inserted rule states suspension order issued competent authority subrule shall operation fifteen days analyse impact amendment must first understand legal framework internet shutdowns india prior internet shutdowns routinely ordered district magistrates section code criminal procedure however supreme court noted anuradha bhasin v union indiahttpsindiankanoonorgdoc legal position changed telecom suspension rules notified promulgation suspension rules states using aforesaid rules restrict telecom services including access internet rule telecom suspension ruleshttpsdotgovinsitesdefaultfilessuspensionrulespdf internet shutdown order issued home secretary central state government rule telecom suspension rules central state level review committee required review internet shutdown orders issued home secretary within five working days determine whether orders demonstrate public emergency threat public safety section indian telegraph act limited procedural safeguards present text telecom suspension rules found inadequate supreme court anuradha bhasin v union india additional requirements read rules judiciary perform gap filling role till legislature stepped particular supreme court issued directions requiring proactive publication b time limitation c periodic review internet shutdown orders extracts judgement anuradha bhasin v union indiahttpspreviewredditgewyjtypngwidthampformatpngampautowebpampsfbffbcffbbddaef final position emerges upon reading rule telecom suspension rules judgement supreme court anuradha bhasin v union india internet shutdown order must reviewed review committee within five working days issuance subsequently reviewed every seven working days date last review insertion rule would mean internet shutdown order reviewed review committee day life span instance internet shutdown order issued today ie november could remain operation till november days time limit rule assume saturday sunday nonworking days order would reviewed review committee november first review within five working days rule since second review would due november periodic review every seven working days last review per anuradha bhasin v union india order would expired amendment represents missed opportunity wider reform limiting duration suspension order days recent amendment provides statutory recognition supreme courts direction internet shutdowns must temporary indefinite suspension telecom services permissible law however amendment fails incorporate directions issued supreme court requiring proactive publication internet shutdown orders periodic review review committee every seven working days date last review fails promote compliance anuradha bhasin v union india uncovered httpsinternetfreedominrtiresponsesfromandhrapradeshandgujaratshowcompliancefailurewiththeanuradhabhasininternetshutdowndecisionthrough rti act compliance state governments judgment supreme court anuradha bhasin v union india remains low instance several state governments imposed internet shutdowns without publishing underlying orders even refused provide information response rti applications therefore recent amendment represents missed opportunity incorporate proactive publication periodic review mandatory duty within text telecom suspension rules would increased awareness judicially introduced requirements boosted compliance state governments ii adopts prolonged internet shutdowns baseline choice days appropriate length time validity internet shutdown order limit utility recent amendment regions like jammu amp kashmir darjeeling west bengal experienced prolonged restrictions internet shutdowns india last days therefore amendment appears drafted using extreme cases baseline create additional obligations government authorities vast majority cases even regions like jammu amp kashmir amendment may lead nominal increase paperwork government officials issue orders frequently extend ongoing internet shutdown prevent government routinely issuing boilerplate orders every days iii lack stakeholder consultation public participation reform telecom suspension rules undoubtedly necessary exercise meaningful unless preceded stakeholder engagement public consultation february minister state communications stated rajya sabha central government review telecom suspension rules conduct stakeholder consultation view supreme courts observations anuradha bhasin v union india earlier year iff also writtenhttpsinternetfreedomincantdroptheballoninternetshutdownreform department telecommunications ministry parliamentary affairs follow assurance urged government commence public consultation process review telecom suspension rules however till date promise fulfilled rule unilaterally inserted telecom suspension rules without stakeholder consultation public participation conclusion recent amendments telecom suspension rules may characterized bandaid applied bullet wound little prevent patient bleeding central government shirk duty comprehensively evaluate reform legal framework internet shutdowns implementing cosmetic changes importantly credible legal reform process involve public consultation must also address wider problems economic damage caused internet shutdowns ineffectiveness internet shutdowns preventing violence important links gazette notification dated issued dot amending telecom suspension rules linkhttpswwwlivelawinpdfuploadpdfuploadpdf judgement supreme court anuradha bhasin v union india dated linkhttpsindiankanoonorgdoc previous post titled rti responses andhra pradesh gujarat show compliance failure anuradha bhasin internet shutdown decision dated linkhttpsinternetfreedominrtiresponsesfromandhrapradeshandgujaratshowcompliancefailurewiththeanuradhabhasininternetshutdowndecision previous post titled cant drop ball internet shutdown reform dated linkhttpsinternetfreedomincantdroptheballoninternetshutdownreform support work clicking internetfreedomindonatehttpstcohyjijbrvn",
    "cleaned_comments": "someone eli government easily shut internet feels necessary yeah screwed thought things couldnt get worse hmm lets seewhat really happens put power see gather information around world solely hands central government okay ill wait eh people get satellite mod covers android apple phones problemsolved bunch old dudes trying think tech bro born holding remote youll hows even reply thanks making smile future secure af keep dont think anytime soon sepcially considering pandemic us workstudies online still knows mayteras said hmm lets see said okay ill wait meant ill wait see happens happen sentence written detail convey simple point yall talking fictional scenarios govt able control internet country decided entertain impending sense doom mayteras trying portray satelite mod covers dude dongle type device phone cover makes phone satellite capable also google friend thanks man info",
    "light_cleaned_title": "Amendment to the Telecom Suspension Rules offers little protection against arbitrary and prolonged internet shutdowns #KeepUsOnline",
    "light_cleaned_selftext": "### Tl;dr The central government recently amended the Telecom Suspension Rules 2017 to insert Rule 2A which specifies that an internet shutdown order can remain in operation for a maximum period of 15 days. This amendment represents a missed opportunity for wider reform because it fails to incorporate directions issued by the Supreme Court in *Anuradha Bhasin v. Union of India* requiring proactive publication of internet shutdown orders and periodic review by the Review Committee every seven working days. Further, the choice of 15 days as the appropriate length of time for the validity of a suspension order will limit the utility of the recent amendment since most internet shutdowns do not last 15 days. Finally, the amendment was notified without any public consultation and the government cannot shirk its duty to comprehensively evaluate and reform the legal framework for internet shutdowns by implementing such cosmetic changes. ### What is the legal procedure for ordering internet shutdowns? On 10 November 2020, the Central Government issued a [**gazette notification**](https://www.livelaw.in/pdf_upload/pdf_upload-384462.pdf) inserting Rule 2A into the Temporary Suspension of Telecom Services (Public Emergency or Public Safety) Rules, 2017. The newly inserted Rule 2A states that *“the suspension order issued by the competent authority under sub-rule (1) shall not be in operation for more than fifteen days.”* Before we analyse the impact of this amendment, we must first understand the legal framework for internet shutdowns in India. Prior to 2017, internet shutdowns were routinely ordered by District Magistrates under Section 144, Code of Criminal Procedure 1973. However, as the Supreme Court has noted in [***Anuradha Bhasin v. Union of India***](https://indiankanoon.org/doc/82461587/), the legal position changed after the Telecom Suspension Rules were notified in 2017 and “*with the promulgation of the Suspension Rules, the States are using the aforesaid Rules to restrict telecom services including access to the internet.”* Under Rule 2(1) of the [**Telecom Suspension Rules**](https://dot.gov.in/sites/default/files/Suspension%20Rules.pdf), an internet shutdown order should be issued by the Home Secretary of the central or state government. Under Rule 2(6) of the Telecom Suspension Rules, the central or state level Review Committee is required to review internet shutdown orders issued by the Home Secretary within five working days and determine whether the orders demonstrate a ‘public emergency’ or threat to ‘public safety’ under Section 5(2) of the Indian Telegraph Act, 1885. These limited procedural safeguards present in the text of the Telecom Suspension Rules were found to be inadequate by the Supreme Court in *Anuradha Bhasin v. Union of India,* and additional requirements were read into the Rules by the judiciary to perform a gap filling role till the legislature stepped in. In particular, the Supreme Court issued directions requiring (a) proactive publication, (b) time limitation and (c) periodic review of internet shutdown orders. [\\[Extracts from judgement in Anuradha Bhasin v. Union of India\\]](https://preview.redd.it/g3e2wyj20ty51.png?width=1136&amp;format=png&amp;auto=webp&amp;s=f3b7f81151f77bcf60f387b596bdd8a896e274f3) The final position which emerges upon reading Rule 2(6) of the Telecom Suspension Rules with the judgement of the Supreme Court in *Anuradha Bhasin v. Union of India* is that an internet shutdown order must be reviewed by the Review Committee within five working days of its issuance and it should subsequently be reviewed every seven working days from the date of the last review. With insertion of Rule 2A, this would mean that each internet shutdown order should be reviewed only once by the Review Committee during its 15 day life span. For instance, if an internet shutdown order was issued today i.e. 12 November 2020, it could only remain in operation till 26 November 2020 (15 days time limit under Rule 2A). If we assume Saturday and Sunday to be non-working days, the order would have to be reviewed by the Review Committee but only once on 18 November 2020 (first review within five working days under Rule 2(6)) since the second review would be due on 27 November (periodic review after every seven working days of last review as per *Anuradha Bhasin v. Union of India*) by when the order would have expired. ### Amendment represents missed opportunity for wider reform By limiting the duration of each suspension order to 15 days, the recent amendment provides statutory recognition to the Supreme Court’s direction that internet shutdowns must be temporary only and any indefinite suspension of telecom services is not permissible under the law. However, the amendment fails to incorporate other directions issued by the Supreme Court requiring proactive publication of internet shutdown orders and periodic review by the Review Committee every seven working days from the date of the last review. **(i) Fails to promote compliance with** ***Anuradha Bhasin v. Union of India*** As we have [**uncovered** ](https://internetfreedom.in/rti-responses-from-andhra-pradesh-and-gujarat-show-compliance-failure-with-the-anuradha-bhasin-internet-shutdown-decision/)through the RTI Act, compliance by state governments with the judgment of the Supreme Court in *Anuradha Bhasin v. Union of India* remains low. For instance, several state governments have imposed internet shutdowns in 2020 without publishing the underlying orders and they have even refused to provide this information in response to RTI applications. Therefore, the recent amendment represents a missed opportunity to incorporate proactive publication and periodic review as a mandatory duty within the text of the Telecom Suspension Rules which would have increased awareness about these judicially introduced requirements and boosted compliance by state governments. **(ii) Adopts prolonged internet shutdowns as the baseline** The choice of 15 days as the appropriate length of time for the validity of an internet shutdown order will limit the utility of the recent amendment. While regions like Jammu &amp; Kashmir and Darjeeling, West Bengal have experienced very prolonged restrictions, most internet shutdowns in India do not last for 15 days. Therefore, the amendment appears to have been drafted using extreme cases as the baseline and it will not create any additional obligations for government authorities in the vast majority of cases. Even in regions like Jammu &amp; Kashmir, the amendment may lead to a nominal increase in paperwork for government officials who will have to issue orders more frequently to extend the ongoing internet shutdown but it does not prevent the government from routinely issuing boilerplate orders every 15 days. **(iii) Lack of stakeholder consultation and public participation** While reform of the Telecom Suspension Rules is undoubtedly necessary, such an exercise will not be meaningful unless it is preceded by stakeholder engagement and public consultation. On 06 February 2020, the Minister of State for Communications had stated in Rajya Sabha that the central government will review the Telecom Suspension Rules and conduct stakeholder consultation in view of the Supreme Court’s observations in *Anuradha Bhasin v. Union of India.* Earlier this year, IFF had also [**written**](https://internetfreedom.in/cant-drop-the-ball-on-internet-shutdown-reform/) to the Department of Telecommunications and Ministry of Parliamentary Affairs to follow up on this assurance and urged the government to commence the public consultation process for review of the Telecom Suspension Rules. However, till date, this promise has not been fulfilled and Rule 2A was unilaterally inserted into Telecom Suspension Rules without any stakeholder consultation or public participation. In conclusion, the recent amendments to the Telecom Suspension Rules may be characterized as a bandaid applied on a bullet wound which does little to prevent the patient from bleeding out. The central government cannot shirk its duty to comprehensively evaluate and reform the legal framework for internet shutdowns by implementing such cosmetic changes. Most importantly, any credible legal reform process should involve public consultation and it must also address wider problems such as economic damage caused by internet shutdowns and the ineffectiveness of internet shutdowns at preventing violence. ### Important Links 1. Gazette notification dated 10.11.2020 issued by DoT amending Telecom Suspension Rules ([**link**](https://www.livelaw.in/pdf_upload/pdf_upload-384462.pdf)) 2. Judgement of the Supreme Court in Anuradha Bhasin v. Union of India dated 10.01.2020 ([**link**](https://indiankanoon.org/doc/82461587/)) 3. Previous post titled ‘RTI responses from Andhra Pradesh and Gujarat show compliance failure with the Anuradha Bhasin Internet Shutdown decision’ dated 10.11.2020 ([**link**](https://internetfreedom.in/rti-responses-from-andhra-pradesh-and-gujarat-show-compliance-failure-with-the-anuradha-bhasin-internet-shutdown-decision/)) 4. Previous post titled ‘Can’t Drop the Ball on Internet Shutdown Reform’ dated 04.04.2020 ([**link**](https://internetfreedom.in/cant-drop-the-ball-on-internet-shutdown-reform/)) **You can support our work by clicking here:** [**internetfreedom.in/donate/**](https://t.co/HYJIJBrVN5)",
    "light_cleaned_comments": "Can someone ELI5? The government can easily shut down internet if it feels “necessary” Yeah we're screwed. And I thought things couldn't get any worse. Why? Hmm let's see.What really happens when you put the power to see and gather information from around the world solely in the hands of a central government? Okay. I'll wait. Eh. People should just get those satellite mod covers for their android or apple phones! #ProblemSolved! Bunch of old dudes trying to out think me on tech! Bro i was born holding a remote! You'll what? How's that even a reply. Thanks for making me smile. Our future is secure af. :) Keep it up. I don't think they will do it anytime soon, sepcially considering the pandemic, because most of us are doing our work/studies online. But still, who knows Mayteras said Hmm let's see. To which I said okay, I'll wait. Which meant I'll wait to see what happens, when it does happen. Does the sentence have to be written out in detail to convey a simple point? Y'all are talking about fictional scenarios where the Govt. will be able to control the internet all over the country. I decided to entertain the impending sense of doom Mayteras was trying to portray. What are satelite mod covers dude? It’s a dongle type device (phone cover) that makes phone satellite capable! Also! Google is your friend! Thanks man for the info"
}