{
    "id": "1dxbj65",
    "title": "Mumbai hit-and-run case: Speeding BMW rams into bike in Worli, drags woman for 100 metres to death",
    "url": "https://indianexpress.com/article/cities/mumbai/mumbai-hit-run-case-speeding-bmw-bike-worli-drags-woman-death-9438067/",
    "selftext": "According to police sources, the vehicle is owned by a Palghar-based leader of a political party and his son was inside the car along with the driver.",
    "flair": "Crime",
    "score": 182,
    "num_comments": 18,
    "created_utc": 1720340056.0,
    "convurl": "https://external-preview.redd.it/hNJt8MooHhZzrBN502FlVFZ_q47x3nnyEgZnTVhWNkA.jpg?auto=webp&s=d569a8a56f3a5a827f677bcd2eb14ccbcb752f0c",
    "comments": [
        "A speeding BMW car rammed into the bike of a couple in Worli on Sunday, dragging the woman on the bonnet of the car for 100 metres, leading to her death and injuring her husband. The police said that they are on the lookout for the accused.\nThis comes at a time when there was huge uproar over a hit-and-run case involving a Porsche in Pune, where a 17-year-old minor had hit a motorcycle and killed two people.\nAccording to police sources, the vehicle is owned by a Palghar-based leader of a political party and his son was inside the car along with the driver. The cops further informed that the accident took place at around 5.30 am near Atria Mall.\nThe woman has been identified as Kaveri Nakhwa (45), a resident of Worli Koliwada, who was heading back along with her husband to sell fish after procuring it from Sassoon dock.\nThe car hit the couple’s scooter following which they lost balance and landed on the bonnet of the vehicle. The husband quickly jumped off but Kaveri couldn’t. On panicking, the car continued to drive, dragging Kaveri on the bonnet for around 100 metres before flinging her on the road, the police sources said.\nAlthough the locals rushed her to the Nair Hospital, the doctors pronounced her dead. The husband, meanwhile, is undergoing treatment.\nWorli Police have registered a case against the two people sitting inside the BMW. The number plate of the car, however, was removed when it was brought back to the police station.\n\nThe police have reportedly detained one of them and have seized the car. The zonal DCP, however, informed that no arrest has been made yet. The process of filing a case and making an arrest is underway.",
        "Maybe a 200 word essay will do this time given the paucity of time in a big city like Mumbai.",
        "How do you not stop your car when you see a lady on your bonnet!\nPeople really have no empathy.",
        "If he had stopped, locals would have killed him.",
        "Hmm the new hit and run law is also put on hold because of this reason.",
        ">According to police sources, the vehicle is owned by a Palghar-based leader of a political party and his son was inside the car along with the driver.\n\n>The number plate of the car, however, was removed when it was brought back to the police station\n\nalready know how the story is going to end.",
        "Also can’t believe the driver part, and btw the guy’s father is a leader from Shinde Sena.",
        "100m later when he killed her and stopped, were there no locals?",
        "Where is it written they stopped? Not in this article Atleast.",
        "Did they stop though? This article Atleast doesn’t say so. The lady just fell off the bonnet and died ig.",
        "Locals would have helped the lady and maybe assaulted the driver if he was drunk. \nIf he had agreed to help the couple then nothing would have happened to him.",
        "With prejudice, my friend’s friend was in this situation that the supposed Victims climb on to the bonnet and refuse to leave Unless you pay up. If you dont move, they will pick up Stones and try break the windshield. So my friend tried driving towards the Police station as he was with his family/kid. But the supposed victims belonged to a political party and not only did they extort money but Also filed an attempt to murder case on the driver. 2 sides to every story ig",
        "How does a 45 year old female climb from a scooter to the bonnet, is it a game going on? You hit a scooter and then You think that the lady has climbed to your bonnet to rob you or scam you? Are you out of your mind?",
        "The hit and runner is only thinking of self preservation. The longer they stay there the easier it is for their cars number to be caught.\n\n\nIs this absolutely idiotic and literally 1000s of cameras would've caught them? Yes. But people in these situations don't typically think rationally.",
        "We know what's gonna happen, don't we ? Script is pretty common.",
        "Y'all jump to conclusions just because the victims are poor and it's a rich and powerful guy behind the wheel....We can all see how these 2 Wheelers and Auto-Rikshas drive.. randomly changing lanes, no signals, no helmets, no protection gear....unfortunate for the victim and her family but still...i won't be saddened if they misuse their money and power to get off on a technicality...it's still fckd up to keep driving when there's a literal person on your cars bonnet",
        "Another interesting thing is 70% of the bikers who wear helmet tend to leave the helmet strap open essentially negating the effect of a helmet and using it as a mere challan avoidance tool and also many times leaving their Co passenger(s) helmet less- but when you point this out In a accident all these arm chair critics will become aggressive and start blaming your thinking and what not",
        "Yeah and the only pillion riders who actually wear helmets are girls trying to hide their faces.."
    ],
    "cleaned_text": "mumbai hitandrun case speeding bmw rams bike worli drags woman metres death according police sources vehicle owned palgharbased leader political party son inside car along driver ",
    "cleaned_title": "mumbai hitandrun case speeding bmw rams bike worli drags woman metres death",
    "cleaned_selftext": "according police sources vehicle owned palgharbased leader political party son inside car along driver",
    "cleaned_comments": "speeding bmw car rammed bike couple worli sunday dragging woman bonnet car metres leading death injuring husband police said lookout accused comes time huge uproar hitandrun case involving porsche pune yearold minor hit motorcycle killed two people according police sources vehicle owned palgharbased leader political party son inside car along driver cops informed accident took place around near atria mall woman identified kaveri nakhwa resident worli koliwada heading back along husband sell fish procuring sassoon dock car hit couples scooter following lost balance landed bonnet vehicle husband quickly jumped kaveri couldnt panicking car continued drive dragging kaveri bonnet around metres flinging road police sources said although locals rushed nair hospital doctors pronounced dead husband meanwhile undergoing treatment worli police registered case two people sitting inside bmw number plate car however removed brought back police station police reportedly detained one seized car zonal dcp however informed arrest made yet process filing case making arrest underway maybe word essay time given paucity time big city like mumbai stop car see lady bonnet people really empathy stopped locals would killed hmm new hit run law also put hold reason according police sources vehicle owned palgharbased leader political party son inside car along driver number plate car however removed brought back police station already know story going end also cant believe driver part btw guys father leader shinde sena later killed stopped locals written stopped article atleast stop though article atleast doesnt say lady fell bonnet died ig locals would helped lady maybe assaulted driver drunk agreed help couple nothing would happened prejudice friends friend situation supposed victims climb bonnet refuse leave unless pay dont move pick stones try break windshield friend tried driving towards police station familykid supposed victims belonged political party extort money also filed attempt murder case driver sides every story ig year old female climb scooter bonnet game going hit scooter think lady climbed bonnet rob scam mind hit runner thinking self preservation longer stay easier cars number caught absolutely idiotic literally cameras wouldve caught yes people situations dont typically think rationally know whats gon na happen dont script pretty common yall jump conclusions victims poor rich powerful guy behind wheelwe see wheelers autorikshas drive randomly changing lanes signals helmets protection gearunfortunate victim family stilli wont saddened misuse money power get technicalityits still fckd keep driving theres literal person cars bonnet another interesting thing bikers wear helmet tend leave helmet strap open essentially negating effect helmet using mere challan avoidance tool also many times leaving co passengers helmet less point accident arm chair critics become aggressive start blaming thinking yeah pillion riders actually wear helmets girls trying hide faces",
    "light_cleaned_title": "Mumbai hit-and-run case: Speeding BMW rams into bike in Worli, drags woman for 100 metres to death",
    "light_cleaned_selftext": "According to police sources, the vehicle is owned by a Palghar-based leader of a political party and his son was inside the car along with the driver.",
    "light_cleaned_comments": "A speeding BMW car rammed into the bike of a couple in Worli on Sunday, dragging the woman on the bonnet of the car for 100 metres, leading to her death and injuring her husband. The police said that they are on the lookout for the accused. This comes at a time when there was huge uproar over a hit-and-run case involving a Porsche in Pune, where a 17-year-old minor had hit a motorcycle and killed two people. According to police sources, the vehicle is owned by a Palghar-based leader of a political party and his son was inside the car along with the driver. The cops further informed that the accident took place at around 5.30 am near Atria Mall. The woman has been identified as Kaveri Nakhwa (45), a resident of Worli Koliwada, who was heading back along with her husband to sell fish after procuring it from Sassoon dock. The car hit the couple’s scooter following which they lost balance and landed on the bonnet of the vehicle. The husband quickly jumped off but Kaveri couldn’t. On panicking, the car continued to drive, dragging Kaveri on the bonnet for around 100 metres before flinging her on the road, the police sources said. Although the locals rushed her to the Nair Hospital, the doctors pronounced her dead. The husband, meanwhile, is undergoing treatment. Worli Police have registered a case against the two people sitting inside the BMW. The number plate of the car, however, was removed when it was brought back to the police station. The police have reportedly detained one of them and have seized the car. The zonal DCP, however, informed that no arrest has been made yet. The process of filing a case and making an arrest is underway. Maybe a 200 word essay will do this time given the paucity of time in a big city like Mumbai. How do you not stop your car when you see a lady on your bonnet! People really have no empathy. If he had stopped, locals would have killed him. Hmm the new hit and run law is also put on hold because of this reason. >According to police sources, the vehicle is owned by a Palghar-based leader of a political party and his son was inside the car along with the driver. >The number plate of the car, however, was removed when it was brought back to the police station already know how the story is going to end. Also can’t believe the driver part, and btw the guy’s father is a leader from Shinde Sena. 100m later when he killed her and stopped, were there no locals? Where is it written they stopped? Not in this article Atleast. Did they stop though? This article Atleast doesn’t say so. The lady just fell off the bonnet and died ig. Locals would have helped the lady and maybe assaulted the driver if he was drunk. If he had agreed to help the couple then nothing would have happened to him. With prejudice, my friend’s friend was in this situation that the supposed Victims climb on to the bonnet and refuse to leave Unless you pay up. If you dont move, they will pick up Stones and try break the windshield. So my friend tried driving towards the Police station as he was with his family/kid. But the supposed victims belonged to a political party and not only did they extort money but Also filed an attempt to murder case on the driver. 2 sides to every story ig How does a 45 year old female climb from a scooter to the bonnet, is it a game going on? You hit a scooter and then You think that the lady has climbed to your bonnet to rob you or scam you? Are you out of your mind? The hit and runner is only thinking of self preservation. The longer they stay there the easier it is for their cars number to be caught. Is this absolutely idiotic and literally 1000s of cameras would've caught them? Yes. But people in these situations don't typically think rationally. We know what's gonna happen, don't we ? Script is pretty common. Y'all jump to conclusions just because the victims are poor and it's a rich and powerful guy behind the wheel....We can all see how these 2 Wheelers and Auto-Rikshas drive.. randomly changing lanes, no signals, no helmets, no protection gear....unfortunate for the victim and her family but still...i won't be saddened if they misuse their money and power to get off on a technicality...it's still fckd up to keep driving when there's a literal person on your cars bonnet Another interesting thing is 70% of the bikers who wear helmet tend to leave the helmet strap open essentially negating the effect of a helmet and using it as a mere challan avoidance tool and also many times leaving their Co passenger(s) helmet less- but when you point this out In a accident all these arm chair critics will become aggressive and start blaming your thinking and what not Yeah and the only pillion riders who actually wear helmets are girls trying to hide their faces.."
}