{
    "id": "1bgr6f5",
    "title": "What’s your views on WAQF BOARD ACT 1954&1955",
    "url": "https://www.reddit.com/gallery/1bgr6f5",
    "selftext": "So if you dont know Waqf Act stabilised in India under Nehru's Govt. And got \"ultimate powers\" after 2000 if they just think xyz property belongs they will get it, few months ago they claimed a temple (700+ years old ) and a whole village, after Railways and Indian Army they have nearly 6 Lakh acors of Land\n\nCorrect me if I’m wrong with provisions",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 11,
    "created_utc": 1710657461.0,
    "convurl": "https://i.redd.it/twxilppwauoc1.jpg",
    "comments": [
        "Misuse of powers. I am definitely against it. They are doing whatever they want.",
        "What is Gobhiji doing? He is in power and has a absolute majority. Why he don't take down these laws if they really are the problem. And why haven't ch@ddis protested and demanded removal of it for last 10 years?",
        "It is a stupid act. We have a quite few acts and laws, that are just one sided.",
        "BJP is so incompetent that they can't strike down shit that they say is illegal and unfair. \n10 years with favorable majority and they have done nothing?\nNot one bill, not one case, no action.\n\n\nFuckers are useless."
    ],
    "cleaned_text": "whats views waqf board act dont know waqf act stabilised india nehrus govt got ultimate powers think xyz property belongs get months ago claimed temple years old whole village railways indian army nearly lakh acors land correct im wrong provisions ",
    "cleaned_title": "whats views waqf board act",
    "cleaned_selftext": "dont know waqf act stabilised india nehrus govt got ultimate powers think xyz property belongs get months ago claimed temple years old whole village railways indian army nearly lakh acors land correct im wrong provisions",
    "cleaned_comments": "misuse powers definitely whatever want gobhiji power absolute majority dont take laws really problem havent chddis protested demanded removal last years stupid act quite acts laws one sided bjp incompetent cant strike shit say illegal unfair years favorable majority done nothing one bill one case action fuckers useless",
    "light_cleaned_title": "What’s your views on WAQF BOARD ACT 1954&1955",
    "light_cleaned_selftext": "So if you dont know Waqf Act stabilised in India under Nehru's Govt. And got \"ultimate powers\" after 2000 if they just think xyz property belongs they will get it, few months ago they claimed a temple (700+ years old ) and a whole village, after Railways and Indian Army they have nearly 6 Lakh acors of Land Correct me if I’m wrong with provisions",
    "light_cleaned_comments": "Misuse of powers. I am definitely against it. They are doing whatever they want. What is Gobhiji doing? He is in power and has a absolute majority. Why he don't take down these laws if they really are the problem. And why haven't ch@ddis protested and demanded removal of it for last 10 years? It is a stupid act. We have a quite few acts and laws, that are just one sided. BJP is so incompetent that they can't strike down shit that they say is illegal and unfair. 10 years with favorable majority and they have done nothing? Not one bill, not one case, no action. Fuckers are useless."
}