{
    "id": "1cy0sg9",
    "title": "Please help me retrieve my money from Online Legal India",
    "url": "https://www.reddit.com/r/india/comments/1cy0sg9/please_help_me_retrieve_my_money_from_online/",
    "selftext": "I bought a service (Legal Advice + Legal Notice) from Online Legal India for ₹1,769.\n\nThey gave me the legal notice which had many mistakes and I made them correct it again and again.\n\nAnd after that when I tried to contact them for more some Legal Advice, the advocate they have appointed for me didn't replied to me.\n\nBut when I emailed them telling that I want my money back, they suddenly started replying \n\nSo I just said I want my money back, so they appointed a escalation expert.\n\nI explained her many times my issue, but she kept telling me that 'We have given you service', and I said you have only given me legal notice, but when I tried for legal advice, you didn't respond.\n\nNext day I was busy so I couldn't pick up her call, so she closed my query.\n\nAnd then after trying soo many times I got the call from Customer Service Executive after 5 hours they told me that she will arrange the call with escalation expert but after 24 hours.\n\nNow after 24 hours I didn't got any call.\n\nHere is the Tweet I made with Call Recording - https://twitter.com/Divyans77229954/status/1793267526014841191?t=v0J690H7lPnycXmfU02HiQ&s=19\n\nPlease help me get my money back, I don't know what to do, i have Screenshots of Email and some call recordings..",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1716385990.0,
    "convurl": "https://external-preview.redd.it/I5l8FPe1tpmY1lTNCylnTK5f1yLILpRKIy6L1EYG69Q.jpg?auto=webp&s=70e3c618cbe716293b54055baf8abca5e0d9523f",
    "comments": [],
    "cleaned_text": "please help retrieve money online legal india bought service legal advice legal notice online legal india gave legal notice many mistakes made correct tried contact legal advice advocate appointed didnt replied emailed telling want money back suddenly started replying said want money back appointed escalation expert explained many times issue kept telling given service said given legal notice tried legal advice didnt respond next day busy couldnt pick call closed query trying soo many times got call customer service executive hours told arrange call escalation expert hours hours didnt got call tweet made call recording please help get money back dont know screenshots email call recordings ",
    "cleaned_title": "please help retrieve money online legal india",
    "cleaned_selftext": "bought service legal advice legal notice online legal india gave legal notice many mistakes made correct tried contact legal advice advocate appointed didnt replied emailed telling want money back suddenly started replying said want money back appointed escalation expert explained many times issue kept telling given service said given legal notice tried legal advice didnt respond next day busy couldnt pick call closed query trying soo many times got call customer service executive hours told arrange call escalation expert hours hours didnt got call tweet made call recording please help get money back dont know screenshots email call recordings",
    "cleaned_comments": "",
    "light_cleaned_title": "Please help me retrieve my money from Online Legal India",
    "light_cleaned_selftext": "I bought a service (Legal Advice + Legal Notice) from Online Legal India for ₹1,769. They gave me the legal notice which had many mistakes and I made them correct it again and again. And after that when I tried to contact them for more some Legal Advice, the advocate they have appointed for me didn't replied to me. But when I emailed them telling that I want my money back, they suddenly started replying So I just said I want my money back, so they appointed a escalation expert. I explained her many times my issue, but she kept telling me that 'We have given you service', and I said you have only given me legal notice, but when I tried for legal advice, you didn't respond. Next day I was busy so I couldn't pick up her call, so she closed my query. And then after trying soo many times I got the call from Customer Service Executive after 5 hours they told me that she will arrange the call with escalation expert but after 24 hours. Now after 24 hours I didn't got any call. Here is the Tweet I made with Call Recording - Please help me get my money back, I don't know what to do, i have Screenshots of Email and some call recordings..",
    "light_cleaned_comments": ""
}