{
    "id": "13byfsh",
    "title": "Anyone noticed today(8th May '23) during lunch time, all of a sudden couple of TV news channels switched to this seven minute very random interview(?) of Home Minister Amit?",
    "url": "https://www.reddit.com/r/india/comments/13byfsh/anyone_noticed_today8th_may_23_during_lunch_time/",
    "selftext": "This one. https://www.youtube.com/watch?v=68v4okcoxyU\n\nIt seems to be pre-recorded and then premiered on ANI YouTube channel and other TV channels unlike interviews with other leaders which are live and generally during some campaign/rally. \n\nThe questions are just perfectly prepared. \n\nZero follow ups. Just asked one question after the other. \n\nTelecast was during lunch time when viewership is prolly high(literally and figuratively). \n\nThis is not the first time Amit has done something like this. In February he had given an '*interview*' to ANI/Smita Prakash before the elections in Tripura, Meghalaya and Nagaland. \n\nMuch worse was Namo TV which came and vanished just before the 2019 assembly elections. Not a word from anyone about it any more. \n\nToday was the last day for campaigning in Karnataka so very strategic. Namo TV was also live just before the 2019 election for a few days. \n\n---\n\nAm I reading too much into this? :/",
    "flair": "Politics",
    "score": 51,
    "num_comments": 2,
    "created_utc": 1683566332.0,
    "convurl": "https://external-preview.redd.it/zGr39frHfY62GlrQ1b05GzGWLyhDP4yIGcN_pnZSm0M.jpg?auto=webp&v=enabled&s=52417948636f9ecc4665dc200aab652934b64a1c",
    "comments": [
        "He looks really worn out tbf, seems like a last moment appeal to their ex-voters, since, as you mentioned, this is the last day of campaigning for K'taka election (officially atleast) and projections show BJP is going to lose at least a few seats in this election."
    ],
    "cleaned_text": "anyone noticed todayth may lunch time sudden couple tv news channels switched seven minute random interview home minister amit one seems prerecorded premiered ani youtube channel tv channels unlike interviews leaders live generally campaignrally questions perfectly prepared zero follow ups asked one question telecast lunch time viewership prolly highliterally figuratively first time amit done something like february given interview anismita prakash elections tripura meghalaya nagaland much worse namo tv came vanished assembly elections word anyone today last day campaigning karnataka strategic namo tv also live election days reading much ",
    "cleaned_title": "anyone noticed todayth may lunch time sudden couple tv news channels switched seven minute random interview home minister amit",
    "cleaned_selftext": "one seems prerecorded premiered ani youtube channel tv channels unlike interviews leaders live generally campaignrally questions perfectly prepared zero follow ups asked one question telecast lunch time viewership prolly highliterally figuratively first time amit done something like february given interview anismita prakash elections tripura meghalaya nagaland much worse namo tv came vanished assembly elections word anyone today last day campaigning karnataka strategic namo tv also live election days reading much",
    "cleaned_comments": "looks really worn tbf seems like last moment appeal exvoters since mentioned last day campaigning ktaka election officially atleast projections show bjp going lose least seats election",
    "light_cleaned_title": "Anyone noticed today(8th May '23) during lunch time, all of a sudden couple of TV news channels switched to this seven minute very random interview(?) of Home Minister Amit?",
    "light_cleaned_selftext": "This one. It seems to be pre-recorded and then premiered on ANI YouTube channel and other TV channels unlike interviews with other leaders which are live and generally during some campaign/rally. The questions are just perfectly prepared. Zero follow ups. Just asked one question after the other. Telecast was during lunch time when viewership is prolly high(literally and figuratively). This is not the first time Amit has done something like this. In February he had given an '*interview*' to ANI/Smita Prakash before the elections in Tripura, Meghalaya and Nagaland. Much worse was Namo TV which came and vanished just before the 2019 assembly elections. Not a word from anyone about it any more. Today was the last day for campaigning in Karnataka so very strategic. Namo TV was also live just before the 2019 election for a few days. --- Am I reading too much into this? :/",
    "light_cleaned_comments": "He looks really worn out tbf, seems like a last moment appeal to their ex-voters, since, as you mentioned, this is the last day of campaigning for K'taka election (officially atleast) and projections show BJP is going to lose at least a few seats in this election."
}