{
    "id": "1b1grxv",
    "title": "Flipkart scam got a fake ram",
    "url": "https://www.reddit.com/gallery/1b1grxv",
    "selftext": "I wanted to share my recent ordeal regarding a Crucial Basic Series RAM module I purchased from Flipkart back on October 1st, 2023. The RAM, advertised as compatible with both 2400MHz and 2666MHz DDR4 configurations, arrived promptly on October 10th, 2023.\nTrouble started brewing around the beginning of February when the RAM began showing signs of faults. In response, I promptly sent it for servicing to one of the service centers in Delhi, specifically Kaizen Infoserve Pvt. Ltd, located at 503, Building 87, Nehru Pl Market Rd, Nehru Place, New Delhi, Delhi 110019.\n\nHowever, the process hit a snag when the service center failed to respond after receiving the RAM, which was sent via courier by Professional Courier and delivered to them around February 23rd. After several attempts to contact them, I finally managed to get through, only to be informed that the RAM was fake.\nIn a desperate attempt to resolve the issue, I reached out to Flipkart's customer support. They requested a letter of denial regarding the authenticity of the RAM. Upon contacting the service center again, I was directed to Mr. Ananth. After explaining the situation to him, he promptly sent me an email confirming that the RAM was indeed fake.\n\nContinuing the effort for resolution, I am in touch with Flipkart's backend team. Today, on February 27th, 2024, they requested screenshots of the email provided by Kaizen Infoserve Pvt. Ltd. I promptly provided the requested screenshots, and a new ticket has been generated, stating that the issue will be resolved by March 3rd, 2024.Has anyone else faced similar challenges with electronics purchased from Flipkart or other online retailers? I would appreciate any insights or advice on how to navigate such situations in the future.\n\nI am writing this just to inform all of you what is happening out there and to get some advice about the situation and what I have to do if Flipkart doesn't go in my favour, i will keep you updated about the situation",
    "flair": "Law & Courts",
    "score": 327,
    "num_comments": 86,
    "created_utc": 1709053036.0,
    "convurl": "https://i.redd.it/9v2c7u74s5lc1.jpg",
    "comments": [
        "Avoid fakecart.",
        "Avoid Flipkart, they are horrible garbage. See my post about defective Pixel 6a I received from Flipkart.",
        "Flipkart is the worst platform to buy stuff from. I once ordered one plus bullets bluetooth earphones and got some sony used earphones. And it was such a headache to convince them. Amazon better any day.",
        "Isliye I bought mine from Amazon",
        "Avoid Flipkart , I bought a 8gb crucial ram from Amazon and works perfectly fine",
        "Bhai sec ki chips hai, crucial khud thore hi chip banata hai... Kaise kaise chu log bhare padhe hai... Original pc hai nahi pasand to me 200 me le lunga",
        "Why the title rhyme tho ?",
        "Bhai chips to sec ke hai aur crucial khud thore hi chip banati hai and I think they use ic's from SEC",
        "I got lucky when I purchased a RAM from Flipkart.\n\n\nGot a piece of PCB which was roughly cut to the size of a RAM. Didn't need to contact customer care to identify it as a fake.",
        "Same",
        "Use MDcomputers.in",
        "BHAI SELLER KA AUTO CORRECT HO GAYA HOGA SHAYAD RGB RAM DICK KE JAGAH RGB RAM STICK LIKH DIA HOGA.....\n\n  \nCAMEDY HO GAI JI CAMEDY HAAS DO PLZ",
        "Well, I might be a dumb one.\n\nI ordered[ this one](https://www.flipkart.com/crucial-ct500p3ssd8-500-gb-desktop-laptop-internal-solid-state-drive-ssd-p3-pcie-3-0-nvme-m-2-ssd/p/itm2f7d57af46662?pid=IHDGGYEFKAF8BNFN&lid=LSTIHDGGYEFKAF8BNFNOAFO0V) from Flipkart and my laptop is AN515-43-R2M9, having a second m.2 slot I thought it would work, but doesn't. I don't know why. I gave up searching for a solution and it could be totally possible that the ssd is faulty. Other things happened and I totally forgot about it and that ssd is still in my laptop and my laptop is still not able to detect it.",
        "Flipkart is a scam in itself",
        "Crucial uses their own in-house Micron's DRAM chips. SEC is Samsung Electronics. Also, Micron does not have any packaging unit in Mexico. This is clearly a fake product.",
        "Of course avoid fraudkart. I also got scammed, rags were sent instead of stoles. The customer support refused to cooperate when asked for a refund. Didn't go further with a case as the loss wasn't much in my case. I encourage you in case things go south with customer service to file a complaint with the National Consumer helpline and E Dhakin. Some of my friends were able to get a refund through them.",
        "Pro tip: If you are getting something at an unexpected price (cheaper than usual), always double check the seller... Their reviews...\n\nI bought 2 x 32 GB RAM about 4 months ago. I was getting it cheaper from Flipkart... But the seller looked sus.. so I bought from Amazon after carefully checking everything.\n\nMoreover, going to an offline store and buying it is always the best option.. or ordering from the official store website (but it's Lil expensive)",
        "Micron does assemble stuff in Mexico, at least the SSDs I got were. Not sure about the DRAM modules though.",
        "Please use punctuation bhai. I thought a scammer itself got a fake ram",
        "Go forward with consumer complaint",
        "Never buy anything for more than 2k from Flipkart.",
        "I recently ordered a canon printer and they sent me a used one without ink cartridges, returned that and now using same printer after ordering it from amazon. I ordered my gaming laptop too from amazon and received genuine laptop, in my opinion never buy anything from scamkart.",
        "Ram fake is hard it would show in cpu z if fake and not a crucial ram, manufacture name, part number,build month so many things r there in ram its hard to fake those check in cpu z",
        "WHY DO PPL STILL BUY FROM FLIPKART ???",
        "Flipkart scam, got a fake ram, a hamburger is when you combine burger buns and ham, sweet potato but sweeter call it a yam, this shit was starting flow and then it stopped like dam(n)",
        "bro why u use chatgpt for ur caption",
        "Wam Bam Thank You Maam",
        "Even Amazon is same. They fraud me with fake watch worth 10k and no refund",
        "Don't be cool because you are fool.",
        "You bought RAM on 1st October, 2023. And, it kept working till February, 2024. That is 4 months atleast. If it was working with your computer for 4 months than it isn't fake. You can check on CPU-Z who is the manufacturer of the RAM kit.\n\nWith 4 months gap between purchase and your issue, I don't see Flipkart or Amazon resolving it. You have a 10 year warranty, reach out to Crucial. Flipkart isn't providing the warranty, it is Crucial providing it.",
        "You bought RAM on 1st October, 2023. And, it kept working till February, 2024. That is 4 months atleast. Did you not check RAM after installing? \n\nWith 4 months gap between purchase and your issue, I don't see Flipkart or Amazon resolving it. You have a 10 year warranty, reach out to Crucial. Flipkart isn't providing the warranty, it is Crucial providing it. I am surprised Flipkart support is responding promptly and your snags are from service center. Counterfeits RAM would still provide the proper details of the original manufacturer. The only way you will get any support from Flipkart is if the seller has a history of counterfeits.",
        "Another Day another flipkart scam .",
        "I too had a similar experience with Amazon. They had sent a fake ram when led to my computer crashing. So I promptly took photos and shared them with Amazon and asked for replacement. The second ram sent by retailer was good and still works. I think there are multiple such fraud sellers who send fake ones in the first go and send original if you complain.",
        "damn I was going to buy the exact same model . It was even in my cart, not any more.",
        "Flipkart scam,\n\nGot a fake ram,\n\nFuck me.. damn,\n\nGotta tell my fam.",
        "Seller ratings really matter",
        ">it could be totally possible that the ssd is faulty.\n\nDrivers are needed for M.2 SSD to work, please check ?\n\nOften, a BIOS update is required for the motherboard to recognise the M.2 SSD.",
        "Flipkart has almost become a new version of Wish.com",
        "Tryna return the ram\n\nAin’t no way this is a scam\n\nAll these emails are nun but a spam\n\nFlipkart always make me cry like a baby “wham wham”",
        "When you realised it's fake, did you shout out \"nahi shree RAM!\"?",
        "Same.  But be very cautious about the seller.",
        "nice rhymes man",
        "Check seller's rating before finalising, these days casual sellers in amzn /flipkarts tactics to scam you",
        "Yeah but I bought from Flipkart official seller of Pixel. They're the only authorised seller of Pixel devices in India. So, even with authorised seller you can get cheated.",
        "I bought the same RAM from Amazon, and after 1 got some issues with my laptop and the service centre guy said, it was due to this RAM.",
        "Why post this 5 months later ?",
        "Did you get the return for it?",
        "They refused to replace or refund. Tried consumer helpline, it was useless (and took 4 months just to conclude that seller said there's no problem). Tried chargeback, bank was fighting me and refusing chargeback. Finally they did, never contacted me, and then after 4-5 months said chargeback was denied.\n\nNeed to go take legal action in a court, but with my health problems and lack of trustworthy lawyers, not a feasible option. Still sitting with a defective phone.",
        "Sad to hear that man!",
        "lol hella sick rhymes, let me add some too:  \n  \nnever gonna buy from flipkart again  \nstill cant believe   \ni lost my mind & money for something so lame  \nregret remorse giving me shame  \nand if there ever was a way to tame  \ni woulda stayed outta the flipkart game",
        "Oh that’s messed up",
        "I have bought Iphone from Flipkart and Laptop from Amazon \n\nHaven’t faced any issue"
    ],
    "cleaned_text": "flipkart scam got fake ram wanted share recent ordeal regarding crucial basic series ram module purchased flipkart back october st ram advertised compatible mhz mhz ddr configurations arrived promptly october th trouble started brewing around beginning february ram began showing signs faults response promptly sent servicing one service centers delhi specifically kaizen infoserve pvt ltd located building nehru pl market rd nehru place new delhi delhi however process hit snag service center failed respond receiving ram sent via courier professional courier delivered around february rd several attempts contact finally managed get informed ram fake desperate attempt resolve issue reached flipkarts customer support requested letter denial regarding authenticity ram upon contacting service center directed mr ananth explaining situation promptly sent email confirming ram indeed fake continuing effort resolution touch flipkarts backend team today february th requested screenshots email provided kaizen infoserve pvt ltd promptly provided requested screenshots new ticket generated stating issue resolved march rd anyone else faced similar challenges electronics purchased flipkart online retailers would appreciate insights advice navigate situations future writing inform happening get advice situation flipkart doesnt go favour keep updated situation ",
    "cleaned_title": "flipkart scam got fake ram",
    "cleaned_selftext": "wanted share recent ordeal regarding crucial basic series ram module purchased flipkart back october st ram advertised compatible mhz mhz ddr configurations arrived promptly october th trouble started brewing around beginning february ram began showing signs faults response promptly sent servicing one service centers delhi specifically kaizen infoserve pvt ltd located building nehru pl market rd nehru place new delhi delhi however process hit snag service center failed respond receiving ram sent via courier professional courier delivered around february rd several attempts contact finally managed get informed ram fake desperate attempt resolve issue reached flipkarts customer support requested letter denial regarding authenticity ram upon contacting service center directed mr ananth explaining situation promptly sent email confirming ram indeed fake continuing effort resolution touch flipkarts backend team today february th requested screenshots email provided kaizen infoserve pvt ltd promptly provided requested screenshots new ticket generated stating issue resolved march rd anyone else faced similar challenges electronics purchased flipkart online retailers would appreciate insights advice navigate situations future writing inform happening get advice situation flipkart doesnt go favour keep updated situation",
    "cleaned_comments": "avoid fakecart avoid flipkart horrible garbage see post defective pixel received flipkart flipkart worst platform buy stuff ordered one plus bullets bluetooth earphones got sony used earphones headache convince amazon better day isliye bought mine amazon avoid flipkart bought gb crucial ram amazon works perfectly fine bhai sec ki chips hai crucial khud thore hi chip banata hai kaise kaise chu log bhare padhe hai original pc hai nahi pasand le lunga title rhyme tho bhai chips sec ke hai aur crucial khud thore hi chip banati hai think use ics sec got lucky purchased ram flipkart got piece pcb roughly cut size ram didnt need contact customer care identify fake use mdcomputersin bhai seller ka auto correct ho gaya hoga shayad rgb ram dick ke jagah rgb ram stick likh dia hoga camedy ho gai ji camedy haas plz well might dumb one ordered onehttpswwwflipkartcomcrucialctpssdgbdesktoplaptopinternalsolidstatedrivessdppcienvmemssdpitmfdafpidihdggyefkafbnfnlidlstihdggyefkafbnfnoafov flipkart laptop anrm second slot thought would work doesnt dont know gave searching solution could totally possible ssd faulty things happened totally forgot ssd still laptop laptop still able detect flipkart scam crucial uses inhouse microns dram chips sec samsung electronics also micron packaging unit mexico clearly fake product course avoid fraudkart also got scammed rags sent instead stoles customer support refused cooperate asked refund didnt go case loss wasnt much case encourage case things go south customer service file complaint national consumer helpline e dhakin friends able get refund pro tip getting something unexpected price cheaper usual always double check seller reviews bought x gb ram months ago getting cheaper flipkart seller looked sus bought amazon carefully checking everything moreover going offline store buying always best option ordering official store website lil expensive micron assemble stuff mexico least ssds got sure dram modules though please use punctuation bhai thought scammer got fake ram go forward consumer complaint never buy anything k flipkart recently ordered canon printer sent used one without ink cartridges returned using printer ordering amazon ordered gaming laptop amazon received genuine laptop opinion never buy anything scamkart ram fake hard would show cpu z fake crucial ram manufacture name part numberbuild month many things r ram hard fake check cpu z ppl still buy flipkart flipkart scam got fake ram hamburger combine burger buns ham sweet potato sweeter call yam shit starting flow stopped like damn bro u use chatgpt ur caption wam bam thank maam even amazon fraud fake watch worth k refund dont cool fool bought ram st october kept working till february months atleast working computer months isnt fake check cpuz manufacturer ram kit months gap purchase issue dont see flipkart amazon resolving year warranty reach crucial flipkart isnt providing warranty crucial providing bought ram st october kept working till february months atleast check ram installing months gap purchase issue dont see flipkart amazon resolving year warranty reach crucial flipkart isnt providing warranty crucial providing surprised flipkart support responding promptly snags service center counterfeits ram would still provide proper details original manufacturer way get support flipkart seller history counterfeits another day another flipkart scam similar experience amazon sent fake ram led computer crashing promptly took photos shared amazon asked replacement second ram sent retailer good still works think multiple fraud sellers send fake ones first go send original complain damn going buy exact model even cart flipkart scam got fake ram fuck damn got ta tell fam seller ratings really matter could totally possible ssd faulty drivers needed ssd work please check often bios update required motherboard recognise ssd flipkart almost become new version wishcom tryna return ram aint way scam emails nun spam flipkart always make cry like baby wham wham realised fake shout nahi shree ram cautious seller nice rhymes man check sellers rating finalising days casual sellers amzn flipkarts tactics scam yeah bought flipkart official seller pixel theyre authorised seller pixel devices india even authorised seller get cheated bought ram amazon got issues laptop service centre guy said due ram post months later get return refused replace refund tried consumer helpline useless took months conclude seller said theres problem tried chargeback bank fighting refusing chargeback finally never contacted months said chargeback denied need go take legal action court health problems lack trustworthy lawyers feasible option still sitting defective phone sad hear man lol hella sick rhymes let add never gon na buy flipkart still cant believe lost mind money something lame regret remorse giving shame ever way tame woulda stayed outta flipkart game oh thats messed bought iphone flipkart laptop amazon havent faced issue",
    "light_cleaned_title": "Flipkart scam got a fake ram",
    "light_cleaned_selftext": "I wanted to share my recent ordeal regarding a Crucial Basic Series RAM module I purchased from Flipkart back on October 1st, 2023. The RAM, advertised as compatible with both 2400MHz and 2666MHz DDR4 configurations, arrived promptly on October 10th, 2023. Trouble started brewing around the beginning of February when the RAM began showing signs of faults. In response, I promptly sent it for servicing to one of the service centers in Delhi, specifically Kaizen Infoserve Pvt. Ltd, located at 503, Building 87, Nehru Pl Market Rd, Nehru Place, New Delhi, Delhi 110019. However, the process hit a snag when the service center failed to respond after receiving the RAM, which was sent via courier by Professional Courier and delivered to them around February 23rd. After several attempts to contact them, I finally managed to get through, only to be informed that the RAM was fake. In a desperate attempt to resolve the issue, I reached out to Flipkart's customer support. They requested a letter of denial regarding the authenticity of the RAM. Upon contacting the service center again, I was directed to Mr. Ananth. After explaining the situation to him, he promptly sent me an email confirming that the RAM was indeed fake. Continuing the effort for resolution, I am in touch with Flipkart's backend team. Today, on February 27th, 2024, they requested screenshots of the email provided by Kaizen Infoserve Pvt. Ltd. I promptly provided the requested screenshots, and a new ticket has been generated, stating that the issue will be resolved by March 3rd, 2024.Has anyone else faced similar challenges with electronics purchased from Flipkart or other online retailers? I would appreciate any insights or advice on how to navigate such situations in the future. I am writing this just to inform all of you what is happening out there and to get some advice about the situation and what I have to do if Flipkart doesn't go in my favour, i will keep you updated about the situation",
    "light_cleaned_comments": "Avoid fakecart. Avoid Flipkart, they are horrible garbage. See my post about defective Pixel 6a I received from Flipkart. Flipkart is the worst platform to buy stuff from. I once ordered one plus bullets bluetooth earphones and got some sony used earphones. And it was such a headache to convince them. Amazon better any day. Isliye I bought mine from Amazon Avoid Flipkart , I bought a 8gb crucial ram from Amazon and works perfectly fine Bhai sec ki chips hai, crucial khud thore hi chip banata hai... Kaise kaise chu log bhare padhe hai... Original pc hai nahi pasand to me 200 me le lunga Why the title rhyme tho ? Bhai chips to sec ke hai aur crucial khud thore hi chip banati hai and I think they use ic's from SEC I got lucky when I purchased a RAM from Flipkart. Got a piece of PCB which was roughly cut to the size of a RAM. Didn't need to contact customer care to identify it as a fake. Same Use MDcomputers.in BHAI SELLER KA AUTO CORRECT HO GAYA HOGA SHAYAD RGB RAM DICK KE JAGAH RGB RAM STICK LIKH DIA HOGA..... CAMEDY HO GAI JI CAMEDY HAAS DO PLZ Well, I might be a dumb one. I ordered[ this one](https://www.flipkart.com/crucial-ct500p3ssd8-500-gb-desktop-laptop-internal-solid-state-drive-ssd-p3-pcie-3-0-nvme-m-2-ssd/p/itm2f7d57af46662?pid=IHDGGYEFKAF8BNFN&lid=LSTIHDGGYEFKAF8BNFNOAFO0V) from Flipkart and my laptop is AN515-43-R2M9, having a second m.2 slot I thought it would work, but doesn't. I don't know why. I gave up searching for a solution and it could be totally possible that the ssd is faulty. Other things happened and I totally forgot about it and that ssd is still in my laptop and my laptop is still not able to detect it. Flipkart is a scam in itself Crucial uses their own in-house Micron's DRAM chips. SEC is Samsung Electronics. Also, Micron does not have any packaging unit in Mexico. This is clearly a fake product. Of course avoid fraudkart. I also got scammed, rags were sent instead of stoles. The customer support refused to cooperate when asked for a refund. Didn't go further with a case as the loss wasn't much in my case. I encourage you in case things go south with customer service to file a complaint with the National Consumer helpline and E Dhakin. Some of my friends were able to get a refund through them. Pro tip: If you are getting something at an unexpected price (cheaper than usual), always double check the seller... Their reviews... I bought 2 x 32 GB RAM about 4 months ago. I was getting it cheaper from Flipkart... But the seller looked sus.. so I bought from Amazon after carefully checking everything. Moreover, going to an offline store and buying it is always the best option.. or ordering from the official store website (but it's Lil expensive) Micron does assemble stuff in Mexico, at least the SSDs I got were. Not sure about the DRAM modules though. Please use punctuation bhai. I thought a scammer itself got a fake ram Go forward with consumer complaint Never buy anything for more than 2k from Flipkart. I recently ordered a canon printer and they sent me a used one without ink cartridges, returned that and now using same printer after ordering it from amazon. I ordered my gaming laptop too from amazon and received genuine laptop, in my opinion never buy anything from scamkart. Ram fake is hard it would show in cpu z if fake and not a crucial ram, manufacture name, part number,build month so many things r there in ram its hard to fake those check in cpu z WHY DO PPL STILL BUY FROM FLIPKART ??? Flipkart scam, got a fake ram, a hamburger is when you combine burger buns and ham, sweet potato but sweeter call it a yam, this shit was starting flow and then it stopped like dam(n) bro why u use chatgpt for ur caption Wam Bam Thank You Maam Even Amazon is same. They fraud me with fake watch worth 10k and no refund Don't be cool because you are fool. You bought RAM on 1st October, 2023. And, it kept working till February, 2024. That is 4 months atleast. If it was working with your computer for 4 months than it isn't fake. You can check on CPU-Z who is the manufacturer of the RAM kit. With 4 months gap between purchase and your issue, I don't see Flipkart or Amazon resolving it. You have a 10 year warranty, reach out to Crucial. Flipkart isn't providing the warranty, it is Crucial providing it. You bought RAM on 1st October, 2023. And, it kept working till February, 2024. That is 4 months atleast. Did you not check RAM after installing? With 4 months gap between purchase and your issue, I don't see Flipkart or Amazon resolving it. You have a 10 year warranty, reach out to Crucial. Flipkart isn't providing the warranty, it is Crucial providing it. I am surprised Flipkart support is responding promptly and your snags are from service center. Counterfeits RAM would still provide the proper details of the original manufacturer. The only way you will get any support from Flipkart is if the seller has a history of counterfeits. Another Day another flipkart scam . I too had a similar experience with Amazon. They had sent a fake ram when led to my computer crashing. So I promptly took photos and shared them with Amazon and asked for replacement. The second ram sent by retailer was good and still works. I think there are multiple such fraud sellers who send fake ones in the first go and send original if you complain. damn I was going to buy the exact same model . It was even in my cart, not any more. Flipkart scam, Got a fake ram, Fuck me.. damn, Gotta tell my fam. Seller ratings really matter >it could be totally possible that the ssd is faulty. Drivers are needed for M.2 SSD to work, please check ? Often, a BIOS update is required for the motherboard to recognise the M.2 SSD. Flipkart has almost become a new version of Wish.com Tryna return the ram Ain’t no way this is a scam All these emails are nun but a spam Flipkart always make me cry like a baby “wham wham” When you realised it's fake, did you shout out \"nahi shree RAM!\"? Same. But be very cautious about the seller. nice rhymes man Check seller's rating before finalising, these days casual sellers in amzn /flipkarts tactics to scam you Yeah but I bought from Flipkart official seller of Pixel. They're the only authorised seller of Pixel devices in India. So, even with authorised seller you can get cheated. I bought the same RAM from Amazon, and after 1 got some issues with my laptop and the service centre guy said, it was due to this RAM. Why post this 5 months later ? Did you get the return for it? They refused to replace or refund. Tried consumer helpline, it was useless (and took 4 months just to conclude that seller said there's no problem). Tried chargeback, bank was fighting me and refusing chargeback. Finally they did, never contacted me, and then after 4-5 months said chargeback was denied. Need to go take legal action in a court, but with my health problems and lack of trustworthy lawyers, not a feasible option. Still sitting with a defective phone. Sad to hear that man! lol hella sick rhymes, let me add some too: never gonna buy from flipkart again still cant believe i lost my mind & money for something so lame regret remorse giving me shame and if there ever was a way to tame i woulda stayed outta the flipkart game Oh that’s messed up I have bought Iphone from Flipkart and Laptop from Amazon Haven’t faced any issue"
}