{
    "id": "1f65dmv",
    "title": "PM Modi highlights India’s 90% growth in over a decade, promises dynamic policies",
    "url": "https://indianexpress.com/article/business/pm-modi-highlights-indias-90-growth-in-over-a-decade-promises-dynamic-policies-9543689/lite/",
    "selftext": "Reading this article makes me question my own sanity and exactly how delusional and disconnected he has become from the ground\nreality. With each year, the rising economic struggles which the country has to endure starting with unemployment, high tariff rate, etc., these kinds of statements feel like adding salt to the already growing wound of the middle-class. I challenge anyone to read this article without atleast once questioning exactly what he had in mind while speaking these words.",
    "flair": "Policy/Economy",
    "score": 11,
    "num_comments": 18,
    "created_utc": 1725162310.0,
    "convurl": "https://external-preview.redd.it/ln1w4TCgA7hX6-Ty1yMDo9TmCQEZmhUsfQ820kEbwQ0.jpg?auto=webp&s=783448f29e9fc4c348a1d060241e8760ab0416b0",
    "comments": [
        "Delulu is the only solulu",
        "India grew 150% under Manmohan.",
        "6.6% average annual growth. There goes my chance of discovering gravity!",
        "*Mummy bas aaj ice cream khane do, pakka acche marks launga*..",
        "“Over the last 10 years, the global economy has expanded by 35 per cent. Whereas, in the same 10 years, the economy of ~~India~~ my friends has expanded by nearly 90 per cent\". \n\nAlso, his talking about inclusive growth and inclusivity is so funny to me lol",
        "It amazes me how no one is pointing that out. Growth under Manmohan was much higher. We have actually decelerated",
        "I think he means the growth of the population.",
        "https://preview.redd.it/rlkfhdpgh7md1.jpeg?width=700&format=pjpg&auto=webp&s=c89fb2940d7337e41e0c3751dd1e34ddb4b80b32",
        "Please just go away,  we don't need you as PM anymore. There are other capable people also",
        "So he lied again",
        "[Jhoot bolo...](https://youtu.be/_UseYmNV6is)",
        "So not even double in 10 years. At this rate it would take us decades to even reach where china is now.",
        "We used to dream of double digit growth similar to how China grew during the 2000’s. Now even 7-8% seems challenging. GDP would double every 10 years with 8% growth. We actually did achieve it during Manmohan Singh government. The last 10 years have been a huge lost opportunity.",
        "For sustained double digit growth, we need an authoritarian government. A government that can take progressive decisions without caring if the illiterate traditional conservative sect of society will vote for them.\n\nWe all talk about China and its amazing growth, but you all shy away when you realize what China sacrificed for that growth.",
        "Too bad the people would constantly vote for him",
        "Wish granted. Amit Shah is now the PM. "
    ],
    "cleaned_text": "pm modi highlights indias growth decade promises dynamic policies reading article makes question sanity exactly delusional disconnected become ground reality year rising economic struggles country endure starting unemployment high tariff rate etc kinds statements feel like adding salt already growing wound middleclass challenge anyone read article without atleast questioning exactly mind speaking words ",
    "cleaned_title": "pm modi highlights indias growth decade promises dynamic policies",
    "cleaned_selftext": "reading article makes question sanity exactly delusional disconnected become ground reality year rising economic struggles country endure starting unemployment high tariff rate etc kinds statements feel like adding salt already growing wound middleclass challenge anyone read article without atleast questioning exactly mind speaking words",
    "cleaned_comments": "delulu solulu india grew manmohan average annual growth goes chance discovering gravity mummy bas aaj ice cream khane pakka acche marks launga last years global economy expanded per cent whereas years economy india friends expanded nearly per cent also talking inclusive growth inclusivity funny lol amazes one pointing growth manmohan much higher actually decelerated think means growth population please go away dont need pm anymore capable people also lied jhoot bolohttpsyoutubeuseymnvis even double years rate would take us decades even reach china used dream double digit growth similar china grew even seems challenging gdp would double every years growth actually achieve manmohan singh government last years huge lost opportunity sustained double digit growth need authoritarian government government take progressive decisions without caring illiterate traditional conservative sect society vote talk china amazing growth shy away realize china sacrificed growth bad people would constantly vote wish granted amit shah pm",
    "light_cleaned_title": "PM Modi highlights India’s 90% growth in over a decade, promises dynamic policies",
    "light_cleaned_selftext": "Reading this article makes me question my own sanity and exactly how delusional and disconnected he has become from the ground reality. With each year, the rising economic struggles which the country has to endure starting with unemployment, high tariff rate, etc., these kinds of statements feel like adding salt to the already growing wound of the middle-class. I challenge anyone to read this article without atleast once questioning exactly what he had in mind while speaking these words.",
    "light_cleaned_comments": "Delulu is the only solulu India grew 150% under Manmohan. 6.6% average annual growth. There goes my chance of discovering gravity! *Mummy bas aaj ice cream khane do, pakka acche marks launga*.. “Over the last 10 years, the global economy has expanded by 35 per cent. Whereas, in the same 10 years, the economy of ~~India~~ my friends has expanded by nearly 90 per cent\". Also, his talking about inclusive growth and inclusivity is so funny to me lol It amazes me how no one is pointing that out. Growth under Manmohan was much higher. We have actually decelerated I think he means the growth of the population. Please just go away, we don't need you as PM anymore. There are other capable people also So he lied again [Jhoot bolo...](https://youtu.be/_UseYmNV6is) So not even double in 10 years. At this rate it would take us decades to even reach where china is now. We used to dream of double digit growth similar to how China grew during the 2000’s. Now even 7-8% seems challenging. GDP would double every 10 years with 8% growth. We actually did achieve it during Manmohan Singh government. The last 10 years have been a huge lost opportunity. For sustained double digit growth, we need an authoritarian government. A government that can take progressive decisions without caring if the illiterate traditional conservative sect of society will vote for them. We all talk about China and its amazing growth, but you all shy away when you realize what China sacrificed for that growth. Too bad the people would constantly vote for him Wish granted. Amit Shah is now the PM."
}