{
    "id": "1h8wuen",
    "title": "Supreme Court forms special bench to hear pleas challenging Places of Worship Act next week | India News - The Indian Express",
    "url": "https://indianexpress.com/article/india/sc-places-worship-act-pleas-special-bench-9711758/",
    "selftext": "The bench will be headed by Chief Justice of India Sanjiv Khanna and include Justices Sanjay Kumar and K V Viswanathan.\n\nThe Act declares that the character of a place of worship as of August 15, 1947, shall be maintained and that no suit or proceeding shall lie in any court in respect of any dispute against the encroachment of any religious properties at any point in time before this date.",
    "flair": "Law & Courts",
    "score": 122,
    "num_comments": 13,
    "created_utc": 1733590903.0,
    "convurl": "https://external-preview.redd.it/iPrzUdtivkSbMx7nhX5KMurFWtC2Vp8r8MMwVLP9-uo.jpg?auto=webp&s=93cb2bbd2b01b723c2dd411ed034ad23b1a6d317",
    "comments": [
        "I hope the bench is able to uphold the constitution and curtail the damage CJI's predecessor DYC inflicted on this country. DYC shall forever remain a dark blotch.",
        "https://preview.redd.it/afpwg5caug5e1.jpeg?width=1235&format=pjpg&auto=webp&s=88273aeb4d7e6a1fe3ae0496874042ce9fef7815",
        "Bilkul matt manno bhai , ye soch ke chalo ki court iss ko bhi raddi me fankne wala hai, ek pura establishment hai jo edi choti ka damm laga dega, ki kisi bhi tarah iss act ko cancel karaaya ja sake, jo kuch itne saloon se ho raha hai, vaha kuch bhi ye manana ki court me baithe log establishment ke samm damm dand bhed se muh chuda kar nikal jaenge, bekar hai , hamne dekha hai ki court me judges kaise bikk jate hai, ye toh vo matter hai jis se aane wale 50 se 100 saloon ki politics Chalni hai, koi bhi court se hope karna bekar hai ,",
        "You are expecting too much from them. I guess they would do the opposite, sadly.",
        "Courts are saffronised, just like every other constitutional body (ECI, ED, CBI, ITD, etc). Chandrachud did not even try to hide when Modi & him did Ganesh pooja together at his residence. It was a message.\n\nKhanna wouldn’t have been cleared if he wasn’t willing to tow the Hindutva line.",
        "Witness a sold out country, and the whores that sold it out. We stand for nothing.",
        "going by the evidence so far, they will pray to their hindu gods who will guide them to shred the constitution, and get rewarded in the form of post retirement jobs.",
        "Places of worship act during its institutionalisation itself said that temples under ASI are not under its purview. So, the present legal filings in different courts for verification of historic temples are valid.\nThe act says (verbatim):\n“- The disputed site of the Ayodhya Ram Temple was exempted from the Act.\n- Other exemptions under the Act:\nAny place of worship which is an ancient and historical monument or an archaeological site covered by the Ancient Monuments and Archaeological Sites and Remains Act, 1958.”",
        "https://preview.redd.it/cfaortfzak5e1.jpeg?width=666&format=pjpg&auto=webp&s=bbc5df4c4b8b186cf5d4da04b07c7d97336e7c09\n\n[PM Narendra Modi Visits CJI DY Chandrachud's Residence For Ganesh Puja](https://www.google.com/imgres?imgurl=https%3A%2F%2Fwww.livelaw.in%2Fh-upload%2F2024%2F09%2F11%2F750x450_560659-gxnaq12wuaes6qo.webp&tbnid=FTl_ogO3kxj7NM&vet=1&imgrefurl=https%3A%2F%2Fwww.livelaw.in%2Ftop-stories%2Fpm-narendra-modi-visits-cji-dy-chandrachuds-residence-for-ganesh-puja-269334&docid=R53DEACDqfAs_M&w=750&h=450&itg=1&source=sh%2Fx%2Fim%2Fm4%2F2&kgs=37a963a033bad97b)",
        "This is what happens when an ideology that was meant to remain at the fringes",
        "The country heads towards a Civil War if SCI does not declare all the pleas challenging Places of Worship act.",
        "The shitty half baked act would be thrown out of the window.",
        "Humble request to my fellow buddhist and jain brothers. If the act is declared null and void please immediately start reclaiming your long lost monasteries that have been turned into some other place of worship today. I have one near my house and I will try to file petition with court soon."
    ],
    "cleaned_text": "supreme court forms special bench hear pleas challenging places worship act next week india news indian express bench headed chief justice india sanjiv khanna include justices sanjay kumar k v viswanathan act declares character place worship august shall maintained suit proceeding shall lie court respect dispute encroachment religious properties point time date ",
    "cleaned_title": "supreme court forms special bench hear pleas challenging places worship act next week india news indian express",
    "cleaned_selftext": "bench headed chief justice india sanjiv khanna include justices sanjay kumar k v viswanathan act declares character place worship august shall maintained suit proceeding shall lie court respect dispute encroachment religious properties point time date",
    "cleaned_comments": "hope bench able uphold constitution curtail damage cjis predecessor dyc inflicted country dyc shall forever remain dark blotch bilkul matt manno bhai ye soch ke chalo ki court iss ko bhi raddi fankne wala hai ek pura establishment hai jo edi choti ka damm laga dega ki kisi bhi tarah iss act ko cancel karaaya ja sake jo kuch itne saloon se ho raha hai vaha kuch bhi ye manana ki court baithe log establishment ke samm damm dand bhed se muh chuda kar nikal jaenge bekar hai hamne dekha hai ki court judges kaise bikk jate hai ye toh vo matter hai jis se aane wale se saloon ki politics chalni hai koi bhi court se hope karna bekar hai expecting much guess would opposite sadly courts saffronised like every constitutional body eci ed cbi itd etc chandrachud even try hide modi ganesh pooja together residence message khanna wouldnt cleared wasnt willing tow hindutva line witness sold country whores sold stand nothing going evidence far pray hindu gods guide shred constitution get rewarded form post retirement jobs places worship act institutionalisation said temples asi purview present legal filings different courts verification historic temples valid act says verbatim disputed site ayodhya ram temple exempted act exemptions act place worship ancient historical monument archaeological site covered ancient monuments archaeological sites remains act pm narendra modi visits cji dy chandrachuds residence ganesh pujahttpswwwgooglecomimgresimgurlhttpsaffwwwlivelawinfhuploadffffxgxnaqwuaesqowebptbnidftlogokxjnmvetimgrefurlhttpsaffwwwlivelawinftopstoriesfpmnarendramodivisitscjidychandrachudsresidenceforganeshpujadocidrdeacdqfasmwhitgsourceshfxfimfmfkgsaabadb happens ideology meant remain fringes country heads towards civil war sci declare pleas challenging places worship act shitty half baked act would thrown window humble request fellow buddhist jain brothers act declared null void please immediately start reclaiming long lost monasteries turned place worship today one near house try file petition court soon",
    "light_cleaned_title": "Supreme Court forms special bench to hear pleas challenging Places of Worship Act next week | India News - The Indian Express",
    "light_cleaned_selftext": "The bench will be headed by Chief Justice of India Sanjiv Khanna and include Justices Sanjay Kumar and K V Viswanathan. The Act declares that the character of a place of worship as of August 15, 1947, shall be maintained and that no suit or proceeding shall lie in any court in respect of any dispute against the encroachment of any religious properties at any point in time before this date.",
    "light_cleaned_comments": "I hope the bench is able to uphold the constitution and curtail the damage CJI's predecessor DYC inflicted on this country. DYC shall forever remain a dark blotch. Bilkul matt manno bhai , ye soch ke chalo ki court iss ko bhi raddi me fankne wala hai, ek pura establishment hai jo edi choti ka damm laga dega, ki kisi bhi tarah iss act ko cancel karaaya ja sake, jo kuch itne saloon se ho raha hai, vaha kuch bhi ye manana ki court me baithe log establishment ke samm damm dand bhed se muh chuda kar nikal jaenge, bekar hai , hamne dekha hai ki court me judges kaise bikk jate hai, ye toh vo matter hai jis se aane wale 50 se 100 saloon ki politics Chalni hai, koi bhi court se hope karna bekar hai , You are expecting too much from them. I guess they would do the opposite, sadly. Courts are saffronised, just like every other constitutional body (ECI, ED, CBI, ITD, etc). Chandrachud did not even try to hide when Modi & him did Ganesh pooja together at his residence. It was a message. Khanna wouldn’t have been cleared if he wasn’t willing to tow the Hindutva line. Witness a sold out country, and the whores that sold it out. We stand for nothing. going by the evidence so far, they will pray to their hindu gods who will guide them to shred the constitution, and get rewarded in the form of post retirement jobs. Places of worship act during its institutionalisation itself said that temples under ASI are not under its purview. So, the present legal filings in different courts for verification of historic temples are valid. The act says (verbatim): “- The disputed site of the Ayodhya Ram Temple was exempted from the Act. - Other exemptions under the Act: Any place of worship which is an ancient and historical monument or an archaeological site covered by the Ancient Monuments and Archaeological Sites and Remains Act, 1958.” [PM Narendra Modi Visits CJI DY Chandrachud's Residence For Ganesh Puja](https://www.google.com/imgres?imgurl=https%3A%2F%2Fwww.livelaw.in%2Fh-upload%2F2024%2F09%2F11%2F750x450_560659-gxnaq12wuaes6qo.webp&tbnid=FTl_ogO3kxj7NM&vet=1&imgrefurl=https%3A%2F%2Fwww.livelaw.in%2Ftop-stories%2Fpm-narendra-modi-visits-cji-dy-chandrachuds-residence-for-ganesh-puja-269334&docid=R53DEACDqfAs_M&w=750&h=450&itg=1&source=sh%2Fx%2Fim%2Fm4%2F2&kgs=37a963a033bad97b) This is what happens when an ideology that was meant to remain at the fringes The country heads towards a Civil War if SCI does not declare all the pleas challenging Places of Worship act. The shitty half baked act would be thrown out of the window. Humble request to my fellow buddhist and jain brothers. If the act is declared null and void please immediately start reclaiming your long lost monasteries that have been turned into some other place of worship today. I have one near my house and I will try to file petition with court soon."
}