{
    "id": "16dauy1",
    "title": "Genuine question: Which democratic institutions are under attack in India right now? Super frustrated with RaGa constantly harping on same tune without giving any substantial examples",
    "url": "https://www.reddit.com/r/india/comments/16dauy1/genuine_question_which_democratic_institutions/",
    "selftext": "I really don’t understand why does he go to other countries and tell the media there that India is losing its democracy, or democratic norms are being murdered, or the latest that democratic institutions are under attack. What are some concrete instances of this? On the contrary, govt repealing farm laws - isn’t it a perfect example of how protests in this country yielded results against a full majority govt too. \n\nhttps://indianexpress.com/article/political-pulse/foreign-shores-rahul-gandhi-stirs-waters-raised-attack-democratic-institutions-european-lawmakers-concerned-8930791/",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694180246.0,
    "convurl": "https://external-preview.redd.it/1PrKuCAnklCRpLqiIsZbr4wRKWSwLqKmRfJ7WxuXqKg.jpg?auto=webp&s=dad779bf86f225aa3cae75a038d911029c19808c",
    "comments": [
        "**List of institutions under attack:**",
        "**List of institutions already taken over:**",
        "Can you tell me has CBI investigated any BJP MP/BJP MLA? Can you tell has ED investigated any BJP MP/BJP MLA? Has NIA been investigating any BJP people? \n\nAnd you'll say whichever political party will come in power will do that. Yeah it's true, even the previous government under UPA did that. But under BJP, it has used all these central agencies as a way to settle political scores(I ain't saying people in opposition are complete saints). \n \nsource:https://www.thequint.com/news/politics/cbi-ed-investigation-bjp-leaders-under-agencies-scanner",
        "A state reduced to UT (illegal as far as I understand)\n\nA UT with special status taken over with brute force, the powers of that govt taken away in the face of an unanimous 5 judge constitution bench order within days of the judgement\n\nContinuous operation lotus. With governors and speakers aiding them (SC held that in Maharashtra judgement)\n\nGovernors threatening governor's rule for not replying to letters, sitting on bills which has become the norm \n\nIIMs autonomy diluted without consultation\n\nPolice aiding rapists in cases\n\n\n\nHow many can one count. Attacking opposition ruled states, attacking academic institutions, attacking and pressurizing courts, refusing courts judgements, making the parliament one party business\n\n\nYes RaGa can be better at explaining and reasoning. But a recent article in Indian express talked about why kharge should be the pm face and raga should take organisational charge. \n\nIt pointed out that he doesn't gets into the specific details of running things, policy etc and more of sets the overall tone, something that people see as him not willing to take up a role in any govt.",
        "That farm laws fiasco was the biggest non-democratic thing I saw in last few years. A majority government passed the law. Even Congress had this one in their manifesto. But some political farmers groups from two states literally choked the capital. Government was ready for discussion but they weren't ready to agree on anything other than total abolition of the laws. And India missed yet another chance to revise ancient farm laws.",
        "EC, ED, CBI, SEBI, IT department, judiciary, all police forces under BJP govt's, media, and  surely I am missing some.\n\nOf course if one gets all their news from Godi media they.wouldn't know about it.(or any real news for that matter 🙂).",
        "A majority govt passed it through undemocratic means. And no Congress for not have those pass on their manifesto. Not even close.\n\nWhere did you get this info from?",
        "All university heads, top tier Armed forces positions,  large Govt , Semi Govt enterprise like banks, ONGC, CCI, etc, Judges, Election Commissions, Green tribunals, film & radio certification boards, etc etc...\n\nEvery top spot has a person who is a mix/strong believer of BJP & Sangh ideologies.",
        "To be fair, Congress did the same shit",
        "No they did not. Nowhere near this",
        "Yes, media is manipulated more than before. But let's not act like the freaking congress is the answer. Read history a bit - tax dept, ED, CBI, even the IB was used by Congress to hound opposition at the Center and worse at the States. \n\nI don't like the BJP either for the division they're spreading in society. But fuck the Congress too. They are the reason why Modi is still in power.",
        "There is an entire encyclopedia to write about this. But, I have a feeling this post is not in good faith. Why are you \"super frustrated\" about something you don't understand by your own admission? \n\nIf you are cherry-picking the example of the farm laws I suppose you are well aware of how the laws were passed without any consultation, and all the violence, torture, and humiliation inflicted by the ruling government on the farmers protesting against it. Or did you miss the part where hundreds of farmers died in a period that stretched over a year while the government absolutely ignored them before finally being forced to repeal it before the Punjab elections? \n\nYou don't appear to be very humble about your  ignorance. This is bait.",
        "Again it was no where near as shameless as this govt and yes the level does matter.\n\nIts funny how you blame Congress  for Modi and not Modi himself. I actually blame the people who voted for this govt and those who didn't vote.\n\nSo what is your answer?",
        "I do blame the Congress for Modi. Post Nehru, it's Congress's mishandling of economy and polity that gave rise to BJP. \n\nModi's propaganda is similar to the propaganda for Indira Gandhi and Rajiv Gandhi. \n\nFinally, Congress's non-stop corruption during UPA 2 paved the way for him. \n\nHeck, Congress even indirectly led to the Kashmiri Pandit pogrom.",
        "Media, Judiciary, State Security forces, Delhi Police, Educational Institutes to start with a few...",
        "But in each and every thing you have mentioned Modi's BJP is objectively worse than Congress. So I don't get your point.\n\nAlso by the same logic shouldn't AB Vajpayee's govt be blamed for UPA 🙂?\n\nFinally what is your answer to Modi?",
        "https://www.thehindu.com/news/national/congress-justifies-objection-to-farm-bills-despite-promising-similar-reforms-in-2019-manifesto/article32647708.ece",
        "https://manifesto.inc.in/en/agriculture.html\n\nSee point 11",
        "I never said which was worse. I only said whatever BJP has done, Congress has done in some form. Heck, if you want an example, Indira Gandhi literally imposed an Emergency because she was caught for election fraud. That's way worse than what BJP has done\n\nMy answer to Modi - Rahul Gandhi. Man lost an election in his historic home ground. But they still persist with him. Congress needed to clear up its act, which it has failed towards. Modi literally wins because people see RG as his main opponent.",
        "> My answer to Modi -\n\nThat was funny. So you choose the worst option. .\nYou claim to dislike all the divisive (aka fascistic) politics of Modi, agree that Congress is no worse than bjp in other factors and then choose a mass murderer 🤣.\n\n\nWhy even do all this pretension. May be you are trying to rationalize it for yourself.",
        "Show me where it says they proposed to remove MSP,?\nTook away the right  of farmers to file cases in court in case of Dispute with companies, and basically aimed to create a modern day firefall system.\n\nAll farm reform proposals aren't the same.",
        "Do you know what the issue with farm bills was?\n\nWhere does it say that they will not have MSP in contract farming ? Or give all the power to companies over farmers\n\nAlso does it say that the farm bills will be written without any involvement of farmer orgs?.",
        "Yes. That's the definition of free trade.\n\nRead the paragraph from \"Open-ended...\"\n\nhttps://m.economictimes.com/news/politics-and-nation/view-protest-is-fine-anarchy-is-not-protesting-farmers-should-accept-offer-to-suspend-the-laws-go-home/articleshow/80467589.cms\n\nWe already know India benefited with free market from 1991. There was literally the same argument back then. We know that labor needs to be shifted from farming to other sectors. MSP is holding back that transition. \n\nI understand the concern about immediate loss of jobs in Mandis. But that's not the reason not to repeal MSP. And know that only Punjab and Haryana farmers were so against this. Majority indian farmers were in support or agnostic.\n\nThis farmers protest have done two big damages in India: \n1) No government will touch farming infrastructure for at least 20 years. Indian farmers will remain on MSP - not earning much and not directly catering to Indian needs. \n2) It set up a precedence that a group can blackmail government by choking up the capital and climbing on Red Fort with propaganda flags and banners. It goes both ways. Don't be surprised when people from UP choke up the capital to demand more Parliament seats for bigger population, or religious fanatics asking for religious laws. Yes, passing farm laws by voice votes was undemocratic. But it would have passed any way (with majority government). But few farmers blackmailing against the wish of majority farmers and nation was a pure non-democratic nonsense.",
        "Wut? Congress caused the Sikh riots too. Indirectly led to the Kashmiri pandit massacre as well.",
        "Rahul Gandhi didn't nor did anyone else alive and relevant now. Neither is it the platform they are running on.\n\nBtw you probably don't know but BJP indirectly storeyed the Kashmiri pandit massacre. Now let's  see if you blame Modi for that 😉.",
        "Oh I completely blame Modi for a lot of things. I'd like to see RG come out and apologize for his party's actions in the past. I'd also like to see him pitch a guy who can actually compete with Modi in the upcoming elections. \n\nI see you're getting the feeling that I'm a BJP supporter. I'm not. All I'm trying to say is Congress is no savior. They might not have the same rhetoric against Muslims but given the chance there's nothing saying they won't act autocratically, too. There's plenty of precedent to support it.",
        "What are those things that you blame Modi for and why are you not holding him accountable for them? Has Modi apologized for the massacre orchestrated (by him ,not his party), in fact against the wishes of his  party leaders at the time?\n\nSee you can rationalize as much as you want, but if even after seeing 9 disastrous years of the worst administration in India's history one can still choose this  govt then I have news for then  they are a BJP person 😉.\n\nThe multiple historical level f*ckups this admin has done (due to their incompetence + complacence), but they know there are enough people they can fool  in the name of religion, that it does not matter to them. Even  one of these f*ckups would have caused any other govt to lose the next election.\n\nAs bad as Raga may be , he is 100 time better than Modi (practically anyone who isn't actively going to destroy the country is better).\n\nIn any case, you should proudly say you are a BJP person instead of trying to deny it.",
        "Fuck are you going on about. Stop assuming shit about me. I never talked about who's better out of the two. Just that Congress has been as shitty in the past. Seems like Jagdish effing Tytler burst your little bubble about Congress. If RG is that better than Modi he can start with apologizing.",
        "Come  on  this is almost  economics 101 stuff. Free trade creates more opportunities and growth but it also leads to more exploitation and disparity between the haves and have nots. That is why free trade needs to be and is always  regulated. One of the main jobs of the govt is to put in safe guards to protect the workers from exploitation.\n\nAnd that is where the conflict usually comes, as businesses want free hand to do whatever they want and corrupt govts like ours are happy to oblige.\n\nIn the case of these farm bills, any unbiased person with even an iota of knowledge about them can see that they were designed to benefit the businesses and didn't provide any protection for the farmers. I mean one has to be quite dumb to not understand why no farmers orgs were involved in drafting these bills.\n\nThe whole protest was against not having protection  for farmers in the bills. And if the govt was actually serious about bringing in farm reform they would have listened to farmers' demands. Instead they chose to just drop the bills because the main purpose of benefitting their rich \"friends\" wouldn't have been served then."
    ],
    "cleaned_text": "genuine question democratic institutions attack india right super frustrated raga constantly harping tune without giving substantial examples really dont understand go countries tell media india losing democracy democratic norms murdered latest democratic institutions attack concrete instances contrary govt repealing farm laws isnt perfect example protests country yielded results full majority govt ",
    "cleaned_title": "genuine question democratic institutions attack india right super frustrated raga constantly harping tune without giving substantial examples",
    "cleaned_selftext": "really dont understand go countries tell media india losing democracy democratic norms murdered latest democratic institutions attack concrete instances contrary govt repealing farm laws isnt perfect example protests country yielded results full majority govt",
    "cleaned_comments": "list institutions attack list institutions already taken tell cbi investigated bjp mpbjp mla tell ed investigated bjp mpbjp mla nia investigating bjp people youll say whichever political party come power yeah true even previous government upa bjp used central agencies way settle political scoresi aint saying people opposition complete saints sourcehttpswwwthequintcomnewspoliticscbiedinvestigationbjpleadersunderagenciesscanner state reduced ut illegal far understand ut special status taken brute force powers govt taken away face unanimous judge constitution bench order within days judgement continuous operation lotus governors speakers aiding sc held maharashtra judgement governors threatening governors rule replying letters sitting bills become norm iims autonomy diluted without consultation police aiding rapists cases many one count attacking opposition ruled states attacking academic institutions attacking pressurizing courts refusing courts judgements making parliament one party business yes raga better explaining reasoning recent article indian express talked kharge pm face raga take organisational charge pointed doesnt gets specific details running things policy etc sets overall tone something people see willing take role govt farm laws fiasco biggest nondemocratic thing saw last years majority government passed law even congress one manifesto political farmers groups two states literally choked capital government ready discussion werent ready agree anything total abolition laws india missed yet another chance revise ancient farm laws ec ed cbi sebi department judiciary police forces bjp govts media surely missing course one gets news godi media theywouldnt know itor real news matter majority govt passed undemocratic means congress pass manifesto even close get info university heads top tier armed forces positions large govt semi govt enterprise like banks ongc cci etc judges election commissions green tribunals film radio certification boards etc etc every top spot person mixstrong believer bjp sangh ideologies fair congress shit nowhere near yes media manipulated lets act like freaking congress answer read history bit tax dept ed cbi even ib used congress hound opposition center worse states dont like bjp either division theyre spreading society fuck congress reason modi still power entire encyclopedia write feeling post good faith super frustrated something dont understand admission cherrypicking example farm laws suppose well aware laws passed without consultation violence torture humiliation inflicted ruling government farmers protesting miss part hundreds farmers died period stretched year government absolutely ignored finally forced repeal punjab elections dont appear humble ignorance bait near shameless govt yes level matter funny blame congress modi modi actually blame people voted govt didnt vote answer blame congress modi post nehru congresss mishandling economy polity gave rise bjp modis propaganda similar propaganda indira gandhi rajiv gandhi finally congresss nonstop corruption upa paved way heck congress even indirectly led kashmiri pandit pogrom media judiciary state security forces delhi police educational institutes start every thing mentioned modis bjp objectively worse congress dont get point also logic shouldnt ab vajpayees govt blamed upa finally answer modi see point never said worse said whatever bjp done congress done form heck want example indira gandhi literally imposed emergency caught election fraud thats way worse bjp done answer modi rahul gandhi man lost election historic home ground still persist congress needed clear act failed towards modi literally wins people see rg main opponent answer modi funny choose worst option claim dislike divisive aka fascistic politics modi agree congress worse bjp factors choose mass murderer even pretension may trying rationalize show says proposed remove msp took away right farmers file cases court case dispute companies basically aimed create modern day firefall system farm reform proposals arent know issue farm bills say msp contract farming give power companies farmers also say farm bills written without involvement farmer orgs yes thats definition free trade read paragraph openended already know india benefited free market literally argument back know labor needs shifted farming sectors msp holding back transition understand concern immediate loss jobs mandis thats reason repeal msp know punjab haryana farmers majority indian farmers support agnostic farmers protest done two big damages india government touch farming infrastructure least years indian farmers remain msp earning much directly catering indian needs set precedence group blackmail government choking capital climbing red fort propaganda flags banners goes ways dont surprised people choke capital demand parliament seats bigger population religious fanatics asking religious laws yes passing farm laws voice votes undemocratic would passed way majority government farmers blackmailing wish majority farmers nation pure nondemocratic nonsense wut congress caused sikh riots indirectly led kashmiri pandit massacre well rahul gandhi didnt anyone else alive relevant neither platform running btw probably dont know bjp indirectly storeyed kashmiri pandit massacre lets see blame modi oh completely blame modi lot things id like see rg come apologize partys actions past id also like see pitch guy actually compete modi upcoming elections see youre getting feeling im bjp supporter im im trying say congress savior might rhetoric muslims given chance theres nothing saying wont act autocratically theres plenty precedent support things blame modi holding accountable modi apologized massacre orchestrated party fact wishes party leaders time see rationalize much want even seeing disastrous years worst administration indias history one still choose govt news bjp person multiple historical level fckups admin done due incompetence complacence know enough people fool name religion matter even one fckups would caused govt lose next election bad raga may time better modi practically anyone isnt actively going destroy country better case proudly say bjp person instead trying deny fuck going stop assuming shit never talked whos better two congress shitty past seems like jagdish effing tytler burst little bubble congress rg better modi start apologizing come almost economics stuff free trade creates opportunities growth also leads exploitation disparity haves nots free trade needs always regulated one main jobs govt put safe guards protect workers exploitation conflict usually comes businesses want free hand whatever want corrupt govts like happy oblige case farm bills unbiased person even iota knowledge see designed benefit businesses didnt provide protection farmers mean one quite dumb understand farmers orgs involved drafting bills whole protest protection farmers bills govt actually serious bringing farm reform would listened farmers demands instead chose drop bills main purpose benefitting rich friends wouldnt served",
    "light_cleaned_title": "Genuine question: Which democratic institutions are under attack in India right now? Super frustrated with RaGa constantly harping on same tune without giving any substantial examples",
    "light_cleaned_selftext": "I really don’t understand why does he go to other countries and tell the media there that India is losing its democracy, or democratic norms are being murdered, or the latest that democratic institutions are under attack. What are some concrete instances of this? On the contrary, govt repealing farm laws - isn’t it a perfect example of how protests in this country yielded results against a full majority govt too.",
    "light_cleaned_comments": "**List of institutions under attack:** **List of institutions already taken over:** Can you tell me has CBI investigated any BJP MP/BJP MLA? Can you tell has ED investigated any BJP MP/BJP MLA? Has NIA been investigating any BJP people? And you'll say whichever political party will come in power will do that. Yeah it's true, even the previous government under UPA did that. But under BJP, it has used all these central agencies as a way to settle political scores(I ain't saying people in opposition are complete saints). source:https://www.thequint.com/news/politics/cbi-ed-investigation-bjp-leaders-under-agencies-scanner A state reduced to UT (illegal as far as I understand) A UT with special status taken over with brute force, the powers of that govt taken away in the face of an unanimous 5 judge constitution bench order within days of the judgement Continuous operation lotus. With governors and speakers aiding them (SC held that in Maharashtra judgement) Governors threatening governor's rule for not replying to letters, sitting on bills which has become the norm IIMs autonomy diluted without consultation Police aiding rapists in cases How many can one count. Attacking opposition ruled states, attacking academic institutions, attacking and pressurizing courts, refusing courts judgements, making the parliament one party business Yes RaGa can be better at explaining and reasoning. But a recent article in Indian express talked about why kharge should be the pm face and raga should take organisational charge. It pointed out that he doesn't gets into the specific details of running things, policy etc and more of sets the overall tone, something that people see as him not willing to take up a role in any govt. That farm laws fiasco was the biggest non-democratic thing I saw in last few years. A majority government passed the law. Even Congress had this one in their manifesto. But some political farmers groups from two states literally choked the capital. Government was ready for discussion but they weren't ready to agree on anything other than total abolition of the laws. And India missed yet another chance to revise ancient farm laws. EC, ED, CBI, SEBI, IT department, judiciary, all police forces under BJP govt's, media, and surely I am missing some. Of course if one gets all their news from Godi media they.wouldn't know about it.(or any real news for that matter 🙂). A majority govt passed it through undemocratic means. And no Congress for not have those pass on their manifesto. Not even close. Where did you get this info from? All university heads, top tier Armed forces positions, large Govt , Semi Govt enterprise like banks, ONGC, CCI, etc, Judges, Election Commissions, Green tribunals, film & radio certification boards, etc etc... Every top spot has a person who is a mix/strong believer of BJP & Sangh ideologies. To be fair, Congress did the same shit No they did not. Nowhere near this Yes, media is manipulated more than before. But let's not act like the freaking congress is the answer. Read history a bit - tax dept, ED, CBI, even the IB was used by Congress to hound opposition at the Center and worse at the States. I don't like the BJP either for the division they're spreading in society. But fuck the Congress too. They are the reason why Modi is still in power. There is an entire encyclopedia to write about this. But, I have a feeling this post is not in good faith. Why are you \"super frustrated\" about something you don't understand by your own admission? If you are cherry-picking the example of the farm laws I suppose you are well aware of how the laws were passed without any consultation, and all the violence, torture, and humiliation inflicted by the ruling government on the farmers protesting against it. Or did you miss the part where hundreds of farmers died in a period that stretched over a year while the government absolutely ignored them before finally being forced to repeal it before the Punjab elections? You don't appear to be very humble about your ignorance. This is bait. Again it was no where near as shameless as this govt and yes the level does matter. Its funny how you blame Congress for Modi and not Modi himself. I actually blame the people who voted for this govt and those who didn't vote. So what is your answer? I do blame the Congress for Modi. Post Nehru, it's Congress's mishandling of economy and polity that gave rise to BJP. Modi's propaganda is similar to the propaganda for Indira Gandhi and Rajiv Gandhi. Finally, Congress's non-stop corruption during UPA 2 paved the way for him. Heck, Congress even indirectly led to the Kashmiri Pandit pogrom. Media, Judiciary, State Security forces, Delhi Police, Educational Institutes to start with a few... But in each and every thing you have mentioned Modi's BJP is objectively worse than Congress. So I don't get your point. Also by the same logic shouldn't AB Vajpayee's govt be blamed for UPA 🙂? Finally what is your answer to Modi? See point 11 I never said which was worse. I only said whatever BJP has done, Congress has done in some form. Heck, if you want an example, Indira Gandhi literally imposed an Emergency because she was caught for election fraud. That's way worse than what BJP has done My answer to Modi - Rahul Gandhi. Man lost an election in his historic home ground. But they still persist with him. Congress needed to clear up its act, which it has failed towards. Modi literally wins because people see RG as his main opponent. > My answer to Modi - That was funny. So you choose the worst option. . You claim to dislike all the divisive (aka fascistic) politics of Modi, agree that Congress is no worse than bjp in other factors and then choose a mass murderer 🤣. Why even do all this pretension. May be you are trying to rationalize it for yourself. Show me where it says they proposed to remove MSP,? Took away the right of farmers to file cases in court in case of Dispute with companies, and basically aimed to create a modern day firefall system. All farm reform proposals aren't the same. Do you know what the issue with farm bills was? Where does it say that they will not have MSP in contract farming ? Or give all the power to companies over farmers Also does it say that the farm bills will be written without any involvement of farmer orgs?. Yes. That's the definition of free trade. Read the paragraph from \"Open-ended...\" We already know India benefited with free market from 1991. There was literally the same argument back then. We know that labor needs to be shifted from farming to other sectors. MSP is holding back that transition. I understand the concern about immediate loss of jobs in Mandis. But that's not the reason not to repeal MSP. And know that only Punjab and Haryana farmers were so against this. Majority indian farmers were in support or agnostic. This farmers protest have done two big damages in India: 1) No government will touch farming infrastructure for at least 20 years. Indian farmers will remain on MSP - not earning much and not directly catering to Indian needs. 2) It set up a precedence that a group can blackmail government by choking up the capital and climbing on Red Fort with propaganda flags and banners. It goes both ways. Don't be surprised when people from UP choke up the capital to demand more Parliament seats for bigger population, or religious fanatics asking for religious laws. Yes, passing farm laws by voice votes was undemocratic. But it would have passed any way (with majority government). But few farmers blackmailing against the wish of majority farmers and nation was a pure non-democratic nonsense. Wut? Congress caused the Sikh riots too. Indirectly led to the Kashmiri pandit massacre as well. Rahul Gandhi didn't nor did anyone else alive and relevant now. Neither is it the platform they are running on. Btw you probably don't know but BJP indirectly storeyed the Kashmiri pandit massacre. Now let's see if you blame Modi for that 😉. Oh I completely blame Modi for a lot of things. I'd like to see RG come out and apologize for his party's actions in the past. I'd also like to see him pitch a guy who can actually compete with Modi in the upcoming elections. I see you're getting the feeling that I'm a BJP supporter. I'm not. All I'm trying to say is Congress is no savior. They might not have the same rhetoric against Muslims but given the chance there's nothing saying they won't act autocratically, too. There's plenty of precedent to support it. What are those things that you blame Modi for and why are you not holding him accountable for them? Has Modi apologized for the massacre orchestrated (by him ,not his party), in fact against the wishes of his party leaders at the time? See you can rationalize as much as you want, but if even after seeing 9 disastrous years of the worst administration in India's history one can still choose this govt then I have news for then they are a BJP person 😉. The multiple historical level f*ckups this admin has done (due to their incompetence + complacence), but they know there are enough people they can fool in the name of religion, that it does not matter to them. Even one of these f*ckups would have caused any other govt to lose the next election. As bad as Raga may be , he is 100 time better than Modi (practically anyone who isn't actively going to destroy the country is better). In any case, you should proudly say you are a BJP person instead of trying to deny it. Fuck are you going on about. Stop assuming shit about me. I never talked about who's better out of the two. Just that Congress has been as shitty in the past. Seems like Jagdish effing Tytler burst your little bubble about Congress. If RG is that better than Modi he can start with apologizing. Come on this is almost economics 101 stuff. Free trade creates more opportunities and growth but it also leads to more exploitation and disparity between the haves and have nots. That is why free trade needs to be and is always regulated. One of the main jobs of the govt is to put in safe guards to protect the workers from exploitation. And that is where the conflict usually comes, as businesses want free hand to do whatever they want and corrupt govts like ours are happy to oblige. In the case of these farm bills, any unbiased person with even an iota of knowledge about them can see that they were designed to benefit the businesses and didn't provide any protection for the farmers. I mean one has to be quite dumb to not understand why no farmers orgs were involved in drafting these bills. The whole protest was against not having protection for farmers in the bills. And if the govt was actually serious about bringing in farm reform they would have listened to farmers' demands. Instead they chose to just drop the bills because the main purpose of benefitting their rich \"friends\" wouldn't have been served then."
}