{
    "id": "1fi3ftm",
    "title": "As Punjab promotes teachers with no expertise in subjects; question mark over ‘flawed’ rules",
    "url": "https://indianexpress.com/article/cities/chandigarh/punjab-promote-teachers-no-expertise-subjects-flawed-rules-9570056/",
    "selftext": "Majority of promoted teachers, who would now teach class 11 and 12, haven’t studied those subjects in graduation. For instance, 227 teachers promoted as commerce lecturers haven’t passed B.Com",
    "flair": "Policy/Economy",
    "score": 19,
    "num_comments": 1,
    "created_utc": 1726490034.0,
    "convurl": "https://external-preview.redd.it/8CPPFF4b-dIpJ0d2FGaXr8nOcTK9NQiGoQjMAC01V6I.jpg?auto=webp&s=5fad18d8e9e8a2e8d2bb2febb47c096e082b4303",
    "comments": [
        "There were English teachers with MA in English who couldn't speak english at all. Most of English teachers use translate to teach in schools",
        " some teachers get a job through connection or bribes and political connections.",
        "Add jammu to this. Universities there are not hiring teachers full time. Classes are empty, one teacher handling multiple subjects with 50% salary."
    ],
    "cleaned_text": "punjab promotes teachers expertise subjects question mark flawed rules majority promoted teachers would teach class havent studied subjects graduation instance teachers promoted commerce lecturers havent passed bcom ",
    "cleaned_title": "punjab promotes teachers expertise subjects question mark flawed rules",
    "cleaned_selftext": "majority promoted teachers would teach class havent studied subjects graduation instance teachers promoted commerce lecturers havent passed bcom",
    "cleaned_comments": "english teachers english couldnt speak english english teachers use translate teach schools teachers get job connection bribes political connections add jammu universities hiring teachers full time classes empty one teacher handling multiple subjects salary",
    "light_cleaned_title": "As Punjab promotes teachers with no expertise in subjects; question mark over ‘flawed’ rules",
    "light_cleaned_selftext": "Majority of promoted teachers, who would now teach class 11 and 12, haven’t studied those subjects in graduation. For instance, 227 teachers promoted as commerce lecturers haven’t passed B.Com",
    "light_cleaned_comments": "There were English teachers with MA in English who couldn't speak english at all. Most of English teachers use translate to teach in schools some teachers get a job through connection or bribes and political connections. Add jammu to this. Universities there are not hiring teachers full time. Classes are empty, one teacher handling multiple subjects with 50% salary."
}