{
    "id": "1hbgx31",
    "title": "DHL express Has charged disbursement fee + igst on top of regular custom charges on my $40 watch",
    "url": "https://www.reddit.com/gallery/1hbgx31",
    "selftext": "I ordered a wrist watch of $40. It was cleared by customs yesterday and today I got an invoice from DHL. Can someone help me explain me how these charges are calculated? Can I disagree to pay any of these especially the disbursement fee. Here is a snippet of the invoice. Kindly guide me what needs to be done as the delivery is due tomorrow.\nThe express Cargo clearance bill doesn't have this disbursement fee+igst.\nPlease suggest how I should tackle this?\n",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1733877189.0,
    "convurl": "https://i.redd.it/c0ybuov2746e1.jpg",
    "comments": [
        "If you don't want to pay those changes you should have ordered it via IndiaPost. Any shipper will charge you a disbursement fee since they clear out all the customs paperwork for you and trust me you don't want to do that.",
        "It’s the service fee for handling clearance process and documentation on your behalf. It’s pretty standard. 1000 bucks is absolutely worth it.",
        "Importing goods is such a bitch in our country.\nIt's crazy that you have to pay more than the cost of the item itself.\nIn the US import duties are applicable only if the item value is over 500$",
        "Indiapost won't do customs paperwork?"
    ],
    "cleaned_text": "dhl express charged disbursement fee igst top regular custom charges watch ordered wrist watch cleared customs yesterday today got invoice dhl someone help explain charges calculated disagree pay especially disbursement fee snippet invoice kindly guide needs done delivery due tomorrow express cargo clearance bill doesnt disbursement feeigst please suggest tackle ",
    "cleaned_title": "dhl express charged disbursement fee igst top regular custom charges watch",
    "cleaned_selftext": "ordered wrist watch cleared customs yesterday today got invoice dhl someone help explain charges calculated disagree pay especially disbursement fee snippet invoice kindly guide needs done delivery due tomorrow express cargo clearance bill doesnt disbursement feeigst please suggest tackle",
    "cleaned_comments": "dont want pay changes ordered via indiapost shipper charge disbursement fee since clear customs paperwork trust dont want service fee handling clearance process documentation behalf pretty standard bucks absolutely worth importing goods bitch country crazy pay cost item us import duties applicable item value indiapost wont customs paperwork",
    "light_cleaned_title": "DHL express Has charged disbursement fee + igst on top of regular custom charges on my $40 watch",
    "light_cleaned_selftext": "I ordered a wrist watch of $40. It was cleared by customs yesterday and today I got an invoice from DHL. Can someone help me explain me how these charges are calculated? Can I disagree to pay any of these especially the disbursement fee. Here is a snippet of the invoice. Kindly guide me what needs to be done as the delivery is due tomorrow. The express Cargo clearance bill doesn't have this disbursement fee+igst. Please suggest how I should tackle this?",
    "light_cleaned_comments": "If you don't want to pay those changes you should have ordered it via IndiaPost. Any shipper will charge you a disbursement fee since they clear out all the customs paperwork for you and trust me you don't want to do that. It’s the service fee for handling clearance process and documentation on your behalf. It’s pretty standard. 1000 bucks is absolutely worth it. Importing goods is such a bitch in our country. It's crazy that you have to pay more than the cost of the item itself. In the US import duties are applicable only if the item value is over 500$ Indiapost won't do customs paperwork?"
}