{
    "id": "18gzp8t",
    "title": "Today indian court refused to recognize marital r*pe...the comments on social media by some indian men",
    "url": "https://www.reddit.com/gallery/18gzp8t",
    "selftext": "These are just some comments :(..some are even worse..it's kinda scary to think about their future wives....",
    "flair": "Law & Courts",
    "score": 61,
    "num_comments": 86,
    "created_utc": 1702422025.0,
    "convurl": "https://i.redd.it/z5lzk60p2y5c1.png",
    "comments": [
        "Recognition of Martial rape indeed would be catastrophic, you'd basically be subjecting men to the threat of 10 years imprisonment in almost every divorce. \n\nAs it is we have 75% case of rape being fake cases, 90% cases of domestic Violence being fake.\n\nThese laws do not help women who are being abused, as they simply do not have access to the authorities. \n\nInstead there should be social awareness campaigns on a national level, setting up more Women's Cell even in remote parts of the country. \n\nA major problem that arises is that women who actually are victim, do not even know where to file their complaints. While the ones with resources to hire a lawyer, are free to extort their husbands with full force of law and are handsomely rewarded for it.",
        "Sometimes one is doomed, either way.",
        "Correction, Indian court cannot punish marital rape because there is no such law, not because they don't want to recognise it. Courts don't make laws.",
        "Your screenshot shows some comments that are not related to the issue of marital rape at all. They are just saying ridiculous things.",
        "https://preview.redd.it/g80vmzp7my5c1.png?width=1080&format=pjpg&auto=webp&s=a3c496cbaab89e349c31cfa775e5bfcc7186bdfd",
        "Fuck… but don’t fuck around!",
        "You do know a lot of rape cases are completely fake right? The real cases get swept under the rug or are not even reported.",
        "Acquittal =/= fake case. This is the problem with widespread illiteracy about systems. An acquittal means the *state* failed to prove its burden beyond reasonable doubt. Usually it has more to do with the utter degradation of forensics, investigative skills and deep corruption among the police. It does not mean the case was fake, or that the person found non-guilty is necessarily innocent.",
        "Why is religion mixed with law? They should be studied as two different subjects.",
        "In Indian courts its very difficult to actually prove rape. The amount of evidence required is often lower than the amount of evidence required. This, however, does not mean that no rape happened. \n\nEvidence for rape often involves invasive procedures, time-bound reporting, and of course women have to also deal with trauma, alongside filing police complaints. It is really designed to make them fail. \n\nIn addition, try filing a rape complaint as a man, and you’ll be laughed out of the police station. Doesn’t mean that doesn’t happen.\n\nThe laws are designed to benefit men. Consent is not even a thing in the IPC. Marriage is not a certificate of consent to sex. \n\nIf none of this was true, we wouldn’t be forced to vote for alleged criminals into political positions. \n\nEducate yourself.",
        "Where even are you getting your statistics on 75% of rape cases and 90% of domestic violence cases being fake? \n\nI am surprised people immediately believed this without thorough research. NCRB data on the percentage of fake rape cases shows it at about 8%, which is generally in-line with the percentage of fake rape cases in the world (between 2 - 10%).",
        "No one is talking about acquittal. Indeed, in India majority of the rape cases are false cases filed for revenge.",
        "Bunch of dumbass vile idiots!",
        "Source: *trust me bro, i’m an engineer*",
        "Source?",
        "Who the fuck are you to call it fake?",
        "The image above explicitly equates acquittal with fake cases.\n\nAnd since the system does not infact track \"fake cases\" nor, legally, is there any way to find that a case is fake as a formal recourse, the claim is infact grounded in nonsense.",
        "You're either grossly misinformed, or a blatant liar.",
        "*an engineer, of course!* /s",
        "Yes",
        "Not to mention, the NCRB data classifies the percentage of fake rape cases as 8%, not 74%.\n\nSource: https://www.thenewsminute.com/news/what-data-false-rape-cases-doesn-t-tell-us-163631",
        "according to his logic, condoms should be banned as married couple must have sex only to procreate and unamrried people must not.",
        "He does ask for this in his tweets",
        "Another issue with people who want laws against marital rape is that they're not willing to explain how marital *rape* can be proven",
        "What's with the engineer shaming? Is this like a new trend or something?",
        "https://preview.redd.it/j5n3ry22xy5c1.png?width=1080&format=pjpg&auto=webp&s=ba93c8324b703122bc3c30358010efcb30f1b3fc",
        "I too can post random-ass images from anywhere without any sort of sourcing.\n\nhttps://preview.redd.it/rtcg134bxy5c1.png?width=620&format=png&auto=webp&s=620ddbda135266b973d309d6c7a6b83227e2232c",
        "Don't know why the link didn't go...\nHere it is.. https://timesofindia.indiatimes.com/city/delhi/we-need-a-movement-like-mentoo-because-crime-has-no-gender/articleshow/69366657.cms",
        "Not entirely true, accepting marital rape when the woman is of minority only, can be argued to be arbitrary and against article 14 and 21.",
        "Username checks out",
        ">Courts don't make laws.\n\nBullshit.  The makers of the Constitution of India have vested some extraordinary powers in the Supreme Court in the form of Articles 32, 136 and 142 of the Constitution of India. The Supreme Court uses these provisions to invoke its Equity Jurisdiction. \n\nThis is done on the basis of principles of equity. Various provisions of the Constitution of India act as the source of Equity Jurisdiction of the Supreme Court, are plenary in nature, with virtually no limits according to their text.  Though some are self-imposed by the Supreme Court.",
        "You know what you are saying is wrong",
        "Just a meme bro chill",
        "You ever wanna see how rotten the mind of Indian youth have become, just check comments on the tatva India page. I recently saw a post of theirs about a queer person committing suicide due to online bullying- the comments were literally all celebrating. When I was young, I used to think our generation is so much better than our parent’s because we are more progressive. Turns out, not so much.",
        "Section 375 ipc makes an exception in rapes for intercourse between man and his own wife, where wife not being under 15 years of age. And when you read that, the first thing that comes to mind is that \"but it is legal... and law doesn't recognise marital rape\" . Forget marital rape it makes pedophelia legal. Instead of opposing such laws people are saying as if nothing ever wrong has been done in the history of world which was legal and still wrong.",
        "The point is it should be a law. It's 2023.",
        "We lost a brother guys. Lost to a cult of apha men who defends the law despite it allows for raping even 15 year old if victim is his wife. Defender of rape and pedophelia that is what bro has become.",
        "The source of the Times of India article mentions the same NCRB data that 74% of rape cases are acquitted.\n\nAnother person has already explained above why that's not true, so I'll provide you with some more accurate data as shown by the NCRB: this [NewsMinute article](https://www.thenewsminute.com/news/what-data-false-rape-cases-doesn-t-tell-us-163631) that discusses about the percentage of fake rape cases. Even a flawed study like this (as discussed in the article) has shown that only about 8% of the cases are cases of false rape cases (as per the NCRB), which is generally in-line with the worldwide percentage.\n\nIf you're researching something, at least try to make out the difference between acquittals and actual false cases.",
        "Why don’t we punish marital rape and run social awareness campaigns talking against fake rape cases instead, you are full of shit",
        "Bhaisaab, i think he us talking about high courts. High courts dont have the power to make laws, and this, unfortunately was a case in the high court of Hyderabad i guess.",
        "Ah, pulling out statistics from your ass I see. \n\nIt is simple if a person files a complaint for being raped by their partner, separate them and give protection. \nThey do not have to be arrested without evidence. \n\nI mean what kind of backward ass country you wanna be if a rape victim is forced to live with their rapists. \n\nRecognize marital laws. It got legal recognition in a lot of countries. Why not here?",
        "Marital rape is cruel as it is, but then there is pedophilia. \n\nWhen I heard we don't have marital rape laws in the first place I was shocked. \nOur country is still backward.",
        "https://www.google.com/amp/s/theprint.in/judiciary/marriage-of-15-yr-muslim-girl-not-void-under-prohibition-of-child-marriage-act-says-high-court/1187128/%3famp",
        ">Bhaisaab,\n\nI misread. I thought the issue was before the Supreme Court. In any event, you must also know then that a woman could still have been granted relief/remedy and punishment for rapist under provisions of the Indian Penal Code, such as cruelty.  If provision was not utilized, court could have sought an amendment. \n\nIn the longer term perhaps, the idea is to force the legislature and alternatively seek review under the Supreme Court's equitable jurisdiction.",
        "There's no need for marital rape recognition to separate from an abusing partner, Look up the Domestic Violence act. Husband Forcing for sex is a ground for separation and divorce already. \n\nCriminalisation is what people are demanding",
        "Because there is no way to Marital Rape . You are married to that person, sharing the same living space 24/7, possibly even have kids. For Violence there can be medical reports and bruises. Unless a video recording show up there is no way to prove it. \n\nSo how can you send a person to prison without having proof of his guilt ?",
        "Why don't you 'inform' me or tell everyone the \"truth\"? \n\nJust because you don't like reality, does not make it disinformation",
        "NCRB data shows 75% Cases under Sec 376 result in acquittal. \n\nFor that 8% figure, go and Google what Non- Cognizable means. \n\nI am a lawyer and I have worked on such cases, don't substitute random shit tier Journalism for actual knowledge",
        "Then either you have data none of us have access to, or you're an absolute hack of a lawyer, because the report on the fake rape case data says that out of 43196 cases, [only 48 of them](https://www.thenewsminute.com/news/what-data-false-rape-cases-doesn-t-tell-us-163631) was registered as FR non-cognizable. That is about 0.11% of cases.\n\nEven disregarding the total number of cases, if we take into account the total number of cases on section Y alone, then the percentage of the number of cases registered as FR non-cognizable is less than 1%.",
        "I agree acquittal is not always similar to a fake case. But, in some instances,  an acquittal is equal to a fake case when the cases mentioned in the SS are considered. A lot of time young couples who elope and marry are forcibly dragged back home and then a POCSO case is registered in the boys name even if the girl is 1 day less than 18 irrespective of the fact that they eloped with each other's consent. Moreover, the boy and his family members are charged with kidnapping and outrage of woman modesty cases. \n\nI think I made my point of view.",
        "I will apologize if I initially came off as hostile, since you've been particularly nice about this discussion.\n\nIf you don't mind, could you send me any links on the percentages discussed above? The Times of India article doesn't seem to properly source the studies discussing on the majority of the false rape cases being parents who filed a rape case because their daughter eloped/rape on the false promise of marriage.",
        "Unfortunately, I am also searching for the same study but haven't found anything yet. Though the number of false cases (as 8%) might be undervalued given the pendency of rape cases in India as of 2020 was 94.2%. So there might be a good chance that other cases may turn up false too.\n\nThere was one instance where a man spent 20 years in jail for an alleged rape that didn't happen. It took the court 20 years to determine that he was innocent. \n\nThere are a multitude of pathways that have been allowed by the Indian judiciary for women to actually exploit. One of them is compromise where a woman who has filled a rape complaint against a man can withdraw the plea without any consequence. This has led to legal terrorism and extortion where women files rape cases against random person to extort money or to take revenge.\n\nAdd to that, the cases when ex-GFs come around some time after break up to file for rape in pretext of promise to marriage against their former lover.\n\nHowever, the real sufferers of these false cases (apart from the accused and their family) are the women who were actually raped or sexually assaulted as the pilling files push their case down the timeline.\n\n\nOne thing I noticed apart from results by NCRB, there are not many documented results. Even the report by NCRB doesn't touch upon all the subjects",
        "This is true for Hindu marriages as well.\n\n[https://www.livelaw.in/news-updates/karnataka-hc-has-set-aside-an-order-declaring-the-marriage-void-as-woman-was-minor-at-the-time-of-marriage-219705](https://www.livelaw.in/news-updates/karnataka-hc-has-set-aside-an-order-declaring-the-marriage-void-as-woman-was-minor-at-the-time-of-marriage-219705)\n\nIt should automatically be nullified and stand as void regardless. But at least it is not outright legal to marry someone of a minor age, but the bar is too low.",
        ":( judiciary need reforms",
        "Is it? Can you share an example? I'm not that active on Indian memes",
        "Ok",
        "The SC has already refused to hold marital rape as a crime. They did it earlier this year I believe.",
        "It's voidable but not void ab initio. There's actually often good reasons for that. One is that you want to ensure marriages of long standing aren't disrupted. If it turns out two people in a village somewhere who have been married for decades are suddenly not because one of them was a minor, you're risking a lot of inequitable outcomes for the wife. If the marriage was always void, then she would be the one who would have to fight for her rights while her husband could simply abandon her.\n\nThe way the current law is structured if the wife sought the voiding of the marriage she would get it. But it's not something other parties can use to deny women their rights from marriage just because the marriage was illegal.",
        "You're a lawyer and you don't know the difference between innocence and the state failing to meet a burden of proof (which is what acquittal is)?",
        "You don't think a husband abusing his wife and raping her should be grounds to jail his ass? Do you think women realize that walking around an open flame a few times means they are being voided of the ability to say no to the guy who also walked a few steps?",
        "It already is a ground for divorce, and covered under the Domestic Violence act. You can leave the husband, take his properties and have the court order  him to pay you monthly maintenance without any valid reason as it is. \n\nWhat more would be achieved by criminalizing Marital Rape?",
        ">What more would be achieved by criminalizing Marital Rape?\n\nMen who rape women should go to prison. As all criminals do. It's really that simple.",
        "If you are innocent and still falsely implicated in a case, after the trial no evidence against you has been found, would you not be acquitted?",
        ">The SC has already refused to hold marital rape as a crime.\n\nNot really. The Supreme Court in September 2022 held that the pregnancy of a married woman due to forcible sex by her husband can be treated as rape under the Medical Termination of Pregnancy Act.",
        "You cannot send someone to prison without evidence, and there is no rational way to prove marital rape. \n\nLive in the same house, sleep on the same bed and possibly even have kids together, no medical evidence can be there. How would you prove that the sexual act was committed without your consent? \n\nThe process would be the only punishment here, what else is there really",
        "So you're a lawyer who doesn't understand how the law works. Fascinating.\n\nBeing acquitted =/= being innocent. It means you are not guilty. More specifically it means the state failed to prove its burden beyond a reasonable doubt. It does not necessarily mean there was \"no evidence against you.\" In some cases it can mean there was no evidence. But that doesn't mean every acquittal=fake case. You'd think a trained lawyer would know these basics.",
        ">You cannot send someone to prison without evidence, and there is no rational way to prove marital rape.\n\nThere's plenty of ways to do it. Just because India is backwards doesn't mean the rest of the world is, and marital rape is criminalized in more civilized countries and they don't run into the endless problems the misogynists in India dream up. You prove rape in a marriage the same way you would prove it between an unmarried couple. The fact that a signed sheet of paper or having walked around a lit flame makes makes a legal difference is a testament to the idiocy and backwardness of Indian law on the subject. It doesn't make it rational. \n\n>Live in the same house, sleep on the same bed and possibly even have kids together, no medical evidence can be there. \n\nNo? Other countries manage to do it. Are Indians somehow uniquely unqualified? Or do Indian men deserve a special exemption for rape?\n\n>How would you prove that the sexual act was committed without your consent?\n\nAs I said, the same way you'd prove it if all the facts were the same and the couple weren't married. Which *is* criminalized in India.",
        "Not Guilty is indeed the standard of innocence, what other parameter can there even be?\n\nYou refuse to think and parrot the same thing again and again",
        "Common law judiciaries don't make findings of innocence. They make findings of guilt or lack thereof. Did you sleep through your foundations of law classes?",
        "Absolutely. It is high time it should be made a law. But the problem with saying that courts don't accept it, is that it takes the blame off of politicians, who should be pressured.",
        "I meant the high court but I can see how it can be misread, I'll edit it.",
        "Correct me if I'm wrong, but articles 14 and 21 talk about discrimination. There are two ways I feel like your argument will not work (again, correct me if I'm wrong):\n1. There would have to be a case that only happens to a woman belonging to a minority, but marital rape is not limited to minorities. So I don't think the discrimination angle works. \n2. If marital rape isn't criminalized, on what basis will the courts say that the woman has been discriminated against? Like, if there was no crime, then what discrimination?",
        "When i say minority i mean minor by age, martital rape is punishable if the girl is a minor. So to not give protections to major women, there is a case to be made that it is \"arbitrary\" and art 14 doesn't allow laws to be arbitrary",
        "Makes sense, it would be an argument you'd have to make in the Supreme Court for a change in the law though. Or talk to a politician.",
        "Yea so people are upset that the high court does not recognize this as arbitrary and extend these protections to all women.",
        "As they should be. It is a dire situation.",
        "> Unfortunately, I am also searching for the same study but haven't found anything yet. \n\nThe NewsMinute article does mention that many of the false cases tend to be parents who filed a rape case because their daughter eloped with her boyfriend. There is no mention of rape in the false promise of marriage, however. And no mention of these statistics is present in the NewsMinute article either.\n\n> Though the number of false cases (as 8%) might be undervalued given the pendency of rape cases in India as of 2020 was 94.2%. So there might be a good chance that other cases may turn up false too. \n\nThere are a few problems with this comment.\n\n1. How are you getting that big of a number? The NCRB statistics show that out of the 43196 reported cases, 15097 are pending investigations. That places it at about 34.94%, or 35%. I am referring to the NewsMinute article because I can't find the data on the NCRB website.\n2. I highly doubt that the values given by the NCRB are undervalued. In fact, I think that the values given by the NCRB are overvalued. Worldwide reporting of false rape cases vary from about 2% to 10% [(as per this study)](https://www.nsvrc.org/sites/default/files/2012-03/Publications_NSVRC_Overview_False-Reporting.pdf), and even this study makes mention of the fact that many of the published reports do not clearly define what constitutes a false allegation. So I'd argue that the NCRB report is overvalued, because there are several factors that also need to be considered, like \"the factors that may lead sexual violence survivors to withdraw their complaints, turn hostile during investigation or trial, or settle outside court\", as per the NewsMinute article.\n3. There could also be a good chance the pending cases are dropped due to lack of evidence, filed as non-cognizable, or considered as a mistake of fact or of law or civil dispute. Even in false cases, several factors also need to be considered, like the ones I mentioned above.\n\n>There was one instance where a man spent 20 years in jail for an alleged rape that didn't happen. It took the court 20 years to determine that he was innocent.  \n>  \n>There are a multitude of pathways that have been allowed by the Indian judiciary for women to actually exploit. One of them is compromise where a woman who has filled a rape complaint against a man can withdraw the plea without any consequence. This has led to legal terrorism and extortion where women files rape cases against random person to extort money or to take revenge.  \n>  \n>Add to that, the cases when ex-GFs come around some time after break up to file for rape in pretext of promise to marriage against their former lover.\n\nAnecdotal evidence doesn't necessarily translate to statistical evidence. Yes, these kinds of situations exist and it's absolutely sad to see people get fucked over by the justice system on these kinds of cases. But if this was such a commonplace problem, there would probably be proper statistics on such cases happening. But so far, any news on these kinds of situations happen every once in a while, while rape cases are so bad [a rape is reported every 16 minutes in our country](https://economictimes.indiatimes.com/news/politics-and-nation/ncrbs-report-reveals-a-rape-happens-every-16-minutes-in-india-up-tops-list-of-crimes-against-women/videoshow/78440875.cms). And that's just the reported number of rape cases. A study done by LiveMint says that [99.1% of sexual violence goes unreported](https://www.livemint.com/Politics/AV3sIKoEBAGZozALMX8THK/99-cases-of-sexual-assaults-go-unreported-govt-data-shows.html) in our country, and that's more worrisome over the gradual cases of women taking advantage of laws favoring them.\n\nI would generally favor amending such laws once we have achieved gender equality on par with the Scandinavian countries. But our country still has lots of progress to focus on in terms of women's rights too. In fact, even with the laws favoring women, [1 in 3 women in India have likely suffered from violence by an intimate partner](https://www.bmj.com/company/newsroom/1-in-3-women-in-india-is-likely-to-have-been-subjected-to-intimate-partner-violence/). So our best bet on men's rights is to focus on progress towards women's rights, so that greater gender equality can be achieved and this can pave the way for better gender-neutral laws.\n\n>However, the real sufferers of these false cases (apart from the accused and their family) are the women who were actually raped or sexually assaulted as the pilling files push their case down the timeline. \n\nUnfortunately true. This is why I generally disagree with cases like parents filing a case because their daughter eloped with her boyfriend, or cases where a woman files rape because the guy falsely promised to marry her, because it makes actual cases tough to look at.  \nWe need greater awareness on reporting sexual violence to the police, and a reform of the police and the judiciary system. \n\n>One thing I noticed apart from results by NCRB, there are not many documented results. Even the report by NCRB doesn't touch upon all the subjects \n\nYeah, that's true. The most I could find that correlates to the percentage you discussed was [this Hindu article](https://www.thehindu.com/data/the-many-shades-of-rape-cases-in-delhi/article6261042.ece) that says that of the 460 cases sent to court, 41% of the cases were cases where parents made a case over elopement, and 24% of the cases were cases of rape on the false promise of marriage.  \n\n\nAnyway, if you wish to further discuss this with me, feel free to message me in my DMs. I will get back to you as soon as I can if I have the time.",
        "1. How are you getting that big of a number? The NCRB statistics show that out of the 43196 reported cases, 15097 are pending investigations. That places it at about 34.94%, or 35%. I am referring to the NewsMinute article because I can't find...\n\nAnswer: The NCRB report shows yearly data only. But, to get to the context of the info, you have to add in cases that were pending over the years too.\n\nI am attaching one SS from a post shared by renowned MRA Dipika Bhardwaj.\n\nhttps://preview.redd.it/a88rx08ns86c1.png?width=1080&format=pjpg&auto=webp&s=b54d28f505a0e970cb1fd302761c8aaa939be9dc\n\nI probably quoted you the earlier figure, but current rape case pendency in 93.5% which is extremely high. Delayed justice is no justice at all.\n\nNot to mention that a majority of the cases will never get a hearing. Some will be settled outside the purview of law (through monetary compensation or through threats of further physical or psychological damages).\n\nMoreover, the justice system is a bit biased and full of contradictions. While there are bills being introduced where mental harassment of women will be termed as cruelty, for men loss of reputation doesn't hold good as mental harassment. ( [https://timesofindia.indiatimes.com/city/delhi/harassment-case-delhi-hc-rejects-plea-to-prosecute-woman/articleshow/94440084.cms](https://timesofindia.indiatimes.com/city/delhi/harassment-case-delhi-hc-rejects-plea-to-prosecute-woman/articleshow/94440084.cms))"
    ],
    "cleaned_text": "today indian court refused recognize marital rpethe comments social media indian men comments even worseits kinda scary think future wives ",
    "cleaned_title": "today indian court refused recognize marital rpethe comments social media indian men",
    "cleaned_selftext": "comments even worseits kinda scary think future wives",
    "cleaned_comments": "recognition martial rape indeed would catastrophic youd basically subjecting men threat years imprisonment almost every divorce case rape fake cases cases domestic violence fake laws help women abused simply access authorities instead social awareness campaigns national level setting womens cell even remote parts country major problem arises women actually victim even know file complaints ones resources hire lawyer free extort husbands full force law handsomely rewarded sometimes one doomed either way correction indian court punish marital rape law dont want recognise courts dont make laws screenshot shows comments related issue marital rape saying ridiculous things fuck dont fuck around know lot rape cases completely fake right real cases get swept rug even reported acquittal fake case problem widespread illiteracy systems acquittal means state failed prove burden beyond reasonable doubt usually utter degradation forensics investigative skills deep corruption among police mean case fake person found nonguilty necessarily innocent religion mixed law studied two different subjects indian courts difficult actually prove rape amount evidence required often lower amount evidence required however mean rape happened evidence rape often involves invasive procedures timebound reporting course women also deal trauma alongside filing police complaints really designed make fail addition try filing rape complaint man youll laughed police station doesnt mean doesnt happen laws designed benefit men consent even thing ipc marriage certificate consent sex none true wouldnt forced vote alleged criminals political positions educate even getting statistics rape cases domestic violence cases fake surprised people immediately believed without thorough research ncrb data percentage fake rape cases shows generally inline percentage fake rape cases world one talking acquittal indeed india majority rape cases false cases filed revenge bunch dumbass vile idiots source trust bro im engineer source fuck call fake image explicitly equates acquittal fake cases since system infact track fake cases legally way find case fake formal recourse claim infact grounded nonsense youre either grossly misinformed blatant liar engineer course yes mention ncrb data classifies percentage fake rape cases source according logic condoms banned married couple must sex procreate unamrried people must ask tweets another issue people want laws marital rape theyre willing explain marital rape proven whats engineer shaming like new trend something post randomass images anywhere without sort sourcing dont know link didnt go entirely true accepting marital rape woman minority argued arbitrary article username checks courts dont make laws bullshit makers constitution india vested extraordinary powers supreme court form articles constitution india supreme court uses provisions invoke equity jurisdiction done basis principles equity various provisions constitution india act source equity jurisdiction supreme court plenary nature virtually limits according text though selfimposed supreme court know saying wrong meme bro chill ever wan na see rotten mind indian youth become check comments tatva india page recently saw post queer person committing suicide due online bullying comments literally celebrating young used think generation much better parents progressive turns much section ipc makes exception rapes intercourse man wife wife years age read first thing comes mind legal law doesnt recognise marital rape forget marital rape makes pedophelia legal instead opposing laws people saying nothing ever wrong done history world legal still wrong point law lost brother guys lost cult apha men defends law despite allows raping even year old victim wife defender rape pedophelia bro become source times india article mentions ncrb data rape cases acquitted another person already explained thats true ill provide accurate data shown ncrb newsminute articlehttpswwwthenewsminutecomnewswhatdatafalserapecasesdoesnttellus discusses percentage fake rape cases even flawed study like discussed article shown cases cases false rape cases per ncrb generally inline worldwide percentage youre researching something least try make difference acquittals actual false cases dont punish marital rape run social awareness campaigns talking fake rape cases instead full shit bhaisaab think us talking high courts high courts dont power make laws unfortunately case high court hyderabad guess ah pulling statistics ass see simple person files complaint raped partner separate give protection arrested without evidence mean kind backward ass country wan na rape victim forced live rapists recognize marital laws got legal recognition lot countries marital rape cruel pedophilia heard dont marital rape laws first place shocked country still backward bhaisaab misread thought issue supreme court event must also know woman could still granted reliefremedy punishment rapist provisions indian penal code cruelty provision utilized court could sought amendment longer term perhaps idea force legislature alternatively seek review supreme courts equitable jurisdiction theres need marital rape recognition separate abusing partner look domestic violence act husband forcing sex ground separation divorce already criminalisation people demanding way marital rape married person sharing living space possibly even kids violence medical reports bruises unless video recording show way prove send person prison without proof guilt dont inform tell everyone truth dont like reality make disinformation ncrb data shows cases sec result acquittal figure go google non cognizable means lawyer worked cases dont substitute random shit tier journalism actual knowledge either data none us access youre absolute hack lawyer report fake rape case data says cases themhttpswwwthenewsminutecomnewswhatdatafalserapecasesdoesnttellus registered fr noncognizable cases even disregarding total number cases take account total number cases section alone percentage number cases registered fr noncognizable less agree acquittal always similar fake case instances acquittal equal fake case cases mentioned ss considered lot time young couples elope marry forcibly dragged back home pocso case registered boys name even girl day less irrespective fact eloped others consent moreover boy family members charged kidnapping outrage woman modesty cases think made point view apologize initially came hostile since youve particularly nice discussion dont mind could send links percentages discussed times india article doesnt seem properly source studies discussing majority false rape cases parents filed rape case daughter elopedrape false promise marriage unfortunately also searching study havent found anything yet though number false cases might undervalued given pendency rape cases india might good chance cases may turn false one instance man spent years jail alleged rape didnt happen took court years determine innocent multitude pathways allowed indian judiciary women actually exploit one compromise woman filled rape complaint man withdraw plea without consequence led legal terrorism extortion women files rape cases random person extort money take revenge add cases exgfs come around time break file rape pretext promise marriage former lover however real sufferers false cases apart accused family women actually raped sexually assaulted pilling files push case timeline one thing noticed apart results ncrb many documented results even report ncrb doesnt touch upon subjects true hindu marriages well httpswwwlivelawinnewsupdateskarnatakahchassetasideanorderdeclaringthemarriagevoidaswomanwasminoratthetimeofmarriagehttpswwwlivelawinnewsupdateskarnatakahchassetasideanorderdeclaringthemarriagevoidaswomanwasminoratthetimeofmarriage automatically nullified stand void regardless least outright legal marry someone minor age bar low judiciary need reforms share example im active indian memes ok sc already refused hold marital rape crime earlier year believe voidable void ab initio theres actually often good reasons one want ensure marriages long standing arent disrupted turns two people village somewhere married decades suddenly one minor youre risking lot inequitable outcomes wife marriage always void would one would fight rights husband could simply abandon way current law structured wife sought voiding marriage would get something parties use deny women rights marriage marriage illegal youre lawyer dont know difference innocence state failing meet burden proof acquittal dont think husband abusing wife raping grounds jail ass think women realize walking around open flame times means voided ability say guy also walked steps already ground divorce covered domestic violence act leave husband take properties court order pay monthly maintenance without valid reason would achieved criminalizing marital rape would achieved criminalizing marital rape men rape women go prison criminals really simple innocent still falsely implicated case trial evidence found would acquitted sc already refused hold marital rape crime really supreme court september held pregnancy married woman due forcible sex husband treated rape medical termination pregnancy act send someone prison without evidence rational way prove marital rape live house sleep bed possibly even kids together medical evidence would prove sexual act committed without consent process would punishment else really youre lawyer doesnt understand law works fascinating acquitted innocent means guilty specifically means state failed prove burden beyond reasonable doubt necessarily mean evidence cases mean evidence doesnt mean every acquittalfake case youd think trained lawyer would know basics send someone prison without evidence rational way prove marital rape theres plenty ways india backwards doesnt mean rest world marital rape criminalized civilized countries dont run endless problems misogynists india dream prove rape marriage way would prove unmarried couple fact signed sheet paper walked around lit flame makes makes legal difference testament idiocy backwardness indian law subject doesnt make rational live house sleep bed possibly even kids together medical evidence countries manage indians somehow uniquely unqualified indian men deserve special exemption rape would prove sexual act committed without consent said way youd prove facts couple werent married criminalized india guilty indeed standard innocence parameter even refuse think parrot thing common law judiciaries dont make findings innocence make findings guilt lack thereof sleep foundations law classes absolutely high time made law problem saying courts dont accept takes blame politicians pressured meant high court see misread ill edit correct im wrong articles talk discrimination two ways feel like argument work correct im wrong would case happens woman belonging minority marital rape limited minorities dont think discrimination angle works marital rape isnt criminalized basis courts say woman discriminated like crime discrimination say minority mean minor age martital rape punishable girl minor give protections major women case made arbitrary art doesnt allow laws arbitrary makes sense would argument youd make supreme court change law though talk politician yea people upset high court recognize arbitrary extend protections women dire situation unfortunately also searching study havent found anything yet newsminute article mention many false cases tend parents filed rape case daughter eloped boyfriend mention rape false promise marriage however mention statistics present newsminute article either though number false cases might undervalued given pendency rape cases india might good chance cases may turn false problems comment getting big number ncrb statistics show reported cases pending investigations places referring newsminute article cant find data ncrb website highly doubt values given ncrb undervalued fact think values given ncrb overvalued worldwide reporting false rape cases vary per studyhttpswwwnsvrcorgsitesdefaultfilespublicationsnsvrcoverviewfalsereportingpdf even study makes mention fact many published reports clearly define constitutes false allegation id argue ncrb report overvalued several factors also need considered like factors may lead sexual violence survivors withdraw complaints turn hostile investigation trial settle outside court per newsminute article could also good chance pending cases dropped due lack evidence filed noncognizable considered mistake fact law civil dispute even false cases several factors also need considered like ones mentioned one instance man spent years jail alleged rape didnt happen took court years determine innocent multitude pathways allowed indian judiciary women actually exploit one compromise woman filled rape complaint man withdraw plea without consequence led legal terrorism extortion women files rape cases random person extort money take revenge add cases exgfs come around time break file rape pretext promise marriage former lover anecdotal evidence doesnt necessarily translate statistical evidence yes kinds situations exist absolutely sad see people get fucked justice system kinds cases commonplace problem would probably proper statistics cases happening far news kinds situations happen every rape cases bad rape reported every minutes countryhttpseconomictimesindiatimescomnewspoliticsandnationncrbsreportrevealsarapehappenseveryminutesinindiauptopslistofcrimesagainstwomenvideoshowcms thats reported number rape cases study done livemint says sexual violence goes unreportedhttpswwwlivemintcompoliticsavsikoebagzozalmxthkcasesofsexualassaultsgounreportedgovtdatashowshtml country thats worrisome gradual cases women taking advantage laws favoring would generally favor amending laws achieved gender equality par scandinavian countries country still lots progress focus terms womens rights fact even laws favoring women women india likely suffered violence intimate partnerhttpswwwbmjcomcompanynewsroominwomeninindiaislikelytohavebeensubjectedtointimatepartnerviolence best bet mens rights focus progress towards womens rights greater gender equality achieved pave way better genderneutral laws however real sufferers false cases apart accused family women actually raped sexually assaulted pilling files push case timeline unfortunately true generally disagree cases like parents filing case daughter eloped boyfriend cases woman files rape guy falsely promised marry makes actual cases tough look need greater awareness reporting sexual violence police reform police judiciary system one thing noticed apart results ncrb many documented results even report ncrb doesnt touch upon subjects yeah thats true could find correlates percentage discussed hindu articlehttpswwwthehinducomdatathemanyshadesofrapecasesindelhiarticleece says cases sent court cases cases parents made case elopement cases cases rape false promise marriage anyway wish discuss feel free message dms get back soon time getting big number ncrb statistics show reported cases pending investigations places referring newsminute article cant find answer ncrb report shows yearly data get context info add cases pending years attaching one ss post shared renowned mra dipika bhardwaj probably quoted earlier figure current rape case pendency extremely high delayed justice justice mention majority cases never get hearing settled outside purview law monetary compensation threats physical psychological damages moreover justice system bit biased full contradictions bills introduced mental harassment women termed cruelty men loss reputation doesnt hold good mental harassment httpstimesofindiaindiatimescomcitydelhiharassmentcasedelhihcrejectspleatoprosecutewomanarticleshowcmshttpstimesofindiaindiatimescomcitydelhiharassmentcasedelhihcrejectspleatoprosecutewomanarticleshowcms",
    "light_cleaned_title": "Today indian court refused to recognize marital r*pe...the comments on social media by some indian men",
    "light_cleaned_selftext": "These are just some comments :(..some are even worse..it's kinda scary to think about their future wives....",
    "light_cleaned_comments": "Recognition of Martial rape indeed would be catastrophic, you'd basically be subjecting men to the threat of 10 years imprisonment in almost every divorce. As it is we have 75% case of rape being fake cases, 90% cases of domestic Violence being fake. These laws do not help women who are being abused, as they simply do not have access to the authorities. Instead there should be social awareness campaigns on a national level, setting up more Women's Cell even in remote parts of the country. A major problem that arises is that women who actually are victim, do not even know where to file their complaints. While the ones with resources to hire a lawyer, are free to extort their husbands with full force of law and are handsomely rewarded for it. Sometimes one is doomed, either way. Correction, Indian court cannot punish marital rape because there is no such law, not because they don't want to recognise it. Courts don't make laws. Your screenshot shows some comments that are not related to the issue of marital rape at all. They are just saying ridiculous things. Fuck… but don’t fuck around! You do know a lot of rape cases are completely fake right? The real cases get swept under the rug or are not even reported. Acquittal =/= fake case. This is the problem with widespread illiteracy about systems. An acquittal means the *state* failed to prove its burden beyond reasonable doubt. Usually it has more to do with the utter degradation of forensics, investigative skills and deep corruption among the police. It does not mean the case was fake, or that the person found non-guilty is necessarily innocent. Why is religion mixed with law? They should be studied as two different subjects. In Indian courts its very difficult to actually prove rape. The amount of evidence required is often lower than the amount of evidence required. This, however, does not mean that no rape happened. Evidence for rape often involves invasive procedures, time-bound reporting, and of course women have to also deal with trauma, alongside filing police complaints. It is really designed to make them fail. In addition, try filing a rape complaint as a man, and you’ll be laughed out of the police station. Doesn’t mean that doesn’t happen. The laws are designed to benefit men. Consent is not even a thing in the IPC. Marriage is not a certificate of consent to sex. If none of this was true, we wouldn’t be forced to vote for alleged criminals into political positions. Educate yourself. Where even are you getting your statistics on 75% of rape cases and 90% of domestic violence cases being fake? I am surprised people immediately believed this without thorough research. NCRB data on the percentage of fake rape cases shows it at about 8%, which is generally in-line with the percentage of fake rape cases in the world (between 2 - 10%). No one is talking about acquittal. Indeed, in India majority of the rape cases are false cases filed for revenge. Bunch of dumbass vile idiots! Source: *trust me bro, i’m an engineer* Source? Who the fuck are you to call it fake? The image above explicitly equates acquittal with fake cases. And since the system does not infact track \"fake cases\" nor, legally, is there any way to find that a case is fake as a formal recourse, the claim is infact grounded in nonsense. You're either grossly misinformed, or a blatant liar. *an engineer, of course!* /s Yes Not to mention, the NCRB data classifies the percentage of fake rape cases as 8%, not 74%. Source: according to his logic, condoms should be banned as married couple must have sex only to procreate and unamrried people must not. He does ask for this in his tweets Another issue with people who want laws against marital rape is that they're not willing to explain how marital *rape* can be proven What's with the engineer shaming? Is this like a new trend or something? I too can post random-ass images from anywhere without any sort of sourcing. Don't know why the link didn't go... Here it is.. Not entirely true, accepting marital rape when the woman is of minority only, can be argued to be arbitrary and against article 14 and 21. Username checks out >Courts don't make laws. Bullshit. The makers of the Constitution of India have vested some extraordinary powers in the Supreme Court in the form of Articles 32, 136 and 142 of the Constitution of India. The Supreme Court uses these provisions to invoke its Equity Jurisdiction. This is done on the basis of principles of equity. Various provisions of the Constitution of India act as the source of Equity Jurisdiction of the Supreme Court, are plenary in nature, with virtually no limits according to their text. Though some are self-imposed by the Supreme Court. You know what you are saying is wrong Just a meme bro chill You ever wanna see how rotten the mind of Indian youth have become, just check comments on the tatva India page. I recently saw a post of theirs about a queer person committing suicide due to online bullying- the comments were literally all celebrating. When I was young, I used to think our generation is so much better than our parent’s because we are more progressive. Turns out, not so much. Section 375 ipc makes an exception in rapes for intercourse between man and his own wife, where wife not being under 15 years of age. And when you read that, the first thing that comes to mind is that \"but it is legal... and law doesn't recognise marital rape\" . Forget marital rape it makes pedophelia legal. Instead of opposing such laws people are saying as if nothing ever wrong has been done in the history of world which was legal and still wrong. The point is it should be a law. It's 2023. We lost a brother guys. Lost to a cult of apha men who defends the law despite it allows for raping even 15 year old if victim is his wife. Defender of rape and pedophelia that is what bro has become. The source of the Times of India article mentions the same NCRB data that 74% of rape cases are acquitted. Another person has already explained above why that's not true, so I'll provide you with some more accurate data as shown by the NCRB: this [NewsMinute article](https://www.thenewsminute.com/news/what-data-false-rape-cases-doesn-t-tell-us-163631) that discusses about the percentage of fake rape cases. Even a flawed study like this (as discussed in the article) has shown that only about 8% of the cases are cases of false rape cases (as per the NCRB), which is generally in-line with the worldwide percentage. If you're researching something, at least try to make out the difference between acquittals and actual false cases. Why don’t we punish marital rape and run social awareness campaigns talking against fake rape cases instead, you are full of shit Bhaisaab, i think he us talking about high courts. High courts dont have the power to make laws, and this, unfortunately was a case in the high court of Hyderabad i guess. Ah, pulling out statistics from your ass I see. It is simple if a person files a complaint for being raped by their partner, separate them and give protection. They do not have to be arrested without evidence. I mean what kind of backward ass country you wanna be if a rape victim is forced to live with their rapists. Recognize marital laws. It got legal recognition in a lot of countries. Why not here? Marital rape is cruel as it is, but then there is pedophilia. When I heard we don't have marital rape laws in the first place I was shocked. Our country is still backward. >Bhaisaab, I misread. I thought the issue was before the Supreme Court. In any event, you must also know then that a woman could still have been granted relief/remedy and punishment for rapist under provisions of the Indian Penal Code, such as cruelty. If provision was not utilized, court could have sought an amendment. In the longer term perhaps, the idea is to force the legislature and alternatively seek review under the Supreme Court's equitable jurisdiction. There's no need for marital rape recognition to separate from an abusing partner, Look up the Domestic Violence act. Husband Forcing for sex is a ground for separation and divorce already. Criminalisation is what people are demanding Because there is no way to Marital Rape . You are married to that person, sharing the same living space 24/7, possibly even have kids. For Violence there can be medical reports and bruises. Unless a video recording show up there is no way to prove it. So how can you send a person to prison without having proof of his guilt ? Why don't you 'inform' me or tell everyone the \"truth\"? Just because you don't like reality, does not make it disinformation NCRB data shows 75% Cases under Sec 376 result in acquittal. For that 8% figure, go and Google what Non- Cognizable means. I am a lawyer and I have worked on such cases, don't substitute random shit tier Journalism for actual knowledge Then either you have data none of us have access to, or you're an absolute hack of a lawyer, because the report on the fake rape case data says that out of 43196 cases, [only 48 of them](https://www.thenewsminute.com/news/what-data-false-rape-cases-doesn-t-tell-us-163631) was registered as FR non-cognizable. That is about 0.11% of cases. Even disregarding the total number of cases, if we take into account the total number of cases on section Y alone, then the percentage of the number of cases registered as FR non-cognizable is less than 1%. I agree acquittal is not always similar to a fake case. But, in some instances, an acquittal is equal to a fake case when the cases mentioned in the SS are considered. A lot of time young couples who elope and marry are forcibly dragged back home and then a POCSO case is registered in the boys name even if the girl is 1 day less than 18 irrespective of the fact that they eloped with each other's consent. Moreover, the boy and his family members are charged with kidnapping and outrage of woman modesty cases. I think I made my point of view. I will apologize if I initially came off as hostile, since you've been particularly nice about this discussion. If you don't mind, could you send me any links on the percentages discussed above? The Times of India article doesn't seem to properly source the studies discussing on the majority of the false rape cases being parents who filed a rape case because their daughter eloped/rape on the false promise of marriage. Unfortunately, I am also searching for the same study but haven't found anything yet. Though the number of false cases (as 8%) might be undervalued given the pendency of rape cases in India as of 2020 was 94.2%. So there might be a good chance that other cases may turn up false too. There was one instance where a man spent 20 years in jail for an alleged rape that didn't happen. It took the court 20 years to determine that he was innocent. There are a multitude of pathways that have been allowed by the Indian judiciary for women to actually exploit. One of them is compromise where a woman who has filled a rape complaint against a man can withdraw the plea without any consequence. This has led to legal terrorism and extortion where women files rape cases against random person to extort money or to take revenge. Add to that, the cases when ex-GFs come around some time after break up to file for rape in pretext of promise to marriage against their former lover. However, the real sufferers of these false cases (apart from the accused and their family) are the women who were actually raped or sexually assaulted as the pilling files push their case down the timeline. One thing I noticed apart from results by NCRB, there are not many documented results. Even the report by NCRB doesn't touch upon all the subjects This is true for Hindu marriages as well. [https://www.livelaw.in/news-updates/karnataka-hc-has-set-aside-an-order-declaring-the-marriage-void-as-woman-was-minor-at-the-time-of-marriage-219705](https://www.livelaw.in/news-updates/karnataka-hc-has-set-aside-an-order-declaring-the-marriage-void-as-woman-was-minor-at-the-time-of-marriage-219705) It should automatically be nullified and stand as void regardless. But at least it is not outright legal to marry someone of a minor age, but the bar is too low. :( judiciary need reforms Is it? Can you share an example? I'm not that active on Indian memes Ok The SC has already refused to hold marital rape as a crime. They did it earlier this year I believe. It's voidable but not void ab initio. There's actually often good reasons for that. One is that you want to ensure marriages of long standing aren't disrupted. If it turns out two people in a village somewhere who have been married for decades are suddenly not because one of them was a minor, you're risking a lot of inequitable outcomes for the wife. If the marriage was always void, then she would be the one who would have to fight for her rights while her husband could simply abandon her. The way the current law is structured if the wife sought the voiding of the marriage she would get it. But it's not something other parties can use to deny women their rights from marriage just because the marriage was illegal. You're a lawyer and you don't know the difference between innocence and the state failing to meet a burden of proof (which is what acquittal is)? You don't think a husband abusing his wife and raping her should be grounds to jail his ass? Do you think women realize that walking around an open flame a few times means they are being voided of the ability to say no to the guy who also walked a few steps? It already is a ground for divorce, and covered under the Domestic Violence act. You can leave the husband, take his properties and have the court order him to pay you monthly maintenance without any valid reason as it is. What more would be achieved by criminalizing Marital Rape? >What more would be achieved by criminalizing Marital Rape? Men who rape women should go to prison. As all criminals do. It's really that simple. If you are innocent and still falsely implicated in a case, after the trial no evidence against you has been found, would you not be acquitted? >The SC has already refused to hold marital rape as a crime. Not really. The Supreme Court in September 2022 held that the pregnancy of a married woman due to forcible sex by her husband can be treated as rape under the Medical Termination of Pregnancy Act. You cannot send someone to prison without evidence, and there is no rational way to prove marital rape. Live in the same house, sleep on the same bed and possibly even have kids together, no medical evidence can be there. How would you prove that the sexual act was committed without your consent? The process would be the only punishment here, what else is there really So you're a lawyer who doesn't understand how the law works. Fascinating. Being acquitted =/= being innocent. It means you are not guilty. More specifically it means the state failed to prove its burden beyond a reasonable doubt. It does not necessarily mean there was \"no evidence against you.\" In some cases it can mean there was no evidence. But that doesn't mean every acquittal=fake case. You'd think a trained lawyer would know these basics. >You cannot send someone to prison without evidence, and there is no rational way to prove marital rape. There's plenty of ways to do it. Just because India is backwards doesn't mean the rest of the world is, and marital rape is criminalized in more civilized countries and they don't run into the endless problems the misogynists in India dream up. You prove rape in a marriage the same way you would prove it between an unmarried couple. The fact that a signed sheet of paper or having walked around a lit flame makes makes a legal difference is a testament to the idiocy and backwardness of Indian law on the subject. It doesn't make it rational. >Live in the same house, sleep on the same bed and possibly even have kids together, no medical evidence can be there. No? Other countries manage to do it. Are Indians somehow uniquely unqualified? Or do Indian men deserve a special exemption for rape? >How would you prove that the sexual act was committed without your consent? As I said, the same way you'd prove it if all the facts were the same and the couple weren't married. Which *is* criminalized in India. Not Guilty is indeed the standard of innocence, what other parameter can there even be? You refuse to think and parrot the same thing again and again Common law judiciaries don't make findings of innocence. They make findings of guilt or lack thereof. Did you sleep through your foundations of law classes? Absolutely. It is high time it should be made a law. But the problem with saying that courts don't accept it, is that it takes the blame off of politicians, who should be pressured. I meant the high court but I can see how it can be misread, I'll edit it. Correct me if I'm wrong, but articles 14 and 21 talk about discrimination. There are two ways I feel like your argument will not work (again, correct me if I'm wrong): 1. There would have to be a case that only happens to a woman belonging to a minority, but marital rape is not limited to minorities. So I don't think the discrimination angle works. 2. If marital rape isn't criminalized, on what basis will the courts say that the woman has been discriminated against? Like, if there was no crime, then what discrimination? When i say minority i mean minor by age, martital rape is punishable if the girl is a minor. So to not give protections to major women, there is a case to be made that it is \"arbitrary\" and art 14 doesn't allow laws to be arbitrary Makes sense, it would be an argument you'd have to make in the Supreme Court for a change in the law though. Or talk to a politician. Yea so people are upset that the high court does not recognize this as arbitrary and extend these protections to all women. As they should be. It is a dire situation. > Unfortunately, I am also searching for the same study but haven't found anything yet. The NewsMinute article does mention that many of the false cases tend to be parents who filed a rape case because their daughter eloped with her boyfriend. There is no mention of rape in the false promise of marriage, however. And no mention of these statistics is present in the NewsMinute article either. > Though the number of false cases (as 8%) might be undervalued given the pendency of rape cases in India as of 2020 was 94.2%. So there might be a good chance that other cases may turn up false too. There are a few problems with this comment. 1. How are you getting that big of a number? The NCRB statistics show that out of the 43196 reported cases, 15097 are pending investigations. That places it at about 34.94%, or 35%. I am referring to the NewsMinute article because I can't find the data on the NCRB website. 2. I highly doubt that the values given by the NCRB are undervalued. In fact, I think that the values given by the NCRB are overvalued. Worldwide reporting of false rape cases vary from about 2% to 10% [(as per this study)](https://www.nsvrc.org/sites/default/files/2012-03/Publications_NSVRC_Overview_False-Reporting.pdf), and even this study makes mention of the fact that many of the published reports do not clearly define what constitutes a false allegation. So I'd argue that the NCRB report is overvalued, because there are several factors that also need to be considered, like \"the factors that may lead sexual violence survivors to withdraw their complaints, turn hostile during investigation or trial, or settle outside court\", as per the NewsMinute article. 3. There could also be a good chance the pending cases are dropped due to lack of evidence, filed as non-cognizable, or considered as a mistake of fact or of law or civil dispute. Even in false cases, several factors also need to be considered, like the ones I mentioned above. >There was one instance where a man spent 20 years in jail for an alleged rape that didn't happen. It took the court 20 years to determine that he was innocent. > >There are a multitude of pathways that have been allowed by the Indian judiciary for women to actually exploit. One of them is compromise where a woman who has filled a rape complaint against a man can withdraw the plea without any consequence. This has led to legal terrorism and extortion where women files rape cases against random person to extort money or to take revenge. > >Add to that, the cases when ex-GFs come around some time after break up to file for rape in pretext of promise to marriage against their former lover. Anecdotal evidence doesn't necessarily translate to statistical evidence. Yes, these kinds of situations exist and it's absolutely sad to see people get fucked over by the justice system on these kinds of cases. But if this was such a commonplace problem, there would probably be proper statistics on such cases happening. But so far, any news on these kinds of situations happen every once in a while, while rape cases are so bad [a rape is reported every 16 minutes in our country](https://economictimes.indiatimes.com/news/politics-and-nation/ncrbs-report-reveals-a-rape-happens-every-16-minutes-in-india-up-tops-list-of-crimes-against-women/videoshow/78440875.cms). And that's just the reported number of rape cases. A study done by LiveMint says that [99.1% of sexual violence goes unreported](https://www.livemint.com/Politics/AV3sIKoEBAGZozALMX8THK/99-cases-of-sexual-assaults-go-unreported-govt-data-shows.html) in our country, and that's more worrisome over the gradual cases of women taking advantage of laws favoring them. I would generally favor amending such laws once we have achieved gender equality on par with the Scandinavian countries. But our country still has lots of progress to focus on in terms of women's rights too. In fact, even with the laws favoring women, [1 in 3 women in India have likely suffered from violence by an intimate partner](https://www.bmj.com/company/newsroom/1-in-3-women-in-india-is-likely-to-have-been-subjected-to-intimate-partner-violence/). So our best bet on men's rights is to focus on progress towards women's rights, so that greater gender equality can be achieved and this can pave the way for better gender-neutral laws. >However, the real sufferers of these false cases (apart from the accused and their family) are the women who were actually raped or sexually assaulted as the pilling files push their case down the timeline. Unfortunately true. This is why I generally disagree with cases like parents filing a case because their daughter eloped with her boyfriend, or cases where a woman files rape because the guy falsely promised to marry her, because it makes actual cases tough to look at. We need greater awareness on reporting sexual violence to the police, and a reform of the police and the judiciary system. >One thing I noticed apart from results by NCRB, there are not many documented results. Even the report by NCRB doesn't touch upon all the subjects Yeah, that's true. The most I could find that correlates to the percentage you discussed was [this Hindu article](https://www.thehindu.com/data/the-many-shades-of-rape-cases-in-delhi/article6261042.ece) that says that of the 460 cases sent to court, 41% of the cases were cases where parents made a case over elopement, and 24% of the cases were cases of rape on the false promise of marriage. Anyway, if you wish to further discuss this with me, feel free to message me in my DMs. I will get back to you as soon as I can if I have the time. 1. How are you getting that big of a number? The NCRB statistics show that out of the 43196 reported cases, 15097 are pending investigations. That places it at about 34.94%, or 35%. I am referring to the NewsMinute article because I can't find... Answer: The NCRB report shows yearly data only. But, to get to the context of the info, you have to add in cases that were pending over the years too. I am attaching one SS from a post shared by renowned MRA Dipika Bhardwaj. I probably quoted you the earlier figure, but current rape case pendency in 93.5% which is extremely high. Delayed justice is no justice at all. Not to mention that a majority of the cases will never get a hearing. Some will be settled outside the purview of law (through monetary compensation or through threats of further physical or psychological damages). Moreover, the justice system is a bit biased and full of contradictions. While there are bills being introduced where mental harassment of women will be termed as cruelty, for men loss of reputation doesn't hold good as mental harassment. ( [https://timesofindia.indiatimes.com/city/delhi/harassment-case-delhi-hc-rejects-plea-to-prosecute-woman/articleshow/94440084.cms](https://timesofindia.indiatimes.com/city/delhi/harassment-case-delhi-hc-rejects-plea-to-prosecute-woman/articleshow/94440084.cms))"
}