{
    "id": "1bypfmc",
    "title": "IFF Explains: How a vulnerability in a government cloud service could have exposed the sensitive personal data of 2,50,000 Indian citizens",
    "url": "https://www.reddit.com/r/india/comments/1bypfmc/iff_explains_how_a_vulnerability_in_a_government/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/o0txbm8is6tc1.jpg?width=1600&format=pjpg&auto=webp&s=86df2b398b3e9ffd9f5b16199bde9d08552bb691\n\n [Donate Now](https://static.internetfreedom.in/donate) | [Read the post on our website!](https://internetfreedom.in/vulnerability-in-a-government-cloud-service/)\n\n### tl;dr \n\nThe  'Secure, Scalable and Sugamya Website as a Service' (S3WaaS) platform  of the Government of India, developed for hosting government websites,  faced a significant vulnerability in January 2022. Security researcher  Sourajeet Majumder discovered that the flaw could potentially lead to  the exposure of sensitive personal data of around 2,50,000 Indian  citizens, primarily COVID-19 vaccine beneficiaries. Despite alerts and  correspondence with CERT-In and NIC, the vulnerability persisted until  March 2024, when Sourajeet confirmed its resolution.   \n\n\n### Vulnerability Explained \n\nA potential [reported vulnerability](https://techcrunch.com/2024/04/02/indian-government-cloud-spilled-citizens-personal-data-online-for-years/?ref=static.internetfreedom.in) on the ‘Secure, Scalable and Sugamya Website as a Service’ [(“S3WaaS”) Website](https://s3waas.gov.in/?ref=static.internetfreedom.in) of the Government of India was brought to our notice by an independent security researcher, [Sourajeet Majumder](https://twitter.com/TechCrucio?ref=static.internetfreedom.in),  on January 17, 2022. S3WaaS is a cloud service developed for government  entities to generate Secure, Scalable and Sugamya (Accessible)  websites. It enables government entities to choose from various themes  for generating their websites and customising and managing content  efficiently, thus empowering them to maintain their online presence.  Government entities requiring primarily informational websites can use  the S3WaaS framework to generate and host the website under the gov.in  or nic.in domain.\n\nSourajeet first noticed the vulnerability on  January 16, 2022, when a gov.in domain was left exposed, resulting in  several structured data files containing sensitive personal information  of around 2,50,000 Indian citizens (mostly health workers) who had  enrolled for COVID-19 vaccinations being accessible by a simple Google  search. Personally identifiable information (“PII”) such as the  beneficiary name, type of beneficiary, vaccination status, vaccination  dose status, mobile number, document type (Aadhaar, voter ID, Pan,  driving license, passbook, passport, health insurance, service identity  card, etc.), document number, age, pin code, state/union territory,  district, block, facility, facility category, registered date, etc.  could be accessed as search engines indexed these results. Sourajeet  also informed us that several malicious actors could exploit the  vulnerability and had dumped the data on data breach marketplaces.\n\n### Timeline of our communication with CERT-In\n\nFollowing this, IFF [wrote](https://streaklinks.com/B5iaLhNNjdWyzgrW6g6sCred/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1gK4-k5a8WdsA33DpEkzGpMaWb-tGDD-C%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in)  to the Indian Computer Emergency Response Team (“CERT-In”) on January  21, 2022, reporting the bucket misconfiguration vulnerability on the  S3WaaS website that allows access to several confidential, sensitive,  and protected information of Indian citizens to unauthorised persons. We  received a [response](https://drive.google.com/file/d/1nimm4u5HnJWEOPrO7U6l48PfRk-4Lodd/view?usp=drive_link&ref=static.internetfreedom.in)  from CERT-In on January 24, 2022, acknowledging our email and stating  that they were already aware of the report and were taking appropriate  actions with the concerned authorities. \n\nShortly after, Sourajeet  brought to our notice that several confidential documents had again been  indexed on search engines and were accessible to unauthorised persons.  Following this, we [wrote](https://streaklinks.com/B5iaLhRUFLtNke491gVaJaQL/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1je_jc54aV2i3Fv18toBB8EQhjybbk7-j%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in)  to CERT-In again on March 09, 2022, informing them that the extent of  the vulnerability was more prominent than initially anticipated, with  the leaked data going beyond the PII of COVID-19 vaccine beneficiaries.  This was [responded](https://drive.google.com/file/d/1FM263-h9gsNPMOBjXhjPsqVnZfJKZ_h5/view?usp=sharing&ref=static.internetfreedom.in)  to by a prompt response from CERT-In on March 09, 2022, articulating  that they were in the process of taking appropriate action with the  concerned authority. \n\nFinally, we also [wrote](https://streaklinks.com/B5iaLhRzM2EPwggDewinzoF9/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1a2YqMBbnyXccXatyrQsQbI-K0NCfEARX%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in)  to the National Informatics Centre (“NIC”), Ministry of Electronics and  IT (“MeitY”) on March 17, 2022, highlighting the issue as the  vulnerability could potentially jeopardise the privacy of millions of  Indians, leading to identity theft of the beneficiaries and  weaponisation of sensitive data against individuals or groups of  individuals with the intent to threaten, influence, or exploit them.  Notably, we did not receive a response from the NIC. On March 16, 2024,  Sourajeet informed us that after thoroughly testing and analysing the  vulnerability, he was confident that the vulnerability had been entirely  resolved and that the solutions implemented were stable and efficient. \n\n### The state of cybersecurity in India \n\nA  vulnerability or data leak in the government's S3WaaS platform could  pose a significant threat to the privacy and security of countless  individuals. This platform is designed to host and manage websites for  various government agencies, housing sensitive information ranging from  personal data to governmental operations. If exploited, such a breach  could result in the unauthorised access, theft, or manipulation of vast  amounts of data, exposing citizens to identity theft, financial fraud,  and other malicious activities. From a data protection standpoint, the  consequences are severe as it undermines the fundamental rights to  privacy and confidentiality. Moreover, it erodes public trust in  government institutions tasked with safeguarding sensitive information,  highlighting the critical need for robust cybersecurity measures and  stringent data protection protocols to prevent such breaches and  mitigate their repercussions.\n\nIn 2021, IFF had [written](https://drive.google.com/file/d/1mmiJWnxJL3wHJ_fzlcfGCgreSApTyUNu/view?ref=static.internetfreedom.in) to CERT-In pointing out a concerning [provision](https://www.cert-in.org.in/RVDCP.jsp?ref=static.internetfreedom.in) in their Responsible Vulnerability Disclosure and Coordination Policy (“[RVDP](https://internetfreedom.in/dont-penalise-cybersecurity-researchers/?ref=static.internetfreedom.in)”)  that could be used to penalise cybersecurity researchers for  vulnerability disclosures, inhibiting genuine voluntary disclosures by  researchers. We had recommended that this clause of the Policy be  amended and that an explicit provision for the protection of genuine  security disclosures from vexatious legal claims and proceedings be  specified.\n\nCERT-In [responded](https://drive.google.com/file/d/1cejTBwl2W4ZePIkBnQcBYISbucz6FIED/view?ref=static.internetfreedom.in)  to our representation, explaining that the Policy is an executive  decision and, thus, must follow the existing provisions of the law. In  light of this, we [wrote](https://drive.google.com/file/d/1gHq1fem8aG1vCGr4N2u1XwEmEqWi1IzM/view?ref=static.internetfreedom.in) to MeitY, asking them to amend the [Information Technology Act](https://eprocure.gov.in/cppp/rulesandprocs/kbadqkdlcswfjdelrquehwuxcfmijmuixngudufgbuubgubfugbububjxcgfvsbdihbgfGhdfgFHytyhRtMjk4NzY=?ref=static.internetfreedom.in),  2000 to provide a safe harbour for genuine security researchers. Given  that several data breaches are not discovered and/or disclosed by the  data fiduciaries but rather by [independent digital security researchers](https://static.internetfreedom.in/over-to-you-meity/), it is imperative that robust vulnerability reporting mechanisms protect vulnerability researchers from harm.\n\nThe  urgent need to operationalise the Digital Personal Data Protection Act  (“DPDPA”), 2023 is underscored by the increasingly pervasive threats to  individuals' digital privacy and security. As technology advances, so do  the methods and scale of cyberattacks, leaving individuals and  organisations vulnerable to data breaches, identity theft, and  surveillance. A comprehensive, robust, and rights-respecting DPDPA is  essential to establish clear guidelines, regulations, and enforcement  mechanisms to safeguard personal information, ensure transparency in  data handling practices, and hold entities accountable for any lapses in  cybersecurity protocols. The inadequacies of the DPDPA, 2023 in  safeguarding data privacy and empowering data principals in the event of  a breach as well as the current [grim](https://www.cnbctv18.com/technology/india-sufferred-second-highest-data-breaches-in-2022-with-450-million-records-exposed-report-16088781.html?ref=static.internetfreedom.in)  state of cybersecurity in the country reveal concerning gaps and  vulnerabilities. Despite efforts to bolster cybersecurity measures,  including establishing dedicated agencies and initiatives, challenges  such as insufficient resources, outdated infrastructure, and a shortage  of skilled professionals persist. \n\nThe rapid digitisation of  critical infrastructure and services has expanded the attack surface,  amplifying the need for proactive risk management strategies, enhanced  collaboration between public and private sectors, and continuous  investment in cybersecurity education and infrastructure. Strengthening  both legislative frameworks and cybersecurity capabilities is imperative  to mitigate risks, protect digital assets, and foster trust in the  evolving digital landscape. Leaks in the servers of [Zivame, RentoMojo](https://plugthebreach.in/?ref=static.internetfreedom.in), [CoWIN](https://thewire.in/tech/cowin-data-leak-is-a-sign-india-needs-to-rethink-its-digital-public-infrastructure-strategy?ref=static.internetfreedom.in), and [AIIMS](https://thewire.in/government/aiims-servers-cyberattack-ransomware-rajya-sabha?ref=static.internetfreedom.in) have put into question the governance mechanisms that exist in the event of such breaches. \n\nA non-exhaustive list of data breaches that occurred in the country since 2020 is available on a publicly accessible database, [PlugTheBreach](https://plugthebreach.in/?ref=static.internetfreedom.in), a small-scale IFF initiative aimed at covering, reporting, and tracking  data breaches in India to increase transparency and public awareness.  \n\n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 55,
    "num_comments": 5,
    "created_utc": 1712552130.0,
    "convurl": "https://external-preview.redd.it/xl9312awVEalZfiWHSkovl6_1r_r8DisVbozR3L5xrg.jpg",
    "comments": [
        "I discovered a high risk vulnerability in Umang app and reported the same through official channels, this was the only reply I got. I’m not sure if the vulnerability still exists but I got no follow ups on it.\n\nhttps://preview.redd.it/jaqmlselg7tc1.jpeg?width=1125&format=pjpg&auto=webp&s=f2c7de35f5b013c5b4713e69dc9914d9ad1918f4",
        "**\"Hello, How are you ?\"**",
        ">Secure, Scalable and Sugamya Website as a Service' (S3WaaS)\n\nThey're too busy coming up with these bs names to care about data privacy"
    ],
    "cleaned_text": "iff explains vulnerability government cloud service could exposed sensitive personal data indian citizens xb donate nowhttpsstaticinternetfreedomindonate read post websitehttpsinternetfreedominvulnerabilityinagovernmentcloudservice tldr secure scalable sugamya website service swaas platform government india developed hosting government websites faced significant vulnerability january security researcher sourajeet majumder discovered flaw could potentially lead exposure sensitive personal data around indian citizens primarily covid vaccine beneficiaries despite alerts correspondence certin nic vulnerability persisted march sourajeet confirmed resolution vulnerability explained potential reported vulnerabilityhttpstechcrunchcomindiangovernmentcloudspilledcitizenspersonaldataonlineforyearsrefstaticinternetfreedomin secure scalable sugamya website service swaas websitehttpsswaasgovinrefstaticinternetfreedomin government india brought notice independent security researcher sourajeet majumderhttpstwittercomtechcruciorefstaticinternetfreedomin january swaas cloud service developed government entities generate secure scalable sugamya accessible websites enables government entities choose various themes generating websites customising managing content efficiently thus empowering maintain online presence government entities requiring primarily informational websites use swaas framework generate host website govin nicin domain sourajeet first noticed vulnerability january govin domain left exposed resulting several structured data files containing sensitive personal information around indian citizens mostly health workers enrolled covid vaccinations accessible simple google search personally identifiable information pii beneficiary name type beneficiary vaccination status vaccination dose status mobile number document type aadhaar voter id pan driving license passbook passport health insurance service identity card etc document number age pin code stateunion territory district block facility facility category registered date etc could accessed search engines indexed results sourajeet also informed us several malicious actors could exploit vulnerability dumped data data breach marketplaces timeline communication certin following iff wrotehttpsstreaklinkscombialhnnjdwyzgrwgscredhttpsaffdrivegooglecomffilefdfgkkawdsadpekzgpmawbtgddcfviewfuspdsharingrefstaticinternetfreedomin indian computer emergency response team certin january reporting bucket misconfiguration vulnerability swaas website allows access several confidential sensitive protected information indian citizens unauthorised persons received responsehttpsdrivegooglecomfilednimmuhnjweoproulpfrkloddviewuspdrivelinkrefstaticinternetfreedomin certin january acknowledging email stating already aware report taking appropriate actions concerned authorities shortly sourajeet brought notice several confidential documents indexed search engines accessible unauthorised persons following wrotehttpsstreaklinkscombialhrufltnkegvajaqlhttpsaffdrivegooglecomffilefdfjejcavifvtobbeqhjybbkjfviewfuspdsharingrefstaticinternetfreedomin certin march informing extent vulnerability prominent initially anticipated leaked data going beyond pii covid vaccine beneficiaries respondedhttpsdrivegooglecomfiledfmhgsnpmobjxhjpsqvnzfjkzhviewuspsharingrefstaticinternetfreedomin prompt response certin march articulating process taking appropriate action concerned authority finally also wrotehttpsstreaklinkscombialhrzmepwggdewinzofhttpsaffdrivegooglecomffilefdfayqmbbnyxccxatyrqsqbikncfearxfviewfuspdsharingrefstaticinternetfreedomin national informatics centre nic ministry electronics meity march highlighting issue vulnerability could potentially jeopardise privacy millions indians leading identity theft beneficiaries weaponisation sensitive data individuals groups individuals intent threaten influence exploit notably receive response nic march sourajeet informed us thoroughly testing analysing vulnerability confident vulnerability entirely resolved solutions implemented stable efficient state cybersecurity india vulnerability data leak governments swaas platform could pose significant threat privacy security countless individuals platform designed host manage websites various government agencies housing sensitive information ranging personal data governmental operations exploited breach could result unauthorised access theft manipulation vast amounts data exposing citizens identity theft financial fraud malicious activities data protection standpoint consequences severe undermines fundamental rights privacy confidentiality moreover erodes public trust government institutions tasked safeguarding sensitive information highlighting critical need robust cybersecurity measures stringent data protection protocols prevent breaches mitigate repercussions iff writtenhttpsdrivegooglecomfiledmmijwnxjlwhjfzlcfgcgresaptyunuviewrefstaticinternetfreedomin certin pointing concerning provisionhttpswwwcertinorginrvdcpjsprefstaticinternetfreedomin responsible vulnerability disclosure coordination policy rvdphttpsinternetfreedomindontpenalisecybersecurityresearchersrefstaticinternetfreedomin could used penalise cybersecurity researchers vulnerability disclosures inhibiting genuine voluntary disclosures researchers recommended clause policy amended explicit provision protection genuine security disclosures vexatious legal claims proceedings specified certin respondedhttpsdrivegooglecomfiledcejtbwlwzepikbnqcbyisbuczfiedviewrefstaticinternetfreedomin representation explaining policy executive decision thus must follow existing provisions law light wrotehttpsdrivegooglecomfiledghqfemagvcgrnuxwemeqwiizmviewrefstaticinternetfreedomin meity asking amend information technology acthttpseprocuregovincppprulesandprocskbadqkdlcswfjdelrquehwuxcfmijmuixngudufgbuubgubfugbububjxcgfvsbdihbgfghdfgfhytyhrtmjknzyrefstaticinternetfreedomin provide safe harbour genuine security researchers given several data breaches discovered andor disclosed data fiduciaries rather independent digital security researchershttpsstaticinternetfreedominovertoyoumeity imperative robust vulnerability reporting mechanisms protect vulnerability researchers harm urgent need operationalise digital personal data protection act dpdpa underscored increasingly pervasive threats individuals digital privacy security technology advances methods scale cyberattacks leaving individuals organisations vulnerable data breaches identity theft surveillance comprehensive robust rightsrespecting dpdpa essential establish clear guidelines regulations enforcement mechanisms safeguard personal information ensure transparency data handling practices hold entities accountable lapses cybersecurity protocols inadequacies dpdpa safeguarding data privacy empowering data principals event breach well current grimhttpswwwcnbctvcomtechnologyindiasufferredsecondhighestdatabreachesinwithmillionrecordsexposedreporthtmlrefstaticinternetfreedomin state cybersecurity country reveal concerning gaps vulnerabilities despite efforts bolster cybersecurity measures including establishing dedicated agencies initiatives challenges insufficient resources outdated infrastructure shortage skilled professionals persist rapid digitisation critical infrastructure services expanded attack surface amplifying need proactive risk management strategies enhanced collaboration public private sectors continuous investment cybersecurity education infrastructure strengthening legislative frameworks cybersecurity capabilities imperative mitigate risks protect digital assets foster trust evolving digital landscape leaks servers zivame rentomojohttpsplugthebreachinrefstaticinternetfreedomin cowinhttpsthewireintechcowindataleakisasignindianeedstorethinkitsdigitalpublicinfrastructurestrategyrefstaticinternetfreedomin aiimshttpsthewireingovernmentaiimsserverscyberattackransomwarerajyasabharefstaticinternetfreedomin put question governance mechanisms exist event breaches nonexhaustive list data breaches occurred country since available publicly accessible database plugthebreachhttpsplugthebreachinrefstaticinternetfreedomin smallscale iff initiative aimed covering reporting tracking data breaches india increase transparency public awareness xb ",
    "cleaned_title": "iff explains vulnerability government cloud service could exposed sensitive personal data indian citizens",
    "cleaned_selftext": "xb donate nowhttpsstaticinternetfreedomindonate read post websitehttpsinternetfreedominvulnerabilityinagovernmentcloudservice tldr secure scalable sugamya website service swaas platform government india developed hosting government websites faced significant vulnerability january security researcher sourajeet majumder discovered flaw could potentially lead exposure sensitive personal data around indian citizens primarily covid vaccine beneficiaries despite alerts correspondence certin nic vulnerability persisted march sourajeet confirmed resolution vulnerability explained potential reported vulnerabilityhttpstechcrunchcomindiangovernmentcloudspilledcitizenspersonaldataonlineforyearsrefstaticinternetfreedomin secure scalable sugamya website service swaas websitehttpsswaasgovinrefstaticinternetfreedomin government india brought notice independent security researcher sourajeet majumderhttpstwittercomtechcruciorefstaticinternetfreedomin january swaas cloud service developed government entities generate secure scalable sugamya accessible websites enables government entities choose various themes generating websites customising managing content efficiently thus empowering maintain online presence government entities requiring primarily informational websites use swaas framework generate host website govin nicin domain sourajeet first noticed vulnerability january govin domain left exposed resulting several structured data files containing sensitive personal information around indian citizens mostly health workers enrolled covid vaccinations accessible simple google search personally identifiable information pii beneficiary name type beneficiary vaccination status vaccination dose status mobile number document type aadhaar voter id pan driving license passbook passport health insurance service identity card etc document number age pin code stateunion territory district block facility facility category registered date etc could accessed search engines indexed results sourajeet also informed us several malicious actors could exploit vulnerability dumped data data breach marketplaces timeline communication certin following iff wrotehttpsstreaklinkscombialhnnjdwyzgrwgscredhttpsaffdrivegooglecomffilefdfgkkawdsadpekzgpmawbtgddcfviewfuspdsharingrefstaticinternetfreedomin indian computer emergency response team certin january reporting bucket misconfiguration vulnerability swaas website allows access several confidential sensitive protected information indian citizens unauthorised persons received responsehttpsdrivegooglecomfilednimmuhnjweoproulpfrkloddviewuspdrivelinkrefstaticinternetfreedomin certin january acknowledging email stating already aware report taking appropriate actions concerned authorities shortly sourajeet brought notice several confidential documents indexed search engines accessible unauthorised persons following wrotehttpsstreaklinkscombialhrufltnkegvajaqlhttpsaffdrivegooglecomffilefdfjejcavifvtobbeqhjybbkjfviewfuspdsharingrefstaticinternetfreedomin certin march informing extent vulnerability prominent initially anticipated leaked data going beyond pii covid vaccine beneficiaries respondedhttpsdrivegooglecomfiledfmhgsnpmobjxhjpsqvnzfjkzhviewuspsharingrefstaticinternetfreedomin prompt response certin march articulating process taking appropriate action concerned authority finally also wrotehttpsstreaklinkscombialhrzmepwggdewinzofhttpsaffdrivegooglecomffilefdfayqmbbnyxccxatyrqsqbikncfearxfviewfuspdsharingrefstaticinternetfreedomin national informatics centre nic ministry electronics meity march highlighting issue vulnerability could potentially jeopardise privacy millions indians leading identity theft beneficiaries weaponisation sensitive data individuals groups individuals intent threaten influence exploit notably receive response nic march sourajeet informed us thoroughly testing analysing vulnerability confident vulnerability entirely resolved solutions implemented stable efficient state cybersecurity india vulnerability data leak governments swaas platform could pose significant threat privacy security countless individuals platform designed host manage websites various government agencies housing sensitive information ranging personal data governmental operations exploited breach could result unauthorised access theft manipulation vast amounts data exposing citizens identity theft financial fraud malicious activities data protection standpoint consequences severe undermines fundamental rights privacy confidentiality moreover erodes public trust government institutions tasked safeguarding sensitive information highlighting critical need robust cybersecurity measures stringent data protection protocols prevent breaches mitigate repercussions iff writtenhttpsdrivegooglecomfiledmmijwnxjlwhjfzlcfgcgresaptyunuviewrefstaticinternetfreedomin certin pointing concerning provisionhttpswwwcertinorginrvdcpjsprefstaticinternetfreedomin responsible vulnerability disclosure coordination policy rvdphttpsinternetfreedomindontpenalisecybersecurityresearchersrefstaticinternetfreedomin could used penalise cybersecurity researchers vulnerability disclosures inhibiting genuine voluntary disclosures researchers recommended clause policy amended explicit provision protection genuine security disclosures vexatious legal claims proceedings specified certin respondedhttpsdrivegooglecomfiledcejtbwlwzepikbnqcbyisbuczfiedviewrefstaticinternetfreedomin representation explaining policy executive decision thus must follow existing provisions law light wrotehttpsdrivegooglecomfiledghqfemagvcgrnuxwemeqwiizmviewrefstaticinternetfreedomin meity asking amend information technology acthttpseprocuregovincppprulesandprocskbadqkdlcswfjdelrquehwuxcfmijmuixngudufgbuubgubfugbububjxcgfvsbdihbgfghdfgfhytyhrtmjknzyrefstaticinternetfreedomin provide safe harbour genuine security researchers given several data breaches discovered andor disclosed data fiduciaries rather independent digital security researchershttpsstaticinternetfreedominovertoyoumeity imperative robust vulnerability reporting mechanisms protect vulnerability researchers harm urgent need operationalise digital personal data protection act dpdpa underscored increasingly pervasive threats individuals digital privacy security technology advances methods scale cyberattacks leaving individuals organisations vulnerable data breaches identity theft surveillance comprehensive robust rightsrespecting dpdpa essential establish clear guidelines regulations enforcement mechanisms safeguard personal information ensure transparency data handling practices hold entities accountable lapses cybersecurity protocols inadequacies dpdpa safeguarding data privacy empowering data principals event breach well current grimhttpswwwcnbctvcomtechnologyindiasufferredsecondhighestdatabreachesinwithmillionrecordsexposedreporthtmlrefstaticinternetfreedomin state cybersecurity country reveal concerning gaps vulnerabilities despite efforts bolster cybersecurity measures including establishing dedicated agencies initiatives challenges insufficient resources outdated infrastructure shortage skilled professionals persist rapid digitisation critical infrastructure services expanded attack surface amplifying need proactive risk management strategies enhanced collaboration public private sectors continuous investment cybersecurity education infrastructure strengthening legislative frameworks cybersecurity capabilities imperative mitigate risks protect digital assets foster trust evolving digital landscape leaks servers zivame rentomojohttpsplugthebreachinrefstaticinternetfreedomin cowinhttpsthewireintechcowindataleakisasignindianeedstorethinkitsdigitalpublicinfrastructurestrategyrefstaticinternetfreedomin aiimshttpsthewireingovernmentaiimsserverscyberattackransomwarerajyasabharefstaticinternetfreedomin put question governance mechanisms exist event breaches nonexhaustive list data breaches occurred country since available publicly accessible database plugthebreachhttpsplugthebreachinrefstaticinternetfreedomin smallscale iff initiative aimed covering reporting tracking data breaches india increase transparency public awareness xb",
    "cleaned_comments": "discovered high risk vulnerability umang app reported official channels reply got im sure vulnerability still exists got follow ups hello secure scalable sugamya website service swaas theyre busy coming bs names care data privacy",
    "light_cleaned_title": "IFF Explains: How a vulnerability in a government cloud service could have exposed the sensitive personal data of 2,50,000 Indian citizens",
    "light_cleaned_selftext": "&#x200B; [Donate Now](https://static.internetfreedom.in/donate) | [Read the post on our website!](https://internetfreedom.in/vulnerability-in-a-government-cloud-service/) ### tl;dr The 'Secure, Scalable and Sugamya Website as a Service' (S3WaaS) platform of the Government of India, developed for hosting government websites, faced a significant vulnerability in January 2022. Security researcher Sourajeet Majumder discovered that the flaw could potentially lead to the exposure of sensitive personal data of around 2,50,000 Indian citizens, primarily COVID-19 vaccine beneficiaries. Despite alerts and correspondence with CERT-In and NIC, the vulnerability persisted until March 2024, when Sourajeet confirmed its resolution. ### Vulnerability Explained A potential [reported vulnerability](https://techcrunch.com/2024/04/02/indian-government-cloud-spilled-citizens-personal-data-online-for-years/?ref=static.internetfreedom.in) on the ‘Secure, Scalable and Sugamya Website as a Service’ [(“S3WaaS”) Website](https://s3waas.gov.in/?ref=static.internetfreedom.in) of the Government of India was brought to our notice by an independent security researcher, [Sourajeet Majumder](https://twitter.com/TechCrucio?ref=static.internetfreedom.in), on January 17, 2022. S3WaaS is a cloud service developed for government entities to generate Secure, Scalable and Sugamya (Accessible) websites. It enables government entities to choose from various themes for generating their websites and customising and managing content efficiently, thus empowering them to maintain their online presence. Government entities requiring primarily informational websites can use the S3WaaS framework to generate and host the website under the gov.in or nic.in domain. Sourajeet first noticed the vulnerability on January 16, 2022, when a gov.in domain was left exposed, resulting in several structured data files containing sensitive personal information of around 2,50,000 Indian citizens (mostly health workers) who had enrolled for COVID-19 vaccinations being accessible by a simple Google search. Personally identifiable information (“PII”) such as the beneficiary name, type of beneficiary, vaccination status, vaccination dose status, mobile number, document type (Aadhaar, voter ID, Pan, driving license, passbook, passport, health insurance, service identity card, etc.), document number, age, pin code, state/union territory, district, block, facility, facility category, registered date, etc. could be accessed as search engines indexed these results. Sourajeet also informed us that several malicious actors could exploit the vulnerability and had dumped the data on data breach marketplaces. ### Timeline of our communication with CERT-In Following this, IFF [wrote](https://streaklinks.com/B5iaLhNNjdWyzgrW6g6sCred/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1gK4-k5a8WdsA33DpEkzGpMaWb-tGDD-C%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in) to the Indian Computer Emergency Response Team (“CERT-In”) on January 21, 2022, reporting the bucket misconfiguration vulnerability on the S3WaaS website that allows access to several confidential, sensitive, and protected information of Indian citizens to unauthorised persons. We received a [response](https://drive.google.com/file/d/1nimm4u5HnJWEOPrO7U6l48PfRk-4Lodd/view?usp=drive_link&ref=static.internetfreedom.in) from CERT-In on January 24, 2022, acknowledging our email and stating that they were already aware of the report and were taking appropriate actions with the concerned authorities. Shortly after, Sourajeet brought to our notice that several confidential documents had again been indexed on search engines and were accessible to unauthorised persons. Following this, we [wrote](https://streaklinks.com/B5iaLhRUFLtNke491gVaJaQL/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1je_jc54aV2i3Fv18toBB8EQhjybbk7-j%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in) to CERT-In again on March 09, 2022, informing them that the extent of the vulnerability was more prominent than initially anticipated, with the leaked data going beyond the PII of COVID-19 vaccine beneficiaries. This was [responded](https://drive.google.com/file/d/1FM263-h9gsNPMOBjXhjPsqVnZfJKZ_h5/view?usp=sharing&ref=static.internetfreedom.in) to by a prompt response from CERT-In on March 09, 2022, articulating that they were in the process of taking appropriate action with the concerned authority. Finally, we also [wrote](https://streaklinks.com/B5iaLhRzM2EPwggDewinzoF9/https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1a2YqMBbnyXccXatyrQsQbI-K0NCfEARX%2Fview%3Fusp%3Dsharing?ref=static.internetfreedom.in) to the National Informatics Centre (“NIC”), Ministry of Electronics and IT (“MeitY”) on March 17, 2022, highlighting the issue as the vulnerability could potentially jeopardise the privacy of millions of Indians, leading to identity theft of the beneficiaries and weaponisation of sensitive data against individuals or groups of individuals with the intent to threaten, influence, or exploit them. Notably, we did not receive a response from the NIC. On March 16, 2024, Sourajeet informed us that after thoroughly testing and analysing the vulnerability, he was confident that the vulnerability had been entirely resolved and that the solutions implemented were stable and efficient. ### The state of cybersecurity in India A vulnerability or data leak in the government's S3WaaS platform could pose a significant threat to the privacy and security of countless individuals. This platform is designed to host and manage websites for various government agencies, housing sensitive information ranging from personal data to governmental operations. If exploited, such a breach could result in the unauthorised access, theft, or manipulation of vast amounts of data, exposing citizens to identity theft, financial fraud, and other malicious activities. From a data protection standpoint, the consequences are severe as it undermines the fundamental rights to privacy and confidentiality. Moreover, it erodes public trust in government institutions tasked with safeguarding sensitive information, highlighting the critical need for robust cybersecurity measures and stringent data protection protocols to prevent such breaches and mitigate their repercussions. In 2021, IFF had [written](https://drive.google.com/file/d/1mmiJWnxJL3wHJ_fzlcfGCgreSApTyUNu/view?ref=static.internetfreedom.in) to CERT-In pointing out a concerning [provision](https://www.cert-in.org.in/RVDCP.jsp?ref=static.internetfreedom.in) in their Responsible Vulnerability Disclosure and Coordination Policy (“[RVDP](https://internetfreedom.in/dont-penalise-cybersecurity-researchers/?ref=static.internetfreedom.in)”) that could be used to penalise cybersecurity researchers for vulnerability disclosures, inhibiting genuine voluntary disclosures by researchers. We had recommended that this clause of the Policy be amended and that an explicit provision for the protection of genuine security disclosures from vexatious legal claims and proceedings be specified. CERT-In [responded](https://drive.google.com/file/d/1cejTBwl2W4ZePIkBnQcBYISbucz6FIED/view?ref=static.internetfreedom.in) to our representation, explaining that the Policy is an executive decision and, thus, must follow the existing provisions of the law. In light of this, we [wrote](https://drive.google.com/file/d/1gHq1fem8aG1vCGr4N2u1XwEmEqWi1IzM/view?ref=static.internetfreedom.in) to MeitY, asking them to amend the [Information Technology Act](https://eprocure.gov.in/cppp/rulesandprocs/kbadqkdlcswfjdelrquehwuxcfmijmuixngudufgbuubgubfugbububjxcgfvsbdihbgfGhdfgFHytyhRtMjk4NzY=?ref=static.internetfreedom.in), 2000 to provide a safe harbour for genuine security researchers. Given that several data breaches are not discovered and/or disclosed by the data fiduciaries but rather by [independent digital security researchers](https://static.internetfreedom.in/over-to-you-meity/), it is imperative that robust vulnerability reporting mechanisms protect vulnerability researchers from harm. The urgent need to operationalise the Digital Personal Data Protection Act (“DPDPA”), 2023 is underscored by the increasingly pervasive threats to individuals' digital privacy and security. As technology advances, so do the methods and scale of cyberattacks, leaving individuals and organisations vulnerable to data breaches, identity theft, and surveillance. A comprehensive, robust, and rights-respecting DPDPA is essential to establish clear guidelines, regulations, and enforcement mechanisms to safeguard personal information, ensure transparency in data handling practices, and hold entities accountable for any lapses in cybersecurity protocols. The inadequacies of the DPDPA, 2023 in safeguarding data privacy and empowering data principals in the event of a breach as well as the current [grim](https://www.cnbctv18.com/technology/india-sufferred-second-highest-data-breaches-in-2022-with-450-million-records-exposed-report-16088781.html?ref=static.internetfreedom.in) state of cybersecurity in the country reveal concerning gaps and vulnerabilities. Despite efforts to bolster cybersecurity measures, including establishing dedicated agencies and initiatives, challenges such as insufficient resources, outdated infrastructure, and a shortage of skilled professionals persist. The rapid digitisation of critical infrastructure and services has expanded the attack surface, amplifying the need for proactive risk management strategies, enhanced collaboration between public and private sectors, and continuous investment in cybersecurity education and infrastructure. Strengthening both legislative frameworks and cybersecurity capabilities is imperative to mitigate risks, protect digital assets, and foster trust in the evolving digital landscape. Leaks in the servers of [Zivame, RentoMojo](https://plugthebreach.in/?ref=static.internetfreedom.in), [CoWIN](https://thewire.in/tech/cowin-data-leak-is-a-sign-india-needs-to-rethink-its-digital-public-infrastructure-strategy?ref=static.internetfreedom.in), and [AIIMS](https://thewire.in/government/aiims-servers-cyberattack-ransomware-rajya-sabha?ref=static.internetfreedom.in) have put into question the governance mechanisms that exist in the event of such breaches. A non-exhaustive list of data breaches that occurred in the country since 2020 is available on a publicly accessible database, [PlugTheBreach](https://plugthebreach.in/?ref=static.internetfreedom.in), a small-scale IFF initiative aimed at covering, reporting, and tracking data breaches in India to increase transparency and public awareness. &#x200B;",
    "light_cleaned_comments": "I discovered a high risk vulnerability in Umang app and reported the same through official channels, this was the only reply I got. I’m not sure if the vulnerability still exists but I got no follow ups on it. **\"Hello, How are you ?\"** >Secure, Scalable and Sugamya Website as a Service' (S3WaaS) They're too busy coming up with these bs names to care about data privacy"
}