{
    "id": "1b7xmn0",
    "title": "Punjab Farmers Are Fighting for the Rights of Millions of Others",
    "url": "https://lokmarg.com/punjab-farmers-are-fighting-for-the-rights-of-millions-of-others/",
    "selftext": "Joe John, a farmer from Kottayam, Kerala, who practices sustainable agricultural methods, finds it distressing when the state treats protesting farmers as enemy of the state.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1709725261.0,
    "convurl": "https://external-preview.redd.it/2kV2EqA-v172yQXRaPpH68GjlXiasim3Hn7DHCftzVk.jpg?auto=webp&s=64a7645d112875f01f6132e497e8a843aeaaca04",
    "comments": [
        "From the article:\n\nAbout the current farmers protest in Punjab, there’s a mixed feeling of both sadness and joy. The sad part is that the farmers have to be return to the streets after an year-long protest couple of years back which led to the proposed farm laws being repealed. The good part is that it serves as an inspiration for all others to struggle and get what is their due, their fundamental right, from the government. They would not allow themselves to be trampled by the raw power which the State is putting out against the struggle, as if they are enemies of the nation!\n\nThus I totally empathise with all my brothers and sisters from Punjab who are out on the streets fighting for the rights of millions of farmers across the country.\n\nThe fact is food prices have been kept low for decades and farmers have cross-subsidised other sections. One should look at the prices of agricultural produce historically and the salaries of government employees, to name just one section, to get an idea of the kind of disparity which exists. It’s not a correct picture when governments keep on harping about the amount of subsidies which is being given to the farmers and forget about the rise in input costs, be it wages, manure or other aspects of agriculture.\n\nNot just industrialists, even people employed in the organised sector are able to get their demands fulfilled by the government because they are more organised and have more resources to ensure that these are fulfilled.\n\nOne of the reasons for the neglect of the agricultural sector could be that there is a lack of a formal body which represents not only the interests of the farmers, but also of all others who have a direct stake in the well-being of this sector which provides employment to such a large section of the working population. Hopefully, these struggles, in the last couple of years, will be a turning point.\n\nBy not giving legal guarantees for MSP, which is one of the key demands of the current struggle, the BJP-led government in Delhi is trying to wash away its responsibility. One can agree that the current MSP mechanism is only benefitting a very small section of our farmers, as it covers a very low proportion of our agricultural produce, both in terms of quantity as well as the variety of crops. In most states the farmers are totally dependent on private traders for selling their produce and it’s mostly distress-selling which happens. This is because not only farmers do not have space for storing their produce, but, also, they do not have clarity about the movement of prices. Indeed, APMCs need to be set up all over the country with proper infrastructure which are closer to the location of farmers.\n\nClimate change is going to be the biggest threat in the coming years and there is a need for widespread adoption of agro-ecological practices. However, one cannot expect the farmers to do this on their own without any support from the government. A country like India which has such a large proportion of population dependant on agricultural and allied sectors, cannot afford to be complacent on this issue. This is because it is going to affect the livelihoods of millions of people on the ground across the country, and threaten our short-term and long-term food security.\n\n(The narrator passed out from the Tata Institute of Social Sciences (TISS) in Mumbai and has worked in various peaceful social movements across the country, including the Narmada Bachao Andolan)"
    ],
    "cleaned_text": "punjab farmers fighting rights millions others joe john farmer kottayam kerala practices sustainable agricultural methods finds distressing state treats protesting farmers enemy state ",
    "cleaned_title": "punjab farmers fighting rights millions others",
    "cleaned_selftext": "joe john farmer kottayam kerala practices sustainable agricultural methods finds distressing state treats protesting farmers enemy state",
    "cleaned_comments": "article current farmers protest punjab theres mixed feeling sadness joy sad part farmers return streets yearlong protest couple years back led proposed farm laws repealed good part serves inspiration others struggle get due fundamental right government would allow trampled raw power state putting struggle enemies nation thus totally empathise brothers sisters punjab streets fighting rights millions farmers across country fact food prices kept low decades farmers crosssubsidised sections one look prices agricultural produce historically salaries government employees name one section get idea kind disparity exists correct picture governments keep harping amount subsidies given farmers forget rise input costs wages manure aspects agriculture industrialists even people employed organised sector able get demands fulfilled government organised resources ensure fulfilled one reasons neglect agricultural sector could lack formal body represents interests farmers also others direct stake wellbeing sector provides employment large section working population hopefully struggles last couple years turning point giving legal guarantees msp one key demands current struggle bjpled government delhi trying wash away responsibility one agree current msp mechanism benefitting small section farmers covers low proportion agricultural produce terms quantity well variety crops states farmers totally dependent private traders selling produce mostly distressselling happens farmers space storing produce also clarity movement prices indeed apmcs need set country proper infrastructure closer location farmers climate change going biggest threat coming years need widespread adoption agroecological practices however one expect farmers without support government country like india large proportion population dependant agricultural allied sectors afford complacent issue going affect livelihoods millions people ground across country threaten shortterm longterm food security narrator passed tata institute social sciences tiss mumbai worked various peaceful social movements across country including narmada bachao andolan",
    "light_cleaned_title": "Punjab Farmers Are Fighting for the Rights of Millions of Others",
    "light_cleaned_selftext": "Joe John, a farmer from Kottayam, Kerala, who practices sustainable agricultural methods, finds it distressing when the state treats protesting farmers as enemy of the state.",
    "light_cleaned_comments": "From the article: About the current farmers protest in Punjab, there’s a mixed feeling of both sadness and joy. The sad part is that the farmers have to be return to the streets after an year-long protest couple of years back which led to the proposed farm laws being repealed. The good part is that it serves as an inspiration for all others to struggle and get what is their due, their fundamental right, from the government. They would not allow themselves to be trampled by the raw power which the State is putting out against the struggle, as if they are enemies of the nation! Thus I totally empathise with all my brothers and sisters from Punjab who are out on the streets fighting for the rights of millions of farmers across the country. The fact is food prices have been kept low for decades and farmers have cross-subsidised other sections. One should look at the prices of agricultural produce historically and the salaries of government employees, to name just one section, to get an idea of the kind of disparity which exists. It’s not a correct picture when governments keep on harping about the amount of subsidies which is being given to the farmers and forget about the rise in input costs, be it wages, manure or other aspects of agriculture. Not just industrialists, even people employed in the organised sector are able to get their demands fulfilled by the government because they are more organised and have more resources to ensure that these are fulfilled. One of the reasons for the neglect of the agricultural sector could be that there is a lack of a formal body which represents not only the interests of the farmers, but also of all others who have a direct stake in the well-being of this sector which provides employment to such a large section of the working population. Hopefully, these struggles, in the last couple of years, will be a turning point. By not giving legal guarantees for MSP, which is one of the key demands of the current struggle, the BJP-led government in Delhi is trying to wash away its responsibility. One can agree that the current MSP mechanism is only benefitting a very small section of our farmers, as it covers a very low proportion of our agricultural produce, both in terms of quantity as well as the variety of crops. In most states the farmers are totally dependent on private traders for selling their produce and it’s mostly distress-selling which happens. This is because not only farmers do not have space for storing their produce, but, also, they do not have clarity about the movement of prices. Indeed, APMCs need to be set up all over the country with proper infrastructure which are closer to the location of farmers. Climate change is going to be the biggest threat in the coming years and there is a need for widespread adoption of agro-ecological practices. However, one cannot expect the farmers to do this on their own without any support from the government. A country like India which has such a large proportion of population dependant on agricultural and allied sectors, cannot afford to be complacent on this issue. This is because it is going to affect the livelihoods of millions of people on the ground across the country, and threaten our short-term and long-term food security. (The narrator passed out from the Tata Institute of Social Sciences (TISS) in Mumbai and has worked in various peaceful social movements across the country, including the Narmada Bachao Andolan)"
}