{
    "id": "144dki2",
    "title": "Girls used to get married, deliver child before 17: Gujarat HC on abortion plea",
    "url": "https://www.hindustantimes.com/india-news/girls-used-to-get-married-deliver-child-before-17-gujarat-hc-on-abortion-plea-101686234092265.html",
    "selftext": "Hint: manusmriti",
    "flair": "Law & Courts",
    "score": 205,
    "num_comments": 20,
    "created_utc": 1686241027.0,
    "convurl": "https://external-preview.redd.it/pD53R3NSTQPW6Ouw7c3bmXJjDleaK2A8lpj1aNumn2E.jpg?auto=webp&v=enabled&s=f032cc0a6173eac128ece2f66c6196dd6db8cda0",
    "comments": [
        "Jesus fucking Christ, what a deplorable cunt.",
        "Everything in this news so out of norm. How on earth can  judge be so ignorant? Why would it be concern for law how our grandparents lived their life? I seriously like to look into this Judge's qualifications and mark sheets .....like how on earth he even passed the bar exam? Did he buy it?\n\nOn the other hand, 7 month old fetus can't be terminated just like that. It would be almost viable life after birth. That is like what? at 28 weeks? Poor thing, why did she wait that  long? Hope, it turns out okay.",
        "Y do judges quote manusmriti is it a legally binding document?",
        "In Gujarat it is.",
        "I want what the judges are smoking",
        "Okay so you know better than a judge? Why not apply yourself and become a judge? And why the hell did she wait so long? We have laws for abortion till 20th week I guess. Why didn't she do it by then?",
        "Really? Smoke some manusmriti.",
        "The real question here is: how can a man of this shithead thinking becomes a judge in our country???who puts regressive thoughts in manusmriti/tradition/religion above Indian constitution???",
        "Yeah it would put the girls life at risk if it were terminated now, I don't know why the family didn't go sooner considering abortion is legal in Gujarat and many OBYGN would've done it. However, the judge is an absolute dumbass for quoting religious misogynistic bs in the final decision.",
        "What in the holiest of fucks are they smoking with?!",
        "damn judges doing some nasty psychedelic , I mean i can expect these kinds of statements from politicians but judges damn.",
        "Arnab intensifies",
        "How can a country move forward when the so called highest points of the legal system think in the past",
        "When the union is willing arranged, judge quotes law against child marriage.  \n\n\nWhen a rapist forces motherhood the judge quotes laws of manusmriti?",
        "https://youtu.be/qysnr2eYg6s",
        "Cunt is beautiful, he isn't. Please don't degrade the sacred cunt.",
        "People also used to die of cholera, malaria, and kala zar.",
        "Not final decision. Just a oral observation",
        "People on psychedelics do better than this, this is manusmriti."
    ],
    "cleaned_text": "girls used get married deliver child gujarat hc abortion plea hint manusmriti ",
    "cleaned_title": "girls used get married deliver child gujarat hc abortion plea",
    "cleaned_selftext": "hint manusmriti",
    "cleaned_comments": "jesus fucking christ deplorable cunt everything news norm earth judge ignorant would concern law grandparents lived life seriously like look judges qualifications mark sheets like earth even passed bar exam buy hand month old fetus cant terminated like would almost viable life birth like weeks poor thing wait long hope turns okay judges quote manusmriti legally binding document gujarat want judges smoking okay know better judge apply become judge hell wait long laws abortion till th week guess didnt really smoke manusmriti real question man shithead thinking becomes judge countrywho puts regressive thoughts manusmrititraditionreligion indian constitution yeah would put girls life risk terminated dont know family didnt go sooner considering abortion legal gujarat many obygn wouldve done however judge absolute dumbass quoting religious misogynistic bs final decision holiest fucks smoking damn judges nasty psychedelic mean expect kinds statements politicians judges damn arnab intensifies country move forward called highest points legal system think past union willing arranged judge quotes law child marriage rapist forces motherhood judge quotes laws manusmriti cunt beautiful isnt please dont degrade sacred cunt people also used die cholera malaria kala zar final decision oral observation people psychedelics better manusmriti",
    "light_cleaned_title": "Girls used to get married, deliver child before 17: Gujarat HC on abortion plea",
    "light_cleaned_selftext": "Hint: manusmriti",
    "light_cleaned_comments": "Jesus fucking Christ, what a deplorable cunt. Everything in this news so out of norm. How on earth can judge be so ignorant? Why would it be concern for law how our grandparents lived their life? I seriously like to look into this Judge's qualifications and mark sheets .....like how on earth he even passed the bar exam? Did he buy it? On the other hand, 7 month old fetus can't be terminated just like that. It would be almost viable life after birth. That is like what? at 28 weeks? Poor thing, why did she wait that long? Hope, it turns out okay. Y do judges quote manusmriti is it a legally binding document? In Gujarat it is. I want what the judges are smoking Okay so you know better than a judge? Why not apply yourself and become a judge? And why the hell did she wait so long? We have laws for abortion till 20th week I guess. Why didn't she do it by then? Really? Smoke some manusmriti. The real question here is: how can a man of this shithead thinking becomes a judge in our country???who puts regressive thoughts in manusmriti/tradition/religion above Indian constitution??? Yeah it would put the girls life at risk if it were terminated now, I don't know why the family didn't go sooner considering abortion is legal in Gujarat and many OBYGN would've done it. However, the judge is an absolute dumbass for quoting religious misogynistic bs in the final decision. What in the holiest of fucks are they smoking with?! damn judges doing some nasty psychedelic , I mean i can expect these kinds of statements from politicians but judges damn. Arnab intensifies How can a country move forward when the so called highest points of the legal system think in the past When the union is willing arranged, judge quotes law against child marriage. When a rapist forces motherhood the judge quotes laws of manusmriti? Cunt is beautiful, he isn't. Please don't degrade the sacred cunt. People also used to die of cholera, malaria, and kala zar. Not final decision. Just a oral observation People on psychedelics do better than this, this is manusmriti."
}