{
    "id": "16jbwpu",
    "title": "Job-seeking visa for Germany",
    "url": "https://www.reddit.com/r/india/comments/16jbwpu/jobseeking_visa_for_germany/",
    "selftext": "Hello, I want to rejoin my spouse who lives in Germany on a job-seeking visa. I currently live in India and have completed my Master's studies in India.   \n\n\nI understand that Indians can apply for a job-seeking visa to move to Germany for 6 months ([https://india.diplo.de/in-en/service/-/2539332](https://india.diplo.de/in-en/service/-/2539332)). But VFS has 0 slots and the consulate is not responding to emails. Any advice is appreciated.   \n\n\np.s. if there's a different suitable sub to ask this, please lmk :) ",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694780634.0,
    "convurl": "https://external-preview.redd.it/sg0KpOhHPV0sCikeZU9wdiDRbZ62GKJH0NtQrsU9qB8.jpg?auto=webp&amp;s=c68e8fc56419f63bcaa22b947814a2293ac08643",
    "comments": [
        "Try looking for slots after midnight. I got slot for my student visa past 2 am"
    ],
    "cleaned_text": "jobseeking visa germany hello want rejoin spouse lives germany jobseeking visa currently live india completed masters studies india understand indians apply jobseeking visa move germany months httpsindiadiplodeinenservicehttpsindiadiplodeinenservice vfs slots consulate responding emails advice appreciated ps theres different suitable sub ask please lmk ",
    "cleaned_title": "jobseeking visa germany",
    "cleaned_selftext": "hello want rejoin spouse lives germany jobseeking visa currently live india completed masters studies india understand indians apply jobseeking visa move germany months httpsindiadiplodeinenservicehttpsindiadiplodeinenservice vfs slots consulate responding emails advice appreciated ps theres different suitable sub ask please lmk",
    "cleaned_comments": "try looking slots midnight got slot student visa past",
    "light_cleaned_title": "Job-seeking visa for Germany",
    "light_cleaned_selftext": "Hello, I want to rejoin my spouse who lives in Germany on a job-seeking visa. I currently live in India and have completed my Master's studies in India. I understand that Indians can apply for a job-seeking visa to move to Germany for 6 months ([https://india.diplo.de/in-en/service/-/2539332](https://india.diplo.de/in-en/service/-/2539332)). But VFS has 0 slots and the consulate is not responding to emails. Any advice is appreciated. p.s. if there's a different suitable sub to ask this, please lmk :)",
    "light_cleaned_comments": "Try looking for slots after midnight. I got slot for my student visa past 2 am"
}