{
    "id": "14oel54",
    "title": "Why are ₹10 coins accepted by some states and not accepted by other states shopkeepers?",
    "url": "https://i.redd.it/qwntzog98h9b1.png",
    "selftext": "When ₹10 coins were launched, we also got them in Chhattisgarh and used them. But after sometime, shopkeepers started to refuse them. We had to stop using them.\n\nBut whenever I travel to Andra and Tamilnadu, they still use the coins.  We have to spend it all before returning to Chhattisgarh.\n\nSo why is it accepted in some states and not in other states? Does your state accept or reject them?",
    "flair": "AskIndia",
    "score": 1054,
    "num_comments": 262,
    "created_utc": 1688270933.0,
    "convurl": "https://i.redd.it/qwntzog98h9b1.png",
    "comments": [
        "Location : Chennai\n\n\nDevice : Poco F1\n\n\n\nDimensions :  Storage Size 1.96 MB,  Size 1080×1167px",
        "There is something wrong with people & coins. \n\nIn my hometown, they don't accept the new small Rs1 coin 😑..",
        "What? How do you buy toffee?",
        "Either you give them old Rs1 coin or buy multiple of 5",
        "😱",
        "Superstition. Or they have some paranoia that it’s fake.",
        "Superstition? What superstition?\n\nThey accept other coins like 1,2,5. Why is 10 singled out?",
        "It is a legal currency and not accepting these is a federal crime.",
        "I heard a rumor from my father that rbi is going to ban ₹10 coins too so people refuses. Ofc it has no source to back if it's true or not but local shopkeepers around us do stop taking it. Though after few years, they start accepting it again",
        "This!! It's all about rumours & fear of demonetization.",
        "Consequences of WhatsApp University forward messages. People will believe anything. This \"10 rupee coin is fake/going to be banned\" rumour has been around more than 5-6 years.. \n\neg: the nationalised bank branch I worked in KA had/has 16 lakhs worth of 10 rs coins in its vault. Reason being customers will deposit those daily, but there will be a big fight if the cashier tries to give even one back when they come for withdrawals. RBI won't take it back and then blame the banks for the stupidity of the public.\n\nOnly relief was the toll booth guys who come once in a while for these coins. Nobody fights back if they are given a 10rs coin as change in toll booths. But with fastag, that option is also closed now.",
        "Can't your bank transfer those coins to states like Andra and Tamilnadu? Their population doesn't have a problem with those coins",
        "Some fake coins were minted in north India that led to people avoiding them. This happened before ra sign was introduced. Money changers in north India will take them for a 10% commission because most of the coins are genuine. The fake coins are slightly thinner.",
        "It's because some 10 rs coins have 10 printed on silver and while some have it on both silver and gold like in the picture. Both are real and printed by rbi at different times ( design was changed) but some WhatsApp messages combined with less knowledgeable people believe in the rumor of it being fake . A few months ago the DTC bus conductor in Delhi rejected my coin and told me it's fake. Didn't argue with him and gave him another 10rs coin.",
        "Where I belong to, 10₹ coins are a taboo.\n\nWhere I'm living currently, they only accept 5 and 10₹ coins. 1 and 2₹ are a taboo.\n\nUs Indians 😐",
        "UPI is the saviour.\n\nBut why are 1 and 2 coins taboo? Never heard of it.",
        "When I was in Gujarat they wouldn't take this",
        "In my city nobody uses the 10rs coin without the rupee symbol. The one in the picture is fine here.\n\nAlso, nobody accepts the small one rupee coin (the new one), the legacy one is fine.",
        "I personally hate this coin , like when ever I keep it in my pocket 10 mins later gone , I've lost so much money because of it 😔",
        "Where do you live?",
        "Officially, no. Not allowed by RBI.\n\n\nBut we used to have arrangements with some customers (supermarkets, retail shops, even private bus owners) in Kerala where everyone accepted these. But since these are big coins, logistics was an issue. A bag of 2000 coins,  had the size of small shoebox but weighed like 10 Kilos. \n\nAnother funny thing is, there are also 20rs coins in circulation, but very limited quantity. People would freak out if we try to convince those are real currency.",
        "How are you going to convince random shopkeepers and bus conductors tho",
        "I forgot about ₹20 coins. We had a bag of these when it was released.",
        "Oh you can't. I was just stating facts.",
        "They don't accept in Tamilnadu..",
        "Combination of inconsistent design philosophy by RBI, lack of awareness, and abundance of rumours about counterfeit currency.",
        "I got it in Chennai and spent it in Chennai just today and yesterday. Maybe thing are different in rural areas?",
        "Yeah..it might be due to rural condition..i tried to use it in Salem, Namakkal, Coimbatore region..",
        "Arunachal pradesh my state where no one no one accepts any coins 🧎‍♀️",
        "This was because a fake whatsapp forward message in 2018 that was running around in bangalore. I got the same whatsapp message. I ignored it. But some didn't.",
        "Rich",
        "Sounds like people have lost faith in the currency. Wonder why.",
        "Well, I don't know about Chhattisgarh, but they are accepted in Gujarat",
        "What about ₹20 coin?",
        "There is a ₹20 coin?",
        "It is accepted in some cities like Ahmedabad. While in Rajkot, they refuse to take 10 Rs coin.",
        "Yeah same , accepted in jaipur but not in alwar",
        "I was in bhavnagar. And they said it's banned",
        "I gave a 10rs coin to parking security guard at a hotel in TN, he said he wont take it and asked for something else. His loss.",
        "Yes, you can google it for images",
        "Buses in mysore don't accept them as well, and i had to get off the bus since I didn't have any notes. It's so unfair.",
        "Fuckin degenerates is why. I'm from TN, most places here accept ₹10 coin but there are a few exceptions. When I went to Salem I was surprised to see them refuse to take ₹10 coins.",
        "I have lived in Kolkata for 6 years now and never had any problems with any coins. Every shop and transport services accepts these coins. At least to the ones I have been and used so far.",
        "MP ?",
        "😂😂We don't buy toffee. Shopkeeper automatically gives it to us when he falls short of Re.1 coins.",
        "What do you guys use as currency?",
        "No, WB",
        "Rupee 🧎‍♀️",
        "I'm in TN and for every 1 shopkeeper who refuses the coin, there's 4 who accept it, at least that's what I've experienced",
        "Its just shopkeepers being stupid. Currently where I'm staying they wont take ₹10 coin, but will take a ₹20 coin",
        "WhatsApp forwards are responsible for this.",
        "https://preview.redd.it/9al4ez9sqh9b1.png?width=1080&format=pjpg&auto=webp&v=enabled&s=39cec50c24665fe16a432c6a2ba7acbd9ba283ae\n\nFor you information\n\nThe ₹ symbol is here in Google keyboard \\[English (India) language\\]. Don't know about other keyboards.\n\n(Some people using Rs instead of ₹, if they don't know this is information, if they know and are still using Rs, your choice.)",
        "Seen this shit in jharkhand. They don't accept ₹1 coin also.",
        "Actually you're mistaken about Tamil Nadu, people in Coimbatore Dodge this coin like it will give them the plague or something",
        "I think coins are limited in that regard. For egs, you can refuse someone paying huge amount in only coins.",
        "Oh boy coin storage and banks, name a more damned duo. I was sweating balls when I saw more than ₹1L in 1s, 2s and 5s in my branch.",
        "Okay. I was just visiting Chennai.\n\nPeople in this post told me that other area don't accept it",
        "Not easy to carry along one of the prime reason",
        "UPI doesn't work for the homeless, the beggars and the people in abject poverty. We need to think of them as well.",
        "I commute daily in chennai by mtc buses 10rs coins are common here I haven't met any bus conductor who refused to take it. Even I see rs20 coins here and there.",
        "They might be using the US or UK English keyboard. I know I do it too.",
        "Ministry of Finance issues all the coins, rights?",
        "in bangalore, the 10rs coin are not accepted by any shopkeeper. and when i go to my town in bihar, not a single soul accepts the small 1rs coin.",
        "Even in most Tamil Nadu states 10rs coin were not accepted. Govt should do advertisement that 10rs coins is in legal tender.",
        "I once tried to give a beggar a 10rs coin and they rejected it..",
        "Guess beggars can be choosers.\n\n( Opposite of the idiom beggars can't be choosers)",
        "Literally r/choosingbeggars",
        "Gvt will put front page ads during elections but will not care about this as no money here and debunking whatsapp will go against their core voters",
        "I got a 20rs coin from a shopkeeper in Bihar. So ig marketplace accepts 20rs coins",
        "Posted screenshot of this there.",
        "Government should issue a notice so nobody refuses this coin",
        "Lack of Knowledge and Lack of Trust.",
        "Somewhere in MP",
        "Because they are heavy.  \nAnd you cant flex your money with coins.  \nGimme 10 notes of Rs 10 denomination and i will fling it on dancer. Cant do that with 10 coins, specially the 10 denomination ones that hurt like hell when thrown at people.",
        "Even I had not heard of this shit.\n\nThe shopkeepers will always offer toffees. \n\nThe recently launched city bus had a fixed fare of 7₹. But they had to rehash it to to 5₹ as neither the travellers would have 2₹ change nor they were willing to accept 3₹ of change from the conductor.",
        "Ye chutiyapa to UP me hota h😂\n\nShopkeepers used to say that these coins are fake.",
        "Dancer? As in strip clubs? Are there strip clubs in India? Always seen them in Hollywood movies and TV shows.",
        "My home state is Tripura here 10 ruppee coins are not accepted but I study in West Bengal where they are its weird I have no clue why",
        "How is thatb the coin's fault lol? Fix your pockets.",
        "This is wild. Everything is accepted here in Mumbai.",
        "Unsold Toffee sell krne ki ninja technique 😂😂",
        "Puzzle:\n\n\n\nI was born in MP,  now I live in Chhattisgarh. But I live in the same city in which I was born in.",
        "Even Bitcoin 🤪?",
        "They're used normally here in MH, i like them (and probably others too) because all 10 rs notes are small, flimsy and dirty",
        "People dumb ... People hear rumours ... People brain go oonga boonga ... People reject coin",
        "And I am facing a shortage of Rs. 1 coin in our area. Shopkeepers happily accept it nowadays.",
        "Durg?",
        "Specially if cash retention limit is low in your branches that 2 lakh will always be a burden",
        ">! My intention was to confuse people who don't know that Chhattisgarh used to be a part of MP and was partitioned in the year 2000. I am from Bastar District.!<",
        "In my state Uttarakhand, I never faced any issue with the acceptance of this coin. I used to give this coin regularly to shopkeepers and bus conductors. However in the initial days of its launch their were rumours about this coin being counterfeit and I guess in some states people completely believed the rumours and never found out that they were false.",
        "whatsapp rumours",
        "Actually, RBI doesn't design the coins.\nUnlike popular belief, one rupee notes (if there are any still in printing) and coins, are designed and minted by the Government of India, RBI's role is limited to the distribution of the coins.",
        "That is correct, and because buses are commonly used there, disposing off small change isnt a problem. \nBut in the districts, the smaller 1 and 2 rs. coins aren't accepted. Or atleast they weren't being accepted in Canning back when I used to work there.",
        "Haha ok",
        "Im from CG also. It works in Bhilai but for some reason doesn't work in durg",
        "Actually there are two types of 10₹ coins one is this and another one doesn't have ₹ symbol. So that's the only reason they don't accept any of them and speaking of South Indians they are more literate then the rest of the India so they know the coins are not fake even it doesn't have the ₹ symbol",
        "Just had an autorickshaw guy hand me 4 of these as change for a Rs 50 note (fare was 10rs). So yeah no issues here. \n\nTrouble is you can't carry too many of these. Paper is almost weightless while this stuff will literally pull your pants down in public.",
        "Do you stay in Hooghly?",
        "It works in Bhilai? I haven't visited my aunt in a while so I didn't know that.",
        "Which state?",
        "It's actually illegal to deny a legal tender or bill.",
        "Sometimes I wonder how are these people who believe in random messages are fit to caste vote",
        "I don't think anyone  will file a complain for such a small amount",
        "Absolutely,",
        "Me reading this comment sitting in my classroom be like🤥",
        "They don’t accept the fake ones",
        "When I am in Hooghly, coins are accepted more, as notes are often torn...but when I am in Patna, people refuse to take 1 rs coin...so just like op stated it depends on the state..",
        "Eh in the mewat region of rajastan they don't accept 10 rupees coin because some MF in bhilwara minted fake coins.",
        "When I was in Kota, those foolish shopkeepers denied taking ₹10 coins. But here in haryana, they accept it.",
        "It must be some specific area of Durg cuz it worked fine in the places i visited. But yeah, it works fine in Bhilai.",
        "This is a symptom of how little faith we have on the country and its governance",
        "West Bengal",
        "The only place where ₹10 coins are accepted in Tamilnadu is Chennai, any place besides that, they don't accept it.",
        "I will be careful to spend all my coins before leaving Chennai to my hometown",
        "yeah, you would get those coins mostly from conductors in bus and be sure to spend them for the same.",
        "They don't accept small one rupee coins in my state. Very weird.",
        "There is also another coin of ₹10 which doesn't have a rupee symbol and the design above spans more than 10. Those were rumoured counterfeit coins but later said it was not",
        "Merko bol mein 1000-2000 bhijwa dunga",
        "Ah TIL. lol those random fucking designs make a lot more sense now. Bhagwan ki kripa hoi we still have Gandhi ji on the banknotes",
        "Honestly didn't know they are not accepted in some place. I mean it has the same value as of 10 Rs note.",
        "Lmao. I too, never understood the whole ordeal behind changing currency designs. They dont make it look any more modern or something. Only thing the changes contribute to is rumors and inconsistencies. \nCountries go years without changing their currency desgins, but our Government has a little too much time on hand I suppose lol.",
        "I use UPI but otherwise I get note signed by them to get that Re. 1 later",
        "I used to collect those toffees and when it reaches 10 or multiples of 10 I would exchange it with Lays or Cheetos. Finally he stopped giving me toffees and gave me the exact change.",
        "Ppl in TN Chennai only accept it because its given by the conductors. Busses play a major role in Chennai , it's not the same caliber in other parts of TN so they don't usually accept 10 ₹coins .\n\nThe solution to this could be to provide it in public transport outlets , this would increase the trust and also we know our govt. Officers will provide a spicy reply to them if they are denied so it's a win-win , ppl won't generally question govt officers either .",
        "In delhi everyone takes the 10 Rs coin.",
        "I'm from Kerala. The most logical reason would be (imo) if it rains, shopkeepers or anyone would be willing to take it but if it is a drenched 10rs note, no one will take it.",
        "It's Chattisgarh so they are probably illiterate and think it's a fake coin",
        "As opposed to other states where the shopkeepers are PhD holders.",
        "Come to Kerala. Almost everyone asks you to pay with changes",
        "In Goa it has happened because of 2 reasons. First being the refusal to accept the coins by local private bus conductors because they find it difficult to carry them. As a domino effect, the people who travel by buses everyday, including most of the small vegetable and fish vendors started to refuse these coins from their customers and eventually the entire market demonetized these coins. Same thing has happened in Karnataka too but surprisingly it hasn't happened in Maharashtra. \n\nSecond reason is that the banks used to levy handling charges as much as ₹50 per ₹1000 rupees deposited in the form of these coins.\n\nAccording to my bank, RBI is now trying to counter this problem by not sending new ₹10 notes to the banks in Goa. As a result there has been an extreme shortage of ₹10 notes in the market and the coins are back in circulation. Although the private bus conductors and paan gutka kiosks are still resisting. I'm afraid once the notes are back, we'll be back to square one.",
        "I've seen shopkeepers read newspapers in other states, so they probably got the memo about this coin a long time ago",
        "because lot of customers are not accepting it saying they don’t want 10 ruppe coin as it’s hard to manage rather they ask for 10 ruppes notes",
        "not accepted some shops in my village.",
        "The illiterates refuse because they find it difficult to keep up with the ever shrinking sizes of the coins and the uneducated follow suit even though they can differentiate between the coins.",
        "I generally avoid coins because they make my wallet heavy",
        "We weren't so fortunate 😅",
        "And that ₹1 note could never translate to currency ...",
        "Yehh never had problems with coins in MH",
        "It also depends on how random our policy makers are If big denominations can go illegal overnight then this is nothing.",
        "At first he refused to take it. After arguing with him for a long time, he gave up. Then after some time he stopped bartering toffees for lays and gave me my money back",
        "r/usernamechecksout?",
        "There was fake news that 10rs coin are fake and not backed by RBI.\n\nAnd dumb people fell for it.\n\nThink about it a gang who forges money will waste their time forging coins of low denomination (which requires metal machinery, very costly) rather than forging high value notes where profit margins is high .",
        "I am quite bright at intelligence but I do dumb shit all the time. So my brother suggested this username. So, it checks out?",
        "I intentionally paid Re. 1 less for items next time",
        "😂 Yeah after showing that note for approval",
        "Low WhatsApp University graduate population = acceptance of 10 ruppe coin",
        "Here, shopkeepers have totally stopped taking 1rs coin either new or old.",
        "racism",
        "West Bengal? Right?",
        ">I am quite bright at intelligence\n\nSpoken like a very intelligence",
        "Tell them to send them to branches in Mumbai. As far as I have seen, ₹1(new and old), ₹2(new and old),₹5,₹10,₹20 coins are being accepted by common people in Mumbai.",
        "A shopkeeper told me that when someone dies, they throw 1 rupees coin on streets and beggers pick those coin up, so since beggers are associated with that coin, rest of people don't use it.",
        "Yes",
        "Never thought about that.",
        "Not officially...",
        "There is racism in India?\n\n(Indians preferring fair skinned people is called colourism)",
        "Main reason is due to false information regarding 10 Rs. coins are being forwarded across social medias and whatsapp.",
        "WhatsApp University",
        "10 rs coin is a stupid idea that can be dreamt up by us only.\n\nHard to carry. Easy to misplace.\n\nWho is the genius behind this coin?",
        "I g RBI should make a website for all legal  coins and notes to solve this issue",
        "It's an offence to deny accepting a legal tender in return for any commodity or service ! So as long as a currency note or a coin is a legal tender everyone is bound to accept it as a form of payment. \n\nDo what you must with this information, you can report such individuals to RBI ! 😜",
        "They are legal tender but lets be honest many people are toppers of whatsapp university and hence will believe any news of \"Rs 5 coin will be banned from tomorrow\" that comes in their chats",
        "[Deccan Herald made a nice video about this.](https://www.youtube.com/watch?v=IZrW07mdccE )",
        "https://m.rbi.org.in/Scripts/AnnualReportPublications.aspx?Id=1379",
        "Grammar is not my forte",
        "With images",
        "He he he",
        "I am From Andhra Pradesh (Guntur). Now even Here nobody are Accepting them I don't know whether They are Not Accepting throughout state Are ony in my Home town",
        "Where I live, most of the shopkeeper are hell-bent on 'no ₹10 coins' even to the point that one time I told a shopkeeper I've nothing but ₹10 coins and he said to keep it with me and pay him later.\n\nI asked why he won't accept them and he said that it's very hard to organise and keep count of coins so he just doesn't accepts them at all, doesn't sound like a convincing argument but still from then on I never accept ₹10 coins as well.",
        "Doesn't help that the government willy nilly keeps pulling currency notes out of circulation - I've been stuck with twenty eight 2K notes for a month now and my big plan is to load them on Amazon because it's too much of a hassle to go to a bank thrice.",
        "Up Varanasi me 1  sikka Mila hamko usme 12 danta tha normal wala me 10 tha to wo reject kr diya dukandar. Bola ye fake hai lmao fir dusra shopkeeper accept kr liya",
        "You should be made world president and made to solve global problems  Dear Sire🎩",
        "In Bangalore even the government bus conductor doesn't accept the 10 coin all thanks to WhatsApp forwards",
        "Naah no one will touch that coin in coimbatore..I tried everywhere ..shops groceries bus conductors..nope.. almost gave it to the bank..\n\nLuckily mom told me to keep it in case my kids might like to collect one day",
        "fake news from whatsapp, small town and villages get these kind of news saying these coins are fake, a quick google search will give them the answer but they will still refuse as it has become a norm, and even if they accepted that coin from you, they still cannot spend it anywhere in your state, When i went to my mothers native place people refused to give change for 2000 rs note, as the local economy wont have change for it, you can see the same effect if you give a TN bus conductor a 100rs note.\n\nOr they might have been actual victim of conterfit, so the community might have started avoiding a certain note/coin to avoid being cheated, then that practice continues to further decades and now it seem like an state is avoiding 10rs Coin, ask your grandmother.",
        "Here in our Odisha I still can use it very well🙆‍♀️\nps. all coins are in use here starting from little one ruppee to big ten ruppee Wala like this",
        "False info",
        "It could be because of some viral WhatsApp message.I remember one say I went to buy groceries and the guy refused to accept 1 and 2₹ coins. \n\nHe denied giving any explanation even though it was being accepted just the day before. So I asked a fruit seller who I had good terms with and he explained that they recieved news from WhatsApp that these coins will stop being legal tender and whoever has them will be apprehended. \n\nGood thing was they soon realise it was a false message yet it still took like 3-4months for them to accept it again.",
        " I am from Ghaziabad. And I don't know why, but the shopkeeper refuses to take 1 and 2 rupee coins.",
        "Because of illiteracy",
        "No",
        "How? And Why?",
        "In my state, ₹10 and ₹20 coins work like normal. No hichkich. But in NCR some rickshaw drivers were hesitant to accept it maybe due to storage problem or something idk",
        "How.... I dk why.. I don't know.. And it is so strange that public or customers don't say anything. 🙃",
        "Whatsapp university",
        "In my hometown they don't accept 10 rupees coins with 15 drop marks and a small 1 rupees coin.",
        "Because there are too many fakes around",
        "That's just stupid",
        "RBI is entrusted with printing of all denominations of the Indian Currency Notes except for the ₹1 denomination which is printed by GoI.\n\nThe organisation responsible for minting Indian Currency Coins is Security Printing & Minting Corporation of India Ltd. (SPMCIL) under Department of Economic Affairs, Ministry of Finance, Government of India.",
        "Arunachal pe toh kela sab dukandar nakli paisa samajhte hai . We save these coins for intracity transport or cigarettes in Assam",
        "Chattisgarh me abhi bhi chalta h bhai mai khud CG ka hu",
        "Yes. 10 rs coins were not being accepted in Hyderabad but they were readily being accepted in UP vns allahabad.\n\n  \n\n\nIt's all misinformation spread that govt is going to close a certain coin",
        "Its just supply and demand  \nWhere I live, they dont even accept 1 or 2 rupee coins, Just 5 rs and 10 rs coins, most shopkeepers round it to nearest 5, people agree, there no cadbury exchange, if buying something by kilo etc they just add a little more to round it to next 5, etc. No one has 1 or 2 rupee coins here, lol  \nWhen travelling to other states i get some change , but have to spend it or keep it at home before coming back.\n\nLegally speaking , they have to accept it, but its just a hassle and no one wants to do it.",
        "Mai Jagdalpur se hu. Yaha natak karte hai",
        "My friend from Arunachal Pradesh told me they don't accept 2000 rupee notes there. And this was before they got discontinued.",
        "They wont accept this coin in AP",
        "Gawar log",
        "Step out of Chennai and nobody wants those couns",
        "ye sab demonetization k bad itna tatti hogya hai. in my town people don't accept any coin accept other than 10 or 5. fuckers.",
        "Gandhi is a relatively new addition to the Indian currency. For most of history, Indian currency didn't feature Gandhi in any way",
        "Yep.",
        "Karnataka accepts the coin",
        "What's a federal crime in India? I thought it applied only to US?",
        "I asked one shopkeeper why he wasn't 10 rupee coins and he said that there are fake coins circulating",
        "Fake news circulation. Govt should advertise properly that it is illegal not to accept those.",
        "It is happening here in Lucknow as well. So annoying.",
        "I also faced this in Kanpur. Not 10 but 1 ₹coins a few years back. Now they don't have issues.",
        "Because Original 10 rupees coin has rupees symbol on it while duplicate ones don't ❌",
        "Arey koi 1 aur 2 rupya ka coin bi ni le rha hai. Kahan tum 10 me lage ho?!",
        "People be stupid.",
        "Coins are still being accepted in Odisa.\nNot in Chatisgarh. They wont even take 5/2/1 rupee coin here.",
        "Which pants?",
        "It's just how aware people about there currency no one can refuse to tke 1 rupee and  coins as it's  our currency; while other are promissory notes of RBI.",
        "All the fake news circulated on WhatsApp and most of them accept it. Once I argued with shopkeeper for not accepting the coin, then I showed the RBI rules whereas mentions about it but didn't, agreed. At last I threw a mentoes over him and left without any word.",
        "Who in their right mind PAYS for toffee? It's hard enough to figure out what to do with the ones forced on you by shopkeepers instead of change. I never knew anyone actually paid for them. But if you really want them, surely you'll not buy it one by one for one rupee each.",
        "when i went to gujarat even there they don’t accept ₹10 coins",
        "Nothing to do with states, OP. Coins are supposed to be accepted everywhere but some people don't like them. I don't like the coins myself, simply because I hate carrying them around, so I ask for notes whenever I can. No big deal.",
        "SAAAAT KAROD !",
        "Hear it happen with small 1 rupees coin some dumbass shopkeeper spread rumer they are not working and everyone is following that",
        "In my home and state all types of coins are accepted and used some people have made a collection of old coins to recent ₹20 coins.",
        "Kerala is fine with it",
        "poor  ₹ 10 coin facing racism 😂",
        "I don't know about other states if they don't accept it but I know about my state that is chhattisgarh. Few years ago when I was in 12th that was few months before the 2019 election there was a rumor that was circulated in social media and even some print media printed it, the rumor said that collector of Raipur have told that 10 rupees coins will be not be used in the state. It spreaded like wild fire and when the concerned authorities cleared the rumor out it was too late and ever since then all the shopkeepers across chhattisgarh refused to take 10 rupees coin. I had an heated argument with a shopkeeper myself I said that it was just a rumor but he didn't believe me🥲\n\nThis is what I know of this issue.",
        "i ment to say they hate coins and like notes, and ya there is a lot of racism here",
        "This is my NFT 10 Rs coin image",
        "Section 6, Indian Coinage Act, 2011.",
        "Where in CG bro?\nI use it just fine in Durg & Bhilai",
        "And here I am, went to exchange 2000 notes and SBI gave me 10k worth of Rs. 10 coins in replacement",
        "phonepe?",
        "Jagdalpur",
        "I guess the rumour travelled from Raipur to Jagdalpur because here they don't take it.",
        "bihar",
        "Do you stay in Hooghly? 👀",
        "Maybe. If all Hooghlians respond to questions with the same question back.",
        "Hooghlian confirmed.",
        "Literally 0 shopkeepers in my city accept the coin. So it is worthless to me unless I deposit it in a bank.",
        "If I buy more than 1, I would be tempted to eat them.whivh is bad for my health due to obesity.\n\nMy favourite is Pulse Kacha Aam. I purchase it whenever I spot it.",
        "just use ethereum already",
        "It’s technically illegal to reject legal tender like coins right?",
        "Who sells toffee for 1 rs ??",
        "I think the new ₹10 notes are not circulating in other cities as well, it has been a long time since I saw a new ₹10 note here in Chennai.",
        "Yes",
        "Pulse is ₹1 per piece.",
        "Hot damn I take it back, i totally forgot how chemists in Mumbai give Vicks or pulse instead of change",
        "Share the 20 rupees coin picture here please",
        "From Rs 1 to Rs 10 notes are printed by the government, and other than that all the others are printed by RBI that's why the circulation is limited for coins .",
        "In Manipur,Nagaland,Mizoram and some districts of Assam dont valid the Rs.5/10/20 coins.",
        "For 10 rs coin, people never care to identify whether its real Or fake.\nAs most of them we Used in travelling so no One check.",
        "this is the reason. people genuinely dont know whats real and whats not. there are 20 different versions of 1 rupee coin, WHY?",
        "Well coins are minted by the government of India. So if anyone rejects the validity of the coin it's akin to rejecting the authority of the government. So it may be enough to jail a person who rejects it.",
        "***We rarely see in himachal. if we found, it might be wonder. Also coins make our wallet worse(Men), our plastic cards can get cracks!***",
        "https://sivabalanrajendran.blogspot.com/2023/07/how-to-manufacturing-mobile-back-cover.html",
        "There were rumours that this coins were banned by gov. hence some people don't accept them.",
        "Despite the apex bank issuing multiple press releases assuring the continued validity of all variants of these 10 rs. coins and they being in legal tender sections of the society continue to disregard the directions and refuse them.\n\nDuring my recent trip to Rameswaram these coins were outright refused to small to big shops. Whereas in /r/Chennai, these coins can be used without any demur or issue.",
        "Dude. I'm in Durg & Bhilai and ₹10 coin is completely accepted here.\n\nIt's a problem exclusive to Raipur area (not sure about Bilaspur)",
        "I am from Jagdalpur",
        "I owe you wala note??",
        "Well if 500 and 1000 legal tender can be declared illegal by a pyscho, the new 10s and 20s coins under his tenure would also face ignominy, who knows what the pyscho may ban next.",
        "What about the government guy who declared 500 and 1000 bucks as illegal? He deserves Kala Pani in that case.",
        "My family owns a huge kiryana mrket and we have stopped accepting these coins only due to one reason. Banks dont like it when we bring a gigantic bag of 10rs coins to their doorstep and outright refuse to accept them because they dont want to count them. Even if they have a coin counter they will not use it so we stopped accepting them",
        "Awesome!!",
        "Tbh the whole of chhattisgarh",
        "Yeah I believe that but now it's fading away slowly here and in bilaspur it wasn't long lived.",
        "It all depends upon the place. In Kerala, Tamil, Andhra Pradesh and Telangana everyone accepts all the coins that are in legal tender. But in Karnataka in Mysore everyone accepts it but in Bangalore some don’t but majority does. So I believe that education plays a role here. People who are educated know what is right and what is wrong whereas the uneducated will still trust WhatsApp university. Tbh it’s illegal not to accept coins that are in legal tender and if a consumer wants to fight you can go to the court and you’ll win. But I don’t think it’s worth filing a case in court against a person for ₹10. You can spend that in a mall or in some big supermarkets like D-Mart, Smart point, Smart bazaar etc. Else you can exchange it with a note in bank. As simple as that."
    ],
    "cleaned_text": "coins accepted states accepted states shopkeepers coins launched also got chhattisgarh used sometime shopkeepers started refuse stop using whenever travel andra tamilnadu still use coins spend returning chhattisgarh accepted states states state accept reject ",
    "cleaned_title": "coins accepted states accepted states shopkeepers",
    "cleaned_selftext": "coins launched also got chhattisgarh used sometime shopkeepers started refuse stop using whenever travel andra tamilnadu still use coins spend returning chhattisgarh accepted states states state accept reject",
    "cleaned_comments": "location chennai device poco f dimensions storage size mb size px something wrong people coins hometown dont accept new small rs coin buy toffee either give old rs coin buy multiple superstition paranoia fake superstition superstition accept coins like singled legal currency accepting federal crime heard rumor father rbi going ban coins people refuses ofc source back true local shopkeepers around us stop taking though years start accepting rumours fear demonetization consequences whatsapp university forward messages people believe anything rupee coin fakegoing banned rumour around years eg nationalised bank branch worked ka hadhas lakhs worth rs coins vault reason customers deposit daily big fight cashier tries give even one back come withdrawals rbi wont take back blame banks stupidity public relief toll booth guys come coins nobody fights back given rs coin change toll booths fastag option also closed cant bank transfer coins states like andra tamilnadu population doesnt problem coins fake coins minted north india led people avoiding happened ra sign introduced money changers north india take commission coins genuine fake coins slightly thinner rs coins printed silver silver gold like picture real printed rbi different times design changed whatsapp messages combined less knowledgeable people believe rumor fake months ago dtc bus conductor delhi rejected coin told fake didnt argue gave another rs coin belong coins taboo im living currently accept coins taboo us indians upi saviour coins taboo never heard gujarat wouldnt take city nobody uses rs coin without rupee symbol one picture fine also nobody accepts small one rupee coin new one legacy one fine personally hate coin like ever keep pocket mins later gone ive lost much money live officially allowed rbi used arrangements customers supermarkets retail shops even private bus owners kerala everyone accepted since big coins logistics issue bag coins size small shoebox weighed like kilos another funny thing also rs coins circulation limited quantity people would freak try convince real currency going convince random shopkeepers bus conductors tho forgot coins bag released oh cant stating facts dont accept tamilnadu combination inconsistent design philosophy rbi lack awareness abundance rumours counterfeit currency got chennai spent chennai today yesterday maybe thing different rural areas yeahit might due rural conditioni tried use salem namakkal coimbatore region arunachal pradesh state one one accepts coins fake whatsapp forward message running around bangalore got whatsapp message ignored didnt rich sounds like people lost faith currency wonder well dont know chhattisgarh accepted gujarat coin coin accepted cities like ahmedabad rajkot refuse take rs coin yeah accepted jaipur alwar bhavnagar said banned gave rs coin parking security guard hotel tn said wont take asked something else loss yes google images buses mysore dont accept well get bus since didnt notes unfair fuckin degenerates im tn places accept coin exceptions went salem surprised see refuse take coins lived kolkata years never problems coins every shop transport services accepts coins least ones used far mp dont buy toffee shopkeeper automatically gives us falls short coins guys use currency wb rupee im tn every shopkeeper refuses coin theres accept least thats ive experienced shopkeepers stupid currently im staying wont take coin take coin whatsapp forwards responsible information symbol google keyboard english india language dont know keyboards people using rs instead dont know information know still using rs choice seen shit jharkhand dont accept coin also actually youre mistaken tamil nadu people coimbatore dodge coin like give plague something think coins limited regard egs refuse someone paying huge amount coins oh boy coin storage banks name damned duo sweating balls saw l branch okay visiting chennai people post told area dont accept easy carry along one prime reason upi doesnt work homeless beggars people abject poverty need think well commute daily chennai mtc buses rs coins common havent met bus conductor refused take even see rs coins might using us uk english keyboard know ministry finance issues coins rights bangalore rs coin accepted shopkeeper go town bihar single soul accepts small rs coin even tamil nadu states rs coin accepted govt advertisement rs coins legal tender tried give beggar rs coin rejected guess beggars choosers opposite idiom beggars cant choosers literally rchoosingbeggars gvt put front page ads elections care money debunking whatsapp go core voters got rs coin shopkeeper bihar ig marketplace accepts rs coins posted screenshot government issue notice nobody refuses coin lack knowledge lack trust somewhere mp heavy cant flex money coins gim notes rs denomination fling dancer cant coins specially denomination ones hurt like hell thrown people even heard shit shopkeepers always offer toffees recently launched city bus fixed fare rehash neither travellers would change willing accept change conductor ye chutiyapa hota h shopkeepers used say coins fake dancer strip clubs strip clubs india always seen hollywood movies tv shows home state tripura ruppee coins accepted study west bengal weird clue thatb coins fault lol fix pockets wild everything accepted mumbai unsold toffee sell krne ki ninja technique puzzle born mp live chhattisgarh live city born even bitcoin theyre used normally mh like probably others rs notes small flimsy dirty people dumb people hear rumours people brain go oonga boonga people reject coin facing shortage rs coin area shopkeepers happily accept nowadays durg specially cash retention limit low branches lakh always burden intention confuse people dont know chhattisgarh used part mp partitioned year bastar district state uttarakhand never faced issue acceptance coin used give coin regularly shopkeepers bus conductors however initial days launch rumours coin counterfeit guess states people completely believed rumours never found false whatsapp rumours actually rbi doesnt design coins unlike popular belief one rupee notes still printing coins designed minted government india rbis role limited distribution coins correct buses commonly used disposing small change isnt problem districts smaller rs coins arent accepted atleast werent accepted canning back used work haha ok im cg also works bhilai reason doesnt work durg actually two types coins one another one doesnt symbol thats reason dont accept speaking south indians literate rest india know coins fake even doesnt symbol autorickshaw guy hand change rs note fare rs yeah issues trouble cant carry many paper almost weightless stuff literally pull pants public stay hooghly works bhilai havent visited aunt didnt know state actually illegal deny legal tender bill sometimes wonder people believe random messages fit caste vote dont think anyone file complain small amount absolutely reading comment sitting classroom like dont accept fake ones hooghly coins accepted notes often tornbut patna people refuse take rs coinso like op stated depends state eh mewat region rajastan dont accept rupees coin mf bhilwara minted fake coins kota foolish shopkeepers denied taking coins haryana accept must specific area durg cuz worked fine places visited yeah works fine bhilai symptom little faith country governance west bengal place coins accepted tamilnadu chennai place besides dont accept careful spend coins leaving chennai hometown yeah would get coins mostly conductors bus sure spend dont accept small one rupee coins state weird also another coin doesnt rupee symbol design spans rumoured counterfeit coins later said merko bol mein bhijwa dunga ah til lol random fucking designs make lot sense bhagwan ki kripa hoi still gandhi ji banknotes honestly didnt know accepted place mean value rs note lmao never understood whole ordeal behind changing currency designs dont make look modern something thing changes contribute rumors inconsistencies countries go years without changing currency desgins government little much time hand suppose lol use upi otherwise get note signed get later used collect toffees reaches multiples would exchange lays cheetos finally stopped giving toffees gave exact change ppl tn chennai accept given conductors busses play major role chennai caliber parts tn dont usually accept coins solution could provide public transport outlets would increase trust also know govt officers provide spicy reply denied winwin ppl wont generally question govt officers either delhi everyone takes rs coin im kerala logical reason would imo rains shopkeepers anyone would willing take drenched rs note one take chattisgarh probably illiterate think fake coin opposed states shopkeepers phd holders come kerala almost everyone asks pay changes goa happened reasons first refusal accept coins local private bus conductors find difficult carry domino effect people travel buses everyday including small vegetable fish vendors started refuse coins customers eventually entire market demonetized coins thing happened karnataka surprisingly hasnt happened maharashtra second reason banks used levy handling charges much per rupees deposited form coins according bank rbi trying counter problem sending new notes banks goa result extreme shortage notes market coins back circulation although private bus conductors paan gutka kiosks still resisting im afraid notes back well back square one ive seen shopkeepers read newspapers states probably got memo coin long time ago lot customers accepting saying dont want ruppe coin hard manage rather ask ruppes notes accepted shops village illiterates refuse find difficult keep ever shrinking sizes coins uneducated follow suit even though differentiate coins generally avoid coins make wallet heavy werent fortunate note could never translate currency yehh never problems coins mh also depends random policy makers big denominations go illegal overnight nothing first refused take arguing long time gave time stopped bartering toffees lays gave money back rusernamechecksout fake news rs coin fake backed rbi dumb people fell think gang forges money waste time forging coins low denomination requires metal machinery costly rather forging high value notes profit margins high quite bright intelligence dumb shit time brother suggested username checks intentionally paid less items next time yeah showing note approval low whatsapp university graduate population acceptance ruppe coin shopkeepers totally stopped taking rs coin either new old racism west bengal right quite bright intelligence spoken like intelligence tell send branches mumbai far seen new old new old coins accepted common people mumbai shopkeeper told someone dies throw rupees coin streets beggers pick coin since beggers associated coin rest people dont use yes never thought officially racism india indians preferring fair skinned people called colourism main reason due false information regarding rs coins forwarded across social medias whatsapp whatsapp university rs coin stupid idea dreamt us hard carry easy misplace genius behind coin g rbi make website legal coins notes solve issue offence deny accepting legal tender return commodity service long currency note coin legal tender everyone bound accept form payment must information report individuals rbi legal tender lets honest many people toppers whatsapp university hence believe news rs coin banned tomorrow comes chats deccan herald made nice video thishttpswwwyoutubecomwatchvizrwmdcce grammar forte images andhra pradesh guntur even nobody accepting dont know whether accepting throughout state ony home town live shopkeeper hellbent coins even point one time told shopkeeper ive nothing coins said keep pay later asked wont accept said hard organise keep count coins doesnt accepts doesnt sound like convincing argument still never accept coins well doesnt help government willy nilly keeps pulling currency notes circulation ive stuck twenty eight k notes month big plan load amazon much hassle go bank thrice varanasi sikka mila hamko usme danta tha normal wala tha wo reject kr diya dukandar bola ye fake hai lmao fir dusra shopkeeper accept kr liya made world president made solve global problems dear sire bangalore even government bus conductor doesnt accept coin thanks whatsapp forwards naah one touch coin coimbatorei tried everywhere shops groceries bus conductorsnope almost gave bank luckily mom told keep case kids might like collect one day fake news whatsapp small town villages get kind news saying coins fake quick google search give answer still refuse become norm even accepted coin still spend anywhere state went mothers native place people refused give change rs note local economy wont change see effect give tn bus conductor rs note might actual victim conterfit community might started avoiding certain notecoin avoid cheated practice continues decades seem like state avoiding rs coin ask grandmother odisha still use well ps coins use starting little one ruppee big ten ruppee wala like false info could viral whatsapp messagei remember one say went buy groceries guy refused accept coins denied giving explanation even though accepted day asked fruit seller good terms explained recieved news whatsapp coins stop legal tender whoever apprehended good thing soon realise false message yet still took like months accept ghaziabad dont know shopkeeper refuses take rupee coins illiteracy state coins work like normal hichkich ncr rickshaw drivers hesitant accept maybe due storage problem something idk dk dont know strange public customers dont say anything whatsapp university hometown dont accept rupees coins drop marks small rupees coin many fakes around thats stupid rbi entrusted printing denominations indian currency notes except denomination printed goi organisation responsible minting indian currency coins security printing minting corporation india ltd spmcil department economic affairs ministry finance government india arunachal pe toh kela sab dukandar nakli paisa samajhte hai save coins intracity transport cigarettes assam chattisgarh abhi bhi chalta h bhai mai khud cg ka hu yes rs coins accepted hyderabad readily accepted vns allahabad misinformation spread govt going close certain coin supply demand live dont even accept rupee coins rs rs coins shopkeepers round nearest people agree cadbury exchange buying something kilo etc add little round next etc one rupee coins lol travelling states get change spend keep home coming back legally speaking accept hassle one wants mai jagdalpur se hu yaha natak karte hai friend arunachal pradesh told dont accept rupee notes got discontinued wont accept coin ap gawar log step chennai nobody wants couns ye sab demonetization k bad itna tatti hogya hai town people dont accept coin accept fuckers gandhi relatively new addition indian currency history indian currency didnt feature gandhi way yep karnataka accepts coin whats federal crime india thought applied us asked one shopkeeper wasnt rupee coins said fake coins circulating fake news circulation govt advertise properly illegal accept happening lucknow well annoying also faced kanpur coins years back dont issues original rupees coin rupees symbol duplicate ones dont arey koi aur rupya ka coin bi ni le rha hai kahan tum lage ho people stupid coins still accepted odisa chatisgarh wont even take rupee coin pants aware people currency one refuse tke rupee coins currency promissory notes rbi fake news circulated whatsapp accept argued shopkeeper accepting coin showed rbi rules whereas mentions didnt agreed last threw mentoes left without word right mind pays toffee hard enough figure ones forced shopkeepers instead change never knew anyone actually paid really want surely youll buy one one one rupee went gujarat even dont accept coins nothing states op coins supposed accepted everywhere people dont like dont like coins simply hate carrying around ask notes whenever big deal saaaat karod hear happen small rupees coin dumbass shopkeeper spread rumer working everyone following home state types coins accepted used people made collection old coins recent coins kerala fine poor coin facing racism dont know states dont accept know state chhattisgarh years ago th months election rumor circulated social media even print media printed rumor said collector raipur told rupees coins used state spreaded like wild fire concerned authorities cleared rumor late ever since shopkeepers across chhattisgarh refused take rupees coin heated argument shopkeeper said rumor didnt believe know issue ment say hate coins like notes ya lot racism nft rs coin image section indian coinage act cg bro use fine durg bhilai went exchange notes sbi gave k worth rs coins replacement phonepe jagdalpur guess rumour travelled raipur jagdalpur dont take bihar stay hooghly maybe hooghlians respond questions question back hooghlian confirmed literally shopkeepers city accept coin worthless unless deposit bank buy would tempted eat themwhivh bad health due obesity favourite pulse kacha aam purchase whenever spot use ethereum already technically illegal reject legal tender like coins right sells toffee rs think new notes circulating cities well long time since saw new note chennai yes pulse per piece hot damn take back totally forgot chemists mumbai give vicks pulse instead change share rupees coin picture please rs rs notes printed government others printed rbi thats circulation limited coins manipurnagalandmizoram districts assam dont valid rs coins rs coin people never care identify whether real fake used travelling one check reason people genuinely dont know whats real whats different versions rupee coin well coins minted government india anyone rejects validity coin akin rejecting authority government may enough jail person rejects rarely see himachal found might wonder also coins make wallet worsemen plastic cards get cracks rumours coins banned gov hence people dont accept despite apex bank issuing multiple press releases assuring continued validity variants rs coins legal tender sections society continue disregard directions refuse recent trip rameswaram coins outright refused small big shops whereas rchennai coins used without demur issue dude im durg bhilai coin completely accepted problem exclusive raipur area sure bilaspur jagdalpur owe wala note well legal tender declared illegal pyscho new coins tenure would also face ignominy knows pyscho may ban next government guy declared bucks illegal deserves kala pani case family owns huge kiryana mrket stopped accepting coins due one reason banks dont like bring gigantic bag rs coins doorstep outright refuse accept dont want count even coin counter use stopped accepting awesome tbh whole chhattisgarh yeah believe fading away slowly bilaspur wasnt long lived depends upon place kerala tamil andhra pradesh telangana everyone accepts coins legal tender karnataka mysore everyone accepts bangalore dont majority believe education plays role people educated know right wrong whereas uneducated still trust whatsapp university tbh illegal accept coins legal tender consumer wants fight go court youll win dont think worth filing case court person spend mall big supermarkets like dmart smart point smart bazaar etc else exchange note bank simple",
    "light_cleaned_title": "Why are ₹10 coins accepted by some states and not accepted by other states shopkeepers?",
    "light_cleaned_selftext": "When ₹10 coins were launched, we also got them in Chhattisgarh and used them. But after sometime, shopkeepers started to refuse them. We had to stop using them. But whenever I travel to Andra and Tamilnadu, they still use the coins. We have to spend it all before returning to Chhattisgarh. So why is it accepted in some states and not in other states? Does your state accept or reject them?",
    "light_cleaned_comments": "Location : Chennai Device : Poco F1 Dimensions : Storage Size 1.96 MB, Size 1080×1167px There is something wrong with people & coins. In my hometown, they don't accept the new small Rs1 coin 😑.. What? How do you buy toffee? Either you give them old Rs1 coin or buy multiple of 5 😱 Superstition. Or they have some paranoia that it’s fake. Superstition? What superstition? They accept other coins like 1,2,5. Why is 10 singled out? It is a legal currency and not accepting these is a federal crime. I heard a rumor from my father that rbi is going to ban ₹10 coins too so people refuses. Ofc it has no source to back if it's true or not but local shopkeepers around us do stop taking it. Though after few years, they start accepting it again This!! It's all about rumours & fear of demonetization. Consequences of WhatsApp University forward messages. People will believe anything. This \"10 rupee coin is fake/going to be banned\" rumour has been around more than 5-6 years.. eg: the nationalised bank branch I worked in KA had/has 16 lakhs worth of 10 rs coins in its vault. Reason being customers will deposit those daily, but there will be a big fight if the cashier tries to give even one back when they come for withdrawals. RBI won't take it back and then blame the banks for the stupidity of the public. Only relief was the toll booth guys who come once in a while for these coins. Nobody fights back if they are given a 10rs coin as change in toll booths. But with fastag, that option is also closed now. Can't your bank transfer those coins to states like Andra and Tamilnadu? Their population doesn't have a problem with those coins Some fake coins were minted in north India that led to people avoiding them. This happened before ra sign was introduced. Money changers in north India will take them for a 10% commission because most of the coins are genuine. The fake coins are slightly thinner. It's because some 10 rs coins have 10 printed on silver and while some have it on both silver and gold like in the picture. Both are real and printed by rbi at different times ( design was changed) but some WhatsApp messages combined with less knowledgeable people believe in the rumor of it being fake . A few months ago the DTC bus conductor in Delhi rejected my coin and told me it's fake. Didn't argue with him and gave him another 10rs coin. Where I belong to, 10₹ coins are a taboo. Where I'm living currently, they only accept 5 and 10₹ coins. 1 and 2₹ are a taboo. Us Indians 😐 UPI is the saviour. But why are 1 and 2 coins taboo? Never heard of it. When I was in Gujarat they wouldn't take this In my city nobody uses the 10rs coin without the rupee symbol. The one in the picture is fine here. Also, nobody accepts the small one rupee coin (the new one), the legacy one is fine. I personally hate this coin , like when ever I keep it in my pocket 10 mins later gone , I've lost so much money because of it 😔 Where do you live? Officially, no. Not allowed by RBI. But we used to have arrangements with some customers (supermarkets, retail shops, even private bus owners) in Kerala where everyone accepted these. But since these are big coins, logistics was an issue. A bag of 2000 coins, had the size of small shoebox but weighed like 10 Kilos. Another funny thing is, there are also 20rs coins in circulation, but very limited quantity. People would freak out if we try to convince those are real currency. How are you going to convince random shopkeepers and bus conductors tho I forgot about ₹20 coins. We had a bag of these when it was released. Oh you can't. I was just stating facts. They don't accept in Tamilnadu.. Combination of inconsistent design philosophy by RBI, lack of awareness, and abundance of rumours about counterfeit currency. I got it in Chennai and spent it in Chennai just today and yesterday. Maybe thing are different in rural areas? Yeah..it might be due to rural condition..i tried to use it in Salem, Namakkal, Coimbatore region.. Arunachal pradesh my state where no one no one accepts any coins 🧎‍♀️ This was because a fake whatsapp forward message in 2018 that was running around in bangalore. I got the same whatsapp message. I ignored it. But some didn't. Rich Sounds like people have lost faith in the currency. Wonder why. Well, I don't know about Chhattisgarh, but they are accepted in Gujarat What about ₹20 coin? There is a ₹20 coin? It is accepted in some cities like Ahmedabad. While in Rajkot, they refuse to take 10 Rs coin. Yeah same , accepted in jaipur but not in alwar I was in bhavnagar. And they said it's banned I gave a 10rs coin to parking security guard at a hotel in TN, he said he wont take it and asked for something else. His loss. Yes, you can google it for images Buses in mysore don't accept them as well, and i had to get off the bus since I didn't have any notes. It's so unfair. Fuckin degenerates is why. I'm from TN, most places here accept ₹10 coin but there are a few exceptions. When I went to Salem I was surprised to see them refuse to take ₹10 coins. I have lived in Kolkata for 6 years now and never had any problems with any coins. Every shop and transport services accepts these coins. At least to the ones I have been and used so far. MP ? 😂😂We don't buy toffee. Shopkeeper automatically gives it to us when he falls short of Re.1 coins. What do you guys use as currency? No, WB Rupee 🧎‍♀️ I'm in TN and for every 1 shopkeeper who refuses the coin, there's 4 who accept it, at least that's what I've experienced Its just shopkeepers being stupid. Currently where I'm staying they wont take ₹10 coin, but will take a ₹20 coin WhatsApp forwards are responsible for this. For you information The ₹ symbol is here in Google keyboard \\[English (India) language\\]. Don't know about other keyboards. (Some people using Rs instead of ₹, if they don't know this is information, if they know and are still using Rs, your choice.) Seen this shit in jharkhand. They don't accept ₹1 coin also. Actually you're mistaken about Tamil Nadu, people in Coimbatore Dodge this coin like it will give them the plague or something I think coins are limited in that regard. For egs, you can refuse someone paying huge amount in only coins. Oh boy coin storage and banks, name a more damned duo. I was sweating balls when I saw more than ₹1L in 1s, 2s and 5s in my branch. Okay. I was just visiting Chennai. People in this post told me that other area don't accept it Not easy to carry along one of the prime reason UPI doesn't work for the homeless, the beggars and the people in abject poverty. We need to think of them as well. I commute daily in chennai by mtc buses 10rs coins are common here I haven't met any bus conductor who refused to take it. Even I see rs20 coins here and there. They might be using the US or UK English keyboard. I know I do it too. Ministry of Finance issues all the coins, rights? in bangalore, the 10rs coin are not accepted by any shopkeeper. and when i go to my town in bihar, not a single soul accepts the small 1rs coin. Even in most Tamil Nadu states 10rs coin were not accepted. Govt should do advertisement that 10rs coins is in legal tender. I once tried to give a beggar a 10rs coin and they rejected it.. Guess beggars can be choosers. ( Opposite of the idiom beggars can't be choosers) Literally r/choosingbeggars Gvt will put front page ads during elections but will not care about this as no money here and debunking whatsapp will go against their core voters I got a 20rs coin from a shopkeeper in Bihar. So ig marketplace accepts 20rs coins Posted screenshot of this there. Government should issue a notice so nobody refuses this coin Lack of Knowledge and Lack of Trust. Somewhere in MP Because they are heavy. And you cant flex your money with coins. Gimme 10 notes of Rs 10 denomination and i will fling it on dancer. Cant do that with 10 coins, specially the 10 denomination ones that hurt like hell when thrown at people. Even I had not heard of this shit. The shopkeepers will always offer toffees. The recently launched city bus had a fixed fare of 7₹. But they had to rehash it to to 5₹ as neither the travellers would have 2₹ change nor they were willing to accept 3₹ of change from the conductor. Ye chutiyapa to UP me hota h😂 Shopkeepers used to say that these coins are fake. Dancer? As in strip clubs? Are there strip clubs in India? Always seen them in Hollywood movies and TV shows. My home state is Tripura here 10 ruppee coins are not accepted but I study in West Bengal where they are its weird I have no clue why How is thatb the coin's fault lol? Fix your pockets. This is wild. Everything is accepted here in Mumbai. Unsold Toffee sell krne ki ninja technique 😂😂 Puzzle: I was born in MP, now I live in Chhattisgarh. But I live in the same city in which I was born in. Even Bitcoin 🤪? They're used normally here in MH, i like them (and probably others too) because all 10 rs notes are small, flimsy and dirty People dumb ... People hear rumours ... People brain go oonga boonga ... People reject coin And I am facing a shortage of Rs. 1 coin in our area. Shopkeepers happily accept it nowadays. Durg? Specially if cash retention limit is low in your branches that 2 lakh will always be a burden >! My intention was to confuse people who don't know that Chhattisgarh used to be a part of MP and was partitioned in the year 2000. I am from Bastar District.!< In my state Uttarakhand, I never faced any issue with the acceptance of this coin. I used to give this coin regularly to shopkeepers and bus conductors. However in the initial days of its launch their were rumours about this coin being counterfeit and I guess in some states people completely believed the rumours and never found out that they were false. whatsapp rumours Actually, RBI doesn't design the coins. Unlike popular belief, one rupee notes (if there are any still in printing) and coins, are designed and minted by the Government of India, RBI's role is limited to the distribution of the coins. That is correct, and because buses are commonly used there, disposing off small change isnt a problem. But in the districts, the smaller 1 and 2 rs. coins aren't accepted. Or atleast they weren't being accepted in Canning back when I used to work there. Haha ok Im from CG also. It works in Bhilai but for some reason doesn't work in durg Actually there are two types of 10₹ coins one is this and another one doesn't have ₹ symbol. So that's the only reason they don't accept any of them and speaking of South Indians they are more literate then the rest of the India so they know the coins are not fake even it doesn't have the ₹ symbol Just had an autorickshaw guy hand me 4 of these as change for a Rs 50 note (fare was 10rs). So yeah no issues here. Trouble is you can't carry too many of these. Paper is almost weightless while this stuff will literally pull your pants down in public. Do you stay in Hooghly? It works in Bhilai? I haven't visited my aunt in a while so I didn't know that. Which state? It's actually illegal to deny a legal tender or bill. Sometimes I wonder how are these people who believe in random messages are fit to caste vote I don't think anyone will file a complain for such a small amount Absolutely, Me reading this comment sitting in my classroom be like🤥 They don’t accept the fake ones When I am in Hooghly, coins are accepted more, as notes are often torn...but when I am in Patna, people refuse to take 1 rs coin...so just like op stated it depends on the state.. Eh in the mewat region of rajastan they don't accept 10 rupees coin because some MF in bhilwara minted fake coins. When I was in Kota, those foolish shopkeepers denied taking ₹10 coins. But here in haryana, they accept it. It must be some specific area of Durg cuz it worked fine in the places i visited. But yeah, it works fine in Bhilai. This is a symptom of how little faith we have on the country and its governance West Bengal The only place where ₹10 coins are accepted in Tamilnadu is Chennai, any place besides that, they don't accept it. I will be careful to spend all my coins before leaving Chennai to my hometown yeah, you would get those coins mostly from conductors in bus and be sure to spend them for the same. They don't accept small one rupee coins in my state. Very weird. There is also another coin of ₹10 which doesn't have a rupee symbol and the design above spans more than 10. Those were rumoured counterfeit coins but later said it was not Merko bol mein 1000-2000 bhijwa dunga Ah TIL. lol those random fucking designs make a lot more sense now. Bhagwan ki kripa hoi we still have Gandhi ji on the banknotes Honestly didn't know they are not accepted in some place. I mean it has the same value as of 10 Rs note. Lmao. I too, never understood the whole ordeal behind changing currency designs. They dont make it look any more modern or something. Only thing the changes contribute to is rumors and inconsistencies. Countries go years without changing their currency desgins, but our Government has a little too much time on hand I suppose lol. I use UPI but otherwise I get note signed by them to get that Re. 1 later I used to collect those toffees and when it reaches 10 or multiples of 10 I would exchange it with Lays or Cheetos. Finally he stopped giving me toffees and gave me the exact change. Ppl in TN Chennai only accept it because its given by the conductors. Busses play a major role in Chennai , it's not the same caliber in other parts of TN so they don't usually accept 10 ₹coins . The solution to this could be to provide it in public transport outlets , this would increase the trust and also we know our govt. Officers will provide a spicy reply to them if they are denied so it's a win-win , ppl won't generally question govt officers either . In delhi everyone takes the 10 Rs coin. I'm from Kerala. The most logical reason would be (imo) if it rains, shopkeepers or anyone would be willing to take it but if it is a drenched 10rs note, no one will take it. It's Chattisgarh so they are probably illiterate and think it's a fake coin As opposed to other states where the shopkeepers are PhD holders. Come to Kerala. Almost everyone asks you to pay with changes In Goa it has happened because of 2 reasons. First being the refusal to accept the coins by local private bus conductors because they find it difficult to carry them. As a domino effect, the people who travel by buses everyday, including most of the small vegetable and fish vendors started to refuse these coins from their customers and eventually the entire market demonetized these coins. Same thing has happened in Karnataka too but surprisingly it hasn't happened in Maharashtra. Second reason is that the banks used to levy handling charges as much as ₹50 per ₹1000 rupees deposited in the form of these coins. According to my bank, RBI is now trying to counter this problem by not sending new ₹10 notes to the banks in Goa. As a result there has been an extreme shortage of ₹10 notes in the market and the coins are back in circulation. Although the private bus conductors and paan gutka kiosks are still resisting. I'm afraid once the notes are back, we'll be back to square one. I've seen shopkeepers read newspapers in other states, so they probably got the memo about this coin a long time ago because lot of customers are not accepting it saying they don’t want 10 ruppe coin as it’s hard to manage rather they ask for 10 ruppes notes not accepted some shops in my village. The illiterates refuse because they find it difficult to keep up with the ever shrinking sizes of the coins and the uneducated follow suit even though they can differentiate between the coins. I generally avoid coins because they make my wallet heavy We weren't so fortunate 😅 And that ₹1 note could never translate to currency ... Yehh never had problems with coins in MH It also depends on how random our policy makers are If big denominations can go illegal overnight then this is nothing. At first he refused to take it. After arguing with him for a long time, he gave up. Then after some time he stopped bartering toffees for lays and gave me my money back r/usernamechecksout? There was fake news that 10rs coin are fake and not backed by RBI. And dumb people fell for it. Think about it a gang who forges money will waste their time forging coins of low denomination (which requires metal machinery, very costly) rather than forging high value notes where profit margins is high . I am quite bright at intelligence but I do dumb shit all the time. So my brother suggested this username. So, it checks out? I intentionally paid Re. 1 less for items next time 😂 Yeah after showing that note for approval Low WhatsApp University graduate population = acceptance of 10 ruppe coin Here, shopkeepers have totally stopped taking 1rs coin either new or old. racism West Bengal? Right? >I am quite bright at intelligence Spoken like a very intelligence Tell them to send them to branches in Mumbai. As far as I have seen, ₹1(new and old), ₹2(new and old),₹5,₹10,₹20 coins are being accepted by common people in Mumbai. A shopkeeper told me that when someone dies, they throw 1 rupees coin on streets and beggers pick those coin up, so since beggers are associated with that coin, rest of people don't use it. Yes Never thought about that. Not officially... There is racism in India? (Indians preferring fair skinned people is called colourism) Main reason is due to false information regarding 10 Rs. coins are being forwarded across social medias and whatsapp. WhatsApp University 10 rs coin is a stupid idea that can be dreamt up by us only. Hard to carry. Easy to misplace. Who is the genius behind this coin? I g RBI should make a website for all legal coins and notes to solve this issue It's an offence to deny accepting a legal tender in return for any commodity or service ! So as long as a currency note or a coin is a legal tender everyone is bound to accept it as a form of payment. Do what you must with this information, you can report such individuals to RBI ! 😜 They are legal tender but lets be honest many people are toppers of whatsapp university and hence will believe any news of \"Rs 5 coin will be banned from tomorrow\" that comes in their chats [Deccan Herald made a nice video about this.](https://www.youtube.com/watch?v=IZrW07mdccE ) Grammar is not my forte With images He he he I am From Andhra Pradesh (Guntur). Now even Here nobody are Accepting them I don't know whether They are Not Accepting throughout state Are ony in my Home town Where I live, most of the shopkeeper are hell-bent on 'no ₹10 coins' even to the point that one time I told a shopkeeper I've nothing but ₹10 coins and he said to keep it with me and pay him later. I asked why he won't accept them and he said that it's very hard to organise and keep count of coins so he just doesn't accepts them at all, doesn't sound like a convincing argument but still from then on I never accept ₹10 coins as well. Doesn't help that the government willy nilly keeps pulling currency notes out of circulation - I've been stuck with twenty eight 2K notes for a month now and my big plan is to load them on Amazon because it's too much of a hassle to go to a bank thrice. Up Varanasi me 1 sikka Mila hamko usme 12 danta tha normal wala me 10 tha to wo reject kr diya dukandar. Bola ye fake hai lmao fir dusra shopkeeper accept kr liya You should be made world president and made to solve global problems Dear Sire🎩 In Bangalore even the government bus conductor doesn't accept the 10 coin all thanks to WhatsApp forwards Naah no one will touch that coin in coimbatore..I tried everywhere ..shops groceries bus conductors..nope.. almost gave it to the bank.. Luckily mom told me to keep it in case my kids might like to collect one day fake news from whatsapp, small town and villages get these kind of news saying these coins are fake, a quick google search will give them the answer but they will still refuse as it has become a norm, and even if they accepted that coin from you, they still cannot spend it anywhere in your state, When i went to my mothers native place people refused to give change for 2000 rs note, as the local economy wont have change for it, you can see the same effect if you give a TN bus conductor a 100rs note. Or they might have been actual victim of conterfit, so the community might have started avoiding a certain note/coin to avoid being cheated, then that practice continues to further decades and now it seem like an state is avoiding 10rs Coin, ask your grandmother. Here in our Odisha I still can use it very well🙆‍♀️ ps. all coins are in use here starting from little one ruppee to big ten ruppee Wala like this False info It could be because of some viral WhatsApp message.I remember one say I went to buy groceries and the guy refused to accept 1 and 2₹ coins. He denied giving any explanation even though it was being accepted just the day before. So I asked a fruit seller who I had good terms with and he explained that they recieved news from WhatsApp that these coins will stop being legal tender and whoever has them will be apprehended. Good thing was they soon realise it was a false message yet it still took like 3-4months for them to accept it again. I am from Ghaziabad. And I don't know why, but the shopkeeper refuses to take 1 and 2 rupee coins. Because of illiteracy No How? And Why? In my state, ₹10 and ₹20 coins work like normal. No hichkich. But in NCR some rickshaw drivers were hesitant to accept it maybe due to storage problem or something idk How.... I dk why.. I don't know.. And it is so strange that public or customers don't say anything. 🙃 Whatsapp university In my hometown they don't accept 10 rupees coins with 15 drop marks and a small 1 rupees coin. Because there are too many fakes around That's just stupid RBI is entrusted with printing of all denominations of the Indian Currency Notes except for the ₹1 denomination which is printed by GoI. The organisation responsible for minting Indian Currency Coins is Security Printing & Minting Corporation of India Ltd. (SPMCIL) under Department of Economic Affairs, Ministry of Finance, Government of India. Arunachal pe toh kela sab dukandar nakli paisa samajhte hai . We save these coins for intracity transport or cigarettes in Assam Chattisgarh me abhi bhi chalta h bhai mai khud CG ka hu Yes. 10 rs coins were not being accepted in Hyderabad but they were readily being accepted in UP vns allahabad. It's all misinformation spread that govt is going to close a certain coin Its just supply and demand Where I live, they dont even accept 1 or 2 rupee coins, Just 5 rs and 10 rs coins, most shopkeepers round it to nearest 5, people agree, there no cadbury exchange, if buying something by kilo etc they just add a little more to round it to next 5, etc. No one has 1 or 2 rupee coins here, lol When travelling to other states i get some change , but have to spend it or keep it at home before coming back. Legally speaking , they have to accept it, but its just a hassle and no one wants to do it. Mai Jagdalpur se hu. Yaha natak karte hai My friend from Arunachal Pradesh told me they don't accept 2000 rupee notes there. And this was before they got discontinued. They wont accept this coin in AP Gawar log Step out of Chennai and nobody wants those couns ye sab demonetization k bad itna tatti hogya hai. in my town people don't accept any coin accept other than 10 or 5. fuckers. Gandhi is a relatively new addition to the Indian currency. For most of history, Indian currency didn't feature Gandhi in any way Yep. Karnataka accepts the coin What's a federal crime in India? I thought it applied only to US? I asked one shopkeeper why he wasn't 10 rupee coins and he said that there are fake coins circulating Fake news circulation. Govt should advertise properly that it is illegal not to accept those. It is happening here in Lucknow as well. So annoying. I also faced this in Kanpur. Not 10 but 1 ₹coins a few years back. Now they don't have issues. Because Original 10 rupees coin has rupees symbol on it while duplicate ones don't ❌ Arey koi 1 aur 2 rupya ka coin bi ni le rha hai. Kahan tum 10 me lage ho?! People be stupid. Coins are still being accepted in Odisa. Not in Chatisgarh. They wont even take 5/2/1 rupee coin here. Which pants? It's just how aware people about there currency no one can refuse to tke 1 rupee and coins as it's our currency; while other are promissory notes of RBI. All the fake news circulated on WhatsApp and most of them accept it. Once I argued with shopkeeper for not accepting the coin, then I showed the RBI rules whereas mentions about it but didn't, agreed. At last I threw a mentoes over him and left without any word. Who in their right mind PAYS for toffee? It's hard enough to figure out what to do with the ones forced on you by shopkeepers instead of change. I never knew anyone actually paid for them. But if you really want them, surely you'll not buy it one by one for one rupee each. when i went to gujarat even there they don’t accept ₹10 coins Nothing to do with states, OP. Coins are supposed to be accepted everywhere but some people don't like them. I don't like the coins myself, simply because I hate carrying them around, so I ask for notes whenever I can. No big deal. SAAAAT KAROD ! Hear it happen with small 1 rupees coin some dumbass shopkeeper spread rumer they are not working and everyone is following that In my home and state all types of coins are accepted and used some people have made a collection of old coins to recent ₹20 coins. Kerala is fine with it poor ₹ 10 coin facing racism 😂 I don't know about other states if they don't accept it but I know about my state that is chhattisgarh. Few years ago when I was in 12th that was few months before the 2019 election there was a rumor that was circulated in social media and even some print media printed it, the rumor said that collector of Raipur have told that 10 rupees coins will be not be used in the state. It spreaded like wild fire and when the concerned authorities cleared the rumor out it was too late and ever since then all the shopkeepers across chhattisgarh refused to take 10 rupees coin. I had an heated argument with a shopkeeper myself I said that it was just a rumor but he didn't believe me🥲 This is what I know of this issue. i ment to say they hate coins and like notes, and ya there is a lot of racism here This is my NFT 10 Rs coin image Section 6, Indian Coinage Act, 2011. Where in CG bro? I use it just fine in Durg & Bhilai And here I am, went to exchange 2000 notes and SBI gave me 10k worth of Rs. 10 coins in replacement phonepe? Jagdalpur I guess the rumour travelled from Raipur to Jagdalpur because here they don't take it. bihar Do you stay in Hooghly? 👀 Maybe. If all Hooghlians respond to questions with the same question back. Hooghlian confirmed. Literally 0 shopkeepers in my city accept the coin. So it is worthless to me unless I deposit it in a bank. If I buy more than 1, I would be tempted to eat them.whivh is bad for my health due to obesity. My favourite is Pulse Kacha Aam. I purchase it whenever I spot it. just use ethereum already It’s technically illegal to reject legal tender like coins right? Who sells toffee for 1 rs ?? I think the new ₹10 notes are not circulating in other cities as well, it has been a long time since I saw a new ₹10 note here in Chennai. Yes Pulse is ₹1 per piece. Hot damn I take it back, i totally forgot how chemists in Mumbai give Vicks or pulse instead of change Share the 20 rupees coin picture here please From Rs 1 to Rs 10 notes are printed by the government, and other than that all the others are printed by RBI that's why the circulation is limited for coins . In Manipur,Nagaland,Mizoram and some districts of Assam dont valid the Rs.5/10/20 coins. For 10 rs coin, people never care to identify whether its real Or fake. As most of them we Used in travelling so no One check. this is the reason. people genuinely dont know whats real and whats not. there are 20 different versions of 1 rupee coin, WHY? Well coins are minted by the government of India. So if anyone rejects the validity of the coin it's akin to rejecting the authority of the government. So it may be enough to jail a person who rejects it. ***We rarely see in himachal. if we found, it might be wonder. Also coins make our wallet worse(Men), our plastic cards can get cracks!*** There were rumours that this coins were banned by gov. hence some people don't accept them. Despite the apex bank issuing multiple press releases assuring the continued validity of all variants of these 10 rs. coins and they being in legal tender sections of the society continue to disregard the directions and refuse them. During my recent trip to Rameswaram these coins were outright refused to small to big shops. Whereas in /r/Chennai, these coins can be used without any demur or issue. Dude. I'm in Durg & Bhilai and ₹10 coin is completely accepted here. It's a problem exclusive to Raipur area (not sure about Bilaspur) I am from Jagdalpur I owe you wala note?? Well if 500 and 1000 legal tender can be declared illegal by a pyscho, the new 10s and 20s coins under his tenure would also face ignominy, who knows what the pyscho may ban next. What about the government guy who declared 500 and 1000 bucks as illegal? He deserves Kala Pani in that case. My family owns a huge kiryana mrket and we have stopped accepting these coins only due to one reason. Banks dont like it when we bring a gigantic bag of 10rs coins to their doorstep and outright refuse to accept them because they dont want to count them. Even if they have a coin counter they will not use it so we stopped accepting them Awesome!! Tbh the whole of chhattisgarh Yeah I believe that but now it's fading away slowly here and in bilaspur it wasn't long lived. It all depends upon the place. In Kerala, Tamil, Andhra Pradesh and Telangana everyone accepts all the coins that are in legal tender. But in Karnataka in Mysore everyone accepts it but in Bangalore some don’t but majority does. So I believe that education plays a role here. People who are educated know what is right and what is wrong whereas the uneducated will still trust WhatsApp university. Tbh it’s illegal not to accept coins that are in legal tender and if a consumer wants to fight you can go to the court and you’ll win. But I don’t think it’s worth filing a case in court against a person for ₹10. You can spend that in a mall or in some big supermarkets like D-Mart, Smart point, Smart bazaar etc. Else you can exchange it with a note in bank. As simple as that."
}