{
    "id": "j8i0u0",
    "title": "While India copes with COVID-19, Aadhaar continues its function creep #SaveOurPrivacy",
    "url": "https://www.reddit.com/r/india/comments/j8i0u0/while_india_copes_with_covid19_aadhaar_continues/",
    "selftext": "https://preview.redd.it/q551g0vwr8s51.png?width=1024&amp;format=png&amp;auto=webp&amp;s=435acce8bb071cc833734894529045574b4d374b\n\n### Tl;dr\n\nThe latest Aadhaar Good Governance Rules notified in August 2020 legitimize function creep of the Aadhaar programme by allowing Aadhaar authentication for usage of digital platforms to ensure good governance, prevention of dissipation of social welfare benefits, and enablement of innovation and the spread of knowledge. These Rules come on the heels of amendements to the Aadhaar Act in 2019 which authorized use of Aadhaar by private parties, and these amendments have been challenged before the Supreme Court for violating the judgement in *K.S. Puttaswamy v. Union of India- Aadhaar 5J.* The cummulative impact of the Aadhaar Amendment Act 2019 and the Aadhaar Good Governance Rules 2020 is that there remain virtually no limitations on the use of Aadhaar authentication, which had earlier been restricted by the Supreme Court to only government entities and only for receipt of benefits and subsidies funded by the Consolidated Fund of India. \n\n### Background\n\nThe Aadhaar project, which is a biometrics based national unique ID programme, was challenged before the Supreme Court of India in *K.S. Puttaswamy v. Union of India* in 2012 for violating individual privacy and causing exclusion. The subsequent litigation led to the question of whether the right to privacy is a  fundamental right under the Indian Constitution being referred to a nine judge bench of the Supreme Court. In *K.S. Puttaswamy v. Union of India- Privacy 9J (2017 10 SCC 1)*, this nine judge bench unanimously held the privacy is a fundamental right and any restrictions upon this right must satisfy the proportionality standard. \n\nThe constitutionality of the Aadhaar Act, 2016 was specifically addressed by a five judge bench of the Supreme Court in its subsequent judgement in *K.S. Puttaswamy v. Union of India- Aadhaar 5J (2019 1 SCC 1),* where the majority of judges upheld the constitutionality of the Act subject to certain limitations. Most importantly, the Supreme Court held that under Section 7 of the Aadhaar Act, an Aadhaar number cannot be mandated unless it involves seeking any subsidy, benefit or service for which the expenditure is incurred by the Consolidated Fund of India. The Court also struck down Section 57 of the Aadhaar Act to the extent it allowed use of Aadhaar authentication by private parties since it would lead to commercial exploitation of biometric and demographic information. \n\nDespite the Supreme Court finding that use of Aadhaar authentication by private parties is a dispropotionate invasion of privacy, the government soon proposed [**amendments**](https://uidai.gov.in/images/news/Amendment_Act_2019.pdf) to the Aadhaar Act which would allow private parties to continue using Aadhaar to establish the identity of their users. Through the Aadhaar and Other Laws (Amendment) Act 2019, private entities were allowed to perform authentication through Aadhaar, if the Unique Identification Authority of India (UIDAI) is satisfied that it is: (i) compliant with certain standards of privacy and security, or (ii) permitted by law, or (iii) seeking authentication for a purpose specified by the central government in the interest of the State. The constitutionality of these amendments has been [**challenged**](https://indianexpress.com/article/india/sc-to-examine-validity-of-amended-law-allowing-private-firms-to-use-aadhaar-data-6132402/) before the Supreme Court. Legal experts have also [**explained**](https://thewire.in/law/in-striking-down-section-57-sc-has-curtailed-the-function-creep-and-financial-future-of-aadhaar) that Aadhaar authentication by private parties is inconsistent with the judgement in *K.S. Puttaswamy v. Union of India- Aadhaar 5J* since *\"the majority upholds the Aadhaar Act on the premise that authentication is proportional only when used for state purposes to deliver services socio-economic benefits that are linked to human dignity\"* and *\"this analogy does not extend to private/commercial interests.\"*\n\n### The Aadhaar Good Governance Rules, 2020\n\nThe Aadhaar Authentication for Good Governance (Social Welfare, Innovation, Knowledge) Rules, 2020 were [**notified**](https://uidai.gov.in//images/Aadhaar_Authentication_for_Good_Governance_Rules_2020.pdf) by the central government in August 2020. The Rules allow Aadhaar authentication by *“requesting entities”* in the *“interest of good governance, preventing leakage of public funds, promoting ease of living of residents and enabling better access to services for them”* for the enlisted purposes of:  \n\n\n(a) usage of digital platforms to ensure good governance;  \n(b) prevention of dissipation of social welfare benefits; and  \n(c) enablement of innovation and the spread of knowledge.\n\nAs per the rules, the authentication of Aadhaar by these requesting entities shall be on a voluntary basis but past experience raises serious concerns about Aadhaar being voluntary only on paper, and not in practice. Under the Rules, the relevant ministry or the department of the central government or the state government is required to prepare a proposal with a justification for the purpose for which it is seeking Aadhaar authentication. This proposal submitted to the Central Government will then be referred to UIDAI, and if UIDAI is satisfied that the proposal fulfills the enlisted purposes, the requesting entity shall be allowed to ask for Aadhaar authentication. \n\nThe application form and the guidelines for submission of a proposal under the Rules mandate that the proposal should contain a *“brief description of the initiative or scheme highlighting the benefit that would accrue from its implementation”.* It further states that such benefits should be relatable to the specified purposes, for example, “*by facilitating participation, accountability, transparency, responsiveness, efficiency, effectiveness, equity, inclusion etc. which reduce or eliminate transaction costs, or promote ease of living of residents or enable better access to services for them*.” It also requires that the justification of the purpose should be brought out clearly, and the proposal should explain the “*ecosystem and the processes involved in the achievement or delivery of the benefit.”*  \n\n\n### A Free for All Privacy Nightmare\n\nThe purposes for requesting Aadhaar authentication under the Aadhaar Good Governance Rules, 2020 are extremely vague and broad, and any government service can potentially fall within their scope. There are no parameters laid down for the UIDAI to determine whether Aadhaar authentication is 'necessary,' especially since the purposes themselves are so ambiguously wide and pale in comparison to the seriousness of the fundamental right to privacy. Therefore, in the absence of strict guidelines, all and sundry purposes can be sought to be justified. For example, the first chairman of the UIDAI has already [**expressed**](https://www.hindustantimes.com/analysis/how-to-vaccinate-a-billion-people/story-9Tc4QzQpWNVGgSJQIBMfCP.html) his views on the benefits of Aadhaar authentication for distribution of COVID-19 vaccines. \n\nAllowing such authentication runs the risk of being directly in the teeth of the Supreme Court judgment in *K.S. Puttaswamy v. Union of India- Aadhaar 5J* wherein it was categorically held that Aadhaar enrolment can be mandated only for receipt of \"*any subsidy, benefit or service under the welfare scheme of the government expenditure whereof is to be met from the Consolidated Fund of India.\"* It should also be noted that when read together with the amendments to the Aadhaar Act in 2019, the Aadhaar Good Governance Rules 2020 create a risk of use of Aadhaar authentication by private parties for wide ranging purposes since Section 4(4) of the Aadhaar Act now allows any \"requesting entity\" to seek permission for Aadhaar authentication from UIDAI. Rule 3 of the Aadhaar Good Governance Rules requires proposals for Aadhaar authentication by requesting entities to be submitted by the government ministries or departments but there is no pre-condition that the requesting entity on whose behalf Aadhaar authentication is being sought should also be a government entity. \n\nThe dependence on Aadhaar authentication to prevent dissipation of benefits has led to the [**exclusion**](https://www.washingtonpost.com/world/asia_pacific/indias-vast-biometric-program-was-supposed-to-end-corruption-but-the-neediest-may-be-hit-hardest/2018/03/24/bb212a86-289c-11e8-a227-fd2b009466bc_story.html) of many people who are the rightful beneficiaries of these entitlements, and such exclusion is counterproductive if the goal is improving access to government services. A study conducted by the [**Abdul Latif Jameel Poverty Action Lab** ](https://www.nber.org/papers/w26744)in Jharkhand found that at least 88% of the ration cards that were cancelled, were in fact genuine claims. There have also been [**several instances**](https://www.epw.in/engage/article/aadhaar-failures-food-services-welfare) of people facing practical difficulties in getting Aadhaar numbers and accessing welfare schemes because of lack of awareness, lack of infrastructure, immobility due to illness etc. \n\nFrom the very inception of Aadhaar, the government has claimed that its biometric authentication technology helps prevent identity fraud and ensures that benefits only go to the deserving. However, as economists have pointed out, there is [**no reliable evidence**](https://indianexpress.com/article/opinion/columns/uidai-aadhaar-card-the-real-beneficiary-4684994/)backing claims of widespread identity fraud and Aadhaar's ability to plug these leakages. Further, an RTI query revealed that 99.97 percent of people who enrolled for an Aadhaar number did it on the basis of existing identification documents, so lack of identification documents is clearly not the main cause of  exclusion from welfare programmes. \n\nTo conclude, as Rethink Aadhaar has incisively noted in this excellent [**post**](https://rethinkaadhaar.in/blog/2020/8/7/new-aadhaar-rules-for-good-governance-are-constitutionally-impermissible), the Aadhaar Good Governance Rules 2020 are just old wine in a new bottle. The purpose of subordinate legislation is to be more operationally specific, by clarifying ambiguities. However, the Rules come across as an attempt to sidestep the Supreme Court judgement in *K.S. Puttaswamy v. Union of India Aadhaar-5J* by expanding the scope of the Aadhaar project through the trappings of vague rules and guidelines.\n\n### Important Documents\n\n1. Aadhaar Good Governance Rules, 2020 ([**link**](https://uidai.gov.in//images/Aadhaar_Authentication_for_Good_Governance_Rules_2020.pdf))\n2. Aadhaar Amendment Act, 2019 ([**link**](https://uidai.gov.in/images/news/Amendment_Act_2019.pdf))\n3. Aadhaar Act, 2016 ([**link**](https://uidai.gov.in/images/the_aadhaar_act_2016.pdf))",
    "flair": "Policy/Economy",
    "score": 6,
    "num_comments": 0,
    "created_utc": 1602324540,
    "convurl": "https://b.thumbs.redditmedia.com/rlkjgPQFXw5SkBMelrMtdTV0cMNMqeCdC_AfY3Yxm1I.jpg",
    "comments": [],
    "cleaned_text": "india copes covid aadhaar continues function creep saveourprivacy tldr latest aadhaar good governance rules notified august legitimize function creep aadhaar programme allowing aadhaar authentication usage digital platforms ensure good governance prevention dissipation social welfare benefits enablement innovation spread knowledge rules come heels amendements aadhaar act authorized use aadhaar private parties amendments challenged supreme court violating judgement ks puttaswamy v union india aadhaar j cummulative impact aadhaar amendment act aadhaar good governance rules remain virtually limitations use aadhaar authentication earlier restricted supreme court government entities receipt benefits subsidies funded consolidated fund india background aadhaar project biometrics based national unique id programme challenged supreme court india ks puttaswamy v union india violating individual privacy causing exclusion subsequent litigation led question whether right privacy fundamental right indian constitution referred nine judge bench supreme court ks puttaswamy v union india privacy j scc nine judge bench unanimously held privacy fundamental right restrictions upon right must satisfy proportionality standard constitutionality aadhaar act specifically addressed five judge bench supreme court subsequent judgement ks puttaswamy v union india aadhaar j scc majority judges upheld constitutionality act subject certain limitations importantly supreme court held section aadhaar act aadhaar number mandated unless involves seeking subsidy benefit service expenditure incurred consolidated fund india court also struck section aadhaar act extent allowed use aadhaar authentication private parties since would lead commercial exploitation biometric demographic information despite supreme court finding use aadhaar authentication private parties dispropotionate invasion privacy government soon proposed amendmentshttpsuidaigovinimagesnewsamendmentactpdf aadhaar act would allow private parties continue using aadhaar establish identity users aadhaar laws amendment act private entities allowed perform authentication aadhaar unique identification authority india uidai satisfied compliant certain standards privacy security ii permitted law iii seeking authentication purpose specified central government interest state constitutionality amendments challengedhttpsindianexpresscomarticleindiasctoexaminevalidityofamendedlawallowingprivatefirmstouseaadhaardata supreme court legal experts also explainedhttpsthewireinlawinstrikingdownsectionschascurtailedthefunctioncreepandfinancialfutureofaadhaar aadhaar authentication private parties inconsistent judgement ks puttaswamy v union india aadhaar j since majority upholds aadhaar act premise authentication proportional used state purposes deliver services socioeconomic benefits linked human dignity analogy extend privatecommercial interests aadhaar good governance rules aadhaar authentication good governance social welfare innovation knowledge rules notifiedhttpsuidaigovinimagesaadhaarauthenticationforgoodgovernancerulespdf central government august rules allow aadhaar authentication requesting entities interest good governance preventing leakage public funds promoting ease living residents enabling better access services enlisted purposes usage digital platforms ensure good governance b prevention dissipation social welfare benefits c enablement innovation spread knowledge per rules authentication aadhaar requesting entities shall voluntary basis past experience raises serious concerns aadhaar voluntary paper practice rules relevant ministry department central government state government required prepare proposal justification purpose seeking aadhaar authentication proposal submitted central government referred uidai uidai satisfied proposal fulfills enlisted purposes requesting entity shall allowed ask aadhaar authentication application form guidelines submission proposal rules mandate proposal contain brief description initiative scheme highlighting benefit would accrue implementation states benefits relatable specified purposes example facilitating participation accountability transparency responsiveness efficiency effectiveness equity inclusion etc reduce eliminate transaction costs promote ease living residents enable better access services also requires justification purpose brought clearly proposal explain ecosystem processes involved achievement delivery benefit free privacy nightmare purposes requesting aadhaar authentication aadhaar good governance rules extremely vague broad government service potentially fall within scope parameters laid uidai determine whether aadhaar authentication necessary especially since purposes ambiguously wide pale comparison seriousness fundamental right privacy therefore absence strict guidelines sundry purposes sought justified example first chairman uidai already expressedhttpswwwhindustantimescomanalysishowtovaccinateabillionpeoplestorytcqzqpwnvggsjqibmfcphtml views benefits aadhaar authentication distribution covid vaccines allowing authentication runs risk directly teeth supreme court judgment ks puttaswamy v union india aadhaar j wherein categorically held aadhaar enrolment mandated receipt subsidy benefit service welfare scheme government expenditure whereof met consolidated fund india also noted read together amendments aadhaar act aadhaar good governance rules create risk use aadhaar authentication private parties wide ranging purposes since section aadhaar act allows requesting entity seek permission aadhaar authentication uidai rule aadhaar good governance rules requires proposals aadhaar authentication requesting entities submitted government ministries departments precondition requesting entity whose behalf aadhaar authentication sought also government entity dependence aadhaar authentication prevent dissipation benefits led exclusionhttpswwwwashingtonpostcomworldasiapacificindiasvastbiometricprogramwassupposedtoendcorruptionbuttheneediestmaybehithardestbbaceafdbbcstoryhtml many people rightful beneficiaries entitlements exclusion counterproductive goal improving access government services study conducted abdul latif jameel poverty action lab httpswwwnberorgpaperswin jharkhand found least ration cards cancelled fact genuine claims also several instanceshttpswwwepwinengagearticleaadhaarfailuresfoodserviceswelfare people facing practical difficulties getting aadhaar numbers accessing welfare schemes lack awareness lack infrastructure immobility due illness etc inception aadhaar government claimed biometric authentication technology helps prevent identity fraud ensures benefits go deserving however economists pointed reliable evidencehttpsindianexpresscomarticleopinioncolumnsuidaiaadhaarcardtherealbeneficiarybacking claims widespread identity fraud aadhaars ability plug leakages rti query revealed percent people enrolled aadhaar number basis existing identification documents lack identification documents clearly main cause exclusion welfare programmes conclude rethink aadhaar incisively noted excellent posthttpsrethinkaadhaarinblognewaadhaarrulesforgoodgovernanceareconstitutionallyimpermissible aadhaar good governance rules old wine new bottle purpose subordinate legislation operationally specific clarifying ambiguities however rules come across attempt sidestep supreme court judgement ks puttaswamy v union india aadhaarj expanding scope aadhaar project trappings vague rules guidelines important documents aadhaar good governance rules linkhttpsuidaigovinimagesaadhaarauthenticationforgoodgovernancerulespdf aadhaar amendment act linkhttpsuidaigovinimagesnewsamendmentactpdf aadhaar act linkhttpsuidaigovinimagestheaadhaaractpdf ",
    "cleaned_title": "india copes covid aadhaar continues function creep saveourprivacy",
    "cleaned_selftext": "tldr latest aadhaar good governance rules notified august legitimize function creep aadhaar programme allowing aadhaar authentication usage digital platforms ensure good governance prevention dissipation social welfare benefits enablement innovation spread knowledge rules come heels amendements aadhaar act authorized use aadhaar private parties amendments challenged supreme court violating judgement ks puttaswamy v union india aadhaar j cummulative impact aadhaar amendment act aadhaar good governance rules remain virtually limitations use aadhaar authentication earlier restricted supreme court government entities receipt benefits subsidies funded consolidated fund india background aadhaar project biometrics based national unique id programme challenged supreme court india ks puttaswamy v union india violating individual privacy causing exclusion subsequent litigation led question whether right privacy fundamental right indian constitution referred nine judge bench supreme court ks puttaswamy v union india privacy j scc nine judge bench unanimously held privacy fundamental right restrictions upon right must satisfy proportionality standard constitutionality aadhaar act specifically addressed five judge bench supreme court subsequent judgement ks puttaswamy v union india aadhaar j scc majority judges upheld constitutionality act subject certain limitations importantly supreme court held section aadhaar act aadhaar number mandated unless involves seeking subsidy benefit service expenditure incurred consolidated fund india court also struck section aadhaar act extent allowed use aadhaar authentication private parties since would lead commercial exploitation biometric demographic information despite supreme court finding use aadhaar authentication private parties dispropotionate invasion privacy government soon proposed amendmentshttpsuidaigovinimagesnewsamendmentactpdf aadhaar act would allow private parties continue using aadhaar establish identity users aadhaar laws amendment act private entities allowed perform authentication aadhaar unique identification authority india uidai satisfied compliant certain standards privacy security ii permitted law iii seeking authentication purpose specified central government interest state constitutionality amendments challengedhttpsindianexpresscomarticleindiasctoexaminevalidityofamendedlawallowingprivatefirmstouseaadhaardata supreme court legal experts also explainedhttpsthewireinlawinstrikingdownsectionschascurtailedthefunctioncreepandfinancialfutureofaadhaar aadhaar authentication private parties inconsistent judgement ks puttaswamy v union india aadhaar j since majority upholds aadhaar act premise authentication proportional used state purposes deliver services socioeconomic benefits linked human dignity analogy extend privatecommercial interests aadhaar good governance rules aadhaar authentication good governance social welfare innovation knowledge rules notifiedhttpsuidaigovinimagesaadhaarauthenticationforgoodgovernancerulespdf central government august rules allow aadhaar authentication requesting entities interest good governance preventing leakage public funds promoting ease living residents enabling better access services enlisted purposes usage digital platforms ensure good governance b prevention dissipation social welfare benefits c enablement innovation spread knowledge per rules authentication aadhaar requesting entities shall voluntary basis past experience raises serious concerns aadhaar voluntary paper practice rules relevant ministry department central government state government required prepare proposal justification purpose seeking aadhaar authentication proposal submitted central government referred uidai uidai satisfied proposal fulfills enlisted purposes requesting entity shall allowed ask aadhaar authentication application form guidelines submission proposal rules mandate proposal contain brief description initiative scheme highlighting benefit would accrue implementation states benefits relatable specified purposes example facilitating participation accountability transparency responsiveness efficiency effectiveness equity inclusion etc reduce eliminate transaction costs promote ease living residents enable better access services also requires justification purpose brought clearly proposal explain ecosystem processes involved achievement delivery benefit free privacy nightmare purposes requesting aadhaar authentication aadhaar good governance rules extremely vague broad government service potentially fall within scope parameters laid uidai determine whether aadhaar authentication necessary especially since purposes ambiguously wide pale comparison seriousness fundamental right privacy therefore absence strict guidelines sundry purposes sought justified example first chairman uidai already expressedhttpswwwhindustantimescomanalysishowtovaccinateabillionpeoplestorytcqzqpwnvggsjqibmfcphtml views benefits aadhaar authentication distribution covid vaccines allowing authentication runs risk directly teeth supreme court judgment ks puttaswamy v union india aadhaar j wherein categorically held aadhaar enrolment mandated receipt subsidy benefit service welfare scheme government expenditure whereof met consolidated fund india also noted read together amendments aadhaar act aadhaar good governance rules create risk use aadhaar authentication private parties wide ranging purposes since section aadhaar act allows requesting entity seek permission aadhaar authentication uidai rule aadhaar good governance rules requires proposals aadhaar authentication requesting entities submitted government ministries departments precondition requesting entity whose behalf aadhaar authentication sought also government entity dependence aadhaar authentication prevent dissipation benefits led exclusionhttpswwwwashingtonpostcomworldasiapacificindiasvastbiometricprogramwassupposedtoendcorruptionbuttheneediestmaybehithardestbbaceafdbbcstoryhtml many people rightful beneficiaries entitlements exclusion counterproductive goal improving access government services study conducted abdul latif jameel poverty action lab httpswwwnberorgpaperswin jharkhand found least ration cards cancelled fact genuine claims also several instanceshttpswwwepwinengagearticleaadhaarfailuresfoodserviceswelfare people facing practical difficulties getting aadhaar numbers accessing welfare schemes lack awareness lack infrastructure immobility due illness etc inception aadhaar government claimed biometric authentication technology helps prevent identity fraud ensures benefits go deserving however economists pointed reliable evidencehttpsindianexpresscomarticleopinioncolumnsuidaiaadhaarcardtherealbeneficiarybacking claims widespread identity fraud aadhaars ability plug leakages rti query revealed percent people enrolled aadhaar number basis existing identification documents lack identification documents clearly main cause exclusion welfare programmes conclude rethink aadhaar incisively noted excellent posthttpsrethinkaadhaarinblognewaadhaarrulesforgoodgovernanceareconstitutionallyimpermissible aadhaar good governance rules old wine new bottle purpose subordinate legislation operationally specific clarifying ambiguities however rules come across attempt sidestep supreme court judgement ks puttaswamy v union india aadhaarj expanding scope aadhaar project trappings vague rules guidelines important documents aadhaar good governance rules linkhttpsuidaigovinimagesaadhaarauthenticationforgoodgovernancerulespdf aadhaar amendment act linkhttpsuidaigovinimagesnewsamendmentactpdf aadhaar act linkhttpsuidaigovinimagestheaadhaaractpdf",
    "cleaned_comments": "",
    "light_cleaned_title": "While India copes with COVID-19, Aadhaar continues its function creep #SaveOurPrivacy",
    "light_cleaned_selftext": "### Tl;dr The latest Aadhaar Good Governance Rules notified in August 2020 legitimize function creep of the Aadhaar programme by allowing Aadhaar authentication for usage of digital platforms to ensure good governance, prevention of dissipation of social welfare benefits, and enablement of innovation and the spread of knowledge. These Rules come on the heels of amendements to the Aadhaar Act in 2019 which authorized use of Aadhaar by private parties, and these amendments have been challenged before the Supreme Court for violating the judgement in *K.S. Puttaswamy v. Union of India- Aadhaar 5J.* The cummulative impact of the Aadhaar Amendment Act 2019 and the Aadhaar Good Governance Rules 2020 is that there remain virtually no limitations on the use of Aadhaar authentication, which had earlier been restricted by the Supreme Court to only government entities and only for receipt of benefits and subsidies funded by the Consolidated Fund of India. ### Background The Aadhaar project, which is a biometrics based national unique ID programme, was challenged before the Supreme Court of India in *K.S. Puttaswamy v. Union of India* in 2012 for violating individual privacy and causing exclusion. The subsequent litigation led to the question of whether the right to privacy is a fundamental right under the Indian Constitution being referred to a nine judge bench of the Supreme Court. In *K.S. Puttaswamy v. Union of India- Privacy 9J (2017 10 SCC 1)*, this nine judge bench unanimously held the privacy is a fundamental right and any restrictions upon this right must satisfy the proportionality standard. The constitutionality of the Aadhaar Act, 2016 was specifically addressed by a five judge bench of the Supreme Court in its subsequent judgement in *K.S. Puttaswamy v. Union of India- Aadhaar 5J (2019 1 SCC 1),* where the majority of judges upheld the constitutionality of the Act subject to certain limitations. Most importantly, the Supreme Court held that under Section 7 of the Aadhaar Act, an Aadhaar number cannot be mandated unless it involves seeking any subsidy, benefit or service for which the expenditure is incurred by the Consolidated Fund of India. The Court also struck down Section 57 of the Aadhaar Act to the extent it allowed use of Aadhaar authentication by private parties since it would lead to commercial exploitation of biometric and demographic information. Despite the Supreme Court finding that use of Aadhaar authentication by private parties is a dispropotionate invasion of privacy, the government soon proposed [**amendments**](https://uidai.gov.in/images/news/Amendment_Act_2019.pdf) to the Aadhaar Act which would allow private parties to continue using Aadhaar to establish the identity of their users. Through the Aadhaar and Other Laws (Amendment) Act 2019, private entities were allowed to perform authentication through Aadhaar, if the Unique Identification Authority of India (UIDAI) is satisfied that it is: (i) compliant with certain standards of privacy and security, or (ii) permitted by law, or (iii) seeking authentication for a purpose specified by the central government in the interest of the State. The constitutionality of these amendments has been [**challenged**](https://indianexpress.com/article/india/sc-to-examine-validity-of-amended-law-allowing-private-firms-to-use-aadhaar-data-6132402/) before the Supreme Court. Legal experts have also [**explained**](https://thewire.in/law/in-striking-down-section-57-sc-has-curtailed-the-function-creep-and-financial-future-of-aadhaar) that Aadhaar authentication by private parties is inconsistent with the judgement in *K.S. Puttaswamy v. Union of India- Aadhaar 5J* since *\"the majority upholds the Aadhaar Act on the premise that authentication is proportional only when used for state purposes to deliver services socio-economic benefits that are linked to human dignity\"* and *\"this analogy does not extend to private/commercial interests.\"* ### The Aadhaar Good Governance Rules, 2020 The Aadhaar Authentication for Good Governance (Social Welfare, Innovation, Knowledge) Rules, 2020 were [**notified**](https://uidai.gov.in//images/Aadhaar_Authentication_for_Good_Governance_Rules_2020.pdf) by the central government in August 2020. The Rules allow Aadhaar authentication by *“requesting entities”* in the *“interest of good governance, preventing leakage of public funds, promoting ease of living of residents and enabling better access to services for them”* for the enlisted purposes of: (a) usage of digital platforms to ensure good governance; (b) prevention of dissipation of social welfare benefits; and (c) enablement of innovation and the spread of knowledge. As per the rules, the authentication of Aadhaar by these requesting entities shall be on a voluntary basis but past experience raises serious concerns about Aadhaar being voluntary only on paper, and not in practice. Under the Rules, the relevant ministry or the department of the central government or the state government is required to prepare a proposal with a justification for the purpose for which it is seeking Aadhaar authentication. This proposal submitted to the Central Government will then be referred to UIDAI, and if UIDAI is satisfied that the proposal fulfills the enlisted purposes, the requesting entity shall be allowed to ask for Aadhaar authentication. The application form and the guidelines for submission of a proposal under the Rules mandate that the proposal should contain a *“brief description of the initiative or scheme highlighting the benefit that would accrue from its implementation”.* It further states that such benefits should be relatable to the specified purposes, for example, “*by facilitating participation, accountability, transparency, responsiveness, efficiency, effectiveness, equity, inclusion etc. which reduce or eliminate transaction costs, or promote ease of living of residents or enable better access to services for them*.” It also requires that the justification of the purpose should be brought out clearly, and the proposal should explain the “*ecosystem and the processes involved in the achievement or delivery of the benefit.”* ### A Free for All Privacy Nightmare The purposes for requesting Aadhaar authentication under the Aadhaar Good Governance Rules, 2020 are extremely vague and broad, and any government service can potentially fall within their scope. There are no parameters laid down for the UIDAI to determine whether Aadhaar authentication is 'necessary,' especially since the purposes themselves are so ambiguously wide and pale in comparison to the seriousness of the fundamental right to privacy. Therefore, in the absence of strict guidelines, all and sundry purposes can be sought to be justified. For example, the first chairman of the UIDAI has already [**expressed**](https://www.hindustantimes.com/analysis/how-to-vaccinate-a-billion-people/story-9Tc4QzQpWNVGgSJQIBMfCP.html) his views on the benefits of Aadhaar authentication for distribution of COVID-19 vaccines. Allowing such authentication runs the risk of being directly in the teeth of the Supreme Court judgment in *K.S. Puttaswamy v. Union of India- Aadhaar 5J* wherein it was categorically held that Aadhaar enrolment can be mandated only for receipt of \"*any subsidy, benefit or service under the welfare scheme of the government expenditure whereof is to be met from the Consolidated Fund of India.\"* It should also be noted that when read together with the amendments to the Aadhaar Act in 2019, the Aadhaar Good Governance Rules 2020 create a risk of use of Aadhaar authentication by private parties for wide ranging purposes since Section 4(4) of the Aadhaar Act now allows any \"requesting entity\" to seek permission for Aadhaar authentication from UIDAI. Rule 3 of the Aadhaar Good Governance Rules requires proposals for Aadhaar authentication by requesting entities to be submitted by the government ministries or departments but there is no pre-condition that the requesting entity on whose behalf Aadhaar authentication is being sought should also be a government entity. The dependence on Aadhaar authentication to prevent dissipation of benefits has led to the [**exclusion**](https://www.washingtonpost.com/world/asia_pacific/indias-vast-biometric-program-was-supposed-to-end-corruption-but-the-neediest-may-be-hit-hardest/2018/03/24/bb212a86-289c-11e8-a227-fd2b009466bc_story.html) of many people who are the rightful beneficiaries of these entitlements, and such exclusion is counterproductive if the goal is improving access to government services. A study conducted by the [**Abdul Latif Jameel Poverty Action Lab** ](https://www.nber.org/papers/w26744)in Jharkhand found that at least 88% of the ration cards that were cancelled, were in fact genuine claims. There have also been [**several instances**](https://www.epw.in/engage/article/aadhaar-failures-food-services-welfare) of people facing practical difficulties in getting Aadhaar numbers and accessing welfare schemes because of lack of awareness, lack of infrastructure, immobility due to illness etc. From the very inception of Aadhaar, the government has claimed that its biometric authentication technology helps prevent identity fraud and ensures that benefits only go to the deserving. However, as economists have pointed out, there is [**no reliable evidence**](https://indianexpress.com/article/opinion/columns/uidai-aadhaar-card-the-real-beneficiary-4684994/)backing claims of widespread identity fraud and Aadhaar's ability to plug these leakages. Further, an RTI query revealed that 99.97 percent of people who enrolled for an Aadhaar number did it on the basis of existing identification documents, so lack of identification documents is clearly not the main cause of exclusion from welfare programmes. To conclude, as Rethink Aadhaar has incisively noted in this excellent [**post**](https://rethinkaadhaar.in/blog/2020/8/7/new-aadhaar-rules-for-good-governance-are-constitutionally-impermissible), the Aadhaar Good Governance Rules 2020 are just old wine in a new bottle. The purpose of subordinate legislation is to be more operationally specific, by clarifying ambiguities. However, the Rules come across as an attempt to sidestep the Supreme Court judgement in *K.S. Puttaswamy v. Union of India Aadhaar-5J* by expanding the scope of the Aadhaar project through the trappings of vague rules and guidelines. ### Important Documents 1. Aadhaar Good Governance Rules, 2020 ([**link**](https://uidai.gov.in//images/Aadhaar_Authentication_for_Good_Governance_Rules_2020.pdf)) 2. Aadhaar Amendment Act, 2019 ([**link**](https://uidai.gov.in/images/news/Amendment_Act_2019.pdf)) 3. Aadhaar Act, 2016 ([**link**](https://uidai.gov.in/images/the_aadhaar_act_2016.pdf))",
    "light_cleaned_comments": ""
}