{
    "id": "n3smqo",
    "title": "What can India learn from the USA's regulations on Facial Recognition Technology?",
    "url": "https://www.reddit.com/r/india/comments/n3smqo/what_can_india_learn_from_the_usas_regulations_on/",
    "selftext": "### tl;dr\n\nWhat can we learn about facial regulation from other countries? In this post, we will be exploring how use of facial recognition technology (FRT) has been regulated in the United States of America post 2020. We will specifically take a look at how political &amp; social movements have affected these attempts at regulating the technology. This is the first of a three part series which will take a look at how various jurisdictions around the world are responding to this technology.\n\n### FRT regulation in USA\n\nThe USA is a federal republic and thus, its citizens are subjected to regulations at the local, state and federal levels. The table below illustrates the different regulations in place currently at the city and state level. (Source of information: [**https://www.banfacialrecognition.com/map/**](https://www.banfacialrecognition.com/map/))\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lt7lom78svw61.png?width=5400&amp;format=png&amp;auto=webp&amp;s=9807f4f854b2bdb72f32e376e8cd8796d6138d94\n\nIn addition to these bans, ordinances, and regulations, several jurisdictions are in the process of enacting laws to regulate FRT. In the next section we will take a look at the various factors that have played a role in the regulation of this highly intrusive technology.\n\n### Highlights: Factors affecting the regulation of FRT in USA\n\nA. **Foundational analysis by a cross sections of experts &amp; activists**\n\nThe usage of FRT started receiving criticism from privacy and civil liberties organizations once it was determined that the use of this technology would lead to exclusionary and discriminatory outcomes. In 2016, the Georgetown Center for Privacy and Technology released a report titled, “[**The Perpetual Line-up: Unregulated Police Face Recognition In America**](https://www.perpetuallineup.org/)” which said that, among other issues, use of FRT by the police would disproportionately affect and be least accurate for African Americans.\n\nIn 2018, researchers [**Joy Buolamwini**](http://jovialjoy/) and [**Timnit Gebru**](http://timnitgebru/) in their paper titled, “[**Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification**](http://proceedings.mlr.press/v81/buolamwini18a/buolamwini18a.pdf)” found that facial recognition systems had higher error rates while identifying women and people of color, with the error rate being the highest while identifying women of color. (Visit the project website [**here**](http://gendershades.org/overview.html))\n\nOn July 26, 2018, the [**ACLU**](https://www.aclu.org/blog/privacy-technology/surveillance-technologies/amazons-face-recognition-falsely-matched-28) published the results from a test which found that Amazon’s facial recognition software “Rekognition” incorrectly matched 28 members of the US Congress with people who had been arrested for committing a crime. Of those members who were incorrectly matched, 40% were people of color which is a disproportionate number since people of color make up only 20% of the US Congress.\n\nOn June 3, 2019, the ACLU led over 60 privacy, civil liberties, civil rights, and investor and faith groups in urging the US Congress to put in place a [**federal moratorium**](https://www.aclu.org/letter/coalition-letter-calling-federal-moratorium-face-recognition) on FRT for law enforcement and immigration enforcement purposes until they fully debate what, if any, uses should be permitted. The coalition included, among others, organisations such as [**Fight for the Future**](https://www.fightforthefuture.org/projects), the [**Electronic Frontier Foundation**](https://www.eff.org/aboutface), the [**Algorithmic Justice League**](https://www.ajl.org/federal-office-call) and the [**Georgetown Center for Privacy and Technology**](https://www.law.georgetown.edu/privacy-technology-center/our-work/).\n\nAs a result of these actions as well as other research conducted independently, many cities across the USA started thinking about how to regulate FRT, specifically police use of FRT, leading to multiple bans across the country in pre-2020.\n\nB. **The Black Lives Matter Movement**\n\nThe Black Lives Matter Movement, which started in 2013, is a political and social movement which highlights racial inequities and demands racial justice specifically with regard to the disproportionate violence faced by African Americans at the hands of the police in the USA. The movement returned to global spotlight again on May 26, 2020 after protests broke out all over the USA against the murder of an African American man (George Floyd) at the hands of a White police officer.\n\nIt was during these protests that multiple [**reports**](https://www.theguardian.com/commentisfree/2020/jul/17/protest-black-lives-matter-database) of the use of FRT by the police against protesters started emerging. There was a massive public outcry with regard to how the excessive high-tech surveillance of African American [**activists and reporters**](https://www.theatlantic.com/technology/archive/2020/07/defund-facial-recognition/613771/) was driving police brutality. The protests led to heightened scrutiny into how this invasive surveillance technology is used not only to over-police and racially profile minorities but also to strip aways basic rights such as the freedom of speech and the right to protest. In response to this, companies such as [**IBM**](https://www.theverge.com/2020/6/8/21284683/ibm-no-longer-general-purpose-facial-recognition-analysis-software), [**Amazon**](https://www.aboutamazon.com/news/policy-news-views/we-are-implementing-a-one-year-moratorium-on-police-use-of-rekognition) and [**Microsoft**](https://www.washingtonpost.com/technology/2020/06/11/microsoft-facial-recognition/) announced that until federal laws are put in place, they will not be selling FRT to the police.\n\n&amp;#x200B;\n\nC. **January 6, 2021 Capitol Riot**\n\nThe positive changes brought about by the Black Lives Matter movement were however [**brought to naught**](https://www.latimes.com/business/technology/story/2021-02-04/facial-recognition-surveillance-capitol-riot-black-and-brown-communities) in the aftermath of the riots which took place at the US Capitol on January 6, 2021. Use of FRT by police and security agencies like the [**Federal Bureau of Investigation**](https://www.theverge.com/2021/4/21/22395323/fbi-facial-recognition-us-capital-riots-tracked-down-suspect) (FBI) was one of the foremost ways in which rioters who stormed the Capitol were being identified. This posed a complexity for regulation and is an ongoing process of policy debate as a federal level ban is considered.\n\n### Ongoing development of FRT regulation in USA\n\nDemands for a federal legislation on FRT have been increasing over the past two years. Multiple bills on FRT such as 2019’s [**Commercial Facial Recognition Privacy Act,**](https://www.congress.gov/bill/116th-congress/senate-bill/847) 2020’s [**Ethical Use Of Facial Recognition Act**](https://www.congress.gov/bill/116th-congress/senate-bill/3284/text), and [**Facial Recognition and Biometric Technology Act**](https://www.congress.gov/bill/116th-congress/senate-bill/4084/text) of 2020, were introduced but never moved forward. The [**George Floyd Justice In Policing Act**](https://www.congress.gov/bill/116th-congress/house-bill/7120/text) and [**Advancing Facial Recognition Act**](https://www.congress.gov/bill/116th-congress/house-bill/6929/text?r=1&amp;s=1) failed to be adopted.\n\nIn February, 2021, [**civil rights groups**](https://www.washingtonpost.com/technology/2021/02/17/facial-recognition-biden/?itid=lk_inline_manual_8) again wrote to the Government calling for a federal ban on the use of this technology. In April, 2021, US Sens. Ron Wyden and Rand Paul introduced a bipartisan bill titled the “[**Fourth Amendment Is Not for Sale Act**](https://www.theverge.com/2021/4/21/22395650/wyden-paul-fourth-amendment-is-not-for-sale-act-privacy-data-brokers-clearview-ai)” which would ban the U.S. government and law enforcement agencies from buying user data without a warrant. The Fourth Amendment of the US Constitution protects individuals from unreasonable searches and seizures. In *Katz v. United States*, 389 U.S. 347, 361 (1967), the United States Supreme Court established that the Fourth Amendment protects legitimate or reasonable expectations of privacy where:\n\n1. a person has exhibited an actual (subjective) expectation of privacy, and\n2. the expectation is one that society is prepared to recognize as “reasonable.”\n\nThe Bill is aimed specifically at the notorious Clearview AI which is [**infamous for illegally pulling images from social media and other websites such as Facebook, Google and Twitter**](https://www.washingtonpost.com/technology/2021/04/21/data-surveillance-bill/) for its technology.\n\nWe hope this analysis helps guide researchers, advocates and groups in India on the path forward for crafting a legal framework for FRT regulation in India that may include banning its deployment for specific purposes.\n\n### FRT regulation around the world\n\nUnder IFF’s Project Panoptic, we have called for a ban on government entities, police and other security/intelligence agencies using FRT. In this series, we will be taking a look at how our stance measures up against developments on FRT regulations around the world. For the second post in this series we will be focussing on Europe, so stay in touch with us and keep following [**Project Panoptic**](https://panoptic.in/).\n\n### Important documents\n\n1. Project Panoptic’s petition calling for a ban on government use of FRT ([**link**](https://panoptic.in/petition))\n2. IFF's Legal Notice to the NCRB on the Revised RFP for the National Automated Facial Recognition System dated July 15, 2020 ([**link**](https://panoptic.in/case-study/iffs-legal-notice-to-the-ncrb-on-the-revised-rfp-for-the-national-automated-facial-recognition-system))",
    "flair": "Policy/Economy",
    "score": 8,
    "num_comments": 0,
    "created_utc": 1620037077,
    "convurl": "https://b.thumbs.redditmedia.com/qwWhXc_qFNt4QfBXLJKSrJg2mmzSO9HMhVkW6vty-Nk.jpg",
    "comments": [],
    "cleaned_text": "india learn usas regulations facial recognition technology tldr learn facial regulation countries post exploring use facial recognition technology frt regulated united states america post specifically take look political amp social movements affected attempts regulating technology first three part series take look various jurisdictions around world responding technology frt regulation usa usa federal republic thus citizens subjected regulations local state federal levels table illustrates different regulations place currently city state level source information httpswwwbanfacialrecognitioncommaphttpswwwbanfacialrecognitioncommap ampxb addition bans ordinances regulations several jurisdictions process enacting laws regulate frt next section take look various factors played role regulation highly intrusive technology highlights factors affecting regulation frt usa foundational analysis cross sections experts amp activists usage frt started receiving criticism privacy civil liberties organizations determined use technology would lead exclusionary discriminatory outcomes georgetown center privacy technology released report titled perpetual lineup unregulated police face recognition americahttpswwwperpetuallineuporg said among issues use frt police would disproportionately affect least accurate african americans researchers joy buolamwinihttpjovialjoy timnit gebruhttptimnitgebru paper titled gender shades intersectional accuracy disparities commercial gender classificationhttpproceedingsmlrpressvbuolamwiniabuolamwiniapdf found facial recognition systems higher error rates identifying women people color error rate highest identifying women color visit project website herehttpgendershadesorgoverviewhtml july acluhttpswwwacluorgblogprivacytechnologysurveillancetechnologiesamazonsfacerecognitionfalselymatched published results test found amazons facial recognition software rekognition incorrectly matched members us congress people arrested committing crime members incorrectly matched people color disproportionate number since people color make us congress june aclu led privacy civil liberties civil rights investor faith groups urging us congress put place federal moratoriumhttpswwwacluorglettercoalitionlettercallingfederalmoratoriumfacerecognition frt law enforcement immigration enforcement purposes fully debate uses permitted coalition included among others organisations fight futurehttpswwwfightforthefutureorgprojects electronic frontier foundationhttpswwwefforgaboutface algorithmic justice leaguehttpswwwajlorgfederalofficecall georgetown center privacy technologyhttpswwwlawgeorgetowneduprivacytechnologycenterourwork result actions well research conducted independently many cities across usa started thinking regulate frt specifically police use frt leading multiple bans across country pre b black lives matter movement black lives matter movement started political social movement highlights racial inequities demands racial justice specifically regard disproportionate violence faced african americans hands police usa movement returned global spotlight may protests broke usa murder african american man george floyd hands white police officer protests multiple reportshttpswwwtheguardiancomcommentisfreejulprotestblacklivesmatterdatabase use frt police protesters started emerging massive public outcry regard excessive hightech surveillance african american activists reportershttpswwwtheatlanticcomtechnologyarchivedefundfacialrecognition driving police brutality protests led heightened scrutiny invasive surveillance technology used overpolice racially profile minorities also strip aways basic rights freedom speech right protest response companies ibmhttpswwwthevergecomibmnolongergeneralpurposefacialrecognitionanalysissoftware amazonhttpswwwaboutamazoncomnewspolicynewsviewsweareimplementingaoneyearmoratoriumonpoliceuseofrekognition microsofthttpswwwwashingtonpostcomtechnologymicrosoftfacialrecognition announced federal laws put place selling frt police ampxb c january capitol riot positive changes brought black lives matter movement however brought naughthttpswwwlatimescombusinesstechnologystoryfacialrecognitionsurveillancecapitolriotblackandbrowncommunities aftermath riots took place us capitol january use frt police security agencies like federal bureau investigationhttpswwwthevergecomfbifacialrecognitionuscapitalriotstrackeddownsuspect fbi one foremost ways rioters stormed capitol identified posed complexity regulation ongoing process policy debate federal level ban considered ongoing development frt regulation usa demands federal legislation frt increasing past two years multiple bills frt commercial facial recognition privacy acthttpswwwcongressgovbillthcongresssenatebill ethical use facial recognition acthttpswwwcongressgovbillthcongresssenatebilltext facial recognition biometric technology acthttpswwwcongressgovbillthcongresssenatebilltext introduced never moved forward george floyd justice policing acthttpswwwcongressgovbillthcongresshousebilltext advancing facial recognition acthttpswwwcongressgovbillthcongresshousebilltextramps failed adopted february civil rights groupshttpswwwwashingtonpostcomtechnologyfacialrecognitionbidenitidlkinlinemanual wrote government calling federal ban use technology april us sens ron wyden rand paul introduced bipartisan bill titled fourth amendment sale acthttpswwwthevergecomwydenpaulfourthamendmentisnotforsaleactprivacydatabrokersclearviewai would ban us government law enforcement agencies buying user data without warrant fourth amendment us constitution protects individuals unreasonable searches seizures katz v united states us united states supreme court established fourth amendment protects legitimate reasonable expectations privacy person exhibited actual subjective expectation privacy expectation one society prepared recognize reasonable bill aimed specifically notorious clearview ai infamous illegally pulling images social media websites facebook google twitterhttpswwwwashingtonpostcomtechnologydatasurveillancebill technology hope analysis helps guide researchers advocates groups india path forward crafting legal framework frt regulation india may include banning deployment specific purposes frt regulation around world iffs project panoptic called ban government entities police securityintelligence agencies using frt series taking look stance measures developments frt regulations around world second post series focussing europe stay touch us keep following project panoptichttpspanopticin important documents project panoptics petition calling ban government use frt linkhttpspanopticinpetition iffs legal notice ncrb revised rfp national automated facial recognition system dated july linkhttpspanopticincasestudyiffslegalnoticetothencrbontherevisedrfpforthenationalautomatedfacialrecognitionsystem ",
    "cleaned_title": "india learn usas regulations facial recognition technology",
    "cleaned_selftext": "tldr learn facial regulation countries post exploring use facial recognition technology frt regulated united states america post specifically take look political amp social movements affected attempts regulating technology first three part series take look various jurisdictions around world responding technology frt regulation usa usa federal republic thus citizens subjected regulations local state federal levels table illustrates different regulations place currently city state level source information httpswwwbanfacialrecognitioncommaphttpswwwbanfacialrecognitioncommap ampxb addition bans ordinances regulations several jurisdictions process enacting laws regulate frt next section take look various factors played role regulation highly intrusive technology highlights factors affecting regulation frt usa foundational analysis cross sections experts amp activists usage frt started receiving criticism privacy civil liberties organizations determined use technology would lead exclusionary discriminatory outcomes georgetown center privacy technology released report titled perpetual lineup unregulated police face recognition americahttpswwwperpetuallineuporg said among issues use frt police would disproportionately affect least accurate african americans researchers joy buolamwinihttpjovialjoy timnit gebruhttptimnitgebru paper titled gender shades intersectional accuracy disparities commercial gender classificationhttpproceedingsmlrpressvbuolamwiniabuolamwiniapdf found facial recognition systems higher error rates identifying women people color error rate highest identifying women color visit project website herehttpgendershadesorgoverviewhtml july acluhttpswwwacluorgblogprivacytechnologysurveillancetechnologiesamazonsfacerecognitionfalselymatched published results test found amazons facial recognition software rekognition incorrectly matched members us congress people arrested committing crime members incorrectly matched people color disproportionate number since people color make us congress june aclu led privacy civil liberties civil rights investor faith groups urging us congress put place federal moratoriumhttpswwwacluorglettercoalitionlettercallingfederalmoratoriumfacerecognition frt law enforcement immigration enforcement purposes fully debate uses permitted coalition included among others organisations fight futurehttpswwwfightforthefutureorgprojects electronic frontier foundationhttpswwwefforgaboutface algorithmic justice leaguehttpswwwajlorgfederalofficecall georgetown center privacy technologyhttpswwwlawgeorgetowneduprivacytechnologycenterourwork result actions well research conducted independently many cities across usa started thinking regulate frt specifically police use frt leading multiple bans across country pre b black lives matter movement black lives matter movement started political social movement highlights racial inequities demands racial justice specifically regard disproportionate violence faced african americans hands police usa movement returned global spotlight may protests broke usa murder african american man george floyd hands white police officer protests multiple reportshttpswwwtheguardiancomcommentisfreejulprotestblacklivesmatterdatabase use frt police protesters started emerging massive public outcry regard excessive hightech surveillance african american activists reportershttpswwwtheatlanticcomtechnologyarchivedefundfacialrecognition driving police brutality protests led heightened scrutiny invasive surveillance technology used overpolice racially profile minorities also strip aways basic rights freedom speech right protest response companies ibmhttpswwwthevergecomibmnolongergeneralpurposefacialrecognitionanalysissoftware amazonhttpswwwaboutamazoncomnewspolicynewsviewsweareimplementingaoneyearmoratoriumonpoliceuseofrekognition microsofthttpswwwwashingtonpostcomtechnologymicrosoftfacialrecognition announced federal laws put place selling frt police ampxb c january capitol riot positive changes brought black lives matter movement however brought naughthttpswwwlatimescombusinesstechnologystoryfacialrecognitionsurveillancecapitolriotblackandbrowncommunities aftermath riots took place us capitol january use frt police security agencies like federal bureau investigationhttpswwwthevergecomfbifacialrecognitionuscapitalriotstrackeddownsuspect fbi one foremost ways rioters stormed capitol identified posed complexity regulation ongoing process policy debate federal level ban considered ongoing development frt regulation usa demands federal legislation frt increasing past two years multiple bills frt commercial facial recognition privacy acthttpswwwcongressgovbillthcongresssenatebill ethical use facial recognition acthttpswwwcongressgovbillthcongresssenatebilltext facial recognition biometric technology acthttpswwwcongressgovbillthcongresssenatebilltext introduced never moved forward george floyd justice policing acthttpswwwcongressgovbillthcongresshousebilltext advancing facial recognition acthttpswwwcongressgovbillthcongresshousebilltextramps failed adopted february civil rights groupshttpswwwwashingtonpostcomtechnologyfacialrecognitionbidenitidlkinlinemanual wrote government calling federal ban use technology april us sens ron wyden rand paul introduced bipartisan bill titled fourth amendment sale acthttpswwwthevergecomwydenpaulfourthamendmentisnotforsaleactprivacydatabrokersclearviewai would ban us government law enforcement agencies buying user data without warrant fourth amendment us constitution protects individuals unreasonable searches seizures katz v united states us united states supreme court established fourth amendment protects legitimate reasonable expectations privacy person exhibited actual subjective expectation privacy expectation one society prepared recognize reasonable bill aimed specifically notorious clearview ai infamous illegally pulling images social media websites facebook google twitterhttpswwwwashingtonpostcomtechnologydatasurveillancebill technology hope analysis helps guide researchers advocates groups india path forward crafting legal framework frt regulation india may include banning deployment specific purposes frt regulation around world iffs project panoptic called ban government entities police securityintelligence agencies using frt series taking look stance measures developments frt regulations around world second post series focussing europe stay touch us keep following project panoptichttpspanopticin important documents project panoptics petition calling ban government use frt linkhttpspanopticinpetition iffs legal notice ncrb revised rfp national automated facial recognition system dated july linkhttpspanopticincasestudyiffslegalnoticetothencrbontherevisedrfpforthenationalautomatedfacialrecognitionsystem",
    "cleaned_comments": "",
    "light_cleaned_title": "What can India learn from the USA's regulations on Facial Recognition Technology?",
    "light_cleaned_selftext": "### tl;dr What can we learn about facial regulation from other countries? In this post, we will be exploring how use of facial recognition technology (FRT) has been regulated in the United States of America post 2020. We will specifically take a look at how political &amp; social movements have affected these attempts at regulating the technology. This is the first of a three part series which will take a look at how various jurisdictions around the world are responding to this technology. ### FRT regulation in USA The USA is a federal republic and thus, its citizens are subjected to regulations at the local, state and federal levels. The table below illustrates the different regulations in place currently at the city and state level. (Source of information: [**https://www.banfacialrecognition.com/map/**](https://www.banfacialrecognition.com/map/))  In addition to these bans, ordinances, and regulations, several jurisdictions are in the process of enacting laws to regulate FRT. In the next section we will take a look at the various factors that have played a role in the regulation of this highly intrusive technology. ### Highlights: Factors affecting the regulation of FRT in USA A. **Foundational analysis by a cross sections of experts &amp; activists** The usage of FRT started receiving criticism from privacy and civil liberties organizations once it was determined that the use of this technology would lead to exclusionary and discriminatory outcomes. In 2016, the Georgetown Center for Privacy and Technology released a report titled, “[**The Perpetual Line-up: Unregulated Police Face Recognition In America**](https://www.perpetuallineup.org/)” which said that, among other issues, use of FRT by the police would disproportionately affect and be least accurate for African Americans. In 2018, researchers [**Joy Buolamwini**](http://jovialjoy/) and [**Timnit Gebru**](http://timnitgebru/) in their paper titled, “[**Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification**](http://proceedings.mlr.press/v81/buolamwini18a/buolamwini18a.pdf)” found that facial recognition systems had higher error rates while identifying women and people of color, with the error rate being the highest while identifying women of color. (Visit the project website [**here**](http://gendershades.org/overview.html)) On July 26, 2018, the [**ACLU**](https://www.aclu.org/blog/privacy-technology/surveillance-technologies/amazons-face-recognition-falsely-matched-28) published the results from a test which found that Amazon’s facial recognition software “Rekognition” incorrectly matched 28 members of the US Congress with people who had been arrested for committing a crime. Of those members who were incorrectly matched, 40% were people of color which is a disproportionate number since people of color make up only 20% of the US Congress. On June 3, 2019, the ACLU led over 60 privacy, civil liberties, civil rights, and investor and faith groups in urging the US Congress to put in place a [**federal moratorium**](https://www.aclu.org/letter/coalition-letter-calling-federal-moratorium-face-recognition) on FRT for law enforcement and immigration enforcement purposes until they fully debate what, if any, uses should be permitted. The coalition included, among others, organisations such as [**Fight for the Future**](https://www.fightforthefuture.org/projects), the [**Electronic Frontier Foundation**](https://www.eff.org/aboutface), the [**Algorithmic Justice League**](https://www.ajl.org/federal-office-call) and the [**Georgetown Center for Privacy and Technology**](https://www.law.georgetown.edu/privacy-technology-center/our-work/). As a result of these actions as well as other research conducted independently, many cities across the USA started thinking about how to regulate FRT, specifically police use of FRT, leading to multiple bans across the country in pre-2020. B. **The Black Lives Matter Movement** The Black Lives Matter Movement, which started in 2013, is a political and social movement which highlights racial inequities and demands racial justice specifically with regard to the disproportionate violence faced by African Americans at the hands of the police in the USA. The movement returned to global spotlight again on May 26, 2020 after protests broke out all over the USA against the murder of an African American man (George Floyd) at the hands of a White police officer. It was during these protests that multiple [**reports**](https://www.theguardian.com/commentisfree/2020/jul/17/protest-black-lives-matter-database) of the use of FRT by the police against protesters started emerging. There was a massive public outcry with regard to how the excessive high-tech surveillance of African American [**activists and reporters**](https://www.theatlantic.com/technology/archive/2020/07/defund-facial-recognition/613771/) was driving police brutality. The protests led to heightened scrutiny into how this invasive surveillance technology is used not only to over-police and racially profile minorities but also to strip aways basic rights such as the freedom of speech and the right to protest. In response to this, companies such as [**IBM**](https://www.theverge.com/2020/6/8/21284683/ibm-no-longer-general-purpose-facial-recognition-analysis-software), [**Amazon**](https://www.aboutamazon.com/news/policy-news-views/we-are-implementing-a-one-year-moratorium-on-police-use-of-rekognition) and [**Microsoft**](https://www.washingtonpost.com/technology/2020/06/11/microsoft-facial-recognition/) announced that until federal laws are put in place, they will not be selling FRT to the police.  C. **January 6, 2021 Capitol Riot** The positive changes brought about by the Black Lives Matter movement were however [**brought to naught**](https://www.latimes.com/business/technology/story/2021-02-04/facial-recognition-surveillance-capitol-riot-black-and-brown-communities) in the aftermath of the riots which took place at the US Capitol on January 6, 2021. Use of FRT by police and security agencies like the [**Federal Bureau of Investigation**](https://www.theverge.com/2021/4/21/22395323/fbi-facial-recognition-us-capital-riots-tracked-down-suspect) (FBI) was one of the foremost ways in which rioters who stormed the Capitol were being identified. This posed a complexity for regulation and is an ongoing process of policy debate as a federal level ban is considered. ### Ongoing development of FRT regulation in USA Demands for a federal legislation on FRT have been increasing over the past two years. Multiple bills on FRT such as 2019’s [**Commercial Facial Recognition Privacy Act,**](https://www.congress.gov/bill/116th-congress/senate-bill/847) 2020’s [**Ethical Use Of Facial Recognition Act**](https://www.congress.gov/bill/116th-congress/senate-bill/3284/text), and [**Facial Recognition and Biometric Technology Act**](https://www.congress.gov/bill/116th-congress/senate-bill/4084/text) of 2020, were introduced but never moved forward. The [**George Floyd Justice In Policing Act**](https://www.congress.gov/bill/116th-congress/house-bill/7120/text) and [**Advancing Facial Recognition Act**](https://www.congress.gov/bill/116th-congress/house-bill/6929/text?r=1&amp;s=1) failed to be adopted. In February, 2021, [**civil rights groups**](https://www.washingtonpost.com/technology/2021/02/17/facial-recognition-biden/?itid=lk_inline_manual_8) again wrote to the Government calling for a federal ban on the use of this technology. In April, 2021, US Sens. Ron Wyden and Rand Paul introduced a bipartisan bill titled the “[**Fourth Amendment Is Not for Sale Act**](https://www.theverge.com/2021/4/21/22395650/wyden-paul-fourth-amendment-is-not-for-sale-act-privacy-data-brokers-clearview-ai)” which would ban the U.S. government and law enforcement agencies from buying user data without a warrant. The Fourth Amendment of the US Constitution protects individuals from unreasonable searches and seizures. In *Katz v. United States*, 389 U.S. 347, 361 (1967), the United States Supreme Court established that the Fourth Amendment protects legitimate or reasonable expectations of privacy where: 1. a person has exhibited an actual (subjective) expectation of privacy, and 2. the expectation is one that society is prepared to recognize as “reasonable.” The Bill is aimed specifically at the notorious Clearview AI which is [**infamous for illegally pulling images from social media and other websites such as Facebook, Google and Twitter**](https://www.washingtonpost.com/technology/2021/04/21/data-surveillance-bill/) for its technology. We hope this analysis helps guide researchers, advocates and groups in India on the path forward for crafting a legal framework for FRT regulation in India that may include banning its deployment for specific purposes. ### FRT regulation around the world Under IFF’s Project Panoptic, we have called for a ban on government entities, police and other security/intelligence agencies using FRT. In this series, we will be taking a look at how our stance measures up against developments on FRT regulations around the world. For the second post in this series we will be focussing on Europe, so stay in touch with us and keep following [**Project Panoptic**](https://panoptic.in/). ### Important documents 1. Project Panoptic’s petition calling for a ban on government use of FRT ([**link**](https://panoptic.in/petition)) 2. IFF's Legal Notice to the NCRB on the Revised RFP for the National Automated Facial Recognition System dated July 15, 2020 ([**link**](https://panoptic.in/case-study/iffs-legal-notice-to-the-ncrb-on-the-revised-rfp-for-the-national-automated-facial-recognition-system))",
    "light_cleaned_comments": ""
}