{
    "id": "fmrqeg",
    "title": "Level of public hospital facilities in Indian states relative to incomes and populations",
    "url": "https://www.reddit.com/r/india/comments/fmrqeg/level_of_public_hospital_facilities_in_indian/",
    "selftext": "Hey guys,\n\nI just compiled some open data on the amount of public healthcare facilities in Indian states, relative to the states' wealth and population.\n\nThe short report with some more details is at [the new website](http://datashri.com/indian_states_government_hospitals.html) but I am posting the important images below. Hope you like it.\n\n&amp;#x200B;\n\nThe correlation between state Net Domestic Product and the number of hospital beds, as well the correlation between state population and number of hospital beds is about 0.8 each. Furthermore, the correlation between the per capita income of the state and the number of hospital beds is about -0.2 - so, to a certain limited extent, states with more rich people have fewer public health facilities.\n\n&amp;#x200B;\n\n[hospital beds vs state population](https://preview.redd.it/0g05fkahr4o41.png?width=792&amp;format=png&amp;auto=webp&amp;s=2ab2ad081be0acba2f22e24847cd3b8d8cd9e9fd)\n\n[hospital beds vs state ndp](https://preview.redd.it/wjdarq06q4o41.png?width=792&amp;format=png&amp;auto=webp&amp;s=3e0f54aa414c2a6ba107432d1123b9aad2e55692)\n\n&amp;#x200B;\n\nUpdate: \n\n[hospital beds vs public health expense](https://preview.redd.it/n0bghbm8zfo41.png?width=793&amp;format=png&amp;auto=webp&amp;s=6ce09a8fe0f2deb41994156c71ad5d7dc6611c7b)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[ratio of public health expense to number of hospital beds](https://preview.redd.it/cvwnnr6bzfo41.png?width=793&amp;format=png&amp;auto=webp&amp;s=3bfc8be02cf31a797e49fc4e7961416d32b4f9c9)\n\n&amp;#x200B;\n\n&amp;#x200B;",
    "flair": "Policy/Economy",
    "score": 15,
    "num_comments": 9,
    "created_utc": 1584842120,
    "convurl": "https://a.thumbs.redditmedia.com/ngzsmCY4ptK87reCXoHw1b-4LVcgR97eI9wgXFqhl94.jpg",
    "comments": [
        "Good information brother.",
        "Thanks. If you have any other ideas or suggestions about topics to be analysed with data, please let me know.",
        "Could you source this?",
        "Yes, If you look at the linked website post, all the data sources are well referenced :-) Do check it out!",
        "Great work. Thanks for the data.",
        "Good job mate! Would be interesting if you can add a third bar representing health budget for each state. \n\nOr you can simply have a bar representating health budget per capita and do away with the population bar altogether.",
        "My pleasure. I just added a couple more charts based on the (very insightful) suggestion of u/arishsan",
        "You, are a very insightful person.\n\nI just added a new chart comparing health budget and number of hospital beds. Hope you like it! \n\nEdit: Indeed, the public health expense and number of beds have a correlation of 0.83.",
        "Superb work! thanks a lot!"
    ],
    "cleaned_text": "level public hospital facilities indian states relative incomes populations hey guys compiled open data amount public healthcare facilities indian states relative states wealth population short report details new websitehttpdatashricomindianstatesgovernmenthospitalshtml posting important images hope like ampxb correlation state net domestic product number hospital beds well correlation state population number hospital beds furthermore correlation per capita income state number hospital beds certain limited extent states rich people fewer public health facilities ampxb hospital beds vs state populationhttpspreviewredditgfkahropngwidthampformatpngampautowebpampsabadbeacbafecdbdcdefd hospital beds vs state ndphttpspreviewredditwjdarqqopngwidthampformatpngampautowebpampsefaacabadbaade ampxb update hospital beds vs public health expensehttpspreviewredditnbghbmzfopngwidthampformatpngampautowebpampsceafefdebcadddccb ampxb ampxb ratio public health expense number hospital bedshttpspreviewredditcvwnnrbzfopngwidthampformatpngampautowebpampsbfcbecfaefcedbfc ampxb ampxb ",
    "cleaned_title": "level public hospital facilities indian states relative incomes populations",
    "cleaned_selftext": "hey guys compiled open data amount public healthcare facilities indian states relative states wealth population short report details new websitehttpdatashricomindianstatesgovernmenthospitalshtml posting important images hope like ampxb correlation state net domestic product number hospital beds well correlation state population number hospital beds furthermore correlation per capita income state number hospital beds certain limited extent states rich people fewer public health facilities ampxb hospital beds vs state populationhttpspreviewredditgfkahropngwidthampformatpngampautowebpampsabadbeacbafecdbdcdefd hospital beds vs state ndphttpspreviewredditwjdarqqopngwidthampformatpngampautowebpampsefaacabadbaade ampxb update hospital beds vs public health expensehttpspreviewredditnbghbmzfopngwidthampformatpngampautowebpampsceafefdebcadddccb ampxb ampxb ratio public health expense number hospital bedshttpspreviewredditcvwnnrbzfopngwidthampformatpngampautowebpampsbfcbecfaefcedbfc ampxb ampxb",
    "cleaned_comments": "good information brother thanks ideas suggestions topics analysed data please let know could source yes look linked website post data sources well referenced check great work thanks data good job mate would interesting add third bar representing health budget state simply bar representating health budget per capita away population bar altogether pleasure added couple charts based insightful suggestion uarishsan insightful person added new chart comparing health budget number hospital beds hope like edit indeed public health expense number beds correlation superb work thanks lot",
    "light_cleaned_title": "Level of public hospital facilities in Indian states relative to incomes and populations",
    "light_cleaned_selftext": "Hey guys, I just compiled some open data on the amount of public healthcare facilities in Indian states, relative to the states' wealth and population. The short report with some more details is at [the new website](http://datashri.com/indian_states_government_hospitals.html) but I am posting the important images below. Hope you like it.  The correlation between state Net Domestic Product and the number of hospital beds, as well the correlation between state population and number of hospital beds is about 0.8 each. Furthermore, the correlation between the per capita income of the state and the number of hospital beds is about -0.2 - so, to a certain limited extent, states with more rich people have fewer public health facilities.  [hospital beds vs state population](https://preview.redd.it/0g05fkahr4o41.png?width=792&amp;format=png&amp;auto=webp&amp;s=2ab2ad081be0acba2f22e24847cd3b8d8cd9e9fd) [hospital beds vs state ndp](https://preview.redd.it/wjdarq06q4o41.png?width=792&amp;format=png&amp;auto=webp&amp;s=3e0f54aa414c2a6ba107432d1123b9aad2e55692)  Update: [hospital beds vs public health expense](https://preview.redd.it/n0bghbm8zfo41.png?width=793&amp;format=png&amp;auto=webp&amp;s=6ce09a8fe0f2deb41994156c71ad5d7dc6611c7b)   [ratio of public health expense to number of hospital beds](https://preview.redd.it/cvwnnr6bzfo41.png?width=793&amp;format=png&amp;auto=webp&amp;s=3bfc8be02cf31a797e49fc4e7961416d32b4f9c9)",
    "light_cleaned_comments": "Good information brother. Thanks. If you have any other ideas or suggestions about topics to be analysed with data, please let me know. Could you source this? Yes, If you look at the linked website post, all the data sources are well referenced :-) Do check it out! Great work. Thanks for the data. Good job mate! Would be interesting if you can add a third bar representing health budget for each state. Or you can simply have a bar representating health budget per capita and do away with the population bar altogether. My pleasure. I just added a couple more charts based on the (very insightful) suggestion of u/arishsan You, are a very insightful person. I just added a new chart comparing health budget and number of hospital beds. Hope you like it! Edit: Indeed, the public health expense and number of beds have a correlation of 0.83. Superb work! thanks a lot!"
}