{
    "id": "14t5htw",
    "title": "Hindutva Mob Assaults Principal Over Reciting 'Christian Prayer' in School | What We Know",
    "url": "https://youtu.be/eaHs1MS69K8",
    "selftext": "Recently saw a streak of attack on Christian schools, when I was a kid my parents used to tell me that the catholic schools students did better and somewhat felt the quality of education provided better than other schools.\n\nRecently seen a lot of Christian schools being attacked in the name of religion and have no clue what we are trying to achieve from all this chaos.\n\n While other countries are making sure all younger generation excel in studies and join the workforce asap, we are making sure the youth burn everything down and stay uneducated /jobless.",
    "flair": "Crime",
    "score": 13,
    "num_comments": 0,
    "created_utc": 1688731748.0,
    "convurl": "https://external-preview.redd.it/SIKEfdZgl7gJ9z0HzBI6YH_Xh-6tWGM_utg52juN7eo.jpg?auto=webp&s=1e88392a87fcf32ff0e8bbf88e7d8af44d433f65",
    "comments": [],
    "cleaned_text": "hindutva mob assaults principal reciting christian prayer school know recently saw streak attack christian schools kid parents used tell catholic schools students better somewhat felt quality education provided better schools recently seen lot christian schools attacked name religion clue trying achieve chaos countries making sure younger generation excel studies join workforce asap making sure youth burn everything stay uneducated jobless ",
    "cleaned_title": "hindutva mob assaults principal reciting christian prayer school know",
    "cleaned_selftext": "recently saw streak attack christian schools kid parents used tell catholic schools students better somewhat felt quality education provided better schools recently seen lot christian schools attacked name religion clue trying achieve chaos countries making sure younger generation excel studies join workforce asap making sure youth burn everything stay uneducated jobless",
    "cleaned_comments": "",
    "light_cleaned_title": "Hindutva Mob Assaults Principal Over Reciting 'Christian Prayer' in School | What We Know",
    "light_cleaned_selftext": "Recently saw a streak of attack on Christian schools, when I was a kid my parents used to tell me that the catholic schools students did better and somewhat felt the quality of education provided better than other schools. Recently seen a lot of Christian schools being attacked in the name of religion and have no clue what we are trying to achieve from all this chaos. While other countries are making sure all younger generation excel in studies and join the workforce asap, we are making sure the youth burn everything down and stay uneducated /jobless.",
    "light_cleaned_comments": ""
}