{
    "id": "1ceiipa",
    "title": "Help me give a Fight back",
    "url": "https://www.reddit.com/gallery/1ceiipa",
    "selftext": "I want to share this with everyone\n\nA policeman asked me for bribe for document verification after she got a job. It was during the week when my mother and sister had gone out for a function for seven days and I was the only family member present in the house along with my father, who requires constant support since he has dementia. Because of this situation, my mother in particular rarely ever goes to a function. So this policeman arrived at such a time where I was left with a choice whether to give my family a worry by opposing this act and affect their joy of being in a function or pay him money. Given the circumstances, when I saw how rare it is for my family to attend programs, I was forced into a situation where I had to. I am appalled with the conduct of services.\n\nWhile many of you may say that kharcha paani toh chalta hai, it is definitely not what you want to give even if you are habitual to it. Possibly you won't be able to do what you are doing even if that is legal if you didn't pay up, and as well, at the top, politicians want a cut to run their election campaigns. Yet, I don't feel at all that one should not do anything about it and looking for a way to act, I found this website where you can expose a national screenshot of bribery.\n\nI made stickers and covered several autos and battery rickshaws around Rohini Sec 18 and Rithala Metro to cover the area where I live. I request you to expose the bribery for a service you deserve for free here. If we manage to expose multiple true events, the chances of having an impact can increase drastically.\n\nI do not think that if we don't want it we should not fight\nI want to give a Fight if the future is worth fighting for.",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 2,
    "created_utc": 1714235264.0,
    "convurl": "https://i.redd.it/dqlq5c7jt1xc1.png",
    "comments": [
        "Thanks OP"
    ],
    "cleaned_text": "help give fight back want share everyone policeman asked bribe document verification got job week mother sister gone function seven days family member present house along father requires constant support since dementia situation mother particular rarely ever goes function policeman arrived time left choice whether give family worry opposing act affect joy function pay money given circumstances saw rare family attend programs forced situation appalled conduct services many may say kharcha paani toh chalta hai definitely want give even habitual possibly wont able even legal didnt pay well top politicians want cut run election campaigns yet dont feel one anything looking way act found website expose national screenshot bribery made stickers covered several autos battery rickshaws around rohini sec rithala metro cover area live request expose bribery service deserve free manage expose multiple true events chances impact increase drastically think dont want fight want give fight future worth fighting ",
    "cleaned_title": "help give fight back",
    "cleaned_selftext": "want share everyone policeman asked bribe document verification got job week mother sister gone function seven days family member present house along father requires constant support since dementia situation mother particular rarely ever goes function policeman arrived time left choice whether give family worry opposing act affect joy function pay money given circumstances saw rare family attend programs forced situation appalled conduct services many may say kharcha paani toh chalta hai definitely want give even habitual possibly wont able even legal didnt pay well top politicians want cut run election campaigns yet dont feel one anything looking way act found website expose national screenshot bribery made stickers covered several autos battery rickshaws around rohini sec rithala metro cover area live request expose bribery service deserve free manage expose multiple true events chances impact increase drastically think dont want fight want give fight future worth fighting",
    "cleaned_comments": "thanks op",
    "light_cleaned_title": "Help me give a Fight back",
    "light_cleaned_selftext": "I want to share this with everyone A policeman asked me for bribe for document verification after she got a job. It was during the week when my mother and sister had gone out for a function for seven days and I was the only family member present in the house along with my father, who requires constant support since he has dementia. Because of this situation, my mother in particular rarely ever goes to a function. So this policeman arrived at such a time where I was left with a choice whether to give my family a worry by opposing this act and affect their joy of being in a function or pay him money. Given the circumstances, when I saw how rare it is for my family to attend programs, I was forced into a situation where I had to. I am appalled with the conduct of services. While many of you may say that kharcha paani toh chalta hai, it is definitely not what you want to give even if you are habitual to it. Possibly you won't be able to do what you are doing even if that is legal if you didn't pay up, and as well, at the top, politicians want a cut to run their election campaigns. Yet, I don't feel at all that one should not do anything about it and looking for a way to act, I found this website where you can expose a national screenshot of bribery. I made stickers and covered several autos and battery rickshaws around Rohini Sec 18 and Rithala Metro to cover the area where I live. I request you to expose the bribery for a service you deserve for free here. If we manage to expose multiple true events, the chances of having an impact can increase drastically. I do not think that if we don't want it we should not fight I want to give a Fight if the future is worth fighting for.",
    "light_cleaned_comments": "Thanks OP"
}