{
    "id": "mgbb92",
    "title": "Facebook has a new Human Rights Policy which will be applicable to all Indian Facebook, WhatsApp, and Instagram users",
    "url": "https://www.reddit.com/r/india/comments/mgbb92/facebook_has_a_new_human_rights_policy_which_will/",
    "selftext": "### \n\nhttps://preview.redd.it/l9nt01dwm4q61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=7b7bb7df595c6695c786bb8f62c4324979e8c137\n\n### Tl;dr\n\nFacebook Inc.’s largest user base is in India because of which it wields immense power in our daily lives. On an objective analysis of it’s recently announced Human Rights Policy we cautiously note positive measures such as support for end-to-end encryption but also provide a larger criticism. It is too little, too late and much remains to be operationalised. Moreover, Facebook Inc. continues to apply [**discriminatory standards for human rights enforcement**](https://internetfreedom.in/we-demand-scrutiny-on-fb/) in the United States and India and the concerns we raised remain unaddressed. For these reasons we call on it to improve it’s practices, openly and transparently for Indian users of its platforms including Whatsapp and Instagram.\n\n### Background\n\nOn March 16, 2021, Facebook unveiled its [**Human Rights Policy**](https://about.fb.com/wp-content/uploads/2021/03/Facebooks-Corporate-Human-Rights-Policy.pdf) which is applicable throughout the world and is relevant for India. The policy for the first time states Facebook’s commitment to [**the United Nations Guiding Principles on Businesses and Human Rights**](https://www.ohchr.org/Documents/Publications/GuidingPrinciplesBusinessHR_EN.pdf) (UNGPs) in one central repository, applying it to all its products, in all the geographies of its operation. This is done by cataloguing its various policies, guidelines, principles and practices in one place. We believe that social media corporations such as Facebook, which perform a public function, should be held accountable, and we welcome the policy as a statement of intent but Facebook Inc.’s practices in India have been contradictory to human rights standards for a fairly long time.\n\n### What is a Human Rights Policy?\n\nSilicon valley corporations like Facebook impact individual rights on a daily basis in a highly networked and digital world. This is why UNGPs calls upon such ‘business enterprises’ to maintain a minimum standard of human rights across jurisdictions. A number of Silicon Valley-based entities and members of ‘Big Tech’ also have such policies in place (for example [**Apple**](https://s2.q4cdn.com/470004039/files/doc_downloads/gov_docs/Apple-Human-Rights-Policy.pdf), [**Google**](https://about.google/human-rights/), [**Microsoft**](https://www.microsoft.com/en-us/corporate-responsibility/human-rights-statement?activetab=pivot_1:primaryr7) and [**Amazon**](https://sustainability.aboutamazon.com/people/human-rights/principles)).\n\nDespite its market leadership, Facebook has been a laggard and has belatedly developed and published a human rights policy. This delay is inexcusable given documented cases of harmful social impacts due to Facebook’s conduct in jurisdictions such as India. For context, the [**2020 RDR Index**](https://rankingdigitalrights.org/index2020) released by Ranking Digital Rights, evaluated 26 most powerful digital platforms and telecommunications companies on their practices affecting freedom of speech and expression and the right to privacy. The index scored Facebook 45/100 and pointed out that Facebook was yet to publish ‘*a commitment to adhere to human rights principles’.*\n\n### What does Facebook’s Human Right Policy state?\n\nFacebook has compiled its myriad policies, guidelines and practices in one place. They state that their respect for human rights is applied through their [**Community Standards**](https://www.facebook.com/communitystandards/), their membership in the [**Global Network Initiative**](https://globalnetworkinitiative.org/), [**the Responsible Supply Chain Program**](https://sustainability.fb.com/collaboration-for-good/supply-chain/), [**Privacy Principles**](https://www.facebook.com/about/basics/privacy-principles), Data Policy, [**Law Enforcement Guidelines**](https://www.facebook.com/safety/groups/law/guidelines/), [**Transparency Reporting**](https://transparency.facebook.com/), [**Responsible AI efforts**](https://ai.facebook.com/blog/collaborating-on-the-future-of-ai-governance-in-the-eu-and-around-the-world/) and [**Diversity and Inclusion Practices**](https://diversity.fb.com/).\n\nThis policy formalises these commitments and that is indeed a welcome step. However, it is a step that is short in substance and remains to be fulfilled in practice especially for jurisdictions such as India. As we reason below there is a dissonance between the promises made by Facebook Inc. and the obligations it has to fulfill them. Others have critiqued Facebook’s policy [**here**](http://opiniojuris.org/2021/03/25/on-facebooks-commitment-to-human-rights-and-the-right-to-a-remedy-for-the-rohingya/) and [**here**](https://www.accessnow.org/facebook-human-rights-policy/).\n\n**What issues emerge from Facebook’s Human Right Policy**\n\n1. **Nothing new:** The policies Facebook has compiled are dated. Moreover, these policies have a number of [**issues**](https://www.newamerica.org/oti/reports/its-not-just-content-its-business-model/) that remain unaddressed. For example, Facebook does not necessarily comply with the [**Santa Clara Principles**](https://santaclaraprinciples.org/open-letter/) when enforcing its community standards. These principles require Facebook to issue a notice to a user whose content is removed and provide them with a meaningful chance to appeal the removal. Similarly, transparency reporting by Facebook is obscure as has been highlighted [**here**](https://www.adl.org/blog/facebooks-transparency-reporting-continues-to-obscure-the-scope-and-impact-of-hate-speech). Facebook also does not continuously report internet disruptions. As per Facebook’s [**transparency reporting**](https://transparency.facebook.com/internet-disruptions) page, the last internet disruption in India was on 28th June 2020. A [**number of internet shutdowns**](https://internetshutdowns.in/) orders have been issued after that including ones that [**shutdown internet in Delhi**](https://www.accessnow.org/internet-shutdown-in-delhi-on-indias-republic-day/) on Republic Day.\n2. **Only one obligation:** Facebook has imposed upon itself a mandate to “*report* ***annually*** *on how we’re addressing human rights impacts, including relevant insights arising from human rights due diligence, and the actions we are taking in response.”* Facebook has not specified the particulars of these annual reports; particularly, it remains to be seen whether Facebook discloses information adverse to it. Crucially, Ranking Digital Rights has [**reprimanded**](https://rankingdigitalrights.org/index2020/companies/Facebook) Facebook on how it conducts human rights due diligence and questioned whether Facebook ‘*conducts systematic impact assessments of its terms of service enforcement, on its targeted advertising policies and practices, on its development and deployment of algorithmic systems, or on its zero rating programs.*’ Remember Facebook advocated for Facebook Zero or the Free Basics programme in India that was defeated by advocacy spurred by the [**SaveTheInternet.in movement**](https://internetfreedom.in/let-us-celebrate-the/).\n3. **The policy does not provide for a rights audit in India:** To address these concerns Facebook could have volunteered for an independent civil rights audit across jurisdictions. Facebook has previously volunteered for an independent [**civil rights audit**](https://about.fb.com/wp-content/uploads/2020/07/Civil-Rights-Audit-Final-Report.pdf) after being pressured by US Congress and civil rights organisations. The audit examined Facebook’s efforts to protect human rights on its platforms, evaluated whether Facebook complies with its own policies and provided its recommendations. Similar audits ought to be conducted in other parts of the world and separate reports published. These audits are particularly important for India, where Facebook continues to exercise immense powers, operates in an opaque manner and has been [**criticized**](https://www.wsj.com/articles/facebook-hate-speech-india-politics-muslim-hindu-modi-zuckerberg-11597423346?mod=searchresults&amp;page=1&amp;pos=2) for its actions. However, there is zero public acknowledgement or transparency by Facebook Inc. in India of any such audit.\n4. **UNGPs are insufficient for Facebook:** Facebook has based the policy on the UNGPs. This is a curious choice because Facebook has immense power (by their own admission). In a [**paper**](https://digitalcommons.law.yale.edu/cgi/viewcontent.cgi?article=1004&amp;context=jregonline) titled, ‘*But Facebook’s not a country: How to interpret Human Rights Law for social media companies’,* Ms Susan Benesch (Executive Director of the Dangerous Speech Project, Berkman Klein Centre for Internet &amp; Society, Harvard University) has argued that Facebook should be held to higher standards as “*social media companies have human-rights impacts of great magnitude on at least half of the world’s population. They can limit not only what people say (or write) but what they see and read. When exercised in public spaces, such powers are reserved for governments.This extraordinary, transnational power and influence sets the companies apart from any other private enterprise. When platforms are used for exchanging information that is vital for civic life, the owners and staff of the platforms influence the political, cultural, and economic development of entire societies*”. Apart from this, UNGPs have faced criticism, especially since they [**focus on process rather than on outcomes**](https://digitalcommons.law.yale.edu/cgi/viewcontent.cgi?article=1004&amp;context=jregonline). The Human Rights Watch has [**questioned UNGPs**](https://www.hrw.org/sites/default/files/related_material/business.pdf) for their low standards of accountability. [**Others**](https://www.yalejreg.com/bulletin/applying-international-human-rights-law-for-use-by-facebook/) have called upon organisations such as Facebook to instead adopt instruments under International Human Rights Law, such as the International Covenant on Civil and Political Rights, which contains a framework for imposing restrictions upon the freedom of expression.\n5. **Vagueness:** Facebook has stated that ‘*human rights defenders are a high risk user group’* and has pointed out that it conducts due diligence to identify risks and ‘*create strategies to avoid, prevent and mitigate them*’. However, the policy does not reveal anything more. We do not know how Facebook protects human rights defenders on its platforms or the methodology Facebook uses to conduct due diligence.\n\n### How does the policy impact its largest, global user base?\n\nIndia is Facebook’s largest market. In Mark Zuckerberg’s own words, \"*India is a very special and important country for us… \\[a\\]nd in fact, we actually test some of our new features here first, before rolling them out globally*\". The policy is relevant for Indians because:\n\n1. **Facebook has committed to protecting your privacy on WhatsApp:** Facebook has stated that it will not “*provide governments with direct access or “back doors” to people’s information, and we would challenge any order that sought to have us redesign our systems to undermine the encryption we provide to protect people’s data.”* Rule 4(2) of the Information Technology (Guidelines for Intermediaries and Digital Media Ethics Code) Rules, 2021 requires ‘significant social media intermediaries’ such as WhatsApp to enable tracing of the originator of information on their platform if required by the government. This may affect end-to-end encryption and the right to privacy of all Indians. Considering this far-reaching impact, Facebook’s commitment is a welcome development. We unhesitatingly support end to end encryption and any company that implements it to keep Indians safe, secure and their personal data private.\n2. **The policy impacts Indian users' freedom of speech and expression:** The policy reiterates Facebook’s commitment to its community standards. These standards outline what kind of content is permissible on Facebook. The policy also affirms Facebook’s recognition of the Oversight Board, which recently issued its [**first round of rulings**](https://www.theverge.com/2021/1/28/22254155/facebook-oversight-board-first-rulings-coronavirus-misinformation-hate-speech). Despite the policy and the development of the Oversight Board, Facebook continues to be opaque on how it moderates content at the first instance. As [**pointed out**](https://rankingdigitalrights.org/index2020/companies/Facebook) by Ranking Digital Rights - ‘*Facebook should significantly improve its transparency on and accountability for its content moderation by publishing consistent data on actions it takes to enforce platform rules.*’ A conversation around this policy will ensure that Facebook undertakes such obligations.\n3. **Relevant for Indian start-ups:** While Silicon Valley led the developments in information technology over the past decade, Indian startups have started to [**establish themselves**](https://www.ventureintelligence.com/Indian-Unicorn-Tracker.php) in this field and as the number of users on these Indian platforms grows, they ought to provide for such a policy as they build for more Indians and potentially even the world. Not only is this ethical, but it also makes sense from a business perspective. One of the reasons people are [**sceptical**](https://www.theverge.com/2020/3/2/21144680/verge-tech-survey-2020-trust-privacy-security-facebook-amazon-google-apple) of silicon-valley based Big Tech companies is because they ignored the impact their products have on society and in the process undermined user trust. In this regard, Indian start-ups can differentiate themselves and build user trust from the beginning by providing effective human rights policies. We urge that their policies not only pay lip-service to the UNGPs but should provide a detailed explanation, make product choices, engineering decisions and implement them in practice.\n\n### Why it is necessary to critically evaluate Facebook Inc.\n\nLet us consider the facts. Facebook’s track record in India speaks for itself.\n\n* **In 2016**, Facebook introduced the [**Free Basics program**](https://www.theguardian.com/technology/2016/may/12/facebook-free-basics-india-zuckerberg) in India to collect vast amounts of data which violated net-neutrality by charging discriminatory tariffs for data services on the basis of content. Facebook withdrew its plans only after efforts by advocacy groups culminated in a [**ruling**](https://www.prsindia.org/theprsblog/examining-urban-local-governance-india-through-case-bengaluru) by the Telecom Regulatory Authority of India.\n* **In 2020**, Facebook failed to respond to hate speech on its platform against Muslims which often preceded acts of mob-violence. An article in the Wall Street Journal [**reported**](https://www.wsj.com/articles/facebook-hate-speech-india-politics-muslim-hindu-modi-zuckerberg-11597423346) that Facebook’s top public policy executive decided to not enforce hate-speech rules against members of the ruling party. On this issue, we have [**written**](https://internetfreedom.in/we-demand-scrutiny-on-fb/) to the Parliamentary Committee on Information Technology requesting them to summon Facebook executives, hold a hearing and direct Facebook to repatriate victims.\n* **Also in 2020**, Facebook’s ‘automated systems’ blocked an account named ‘Kisan Ekta Morcha’ which documented the protests against farm laws on social media.\n* **In 2021**, Facebook is involved in a [**legal dispute**](https://www.livelaw.in/top-stories/supreme-court-facebook-india-vice-president-ajit-mohan-delhi-assemblysummons-delhi-riots-170346) with the Delhi Legislative Assembly. Facebook had refused to appear before the Peace and Harmony Committee of the Delhi Assembly which had summoned Vice President of Facebook India to inquire into the Delhi Riots of 2020. As Rahul Narayan puts it this case has, “it unwittingly provoked a litigation that may have far-reaching implications on Federalism, the Separation of Powers and Fundamental Rights in India. ([**link**](https://indconlawphil.wordpress.com/2021/03/10/guest-post-legislative-privilege-and-competence-facebook-and-the-union-of-india-vs-the-delhi-assembly/))”. We agree with him that this litigation poses a huge risk to democratic processes and the rights of legislative bodies to demand accountability from large silicon valley corporations.\n\nThese are just some events that make us determined to match stated commitments with practiced actions.\n\n**Important Links**\n\n* Our blogpost highlighting Facebook’s discriminatory standards for human rights enforcement in the United States and India ([**link**](https://internetfreedom.in/we-demand-scrutiny-on-fb/))\n* Representation to Parliamentary Standing Committee on IT regarding the WSJ Story on Facebook India dated August 17, 2020 [**(link)**](https://drive.google.com/file/d/1xb10VWRZVKnEcUaQ90E11VbFmSJeR1qw/view)\n* Ranking Digital Rights 2020 RDR Index ([**link**](https://rankingdigitalrights.org/index2020/))",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1617093258,
    "convurl": "https://b.thumbs.redditmedia.com/fRPHReoQCX7P9-CjfC-_auQsHRvj1IEm6hdML4pONaY.jpg",
    "comments": [],
    "cleaned_text": "facebook new human rights policy applicable indian facebook whatsapp instagram users tldr facebook incs largest user base india wields immense power daily lives objective analysis recently announced human rights policy cautiously note positive measures support endtoend encryption also provide larger criticism little late much remains operationalised moreover facebook inc continues apply discriminatory standards human rights enforcementhttpsinternetfreedominwedemandscrutinyonfb united states india concerns raised remain unaddressed reasons call improve practices openly transparently indian users platforms including whatsapp instagram background march facebook unveiled human rights policyhttpsaboutfbcomwpcontentuploadsfacebookscorporatehumanrightspolicypdf applicable throughout world relevant india policy first time states facebooks commitment united nations guiding principles businesses human rightshttpswwwohchrorgdocumentspublicationsguidingprinciplesbusinesshrenpdf ungps one central repository applying products geographies operation done cataloguing various policies guidelines principles practices one place believe social media corporations facebook perform public function held accountable welcome policy statement intent facebook incs practices india contradictory human rights standards fairly long time human rights policy silicon valley corporations like facebook impact individual rights daily basis highly networked digital world ungps calls upon business enterprises maintain minimum standard human rights across jurisdictions number silicon valleybased entities members big tech also policies place example applehttpssqcdncomfilesdocdownloadsgovdocsapplehumanrightspolicypdf googlehttpsaboutgooglehumanrights microsofthttpswwwmicrosoftcomenuscorporateresponsibilityhumanrightsstatementactivetabpivotprimaryr amazonhttpssustainabilityaboutamazoncompeoplehumanrightsprinciples despite market leadership facebook laggard belatedly developed published human rights policy delay inexcusable given documented cases harmful social impacts due facebooks conduct jurisdictions india context rdr indexhttpsrankingdigitalrightsorgindex released ranking digital rights evaluated powerful digital platforms telecommunications companies practices affecting freedom speech expression right privacy index scored facebook pointed facebook yet publish commitment adhere human rights principles facebooks human right policy state facebook compiled myriad policies guidelines practices one place state respect human rights applied community standardshttpswwwfacebookcomcommunitystandards membership global network initiativehttpsglobalnetworkinitiativeorg responsible supply chain programhttpssustainabilityfbcomcollaborationforgoodsupplychain privacy principleshttpswwwfacebookcomaboutbasicsprivacyprinciples data policy law enforcement guidelineshttpswwwfacebookcomsafetygroupslawguidelines transparency reportinghttpstransparencyfacebookcom responsible ai effortshttpsaifacebookcomblogcollaboratingonthefutureofaigovernanceintheeuandaroundtheworld diversity inclusion practiceshttpsdiversityfbcom policy formalises commitments indeed welcome step however step short substance remains fulfilled practice especially jurisdictions india reason dissonance promises made facebook inc obligations fulfill others critiqued facebooks policy herehttpopiniojurisorgonfacebookscommitmenttohumanrightsandtherighttoaremedyfortherohingya herehttpswwwaccessnoworgfacebookhumanrightspolicy issues emerge facebooks human right policy nothing new policies facebook compiled dated moreover policies number issueshttpswwwnewamericaorgotireportsitsnotjustcontentitsbusinessmodel remain unaddressed example facebook necessarily comply santa clara principleshttpssantaclaraprinciplesorgopenletter enforcing community standards principles require facebook issue notice user whose content removed provide meaningful chance appeal removal similarly transparency reporting facebook obscure highlighted herehttpswwwadlorgblogfacebookstransparencyreportingcontinuestoobscurethescopeandimpactofhatespeech facebook also continuously report internet disruptions per facebooks transparency reportinghttpstransparencyfacebookcominternetdisruptions page last internet disruption india th june number internet shutdownshttpsinternetshutdownsin orders issued including ones shutdown internet delhihttpswwwaccessnoworginternetshutdownindelhionindiasrepublicday republic day one obligation facebook imposed upon mandate report annually addressing human rights impacts including relevant insights arising human rights due diligence actions taking response facebook specified particulars annual reports particularly remains seen whether facebook discloses information adverse crucially ranking digital rights reprimandedhttpsrankingdigitalrightsorgindexcompaniesfacebook facebook conducts human rights due diligence questioned whether facebook conducts systematic impact assessments terms service enforcement targeted advertising policies practices development deployment algorithmic systems zero rating programs remember facebook advocated facebook zero free basics programme india defeated advocacy spurred savetheinternetin movementhttpsinternetfreedominletuscelebratethe policy provide rights audit india address concerns facebook could volunteered independent civil rights audit across jurisdictions facebook previously volunteered independent civil rights audithttpsaboutfbcomwpcontentuploadscivilrightsauditfinalreportpdf pressured us congress civil rights organisations audit examined facebooks efforts protect human rights platforms evaluated whether facebook complies policies provided recommendations similar audits ought conducted parts world separate reports published audits particularly important india facebook continues exercise immense powers operates opaque manner criticizedhttpswwwwsjcomarticlesfacebookhatespeechindiapoliticsmuslimhindumodizuckerbergmodsearchresultsamppageamppos actions however zero public acknowledgement transparency facebook inc india audit ungps insufficient facebook facebook based policy ungps curious choice facebook immense power admission paperhttpsdigitalcommonslawyaleeducgiviewcontentcgiarticleampcontextjregonline titled facebooks country interpret human rights law social media companies ms susan benesch executive director dangerous speech project berkman klein centre internet amp society harvard university argued facebook held higher standards social media companies humanrights impacts great magnitude least half worlds population limit people say write see read exercised public spaces powers reserved governmentsthis extraordinary transnational power influence sets companies apart private enterprise platforms used exchanging information vital civic life owners staff platforms influence political cultural economic development entire societies apart ungps faced criticism especially since focus process rather outcomeshttpsdigitalcommonslawyaleeducgiviewcontentcgiarticleampcontextjregonline human rights watch questioned ungpshttpswwwhrworgsitesdefaultfilesrelatedmaterialbusinesspdf low standards accountability othershttpswwwyalejregcombulletinapplyinginternationalhumanrightslawforusebyfacebook called upon organisations facebook instead adopt instruments international human rights law international covenant civil political rights contains framework imposing restrictions upon freedom expression vagueness facebook stated human rights defenders high risk user group pointed conducts due diligence identify risks create strategies avoid prevent mitigate however policy reveal anything know facebook protects human rights defenders platforms methodology facebook uses conduct due diligence policy impact largest global user base india facebooks largest market mark zuckerbergs words india special important country us fact actually test new features first rolling globally policy relevant indians facebook committed protecting privacy whatsapp facebook stated provide governments direct access back doors peoples information would challenge order sought us redesign systems undermine encryption provide protect peoples data rule information technology guidelines intermediaries digital media ethics code rules requires significant social media intermediaries whatsapp enable tracing originator information platform required government may affect endtoend encryption right privacy indians considering farreaching impact facebooks commitment welcome development unhesitatingly support end end encryption company implements keep indians safe secure personal data private policy impacts indian users freedom speech expression policy reiterates facebooks commitment community standards standards outline kind content permissible facebook policy also affirms facebooks recognition oversight board recently issued first round rulingshttpswwwthevergecomfacebookoversightboardfirstrulingscoronavirusmisinformationhatespeech despite policy development oversight board facebook continues opaque moderates content first instance pointed outhttpsrankingdigitalrightsorgindexcompaniesfacebook ranking digital rights facebook significantly improve transparency accountability content moderation publishing consistent data actions takes enforce platform rules conversation around policy ensure facebook undertakes obligations relevant indian startups silicon valley led developments information technology past decade indian startups started establish themselveshttpswwwventureintelligencecomindianunicorntrackerphp field number users indian platforms grows ought provide policy build indians potentially even world ethical also makes sense business perspective one reasons people scepticalhttpswwwthevergecomvergetechsurveytrustprivacysecurityfacebookamazongoogleapple siliconvalley based big tech companies ignored impact products society process undermined user trust regard indian startups differentiate build user trust beginning providing effective human rights policies urge policies pay lipservice ungps provide detailed explanation make product choices engineering decisions implement practice necessary critically evaluate facebook inc let us consider facts facebooks track record india speaks facebook introduced free basics programhttpswwwtheguardiancomtechnologymayfacebookfreebasicsindiazuckerberg india collect vast amounts data violated netneutrality charging discriminatory tariffs data services basis content facebook withdrew plans efforts advocacy groups culminated rulinghttpswwwprsindiaorgtheprsblogexaminingurbanlocalgovernanceindiathroughcasebengaluru telecom regulatory authority india facebook failed respond hate speech platform muslims often preceded acts mobviolence article wall street journal reportedhttpswwwwsjcomarticlesfacebookhatespeechindiapoliticsmuslimhindumodizuckerberg facebooks top public policy executive decided enforce hatespeech rules members ruling party issue writtenhttpsinternetfreedominwedemandscrutinyonfb parliamentary committee information technology requesting summon facebook executives hold hearing direct facebook repatriate victims also facebooks automated systems blocked account named kisan ekta morcha documented protests farm laws social media facebook involved legal disputehttpswwwlivelawintopstoriessupremecourtfacebookindiavicepresidentajitmohandelhiassemblysummonsdelhiriots delhi legislative assembly facebook refused appear peace harmony committee delhi assembly summoned vice president facebook india inquire delhi riots rahul narayan puts case unwittingly provoked litigation may farreaching implications federalism separation powers fundamental rights india linkhttpsindconlawphilwordpresscomguestpostlegislativeprivilegeandcompetencefacebookandtheunionofindiavsthedelhiassembly agree litigation poses huge risk democratic processes rights legislative bodies demand accountability large silicon valley corporations events make us determined match stated commitments practiced actions important links blogpost highlighting facebooks discriminatory standards human rights enforcement united states india linkhttpsinternetfreedominwedemandscrutinyonfb representation parliamentary standing committee regarding wsj story facebook india dated august linkhttpsdrivegooglecomfiledxbvwrzvknecuaqevbfmsjerqwview ranking digital rights rdr index linkhttpsrankingdigitalrightsorgindex ",
    "cleaned_title": "facebook new human rights policy applicable indian facebook whatsapp instagram users",
    "cleaned_selftext": "tldr facebook incs largest user base india wields immense power daily lives objective analysis recently announced human rights policy cautiously note positive measures support endtoend encryption also provide larger criticism little late much remains operationalised moreover facebook inc continues apply discriminatory standards human rights enforcementhttpsinternetfreedominwedemandscrutinyonfb united states india concerns raised remain unaddressed reasons call improve practices openly transparently indian users platforms including whatsapp instagram background march facebook unveiled human rights policyhttpsaboutfbcomwpcontentuploadsfacebookscorporatehumanrightspolicypdf applicable throughout world relevant india policy first time states facebooks commitment united nations guiding principles businesses human rightshttpswwwohchrorgdocumentspublicationsguidingprinciplesbusinesshrenpdf ungps one central repository applying products geographies operation done cataloguing various policies guidelines principles practices one place believe social media corporations facebook perform public function held accountable welcome policy statement intent facebook incs practices india contradictory human rights standards fairly long time human rights policy silicon valley corporations like facebook impact individual rights daily basis highly networked digital world ungps calls upon business enterprises maintain minimum standard human rights across jurisdictions number silicon valleybased entities members big tech also policies place example applehttpssqcdncomfilesdocdownloadsgovdocsapplehumanrightspolicypdf googlehttpsaboutgooglehumanrights microsofthttpswwwmicrosoftcomenuscorporateresponsibilityhumanrightsstatementactivetabpivotprimaryr amazonhttpssustainabilityaboutamazoncompeoplehumanrightsprinciples despite market leadership facebook laggard belatedly developed published human rights policy delay inexcusable given documented cases harmful social impacts due facebooks conduct jurisdictions india context rdr indexhttpsrankingdigitalrightsorgindex released ranking digital rights evaluated powerful digital platforms telecommunications companies practices affecting freedom speech expression right privacy index scored facebook pointed facebook yet publish commitment adhere human rights principles facebooks human right policy state facebook compiled myriad policies guidelines practices one place state respect human rights applied community standardshttpswwwfacebookcomcommunitystandards membership global network initiativehttpsglobalnetworkinitiativeorg responsible supply chain programhttpssustainabilityfbcomcollaborationforgoodsupplychain privacy principleshttpswwwfacebookcomaboutbasicsprivacyprinciples data policy law enforcement guidelineshttpswwwfacebookcomsafetygroupslawguidelines transparency reportinghttpstransparencyfacebookcom responsible ai effortshttpsaifacebookcomblogcollaboratingonthefutureofaigovernanceintheeuandaroundtheworld diversity inclusion practiceshttpsdiversityfbcom policy formalises commitments indeed welcome step however step short substance remains fulfilled practice especially jurisdictions india reason dissonance promises made facebook inc obligations fulfill others critiqued facebooks policy herehttpopiniojurisorgonfacebookscommitmenttohumanrightsandtherighttoaremedyfortherohingya herehttpswwwaccessnoworgfacebookhumanrightspolicy issues emerge facebooks human right policy nothing new policies facebook compiled dated moreover policies number issueshttpswwwnewamericaorgotireportsitsnotjustcontentitsbusinessmodel remain unaddressed example facebook necessarily comply santa clara principleshttpssantaclaraprinciplesorgopenletter enforcing community standards principles require facebook issue notice user whose content removed provide meaningful chance appeal removal similarly transparency reporting facebook obscure highlighted herehttpswwwadlorgblogfacebookstransparencyreportingcontinuestoobscurethescopeandimpactofhatespeech facebook also continuously report internet disruptions per facebooks transparency reportinghttpstransparencyfacebookcominternetdisruptions page last internet disruption india th june number internet shutdownshttpsinternetshutdownsin orders issued including ones shutdown internet delhihttpswwwaccessnoworginternetshutdownindelhionindiasrepublicday republic day one obligation facebook imposed upon mandate report annually addressing human rights impacts including relevant insights arising human rights due diligence actions taking response facebook specified particulars annual reports particularly remains seen whether facebook discloses information adverse crucially ranking digital rights reprimandedhttpsrankingdigitalrightsorgindexcompaniesfacebook facebook conducts human rights due diligence questioned whether facebook conducts systematic impact assessments terms service enforcement targeted advertising policies practices development deployment algorithmic systems zero rating programs remember facebook advocated facebook zero free basics programme india defeated advocacy spurred savetheinternetin movementhttpsinternetfreedominletuscelebratethe policy provide rights audit india address concerns facebook could volunteered independent civil rights audit across jurisdictions facebook previously volunteered independent civil rights audithttpsaboutfbcomwpcontentuploadscivilrightsauditfinalreportpdf pressured us congress civil rights organisations audit examined facebooks efforts protect human rights platforms evaluated whether facebook complies policies provided recommendations similar audits ought conducted parts world separate reports published audits particularly important india facebook continues exercise immense powers operates opaque manner criticizedhttpswwwwsjcomarticlesfacebookhatespeechindiapoliticsmuslimhindumodizuckerbergmodsearchresultsamppageamppos actions however zero public acknowledgement transparency facebook inc india audit ungps insufficient facebook facebook based policy ungps curious choice facebook immense power admission paperhttpsdigitalcommonslawyaleeducgiviewcontentcgiarticleampcontextjregonline titled facebooks country interpret human rights law social media companies ms susan benesch executive director dangerous speech project berkman klein centre internet amp society harvard university argued facebook held higher standards social media companies humanrights impacts great magnitude least half worlds population limit people say write see read exercised public spaces powers reserved governmentsthis extraordinary transnational power influence sets companies apart private enterprise platforms used exchanging information vital civic life owners staff platforms influence political cultural economic development entire societies apart ungps faced criticism especially since focus process rather outcomeshttpsdigitalcommonslawyaleeducgiviewcontentcgiarticleampcontextjregonline human rights watch questioned ungpshttpswwwhrworgsitesdefaultfilesrelatedmaterialbusinesspdf low standards accountability othershttpswwwyalejregcombulletinapplyinginternationalhumanrightslawforusebyfacebook called upon organisations facebook instead adopt instruments international human rights law international covenant civil political rights contains framework imposing restrictions upon freedom expression vagueness facebook stated human rights defenders high risk user group pointed conducts due diligence identify risks create strategies avoid prevent mitigate however policy reveal anything know facebook protects human rights defenders platforms methodology facebook uses conduct due diligence policy impact largest global user base india facebooks largest market mark zuckerbergs words india special important country us fact actually test new features first rolling globally policy relevant indians facebook committed protecting privacy whatsapp facebook stated provide governments direct access back doors peoples information would challenge order sought us redesign systems undermine encryption provide protect peoples data rule information technology guidelines intermediaries digital media ethics code rules requires significant social media intermediaries whatsapp enable tracing originator information platform required government may affect endtoend encryption right privacy indians considering farreaching impact facebooks commitment welcome development unhesitatingly support end end encryption company implements keep indians safe secure personal data private policy impacts indian users freedom speech expression policy reiterates facebooks commitment community standards standards outline kind content permissible facebook policy also affirms facebooks recognition oversight board recently issued first round rulingshttpswwwthevergecomfacebookoversightboardfirstrulingscoronavirusmisinformationhatespeech despite policy development oversight board facebook continues opaque moderates content first instance pointed outhttpsrankingdigitalrightsorgindexcompaniesfacebook ranking digital rights facebook significantly improve transparency accountability content moderation publishing consistent data actions takes enforce platform rules conversation around policy ensure facebook undertakes obligations relevant indian startups silicon valley led developments information technology past decade indian startups started establish themselveshttpswwwventureintelligencecomindianunicorntrackerphp field number users indian platforms grows ought provide policy build indians potentially even world ethical also makes sense business perspective one reasons people scepticalhttpswwwthevergecomvergetechsurveytrustprivacysecurityfacebookamazongoogleapple siliconvalley based big tech companies ignored impact products society process undermined user trust regard indian startups differentiate build user trust beginning providing effective human rights policies urge policies pay lipservice ungps provide detailed explanation make product choices engineering decisions implement practice necessary critically evaluate facebook inc let us consider facts facebooks track record india speaks facebook introduced free basics programhttpswwwtheguardiancomtechnologymayfacebookfreebasicsindiazuckerberg india collect vast amounts data violated netneutrality charging discriminatory tariffs data services basis content facebook withdrew plans efforts advocacy groups culminated rulinghttpswwwprsindiaorgtheprsblogexaminingurbanlocalgovernanceindiathroughcasebengaluru telecom regulatory authority india facebook failed respond hate speech platform muslims often preceded acts mobviolence article wall street journal reportedhttpswwwwsjcomarticlesfacebookhatespeechindiapoliticsmuslimhindumodizuckerberg facebooks top public policy executive decided enforce hatespeech rules members ruling party issue writtenhttpsinternetfreedominwedemandscrutinyonfb parliamentary committee information technology requesting summon facebook executives hold hearing direct facebook repatriate victims also facebooks automated systems blocked account named kisan ekta morcha documented protests farm laws social media facebook involved legal disputehttpswwwlivelawintopstoriessupremecourtfacebookindiavicepresidentajitmohandelhiassemblysummonsdelhiriots delhi legislative assembly facebook refused appear peace harmony committee delhi assembly summoned vice president facebook india inquire delhi riots rahul narayan puts case unwittingly provoked litigation may farreaching implications federalism separation powers fundamental rights india linkhttpsindconlawphilwordpresscomguestpostlegislativeprivilegeandcompetencefacebookandtheunionofindiavsthedelhiassembly agree litigation poses huge risk democratic processes rights legislative bodies demand accountability large silicon valley corporations events make us determined match stated commitments practiced actions important links blogpost highlighting facebooks discriminatory standards human rights enforcement united states india linkhttpsinternetfreedominwedemandscrutinyonfb representation parliamentary standing committee regarding wsj story facebook india dated august linkhttpsdrivegooglecomfiledxbvwrzvknecuaqevbfmsjerqwview ranking digital rights rdr index linkhttpsrankingdigitalrightsorgindex",
    "cleaned_comments": "",
    "light_cleaned_title": "Facebook has a new Human Rights Policy which will be applicable to all Indian Facebook, WhatsApp, and Instagram users",
    "light_cleaned_selftext": "### ### Tl;dr Facebook Inc.’s largest user base is in India because of which it wields immense power in our daily lives. On an objective analysis of it’s recently announced Human Rights Policy we cautiously note positive measures such as support for end-to-end encryption but also provide a larger criticism. It is too little, too late and much remains to be operationalised. Moreover, Facebook Inc. continues to apply [**discriminatory standards for human rights enforcement**](https://internetfreedom.in/we-demand-scrutiny-on-fb/) in the United States and India and the concerns we raised remain unaddressed. For these reasons we call on it to improve it’s practices, openly and transparently for Indian users of its platforms including Whatsapp and Instagram. ### Background On March 16, 2021, Facebook unveiled its [**Human Rights Policy**](https://about.fb.com/wp-content/uploads/2021/03/Facebooks-Corporate-Human-Rights-Policy.pdf) which is applicable throughout the world and is relevant for India. The policy for the first time states Facebook’s commitment to [**the United Nations Guiding Principles on Businesses and Human Rights**](https://www.ohchr.org/Documents/Publications/GuidingPrinciplesBusinessHR_EN.pdf) (UNGPs) in one central repository, applying it to all its products, in all the geographies of its operation. This is done by cataloguing its various policies, guidelines, principles and practices in one place. We believe that social media corporations such as Facebook, which perform a public function, should be held accountable, and we welcome the policy as a statement of intent but Facebook Inc.’s practices in India have been contradictory to human rights standards for a fairly long time. ### What is a Human Rights Policy? Silicon valley corporations like Facebook impact individual rights on a daily basis in a highly networked and digital world. This is why UNGPs calls upon such ‘business enterprises’ to maintain a minimum standard of human rights across jurisdictions. A number of Silicon Valley-based entities and members of ‘Big Tech’ also have such policies in place (for example [**Apple**](https://s2.q4cdn.com/470004039/files/doc_downloads/gov_docs/Apple-Human-Rights-Policy.pdf), [**Google**](https://about.google/human-rights/), [**Microsoft**](https://www.microsoft.com/en-us/corporate-responsibility/human-rights-statement?activetab=pivot_1:primaryr7) and [**Amazon**](https://sustainability.aboutamazon.com/people/human-rights/principles)). Despite its market leadership, Facebook has been a laggard and has belatedly developed and published a human rights policy. This delay is inexcusable given documented cases of harmful social impacts due to Facebook’s conduct in jurisdictions such as India. For context, the [**2020 RDR Index**](https://rankingdigitalrights.org/index2020) released by Ranking Digital Rights, evaluated 26 most powerful digital platforms and telecommunications companies on their practices affecting freedom of speech and expression and the right to privacy. The index scored Facebook 45/100 and pointed out that Facebook was yet to publish ‘*a commitment to adhere to human rights principles’.* ### What does Facebook’s Human Right Policy state? Facebook has compiled its myriad policies, guidelines and practices in one place. They state that their respect for human rights is applied through their [**Community Standards**](https://www.facebook.com/communitystandards/), their membership in the [**Global Network Initiative**](https://globalnetworkinitiative.org/), [**the Responsible Supply Chain Program**](https://sustainability.fb.com/collaboration-for-good/supply-chain/), [**Privacy Principles**](https://www.facebook.com/about/basics/privacy-principles), Data Policy, [**Law Enforcement Guidelines**](https://www.facebook.com/safety/groups/law/guidelines/), [**Transparency Reporting**](https://transparency.facebook.com/), [**Responsible AI efforts**](https://ai.facebook.com/blog/collaborating-on-the-future-of-ai-governance-in-the-eu-and-around-the-world/) and [**Diversity and Inclusion Practices**](https://diversity.fb.com/). This policy formalises these commitments and that is indeed a welcome step. However, it is a step that is short in substance and remains to be fulfilled in practice especially for jurisdictions such as India. As we reason below there is a dissonance between the promises made by Facebook Inc. and the obligations it has to fulfill them. Others have critiqued Facebook’s policy [**here**](http://opiniojuris.org/2021/03/25/on-facebooks-commitment-to-human-rights-and-the-right-to-a-remedy-for-the-rohingya/) and [**here**](https://www.accessnow.org/facebook-human-rights-policy/). **What issues emerge from Facebook’s Human Right Policy** 1. **Nothing new:** The policies Facebook has compiled are dated. Moreover, these policies have a number of [**issues**](https://www.newamerica.org/oti/reports/its-not-just-content-its-business-model/) that remain unaddressed. For example, Facebook does not necessarily comply with the [**Santa Clara Principles**](https://santaclaraprinciples.org/open-letter/) when enforcing its community standards. These principles require Facebook to issue a notice to a user whose content is removed and provide them with a meaningful chance to appeal the removal. Similarly, transparency reporting by Facebook is obscure as has been highlighted [**here**](https://www.adl.org/blog/facebooks-transparency-reporting-continues-to-obscure-the-scope-and-impact-of-hate-speech). Facebook also does not continuously report internet disruptions. As per Facebook’s [**transparency reporting**](https://transparency.facebook.com/internet-disruptions) page, the last internet disruption in India was on 28th June 2020. A [**number of internet shutdowns**](https://internetshutdowns.in/) orders have been issued after that including ones that [**shutdown internet in Delhi**](https://www.accessnow.org/internet-shutdown-in-delhi-on-indias-republic-day/) on Republic Day. 2. **Only one obligation:** Facebook has imposed upon itself a mandate to “*report* ***annually*** *on how we’re addressing human rights impacts, including relevant insights arising from human rights due diligence, and the actions we are taking in response.”* Facebook has not specified the particulars of these annual reports; particularly, it remains to be seen whether Facebook discloses information adverse to it. Crucially, Ranking Digital Rights has [**reprimanded**](https://rankingdigitalrights.org/index2020/companies/Facebook) Facebook on how it conducts human rights due diligence and questioned whether Facebook ‘*conducts systematic impact assessments of its terms of service enforcement, on its targeted advertising policies and practices, on its development and deployment of algorithmic systems, or on its zero rating programs.*’ Remember Facebook advocated for Facebook Zero or the Free Basics programme in India that was defeated by advocacy spurred by the [**SaveTheInternet.in movement**](https://internetfreedom.in/let-us-celebrate-the/). 3. **The policy does not provide for a rights audit in India:** To address these concerns Facebook could have volunteered for an independent civil rights audit across jurisdictions. Facebook has previously volunteered for an independent [**civil rights audit**](https://about.fb.com/wp-content/uploads/2020/07/Civil-Rights-Audit-Final-Report.pdf) after being pressured by US Congress and civil rights organisations. The audit examined Facebook’s efforts to protect human rights on its platforms, evaluated whether Facebook complies with its own policies and provided its recommendations. Similar audits ought to be conducted in other parts of the world and separate reports published. These audits are particularly important for India, where Facebook continues to exercise immense powers, operates in an opaque manner and has been [**criticized**](https://www.wsj.com/articles/facebook-hate-speech-india-politics-muslim-hindu-modi-zuckerberg-11597423346?mod=searchresults&amp;page=1&amp;pos=2) for its actions. However, there is zero public acknowledgement or transparency by Facebook Inc. in India of any such audit. 4. **UNGPs are insufficient for Facebook:** Facebook has based the policy on the UNGPs. This is a curious choice because Facebook has immense power (by their own admission). In a [**paper**](https://digitalcommons.law.yale.edu/cgi/viewcontent.cgi?article=1004&amp;context=jregonline) titled, ‘*But Facebook’s not a country: How to interpret Human Rights Law for social media companies’,* Ms Susan Benesch (Executive Director of the Dangerous Speech Project, Berkman Klein Centre for Internet &amp; Society, Harvard University) has argued that Facebook should be held to higher standards as “*social media companies have human-rights impacts of great magnitude on at least half of the world’s population. They can limit not only what people say (or write) but what they see and read. When exercised in public spaces, such powers are reserved for governments.This extraordinary, transnational power and influence sets the companies apart from any other private enterprise. When platforms are used for exchanging information that is vital for civic life, the owners and staff of the platforms influence the political, cultural, and economic development of entire societies*”. Apart from this, UNGPs have faced criticism, especially since they [**focus on process rather than on outcomes**](https://digitalcommons.law.yale.edu/cgi/viewcontent.cgi?article=1004&amp;context=jregonline). The Human Rights Watch has [**questioned UNGPs**](https://www.hrw.org/sites/default/files/related_material/business.pdf) for their low standards of accountability. [**Others**](https://www.yalejreg.com/bulletin/applying-international-human-rights-law-for-use-by-facebook/) have called upon organisations such as Facebook to instead adopt instruments under International Human Rights Law, such as the International Covenant on Civil and Political Rights, which contains a framework for imposing restrictions upon the freedom of expression. 5. **Vagueness:** Facebook has stated that ‘*human rights defenders are a high risk user group’* and has pointed out that it conducts due diligence to identify risks and ‘*create strategies to avoid, prevent and mitigate them*’. However, the policy does not reveal anything more. We do not know how Facebook protects human rights defenders on its platforms or the methodology Facebook uses to conduct due diligence. ### How does the policy impact its largest, global user base? India is Facebook’s largest market. In Mark Zuckerberg’s own words, \"*India is a very special and important country for us… \\[a\\]nd in fact, we actually test some of our new features here first, before rolling them out globally*\". The policy is relevant for Indians because: 1. **Facebook has committed to protecting your privacy on WhatsApp:** Facebook has stated that it will not “*provide governments with direct access or “back doors” to people’s information, and we would challenge any order that sought to have us redesign our systems to undermine the encryption we provide to protect people’s data.”* Rule 4(2) of the Information Technology (Guidelines for Intermediaries and Digital Media Ethics Code) Rules, 2021 requires ‘significant social media intermediaries’ such as WhatsApp to enable tracing of the originator of information on their platform if required by the government. This may affect end-to-end encryption and the right to privacy of all Indians. Considering this far-reaching impact, Facebook’s commitment is a welcome development. We unhesitatingly support end to end encryption and any company that implements it to keep Indians safe, secure and their personal data private. 2. **The policy impacts Indian users' freedom of speech and expression:** The policy reiterates Facebook’s commitment to its community standards. These standards outline what kind of content is permissible on Facebook. The policy also affirms Facebook’s recognition of the Oversight Board, which recently issued its [**first round of rulings**](https://www.theverge.com/2021/1/28/22254155/facebook-oversight-board-first-rulings-coronavirus-misinformation-hate-speech). Despite the policy and the development of the Oversight Board, Facebook continues to be opaque on how it moderates content at the first instance. As [**pointed out**](https://rankingdigitalrights.org/index2020/companies/Facebook) by Ranking Digital Rights - ‘*Facebook should significantly improve its transparency on and accountability for its content moderation by publishing consistent data on actions it takes to enforce platform rules.*’ A conversation around this policy will ensure that Facebook undertakes such obligations. 3. **Relevant for Indian start-ups:** While Silicon Valley led the developments in information technology over the past decade, Indian startups have started to [**establish themselves**](https://www.ventureintelligence.com/Indian-Unicorn-Tracker.php) in this field and as the number of users on these Indian platforms grows, they ought to provide for such a policy as they build for more Indians and potentially even the world. Not only is this ethical, but it also makes sense from a business perspective. One of the reasons people are [**sceptical**](https://www.theverge.com/2020/3/2/21144680/verge-tech-survey-2020-trust-privacy-security-facebook-amazon-google-apple) of silicon-valley based Big Tech companies is because they ignored the impact their products have on society and in the process undermined user trust. In this regard, Indian start-ups can differentiate themselves and build user trust from the beginning by providing effective human rights policies. We urge that their policies not only pay lip-service to the UNGPs but should provide a detailed explanation, make product choices, engineering decisions and implement them in practice. ### Why it is necessary to critically evaluate Facebook Inc. Let us consider the facts. Facebook’s track record in India speaks for itself. * **In 2016**, Facebook introduced the [**Free Basics program**](https://www.theguardian.com/technology/2016/may/12/facebook-free-basics-india-zuckerberg) in India to collect vast amounts of data which violated net-neutrality by charging discriminatory tariffs for data services on the basis of content. Facebook withdrew its plans only after efforts by advocacy groups culminated in a [**ruling**](https://www.prsindia.org/theprsblog/examining-urban-local-governance-india-through-case-bengaluru) by the Telecom Regulatory Authority of India. * **In 2020**, Facebook failed to respond to hate speech on its platform against Muslims which often preceded acts of mob-violence. An article in the Wall Street Journal [**reported**](https://www.wsj.com/articles/facebook-hate-speech-india-politics-muslim-hindu-modi-zuckerberg-11597423346) that Facebook’s top public policy executive decided to not enforce hate-speech rules against members of the ruling party. On this issue, we have [**written**](https://internetfreedom.in/we-demand-scrutiny-on-fb/) to the Parliamentary Committee on Information Technology requesting them to summon Facebook executives, hold a hearing and direct Facebook to repatriate victims. * **Also in 2020**, Facebook’s ‘automated systems’ blocked an account named ‘Kisan Ekta Morcha’ which documented the protests against farm laws on social media. * **In 2021**, Facebook is involved in a [**legal dispute**](https://www.livelaw.in/top-stories/supreme-court-facebook-india-vice-president-ajit-mohan-delhi-assemblysummons-delhi-riots-170346) with the Delhi Legislative Assembly. Facebook had refused to appear before the Peace and Harmony Committee of the Delhi Assembly which had summoned Vice President of Facebook India to inquire into the Delhi Riots of 2020. As Rahul Narayan puts it this case has, “it unwittingly provoked a litigation that may have far-reaching implications on Federalism, the Separation of Powers and Fundamental Rights in India. ([**link**](https://indconlawphil.wordpress.com/2021/03/10/guest-post-legislative-privilege-and-competence-facebook-and-the-union-of-india-vs-the-delhi-assembly/))”. We agree with him that this litigation poses a huge risk to democratic processes and the rights of legislative bodies to demand accountability from large silicon valley corporations. These are just some events that make us determined to match stated commitments with practiced actions. **Important Links** * Our blogpost highlighting Facebook’s discriminatory standards for human rights enforcement in the United States and India ([**link**](https://internetfreedom.in/we-demand-scrutiny-on-fb/)) * Representation to Parliamentary Standing Committee on IT regarding the WSJ Story on Facebook India dated August 17, 2020 [**(link)**](https://drive.google.com/file/d/1xb10VWRZVKnEcUaQ90E11VbFmSJeR1qw/view) * Ranking Digital Rights 2020 RDR Index ([**link**](https://rankingdigitalrights.org/index2020/))",
    "light_cleaned_comments": ""
}