{
    "id": "1azz67b",
    "title": "No, 13 lakh women were not reported missing in India between 2019-2021",
    "url": "https://www.logicallyfacts.com/en/fact-check/misleading-no-13-lakh-women-were-not-reported-missing-in-india-between-2019-2021",
    "selftext": "In July 2023 several news outlets like The Indian Express, The Wire, NDTV, ABP News, The Hindu among others had cited a Rajya Sabha reply to claim that between 2019-2021 more than 13 lakh women were reported missing in India. However, the media had mistakenly misinterpreted the Rajya Sabha figures (which was based on NCRB data) as the actual number of missing women till 2021, since whenever Indian govt started collecting data for crimes, was almost 1/3 of 13 lakh.\n\nNews organizations did not study the original data from the National Crime Records Bureau (NCRB) reports on 2019,2020 and 2021 which made it clear that till 2021 over 4.65 lakh women were missing in India. The misreporting of data has fanned fears of women safety, which nonetheless is a major issue, in the country. Some social media users are using the 13 lakh figure for feearmongering and even claimed that all missing women were kidnapped.\n\nIt should be noted that not only far less women and girls have been reported missing in the country, a majority of them are traced the same year or subsequent years. Also many women are reported missing by their families even they voluntarily leave their parents' home (often for their partners).\n\nAs of 2021, after taking into account missing women that were traced, around 2.03 lakh women remained untraced.",
    "flair": "Crime",
    "score": 48,
    "num_comments": 7,
    "created_utc": 1708895722.0,
    "convurl": "https://external-preview.redd.it/BVqKJNgliWyCuStSSMxlbNd3ZVko-mCvM1xr1uUHuKs.jpg?auto=webp&s=47dcd7ad7aaa7a32e9015ece01bc693e2e8cd6e9",
    "comments": [
        "Ah, so 2 lakh isn't a good enough number to fear for women's safety.\n\nCurious question: Any idea how many men are missing? (I'm not trying to diminish the number of missing women. I'm genuinely curious)",
        "According to NCRB data, till 2021, more than 1.38 lakh men remained untraced in India. According to the latest figures, till 2022-end, over 1.52 lakh men were untraced in the country.",
        "Means India isn't safe for anyone.",
        "Never was",
        "I would suggest that some people get safer by going missing. Especially women leaving abusive relationships.",
        "As long as they stay in India, they're unsafe. Abuser will find them one day, and kill them."
    ],
    "cleaned_text": "lakh women reported missing india july several news outlets like indian express wire ndtv abp news hindu among others cited rajya sabha reply claim lakh women reported missing india however media mistakenly misinterpreted rajya sabha figures based ncrb data actual number missing women till since whenever indian govt started collecting data crimes almost lakh news organizations study original data national crime records bureau ncrb reports made clear till lakh women missing india misreporting data fanned fears women safety nonetheless major issue country social media users using lakh figure feearmongering even claimed missing women kidnapped noted far less women girls reported missing country majority traced year subsequent years also many women reported missing families even voluntarily leave parents home often partners taking account missing women traced around lakh women remained untraced ",
    "cleaned_title": "lakh women reported missing india",
    "cleaned_selftext": "july several news outlets like indian express wire ndtv abp news hindu among others cited rajya sabha reply claim lakh women reported missing india however media mistakenly misinterpreted rajya sabha figures based ncrb data actual number missing women till since whenever indian govt started collecting data crimes almost lakh news organizations study original data national crime records bureau ncrb reports made clear till lakh women missing india misreporting data fanned fears women safety nonetheless major issue country social media users using lakh figure feearmongering even claimed missing women kidnapped noted far less women girls reported missing country majority traced year subsequent years also many women reported missing families even voluntarily leave parents home often partners taking account missing women traced around lakh women remained untraced",
    "cleaned_comments": "ah lakh isnt good enough number fear womens safety curious question idea many men missing im trying diminish number missing women im genuinely curious according ncrb data till lakh men remained untraced india according latest figures till end lakh men untraced country means india isnt safe anyone never would suggest people get safer going missing especially women leaving abusive relationships long stay india theyre unsafe abuser find one day kill",
    "light_cleaned_title": "No, 13 lakh women were not reported missing in India between 2019-2021",
    "light_cleaned_selftext": "In July 2023 several news outlets like The Indian Express, The Wire, NDTV, ABP News, The Hindu among others had cited a Rajya Sabha reply to claim that between 2019-2021 more than 13 lakh women were reported missing in India. However, the media had mistakenly misinterpreted the Rajya Sabha figures (which was based on NCRB data) as the actual number of missing women till 2021, since whenever Indian govt started collecting data for crimes, was almost 1/3 of 13 lakh. News organizations did not study the original data from the National Crime Records Bureau (NCRB) reports on 2019,2020 and 2021 which made it clear that till 2021 over 4.65 lakh women were missing in India. The misreporting of data has fanned fears of women safety, which nonetheless is a major issue, in the country. Some social media users are using the 13 lakh figure for feearmongering and even claimed that all missing women were kidnapped. It should be noted that not only far less women and girls have been reported missing in the country, a majority of them are traced the same year or subsequent years. Also many women are reported missing by their families even they voluntarily leave their parents' home (often for their partners). As of 2021, after taking into account missing women that were traced, around 2.03 lakh women remained untraced.",
    "light_cleaned_comments": "Ah, so 2 lakh isn't a good enough number to fear for women's safety. Curious question: Any idea how many men are missing? (I'm not trying to diminish the number of missing women. I'm genuinely curious) According to NCRB data, till 2021, more than 1.38 lakh men remained untraced in India. According to the latest figures, till 2022-end, over 1.52 lakh men were untraced in the country. Means India isn't safe for anyone. Never was I would suggest that some people get safer by going missing. Especially women leaving abusive relationships. As long as they stay in India, they're unsafe. Abuser will find them one day, and kill them."
}