{
    "id": "12od5tw",
    "title": "BS Yediyurappa: ‘Hijab, halal issues not necessary… I will not support such things’",
    "url": "https://indianexpress.com/article/political-pulse/bs-yediyurappa-hijab-halal-issues-not-necessary-not-support-such-things",
    "selftext": "Hindus and Muslims should live like “brothers and sisters,” and the controversies around hijab and halal – that had rocked Karnataka recently — were “unnecessary”, former Karnataka Chief Minister and BJP veteran B S Yediyurappa said here Friday.",
    "flair": "Politics",
    "score": 79,
    "num_comments": 9,
    "created_utc": 1681658660.0,
    "convurl": "https://external-preview.redd.it/7GZ__PWaJA1uZBY0Lf3O7N2ePA1uik8jpCnjr_Oa__U.jpg?auto=webp&v=enabled&s=14af2c0201aedf69987efec35b8d94a7c4ad83b0",
    "comments": [
        "Where was he when it happened under his own government? Oh yeah, taking advantage of the situation",
        "Aren't there divisions within the karnataka unit of bjp?",
        "He'll support whatever gets him into power. He was cosplaying as Tipu Sultan when Tipu was considered a freedom fighter and promised to remove him from the history books when his party started demonising him.",
        "Homeboy has retired from electoral politics and already secured an election ticket for his son.         \nSo, he is speaking out now when he has literally nothing to lose.",
        "To be fair, he has spoken on this in the past too.",
        "He might have, but for what happened at the time, he should've prioritised calming the situation",
        "Well to be fair to him . These things were under control till he was CM"
    ],
    "cleaned_text": "bs yediyurappa hijab halal issues necessary support things hindus muslims live like brothers sisters controversies around hijab halal rocked karnataka recently unnecessary former karnataka chief minister bjp veteran b yediyurappa said friday ",
    "cleaned_title": "bs yediyurappa hijab halal issues necessary support things",
    "cleaned_selftext": "hindus muslims live like brothers sisters controversies around hijab halal rocked karnataka recently unnecessary former karnataka chief minister bjp veteran b yediyurappa said friday",
    "cleaned_comments": "happened government oh yeah taking advantage situation arent divisions within karnataka unit bjp hell support whatever gets power cosplaying tipu sultan tipu considered freedom fighter promised remove history books party started demonising homeboy retired electoral politics already secured election ticket son speaking literally nothing lose fair spoken past might happened time shouldve prioritised calming situation well fair things control till cm",
    "light_cleaned_title": "BS Yediyurappa: ‘Hijab, halal issues not necessary… I will not support such things’",
    "light_cleaned_selftext": "Hindus and Muslims should live like “brothers and sisters,” and the controversies around hijab and halal – that had rocked Karnataka recently — were “unnecessary”, former Karnataka Chief Minister and BJP veteran B S Yediyurappa said here Friday.",
    "light_cleaned_comments": "Where was he when it happened under his own government? Oh yeah, taking advantage of the situation Aren't there divisions within the karnataka unit of bjp? He'll support whatever gets him into power. He was cosplaying as Tipu Sultan when Tipu was considered a freedom fighter and promised to remove him from the history books when his party started demonising him. Homeboy has retired from electoral politics and already secured an election ticket for his son. So, he is speaking out now when he has literally nothing to lose. To be fair, he has spoken on this in the past too. He might have, but for what happened at the time, he should've prioritised calming the situation Well to be fair to him . These things were under control till he was CM"
}