{
    "id": "hj5dyy",
    "title": "IFF Urges TRAI To Prioritise Users in Net Neutrality #SaveTheInternet",
    "url": "https://www.reddit.com/r/india/comments/hj5dyy/iff_urges_trai_to_prioritise_users_in_net/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/l5s62tqm27851.png?width=1024&amp;format=png&amp;auto=webp&amp;s=e5306bbdf90ee172eb5aca2c156e0cf89b1584fb\n\n### Tl;dr\n\nOn June 24, 2020 IFF participated in a virtual open house discussion [**hosted**](https://trai.gov.in/sites/default/files/PR_No.41of2020.pdf) by the Telecom Regulatory Authority of India (“TRAI”) on its ongoing consultation on traffic management practices (“TMPs”) and a multistakeholder body for net neutrality. In it, TRAI offered stakeholders a final opportunity to submit written submissions by June 29, 2020. IFF has taken the liberty to share a supplementary submission, to complement our earlier [**comments**](https://trai.gov.in/sites/default/files/Internet_Freedom_Foundation_14022020.pdf) and [**counter comments**](https://trai.gov.in/sites/default/files/Internet_Freedom_Foundation_03032020.pdf). The purpose behind this is to emphasise the regulatory importance of focusing on strong implementation and enforcement; and the centrality of public/user participation.\n\n### Background\n\nTRAI has been working on building a suitable implementation framework to monitor and enforce the Government of India’s net neutrality amendments dated [**July 2018**](https://dot.gov.in/sites/default/files/DoT%20Letter%20on%20Net%20Neutrality%20Regulatory%20Framework%20dated%2031%2007%202018_0.pdf?download=1). On January 02 2020, TRAI released a fresh [**consultation paper**](https://trai.gov.in/sites/default/files/CP_02012020.pdf) on net neutrality. The consultation sought to resolve two broad issues. The first is to determine what constitutes reasonable network management practices (“TMPs”) by internet operators consistent with the core principle of non-discriminatory treatment of online content.\n\nThe second is determining suitable institutional design, compliance requirements and technical interventions to monitor the behaviour of your internet operators. Resolving this helps arrive at a framework which can trigger appropriate interventions and ensure strict compliance. You may read more about the consultation paper through our summary [**here**](https://internetfreedom.in/trai-consultation-on-net-neutrality/).\n\n### IFF’s Earlier Comments and Counter Comments\n\nOur initial [**comments**](https://internetfreedom.in/on-valentines-we-send-a-love-letter-for-net-neutrality-to-trai-savetheinternet/) to the consultation paper stressed on ensuring that the actual implementation of the framework remains individual and user centric. We advocated that the framework does not drift towards a scenario where your internet provider has undue influence on the actual enforcement. The primary risks may arise due to:\n\n* Regulations which offer internet providers a pass and they **do not have to publish enough information (in terms of quality and quantity)**.\n* **Vague regulations** which offer your provider with enough **discretion to discriminate**between different types of services on an arbitrary basis. Think of a scenario wherein your gaming streams, P2P file sharing applications or encrypted traffic is performing worse because your internet provider has made some decision behind closed doors.\n* Prolonged “**wait and watch approach**” could be used as a veil which prevents any enforcement mechanism in the interim.\n* A dearth appropriate **traffic measurement systems**\n* Finally, if a **multistakeholder body**, which is meant to be representative of the entire public, and will advise authorities on enforcement is **cornered by your internet provider and large internet businesses**.\n\nDuring the [**counter comments**](https://internetfreedom.in/your-internet-provider-views-net-neutrality-as-an-inconvenience-dont-worry-iffs-got-your-back-2/) phase we noticed that large industry stakeholders, especially telecom representatives, like **Airtel, Reliance Jio, Broadband India Forum and the Cellular Operators Association of India** were largely following the same script. Among other things they advocated for light touch frameworks; wide exceptions in terms of what is allowed as network management practices; authorities stay away from technical monitoring tools; and a complete rejection for any inclusive multistakeholder body. These stakeholders either advocated for no advisory body or at best one which is skewed in favour of telecom players.\n\nThey also requested TRAI legitimise rights restricting content filtering tools and invasive techniques to snoop network traffic called deep packet inspections (DPIs). What was really disturbing is that the basis for most of their submissions were on two particularly unfortunate arguments:\n\n1. First, the net neutrality principle was ill-suited in the context of next-generation access technologies like 5G. In fact, they linked the government’s decision to implement the net neutrality principle with future investments in 5G.\n2. Second, that current legal systems work well enough since there have been no net neutrality violations in the ecosystem since the amendments.\n\nResponding to this our counter comments reminded TRAI that another key aspect of internet governance is ensuring the advance of people’s right to receive and impart information, the ability to exchange ideas, competition, overall diversity and plurality. Keeping this in mind IFF represented the following points:\n\n* TRAI should **narrow loopholes** like the definition of reasonable traffic management practices and specialised services. This will prevent internet providers from abusing regulatory exceptions to discriminate against certain types of internet traffic to the detriment of internet users.\n* Light touch regulations should be discarded. **Strong enforcement** is needed since telecom operators are acting in this sphere with impunity at this stage.\n* TRAI should **not fall for the 5G red herring** and create wide exceptions in the favour of providers for a technology which is a ways away from rollout.\n* **Monitoring and assessment should be done with the help of technical tools** since it can help with objective benchmarking and investigations.\n* TRAI must recommend an **inclusive multistakeholder body** which prevents industry capture, and helps raise institutional capacity within the state to catch and punish net neutrality violations.\n\n### TRAI’s Open House Discussion-- Professor van Schewick’s Contributions were Invaluable\n\nOn June 24, 2020 TRAI took the initiative to [**host**](https://trai.gov.in/sites/default/files/PR_No.41of2020.pdf) a virtual open house discussion on the matter at hand. IFF was among the stakeholders present and intervened along the lines of our earlier submissions. In general, the discussion largely replicated stakeholder positions detailed earlier. **However, the interventions by Professor Barbara van Schewick were particularly instructive**.\n\nProfessor van Schewick clearly outlined the importance of holding network management practices by internet operators accountable. This is because it is this layer of regulation which determines people’s experience of the internet between 5PM and midnight-- time periods where most people use the internet. Professor van Schewick advocated the need for traffic management must be controlled in a manner which keeps the internet ***as non-discriminatory and open as possible***.\n\nTo achieve this she proposed India follow the precedent set in jurisdictions like Canada and Europe which mandate traffic management remains as application agnostic as possible. In addition a restriction must only be considered valid if it aims to address network congestion. She also highlighted that regulation should not legitimise class-based traffic management practices. This is because from a technical perspective, despite the best of intentions, the internet was not built to identify applications. **Professor van Schewick stressed that in practice such a governance approach leads to discriminatory and non competitive outcomes which hamper user choice and distorts innovation decisions**.\n\nProfessor van Schewick also offered a lucid intervention which took apart the notion that TRAI should relax net neutrality thresholds for 5G innovations. She clarified this by stating that 5G offers increased network capacity and faster speeds. In essence, 5G reduces the need for discrimination. In her explanation about reconciling innovation and 5G she discussed innovation in the realm of [**network slicing**](https://www.gsma.com/futurenetworks/wp-content/uploads/2017/11/GSMA-An-Introduction-to-Network-Slicing.pdf). Critically, she touched upon a key pillar of net neutrality i.e. ***user centricity***.\n\nIn this context, she highlighted that regulations like net neutrality in domains like network slicing &amp; 5G. may be shaped by user needs and preferences. In essence 5G innovations in domains like network slicing and software defined networks can be linked to market/user demand, and the net neutrality principle is perfectly aligned with this.\n\nIn a later intervention, Professor van Schewick again stressed on the importance of public centricity and user participation. She stressed that it is critical that the implementation of traffic management rules are enforced with sufficient and the widest possible public participation.\n\n### IFF’s Supplementary Submission\n\nTaking a cue from these prescient observations IFF filed a [**supplementary submission**](https://drive.google.com/file/d/1eVHECaTL47SsMzp9rjfwBe2qiMnif9Ge/view) in order to offer sufficient public and user-side perspectives. Our submission highlights that it is essential that TRAI and DoT ensure the enforcement framework discharges the intended objectives of net neutrality. Specifically, they must ensure the benefits of the amendment percolate down to citizens and emerging entrepreneurs. For this the Government and the telecom regulator must not allow for industry to use ancillary components of the conversation like future networking innovations to revisit settled debates around the net neutrality principle.\n\nInstead, TRAI and the Government would be well served if they focus on installing suitable implementation mechanisms. In our submission we address the importance of:\n\n* **Providing Strong Institutional Mechanisms for Public Complaints, Awareness and Participation.** This requires ensuring that an advisory multistakeholder body is designed in a manner which serves the public interest and mitigates risks of it becoming cornered by large licensed and industry participants. To ward off such risks we proposed TRAI consider passing an overarching regulatory framework.\n* We also highlighted the importance of government interventions to drive public awareness and participation in the framework. For this we highlighted, our own experiences documenting alleged net neutrality violations by internet operators. To read more about these experiences you may read these blog posts [**here**](https://internetfreedom.in/more-than-100-people-report-violations-of-net-neutrality-all-over-india-we-need-enforcement-action/), [**here**](https://internetfreedom.in/net-neutrality-in-india-needs-to-find-its-bearings/), and [**here**](https://internetfreedom.in/what-the-block-iff-has-heard-your-complaints-and-is-taking-action-savetheinternet/).\n* Our supplementary submission even highlights that IFF has written in [**March**](https://drive.google.com/file/d/1wS1gUa0nl3YLM2Tlhjpej8l97cZan-yZ/view) and [**May**](https://drive.google.com/file/d/1seyH554MRserRW7N_xyi3KUeYL6ywbrL/view?usp=sharing), 2019 to both TRAI and the Department of Telecommunications (“DoT”) to take notice of the matter and accelerate work towards implementation and enforcement; to add heft to the net neutrality licensing amendments.\n* Keeping these experiences in mind, we emphasised the importance of ensuring that the **consumers must be able to have appropriate avenues to register complaints**. In particular it is important that India establishes a mechanism for user-side feedback loops. Authorities must determine what is more effective in raising user participation, i.e whether feedback/complaint systems are built and operationalised ***internally or externally.*** Appropriate forums which engage frequently and meaningfully with end-users, who establish trust with these constituents can be leveraged by Indian authorities towards these complaint/feedback objectives.\n* **Additionally, it is imperative TRAI and DoT implement technical tools which empower users and reduce information asymmetries. Here, there remains a distinction between website blocking and other types of net neutrality violations. Throttling and technical prioritisation is less visceral than website blocking. For this India needs to empower users and external researchers with easy-to-use tools which can detect irregular degradation of performance by internet access providers.**\n* Finally, among other things, our response stressed on the fact that unlike the representations made by internet access providers **net neutrality does not hinder innovation even in domains like 5G**. Therefore, any exceptions to the principle must be streamlined and defined in a narrow manner.\n* **We also urged TRAI to categorically outlaw the use of deep packet inspections (“DPIs”) and content filtering/parental control tools**.\n\n## What’s Next?\n\nWe will continue to follow up with TRAI and DoT, and ensure net neutrality is meaningfully implemented. After this we will work towards ensuring that the ecosystem can allow for you to formally register complaints with authorities. Second, we will work towards transparency. This includes suitable disclosure making norms and ensuring that you are provided with technical tools which can be used dynamically to monitor your internet providers activities.\n\nIn the meantime please feel free to report to us any perceived violations by your internet provider in this reporting form [**here**](https://savetheinternet.in/report/).\n\n## Important Documents\n\n1. Our supplementary submission dated June 29, 2020 to TRAI on the consultation paper on TMPs and a multistakeholder body for net neutrality ([**link**](https://drive.google.com/file/d/1eVHECaTL47SsMzp9rjfwBe2qiMnif9Ge/view))\n2. Our initial comments to the consultation paper dated February 13, 2020 ([**link**](https://trai.gov.in/sites/default/files/Internet_Freedom_Foundation_14022020.pdf))\n3. Our counter comments to the consultation paper dated February 27, 2020 ([**link**](https://trai.gov.in/sites/default/files/Internet_Freedom_Foundation_03032020.pdf))\n4. IFF’s analysis of TRAI’s consultation paper on TMPs and a multistakeholder body for net neutrality ([**link**](https://internetfreedom.in/trai-consultation-on-net-neutrality/))\n5. Read more about our work documenting non-compliance by internet access providers with their net neutrality obligations ([**link**](https://internetfreedom.in/more-than-100-people-report-violations-of-net-neutrality-all-over-india-we-need-enforcement-action/), [**link** ](https://internetfreedom.in/net-neutrality-in-india-needs-to-find-its-bearings/)and [**link**](https://internetfreedom.in/what-the-block-iff-has-heard-your-complaints-and-is-taking-action-savetheinternet/))\n6. **Report a net neutrality violation (**[**link**](https://savetheinternet.in/report/)**)**\n\n[Even during these uncertain times, IFF continues in its operations and working towards securing your privacy and digital rights. Support us through one time donations or becoming a member with us. Donate now!](https://internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 55,
    "num_comments": 1,
    "created_utc": 1593587040,
    "convurl": "https://a.thumbs.redditmedia.com/gbp5A61MrOH-qUNLs-StOFhomYR4Q8VNF2t_XU00oj8.jpg",
    "comments": [
        "Keep up the good work, guys!\n\nAre you guys investigating the recent banning of duckduckgo.com? Are there any legal processes that can be used to compel ISPs to overturn the ban?"
    ],
    "cleaned_text": "iff urges trai prioritise users net neutrality savetheinternet ampxb tldr june iff participated virtual open house discussion hostedhttpstraigovinsitesdefaultfilesprnoofpdf telecom regulatory authority india trai ongoing consultation traffic management practices tmps multistakeholder body net neutrality trai offered stakeholders final opportunity submit written submissions june iff taken liberty share supplementary submission complement earlier commentshttpstraigovinsitesdefaultfilesinternetfreedomfoundationpdf counter commentshttpstraigovinsitesdefaultfilesinternetfreedomfoundationpdf purpose behind emphasise regulatory importance focusing strong implementation enforcement centrality publicuser participation background trai working building suitable implementation framework monitor enforce government indias net neutrality amendments dated july httpsdotgovinsitesdefaultfilesdotletteronnetneutralityregulatoryframeworkdatedpdfdownload january trai released fresh consultation paperhttpstraigovinsitesdefaultfilescppdf net neutrality consultation sought resolve two broad issues first determine constitutes reasonable network management practices tmps internet operators consistent core principle nondiscriminatory treatment online content second determining suitable institutional design compliance requirements technical interventions monitor behaviour internet operators resolving helps arrive framework trigger appropriate interventions ensure strict compliance may read consultation paper summary herehttpsinternetfreedomintraiconsultationonnetneutrality iffs earlier comments counter comments initial commentshttpsinternetfreedominonvalentineswesendaloveletterfornetneutralitytotraisavetheinternet consultation paper stressed ensuring actual implementation framework remains individual user centric advocated framework drift towards scenario internet provider undue influence actual enforcement primary risks may arise due regulations offer internet providers pass publish enough information terms quality quantity vague regulations offer provider enough discretion discriminatebetween different types services arbitrary basis think scenario wherein gaming streams pp file sharing applications encrypted traffic performing worse internet provider made decision behind closed doors prolonged wait watch approach could used veil prevents enforcement mechanism interim dearth appropriate traffic measurement systems finally multistakeholder body meant representative entire public advise authorities enforcement cornered internet provider large internet businesses counter commentshttpsinternetfreedominyourinternetproviderviewsnetneutralityasaninconveniencedontworryiffsgotyourback phase noticed large industry stakeholders especially telecom representatives like airtel reliance jio broadband india forum cellular operators association india largely following script among things advocated light touch frameworks wide exceptions terms allowed network management practices authorities stay away technical monitoring tools complete rejection inclusive multistakeholder body stakeholders either advocated advisory body best one skewed favour telecom players also requested trai legitimise rights restricting content filtering tools invasive techniques snoop network traffic called deep packet inspections dpis really disturbing basis submissions two particularly unfortunate arguments first net neutrality principle illsuited context nextgeneration access technologies like g fact linked governments decision implement net neutrality principle future investments g second current legal systems work well enough since net neutrality violations ecosystem since amendments responding counter comments reminded trai another key aspect internet governance ensuring advance peoples right receive impart information ability exchange ideas competition overall diversity plurality keeping mind iff represented following points trai narrow loopholes like definition reasonable traffic management practices specialised services prevent internet providers abusing regulatory exceptions discriminate certain types internet traffic detriment internet users light touch regulations discarded strong enforcement needed since telecom operators acting sphere impunity stage trai fall g red herring create wide exceptions favour providers technology ways away rollout monitoring assessment done help technical tools since help objective benchmarking investigations trai must recommend inclusive multistakeholder body prevents industry capture helps raise institutional capacity within state catch punish net neutrality violations trais open house discussion professor van schewicks contributions invaluable june trai took initiative hosthttpstraigovinsitesdefaultfilesprnoofpdf virtual open house discussion matter hand iff among stakeholders present intervened along lines earlier submissions general discussion largely replicated stakeholder positions detailed earlier however interventions professor barbara van schewick particularly instructive professor van schewick clearly outlined importance holding network management practices internet operators accountable layer regulation determines peoples experience internet pm midnight time periods people use internet professor van schewick advocated need traffic management must controlled manner keeps internet nondiscriminatory open possible achieve proposed india follow precedent set jurisdictions like canada europe mandate traffic management remains application agnostic possible addition restriction must considered valid aims address network congestion also highlighted regulation legitimise classbased traffic management practices technical perspective despite best intentions internet built identify applications professor van schewick stressed practice governance approach leads discriminatory non competitive outcomes hamper user choice distorts innovation decisions professor van schewick also offered lucid intervention took apart notion trai relax net neutrality thresholds g innovations clarified stating g offers increased network capacity faster speeds essence g reduces need discrimination explanation reconciling innovation g discussed innovation realm network slicinghttpswwwgsmacomfuturenetworkswpcontentuploadsgsmaanintroductiontonetworkslicingpdf critically touched upon key pillar net neutrality ie user centricity context highlighted regulations like net neutrality domains like network slicing amp g may shaped user needs preferences essence g innovations domains like network slicing software defined networks linked marketuser demand net neutrality principle perfectly aligned later intervention professor van schewick stressed importance public centricity user participation stressed critical implementation traffic management rules enforced sufficient widest possible public participation iffs supplementary submission taking cue prescient observations iff filed supplementary submissionhttpsdrivegooglecomfiledevhecatlssmzprjfwbeqimnifgeview order offer sufficient public userside perspectives submission highlights essential trai dot ensure enforcement framework discharges intended objectives net neutrality specifically must ensure benefits amendment percolate citizens emerging entrepreneurs government telecom regulator must allow industry use ancillary components conversation like future networking innovations revisit settled debates around net neutrality principle instead trai government would well served focus installing suitable implementation mechanisms submission address importance providing strong institutional mechanisms public complaints awareness participation requires ensuring advisory multistakeholder body designed manner serves public interest mitigates risks becoming cornered large licensed industry participants ward risks proposed trai consider passing overarching regulatory framework also highlighted importance government interventions drive public awareness participation framework highlighted experiences documenting alleged net neutrality violations internet operators read experiences may read blog posts herehttpsinternetfreedominmorethanpeoplereportviolationsofnetneutralityalloverindiaweneedenforcementaction herehttpsinternetfreedominnetneutralityinindianeedstofinditsbearings herehttpsinternetfreedominwhattheblockiffhasheardyourcomplaintsandistakingactionsavetheinternet supplementary submission even highlights iff written marchhttpsdrivegooglecomfiledwsguanlylmtlhjpejlczanyzview mayhttpsdrivegooglecomfiledseyhmrserrwnxyikueylywbrlviewuspsharing trai department telecommunications dot take notice matter accelerate work towards implementation enforcement add heft net neutrality licensing amendments keeping experiences mind emphasised importance ensuring consumers must able appropriate avenues register complaints particular important india establishes mechanism userside feedback loops authorities must determine effective raising user participation ie whether feedbackcomplaint systems built operationalised internally externally appropriate forums engage frequently meaningfully endusers establish trust constituents leveraged indian authorities towards complaintfeedback objectives additionally imperative trai dot implement technical tools empower users reduce information asymmetries remains distinction website blocking types net neutrality violations throttling technical prioritisation less visceral website blocking india needs empower users external researchers easytouse tools detect irregular degradation performance internet access providers finally among things response stressed fact unlike representations made internet access providers net neutrality hinder innovation even domains like g therefore exceptions principle must streamlined defined narrow manner also urged trai categorically outlaw use deep packet inspections dpis content filteringparental control tools whats next continue follow trai dot ensure net neutrality meaningfully implemented work towards ensuring ecosystem allow formally register complaints authorities second work towards transparency includes suitable disclosure making norms ensuring provided technical tools used dynamically monitor internet providers activities meantime please feel free report us perceived violations internet provider reporting form herehttpssavetheinternetinreport important documents supplementary submission dated june trai consultation paper tmps multistakeholder body net neutrality linkhttpsdrivegooglecomfiledevhecatlssmzprjfwbeqimnifgeview initial comments consultation paper dated february linkhttpstraigovinsitesdefaultfilesinternetfreedomfoundationpdf counter comments consultation paper dated february linkhttpstraigovinsitesdefaultfilesinternetfreedomfoundationpdf iffs analysis trais consultation paper tmps multistakeholder body net neutrality linkhttpsinternetfreedomintraiconsultationonnetneutrality read work documenting noncompliance internet access providers net neutrality obligations linkhttpsinternetfreedominmorethanpeoplereportviolationsofnetneutralityalloverindiaweneedenforcementaction link httpsinternetfreedominnetneutralityinindianeedstofinditsbearingsand linkhttpsinternetfreedominwhattheblockiffhasheardyourcomplaintsandistakingactionsavetheinternet report net neutrality violation linkhttpssavetheinternetinreport even uncertain times iff continues operations working towards securing privacy digital rights support us one time donations becoming member us donate nowhttpsinternetfreedomindonate ",
    "cleaned_title": "iff urges trai prioritise users net neutrality savetheinternet",
    "cleaned_selftext": "ampxb tldr june iff participated virtual open house discussion hostedhttpstraigovinsitesdefaultfilesprnoofpdf telecom regulatory authority india trai ongoing consultation traffic management practices tmps multistakeholder body net neutrality trai offered stakeholders final opportunity submit written submissions june iff taken liberty share supplementary submission complement earlier commentshttpstraigovinsitesdefaultfilesinternetfreedomfoundationpdf counter commentshttpstraigovinsitesdefaultfilesinternetfreedomfoundationpdf purpose behind emphasise regulatory importance focusing strong implementation enforcement centrality publicuser participation background trai working building suitable implementation framework monitor enforce government indias net neutrality amendments dated july httpsdotgovinsitesdefaultfilesdotletteronnetneutralityregulatoryframeworkdatedpdfdownload january trai released fresh consultation paperhttpstraigovinsitesdefaultfilescppdf net neutrality consultation sought resolve two broad issues first determine constitutes reasonable network management practices tmps internet operators consistent core principle nondiscriminatory treatment online content second determining suitable institutional design compliance requirements technical interventions monitor behaviour internet operators resolving helps arrive framework trigger appropriate interventions ensure strict compliance may read consultation paper summary herehttpsinternetfreedomintraiconsultationonnetneutrality iffs earlier comments counter comments initial commentshttpsinternetfreedominonvalentineswesendaloveletterfornetneutralitytotraisavetheinternet consultation paper stressed ensuring actual implementation framework remains individual user centric advocated framework drift towards scenario internet provider undue influence actual enforcement primary risks may arise due regulations offer internet providers pass publish enough information terms quality quantity vague regulations offer provider enough discretion discriminatebetween different types services arbitrary basis think scenario wherein gaming streams pp file sharing applications encrypted traffic performing worse internet provider made decision behind closed doors prolonged wait watch approach could used veil prevents enforcement mechanism interim dearth appropriate traffic measurement systems finally multistakeholder body meant representative entire public advise authorities enforcement cornered internet provider large internet businesses counter commentshttpsinternetfreedominyourinternetproviderviewsnetneutralityasaninconveniencedontworryiffsgotyourback phase noticed large industry stakeholders especially telecom representatives like airtel reliance jio broadband india forum cellular operators association india largely following script among things advocated light touch frameworks wide exceptions terms allowed network management practices authorities stay away technical monitoring tools complete rejection inclusive multistakeholder body stakeholders either advocated advisory body best one skewed favour telecom players also requested trai legitimise rights restricting content filtering tools invasive techniques snoop network traffic called deep packet inspections dpis really disturbing basis submissions two particularly unfortunate arguments first net neutrality principle illsuited context nextgeneration access technologies like g fact linked governments decision implement net neutrality principle future investments g second current legal systems work well enough since net neutrality violations ecosystem since amendments responding counter comments reminded trai another key aspect internet governance ensuring advance peoples right receive impart information ability exchange ideas competition overall diversity plurality keeping mind iff represented following points trai narrow loopholes like definition reasonable traffic management practices specialised services prevent internet providers abusing regulatory exceptions discriminate certain types internet traffic detriment internet users light touch regulations discarded strong enforcement needed since telecom operators acting sphere impunity stage trai fall g red herring create wide exceptions favour providers technology ways away rollout monitoring assessment done help technical tools since help objective benchmarking investigations trai must recommend inclusive multistakeholder body prevents industry capture helps raise institutional capacity within state catch punish net neutrality violations trais open house discussion professor van schewicks contributions invaluable june trai took initiative hosthttpstraigovinsitesdefaultfilesprnoofpdf virtual open house discussion matter hand iff among stakeholders present intervened along lines earlier submissions general discussion largely replicated stakeholder positions detailed earlier however interventions professor barbara van schewick particularly instructive professor van schewick clearly outlined importance holding network management practices internet operators accountable layer regulation determines peoples experience internet pm midnight time periods people use internet professor van schewick advocated need traffic management must controlled manner keeps internet nondiscriminatory open possible achieve proposed india follow precedent set jurisdictions like canada europe mandate traffic management remains application agnostic possible addition restriction must considered valid aims address network congestion also highlighted regulation legitimise classbased traffic management practices technical perspective despite best intentions internet built identify applications professor van schewick stressed practice governance approach leads discriminatory non competitive outcomes hamper user choice distorts innovation decisions professor van schewick also offered lucid intervention took apart notion trai relax net neutrality thresholds g innovations clarified stating g offers increased network capacity faster speeds essence g reduces need discrimination explanation reconciling innovation g discussed innovation realm network slicinghttpswwwgsmacomfuturenetworkswpcontentuploadsgsmaanintroductiontonetworkslicingpdf critically touched upon key pillar net neutrality ie user centricity context highlighted regulations like net neutrality domains like network slicing amp g may shaped user needs preferences essence g innovations domains like network slicing software defined networks linked marketuser demand net neutrality principle perfectly aligned later intervention professor van schewick stressed importance public centricity user participation stressed critical implementation traffic management rules enforced sufficient widest possible public participation iffs supplementary submission taking cue prescient observations iff filed supplementary submissionhttpsdrivegooglecomfiledevhecatlssmzprjfwbeqimnifgeview order offer sufficient public userside perspectives submission highlights essential trai dot ensure enforcement framework discharges intended objectives net neutrality specifically must ensure benefits amendment percolate citizens emerging entrepreneurs government telecom regulator must allow industry use ancillary components conversation like future networking innovations revisit settled debates around net neutrality principle instead trai government would well served focus installing suitable implementation mechanisms submission address importance providing strong institutional mechanisms public complaints awareness participation requires ensuring advisory multistakeholder body designed manner serves public interest mitigates risks becoming cornered large licensed industry participants ward risks proposed trai consider passing overarching regulatory framework also highlighted importance government interventions drive public awareness participation framework highlighted experiences documenting alleged net neutrality violations internet operators read experiences may read blog posts herehttpsinternetfreedominmorethanpeoplereportviolationsofnetneutralityalloverindiaweneedenforcementaction herehttpsinternetfreedominnetneutralityinindianeedstofinditsbearings herehttpsinternetfreedominwhattheblockiffhasheardyourcomplaintsandistakingactionsavetheinternet supplementary submission even highlights iff written marchhttpsdrivegooglecomfiledwsguanlylmtlhjpejlczanyzview mayhttpsdrivegooglecomfiledseyhmrserrwnxyikueylywbrlviewuspsharing trai department telecommunications dot take notice matter accelerate work towards implementation enforcement add heft net neutrality licensing amendments keeping experiences mind emphasised importance ensuring consumers must able appropriate avenues register complaints particular important india establishes mechanism userside feedback loops authorities must determine effective raising user participation ie whether feedbackcomplaint systems built operationalised internally externally appropriate forums engage frequently meaningfully endusers establish trust constituents leveraged indian authorities towards complaintfeedback objectives additionally imperative trai dot implement technical tools empower users reduce information asymmetries remains distinction website blocking types net neutrality violations throttling technical prioritisation less visceral website blocking india needs empower users external researchers easytouse tools detect irregular degradation performance internet access providers finally among things response stressed fact unlike representations made internet access providers net neutrality hinder innovation even domains like g therefore exceptions principle must streamlined defined narrow manner also urged trai categorically outlaw use deep packet inspections dpis content filteringparental control tools whats next continue follow trai dot ensure net neutrality meaningfully implemented work towards ensuring ecosystem allow formally register complaints authorities second work towards transparency includes suitable disclosure making norms ensuring provided technical tools used dynamically monitor internet providers activities meantime please feel free report us perceived violations internet provider reporting form herehttpssavetheinternetinreport important documents supplementary submission dated june trai consultation paper tmps multistakeholder body net neutrality linkhttpsdrivegooglecomfiledevhecatlssmzprjfwbeqimnifgeview initial comments consultation paper dated february linkhttpstraigovinsitesdefaultfilesinternetfreedomfoundationpdf counter comments consultation paper dated february linkhttpstraigovinsitesdefaultfilesinternetfreedomfoundationpdf iffs analysis trais consultation paper tmps multistakeholder body net neutrality linkhttpsinternetfreedomintraiconsultationonnetneutrality read work documenting noncompliance internet access providers net neutrality obligations linkhttpsinternetfreedominmorethanpeoplereportviolationsofnetneutralityalloverindiaweneedenforcementaction link httpsinternetfreedominnetneutralityinindianeedstofinditsbearingsand linkhttpsinternetfreedominwhattheblockiffhasheardyourcomplaintsandistakingactionsavetheinternet report net neutrality violation linkhttpssavetheinternetinreport even uncertain times iff continues operations working towards securing privacy digital rights support us one time donations becoming member us donate nowhttpsinternetfreedomindonate",
    "cleaned_comments": "keep good work guys guys investigating recent banning duckduckgocom legal processes used compel isps overturn ban",
    "light_cleaned_title": "IFF Urges TRAI To Prioritise Users in Net Neutrality #SaveTheInternet",
    "light_cleaned_selftext": "### Tl;dr On June 24, 2020 IFF participated in a virtual open house discussion [**hosted**](https://trai.gov.in/sites/default/files/PR_No.41of2020.pdf) by the Telecom Regulatory Authority of India (“TRAI”) on its ongoing consultation on traffic management practices (“TMPs”) and a multistakeholder body for net neutrality. In it, TRAI offered stakeholders a final opportunity to submit written submissions by June 29, 2020. IFF has taken the liberty to share a supplementary submission, to complement our earlier [**comments**](https://trai.gov.in/sites/default/files/Internet_Freedom_Foundation_14022020.pdf) and [**counter comments**](https://trai.gov.in/sites/default/files/Internet_Freedom_Foundation_03032020.pdf). The purpose behind this is to emphasise the regulatory importance of focusing on strong implementation and enforcement; and the centrality of public/user participation. ### Background TRAI has been working on building a suitable implementation framework to monitor and enforce the Government of India’s net neutrality amendments dated [**July 2018**](https://dot.gov.in/sites/default/files/DoT%20Letter%20on%20Net%20Neutrality%20Regulatory%20Framework%20dated%2031%2007%202018_0.pdf?download=1). On January 02 2020, TRAI released a fresh [**consultation paper**](https://trai.gov.in/sites/default/files/CP_02012020.pdf) on net neutrality. The consultation sought to resolve two broad issues. The first is to determine what constitutes reasonable network management practices (“TMPs”) by internet operators consistent with the core principle of non-discriminatory treatment of online content. The second is determining suitable institutional design, compliance requirements and technical interventions to monitor the behaviour of your internet operators. Resolving this helps arrive at a framework which can trigger appropriate interventions and ensure strict compliance. You may read more about the consultation paper through our summary [**here**](https://internetfreedom.in/trai-consultation-on-net-neutrality/). ### IFF’s Earlier Comments and Counter Comments Our initial [**comments**](https://internetfreedom.in/on-valentines-we-send-a-love-letter-for-net-neutrality-to-trai-savetheinternet/) to the consultation paper stressed on ensuring that the actual implementation of the framework remains individual and user centric. We advocated that the framework does not drift towards a scenario where your internet provider has undue influence on the actual enforcement. The primary risks may arise due to: * Regulations which offer internet providers a pass and they **do not have to publish enough information (in terms of quality and quantity)**. * **Vague regulations** which offer your provider with enough **discretion to discriminate**between different types of services on an arbitrary basis. Think of a scenario wherein your gaming streams, P2P file sharing applications or encrypted traffic is performing worse because your internet provider has made some decision behind closed doors. * Prolonged “**wait and watch approach**” could be used as a veil which prevents any enforcement mechanism in the interim. * A dearth appropriate **traffic measurement systems** * Finally, if a **multistakeholder body**, which is meant to be representative of the entire public, and will advise authorities on enforcement is **cornered by your internet provider and large internet businesses**. During the [**counter comments**](https://internetfreedom.in/your-internet-provider-views-net-neutrality-as-an-inconvenience-dont-worry-iffs-got-your-back-2/) phase we noticed that large industry stakeholders, especially telecom representatives, like **Airtel, Reliance Jio, Broadband India Forum and the Cellular Operators Association of India** were largely following the same script. Among other things they advocated for light touch frameworks; wide exceptions in terms of what is allowed as network management practices; authorities stay away from technical monitoring tools; and a complete rejection for any inclusive multistakeholder body. These stakeholders either advocated for no advisory body or at best one which is skewed in favour of telecom players. They also requested TRAI legitimise rights restricting content filtering tools and invasive techniques to snoop network traffic called deep packet inspections (DPIs). What was really disturbing is that the basis for most of their submissions were on two particularly unfortunate arguments: 1. First, the net neutrality principle was ill-suited in the context of next-generation access technologies like 5G. In fact, they linked the government’s decision to implement the net neutrality principle with future investments in 5G. 2. Second, that current legal systems work well enough since there have been no net neutrality violations in the ecosystem since the amendments. Responding to this our counter comments reminded TRAI that another key aspect of internet governance is ensuring the advance of people’s right to receive and impart information, the ability to exchange ideas, competition, overall diversity and plurality. Keeping this in mind IFF represented the following points: * TRAI should **narrow loopholes** like the definition of reasonable traffic management practices and specialised services. This will prevent internet providers from abusing regulatory exceptions to discriminate against certain types of internet traffic to the detriment of internet users. * Light touch regulations should be discarded. **Strong enforcement** is needed since telecom operators are acting in this sphere with impunity at this stage. * TRAI should **not fall for the 5G red herring** and create wide exceptions in the favour of providers for a technology which is a ways away from rollout. * **Monitoring and assessment should be done with the help of technical tools** since it can help with objective benchmarking and investigations. * TRAI must recommend an **inclusive multistakeholder body** which prevents industry capture, and helps raise institutional capacity within the state to catch and punish net neutrality violations. ### TRAI’s Open House Discussion-- Professor van Schewick’s Contributions were Invaluable On June 24, 2020 TRAI took the initiative to [**host**](https://trai.gov.in/sites/default/files/PR_No.41of2020.pdf) a virtual open house discussion on the matter at hand. IFF was among the stakeholders present and intervened along the lines of our earlier submissions. In general, the discussion largely replicated stakeholder positions detailed earlier. **However, the interventions by Professor Barbara van Schewick were particularly instructive**. Professor van Schewick clearly outlined the importance of holding network management practices by internet operators accountable. This is because it is this layer of regulation which determines people’s experience of the internet between 5PM and midnight-- time periods where most people use the internet. Professor van Schewick advocated the need for traffic management must be controlled in a manner which keeps the internet ***as non-discriminatory and open as possible***. To achieve this she proposed India follow the precedent set in jurisdictions like Canada and Europe which mandate traffic management remains as application agnostic as possible. In addition a restriction must only be considered valid if it aims to address network congestion. She also highlighted that regulation should not legitimise class-based traffic management practices. This is because from a technical perspective, despite the best of intentions, the internet was not built to identify applications. **Professor van Schewick stressed that in practice such a governance approach leads to discriminatory and non competitive outcomes which hamper user choice and distorts innovation decisions**. Professor van Schewick also offered a lucid intervention which took apart the notion that TRAI should relax net neutrality thresholds for 5G innovations. She clarified this by stating that 5G offers increased network capacity and faster speeds. In essence, 5G reduces the need for discrimination. In her explanation about reconciling innovation and 5G she discussed innovation in the realm of [**network slicing**](https://www.gsma.com/futurenetworks/wp-content/uploads/2017/11/GSMA-An-Introduction-to-Network-Slicing.pdf). Critically, she touched upon a key pillar of net neutrality i.e. ***user centricity***. In this context, she highlighted that regulations like net neutrality in domains like network slicing &amp; 5G. may be shaped by user needs and preferences. In essence 5G innovations in domains like network slicing and software defined networks can be linked to market/user demand, and the net neutrality principle is perfectly aligned with this. In a later intervention, Professor van Schewick again stressed on the importance of public centricity and user participation. She stressed that it is critical that the implementation of traffic management rules are enforced with sufficient and the widest possible public participation. ### IFF’s Supplementary Submission Taking a cue from these prescient observations IFF filed a [**supplementary submission**](https://drive.google.com/file/d/1eVHECaTL47SsMzp9rjfwBe2qiMnif9Ge/view) in order to offer sufficient public and user-side perspectives. Our submission highlights that it is essential that TRAI and DoT ensure the enforcement framework discharges the intended objectives of net neutrality. Specifically, they must ensure the benefits of the amendment percolate down to citizens and emerging entrepreneurs. For this the Government and the telecom regulator must not allow for industry to use ancillary components of the conversation like future networking innovations to revisit settled debates around the net neutrality principle. Instead, TRAI and the Government would be well served if they focus on installing suitable implementation mechanisms. In our submission we address the importance of: * **Providing Strong Institutional Mechanisms for Public Complaints, Awareness and Participation.** This requires ensuring that an advisory multistakeholder body is designed in a manner which serves the public interest and mitigates risks of it becoming cornered by large licensed and industry participants. To ward off such risks we proposed TRAI consider passing an overarching regulatory framework. * We also highlighted the importance of government interventions to drive public awareness and participation in the framework. For this we highlighted, our own experiences documenting alleged net neutrality violations by internet operators. To read more about these experiences you may read these blog posts [**here**](https://internetfreedom.in/more-than-100-people-report-violations-of-net-neutrality-all-over-india-we-need-enforcement-action/), [**here**](https://internetfreedom.in/net-neutrality-in-india-needs-to-find-its-bearings/), and [**here**](https://internetfreedom.in/what-the-block-iff-has-heard-your-complaints-and-is-taking-action-savetheinternet/). * Our supplementary submission even highlights that IFF has written in [**March**](https://drive.google.com/file/d/1wS1gUa0nl3YLM2Tlhjpej8l97cZan-yZ/view) and [**May**](https://drive.google.com/file/d/1seyH554MRserRW7N_xyi3KUeYL6ywbrL/view?usp=sharing), 2019 to both TRAI and the Department of Telecommunications (“DoT”) to take notice of the matter and accelerate work towards implementation and enforcement; to add heft to the net neutrality licensing amendments. * Keeping these experiences in mind, we emphasised the importance of ensuring that the **consumers must be able to have appropriate avenues to register complaints**. In particular it is important that India establishes a mechanism for user-side feedback loops. Authorities must determine what is more effective in raising user participation, i.e whether feedback/complaint systems are built and operationalised ***internally or externally.*** Appropriate forums which engage frequently and meaningfully with end-users, who establish trust with these constituents can be leveraged by Indian authorities towards these complaint/feedback objectives. * **Additionally, it is imperative TRAI and DoT implement technical tools which empower users and reduce information asymmetries. Here, there remains a distinction between website blocking and other types of net neutrality violations. Throttling and technical prioritisation is less visceral than website blocking. For this India needs to empower users and external researchers with easy-to-use tools which can detect irregular degradation of performance by internet access providers.** * Finally, among other things, our response stressed on the fact that unlike the representations made by internet access providers **net neutrality does not hinder innovation even in domains like 5G**. Therefore, any exceptions to the principle must be streamlined and defined in a narrow manner. * **We also urged TRAI to categorically outlaw the use of deep packet inspections (“DPIs”) and content filtering/parental control tools**. ## What’s Next? We will continue to follow up with TRAI and DoT, and ensure net neutrality is meaningfully implemented. After this we will work towards ensuring that the ecosystem can allow for you to formally register complaints with authorities. Second, we will work towards transparency. This includes suitable disclosure making norms and ensuring that you are provided with technical tools which can be used dynamically to monitor your internet providers activities. In the meantime please feel free to report to us any perceived violations by your internet provider in this reporting form [**here**](https://savetheinternet.in/report/). ## Important Documents 1. Our supplementary submission dated June 29, 2020 to TRAI on the consultation paper on TMPs and a multistakeholder body for net neutrality ([**link**](https://drive.google.com/file/d/1eVHECaTL47SsMzp9rjfwBe2qiMnif9Ge/view)) 2. Our initial comments to the consultation paper dated February 13, 2020 ([**link**](https://trai.gov.in/sites/default/files/Internet_Freedom_Foundation_14022020.pdf)) 3. Our counter comments to the consultation paper dated February 27, 2020 ([**link**](https://trai.gov.in/sites/default/files/Internet_Freedom_Foundation_03032020.pdf)) 4. IFF’s analysis of TRAI’s consultation paper on TMPs and a multistakeholder body for net neutrality ([**link**](https://internetfreedom.in/trai-consultation-on-net-neutrality/)) 5. Read more about our work documenting non-compliance by internet access providers with their net neutrality obligations ([**link**](https://internetfreedom.in/more-than-100-people-report-violations-of-net-neutrality-all-over-india-we-need-enforcement-action/), [**link** ](https://internetfreedom.in/net-neutrality-in-india-needs-to-find-its-bearings/)and [**link**](https://internetfreedom.in/what-the-block-iff-has-heard-your-complaints-and-is-taking-action-savetheinternet/)) 6. **Report a net neutrality violation (**[**link**](https://savetheinternet.in/report/)**)** [Even during these uncertain times, IFF continues in its operations and working towards securing your privacy and digital rights. Support us through one time donations or becoming a member with us. Donate now!](https://internetfreedom.in/donate)",
    "light_cleaned_comments": "Keep up the good work, guys! Are you guys investigating the recent banning of duckduckgo.com? Are there any legal processes that can be used to compel ISPs to overturn the ban?"
}