{
    "id": "1558y71",
    "title": "The schools are still open",
    "url": "https://i.redd.it/9r3mj8xfv7db1.jpg",
    "selftext": "In this letter the municipal community has given strick orders for red alert in thane area. But still a very reputable and a respectable school  which ranks 2 all over India and 1 all over maharashtra is  going against the letter of thane collectors officer. The scenario is in mumbai is  we have red alert from 20th july till 24 th july and today the date is 21 of july but the school has decided to call the children still in school and make them study whereas the other schools have decided to give holiday. The N L dalmia high school of mira road had given holiday on 20th of july but on 21st they have not given whereas as other schools have already given holiday on the night of 20th of july.\nThis clearly tell that the school doesn't seems to respect the letter of the muncipal officer and even doest respect the government of maharastra.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1689901049.0,
    "convurl": "https://i.redd.it/9r3mj8xfv7db1.jpg",
    "comments": [],
    "cleaned_text": "schools still open letter municipal community given strick orders red alert thane area still reputable respectable school ranks india maharashtra going letter thane collectors officer scenario mumbai red alert th july till th july today date july school decided call children still school make study whereas schools decided give holiday n l dalmia high school mira road given holiday th july st given whereas schools already given holiday night th july clearly tell school doesnt seems respect letter muncipal officer even doest respect government maharastra ",
    "cleaned_title": "schools still open",
    "cleaned_selftext": "letter municipal community given strick orders red alert thane area still reputable respectable school ranks india maharashtra going letter thane collectors officer scenario mumbai red alert th july till th july today date july school decided call children still school make study whereas schools decided give holiday n l dalmia high school mira road given holiday th july st given whereas schools already given holiday night th july clearly tell school doesnt seems respect letter muncipal officer even doest respect government maharastra",
    "cleaned_comments": "",
    "light_cleaned_title": "The schools are still open",
    "light_cleaned_selftext": "In this letter the municipal community has given strick orders for red alert in thane area. But still a very reputable and a respectable school which ranks 2 all over India and 1 all over maharashtra is going against the letter of thane collectors officer. The scenario is in mumbai is we have red alert from 20th july till 24 th july and today the date is 21 of july but the school has decided to call the children still in school and make them study whereas the other schools have decided to give holiday. The N L dalmia high school of mira road had given holiday on 20th of july but on 21st they have not given whereas as other schools have already given holiday on the night of 20th of july. This clearly tell that the school doesn't seems to respect the letter of the muncipal officer and even doest respect the government of maharastra.",
    "light_cleaned_comments": ""
}