{
    "id": "1eph6iu",
    "title": "This is happening, stay alert.",
    "url": "https://www.reddit.com/gallery/1eph6iu",
    "selftext": "Targeting teens and college goers. \n\nThe vagueness of thr replies makes me think the scammer is also a teen.",
    "flair": "Crime",
    "score": 66,
    "num_comments": 19,
    "created_utc": 1723370114.0,
    "convurl": "https://i.redd.it/tn5iqv45c0id1.png",
    "comments": [
        "Add reliable source please. ",
        "The source is my DM.",
        "Report to policee please and ban n report the account. ",
        "\"And many more things to make a teenager addict\"'\n\nLMAO.",
        "See his coverage...even escobar didn't have such range!",
        "Not a teen here. Already done the basics.",
        "The dealer is the real-life personification of \"Source: Trust me, bro.\"",
        "\"HA BHAI MAI BHI HAI NARCOS\" won",
        "Order some from him and let us know the result, if you go to jail we'll know where to buy weed from 👀👀👀",
        "Cash on delivery hai kya? :)",
        "He found the loophole! 😂😂 sea cargo!",
        "Bob marley ki gaand marley",
        "\"We provide tracking details as soon as you place your orders\" - lmaooo.\n\nFor customs and police to easily track you down.",
        "Trust Me Br0",
        "Bitcoin chalega",
        "Any Handle with username starting with @@crypto is fake lmaoo",
        "A few years ago i bought my weed in dark web stores. Honestly i was suprised, it was like a real  store where every seller had reviews and advertised themselves. Packages came from my continent and from out of continent and it worked out every time gladly. But it still didnt feel safe and paying in bitcoin is a hassle."
    ],
    "cleaned_text": "happening stay alert targeting teens college goers vagueness thr replies makes think scammer also teen ",
    "cleaned_title": "happening stay alert",
    "cleaned_selftext": "targeting teens college goers vagueness thr replies makes think scammer also teen",
    "cleaned_comments": "add reliable source please source dm report policee please ban n report account many things make teenager addict lmao see coverageeven escobar didnt range teen already done basics dealer reallife personification source trust bro ha bhai mai bhi hai narcos order let us know result go jail well know buy weed cash delivery hai kya found loophole sea cargo bob marley ki gaand marley provide tracking details soon place orders lmaooo customs police easily track trust br bitcoin chalega handle username starting crypto fake lmaoo years ago bought weed dark web stores honestly suprised like real store every seller reviews advertised packages came continent continent worked every time gladly still didnt feel safe paying bitcoin hassle",
    "light_cleaned_title": "This is happening, stay alert.",
    "light_cleaned_selftext": "Targeting teens and college goers. The vagueness of thr replies makes me think the scammer is also a teen.",
    "light_cleaned_comments": "Add reliable source please. The source is my DM. Report to policee please and ban n report the account. \"And many more things to make a teenager addict\"' LMAO. See his coverage...even escobar didn't have such range! Not a teen here. Already done the basics. The dealer is the real-life personification of \"Source: Trust me, bro.\" \"HA BHAI MAI BHI HAI NARCOS\" won Order some from him and let us know the result, if you go to jail we'll know where to buy weed from 👀👀👀 Cash on delivery hai kya? :) He found the loophole! 😂😂 sea cargo! Bob marley ki gaand marley \"We provide tracking details as soon as you place your orders\" - lmaooo. For customs and police to easily track you down. Trust Me Br0 Bitcoin chalega Any Handle with username starting with @@crypto is fake lmaoo A few years ago i bought my weed in dark web stores. Honestly i was suprised, it was like a real store where every seller had reviews and advertised themselves. Packages came from my continent and from out of continent and it worked out every time gladly. But it still didnt feel safe and paying in bitcoin is a hassle."
}