{
    "id": "146o0p8",
    "title": "Absolutely fascinating graphs from a paper I came across today. Sportspersons in India are cowards and do not address political issues on social media except to wish Modi a happy birthday",
    "url": "https://www.reddit.com/gallery/146o0p8",
    "selftext": "I understand it's not a fair comparison with the US but to just engage with politicians only when it's someone's birthday really screams of an authoritarian government that's succeeded in putting it's people in place. Source - https://onlinelibrary.wiley.com/doi/full/10.1111/1758-5899.13164",
    "flair": "Politics",
    "score": 136,
    "num_comments": 12,
    "created_utc": 1686470440.0,
    "convurl": "https://i.redd.it/yadjz1bhic5b1.png",
    "comments": [
        "When there are people like Brij Bhushan and Jay Shah sitting at the top of Indian sports organisation, what else can we expect from them.",
        "Take a look at the y axis in the first image you shared. The one with US athletes, the highest is 30 and it spiked to 20 for George floyds death. However, in the indian graph, 70 is the highest and the tweets  reach around 20 very commonly. It is not that indian athletes are cowards, but it most certainly is that you are drawing incorrect conclusions from the data.",
        "Because all these celebrities in India have their names in Panama, Pandora paper leaks. They want to evade taxes and don't want the government to fuck them up.",
        "Bootlickers are rewarded in India.\n\nIt’s always been like that.",
        "Why'd anyone fuck up their livelihoods for some meaningless brownie points? Seems understandable",
        "But is your point that they have an obligation to comment on political stuff?",
        "Probably because not wishing Modi happy birthday would endanger their careers.",
        "https://youtu.be/v4TgsqfIbs8",
        "I don't agree so much because the Y-scale of the USA graph is 5 per cm and for India it's 10 per cm. So try to make the scale equal for both X and Y axes.\n\nAnd after that try to overlap both the graphs together with different colours and then see the results",
        "US has first amendment and a lot of other tools that protect you when you are on the wrong side of the government. Also I would rather have them do something concrete (collaborate with NGOs, promote sports, etc.) than virtue signal on Social media (including birthday wishes).",
        "Not about protection enshrined in our statutes. We certainly have the protection in our legal codes too but the enforceability is too poor. Also, our cancel culture is very very toxic. I sympathize with our sportspersons for this reason only. They stand to lose a lot if they voice their opinions out openly"
    ],
    "cleaned_text": "absolutely fascinating graphs paper came across today sportspersons india cowards address political issues social media except wish modi happy birthday understand fair comparison us engage politicians someones birthday really screams authoritarian government thats succeeded putting people place source ",
    "cleaned_title": "absolutely fascinating graphs paper came across today sportspersons india cowards address political issues social media except wish modi happy birthday",
    "cleaned_selftext": "understand fair comparison us engage politicians someones birthday really screams authoritarian government thats succeeded putting people place source",
    "cleaned_comments": "people like brij bhushan jay shah sitting top indian sports organisation else expect take look axis first image shared one us athletes highest spiked george floyds death however indian graph highest tweets reach around commonly indian athletes cowards certainly drawing incorrect conclusions data celebrities india names panama pandora paper leaks want evade taxes dont want government fuck bootlickers rewarded india always like whyd anyone fuck livelihoods meaningless brownie points seems understandable point obligation comment political stuff probably wishing modi happy birthday would endanger careers dont agree much yscale usa graph per cm india per cm try make scale equal x axes try overlap graphs together different colours see results us first amendment lot tools protect wrong side government also would rather something concrete collaborate ngos promote sports etc virtue signal social media including birthday wishes protection enshrined statutes certainly protection legal codes enforceability poor also cancel culture toxic sympathize sportspersons reason stand lose lot voice opinions openly",
    "light_cleaned_title": "Absolutely fascinating graphs from a paper I came across today. Sportspersons in India are cowards and do not address political issues on social media except to wish Modi a happy birthday",
    "light_cleaned_selftext": "I understand it's not a fair comparison with the US but to just engage with politicians only when it's someone's birthday really screams of an authoritarian government that's succeeded in putting it's people in place. Source -",
    "light_cleaned_comments": "When there are people like Brij Bhushan and Jay Shah sitting at the top of Indian sports organisation, what else can we expect from them. Take a look at the y axis in the first image you shared. The one with US athletes, the highest is 30 and it spiked to 20 for George floyds death. However, in the indian graph, 70 is the highest and the tweets reach around 20 very commonly. It is not that indian athletes are cowards, but it most certainly is that you are drawing incorrect conclusions from the data. Because all these celebrities in India have their names in Panama, Pandora paper leaks. They want to evade taxes and don't want the government to fuck them up. Bootlickers are rewarded in India. It’s always been like that. Why'd anyone fuck up their livelihoods for some meaningless brownie points? Seems understandable But is your point that they have an obligation to comment on political stuff? Probably because not wishing Modi happy birthday would endanger their careers. I don't agree so much because the Y-scale of the USA graph is 5 per cm and for India it's 10 per cm. So try to make the scale equal for both X and Y axes. And after that try to overlap both the graphs together with different colours and then see the results US has first amendment and a lot of other tools that protect you when you are on the wrong side of the government. Also I would rather have them do something concrete (collaborate with NGOs, promote sports, etc.) than virtue signal on Social media (including birthday wishes). Not about protection enshrined in our statutes. We certainly have the protection in our legal codes too but the enforceability is too poor. Also, our cancel culture is very very toxic. I sympathize with our sportspersons for this reason only. They stand to lose a lot if they voice their opinions out openly"
}