{
    "id": "168nr8w",
    "title": "Carrying Apple Watch to India",
    "url": "https://www.reddit.com/r/india/comments/168nr8w/carrying_apple_watch_to_india/",
    "selftext": "I'm bringing an Apple Watch to India from the US. It is new, in an unopened box. \n\nFrom what I read so far, coupled with friends' experiences, is that the contents have to be removed from the box, and I cannot carry the box with me, in order to avoid customs fee. \n\nHowever, I also noticed that the Indian Customs do not have a specific law for watches, and that I can carry the sealed box, [so long as it does not exceed 50k INR](https://www.nriguides.com/indian-customs-rules-for-electronic-items/#:~:text=Indian%20Customs%20have%20no%20special,for%20passengers%20bringing%20wrist%20watches.) in value. More details [here by the New Delhi Airport.](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.newdelhiairport.in/media/1465/guide_for_travellers_v5-customs-document.pdf&ved=2ahUKEwjt16zc0I2BAxUoGDQIHU8sAzsQFnoECBwQAQ&usg=AOvVaw3qcJme0khk77RO6fs4ytRs).\n\nWould love to hear from others with a similar experience and what you did to circumvent customs duty.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693716413.0,
    "convurl": "https://external-preview.redd.it/locb6ec37HrV7EJV7j4G5CTb2j0h2X166ReyQHAGWlg.jpg?auto=webp&s=c22f6c1de72d19b96c8fa97a24fa3185d741c309",
    "comments": [
        "Yeah, I'm pretty sure they'll hit you with ridiculous customs fees. Just remove the watch, set it up, and pretend like you're using it. You can carry the box in your baggage, just don't have the watch in there.\n\nIn most cases, customs doesn't bother checking AFAIK. Just walk through the green channel.",
        "Just wear it.",
        "Take it out of the box and carry the box plus accessories separately (in two separate bags if possible), if you don't want to wear it. While there isn't a law on watches, how comfortable are you in arguing this with the 🛃 official at Delhi Airport?"
    ],
    "cleaned_text": "carrying apple watch india im bringing apple watch india us new unopened box read far coupled friends experiences contents removed box carry box order avoid customs fee however also noticed indian customs specific law watches carry sealed box long exceed k inrhttpswwwnriguidescomindiancustomsrulesforelectronicitemstextindiancustomshavenospecialforpassengersbringingwristwatches value details new delhi airporthttpswwwgooglecomurlsatsourcewebrctjopiurlhttpswwwnewdelhiairportinmediaguidefortravellersvcustomsdocumentpdfvedahukewjtzcibaxuogdqihusazsqfnoecbwqaqusgaovvawqcjmekhkrofsytrs would love hear others similar experience circumvent customs duty ",
    "cleaned_title": "carrying apple watch india",
    "cleaned_selftext": "im bringing apple watch india us new unopened box read far coupled friends experiences contents removed box carry box order avoid customs fee however also noticed indian customs specific law watches carry sealed box long exceed k inrhttpswwwnriguidescomindiancustomsrulesforelectronicitemstextindiancustomshavenospecialforpassengersbringingwristwatches value details new delhi airporthttpswwwgooglecomurlsatsourcewebrctjopiurlhttpswwwnewdelhiairportinmediaguidefortravellersvcustomsdocumentpdfvedahukewjtzcibaxuogdqihusazsqfnoecbwqaqusgaovvawqcjmekhkrofsytrs would love hear others similar experience circumvent customs duty",
    "cleaned_comments": "yeah im pretty sure theyll hit ridiculous customs fees remove watch set pretend like youre using carry box baggage dont watch cases customs doesnt bother checking afaik walk green channel wear take box carry box plus accessories separately two separate bags possible dont want wear isnt law watches comfortable arguing official delhi airport",
    "light_cleaned_title": "Carrying Apple Watch to India",
    "light_cleaned_selftext": "I'm bringing an Apple Watch to India from the US. It is new, in an unopened box. From what I read so far, coupled with friends' experiences, is that the contents have to be removed from the box, and I cannot carry the box with me, in order to avoid customs fee. However, I also noticed that the Indian Customs do not have a specific law for watches, and that I can carry the sealed box, [so long as it does not exceed 50k INR](https://www.nriguides.com/indian-customs-rules-for-electronic-items/#:~:text=Indian%20Customs%20have%20no%20special,for%20passengers%20bringing%20wrist%20watches.) in value. More details [here by the New Delhi Airport.](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.newdelhiairport.in/media/1465/guide_for_travellers_v5-customs-document.pdf&ved=2ahUKEwjt16zc0I2BAxUoGDQIHU8sAzsQFnoECBwQAQ&usg=AOvVaw3qcJme0khk77RO6fs4ytRs). Would love to hear from others with a similar experience and what you did to circumvent customs duty.",
    "light_cleaned_comments": "Yeah, I'm pretty sure they'll hit you with ridiculous customs fees. Just remove the watch, set it up, and pretend like you're using it. You can carry the box in your baggage, just don't have the watch in there. In most cases, customs doesn't bother checking AFAIK. Just walk through the green channel. Just wear it. Take it out of the box and carry the box plus accessories separately (in two separate bags if possible), if you don't want to wear it. While there isn't a law on watches, how comfortable are you in arguing this with the 🛃 official at Delhi Airport?"
}