{
    "id": "169s0rm",
    "title": "Thoughtful gifts for girlfriend",
    "url": "https://www.reddit.com/r/india/comments/169s0rm/thoughtful_gifts_for_girlfriend/",
    "selftext": "My (27M) girlfriend's (26F) birthday is in a month and I'd like to buy something thoughtful for her. She really knocked it out of the park on my birthday when she got me a cake with a painting I made as frosting and knitted us as figures on a boat in a lake.\n\nHer birthday is in 1.5 months and I'd like to buy her something and do something special too. I could use a few ideas for the same.\n\nFor the gifts, I really liked the ones here: [https://www.oyehappy.com/](https://www.oyehappy.com/)  \nIt allows you to name a star after someone, give locked gifts whose codes are given over the span of 24 hours from loved ones, etc. I was wondering if anyone here knew of more stores like this.\n\nShe loves aesthetic lighting and interior design, books (mostly self-help and women-centric fiction),  and Delhi.\n\nI don't really have a budget but anything under 20k should be good to go.\n\nAppreciate any suggestions, thank you!",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693834086.0,
    "convurl": "https://external-preview.redd.it/XtUZuI7v1iukAg4J5FG_C_Zk8BBRytpq0XLJvIQ_OK0.jpg?auto=webp&s=b6dc9f5e9a5319c44b19fea930e22471f54c1763",
    "comments": [
        "Give me the 20K and I will personally go and sing the happy birthday song for her.",
        "Bro it's not about money but you can gift her a bracelet or pendant (2-3k) if she like in which she can see a pic of both of u and also something and a customized chocolate gift box ig u know which are shown on insta\n\nYou can even get a customized toy statue of both of you and gift her(this would be the best in my opinion)\n \nI hope it would help",
        "Do you know where I can get the toy statue made?",
        "I am a firm believer of getting multiple gifts over one huge gift. My suggestion would be to note down her likes and dislikes and try to find something meaningful from that.\nI was recently looking for a birthday gift for my friend and came across personalised neon led signs. Maybe your girlfriend would be into that.\nYou could also get a special edition of her favourite book.",
        "I saw it on insta recently  but can't remember the website name, I would reply If I get it again",
        "Mein 2k me karega",
        "Sounds good, thanks!",
        "Sounds super cool! Will look into it :))",
        "https://gulbonda.com/homepage-2/?fbclid=PAAaaAcvz8iKF2mc_902qWDjRywdfe1EUJuQMl9xkjd_8-pl9z77PrneRHVXg_aem_AcYLLutSY22djmpBZdVmD5mOeCjak3_pptWe_qT6S6IMPPwsoGvMEJ0bMHOLoWPU7SSJ3GK0hNFRgITkAn542h7Q\n\nHere is the link. I m sure ur better half would love it 😂😂...",
        "Hey! You can buy forever flowers for her which are knitted. A bouquet would cost around 2 k. You can check out Vishwa Narwal's page on insta.",
        "Thissssss 🤌🏼",
        "Don't buy things that will perish/get over very easily (flowers, chocolates, etc). Buy a flowering plant that will easily survive indoors and needs less water. She will remember you everyday when she sees the plant or waters it.\n\nAlong with material gifts, you can add a handwritten letter of how she makes you feel, great things about her and more. Trust me...this will be greater than any gift you can pay for.",
        "150 rupya dega",
        "You can buy customised dainty jewellery. .zodiac pendant or an alphabet ring. Missdainty_co, the_envyhouse has beautiful pieces. \nYou can also consider booking couple's spa a day before or after the birthday.",
        "Sirf first 2 line gayega phir mein.",
        "Buy gold or silver. Or at least spend half your money on it. Everything else is fleeting or is a wasteful purchase. Only gold/silver will appreciate in value and will be held on and remembered forever.",
        "First of all, naming a star is a scam. \nRead more here - https://www.iau.org/public/themes/buying_star_names/#:~:text=Acknowledgements-,Introduction,formal%20or%20official%20validity%20whatsoever.\n\nIAU is the only organisation that can do it officially and they do not support these things.\n\nSecondly, apart from an actual thing, think about some experiences may be? A couple spa/a cute game of treasure hunt/a series of letters or podcast episodes done by you etc.",
        "Rich PPL problem",
        "I make customised portraits, if you are interested :)",
        "Can you please tell me from where you got the personalised neon led sign? ",
        "price??",
        "Depends on the type and size of the portrait. You can DM me to discuss more :)",
        "Fluffyflowa.com has decent crochet flowers. Made a great gift"
    ],
    "cleaned_text": "thoughtful gifts girlfriend girlfriends f birthday month id like buy something thoughtful really knocked park birthday got cake painting made frosting knitted us figures boat lake birthday months id like buy something something special could use ideas gifts really liked ones httpswwwoyehappycomhttpswwwoyehappycom allows name star someone give locked gifts whose codes given span hours loved ones etc wondering anyone knew stores like loves aesthetic lighting interior design books mostly selfhelp womencentric fiction delhi dont really budget anything k good go appreciate suggestions thank ",
    "cleaned_title": "thoughtful gifts girlfriend",
    "cleaned_selftext": "girlfriends f birthday month id like buy something thoughtful really knocked park birthday got cake painting made frosting knitted us figures boat lake birthday months id like buy something something special could use ideas gifts really liked ones httpswwwoyehappycomhttpswwwoyehappycom allows name star someone give locked gifts whose codes given span hours loved ones etc wondering anyone knew stores like loves aesthetic lighting interior design books mostly selfhelp womencentric fiction delhi dont really budget anything k good go appreciate suggestions thank",
    "cleaned_comments": "give k personally go sing happy birthday song bro money gift bracelet pendant k like see pic u also something customized chocolate gift box ig u know shown insta even get customized toy statue gift herthis would best opinion hope would help know get toy statue made firm believer getting multiple gifts one huge gift suggestion would note likes dislikes try find something meaningful recently looking birthday gift friend came across personalised neon led signs maybe girlfriend would could also get special edition favourite book saw insta recently cant remember website name would reply get mein k karega sounds good thanks sounds super cool look link sure ur better half would love hey buy forever flowers knitted bouquet would cost around k check vishwa narwals page insta thissssss dont buy things perishget easily flowers chocolates etc buy flowering plant easily survive indoors needs less water remember everyday sees plant waters along material gifts add handwritten letter makes feel great things trust methis greater gift pay rupya dega buy customised dainty jewellery zodiac pendant alphabet ring missdaintyco theenvyhouse beautiful pieces also consider booking couples spa day birthday sirf first line gayega phir mein buy gold silver least spend half money everything else fleeting wasteful purchase goldsilver appreciate value held remembered forever first naming star scam read iau organisation officially support things secondly apart actual thing think experiences may couple spaa cute game treasure hunta series letters podcast episodes done etc rich ppl problem make customised portraits interested please tell got personalised neon led sign price depends type size portrait dm discuss fluffyflowacom decent crochet flowers made great gift",
    "light_cleaned_title": "Thoughtful gifts for girlfriend",
    "light_cleaned_selftext": "My (27M) girlfriend's (26F) birthday is in a month and I'd like to buy something thoughtful for her. She really knocked it out of the park on my birthday when she got me a cake with a painting I made as frosting and knitted us as figures on a boat in a lake. Her birthday is in 1.5 months and I'd like to buy her something and do something special too. I could use a few ideas for the same. For the gifts, I really liked the ones here: [https://www.oyehappy.com/](https://www.oyehappy.com/) It allows you to name a star after someone, give locked gifts whose codes are given over the span of 24 hours from loved ones, etc. I was wondering if anyone here knew of more stores like this. She loves aesthetic lighting and interior design, books (mostly self-help and women-centric fiction), and Delhi. I don't really have a budget but anything under 20k should be good to go. Appreciate any suggestions, thank you!",
    "light_cleaned_comments": "Give me the 20K and I will personally go and sing the happy birthday song for her. Bro it's not about money but you can gift her a bracelet or pendant (2-3k) if she like in which she can see a pic of both of u and also something and a customized chocolate gift box ig u know which are shown on insta You can even get a customized toy statue of both of you and gift her(this would be the best in my opinion) I hope it would help Do you know where I can get the toy statue made? I am a firm believer of getting multiple gifts over one huge gift. My suggestion would be to note down her likes and dislikes and try to find something meaningful from that. I was recently looking for a birthday gift for my friend and came across personalised neon led signs. Maybe your girlfriend would be into that. You could also get a special edition of her favourite book. I saw it on insta recently but can't remember the website name, I would reply If I get it again Mein 2k me karega Sounds good, thanks! Sounds super cool! Will look into it :)) Here is the link. I m sure ur better half would love it 😂😂... Hey! You can buy forever flowers for her which are knitted. A bouquet would cost around 2 k. You can check out Vishwa Narwal's page on insta. Thissssss 🤌🏼 Don't buy things that will perish/get over very easily (flowers, chocolates, etc). Buy a flowering plant that will easily survive indoors and needs less water. She will remember you everyday when she sees the plant or waters it. Along with material gifts, you can add a handwritten letter of how she makes you feel, great things about her and more. Trust me...this will be greater than any gift you can pay for. 150 rupya dega You can buy customised dainty jewellery. .zodiac pendant or an alphabet ring. Missdainty_co, the_envyhouse has beautiful pieces. You can also consider booking couple's spa a day before or after the birthday. Sirf first 2 line gayega phir mein. Buy gold or silver. Or at least spend half your money on it. Everything else is fleeting or is a wasteful purchase. Only gold/silver will appreciate in value and will be held on and remembered forever. First of all, naming a star is a scam. Read more here - IAU is the only organisation that can do it officially and they do not support these things. Secondly, apart from an actual thing, think about some experiences may be? A couple spa/a cute game of treasure hunt/a series of letters or podcast episodes done by you etc. Rich PPL problem I make customised portraits, if you are interested :) Can you please tell me from where you got the personalised neon led sign? price?? Depends on the type and size of the portrait. You can DM me to discuss more :) Fluffyflowa.com has decent crochet flowers. Made a great gift"
}