{
    "id": "1ayaevr",
    "title": "Urgent Please read: Exposing Scam by Tuetal and Kunal Sharma - Seeking Support and Legal Action",
    "url": "https://www.reddit.com/r/india/comments/1ayaevr/urgent_please_read_exposing_scam_by_tuetal_and/",
    "selftext": "Hey everyone,\n\nI need your help with something really important. My friend and a bunch of others got roped into a shady deal and got scammed by a company on Linkedin called Tuetal whose founder is Kunal Sharma.  \n\n\n**\\*\\*All necessary links are in comments due to post policies\\*\\***\n\n  \n**Background:**  \n\n\nSo my close friend who is in first year saw a job ad on linkedin for a Subject Matter Expert role at Tuetal, a company supposedly making educational stuff for edtech companies like doubtnut, Chegg and others.   \nUpon applying, she received a message after a day indicating that she had been selected for further rounds of interviews. Subsequently, she was added to a WhatsApp group with over 95 members, After a couple of days a general induction meeting was held on google meet.  \n\n\nDuring this meeting, it was revealed that Tuetal was handling a project for Numerade (US based edtech company) and employees were required to create digital video solutions for educational questions of class 11th and 12th using a pentab (digital stylus pad) and a mic on Microsoft One-note.  \nTo proceed to the next round and get selected eventually, applicants were required to submit a demo video which obviously needed the pentab. So Kunal sharma proposed that you can buy a pentab from our company Tuetal in a cheaper price from other marketplaces as they order pentabs in bulk for their employees from China so it'd be a better deal for them and in case you are not selected then the company will initiate a refund amount to the applicant.  \n\n\n My friend, along with many others, paid ₹5,100 to Kunal Sharma for the pentab and received an order confirmation email from their company email stating that the pentab would be delivered within 15-20 days. However, after 20 days passed, there was still no sign of the pentab, nor any update from the company.\n\nUpon inquiry, Kunal Sharma mentioned that there was an issue with the seller, and the delivery was expected to be delayed by 7 days. Another 7 days went by, yet there were still no signs of the pentab or any updates. The same excuse was given, citing customs issues as the reason for the delay due to the shipment originating from China. They requested an additional 3-4 days for the delivery.\n\nAfter a week had passed with no resolution, my friend, frustrated with the situation, emailed the company to withdraw her application and initiate a refund. The company agreed to refund the amount and assured that it would be credited back to her bank account within 4-6 working days.\n\nIt has been over 5 months, and there are still no signs of the pentab. Despite continuous inquiries, all she receives are excuses and lies from the company, along with promises of future dates for delivery. They claim there is an issue with the seller and that they are unable to refund our amount, requesting cooperation and from past one month he has stopped replying and picking up calls.\n\nNow, my friend is in mental agony. This was her mother's hard-earned money, and with no father to support them, her mother bears the responsibility of the family's financial needs. My friend took up the job to support herself in college, only to end up being scammed and losing her money in the process along with many others.  \n\n\nThere are over 50-60 posts on Linkedin, 5-6 posts on Quora, and a few on Twitter from different people who applied for the job at Tuetal and were scammed by this guy, Kunal Sharma, who seems to be just a 12th pass and a failed incel JEE aspirant from his twitter replies.  \nNow, while these are the number of people who have come forward and shared their experiences, there are undoubtedly many more who have been affected by this scam. What's even more concerning is that despite all these complaints, Kunal Sharma is still posting job openings on linkedin. Additionally, from Quora posts, it was discovered that he didn't pay any amounts to other HR interns and individuals associated with his scam company.   \n\n\nEstimating the scale of this scam, my friend discovered, through conversations with different people on LinkedIn who were also victims, that this guy, Kunal Sharma, took varying amounts from different individuals based on their vulnerability. Some were charged ₹7,000, while others were charged ₹3,000 or ₹5,000. Even if we conservatively estimate that 70 people were scammed (though there are likely over 200) and taking an average amount of ₹4,500 from each victim, the total amount comes to ₹3,15,000 (Its the bare minimum, the amount must be definitely over 5-6lakhs)\n\nThis scam has been ongoing for over 7-8 months now. To verify the extent of the scam, we even attempted to apply for their recent job posting, which was posted just a week ago, as a dummy candidate. Surprisingly, we received the same message stating that we were being selected from a HR representative from Tuetal lol (who won't receive her pay as she also appears to be a college fresher based on her linkedin profile and might be unaware of this situation).  \n\n\nPlease its a humble request to help my friend and other victims by reporting this individual and providing guidance on possible legal actions that can be taken against him. My friend is also part of a WhatsApp group comprised of victims who are considering legal action, but they are feeling powerless as most of them are college students.\n\nI have attached all the relevant links and screenshots below.\n\nThank you for taking the time to read this.  \n\n\nhttps://preview.redd.it/0n5eqqs27ekc1.png?width=323&format=png&auto=webp&s=1815c3ff6279f46462393509ea9ba13e823486ba\n\nhttps://preview.redd.it/kg0rp5h37ekc1.png?width=1280&format=png&auto=webp&s=a9e8f80fefc90abcb9b0c74bd2d78edc29842905\n\nhttps://preview.redd.it/9bet7o447ekc1.png?width=347&format=png&auto=webp&s=195fac2a6b76b6c787bd6600fa447134428b900e\n\nhttps://preview.redd.it/37m6nyp47ekc1.png?width=559&format=png&auto=webp&s=0819161e200b8a0ba52b655a7f80e11c22943d9e\n\nhttps://preview.redd.it/36hxl5t67ekc1.png?width=745&format=png&auto=webp&s=fc435458bcacbaee97bc3fa0b364be321fe0cd77\n\nhttps://preview.redd.it/561jt5o77ekc1.png?width=277&format=png&auto=webp&s=3fa630642caee5de438204a5f9010ec795af3637\n\nhttps://preview.redd.it/aiv21h987ekc1.png?width=508&format=png&auto=webp&s=08ad4c0588a9b985401bd1bb8d6d8ac518570dd1\n\nhttps://preview.redd.it/afmkrd097ekc1.png?width=652&format=png&auto=webp&s=2f3a62522bb489d82c459550c9549270fdfe624a\n\nhttps://preview.redd.it/2b2dsvl97ekc1.png?width=642&format=png&auto=webp&s=8d66fd096720892e4e6775de8e01d0e9eb846827\n\nhttps://preview.redd.it/w5f1aiy97ekc1.png?width=597&format=png&auto=webp&s=0dce248f05bcda7fdf3b05ea09cc48d7e7d91897\n\n  \n",
    "flair": "Crime",
    "score": 73,
    "num_comments": 5,
    "created_utc": 1708719167.0,
    "convurl": "https://b.thumbs.redditmedia.com/57qBjf0kCLq8UFVYEQwJYXfh3tfwAXku7cVbnp2KnHc.jpg",
    "comments": [
        "Can't post linkedin links due to content policies so please go through these imgur screenshots to the linkedin profiles:  \n\n\n[Tuetal's Linkedin page](https://imgur.com/a/NLDzRY4)  \n[Kunal Sharma's Linkedin](https://imgur.com/a/guvz2op)  \n[Kunal Sharma's Twitter](https://imgur.com/a/KXGE5HO)\n\n  \n[Tuetal's youtube paid promotion videos- Check comments](https://www.youtube.com/watch?v=gQLYJpV-jzo)  \nCheck quora posts too by searching \"tuetal quora\" (can't post a link here)",
        "ANY job interview where YOU pay ANY money to the company is a scam. Looks like this main business is to sell pentabs not edtech. ",
        "Try collecting all the evidence and file a consumer affairs complaint"
    ],
    "cleaned_text": "urgent please read exposing scam tuetal kunal sharma seeking support legal action hey everyone need help something really important friend bunch others got roped shady deal got scammed company linkedin called tuetal whose founder kunal sharma necessary links comments due post policies background close friend first year saw job ad linkedin subject matter expert role tuetal company supposedly making educational stuff edtech companies like doubtnut chegg others upon applying received message day indicating selected rounds interviews subsequently added whatsapp group members couple days general induction meeting held google meet meeting revealed tuetal handling project numerade us based edtech company employees required create digital video solutions educational questions class th th using pentab digital stylus pad mic microsoft onenote proceed next round get selected eventually applicants required submit demo video obviously needed pentab kunal sharma proposed buy pentab company tuetal cheaper price marketplaces order pentabs bulk employees china itd better deal case selected company initiate refund amount applicant friend along many others paid kunal sharma pentab received order confirmation email company email stating pentab would delivered within days however days passed still sign pentab update company upon inquiry kunal sharma mentioned issue seller delivery expected delayed days another days went yet still signs pentab updates excuse given citing customs issues reason delay due shipment originating china requested additional days delivery week passed resolution friend frustrated situation emailed company withdraw application initiate refund company agreed refund amount assured would credited back bank account within working days months still signs pentab despite continuous inquiries receives excuses lies company along promises future dates delivery claim issue seller unable refund amount requesting cooperation past one month stopped replying picking calls friend mental agony mothers hardearned money father support mother bears responsibility familys financial needs friend took job support college end scammed losing money process along many others posts linkedin posts quora twitter different people applied job tuetal scammed guy kunal sharma seems th pass failed incel jee aspirant twitter replies number people come forward shared experiences undoubtedly many affected scam whats even concerning despite complaints kunal sharma still posting job openings linkedin additionally quora posts discovered didnt pay amounts hr interns individuals associated scam company estimating scale scam friend discovered conversations different people linkedin also victims guy kunal sharma took varying amounts different individuals based vulnerability charged others charged even conservatively estimate people scammed though likely taking average amount victim total amount comes bare minimum amount must definitely lakhs scam ongoing months verify extent scam even attempted apply recent job posting posted week ago dummy candidate surprisingly received message stating selected hr representative tuetal lol wont receive pay also appears college fresher based linkedin profile might unaware situation please humble request help friend victims reporting individual providing guidance possible legal actions taken friend also part whatsapp group comprised victims considering legal action feeling powerless college students attached relevant links screenshots thank taking time read ",
    "cleaned_title": "urgent please read exposing scam tuetal kunal sharma seeking support legal action",
    "cleaned_selftext": "hey everyone need help something really important friend bunch others got roped shady deal got scammed company linkedin called tuetal whose founder kunal sharma necessary links comments due post policies background close friend first year saw job ad linkedin subject matter expert role tuetal company supposedly making educational stuff edtech companies like doubtnut chegg others upon applying received message day indicating selected rounds interviews subsequently added whatsapp group members couple days general induction meeting held google meet meeting revealed tuetal handling project numerade us based edtech company employees required create digital video solutions educational questions class th th using pentab digital stylus pad mic microsoft onenote proceed next round get selected eventually applicants required submit demo video obviously needed pentab kunal sharma proposed buy pentab company tuetal cheaper price marketplaces order pentabs bulk employees china itd better deal case selected company initiate refund amount applicant friend along many others paid kunal sharma pentab received order confirmation email company email stating pentab would delivered within days however days passed still sign pentab update company upon inquiry kunal sharma mentioned issue seller delivery expected delayed days another days went yet still signs pentab updates excuse given citing customs issues reason delay due shipment originating china requested additional days delivery week passed resolution friend frustrated situation emailed company withdraw application initiate refund company agreed refund amount assured would credited back bank account within working days months still signs pentab despite continuous inquiries receives excuses lies company along promises future dates delivery claim issue seller unable refund amount requesting cooperation past one month stopped replying picking calls friend mental agony mothers hardearned money father support mother bears responsibility familys financial needs friend took job support college end scammed losing money process along many others posts linkedin posts quora twitter different people applied job tuetal scammed guy kunal sharma seems th pass failed incel jee aspirant twitter replies number people come forward shared experiences undoubtedly many affected scam whats even concerning despite complaints kunal sharma still posting job openings linkedin additionally quora posts discovered didnt pay amounts hr interns individuals associated scam company estimating scale scam friend discovered conversations different people linkedin also victims guy kunal sharma took varying amounts different individuals based vulnerability charged others charged even conservatively estimate people scammed though likely taking average amount victim total amount comes bare minimum amount must definitely lakhs scam ongoing months verify extent scam even attempted apply recent job posting posted week ago dummy candidate surprisingly received message stating selected hr representative tuetal lol wont receive pay also appears college fresher based linkedin profile might unaware situation please humble request help friend victims reporting individual providing guidance possible legal actions taken friend also part whatsapp group comprised victims considering legal action feeling powerless college students attached relevant links screenshots thank taking time read",
    "cleaned_comments": "cant post linkedin links due content policies please go imgur screenshots linkedin profiles tuetals linkedin pagehttpsimgurcomanldzry kunal sharmas linkedinhttpsimgurcomaguvzop kunal sharmas twitterhttpsimgurcomakxgeho tuetals youtube paid promotion videos check commentshttpswwwyoutubecomwatchvgqlyjpvjzo check quora posts searching tuetal quora cant post link job interview pay money company scam looks like main business sell pentabs edtech try collecting evidence file consumer affairs complaint",
    "light_cleaned_title": "Urgent Please read: Exposing Scam by Tuetal and Kunal Sharma - Seeking Support and Legal Action",
    "light_cleaned_selftext": "Hey everyone, I need your help with something really important. My friend and a bunch of others got roped into a shady deal and got scammed by a company on Linkedin called Tuetal whose founder is Kunal Sharma. **\\*\\*All necessary links are in comments due to post policies\\*\\*** **Background:** So my close friend who is in first year saw a job ad on linkedin for a Subject Matter Expert role at Tuetal, a company supposedly making educational stuff for edtech companies like doubtnut, Chegg and others. Upon applying, she received a message after a day indicating that she had been selected for further rounds of interviews. Subsequently, she was added to a WhatsApp group with over 95 members, After a couple of days a general induction meeting was held on google meet. During this meeting, it was revealed that Tuetal was handling a project for Numerade (US based edtech company) and employees were required to create digital video solutions for educational questions of class 11th and 12th using a pentab (digital stylus pad) and a mic on Microsoft One-note. To proceed to the next round and get selected eventually, applicants were required to submit a demo video which obviously needed the pentab. So Kunal sharma proposed that you can buy a pentab from our company Tuetal in a cheaper price from other marketplaces as they order pentabs in bulk for their employees from China so it'd be a better deal for them and in case you are not selected then the company will initiate a refund amount to the applicant. My friend, along with many others, paid ₹5,100 to Kunal Sharma for the pentab and received an order confirmation email from their company email stating that the pentab would be delivered within 15-20 days. However, after 20 days passed, there was still no sign of the pentab, nor any update from the company. Upon inquiry, Kunal Sharma mentioned that there was an issue with the seller, and the delivery was expected to be delayed by 7 days. Another 7 days went by, yet there were still no signs of the pentab or any updates. The same excuse was given, citing customs issues as the reason for the delay due to the shipment originating from China. They requested an additional 3-4 days for the delivery. After a week had passed with no resolution, my friend, frustrated with the situation, emailed the company to withdraw her application and initiate a refund. The company agreed to refund the amount and assured that it would be credited back to her bank account within 4-6 working days. It has been over 5 months, and there are still no signs of the pentab. Despite continuous inquiries, all she receives are excuses and lies from the company, along with promises of future dates for delivery. They claim there is an issue with the seller and that they are unable to refund our amount, requesting cooperation and from past one month he has stopped replying and picking up calls. Now, my friend is in mental agony. This was her mother's hard-earned money, and with no father to support them, her mother bears the responsibility of the family's financial needs. My friend took up the job to support herself in college, only to end up being scammed and losing her money in the process along with many others. There are over 50-60 posts on Linkedin, 5-6 posts on Quora, and a few on Twitter from different people who applied for the job at Tuetal and were scammed by this guy, Kunal Sharma, who seems to be just a 12th pass and a failed incel JEE aspirant from his twitter replies. Now, while these are the number of people who have come forward and shared their experiences, there are undoubtedly many more who have been affected by this scam. What's even more concerning is that despite all these complaints, Kunal Sharma is still posting job openings on linkedin. Additionally, from Quora posts, it was discovered that he didn't pay any amounts to other HR interns and individuals associated with his scam company. Estimating the scale of this scam, my friend discovered, through conversations with different people on LinkedIn who were also victims, that this guy, Kunal Sharma, took varying amounts from different individuals based on their vulnerability. Some were charged ₹7,000, while others were charged ₹3,000 or ₹5,000. Even if we conservatively estimate that 70 people were scammed (though there are likely over 200) and taking an average amount of ₹4,500 from each victim, the total amount comes to ₹3,15,000 (Its the bare minimum, the amount must be definitely over 5-6lakhs) This scam has been ongoing for over 7-8 months now. To verify the extent of the scam, we even attempted to apply for their recent job posting, which was posted just a week ago, as a dummy candidate. Surprisingly, we received the same message stating that we were being selected from a HR representative from Tuetal lol (who won't receive her pay as she also appears to be a college fresher based on her linkedin profile and might be unaware of this situation). Please its a humble request to help my friend and other victims by reporting this individual and providing guidance on possible legal actions that can be taken against him. My friend is also part of a WhatsApp group comprised of victims who are considering legal action, but they are feeling powerless as most of them are college students. I have attached all the relevant links and screenshots below. Thank you for taking the time to read this.",
    "light_cleaned_comments": "Can't post linkedin links due to content policies so please go through these imgur screenshots to the linkedin profiles: [Tuetal's Linkedin page](https://imgur.com/a/NLDzRY4) [Kunal Sharma's Linkedin](https://imgur.com/a/guvz2op) [Kunal Sharma's Twitter](https://imgur.com/a/KXGE5HO) [Tuetal's youtube paid promotion videos- Check comments](https://www.youtube.com/watch?v=gQLYJpV-jzo) Check quora posts too by searching \"tuetal quora\" (can't post a link here) ANY job interview where YOU pay ANY money to the company is a scam. Looks like this main business is to sell pentabs not edtech. Try collecting all the evidence and file a consumer affairs complaint"
}