{
    "id": "14a76y4",
    "title": "What's the point of board exams when you have to give JEE/NEET to get into IIT eitherway.Some kids even give up on their life after 12th failure blinded by upsetness and not seeing all the hardware their parentes put up for them.",
    "url": "https://www.reddit.com/r/india/comments/14a76y4/whats_the_point_of_board_exams_when_you_have_to/",
    "selftext": "Every year something like this happens. Sometimes it's teacher's failure to not teach students properly and segregate favourite students from rest of the class and there we go ! Another innocent life lost by failure . Last year when CBSE conducted board exams in 2 terms ,they also decide to experiment student's life by not giving students who failed in 3 subject to regive exam in the same year abd by also changing pattern in end time whereas these students were covid bacth their studies were hampered by covid lockdown . Those students who dropped 1 year for JEE preps and scored a little below 75% , IIT Guwahati in december told that it is reimplementing 75% criteria as if those students who gave exam in covid they were eliminated as if India is coming back to normal. Last year also because students did not get chance to reappear for exam because they failed in 2 or 3subjects , They to gave up and ended their life. People say one exam cannot define you then how was this allowed to happen? There have been some cases also where teacher after 1st term results said in front of class this kid won't pass in 2nd term in front of class that too calling that kid to extra class 3 days before final board exam i,e term 2 whereas he/she was made to prepare himself/herself in class because teacher refused to help. So what's the point of Conducting board exams? When students who should have gotten proper education were made victim to segregation because that one kid in class was given special attention just because that kid was somehow related to school director's grandson or relative and weak students whereas were cancelled from that classroom , sometimes these teacher did not even match the quality of teaching in renowned private school because they were undergraduate and were not good in bheaviour with others because of special kid in class as if that special kid related to school's director or principal is literally defining their jobs. Also what's the point of implementing 75% criteria in JEE/NEET whereas tech companies have clearely showed that wether you are from NIIT/IIT or private or governemnt college you are prone to loose your job. Some parents loose their only child because those chldren fail to see due to final class failure all the years of love and hardwork their parents had put behind them. After suffering seggregation they feel like they don't belong to this society and have failed their parents leaving them to not able to show their face in society. This one upsetting feeling that sinks their whole ship of a beautiful but also full of struggles life and their dreams that was waiting for them forward. \n\n[ ten ](https://preview.redd.it/nndajs8uk76b1.png?width=1920&format=png&auto=webp&v=enabled&s=33c88a441b18c49dc8bb3f535ba06b30c2cb4223)",
    "flair": "AskIndia",
    "score": 6,
    "num_comments": 3,
    "created_utc": 1686847447.0,
    "convurl": "https://b.thumbs.redditmedia.com/GeNEs7P_p2AvTlEG_MLzf1Chn0tA23g-1iFHmJzLQYo.jpg",
    "comments": [
        "This is really sad, exam boards or competitive exams cant judge once intelligence, attitude toward issues. Plus each year they are creating new nuisance for students to suffer.\n\nThese so called IITs or prime institutions are also good for nothing. Take the first rank holder in NIRF, IIT Madras so many suicide within an year. \n\nOur education system is so rigged, that’s why those who have money go abroad.",
        "The main problem is population. We need better sex ed."
    ],
    "cleaned_text": "whats point board exams give jeeneet get iit eitherwaysome kids even give life th failure blinded upsetness seeing hardware parentes put every year something like happens sometimes teachers failure teach students properly segregate favourite students rest class go another innocent life lost failure last year cbse conducted board exams terms also decide experiment students life giving students failed subject regive exam year abd also changing pattern end time whereas students covid bacth studies hampered covid lockdown students dropped year jee preps scored little iit guwahati december told reimplementing criteria students gave exam covid eliminated india coming back normal last year also students get chance reappear exam failed subjects gave ended life people say one exam define allowed happen cases also teacher st term results said front class kid wont pass nd term front class calling kid extra class days final board exam ie term whereas heshe made prepare himselfherself class teacher refused help whats point conducting board exams students gotten proper education made victim segregation one kid class given special attention kid somehow related school directors grandson relative weak students whereas cancelled classroom sometimes teacher even match quality teaching renowned private school undergraduate good bheaviour others special kid class special kid related schools director principal literally defining jobs also whats point implementing criteria jeeneet whereas tech companies clearely showed wether niitiit private governemnt college prone loose job parents loose child chldren fail see due final class failure years love hardwork parents put behind suffering seggregation feel like dont belong society failed parents leaving able show face society one upsetting feeling sinks whole ship beautiful also full struggles life dreams waiting forward ten httpspreviewredditnndajsukbpngwidthformatpngautowebpvenabledscabcdcbbfbabccb ",
    "cleaned_title": "whats point board exams give jeeneet get iit eitherwaysome kids even give life th failure blinded upsetness seeing hardware parentes put",
    "cleaned_selftext": "every year something like happens sometimes teachers failure teach students properly segregate favourite students rest class go another innocent life lost failure last year cbse conducted board exams terms also decide experiment students life giving students failed subject regive exam year abd also changing pattern end time whereas students covid bacth studies hampered covid lockdown students dropped year jee preps scored little iit guwahati december told reimplementing criteria students gave exam covid eliminated india coming back normal last year also students get chance reappear exam failed subjects gave ended life people say one exam define allowed happen cases also teacher st term results said front class kid wont pass nd term front class calling kid extra class days final board exam ie term whereas heshe made prepare himselfherself class teacher refused help whats point conducting board exams students gotten proper education made victim segregation one kid class given special attention kid somehow related school directors grandson relative weak students whereas cancelled classroom sometimes teacher even match quality teaching renowned private school undergraduate good bheaviour others special kid class special kid related schools director principal literally defining jobs also whats point implementing criteria jeeneet whereas tech companies clearely showed wether niitiit private governemnt college prone loose job parents loose child chldren fail see due final class failure years love hardwork parents put behind suffering seggregation feel like dont belong society failed parents leaving able show face society one upsetting feeling sinks whole ship beautiful also full struggles life dreams waiting forward ten httpspreviewredditnndajsukbpngwidthformatpngautowebpvenabledscabcdcbbfbabccb",
    "cleaned_comments": "really sad exam boards competitive exams cant judge intelligence attitude toward issues plus year creating new nuisance students suffer called iits prime institutions also good nothing take first rank holder nirf iit madras many suicide within year education system rigged thats money go abroad main problem population need better sex ed",
    "light_cleaned_title": "What's the point of board exams when you have to give JEE/NEET to get into IIT eitherway.Some kids even give up on their life after 12th failure blinded by upsetness and not seeing all the hardware their parentes put up for them.",
    "light_cleaned_selftext": "Every year something like this happens. Sometimes it's teacher's failure to not teach students properly and segregate favourite students from rest of the class and there we go ! Another innocent life lost by failure . Last year when CBSE conducted board exams in 2 terms ,they also decide to experiment student's life by not giving students who failed in 3 subject to regive exam in the same year abd by also changing pattern in end time whereas these students were covid bacth their studies were hampered by covid lockdown . Those students who dropped 1 year for JEE preps and scored a little below 75% , IIT Guwahati in december told that it is reimplementing 75% criteria as if those students who gave exam in covid they were eliminated as if India is coming back to normal. Last year also because students did not get chance to reappear for exam because they failed in 2 or 3subjects , They to gave up and ended their life. People say one exam cannot define you then how was this allowed to happen? There have been some cases also where teacher after 1st term results said in front of class this kid won't pass in 2nd term in front of class that too calling that kid to extra class 3 days before final board exam i,e term 2 whereas he/she was made to prepare himself/herself in class because teacher refused to help. So what's the point of Conducting board exams? When students who should have gotten proper education were made victim to segregation because that one kid in class was given special attention just because that kid was somehow related to school director's grandson or relative and weak students whereas were cancelled from that classroom , sometimes these teacher did not even match the quality of teaching in renowned private school because they were undergraduate and were not good in bheaviour with others because of special kid in class as if that special kid related to school's director or principal is literally defining their jobs. Also what's the point of implementing 75% criteria in JEE/NEET whereas tech companies have clearely showed that wether you are from NIIT/IIT or private or governemnt college you are prone to loose your job. Some parents loose their only child because those chldren fail to see due to final class failure all the years of love and hardwork their parents had put behind them. After suffering seggregation they feel like they don't belong to this society and have failed their parents leaving them to not able to show their face in society. This one upsetting feeling that sinks their whole ship of a beautiful but also full of struggles life and their dreams that was waiting for them forward. [ ten ](https://preview.redd.it/nndajs8uk76b1.png?width=1920&format=png&auto=webp&v=enabled&s=33c88a441b18c49dc8bb3f535ba06b30c2cb4223)",
    "light_cleaned_comments": "This is really sad, exam boards or competitive exams cant judge once intelligence, attitude toward issues. Plus each year they are creating new nuisance for students to suffer. These so called IITs or prime institutions are also good for nothing. Take the first rank holder in NIRF, IIT Madras so many suicide within an year. Our education system is so rigged, that’s why those who have money go abroad. The main problem is population. We need better sex ed."
}