{
    "id": "164rejl",
    "title": "'Vajpayee said PM will come and go, party will change, but nation will remain' : Nitin Gadkari",
    "url": "https://youtu.be/j4Zn4DW8auw?si=Ju1hun0cbtwZZcFQ",
    "selftext": "They gave Gadkari a softee",
    "flair": "Politics",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1693336410.0,
    "convurl": "https://external-preview.redd.it/dP-MxvoZp-n2zfTIJNvn2MHN7_XdQFKF_5BVYOgInRQ.jpg?auto=webp&s=6bcffcf20cd404d81aa349df7717a3fea884f7bc",
    "comments": [
        "Great job The Print team asking tough questions to Gadkari.\n\nThe interviewers were not at all prepared for any follow ups. The state of journalism is such anything a minister says is taken at face value without any counters at all. This interview was like customer made for Gadkari to come say what he wants and the journalists just kept nodding\n\nThey didn’t prepare well or do their homework. At the bare minimum they should have tried to research the average cost of such elevated roads in India and the world and then compare the 18 crore or 250 crore numbers. This was like the mango interview of Modi\n\nVery disappointed in The Print",
        "It's Print man. People don't accuse Shekhar Gupta of \"chaddi in closet\" for no reason.",
        "Which sting are you referring to?\n\nShekhar maybe closeted chaddi but he is very knowledgeable and has good connections everywhere. It is good to hear his perspectives but with a very large pinch of salt and pepper and …\n\nHe criticizes BJP and some of the religious goons out there but falls well short of open heartedly criticizing Modi’s responsibility in how the national institutions are being manipulated. He almost hero worships Modi",
        "I vaguely remember now. I don't remember exact details. He denied reporting on a sting, and when questioned about why, he quoted his organizations (print) rules. Fair.\n\nBut Print did a report on another sting operation, some time before or after that incident.",
        "As of now, PM stays... Everything changed."
    ],
    "cleaned_text": "vajpayee said pm come go party change nation remain nitin gadkari gave gadkari softee ",
    "cleaned_title": "vajpayee said pm come go party change nation remain nitin gadkari",
    "cleaned_selftext": "gave gadkari softee",
    "cleaned_comments": "great job print team asking tough questions gadkari interviewers prepared follow ups state journalism anything minister says taken face value without counters interview like customer made gadkari come say wants journalists kept nodding didnt prepare well homework bare minimum tried research average cost elevated roads india world compare crore crore numbers like mango interview modi disappointed print print man people dont accuse shekhar gupta chaddi closet reason sting referring shekhar maybe closeted chaddi knowledgeable good connections everywhere good hear perspectives large pinch salt pepper criticizes bjp religious goons falls well short open heartedly criticizing modis responsibility national institutions manipulated almost hero worships modi vaguely remember dont remember exact details denied reporting sting questioned quoted organizations print rules fair print report another sting operation time incident pm stays everything changed",
    "light_cleaned_title": "'Vajpayee said PM will come and go, party will change, but nation will remain' : Nitin Gadkari",
    "light_cleaned_selftext": "They gave Gadkari a softee",
    "light_cleaned_comments": "Great job The Print team asking tough questions to Gadkari. The interviewers were not at all prepared for any follow ups. The state of journalism is such anything a minister says is taken at face value without any counters at all. This interview was like customer made for Gadkari to come say what he wants and the journalists just kept nodding They didn’t prepare well or do their homework. At the bare minimum they should have tried to research the average cost of such elevated roads in India and the world and then compare the 18 crore or 250 crore numbers. This was like the mango interview of Modi Very disappointed in The Print It's Print man. People don't accuse Shekhar Gupta of \"chaddi in closet\" for no reason. Which sting are you referring to? Shekhar maybe closeted chaddi but he is very knowledgeable and has good connections everywhere. It is good to hear his perspectives but with a very large pinch of salt and pepper and … He criticizes BJP and some of the religious goons out there but falls well short of open heartedly criticizing Modi’s responsibility in how the national institutions are being manipulated. He almost hero worships Modi I vaguely remember now. I don't remember exact details. He denied reporting on a sting, and when questioned about why, he quoted his organizations (print) rules. Fair. But Print did a report on another sting operation, some time before or after that incident. As of now, PM stays... Everything changed."
}