{
    "id": "1buu5vb",
    "title": "Never travel with Lufthansa.",
    "url": "https://www.reddit.com/r/india/comments/1buu5vb/never_travel_with_lufthansa/",
    "selftext": "I will try to keep this as short as possible. \n\nI booked Mumbai-Amsterdam return flight with Lufthansa some 2.5 months back for me and my mom. The departure flight was on March 22, 2.55 AM. \n\nOn March 19, I got an email saying that the flight from Mumbai had been cancelled - [cancellation email](https://imgur.com/QsY3L4E). Roughly an hour later, I got an email saying that we have been rebooked for the same flight, but 24 hours later on March 23, 2.55AM - [rebooking email]\n(https://imgur.com/BF98JtW). \n\nI filled up this [form](https://www.lufthansa.com/az/en/compensation-in-the-event-of-flight-irregularities) to seek compensation, and this is the [email response](https://imgur.com/LeQ5g1e) I got. *The reason for the flight irregularity was lightning strike, which occurred immediately prior to take-off.* WTF?!?! I could not believe that Lufthansa would resolve to such outright lies just to avoid compensation. The cancellation happened nearly 3 days before the flight, and they say lightning strike?!? Besides, there was no lightning in Bombay in that timeframe, it was hot AF with no clouds even. \n\nSo, I sent an [email](https://imgur.com/5FkwwAr) calling them out. And guess what? They [doubled down](https://imgur.com/5r46lxS) on the lie. I know small companies lie all the time but Lufthansa, that too such a hopeless lie??!!? Fucking unbelievable. \n\nMind you, at no moment did I ask for a full compensation; I did not specify the amount anywhere, just only filled up the claim form. If you are wondering, yes we did lose money on 1 night hotel booking as we reached the next fucking day. We also could not do a couple of tourist attractions cos of that + rebooked onward journey was very hectic. I know recently there were a couple of posts on bad experiences with Lufthansa but unfortunately I had already booked my tickets by then. \n\nI have travelled with various middle east carriers before, and have even been in situations wherein flights were delayed/ cancelled. But not once did I ever encounter such a blatant and stupid lie justifying that. Lufthansa? Never again.",
    "flair": "Rant / Vent",
    "score": 70,
    "num_comments": 25,
    "created_utc": 1712154915.0,
    "convurl": "https://external-preview.redd.it/xLxxz-U5t7zcfnapkAH0N4m7Ii4wnfsSYZ4GJY2t2xg.jpg?auto=webp&s=6f78b8e722b3105af024dc127cb12e5da143a3ca",
    "comments": [
        "It is completely possible that your aircraft scheduled to fly that day had a lightening strike 3 days earlier in some other part of the world, leaving it inoperable. If you really want to call in their bluff, find the aircraft type followed by its registration number which was supposed to fly that day and see if there was an incident report filed by Lufthansa in the days leading to your trip.",
        "> It is completely possible that your aircraft scheduled to fly that day had a lightening strike 3 days earlier in some other part of the world, leaving it inoperable.\n\nI did consider this, but it implies that a carrier like Lufthansa could not find a replacement aircraft over a period of 3 days? That is very hard to believe. Additionally, the guy just skirts around the issue; never tells if there was actual damage to the plane which resulted in the cancellation. In his follow up response, he is even more vague on it and barely addresses it. \n\n> If you really want to call in their bluff, find the aircraft type followed by its registration number which was supposed to fly that day and see if there was an incident report filed by Lufthansa in the days leading to your trip.\n\nWhere can I get this information? I only have the flight number (LH 757)",
        "There are websites, firms through whom you can file a case for compensation. They will take 25% of your final settlement. It will take a long time but you will get the money! My flight from Denmark to Iceland got cancelled. Airline provided accomodation, food and flight for the next day, even then I got the compensation!",
        "Do you think airlines have empty/free carriers just standing there? How would they find the replacement aircraft in 3 days if all of them are pre booked?",
        "FWIW european carriers Lufthansa, Air France & KLM are regularly cancelling flights to/from Mumbai. Happened to me 2 times in past 6 months. No explanation given. \n\nMaybe its due to pilot shortage, equipment issues, geo-political problems (they fly over middle east).\n\nSomeone should definitely investigate the reasons. It’s happening quite frequently.",
        "Lmao, I empathize with your situation. But airlines don't have a 787 Dreamliner that's just laying around to compensate for flight cancellations/delay. \n\nBut yeah, Lufthansa customer service is only for the white man btw.",
        "I think it is too late to find the flight's history without paid access.\n\nFind the routine flight's tail number, and check whether the flight flew to somewhere else. \n\nIn any case, EU Laws are among the most consumer-friendly so if Lufthansa doesn't have a genuine reason, you should be able to get compensation.\n\nhttps://www.flightaware.com/live/flight/DLH757/history\n\nhttps://www.flightaware.com/live/flight/DLH757/history/20240320/2135Z/VABB/EDDF",
        "On flightaware you can see the histroy of a flight, by using the tail-number (from 23rd March onwards right now): https://www.flightaware.com/live/flight/DABVY",
        "Lufthansa is a disgrace, my parents flight from Delhi got delayed by something like 8 hrs due to adverse weather.\n\nThe weather is Delhi is fine. They are basically skirting the rules by saying a problem on the scheduled plane from previous flights is a legitimate excuse. It's not. \n\nI went on another carrier with a 5 hour delay with the same issue. Had most of my ticket compensated!",
        "I think that's European rules. Don't think it's applicable for flights leaving from India.",
        "European Airlines don't really give a fuck about you unless you are a European because you can sue the shit outta them. The next time booking a flight if possible put in European address and details.",
        "The thing is, you will find these negative comments about all the Airlines in the world. If we go by the others’ personal experiences then we may as well better be not flying anywhere.",
        "It is a classic topic for baiting eyeballs on the internet. It is a guaranteed viewership increase. \n\nIt is similar to the Airline-food being the default topic of comedians when Airlines used to do food as standard. :)",
        "Because of Union strikes. Huge strikes and cancellations happened in Munich, Paris and Frankfurt. They had to cancel not just Mumbai flights but also local European flights as well.",
        "Hey OP, no they cannot just replace the flight with another one. They don’t have planes lying around. If your aircraft was damaged and they rebooked you, you are very lucky because a lot of airlines don’t carry for rebooking. \n\nRecently there was a fault in the oxygen mask sensor in one of the SAS airplane from Stockholm to Manchester. But they cancelled all the similar aircrafts flying out from Stockholm that day and the next day, which is literally all over Europe, until the bug was fixed. \n\nChill. Lufthansa is a good airline and sometimes shit happens. Be grateful that you are not flying in the US at least.",
        "You have to give the compensation fight to a third party lawyer firm. There are many that do this. You will receive compensation, the firm will take about half of it. ",
        "To add to that, maybe with the recent revelations about Boeing's planes, they might be changing their fleet? Or maybe that's a long shot.",
        "The status of your flight is shown as Unknown here: [https://www.flightera.net/en/flight\\_details/Lufthansa-Mumbai-Frankfurt/LH757/VABB/2024-03-22](https://www.flightera.net/en/flight_details/Lufthansa-Mumbai-Frankfurt/LH757/VABB/2024-03-22)\n\nSame flight for 19th March is also Unknown.\n\nThe aircraft listed for 22nd March is ABVZ which has been flying non-stop daily between 15th-24th March. [https://www.flightera.net/en/planes/D-ABVZ/2024-03-24%2011\\_00](https://www.flightera.net/en/planes/D-ABVZ/2024-03-24%2011_00)\n\nThe aircraft listed for 19th March is ABTL. This aircraft did not fly on 18th and 19th March. Likely this could be the one that suffered a lightning strike.\n\nNot sure if more information can be obtained publicly. I don't expect an airline under EU laws to be lying outright.",
        "No defending Lufthansa here, thier customer service is very bad, infact worse than Air India's but it's highly likely the onward aircraft to Mumbai suffered a lightning strike.",
        "Currently, don't rely on any German transport service. They frequently go on strikes. Better to be wary of them",
        "But the weather in Delhi isn’t the only weather they need to consider though?",
        "Maybe not. But I could be wrong",
        "I had my sleeper Volvo B11R ticket canceled because the travel agency did not have a replacement B11R and OP is expecting a 787 Dreamliner just sitting on the tarmac.",
        "i beleive they have a sita/iata interairline billing & settlement platform for transferring passengers to alliance partners in case of such eventualities",
        "Maybe that is true",
        "File a case against them in consumer court and attach this email, along with their reply and weather report."
    ],
    "cleaned_text": "never travel lufthansa try keep short possible booked mumbaiamsterdam return flight lufthansa months back mom departure flight march march got email saying flight mumbai cancelled cancellation emailhttpsimgurcomqsyle roughly hour later got email saying rebooked flight hours later march rebooking email httpsimgurcombfjtw filled formhttpswwwlufthansacomazencompensationintheeventofflightirregularities seek compensation email responsehttpsimgurcomleqge got reason flight irregularity lightning strike occurred immediately prior takeoff wtf could believe lufthansa would resolve outright lies avoid compensation cancellation happened nearly days flight say lightning strike besides lightning bombay timeframe hot af clouds even sent emailhttpsimgurcomfkwwar calling guess doubled downhttpsimgurcomrlxs lie know small companies lie time lufthansa hopeless lie fucking unbelievable mind moment ask full compensation specify amount anywhere filled claim form wondering yes lose money night hotel booking reached next fucking day also could couple tourist attractions cos rebooked onward journey hectic know recently couple posts bad experiences lufthansa unfortunately already booked tickets travelled various middle east carriers even situations wherein flights delayed cancelled ever encounter blatant stupid lie justifying lufthansa never ",
    "cleaned_title": "never travel lufthansa",
    "cleaned_selftext": "try keep short possible booked mumbaiamsterdam return flight lufthansa months back mom departure flight march march got email saying flight mumbai cancelled cancellation emailhttpsimgurcomqsyle roughly hour later got email saying rebooked flight hours later march rebooking email httpsimgurcombfjtw filled formhttpswwwlufthansacomazencompensationintheeventofflightirregularities seek compensation email responsehttpsimgurcomleqge got reason flight irregularity lightning strike occurred immediately prior takeoff wtf could believe lufthansa would resolve outright lies avoid compensation cancellation happened nearly days flight say lightning strike besides lightning bombay timeframe hot af clouds even sent emailhttpsimgurcomfkwwar calling guess doubled downhttpsimgurcomrlxs lie know small companies lie time lufthansa hopeless lie fucking unbelievable mind moment ask full compensation specify amount anywhere filled claim form wondering yes lose money night hotel booking reached next fucking day also could couple tourist attractions cos rebooked onward journey hectic know recently couple posts bad experiences lufthansa unfortunately already booked tickets travelled various middle east carriers even situations wherein flights delayed cancelled ever encounter blatant stupid lie justifying lufthansa never",
    "cleaned_comments": "completely possible aircraft scheduled fly day lightening strike days earlier part world leaving inoperable really want call bluff find aircraft type followed registration number supposed fly day see incident report filed lufthansa days leading trip completely possible aircraft scheduled fly day lightening strike days earlier part world leaving inoperable consider implies carrier like lufthansa could find replacement aircraft period days hard believe additionally guy skirts around issue never tells actual damage plane resulted cancellation follow response even vague barely addresses really want call bluff find aircraft type followed registration number supposed fly day see incident report filed lufthansa days leading trip get information flight number lh websites firms file case compensation take final settlement take long time get money flight denmark iceland got cancelled airline provided accomodation food flight next day even got compensation think airlines emptyfree carriers standing would find replacement aircraft days pre booked fwiw european carriers lufthansa air france klm regularly cancelling flights tofrom mumbai happened times past months explanation given maybe due pilot shortage equipment issues geopolitical problems fly middle east someone definitely investigate reasons happening quite frequently lmao empathize situation airlines dont dreamliner thats laying around compensate flight cancellationsdelay yeah lufthansa customer service white man btw think late find flights history without paid access find routine flights tail number check whether flight flew somewhere else case eu laws among consumerfriendly lufthansa doesnt genuine reason able get compensation flightaware see histroy flight using tailnumber rd march onwards right lufthansa disgrace parents flight delhi got delayed something like hrs due adverse weather weather delhi fine basically skirting rules saying problem scheduled plane previous flights legitimate excuse went another carrier hour delay issue ticket compensated think thats european rules dont think applicable flights leaving india european airlines dont really give fuck unless european sue shit outta next time booking flight possible put european address details thing find negative comments airlines world go others personal experiences may well better flying anywhere classic topic baiting eyeballs internet guaranteed viewership increase similar airlinefood default topic comedians airlines used food standard union strikes huge strikes cancellations happened munich paris frankfurt cancel mumbai flights also local european flights well hey op replace flight another one dont planes lying around aircraft damaged rebooked lucky lot airlines dont carry rebooking recently fault oxygen mask sensor one sas airplane stockholm manchester cancelled similar aircrafts flying stockholm day next day literally europe bug fixed chill lufthansa good airline sometimes shit happens grateful flying us least give compensation fight third party lawyer firm many receive compensation firm take half add maybe recent revelations boeings planes might changing fleet maybe thats long shot status flight shown unknown httpswwwflighteranetenflightdetailslufthansamumbaifrankfurtlhvabbhttpswwwflighteranetenflightdetailslufthansamumbaifrankfurtlhvabb flight th march also unknown aircraft listed nd march abvz flying nonstop daily thth march httpswwwflighteranetenplanesdabvzhttpswwwflighteranetenplanesdabvz aircraft listed th march abtl aircraft fly th th march likely could one suffered lightning strike sure information obtained publicly dont expect airline eu laws lying outright defending lufthansa thier customer service bad infact worse air indias highly likely onward aircraft mumbai suffered lightning strike currently dont rely german transport service frequently go strikes better wary weather delhi isnt weather need consider though maybe could wrong sleeper volvo br ticket canceled travel agency replacement br op expecting dreamliner sitting tarmac beleive sitaiata interairline billing settlement platform transferring passengers alliance partners case eventualities maybe true file case consumer court attach email along reply weather report",
    "light_cleaned_title": "Never travel with Lufthansa.",
    "light_cleaned_selftext": "I will try to keep this as short as possible. I booked Mumbai-Amsterdam return flight with Lufthansa some 2.5 months back for me and my mom. The departure flight was on March 22, 2.55 AM. On March 19, I got an email saying that the flight from Mumbai had been cancelled - [cancellation email](https://imgur.com/QsY3L4E). Roughly an hour later, I got an email saying that we have been rebooked for the same flight, but 24 hours later on March 23, 2.55AM - [rebooking email] (https://imgur.com/BF98JtW). I filled up this [form](https://www.lufthansa.com/az/en/compensation-in-the-event-of-flight-irregularities) to seek compensation, and this is the [email response](https://imgur.com/LeQ5g1e) I got. *The reason for the flight irregularity was lightning strike, which occurred immediately prior to take-off.* WTF?!?! I could not believe that Lufthansa would resolve to such outright lies just to avoid compensation. The cancellation happened nearly 3 days before the flight, and they say lightning strike?!? Besides, there was no lightning in Bombay in that timeframe, it was hot AF with no clouds even. So, I sent an [email](https://imgur.com/5FkwwAr) calling them out. And guess what? They [doubled down](https://imgur.com/5r46lxS) on the lie. I know small companies lie all the time but Lufthansa, that too such a hopeless lie??!!? Fucking unbelievable. Mind you, at no moment did I ask for a full compensation; I did not specify the amount anywhere, just only filled up the claim form. If you are wondering, yes we did lose money on 1 night hotel booking as we reached the next fucking day. We also could not do a couple of tourist attractions cos of that + rebooked onward journey was very hectic. I know recently there were a couple of posts on bad experiences with Lufthansa but unfortunately I had already booked my tickets by then. I have travelled with various middle east carriers before, and have even been in situations wherein flights were delayed/ cancelled. But not once did I ever encounter such a blatant and stupid lie justifying that. Lufthansa? Never again.",
    "light_cleaned_comments": "It is completely possible that your aircraft scheduled to fly that day had a lightening strike 3 days earlier in some other part of the world, leaving it inoperable. If you really want to call in their bluff, find the aircraft type followed by its registration number which was supposed to fly that day and see if there was an incident report filed by Lufthansa in the days leading to your trip. > It is completely possible that your aircraft scheduled to fly that day had a lightening strike 3 days earlier in some other part of the world, leaving it inoperable. I did consider this, but it implies that a carrier like Lufthansa could not find a replacement aircraft over a period of 3 days? That is very hard to believe. Additionally, the guy just skirts around the issue; never tells if there was actual damage to the plane which resulted in the cancellation. In his follow up response, he is even more vague on it and barely addresses it. > If you really want to call in their bluff, find the aircraft type followed by its registration number which was supposed to fly that day and see if there was an incident report filed by Lufthansa in the days leading to your trip. Where can I get this information? I only have the flight number (LH 757) There are websites, firms through whom you can file a case for compensation. They will take 25% of your final settlement. It will take a long time but you will get the money! My flight from Denmark to Iceland got cancelled. Airline provided accomodation, food and flight for the next day, even then I got the compensation! Do you think airlines have empty/free carriers just standing there? How would they find the replacement aircraft in 3 days if all of them are pre booked? FWIW european carriers Lufthansa, Air France & KLM are regularly cancelling flights to/from Mumbai. Happened to me 2 times in past 6 months. No explanation given. Maybe its due to pilot shortage, equipment issues, geo-political problems (they fly over middle east). Someone should definitely investigate the reasons. It’s happening quite frequently. Lmao, I empathize with your situation. But airlines don't have a 787 Dreamliner that's just laying around to compensate for flight cancellations/delay. But yeah, Lufthansa customer service is only for the white man btw. I think it is too late to find the flight's history without paid access. Find the routine flight's tail number, and check whether the flight flew to somewhere else. In any case, EU Laws are among the most consumer-friendly so if Lufthansa doesn't have a genuine reason, you should be able to get compensation. On flightaware you can see the histroy of a flight, by using the tail-number (from 23rd March onwards right now): Lufthansa is a disgrace, my parents flight from Delhi got delayed by something like 8 hrs due to adverse weather. The weather is Delhi is fine. They are basically skirting the rules by saying a problem on the scheduled plane from previous flights is a legitimate excuse. It's not. I went on another carrier with a 5 hour delay with the same issue. Had most of my ticket compensated! I think that's European rules. Don't think it's applicable for flights leaving from India. European Airlines don't really give a fuck about you unless you are a European because you can sue the shit outta them. The next time booking a flight if possible put in European address and details. The thing is, you will find these negative comments about all the Airlines in the world. If we go by the others’ personal experiences then we may as well better be not flying anywhere. It is a classic topic for baiting eyeballs on the internet. It is a guaranteed viewership increase. It is similar to the Airline-food being the default topic of comedians when Airlines used to do food as standard. :) Because of Union strikes. Huge strikes and cancellations happened in Munich, Paris and Frankfurt. They had to cancel not just Mumbai flights but also local European flights as well. Hey OP, no they cannot just replace the flight with another one. They don’t have planes lying around. If your aircraft was damaged and they rebooked you, you are very lucky because a lot of airlines don’t carry for rebooking. Recently there was a fault in the oxygen mask sensor in one of the SAS airplane from Stockholm to Manchester. But they cancelled all the similar aircrafts flying out from Stockholm that day and the next day, which is literally all over Europe, until the bug was fixed. Chill. Lufthansa is a good airline and sometimes shit happens. Be grateful that you are not flying in the US at least. You have to give the compensation fight to a third party lawyer firm. There are many that do this. You will receive compensation, the firm will take about half of it. To add to that, maybe with the recent revelations about Boeing's planes, they might be changing their fleet? Or maybe that's a long shot. The status of your flight is shown as Unknown here: [https://www.flightera.net/en/flight\\_details/Lufthansa-Mumbai-Frankfurt/LH757/VABB/2024-03-22](https://www.flightera.net/en/flight_details/Lufthansa-Mumbai-Frankfurt/LH757/VABB/2024-03-22) Same flight for 19th March is also Unknown. The aircraft listed for 22nd March is ABVZ which has been flying non-stop daily between 15th-24th March. [https://www.flightera.net/en/planes/D-ABVZ/2024-03-24%2011\\_00](https://www.flightera.net/en/planes/D-ABVZ/2024-03-24%2011_00) The aircraft listed for 19th March is ABTL. This aircraft did not fly on 18th and 19th March. Likely this could be the one that suffered a lightning strike. Not sure if more information can be obtained publicly. I don't expect an airline under EU laws to be lying outright. No defending Lufthansa here, thier customer service is very bad, infact worse than Air India's but it's highly likely the onward aircraft to Mumbai suffered a lightning strike. Currently, don't rely on any German transport service. They frequently go on strikes. Better to be wary of them But the weather in Delhi isn’t the only weather they need to consider though? Maybe not. But I could be wrong I had my sleeper Volvo B11R ticket canceled because the travel agency did not have a replacement B11R and OP is expecting a 787 Dreamliner just sitting on the tarmac. i beleive they have a sita/iata interairline billing & settlement platform for transferring passengers to alliance partners in case of such eventualities Maybe that is true File a case against them in consumer court and attach this email, along with their reply and weather report."
}