{
    "id": "15pz9ph",
    "title": "I made kharvas at home today",
    "url": "https://www.reddit.com/gallery/15pz9ph",
    "selftext": "Ever tried this sweet dish which is really soft and if yes what do you call it in your state ?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691934201.0,
    "convurl": "https://i.redd.it/rtrunm90tvhb1.jpg",
    "comments": [
        "I haven't tried it ever. Can you explain how it's made ?",
        "https://hebbarskitchen.com/instant-kharvas-recipe-junnu-recipe/",
        "How’d you make it? Dont we require a specific milk?",
        "**Junnu** \\- in Andhra Pradesh & Telangana",
        "Looks delicious? I wonder what its taste like",
        "That's milks meant for the calf",
        "> as i previously mentioned, kharvas is a taditional sweet recipe and is generally prepared with cow colostrum (cheek). but we all know, getting the first form of milk produced by the cow is almost impractical. hence this recipe which uses the combination of full cream cows milk with milk powder, curd and condensed milk.\n\nand\n\n> firstly, as i mentioned previously, this is an instant version and i have not used the cow’s colostrum milk. but if you do have an access to it, ignore my alternatives and use it directly for the best results.\n\nThis is not made using colostrum",
        "Yeah. Humans are exploiting every other specie in every way possible.",
        "It's called - બળી बळी in Gujarati. I don't like the texture.",
        "Sweet paneer?",
        "Love kharvas, I used to ensure there was always some in the fridge.",
        ">That's milks meant for the calf\n\nWow we didn't knew",
        ">Humans are exploiting every other specie in every way possible.\n\nNot another vegan,lol",
        "Peyuns in cg.",
        "And fruits and vegetables are meant for something else as well. Truth be told, nature can survive without us in it. Let's not paint everything in the color we want. You are vegan, we all respect that but please do not rain on the OPs parade. Live and let live.",
        "Phehu in assam",
        "Yeah and cereal like rice is meant to be a baby paddy plant that can grow raise its own family.",
        "Seembu in tn",
        "I might have to ask but iirc that milk if consumed by the calf too much it causes them to get sick",
        "Super",
        "We call it \"innar\" pronounced as \"inner\" in my state. I personally love it! It's delicious.",
        "Ye to to dudh ko bolte hai. Peyus dudh but product to katra im sure on this lol",
        "I think it is on the day cow gives birth",
        "Ginnu in Kannada"
    ],
    "cleaned_text": "made kharvas home today ever tried sweet dish really soft yes call state ",
    "cleaned_title": "made kharvas home today",
    "cleaned_selftext": "ever tried sweet dish really soft yes call state",
    "cleaned_comments": "havent tried ever explain made howd make dont require specific milk junnu andhra pradesh telangana looks delicious wonder taste like thats milks meant calf previously mentioned kharvas taditional sweet recipe generally prepared cow colostrum cheek know getting first form milk produced cow almost impractical hence recipe uses combination full cream cows milk milk powder curd condensed milk firstly mentioned previously instant version used cows colostrum milk access ignore alternatives use directly best results made using colostrum yeah humans exploiting every specie every way possible called gujarati dont like texture sweet paneer love kharvas used ensure always fridge thats milks meant calf wow didnt knew humans exploiting every specie every way possible another veganlol peyuns cg fruits vegetables meant something else well truth told nature survive without us lets paint everything color want vegan respect please rain ops parade live let live phehu assam yeah cereal like rice meant baby paddy plant grow raise family seembu tn might ask iirc milk consumed calf much causes get sick super call innar pronounced inner state personally love delicious ye dudh ko bolte hai peyus dudh product katra im sure lol think day cow gives birth ginnu kannada",
    "light_cleaned_title": "I made kharvas at home today",
    "light_cleaned_selftext": "Ever tried this sweet dish which is really soft and if yes what do you call it in your state ?",
    "light_cleaned_comments": "I haven't tried it ever. Can you explain how it's made ? How’d you make it? Dont we require a specific milk? **Junnu** \\- in Andhra Pradesh & Telangana Looks delicious? I wonder what its taste like That's milks meant for the calf > as i previously mentioned, kharvas is a taditional sweet recipe and is generally prepared with cow colostrum (cheek). but we all know, getting the first form of milk produced by the cow is almost impractical. hence this recipe which uses the combination of full cream cows milk with milk powder, curd and condensed milk. and > firstly, as i mentioned previously, this is an instant version and i have not used the cow’s colostrum milk. but if you do have an access to it, ignore my alternatives and use it directly for the best results. This is not made using colostrum Yeah. Humans are exploiting every other specie in every way possible. It's called - બળી बळी in Gujarati. I don't like the texture. Sweet paneer? Love kharvas, I used to ensure there was always some in the fridge. >That's milks meant for the calf Wow we didn't knew >Humans are exploiting every other specie in every way possible. Not another vegan,lol Peyuns in cg. And fruits and vegetables are meant for something else as well. Truth be told, nature can survive without us in it. Let's not paint everything in the color we want. You are vegan, we all respect that but please do not rain on the OPs parade. Live and let live. Phehu in assam Yeah and cereal like rice is meant to be a baby paddy plant that can grow raise its own family. Seembu in tn I might have to ask but iirc that milk if consumed by the calf too much it causes them to get sick Super We call it \"innar\" pronounced as \"inner\" in my state. I personally love it! It's delicious. Ye to to dudh ko bolte hai. Peyus dudh but product to katra im sure on this lol I think it is on the day cow gives birth Ginnu in Kannada"
}