{
    "id": "1gaxzd9",
    "title": "Bengaluru officials demand parental consent for interfaith weddings: A TNM investigation",
    "url": "https://www.thenewsminute.com/karnataka/bengaluru-officials-demand-parental-consent-for-interfaith-weddings-a-tnm-investigation",
    "selftext": "Seventy years after the Special Marriage Act (SMA) came into existence, Bengaluru’s marriage officials are demanding that couples who want to marry under SMA bring their parents as witnesses. “Compulsory,” some of the officials declared, despite the fact that the law makes no such insistence. “Do your parents know?” they ask of adults, who legally have every right to make decisions about their own life without any ‘parental guidance’.",
    "flair": "Law & Courts",
    "score": 300,
    "num_comments": 24,
    "created_utc": 1729759621.0,
    "convurl": "https://external-preview.redd.it/EMkuYEeYf42lg4Lp1TFKbCUZqKy3JFKl6B2lqnbdfyI.jpg?auto=webp&s=fa6ec8a0517befaa9318fb6f3ccd03bbc13e1a68",
    "comments": [
        "Defeats the purpose of SMA for them lovers of interfaith.",
        "Take a lawyer friend and let him do the talking. I have a close friend from school who is a Mumbai high court lawyer. I have him on speed dial. I can't even begin to say how many times I have called him in front of police, toll booths, government offices.",
        "Why do adults need permission to marry anyone. Thats what being an adult means legally.",
        "Ahhh Karnataka,  the UP of South India, strikes  again!",
        "Good",
        " India is cooked there is no saving this country.",
        "bhai mai hota to gaali de deta, these kind of things make me lose my temper",
        "Indian Govt employees love making up their own rules without any adherence to the law.",
        "Indeed",
        "Let's infantilize adults, shall we ?",
        "Everyday I just hate Bangalore more",
        "What is the point of being an adult if u can't decide who u wanna marry. Are u retarded???",
        "It's pretty much going \"Does your owner approve of you doing this?\" Lol",
        "Make sure 60% of them slurs are in kannada.",
        "You better be treating him to all kinda of luxuries you can afford!",
        "Nah this happened to me in Chennai also",
        "people should take these officials to court.",
        "Ruined the country these piece of shit politicians and administration. \nBunch of stuck up assholes. Hope they all rot.",
        "How is this not enough to file a legal case on this office and these officials?",
        "Take two lawyer friends as witnesses. I literally have not seen this in the rural part of TN I am from. This might be a case of a law disregarding registrar ?",
        "Just like the Taliban."
    ],
    "cleaned_text": "bengaluru officials demand parental consent interfaith weddings tnm investigation seventy years special marriage act sma came existence bengalurus marriage officials demanding couples want marry sma bring parents witnesses compulsory officials declared despite fact law makes insistence parents know ask adults legally every right make decisions life without parental guidance ",
    "cleaned_title": "bengaluru officials demand parental consent interfaith weddings tnm investigation",
    "cleaned_selftext": "seventy years special marriage act sma came existence bengalurus marriage officials demanding couples want marry sma bring parents witnesses compulsory officials declared despite fact law makes insistence parents know ask adults legally every right make decisions life without parental guidance",
    "cleaned_comments": "defeats purpose sma lovers interfaith take lawyer friend let talking close friend school mumbai high court lawyer speed dial cant even begin say many times called front police toll booths government offices adults need permission marry anyone thats adult means legally ahhh karnataka south india strikes good india cooked saving country bhai mai hota gaali de deta kind things make lose temper indian govt employees love making rules without adherence law indeed lets infantilize adults shall everyday hate bangalore point adult u cant decide u wan na marry u retarded pretty much going owner approve lol make sure slurs kannada better treating kinda luxuries afford nah happened chennai also people take officials court ruined country piece shit politicians administration bunch stuck assholes hope rot enough file legal case office officials take two lawyer friends witnesses literally seen rural part tn might case law disregarding registrar like taliban",
    "light_cleaned_title": "Bengaluru officials demand parental consent for interfaith weddings: A TNM investigation",
    "light_cleaned_selftext": "Seventy years after the Special Marriage Act (SMA) came into existence, Bengaluru’s marriage officials are demanding that couples who want to marry under SMA bring their parents as witnesses. “Compulsory,” some of the officials declared, despite the fact that the law makes no such insistence. “Do your parents know?” they ask of adults, who legally have every right to make decisions about their own life without any ‘parental guidance’.",
    "light_cleaned_comments": "Defeats the purpose of SMA for them lovers of interfaith. Take a lawyer friend and let him do the talking. I have a close friend from school who is a Mumbai high court lawyer. I have him on speed dial. I can't even begin to say how many times I have called him in front of police, toll booths, government offices. Why do adults need permission to marry anyone. Thats what being an adult means legally. Ahhh Karnataka, the UP of South India, strikes again! Good India is cooked there is no saving this country. bhai mai hota to gaali de deta, these kind of things make me lose my temper Indian Govt employees love making up their own rules without any adherence to the law. Indeed Let's infantilize adults, shall we ? Everyday I just hate Bangalore more What is the point of being an adult if u can't decide who u wanna marry. Are u retarded??? It's pretty much going \"Does your owner approve of you doing this?\" Lol Make sure 60% of them slurs are in kannada. You better be treating him to all kinda of luxuries you can afford! Nah this happened to me in Chennai also people should take these officials to court. Ruined the country these piece of shit politicians and administration. Bunch of stuck up assholes. Hope they all rot. How is this not enough to file a legal case on this office and these officials? Take two lawyer friends as witnesses. I literally have not seen this in the rural part of TN I am from. This might be a case of a law disregarding registrar ? Just like the Taliban."
}