{
    "id": "18vjxxn",
    "title": "Meesho Scam/Fraud?",
    "url": "https://www.reddit.com/r/india/comments/18vjxxn/meesho_scamfraud/",
    "selftext": "Complaints about online retailers are a dime a dozen. So, I am not expecting any resolution on this. This is just for posterity, a warning for people and to share my experience with customer service or lack thereof from Meesho.  \n\n\n**The main takeaway here is that the video proof of delivery (Ram Band according to some), a message with the delivery person's name, address, tracking no, order no (matching on the app), color, size, price, and type of product matching exactly with the website app; None of the aforementioned matters to them.** **They have a simple quote to give that our system has not processed this order.**\n\n  \n**Sending legal notice didn't matter to them. INGRAM complaints didn't matter to them. I had an internal contact (even they couldn't do anything about this).**  \nEven after following up with the Messho customer service for weeks, filing two INGRAM (national consumer helpline ) complaints, and finally a legal notice, nothing has happened.  \n\n\n**Details below**:  \nA product was delivered (woman's clothing costing 768 rs) but the company is unwilling to acknowledge the same and is refusing the return for it. Delivery proofs have been sent to the company multiple times.  \n\n\n*Mail chain screenshots are attached for conversation with their 'customer care'.*  \n\n\nhttps://preview.redd.it/ksahoz10tp9c1.png?width=1600&format=png&auto=webp&s=ff4608205af1d5c7d49336a9f58f4bf3571fdf46\n\nhttps://preview.redd.it/ofdvjei1tp9c1.png?width=1600&format=png&auto=webp&s=466b7afab57098c2ceb9576b0fff03a8fafc5011\n\n*Grievance filed on* [*https://consumerhelpline.gov.in/*](https://consumerhelpline.gov.in/)  \n\\# Grievance No. State Consumer Name Reg Date Status Action  \n1 5012385 MAHARASHTRA  2023-10-09 16:14:05 Disposed \\[Copy paste replies\\]  \n2 5012100 MAHARASHTRA  2023-10-09 15:27:54 Disposed \\[Copy paste replies\\]  \n\n\n*Legan notice sent (excerpt)*  \n\n\nhttps://preview.redd.it/egsrh414tp9c1.png?width=996&format=png&auto=webp&s=e90fd1b4d3fe1c195a5e1bf105ad5bf5c11cb993\n\nDetails of order :  \n\n\nOrder no: 958942948982  \nDate of purchase/transaction: 2023-09-23  \nAmount Paid: Rs 768  \nGrievance Company: Meesho.com  \nProduct / Service Type: Clothes  \nComplaint No / Ref no.(with company): 696825232798  \nCompany Details Website: [www.meesho.com](http://www.meesho.com/) email: [cs-replies@meesho.com](mailto:cs-replies@meesho.com) Fashnear Technologies Private Limited, CIN: U74900KA2015PTC082263 06-105-B, 06-102, (138 Wu) Vaishnavi Signature, No. 78/9, Outer Ring Road, Bellandur, Varthur Hobli, Bengaluru-560103, Karnataka, India E-mail address: [query@meesho.com](mailto:query@meesho.com) © 2015-2023 Meesho.com  \n\n\nObviously*, this whole thing is not about the cost of the product as I have spent around 3 times the money for following up on this and the mental anguish suffered is another thing altogether.* ",
    "flair": "Crime",
    "score": 3,
    "num_comments": 1,
    "created_utc": 1704065488.0,
    "convurl": "https://b.thumbs.redditmedia.com/fVe6wbPOplfNSLCLtLBrvL33eFT2QzWB4WSmaNRaRVY.jpg",
    "comments": [],
    "cleaned_text": "meesho scamfraud complaints online retailers dime dozen expecting resolution posterity warning people share experience customer service lack thereof meesho main takeaway video proof delivery ram band according message delivery persons name address tracking order matching app color size price type product matching exactly website app none aforementioned matters simple quote give system processed order sending legal notice didnt matter ingram complaints didnt matter internal contact even couldnt anything even following messho customer service weeks filing two ingram national consumer helpline complaints finally legal notice nothing happened details product delivered womans clothing costing rs company unwilling acknowledge refusing return delivery proofs sent company multiple times mail chain screenshots attached conversation customer care grievance filed httpsconsumerhelplinegovinhttpsconsumerhelplinegovin grievance state consumer name reg date status action maharashtra disposed copy paste replies maharashtra disposed copy paste replies legan notice sent excerpt details order order date purchasetransaction amount paid rs grievance company meeshocom product service type clothes complaint ref nowith company company details website wwwmeeshocomhttpwwwmeeshocom email csrepliesmeeshocommailtocsrepliesmeeshocom fashnear technologies private limited cin ukaptc b wu vaishnavi signature outer ring road bellandur varthur hobli bengaluru karnataka india email address querymeeshocommailtoquerymeeshocom meeshocom obviously whole thing cost product spent around times money following mental anguish suffered another thing altogether ",
    "cleaned_title": "meesho scamfraud",
    "cleaned_selftext": "complaints online retailers dime dozen expecting resolution posterity warning people share experience customer service lack thereof meesho main takeaway video proof delivery ram band according message delivery persons name address tracking order matching app color size price type product matching exactly website app none aforementioned matters simple quote give system processed order sending legal notice didnt matter ingram complaints didnt matter internal contact even couldnt anything even following messho customer service weeks filing two ingram national consumer helpline complaints finally legal notice nothing happened details product delivered womans clothing costing rs company unwilling acknowledge refusing return delivery proofs sent company multiple times mail chain screenshots attached conversation customer care grievance filed httpsconsumerhelplinegovinhttpsconsumerhelplinegovin grievance state consumer name reg date status action maharashtra disposed copy paste replies maharashtra disposed copy paste replies legan notice sent excerpt details order order date purchasetransaction amount paid rs grievance company meeshocom product service type clothes complaint ref nowith company company details website wwwmeeshocomhttpwwwmeeshocom email csrepliesmeeshocommailtocsrepliesmeeshocom fashnear technologies private limited cin ukaptc b wu vaishnavi signature outer ring road bellandur varthur hobli bengaluru karnataka india email address querymeeshocommailtoquerymeeshocom meeshocom obviously whole thing cost product spent around times money following mental anguish suffered another thing altogether",
    "cleaned_comments": "",
    "light_cleaned_title": "Meesho Scam/Fraud?",
    "light_cleaned_selftext": "Complaints about online retailers are a dime a dozen. So, I am not expecting any resolution on this. This is just for posterity, a warning for people and to share my experience with customer service or lack thereof from Meesho. **The main takeaway here is that the video proof of delivery (Ram Band according to some), a message with the delivery person's name, address, tracking no, order no (matching on the app), color, size, price, and type of product matching exactly with the website app; None of the aforementioned matters to them.** **They have a simple quote to give that our system has not processed this order.** **Sending legal notice didn't matter to them. INGRAM complaints didn't matter to them. I had an internal contact (even they couldn't do anything about this).** Even after following up with the Messho customer service for weeks, filing two INGRAM (national consumer helpline ) complaints, and finally a legal notice, nothing has happened. **Details below**: A product was delivered (woman's clothing costing 768 rs) but the company is unwilling to acknowledge the same and is refusing the return for it. Delivery proofs have been sent to the company multiple times. *Mail chain screenshots are attached for conversation with their 'customer care'.* *Grievance filed on* [*https://consumerhelpline.gov.in/*](https://consumerhelpline.gov.in/) \\# Grievance No. State Consumer Name Reg Date Status Action 1 5012385 MAHARASHTRA 2023-10-09 16:14:05 Disposed \\[Copy paste replies\\] 2 5012100 MAHARASHTRA 2023-10-09 15:27:54 Disposed \\[Copy paste replies\\] *Legan notice sent (excerpt)* Details of order : Order no: 958942948982 Date of purchase/transaction: 2023-09-23 Amount Paid: Rs 768 Grievance Company: Meesho.com Product / Service Type: Clothes Complaint No / Ref no.(with company): 696825232798 Company Details Website: [www.meesho.com](http://www.meesho.com/) email: [cs-replies@meesho.com](mailto:cs-replies@meesho.com) Fashnear Technologies Private Limited, CIN: U74900KA2015PTC082263 06-105-B, 06-102, (138 Wu) Vaishnavi Signature, No. 78/9, Outer Ring Road, Bellandur, Varthur Hobli, Bengaluru-560103, Karnataka, India E-mail address: [query@meesho.com](mailto:query@meesho.com) © 2015-2023 Meesho.com Obviously*, this whole thing is not about the cost of the product as I have spent around 3 times the money for following up on this and the mental anguish suffered is another thing altogether.*",
    "light_cleaned_comments": ""
}