{
    "id": "1bttok8",
    "title": "\"Absolute defiance, humbug, perjury:\" Supreme Court slams Patanjali over its apology affidavit in misleading ads case",
    "url": "https://www.barandbench.com/news/supreme-court-slams-patanjali-over-its-apology-affidavit-misleading-ads-case",
    "selftext": "\"You said documents have been attached, but the documents were created later on. This is a clear case of perjury! We are not closing the doors on you but we are telling all that we have noted,\" Justice Kohli said. \n\n\nThe lawyer dude thought it was law-school assignment submission.. 😂",
    "flair": "Law & Courts",
    "score": 665,
    "num_comments": 28,
    "created_utc": 1712047205.0,
    "convurl": "https://external-preview.redd.it/0OUXV_ivN8sXjub9a7Y9x_HG0UyYymaq27pjzeezOG4.jpg?auto=webp&s=e9124b01e451095c0338e5382859fcf313d2877e",
    "comments": [
        "Their unconditional apology was anything but... It wasn't unconditional and didn't sound like an apology at all...Shows the sheer brazenness and their solid belief that nothing beyond a rap on the wrist will happen\n\nI still don't understand how they can get so much leeway from the courts... It surely cannot be ascribed to lack of understanding... They have big lawyers representing them... Sako this is nothing but willful defiance....\n\nI think they should be asked to tender an unconditional apology to the public with front page ads that run in every newspaper",
        "Enough slamming; I think it's time to assign a big financial fine and potential of arrest for future defiance.",
        "The chairman looks like a AI generated filmi villain. ",
        "There should be some action against ministers who promoted patanjali during covid .. especially incompetent health minister",
        "Like they'll do anything meaningful... judiciary is a joke in here",
        "Apology does nothing. They should be directed to pay hefty fines along with community service. Action s matter more than words anyday.",
        "Community service would work in his favor since religious work counts in that.",
        "Fine worth at least 10x of what they earned thru coronil",
        "Damn right. And ask Ramdev to shave his fuckin beard",
        "And none of this 1 lakh rupees fine BS. We should start doing this like the EU and make the fine proportional to revenue.",
        "haha, it will be like Aladin without the beard.",
        "Hope the Supreme Court judges stays safe. I'm worried about them lately.",
        "I think it’s time they broke out fines, charges for endangering citizens, etc.",
        "is the company fined???? like they do in abroad...",
        "I LOVE BJP... but i just cannot stand thid fraud. And i also know that most bjp leaders just tolerate him for his reach and money.\n\nThis guy needs to arrested!!",
        "> most bjp leaders just tolerate him\n\nthe then bjp minister for health promoted his products like coronil publicly, they dont just \"tolerate him\" they are part of the same gang\n\nhttps://indianexpress.com/article/cities/pune/indian-medical-association-explanation-health-minister-promoting-patanjalis-coronil-7199236/",
        "Read my comment again.",
        "This wouldn't happen if court had imposed a fine of at least 2x what they made from selling products they marketed using false advertising instead of asking for apology.\n\nThis apology nonsense is to give false hope to consumers.",
        "Specific community service, like cleaning hospital toilets. And it counts only if doctors working in the hospital certify that the toilets they actually cleaned the toilets to the required standards for at least a month. ",
        "It doesn't called tolerating ..its called being bedfellows..... One who supports a fraud is also a fraud... Despite having clean majority these type of fraud people roaming in the open doesn't happen without ruling party support.... BJP have no problem with him because of the money he brings...",
        "Lala Ramdev",
        "Honestly, I don't think an apology is enough. Misleading a country with fake / ineffective medicines in the middle of pandemic, is a much more serious offence. \n\nThere are documented cases of people depending on Coronil and expecting it to cure their COVID but unfortunately not making it. This is beyond negligence and orchestrated murder. It's a shame the current government was also promoting this. Sickens me to realise that the ruling party actually promoted this alongside.",
        "The fine would be a nice election donation to his master.",
        "I fully.agree 💯..\n\nThey profited from a disease and put lives at risk... Mocked docs and people desperate for oxygen cylinders with snake oil\n\nIn a place with the rule of law and order, the law would have taken care of it swiftly and with severely.\n\nHowever, ramdev operates with active BJP support so he operates with impunity... \n\nThe courts coming down on him like a ton of bricks is nice but it's too little and too late... Besides, with minor financial impact and no real consequences, he'll be back to his tricks in no time",
        "https://preview.redd.it/1gyokxgbb8sc1.jpeg?width=1080&format=pjpg&auto=webp&s=f0a94a4fb6b84d83f109cbb056fd4431471aebc0"
    ],
    "cleaned_text": "absolute defiance humbug perjury supreme court slams patanjali apology affidavit misleading ads case said documents attached documents created later clear case perjury closing doors telling noted justice kohli said lawyer dude thought lawschool assignment submission ",
    "cleaned_title": "absolute defiance humbug perjury supreme court slams patanjali apology affidavit misleading ads case",
    "cleaned_selftext": "said documents attached documents created later clear case perjury closing doors telling noted justice kohli said lawyer dude thought lawschool assignment submission",
    "cleaned_comments": "unconditional apology anything wasnt unconditional didnt sound like apology allshows sheer brazenness solid belief nothing beyond rap wrist happen still dont understand get much leeway courts surely ascribed lack understanding big lawyers representing sako nothing willful defiance think asked tender unconditional apology public front page ads run every newspaper enough slamming think time assign big financial fine potential arrest future defiance chairman looks like ai generated filmi villain action ministers promoted patanjali covid especially incompetent health minister like theyll anything meaningful judiciary joke apology nothing directed pay hefty fines along community service action matter words anyday community service would work favor since religious work counts fine worth least x earned thru coronil damn right ask ramdev shave fuckin beard none lakh rupees fine bs start like eu make fine proportional revenue haha like aladin without beard hope supreme court judges stays safe im worried lately think time broke fines charges endangering citizens etc company fined like abroad love bjp stand thid fraud also know bjp leaders tolerate reach money guy needs arrested bjp leaders tolerate bjp minister health promoted products like coronil publicly dont tolerate part gang read comment wouldnt happen court imposed fine least x made selling products marketed using false advertising instead asking apology apology nonsense give false hope consumers specific community service like cleaning hospital toilets counts doctors working hospital certify toilets actually cleaned toilets required standards least month doesnt called tolerating called bedfellows one supports fraud also fraud despite clean majority type fraud people roaming open doesnt happen without ruling party support bjp problem money brings lala ramdev honestly dont think apology enough misleading country fake ineffective medicines middle pandemic much serious offence documented cases people depending coronil expecting cure covid unfortunately making beyond negligence orchestrated murder shame current government also promoting sickens realise ruling party actually promoted alongside fine would nice election donation master fullyagree profited disease put lives risk mocked docs people desperate oxygen cylinders snake oil place rule law order law would taken care swiftly severely however ramdev operates active bjp support operates impunity courts coming like ton bricks nice little late besides minor financial impact real consequences hell back tricks time",
    "light_cleaned_title": "\"Absolute defiance, humbug, perjury:\" Supreme Court slams Patanjali over its apology affidavit in misleading ads case",
    "light_cleaned_selftext": "\"You said documents have been attached, but the documents were created later on. This is a clear case of perjury! We are not closing the doors on you but we are telling all that we have noted,\" Justice Kohli said. The lawyer dude thought it was law-school assignment submission.. 😂",
    "light_cleaned_comments": "Their unconditional apology was anything but... It wasn't unconditional and didn't sound like an apology at all...Shows the sheer brazenness and their solid belief that nothing beyond a rap on the wrist will happen I still don't understand how they can get so much leeway from the courts... It surely cannot be ascribed to lack of understanding... They have big lawyers representing them... Sako this is nothing but willful defiance.... I think they should be asked to tender an unconditional apology to the public with front page ads that run in every newspaper Enough slamming; I think it's time to assign a big financial fine and potential of arrest for future defiance. The chairman looks like a AI generated filmi villain. There should be some action against ministers who promoted patanjali during covid .. especially incompetent health minister Like they'll do anything meaningful... judiciary is a joke in here Apology does nothing. They should be directed to pay hefty fines along with community service. Action s matter more than words anyday. Community service would work in his favor since religious work counts in that. Fine worth at least 10x of what they earned thru coronil Damn right. And ask Ramdev to shave his fuckin beard And none of this 1 lakh rupees fine BS. We should start doing this like the EU and make the fine proportional to revenue. haha, it will be like Aladin without the beard. Hope the Supreme Court judges stays safe. I'm worried about them lately. I think it’s time they broke out fines, charges for endangering citizens, etc. is the company fined???? like they do in abroad... I LOVE BJP... but i just cannot stand thid fraud. And i also know that most bjp leaders just tolerate him for his reach and money. This guy needs to arrested!! > most bjp leaders just tolerate him the then bjp minister for health promoted his products like coronil publicly, they dont just \"tolerate him\" they are part of the same gang Read my comment again. This wouldn't happen if court had imposed a fine of at least 2x what they made from selling products they marketed using false advertising instead of asking for apology. This apology nonsense is to give false hope to consumers. Specific community service, like cleaning hospital toilets. And it counts only if doctors working in the hospital certify that the toilets they actually cleaned the toilets to the required standards for at least a month. It doesn't called tolerating ..its called being bedfellows..... One who supports a fraud is also a fraud... Despite having clean majority these type of fraud people roaming in the open doesn't happen without ruling party support.... BJP have no problem with him because of the money he brings... Lala Ramdev Honestly, I don't think an apology is enough. Misleading a country with fake / ineffective medicines in the middle of pandemic, is a much more serious offence. There are documented cases of people depending on Coronil and expecting it to cure their COVID but unfortunately not making it. This is beyond negligence and orchestrated murder. It's a shame the current government was also promoting this. Sickens me to realise that the ruling party actually promoted this alongside. The fine would be a nice election donation to his master. I fully.agree 💯.. They profited from a disease and put lives at risk... Mocked docs and people desperate for oxygen cylinders with snake oil In a place with the rule of law and order, the law would have taken care of it swiftly and with severely. However, ramdev operates with active BJP support so he operates with impunity... The courts coming down on him like a ton of bricks is nice but it's too little and too late... Besides, with minor financial impact and no real consequences, he'll be back to his tricks in no time"
}