{
    "id": "16810oq",
    "title": "38 IT firms apply to make laptops, PCs under PLI scheme",
    "url": "https://www.reddit.com/r/india/comments/16810oq/38_it_firms_apply_to_make_laptops_pcs_under_pli/",
    "selftext": "Asus, Dell, HP and Foxconn are among 38 companies that have submitted applications to manufacture laptops, personal computers and servers in India under the Centre’s production-linked incentive (PLI) scheme for IT hardware. Apple, however, has opted to skip participation in the scheme.\n\nindianexpress.com/article/business/commodities/38-it-firms-apply-to-make-laptops-pcs-under-pli-scheme-8916898/",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693657035.0,
    "convurl": "https://external-preview.redd.it/p5fNFOe6Gv4DUbEsYueB_QqWxt6wPvNMZUT0ATmQDdI.jpg?auto=webp&s=a616db9983a7bd16f63d324d9aeceace7816d59a",
    "comments": [
        "Is this just a mobile version of assembling in India or is it more?",
        "You technically could manufacture the frame/chassis in India once you get the design from the ODM but I think this will just be assembly for now.",
        "Similar to how car manufacturing start with assembly in India"
    ],
    "cleaned_text": "firms apply make laptops pcs pli scheme asus dell hp foxconn among companies submitted applications manufacture laptops personal computers servers india centres productionlinked incentive pli scheme hardware apple however opted skip participation scheme indianexpresscomarticlebusinesscommoditiesitfirmsapplytomakelaptopspcsunderplischeme ",
    "cleaned_title": "firms apply make laptops pcs pli scheme",
    "cleaned_selftext": "asus dell hp foxconn among companies submitted applications manufacture laptops personal computers servers india centres productionlinked incentive pli scheme hardware apple however opted skip participation scheme indianexpresscomarticlebusinesscommoditiesitfirmsapplytomakelaptopspcsunderplischeme",
    "cleaned_comments": "mobile version assembling india technically could manufacture framechassis india get design odm think assembly similar car manufacturing start assembly india",
    "light_cleaned_title": "38 IT firms apply to make laptops, PCs under PLI scheme",
    "light_cleaned_selftext": "Asus, Dell, HP and Foxconn are among 38 companies that have submitted applications to manufacture laptops, personal computers and servers in India under the Centre’s production-linked incentive (PLI) scheme for IT hardware. Apple, however, has opted to skip participation in the scheme. indianexpress.com/article/business/commodities/38-it-firms-apply-to-make-laptops-pcs-under-pli-scheme-8916898/",
    "light_cleaned_comments": "Is this just a mobile version of assembling in India or is it more? You technically could manufacture the frame/chassis in India once you get the design from the ODM but I think this will just be assembly for now. Similar to how car manufacturing start with assembly in India"
}