{
    "id": "18fs5t3",
    "title": "Moved to a small town from Delhi. Facing small town idiosyncrasy.",
    "url": "https://www.reddit.com/gallery/18fs5t3",
    "selftext": "I got work from home and moved to a small town.\nThe people here are starving for jobs and most jobs are menial.\nThe idea of working online, freelancing and working for foreign comanies is alien and not even thought of here.\nPeople here somehow have honours degrees with zero knowledge or capabilities that a college passout would naturally develop.\n\nThe reason for the post:\nI recently learned that my relatives think I don't work, the talk became more frequent when I bought necessities like a bike and a cycle. They think my dad bought me thos as that is what happens here with people who have some money,my dad has always taught us to make our own money and only gave us what was necessary.\n\nI haven't said a word and not going to either.\nThese people could have just asked but the issue is I have told them however they don't understand it and even after being told they go around discussing with other relatives about places I can work at for literally a very small fraction of what I currently make.\nI don't show off, I wear ragged clothes and live like everyone here I eat rice and dal everyday but because I am capable I make myself a pizza or cake at home. People here seem to think if someone has money they should show off by buying big cars, I invest my money and buy things that remain in my house and I have zero desire to show people any of it.\nPeople here make 5k a month, why would I show off and make someone look small.\nI intentionally avoid the talk of how much I make by saying I make enough.\nPeople here have way too much time on their hands and waste it with social arguments over non sense things.\nThe aversion to change is next level.\n\nI am still happy with my decision to leave the city (Delhi) and move here with significantly cleaner air, lots of cool  natural places to hike and ride my bike to.\n\nother idiosyncrasies: \n\n1. The exploitation I see here is also next level. People that know basic things use that to make money from people for e.g. filling forms and taking them to the office to deposit the form.\n\n2. Another thing is the danger of credit, people making 2 to 2.5L p.a. are buying bikes worth 3L on long high interest emis with no investment other than fd and what's in the bank.\n\n3. Business that have all but disappeared from cities are thriving here at the moment. People who have money keep opening businesses and pay 2-3k to people for the jobs that pay atleast 7-8k in small cities.\n\n4. Someone tried to teach the people to seperate organic waste from non organic and people here didn't accept it. The guy had to hire people to do the sorting and eventually gave up now the people throw trash on empty lots and every now and then set fire to it.\nThey think I am crazy because i take my trash to the trash depot a few kilometres away.\n\nI could go on forever but I will stop here.\nI hope it was a good read.\n\nP.s.\nThought I would include some images.",
    "flair": "Rant / Vent",
    "score": 311,
    "num_comments": 50,
    "created_utc": 1702292951.0,
    "convurl": "https://i.redd.it/u7g9kgxten5c1.jpg",
    "comments": [
        "Disheartening to hear the situation in our smaller cities. If there was more equitable progress across the country, we would all benefit. PS. the pup is so cute! Hope you gave it a pat/treat.",
        "Please go on I want to know more",
        "Hope the situation changes otherwise I can see the inequality will keep rising. \nPeople don't even know they are being exploited but even if they did they don't have options.\nYes I pet him and played with him. I have a video as well didn't see the option to upload.",
        "What's this place?",
        "Biharigarh ke aaas paas lag raha ye toh.",
        "It's in the northern part of west bengal. If you want to go to the north east via road you pad through here.",
        "Hey Op, would like to ask you how you deal with socialising. Do you have friends there? If no, doesn't it get boring after a while? I aksed because I doubt your other city friends got a similar opportunity to move away from main city.",
        "It's in North Bengal close to Bihar in comparison to Kolkata.",
        "Oh cool!",
        "The tea garden and paddy field looks like somewhere in North Bengal",
        "The tea garden and paddy field looks like somewhere in North Bengal.",
        "Oh boy.\n- Women that are actually empowered but face a sort of discrimination. They get treated differently when they try to work.\n-A very clear section of people that are called to do cleaning work like cleaning drains and sanitation tanks.\nMany don't let them in the house and give them water in a bathing mug.\n-When one of them goes up in economic status they get hate and are reminded \"where they came from\".\nAll of this isn't subtle but done openly and is seen as acceptable.\n-Absolutely no rules being followed, do whatever you want.\nOverpaid government employees who still take bribes.\nGovernment employees buying land worth crores and making houses worth the same.\n-the crazy lack of education and educated people.\n- to many jhola chaap doctors\n And more.",
        "OK.. I believe somewhere near Dooars..if I am correct?",
        "Yep.",
        "I think u need to move to a tier 3 city not a village",
        "Interesting observations. I've observed similar differences between big and small cities. Other smaller things include maybe that shops etc get closed quite early and almost everything is closed by 9-10 pm, whereas in the city, many places will stay open. Also I observed that people aren't that punctual or professional in villages. They'll randomly keep their shop or stall closed one day just cuz they didn't feel like or there was some relatives' function. You can't expect your work to be done in time.",
        "I have lots of cousins here, we hang out.\nI go on bike rides and hikes all the time so that occupies a lot of my time.\nI am an introvert so I don't require much to satisfy that social metre.\nNo one I would call a friend but I have relatives I talk to daily but they are old and cannot be categorised as friends.\nI talk on the phone with my friend and visit every now and then.",
        "I see. Thanks for answering. Cheers and enjoy the shit out of your current life!!",
        "I moved here because I have relatives here, a house and land otherwise I would have endured Delhi.\nI actually like the 4c temps in Delhi, I like to get cosy and work. After the work is done I make stuffed garlic bread and enjoy it with hot tea.\nGood ol winter day in my small apartment. Those memories will be cherished for life.",
        "Yep agreed observed those things here as well. \nAmong the most peculiar are medical stores closing and the lack of doctors.\nHere almost everything closes in the afternoons because people go home to eat and sleep. This was hilarious to me when I first came here and observed complete silence.",
        "Thanks. Will soon be growing some of my own veggies. Already own cows, goats and chickens.\nThe taste is completely different from what I used to get in cities.",
        "Amrood k pedh se aam nhi milte",
        "Indian society is facing a constipation problem. Situations here are sticky. You can't change that. Not even those problems which are in just their minds.",
        "Wah kya baat kahi hai. But yaha apply nahi hoti.\n\nDescribing an experience here. The experience of city boy moving to a small town.\nNot expecting city life here I have had enough of that.",
        "Wow 😲",
        ">A very clear section of people that are called to do cleaning work like cleaning drains and sanitation tanks.\nMany don't let them in the house and give them water in a bathing mug.\n-When one of them goes up in economic status they get hate and are reminded \"where they came from\".\nAll of this isn't subtle but done openly and is seen as acceptable.\n\nThat's clearly caste discrimination going on there. Even if outcasts improve their economic status, they still face discrimination. Not surprising, casteism is endemic in our small towns and villages.",
        "*Another thing is the danger of credit, people making 2 to 2.5L p.a. are buying bikes worth 3L on long high interest emis with no investment other than fd and what's in the bank.*\n\nThis happens in lot of places, not limited to rural areas.",
        "hey op, can I hijack your DM if you don't mind?",
        "Yes I guess that's right.\nI didn't have many people I knew who were like this, most were financially literate.\nI knew some colleagues that were always out of money..\nA debt spiral will be deadly here no way to make more money unlike in cities. \nAlthough I must say I wrote the whole point wrong. I meant to say that people are being given lots of credit without any safeguards.\nPeople with no source of income are being handed credit cards which was strange to witness.",
        "I know this is obvious but let me emphasize it - if your salary is a lot higher than others around you then just shut the fuck up and try your best to blend in. Dont let their assumptions get to you and spill the truth.\n\nI don’t know about bengal but things can be bad in bihar if they have a good idea about how much you earn.",
        "Lol i regret choosing a course which wont give me wfh oppurtunities",
        "Share your recipe for garlic bread. \n\nBtw, is this a village or small town/kheda?  Do people of different castes live in same village or different villages?",
        "Education is the only solution",
        "That is what the problem is.\n\n *All the wealth of the world cannot help one little Indian village if the  people are not taught to help themselves. Our work should be mainly  educational, both moral and intellectual.              - Swami Vivekananda*\n\nPrivate schools that teach nothing and behave like government schools.\n\nGovernment school with no teachers. Teacher that don't show up till 11 AM and then leave by 12 noon, ask that everyone come to their tuition centers. As a result the poor are left behind and eventually drop out.\n\nThe education board here is more interested in showing off than real education, they create ridiculous syllabus which leads to cramming and then cut most of the syllabus when exams arrive, idiotic! The focus should be learning not cramming.\n\nI know a English Hons student that knows nothing about anything he is reading but will still clear the exams and get an hons. This person will gain the respect for having an hons but when is sent to the city or applies for a government job, do you think they will get it? And if they do, that is bad for the community he is sent to uplift.\n\nThis is Bengal but these bengalis have forgotten Swami Vivekananda words. People here are desperate for teachers for their kids and many ask me to teach their kids.\n\nI believe things will improve slowly as even though there is a lack of opportunity and infrastructure to study properly the will is there.",
        "WFH is awesome but has it's downsides.\n\nThey are slowly raising the productivity requirements which were already 20 percent higher than wfo.\n\nThey are talking about 12 hours work day everywhere, I dropped my last employer because they did it and without raising the compensation. I work more for less pay? how does that compute?\n\nWith the new employer I am here rumblings of the same.\n\nI am looking at alternate things I can do, I used to freelance and still do but it is very unstable.",
        "Why are you so bothered by what people think about you? Let them say whatever they want. You do whatever you want to do.\n\nThese people want to live in their ignorant, little world. Let them. Its not your job to educate people especially if you have already tried and they have not responded favourably.",
        "Were you coerced into relocating to a small town? I presume not. It was your decision, and every choice carries consequences. How can you expect individuals in a confined geographical setting, who, as per your observations, likely haven't ventured beyond it for most of their lives, to possess a wealth of life experiences?\n\nThis post appears to adopt a moral high ground, portraying those in small towns as worthless or narrow-minded. The truth is, they've crafted their lives based on their constrained experiences. When it comes to hygiene and waste management, Delhi might not be the exemplar other towns or cities should emulate. Moreover, Delhites don't exactly enjoy the best reputation nationwide, negating the credibility of such admonitions.",
        "Very interesting read. Thanks for posting.",
        ">casteism is endemic in our small towns and villages.\n\nin cities as well, let's not discount that ok. In villages and small towns it's in your face whereas in cities, it is subtle, which is even worse imo.",
        "Cannot help you with how you perceive things. These were just observations, experiences and contrast in societal structures and behaviours.\nDidn't complain or say that I expected this or that.\nAt no point did I say small towns were \"worthless\" but yes narrow mindedness is a reality here.\nWaste management doesn't exists here and that too was to show the narrow mindedness and the lack of willingness to change.\nYou should really read the post again and not draw your own inferences.\nI request you to take the post for what it is and don't overthink it.",
        "Yes that's true and that's why I wrote \"I haven't said a word and not going to either.\"\n\nI mind my own business and help ones that seek it.",
        "My pleasure. Happy to hear you enjoyed it.",
        "That's the right way to go.",
        "Recipe: It's the one on every Indian YT channel. I add an egg and butter to the recipes so need to knead more and add a bit more flour. I put whatever I have in the fridge like corn or keema as the stuffing and sometimes left over Chinese. All that with ozzy cheese of course. I always have per-prepared garlic butter.\n\nIt's a small town earlier the economy was based on sales tax but after GST a massive disruption happened and now business is the main reason for economic growth along with a regular inflow of parents and students that come for coaching for the JNVST exams which creates income from rent. Farming is still a big part but doesn't generate enough money for the people.\n\nThere is no caste issue as such, we have majority Hindus, Christians come in a close second. There are primarily tribes here that people often refer to instead of religion but not what you would think when I say tribe, they are normal looking people living like regular folks but when festivals come they celebrate them slightly different and sing tribal songs with tribal dance.\n\nTribes have intermixed as well now, a decade ago it created a fuss but now it's all good no one even bats an eye.\n\nThis place is awesome especially if you are into nature, bird watching and activities like hiking. This place made me realize how you don't need much to live life and feel fulfilled. Families feast together, go on picnics with homemade food which is something I missed a lot living alone in Delhi.\n\nThis is an awesome environment with some flaws as mentioned in the post.",
        "What I'm getting at is, they never really got that shot to be better. For most, the privilege to pack up and hit the big cities, broaden their horizons, is just out of reach. And even for the few who manage it, they often bid farewell. But here's the twist—beyond the bulk of negative observations, there's a real beauty to the small-town vibe. The sense of community, the laidback pace, and the sheer gift of pristine air and water—those are the uncelebrated gems that make small-town life special.",
        "Interesting read. May I ask what your long term plan is?",
        "I live here now. I think I didn't do a good job, I have relatives here and family.\nI plan to travel accross India on a bike and a bicycle to fully utilise my wfh aa long as I have it, probably a few years.\nIf I am able to successfully execute the plan I have I can quit my job and travel.",
        "> For most, the privilege to pack up and hit the big cities, broaden their horizons, is just out of reach.  \n\nMate everyone has that opportunity. Have you met Biharis? Their state is a mess so many Biharis just up and leave because they can, **it's not a privilege**. Many people do it , it's about desire and willingness.\n\n&#x200B;\n\n> The sense of community, the laid back pace, and the sheer gift of  pristine air and water—those are the uncelebrated gems that make  small-town life special. \n\nYes. I know. That is why I left the city.\n\nThis is why I keep writing, read the post again.\n\nThis is literally what I wrote : \" *I am still happy with my decision to leave the city (Delhi) and move here with significantly cleaner air, lots of cool  natural places to  hike and ride my bike to.* \"\n\nP.s. I recently started reading Resurrection. What do you think of Dostoevsky? took me some time but I started enjoying his writings after a few months.\n\nAlso any new books from recent years you would recommend? I am having trouble finding anything I enjoy other than sci-fi books, Ted Chiang being the main writer I keep an eye out for.",
        "Wtf my puppy doing their.\n\nhttps://preview.redd.it/jcprrkynr16c1.jpeg?width=3024&format=pjpg&auto=webp&s=43c8e718d21aa12c57848af8b7076888967d0818",
        "Yup in Bihar they might kidnap you and marry their daughter to you at gun point.",
        "You're giving sachiv ji vibes from panchayat ,😅.\nLiterally panchayat web series ki yaad agyi isko padhne ke baad",
        "Is this Dooars?"
    ],
    "cleaned_text": "moved small town delhi facing small town idiosyncrasy got work home moved small town people starving jobs jobs menial idea working online freelancing working foreign comanies alien even thought people somehow honours degrees zero knowledge capabilities college passout would naturally develop reason post recently learned relatives think dont work talk became frequent bought necessities like bike cycle think dad bought thos happens people moneymy dad always taught us make money gave us necessary havent said word going either people could asked issue told however dont understand even told go around discussing relatives places work literally small fraction currently make dont show wear ragged clothes live like everyone eat rice dal everyday capable make pizza cake home people seem think someone money show buying big cars invest money buy things remain house zero desire show people people make k month would show make someone look small intentionally avoid talk much make saying make enough people way much time hands waste social arguments non sense things aversion change next level still happy decision leave city delhi move significantly cleaner air lots cool natural places hike ride bike idiosyncrasies exploitation see also next level people know basic things use make money people eg filling forms taking office deposit form another thing danger credit people making l pa buying bikes worth l long high interest emis investment fd whats bank business disappeared cities thriving moment people money keep opening businesses pay k people jobs pay atleast k small cities someone tried teach people seperate organic waste non organic people didnt accept guy hire people sorting eventually gave people throw trash empty lots every set fire think crazy take trash trash depot kilometres away could go forever stop hope good read ps thought would include images ",
    "cleaned_title": "moved small town delhi facing small town idiosyncrasy",
    "cleaned_selftext": "got work home moved small town people starving jobs jobs menial idea working online freelancing working foreign comanies alien even thought people somehow honours degrees zero knowledge capabilities college passout would naturally develop reason post recently learned relatives think dont work talk became frequent bought necessities like bike cycle think dad bought thos happens people moneymy dad always taught us make money gave us necessary havent said word going either people could asked issue told however dont understand even told go around discussing relatives places work literally small fraction currently make dont show wear ragged clothes live like everyone eat rice dal everyday capable make pizza cake home people seem think someone money show buying big cars invest money buy things remain house zero desire show people people make k month would show make someone look small intentionally avoid talk much make saying make enough people way much time hands waste social arguments non sense things aversion change next level still happy decision leave city delhi move significantly cleaner air lots cool natural places hike ride bike idiosyncrasies exploitation see also next level people know basic things use make money people eg filling forms taking office deposit form another thing danger credit people making l pa buying bikes worth l long high interest emis investment fd whats bank business disappeared cities thriving moment people money keep opening businesses pay k people jobs pay atleast k small cities someone tried teach people seperate organic waste non organic people didnt accept guy hire people sorting eventually gave people throw trash empty lots every set fire think crazy take trash trash depot kilometres away could go forever stop hope good read ps thought would include images",
    "cleaned_comments": "disheartening hear situation smaller cities equitable progress across country would benefit ps pup cute hope gave pattreat please go want know hope situation changes otherwise see inequality keep rising people dont even know exploited even dont options yes pet played video well didnt see option upload whats place biharigarh ke aaas paas lag raha ye toh northern part west bengal want go north east via road pad hey op would like ask deal socialising friends doesnt get boring aksed doubt city friends got similar opportunity move away main city north bengal close bihar comparison kolkata oh cool tea garden paddy field looks like somewhere north bengal tea garden paddy field looks like somewhere north bengal oh boy women actually empowered face sort discrimination get treated differently try work clear section people called cleaning work like cleaning drains sanitation tanks many dont let house give water bathing mug one goes economic status get hate reminded came isnt subtle done openly seen acceptable absolutely rules followed whatever want overpaid government employees still take bribes government employees buying land worth crores making houses worth crazy lack education educated people many jhola chaap doctors ok believe somewhere near dooarsif correct yep think u need move tier city village interesting observations ive observed similar differences big small cities smaller things include maybe shops etc get closed quite early almost everything closed pm whereas city many places stay open also observed people arent punctual professional villages theyll randomly keep shop stall closed one day cuz didnt feel like relatives function cant expect work done time lots cousins hang go bike rides hikes time occupies lot time introvert dont require much satisfy social metre one would call friend relatives talk daily old categorised friends talk phone friend visit every see thanks answering cheers enjoy shit current life moved relatives house land otherwise would endured delhi actually like c temps delhi like get cosy work work done make stuffed garlic bread enjoy hot tea good ol winter day small apartment memories cherished life yep agreed observed things well among peculiar medical stores closing lack doctors almost everything closes afternoons people go home eat sleep hilarious first came observed complete silence thanks soon growing veggies already cows goats chickens taste completely different used get cities amrood k pedh se aam nhi milte indian society facing constipation problem situations sticky cant change even problems minds wah kya baat kahi hai yaha apply nahi hoti describing experience experience city boy moving small town expecting city life enough wow clear section people called cleaning work like cleaning drains sanitation tanks many dont let house give water bathing mug one goes economic status get hate reminded came isnt subtle done openly seen acceptable thats clearly caste discrimination going even outcasts improve economic status still face discrimination surprising casteism endemic small towns villages another thing danger credit people making l pa buying bikes worth l long high interest emis investment fd whats bank happens lot places limited rural areas hey op hijack dm dont mind yes guess thats right didnt many people knew like financially literate knew colleagues always money debt spiral deadly way make money unlike cities although must say wrote whole point wrong meant say people given lots credit without safeguards people source income handed credit cards strange witness know obvious let emphasize salary lot higher others around shut fuck try best blend dont let assumptions get spill truth dont know bengal things bad bihar good idea much earn lol regret choosing course wont give wfh oppurtunities share recipe garlic bread btw village small townkheda people different castes live village different villages education solution problem wealth world help one little indian village people taught help work mainly educational moral intellectual swami vivekananda private schools teach nothing behave like government schools government school teachers teacher dont show till leave noon ask everyone come tuition centers result poor left behind eventually drop education board interested showing real education create ridiculous syllabus leads cramming cut syllabus exams arrive idiotic focus learning cramming know english hons student knows nothing anything reading still clear exams get hons person gain respect hons sent city applies government job think get bad community sent uplift bengal bengalis forgotten swami vivekananda words people desperate teachers kids many ask teach kids believe things improve slowly even though lack opportunity infrastructure study properly wfh awesome downsides slowly raising productivity requirements already percent higher wfo talking hours work day everywhere dropped last employer without raising compensation work less pay compute new employer rumblings looking alternate things used freelance still unstable bothered people think let say whatever want whatever want people want live ignorant little world let job educate people especially already tried responded favourably coerced relocating small town presume decision every choice carries consequences expect individuals confined geographical setting per observations likely havent ventured beyond lives possess wealth life experiences post appears adopt moral high ground portraying small towns worthless narrowminded truth theyve crafted lives based constrained experiences comes hygiene waste management delhi might exemplar towns cities emulate moreover delhites dont exactly enjoy best reputation nationwide negating credibility admonitions interesting read thanks posting casteism endemic small towns villages cities well lets discount ok villages small towns face whereas cities subtle even worse imo help perceive things observations experiences contrast societal structures behaviours didnt complain say expected point say small towns worthless yes narrow mindedness reality waste management doesnt exists show narrow mindedness lack willingness change really read post draw inferences request take post dont overthink yes thats true thats wrote havent said word going either mind business help ones seek pleasure happy hear enjoyed thats right way go recipe one every indian yt channel add egg butter recipes need knead add bit flour put whatever fridge like corn keema stuffing sometimes left chinese ozzy cheese course always perprepared garlic butter small town earlier economy based sales tax gst massive disruption happened business main reason economic growth along regular inflow parents students come coaching jnvst exams creates income rent farming still big part doesnt generate enough money people caste issue majority hindus christians come close second primarily tribes people often refer instead religion would think say tribe normal looking people living like regular folks festivals come celebrate slightly different sing tribal songs tribal dance tribes intermixed well decade ago created fuss good one even bats eye place awesome especially nature bird watching activities like hiking place made realize dont need much live life feel fulfilled families feast together go picnics homemade food something missed lot living alone delhi awesome environment flaws mentioned post im getting never really got shot better privilege pack hit big cities broaden horizons reach even manage often bid farewell heres twistbeyond bulk negative observations theres real beauty smalltown vibe sense community laidback pace sheer gift pristine air waterthose uncelebrated gems make smalltown life special interesting read may ask long term plan live think didnt good job relatives family plan travel accross india bike bicycle fully utilise wfh aa long probably years able successfully execute plan quit job travel privilege pack hit big cities broaden horizons reach mate everyone opportunity met biharis state mess many biharis leave privilege many people desire willingness xb sense community laid back pace sheer gift pristine air waterthose uncelebrated gems make smalltown life special yes know left city keep writing read post literally wrote still happy decision leave city delhi move significantly cleaner air lots cool natural places hike ride bike ps recently started reading resurrection think dostoevsky took time started enjoying writings months also new books recent years would recommend trouble finding anything enjoy scifi books ted chiang main writer keep eye wtf puppy yup bihar might kidnap marry daughter gun point youre giving sachiv ji vibes panchayat literally panchayat web series ki yaad agyi isko padhne ke baad dooars",
    "light_cleaned_title": "Moved to a small town from Delhi. Facing small town idiosyncrasy.",
    "light_cleaned_selftext": "I got work from home and moved to a small town. The people here are starving for jobs and most jobs are menial. The idea of working online, freelancing and working for foreign comanies is alien and not even thought of here. People here somehow have honours degrees with zero knowledge or capabilities that a college passout would naturally develop. The reason for the post: I recently learned that my relatives think I don't work, the talk became more frequent when I bought necessities like a bike and a cycle. They think my dad bought me thos as that is what happens here with people who have some money,my dad has always taught us to make our own money and only gave us what was necessary. I haven't said a word and not going to either. These people could have just asked but the issue is I have told them however they don't understand it and even after being told they go around discussing with other relatives about places I can work at for literally a very small fraction of what I currently make. I don't show off, I wear ragged clothes and live like everyone here I eat rice and dal everyday but because I am capable I make myself a pizza or cake at home. People here seem to think if someone has money they should show off by buying big cars, I invest my money and buy things that remain in my house and I have zero desire to show people any of it. People here make 5k a month, why would I show off and make someone look small. I intentionally avoid the talk of how much I make by saying I make enough. People here have way too much time on their hands and waste it with social arguments over non sense things. The aversion to change is next level. I am still happy with my decision to leave the city (Delhi) and move here with significantly cleaner air, lots of cool natural places to hike and ride my bike to. other idiosyncrasies: 1. The exploitation I see here is also next level. People that know basic things use that to make money from people for e.g. filling forms and taking them to the office to deposit the form. 2. Another thing is the danger of credit, people making 2 to 2.5L p.a. are buying bikes worth 3L on long high interest emis with no investment other than fd and what's in the bank. 3. Business that have all but disappeared from cities are thriving here at the moment. People who have money keep opening businesses and pay 2-3k to people for the jobs that pay atleast 7-8k in small cities. 4. Someone tried to teach the people to seperate organic waste from non organic and people here didn't accept it. The guy had to hire people to do the sorting and eventually gave up now the people throw trash on empty lots and every now and then set fire to it. They think I am crazy because i take my trash to the trash depot a few kilometres away. I could go on forever but I will stop here. I hope it was a good read. P.s. Thought I would include some images.",
    "light_cleaned_comments": "Disheartening to hear the situation in our smaller cities. If there was more equitable progress across the country, we would all benefit. PS. the pup is so cute! Hope you gave it a pat/treat. Please go on I want to know more Hope the situation changes otherwise I can see the inequality will keep rising. People don't even know they are being exploited but even if they did they don't have options. Yes I pet him and played with him. I have a video as well didn't see the option to upload. What's this place? Biharigarh ke aaas paas lag raha ye toh. It's in the northern part of west bengal. If you want to go to the north east via road you pad through here. Hey Op, would like to ask you how you deal with socialising. Do you have friends there? If no, doesn't it get boring after a while? I aksed because I doubt your other city friends got a similar opportunity to move away from main city. It's in North Bengal close to Bihar in comparison to Kolkata. Oh cool! The tea garden and paddy field looks like somewhere in North Bengal The tea garden and paddy field looks like somewhere in North Bengal. Oh boy. - Women that are actually empowered but face a sort of discrimination. They get treated differently when they try to work. -A very clear section of people that are called to do cleaning work like cleaning drains and sanitation tanks. Many don't let them in the house and give them water in a bathing mug. -When one of them goes up in economic status they get hate and are reminded \"where they came from\". All of this isn't subtle but done openly and is seen as acceptable. -Absolutely no rules being followed, do whatever you want. Overpaid government employees who still take bribes. Government employees buying land worth crores and making houses worth the same. -the crazy lack of education and educated people. - to many jhola chaap doctors And more. OK.. I believe somewhere near Dooars..if I am correct? Yep. I think u need to move to a tier 3 city not a village Interesting observations. I've observed similar differences between big and small cities. Other smaller things include maybe that shops etc get closed quite early and almost everything is closed by 9-10 pm, whereas in the city, many places will stay open. Also I observed that people aren't that punctual or professional in villages. They'll randomly keep their shop or stall closed one day just cuz they didn't feel like or there was some relatives' function. You can't expect your work to be done in time. I have lots of cousins here, we hang out. I go on bike rides and hikes all the time so that occupies a lot of my time. I am an introvert so I don't require much to satisfy that social metre. No one I would call a friend but I have relatives I talk to daily but they are old and cannot be categorised as friends. I talk on the phone with my friend and visit every now and then. I see. Thanks for answering. Cheers and enjoy the shit out of your current life!! I moved here because I have relatives here, a house and land otherwise I would have endured Delhi. I actually like the 4c temps in Delhi, I like to get cosy and work. After the work is done I make stuffed garlic bread and enjoy it with hot tea. Good ol winter day in my small apartment. Those memories will be cherished for life. Yep agreed observed those things here as well. Among the most peculiar are medical stores closing and the lack of doctors. Here almost everything closes in the afternoons because people go home to eat and sleep. This was hilarious to me when I first came here and observed complete silence. Thanks. Will soon be growing some of my own veggies. Already own cows, goats and chickens. The taste is completely different from what I used to get in cities. Amrood k pedh se aam nhi milte Indian society is facing a constipation problem. Situations here are sticky. You can't change that. Not even those problems which are in just their minds. Wah kya baat kahi hai. But yaha apply nahi hoti. Describing an experience here. The experience of city boy moving to a small town. Not expecting city life here I have had enough of that. Wow 😲 >A very clear section of people that are called to do cleaning work like cleaning drains and sanitation tanks. Many don't let them in the house and give them water in a bathing mug. -When one of them goes up in economic status they get hate and are reminded \"where they came from\". All of this isn't subtle but done openly and is seen as acceptable. That's clearly caste discrimination going on there. Even if outcasts improve their economic status, they still face discrimination. Not surprising, casteism is endemic in our small towns and villages. *Another thing is the danger of credit, people making 2 to 2.5L p.a. are buying bikes worth 3L on long high interest emis with no investment other than fd and what's in the bank.* This happens in lot of places, not limited to rural areas. hey op, can I hijack your DM if you don't mind? Yes I guess that's right. I didn't have many people I knew who were like this, most were financially literate. I knew some colleagues that were always out of money.. A debt spiral will be deadly here no way to make more money unlike in cities. Although I must say I wrote the whole point wrong. I meant to say that people are being given lots of credit without any safeguards. People with no source of income are being handed credit cards which was strange to witness. I know this is obvious but let me emphasize it - if your salary is a lot higher than others around you then just shut the fuck up and try your best to blend in. Dont let their assumptions get to you and spill the truth. I don’t know about bengal but things can be bad in bihar if they have a good idea about how much you earn. Lol i regret choosing a course which wont give me wfh oppurtunities Share your recipe for garlic bread. Btw, is this a village or small town/kheda? Do people of different castes live in same village or different villages? Education is the only solution That is what the problem is. *All the wealth of the world cannot help one little Indian village if the people are not taught to help themselves. Our work should be mainly educational, both moral and intellectual. - Swami Vivekananda* Private schools that teach nothing and behave like government schools. Government school with no teachers. Teacher that don't show up till 11 AM and then leave by 12 noon, ask that everyone come to their tuition centers. As a result the poor are left behind and eventually drop out. The education board here is more interested in showing off than real education, they create ridiculous syllabus which leads to cramming and then cut most of the syllabus when exams arrive, idiotic! The focus should be learning not cramming. I know a English Hons student that knows nothing about anything he is reading but will still clear the exams and get an hons. This person will gain the respect for having an hons but when is sent to the city or applies for a government job, do you think they will get it? And if they do, that is bad for the community he is sent to uplift. This is Bengal but these bengalis have forgotten Swami Vivekananda words. People here are desperate for teachers for their kids and many ask me to teach their kids. I believe things will improve slowly as even though there is a lack of opportunity and infrastructure to study properly the will is there. WFH is awesome but has it's downsides. They are slowly raising the productivity requirements which were already 20 percent higher than wfo. They are talking about 12 hours work day everywhere, I dropped my last employer because they did it and without raising the compensation. I work more for less pay? how does that compute? With the new employer I am here rumblings of the same. I am looking at alternate things I can do, I used to freelance and still do but it is very unstable. Why are you so bothered by what people think about you? Let them say whatever they want. You do whatever you want to do. These people want to live in their ignorant, little world. Let them. Its not your job to educate people especially if you have already tried and they have not responded favourably. Were you coerced into relocating to a small town? I presume not. It was your decision, and every choice carries consequences. How can you expect individuals in a confined geographical setting, who, as per your observations, likely haven't ventured beyond it for most of their lives, to possess a wealth of life experiences? This post appears to adopt a moral high ground, portraying those in small towns as worthless or narrow-minded. The truth is, they've crafted their lives based on their constrained experiences. When it comes to hygiene and waste management, Delhi might not be the exemplar other towns or cities should emulate. Moreover, Delhites don't exactly enjoy the best reputation nationwide, negating the credibility of such admonitions. Very interesting read. Thanks for posting. >casteism is endemic in our small towns and villages. in cities as well, let's not discount that ok. In villages and small towns it's in your face whereas in cities, it is subtle, which is even worse imo. Cannot help you with how you perceive things. These were just observations, experiences and contrast in societal structures and behaviours. Didn't complain or say that I expected this or that. At no point did I say small towns were \"worthless\" but yes narrow mindedness is a reality here. Waste management doesn't exists here and that too was to show the narrow mindedness and the lack of willingness to change. You should really read the post again and not draw your own inferences. I request you to take the post for what it is and don't overthink it. Yes that's true and that's why I wrote \"I haven't said a word and not going to either.\" I mind my own business and help ones that seek it. My pleasure. Happy to hear you enjoyed it. That's the right way to go. Recipe: It's the one on every Indian YT channel. I add an egg and butter to the recipes so need to knead more and add a bit more flour. I put whatever I have in the fridge like corn or keema as the stuffing and sometimes left over Chinese. All that with ozzy cheese of course. I always have per-prepared garlic butter. It's a small town earlier the economy was based on sales tax but after GST a massive disruption happened and now business is the main reason for economic growth along with a regular inflow of parents and students that come for coaching for the JNVST exams which creates income from rent. Farming is still a big part but doesn't generate enough money for the people. There is no caste issue as such, we have majority Hindus, Christians come in a close second. There are primarily tribes here that people often refer to instead of religion but not what you would think when I say tribe, they are normal looking people living like regular folks but when festivals come they celebrate them slightly different and sing tribal songs with tribal dance. Tribes have intermixed as well now, a decade ago it created a fuss but now it's all good no one even bats an eye. This place is awesome especially if you are into nature, bird watching and activities like hiking. This place made me realize how you don't need much to live life and feel fulfilled. Families feast together, go on picnics with homemade food which is something I missed a lot living alone in Delhi. This is an awesome environment with some flaws as mentioned in the post. What I'm getting at is, they never really got that shot to be better. For most, the privilege to pack up and hit the big cities, broaden their horizons, is just out of reach. And even for the few who manage it, they often bid farewell. But here's the twist—beyond the bulk of negative observations, there's a real beauty to the small-town vibe. The sense of community, the laidback pace, and the sheer gift of pristine air and water—those are the uncelebrated gems that make small-town life special. Interesting read. May I ask what your long term plan is? I live here now. I think I didn't do a good job, I have relatives here and family. I plan to travel accross India on a bike and a bicycle to fully utilise my wfh aa long as I have it, probably a few years. If I am able to successfully execute the plan I have I can quit my job and travel. > For most, the privilege to pack up and hit the big cities, broaden their horizons, is just out of reach. Mate everyone has that opportunity. Have you met Biharis? Their state is a mess so many Biharis just up and leave because they can, **it's not a privilege**. Many people do it , it's about desire and willingness. &#x200B; > The sense of community, the laid back pace, and the sheer gift of pristine air and water—those are the uncelebrated gems that make small-town life special. Yes. I know. That is why I left the city. This is why I keep writing, read the post again. This is literally what I wrote : \" *I am still happy with my decision to leave the city (Delhi) and move here with significantly cleaner air, lots of cool natural places to hike and ride my bike to.* \" P.s. I recently started reading Resurrection. What do you think of Dostoevsky? took me some time but I started enjoying his writings after a few months. Also any new books from recent years you would recommend? I am having trouble finding anything I enjoy other than sci-fi books, Ted Chiang being the main writer I keep an eye out for. Wtf my puppy doing their. Yup in Bihar they might kidnap you and marry their daughter to you at gun point. You're giving sachiv ji vibes from panchayat ,😅. Literally panchayat web series ki yaad agyi isko padhne ke baad Is this Dooars?"
}