{
    "id": "15jx3xt",
    "title": "Mumbai-Pune expressway troubles!",
    "url": "https://www.reddit.com/gallery/15jx3xt",
    "selftext": "Recently read that, the government is putting 2 new faster lanes on the Mumbai-Pune expressway to ease traffic issues. \nI wonder what about those massive bottle necks at the tollbooths, what are they doing about that?\nI heard they are doing those barrier free toll booths. I mean HOW HARD COULD IT BE!?\nThere is no info about construction sites on the expressway, there are random dips and ditches in the road. The patch near lonavala is so horrible, it has deformed patches on the road.\nI mean, it's a pain to see our cars suffer, even after we pay for the roads as countrymen.\nDon't we deserve better roads as such.\nThe expressway was a driving heaven before...it's not anymore :(\nJust a random post travel rant.\nPardon me if I am unaware of something",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691347437.0,
    "convurl": "https://i.redd.it/aj32v2macjgb1.jpg",
    "comments": [
        "Image source\n https://www.dnaindia.com/mumbai/report-heads-up-13-blocks-on-mumbai-pune-expressway-from-today-2659766/amp\n\nhttps://www.google.com/amp/s/www.mumbailive.com/amp/hi/infrastructure/pune-mumbai-journey-now-faster-two-new-lanes-will-be-created-on-mumbai-pune-expressway-80203",
        "my minister friend who is responsible for all this and his associates just use a helicopter n tax payer money he tell that no matter wat u people will pay tax so why bother doing anything until its too late, can u explain if u have so much problem why u pay tax/toll etc?",
        "This happens because during uphill part of the ghat, heavy trucks take middle & right lane. They get stuck or climb in very low speed. Thus, blocking everything behind them."
    ],
    "cleaned_text": "mumbaipune expressway troubles recently read government putting new faster lanes mumbaipune expressway ease traffic issues wonder massive bottle necks tollbooths heard barrier free toll booths mean hard could info construction sites expressway random dips ditches road patch near lonavala horrible deformed patches road mean pain see cars suffer even pay roads countrymen dont deserve better roads expressway driving heaven beforeits anymore random post travel rant pardon unaware something ",
    "cleaned_title": "mumbaipune expressway troubles",
    "cleaned_selftext": "recently read government putting new faster lanes mumbaipune expressway ease traffic issues wonder massive bottle necks tollbooths heard barrier free toll booths mean hard could info construction sites expressway random dips ditches road patch near lonavala horrible deformed patches road mean pain see cars suffer even pay roads countrymen dont deserve better roads expressway driving heaven beforeits anymore random post travel rant pardon unaware something",
    "cleaned_comments": "image source minister friend responsible associates use helicopter n tax payer money tell matter wat u people pay tax bother anything late u explain u much problem u pay taxtoll etc happens uphill part ghat heavy trucks take middle right lane get stuck climb low speed thus blocking everything behind",
    "light_cleaned_title": "Mumbai-Pune expressway troubles!",
    "light_cleaned_selftext": "Recently read that, the government is putting 2 new faster lanes on the Mumbai-Pune expressway to ease traffic issues. I wonder what about those massive bottle necks at the tollbooths, what are they doing about that? I heard they are doing those barrier free toll booths. I mean HOW HARD COULD IT BE!? There is no info about construction sites on the expressway, there are random dips and ditches in the road. The patch near lonavala is so horrible, it has deformed patches on the road. I mean, it's a pain to see our cars suffer, even after we pay for the roads as countrymen. Don't we deserve better roads as such. The expressway was a driving heaven before...it's not anymore :( Just a random post travel rant. Pardon me if I am unaware of something",
    "light_cleaned_comments": "Image source my minister friend who is responsible for all this and his associates just use a helicopter n tax payer money he tell that no matter wat u people will pay tax so why bother doing anything until its too late, can u explain if u have so much problem why u pay tax/toll etc? This happens because during uphill part of the ghat, heavy trucks take middle & right lane. They get stuck or climb in very low speed. Thus, blocking everything behind them."
}