{
    "id": "1bdqmoc",
    "title": "I did it, so that you don’t have to do it!",
    "url": "https://www.reddit.com/gallery/1bdqmoc",
    "selftext": "Played along with a scammer & earned 150!! Will give it to someone needy!",
    "flair": "Crime",
    "score": 43,
    "num_comments": 24,
    "created_utc": 1710334125.0,
    "convurl": "https://i.redd.it/f8c22kagl3oc1.jpg",
    "comments": [
        "isnt giving bank details dangerous dude",
        "Gave them an account which I never use! Has Zero balance!",
        "Gave them an account which I never use! Has Zero balance!",
        "ohh nicee then",
        "Mujhe bhi refer kardo plej😂",
        "I did this as well, took my free 150 and left and deleted the review later.",
        "Is it safe to give bank details like that. I always try to coerce them into Google paying me but it never works",
        "I don’t use that account. Has zero balance. Scam me 😂",
        "Your account might get freezed if they get caught.Better not to have any transaction from these scammers.",
        "Damn so far I've got 10 msgs from such scammers instead of blocking would've earned 1500 😅",
        "This. I also earned 150/200 4-5 times but then I heard they can freeze your account if they trace money into your account by one of these scamsters. It's not worth it if that's your main account.",
        "Still it has risks of identity thefts even if an empty account",
        "You did well, but with the right kind of technical expertise they can trace your other bank and personal details with your given bank details. People who deal in scamming and spamming can resort to anything.",
        "Well, they blocked me because I was talking to them. No one wants to be my friend. :(",
        "Lol. Well played",
        "Koi bechare Gunbir Sachiv ka 30k bachao yaar.",
        "Official receptionist??150 salary??  Lol these guys are fucked in the head",
        "Yaha tak to sab pahoch jaye hai. Uske baad kya?!",
        "Iske baad you invest & get double /s",
        "Man, these people are so abusive if you let them know that they are scammers.",
        "Ganbir Sachiv: I will go for 30k 💀",
        "#I gave them my Paytm Bank Account. Krte rho freeze. Yahan Bank freeze ho gya hai 😂",
        "I have earned enough to buy a perfume from me"
    ],
    "cleaned_text": "dont played along scammer earned give someone needy ",
    "cleaned_title": "dont",
    "cleaned_selftext": "played along scammer earned give someone needy",
    "cleaned_comments": "isnt giving bank details dangerous dude gave account never use zero balance gave account never use zero balance ohh nicee mujhe bhi refer kardo plej well took free left deleted review later safe give bank details like always try coerce google paying never works dont use account zero balance scam account might get freezed get caughtbetter transaction scammers damn far ive got msgs scammers instead blocking wouldve earned also earned times heard freeze account trace money account one scamsters worth thats main account still risks identity thefts even empty account well right kind technical expertise trace bank personal details given bank details people deal scamming spamming resort anything well blocked talking one wants friend lol well played koi bechare gunbir sachiv ka k bachao yaar official receptionist salary lol guys fucked head yaha tak sab pahoch jaye hai uske baad kya iske baad invest get double man people abusive let know scammers ganbir sachiv go k gave paytm bank account krte rho freeze yahan bank freeze ho gya hai earned enough buy perfume",
    "light_cleaned_title": "I did it, so that you don’t have to do it!",
    "light_cleaned_selftext": "Played along with a scammer & earned 150!! Will give it to someone needy!",
    "light_cleaned_comments": "isnt giving bank details dangerous dude Gave them an account which I never use! Has Zero balance! Gave them an account which I never use! Has Zero balance! ohh nicee then Mujhe bhi refer kardo plej😂 I did this as well, took my free 150 and left and deleted the review later. Is it safe to give bank details like that. I always try to coerce them into Google paying me but it never works I don’t use that account. Has zero balance. Scam me 😂 Your account might get freezed if they get caught.Better not to have any transaction from these scammers. Damn so far I've got 10 msgs from such scammers instead of blocking would've earned 1500 😅 This. I also earned 150/200 4-5 times but then I heard they can freeze your account if they trace money into your account by one of these scamsters. It's not worth it if that's your main account. Still it has risks of identity thefts even if an empty account You did well, but with the right kind of technical expertise they can trace your other bank and personal details with your given bank details. People who deal in scamming and spamming can resort to anything. Well, they blocked me because I was talking to them. No one wants to be my friend. :( Lol. Well played Koi bechare Gunbir Sachiv ka 30k bachao yaar. Official receptionist??150 salary?? Lol these guys are fucked in the head Yaha tak to sab pahoch jaye hai. Uske baad kya?! Iske baad you invest & get double /s Man, these people are so abusive if you let them know that they are scammers. Ganbir Sachiv: I will go for 30k 💀 #I gave them my Paytm Bank Account. Krte rho freeze. Yahan Bank freeze ho gya hai 😂 I have earned enough to buy a perfume from me"
}