{
    "id": "1expdl5",
    "title": "Yes, India’s defence exports are booming, but guess who’s the biggest importer",
    "url": "https://theprint.in/defence/yes-indias-defence-exports-are-booming-but-guess-whos-the-biggest-importer/2231765/?amp=",
    "selftext": "It's US.",
    "flair": "Policy/Economy",
    "score": 27,
    "num_comments": 6,
    "created_utc": 1724246175.0,
    "convurl": "https://external-preview.redd.it/8vR5V8hC_KB69-YnMeZoKBO3CLGTiKR1hRF7mG6GloI.jpg?auto=webp&s=ea10b93b42c21177c5843213a9a9f27620b9faba",
    "comments": [
        "They're probably running low on supplies. It turns out that bombing kids in Gaza, maintaining the intensity of operations in Yemen and Syria, and arming American \"mental health patients\" with assault rifles to shoot school kids takes a toll on even the mightiest military-industrial complex in history.",
        "Good.",
        "Hmm..., if they fund a really good zombie apocalypse movie or a war movie that glories uncle Sam I'm sure the imports should keep on increasing.",
        "...does India export Army Boots?"
    ],
    "cleaned_text": "yes indias defence exports booming guess whos biggest importer us ",
    "cleaned_title": "yes indias defence exports booming guess whos biggest importer",
    "cleaned_selftext": "us",
    "cleaned_comments": "theyre probably running low supplies turns bombing kids gaza maintaining intensity operations yemen syria arming american mental health patients assault rifles shoot school kids takes toll even mightiest militaryindustrial complex history good hmm fund really good zombie apocalypse movie war movie glories uncle sam im sure imports keep increasing india export army boots",
    "light_cleaned_title": "Yes, India’s defence exports are booming, but guess who’s the biggest importer",
    "light_cleaned_selftext": "It's US.",
    "light_cleaned_comments": "They're probably running low on supplies. It turns out that bombing kids in Gaza, maintaining the intensity of operations in Yemen and Syria, and arming American \"mental health patients\" with assault rifles to shoot school kids takes a toll on even the mightiest military-industrial complex in history. Good. Hmm..., if they fund a really good zombie apocalypse movie or a war movie that glories uncle Sam I'm sure the imports should keep on increasing. ...does India export Army Boots?"
}