{
    "id": "18ruifq",
    "title": "Winter Session 2023: A Digital Rights Review",
    "url": "https://www.reddit.com/r/india/comments/18ruifq/winter_session_2023_a_digital_rights_review/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/6nh3zun3as8c1.png?width=1600&format=png&auto=webp&s=3a634a37b51599a53397cd2393f1f0d4256c51a6\n\n&#x200B;\n\n## tl;dr\n\nThe Winter Session of Parliament concluded on December 21, 2023, when both Houses of Parliament adjourned sine die a day before schedule. The Session saw the introduction of 12 bills and the passage of 19 Bills by both the Houses of Parliament. These include several key legislations, namely, the Telecommunications Bill, 2023 (Telecom Bill, 2023) and the three criminal reform bills. In this post, we look at how our Parliament performed from a digital rights perspective.\n\n## Why should you care?\n\nThis year, the Winter Session began on December 4  and concluded on December 21 sitting for a total of 18 days. While the Session saw many bills get the assent of Parliament, a worrying trend this Session was the lack of proper and meaningful discussion on legislation of paramount importance. The second half of the Parliament Winter Session was particularly notable as the Lok Sabha saw a security breach, post which [**100 MPs were suspended from the Lok Sabha and 46 from the Rajya Sabha**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in), accounting for 19% of the strength of each House. This is the highest number of suspensions in the [**history of Parliament**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in) so far. Strikingly, the suspended MPs all belonged to the opposition parties, which consequently led to the passage of crucial bills in both Houses, such as the Telecom Bill and the Criminal Law Bills, with minimal debate and little to no inputs from the opposition. \n\nAll 10 bills presented during this session were successfully passed. Furthermore, seven bills that were pending from previous sessions also received approval. Even though Lok Sabha [**functioned**](https://prsindia.org/sessiontrack/winter-session-2023/plan-performance?ref=static.internetfreedom.in) for 74% of its scheduled time, and Rajya Sabha for 81%, the expedited passage of significant legislations and the increased productivity was influenced by the suspension of several Members of Parliament, leading to swift approvals with limited deliberations and minimal input from the opposition.\n\nReflecting on the recently concluded session is imperative due to the passage of 17 bills with minimal amendments, especially given the circumstances of multiple suspensions.\n\n&#x200B;\n\n**Bills and Legislations concerning digital rights are:** \n\n### The Telecommunications Bill, 2023\n\nThe Telecom Bill, 2023 was introduced in the Lok Sabha on December 18, and passed in the Lok Sabha and Rajya Sabha on December 20 and 21 respectively. \n\nThe Telecommunications Bill, 2023, restructures the regulatory framework of the telecom sector, and was passed within three days of introduction. It was discussed for 1 hour and 4 minutes in [**Lok Sabha**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in) during which only 4 MPs spoke. The Telecommunications Bill was passed in [**Rajya Sabha**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in) after a debate lasting 1 hour 11 minutes only, during which, other than the Minister himself, only 7 MPs spoke. No Opposition MP participated in the debate. \n\nThe Telecom Bill, 2023, empowers the government to pause transmission and intercept messages \"during public emergencies to prevent incitement for committing offenses.\" This particular measure provides officials with significant authority to monitor and manage messages across the entire telecom network on the broad grounds of public safety. There is also uncertainty regarding the applicability of the Bill to Over-the-Top (OTT) communication services like WhatsApp.\n\nThe Telecom Bill, 2023, much like its 2022 counterpart, continues to hang on to the colonial provisions of its 1885 predecessor it purportedly aims to overhaul. It misses a huge opportunity to reform the telecommunication sector and create a rights-centric law that protects user rights instead of infringing on it. Read our first read of the Telecom Bill, 2023 [**here**](https://internetfreedom.in/first-read-telecom-bill-2023/?ref=static.internetfreedom.in#:~:text=The%20entirety%20of%20Clause%2020,to%20direct%20suspension%20of%20any).\n\n### Three criminal reform bills\n\nThree Bills replacing the Indian Penal Code, 1860, the Code of Criminal Procedure, 1973, and the Indian Evidence Act, 1872 were discussed and passed in the Lok Sabha and Rajya Sabha on December 19 and December 21 respectively. \n\nThe Bharatiya Nyaya (Second) Sanhita (BNS), 2023 (which seeks to replace the IPC), the Bharatiya Nagarik Suraksha (Second) Sanhita (BNSS), 2023 (which seeks to replace the CrPC) and the Bharatiya Sakshya (Second) Bill (BSB), 2023 (which seeks to replace the IEA) were [**referred**](https://drive.google.com/file/d/1USBPRyVJDqeNii3-3iuF2o-NN05SKIvz/view?ref=static.internetfreedom.in) to the Parliamentary Standing Committee on Home Affairs on August 18, 2023 by the Rajya Sabha Chairperson in consultation with the Lok Sabha Speaker for examination and report within three months. The review and recommendations of the Parliamentary Committee, spanning 15-4215-42 pages in 250-530 page reports, [**do not**](https://www.medianama.com/2023/11/223-parliamentary-committee-bharatiya-nyaya-sanhita/?ref=static.internetfreedom.in) adequately address the provisions of the bills affecting individual privacy, digital rights, and fundamental freedoms.\n\nOn December 11, Union Home Minister Amit Shah conveyed to the Lok Sabha members that the three criminal codes will be withdrawn to be replaced by three new bills that will incorporate modifications recommended by a parliamentary committee.\n\nThe three amended Bills were discussed for nine hours and 28 minutes in the [**Lok Sabha**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in), during which 34 members participated in the discussion, 25 of whom belonged to Bharatiya Janata Party. In [**Rajya Sabha**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in), the three Bills were debated for six hours and eight minutes in Rajya Sabha, during which, 40 members participated, of which 30 members belonged to BJP.\n\nThe bills contain several provisions that threaten fundamental rights to privacy and free speech – by digitising many aspects of criminal procedure, including ‘digital evidence’ under the ambit of the evidence law without outlining procedural safeguards, retaining the concept of sedition in a more arbitrary and vague provision, and widening executive powers pertaining to search and seizure of digital evidence. However, similar to numerous other significant pieces of legislation, these three crucial Bills, which will profoundly impact the lives of all Indians, were also hurried through both the Houses of Parliament with the explicit intention of avoiding any substantial debate or genuine discussion on them.\n\nRead our analysis of the three criminal reform Bills [**here**](https://internetfreedom.in/three-new-criminal-law-bills/?ref=static.internetfreedom.in).\n\n## Digital rights in the Parliament\n\nThroughout every Session of the Parliament, we track significant answers to parliamentary questions placed in both Houses by various members. Starred and unstarred questions submitted by MPs are a great tool for holding the incumbent government accountable. Answered by the Union Ministers, the responses become an invaluable source of authentic and legitimate information. A few key responses received were:\n\n&#x200B;\n\n>**On deepfakes**: MP Pal Jagdambika brought attention to how deepfakes pose a significant threat to the country's unity & national security, serving as a source of misinformation & disinformation, in addition to permanently harming the reputation of the victim. The MP urged the Government to address the escalating use of AI-generated deepfakes by conducting a comprehensive inquiry, and enacting an efficient legislation, if deemed necessary.  \n>  \n>\\[Read our thread summarising the response [**here**](https://twitter.com/IFFonParliament/status/1731664193445581004?ref=static.internetfreedom.in).\\]\n\n&#x200B;\n\n>**On blocking/removing content**: MP John Brittas asked the Government the number of directions issued to social media intermediaries and digital media in the last 5 years to block/remove posts, accounts, or topic hashtags and modify/block any content, information, data. The Government shared that till October 2023 a total of 7502 directions were passed:  \n>  \n>Facebook👉2044  \n>  \n>Instagram👉473  \n>  \n>X (Twitter)👉3390  \n>  \n>YouTube👉934  \n>  \n>Others👉661  \n>  \n>\\[See the responses [**here**](https://drive.google.com/file/d/11WV1kzDrgcAAqdwCToeFNsf2LrIO-5IZ/view?usp=sharing&ref=static.internetfreedom.in) and our thread summarising the response [**here**](https://twitter.com/IFFonParliament/status/1734150697057210492?ref=static.internetfreedom.in).\\] \n\n&#x200B;\n\n>**On net neutrality**, MP Ritesh Pandey raised concerns regarding the potential threats to net neutrality in India. He questioned the impact of proposed fees on OTT services and highlighted the risk of market concentration. Union Minister Ashwini Vaishnaw in response emphasised the settled matter of net neutrality by citing TRAI's recommendations in 2017. He assured that technical audits found no discrimination and discussed the utilization of the Universal Service Obligation Fund (USOF).  \n>  \n>Further, MP Shashi Tharoor expressed concern about the delay in implementing TRAI's 2020 recommendations and their impact on encryption. He sought assurance that regulation will not compromise free speech, privacy, and net neutrality. The Minister in response mentioned the ongoing discussion about a multistakeholder forum and reiterated the acceptance of 2015 recommendations.   \n>  \n>Criticising the regulatory conflicts in the Telecom Bill and TRAI’s consultation paper, MP Gaurav Gogoi questioned the government's balance of interests. MP Vaishnaw defended the Government's approach by highlighting telecom sector growth, increased investment, and transparency.   \n>  \n>\\[Read our thread summarising the response [**here**](https://twitter.com/IFFonParliament/status/1734817125100085726?ref=static.internetfreedom.in).\\]\n\n&#x200B;\n\n>**On linking Voter ID to Aadhar:** MPs Netam Phulodevi and Vandana Chavan asked Ministry of Law and Justice about the number of Voter IDs linked with Aadhaar since the Election Laws (Amendment) Act, 2021 came into force, if the linking is being done voluntarily, and the method of obtaining consent. The MPs further asked if Aadhaar details will be deleted if a voter takes back consent, if Voter IDs not linked with Aadhaar have been struck off from the voter list, and whether measures have been taken by the Government to protect the voter database from misuse. The MoL&J replied that linking Aadhaar with Voter ID is voluntary after the Election Laws (Amendment) Act came into force. He further clarified that while consent is obtained under Form 6B, there is no provision for withdrawal. \\[See the response [**here**](https://drive.google.com/file/d/1CA__t_BiyRwcuRK6n8cSFNd6bXjqis9K/view?usp=sharing&ref=static.internetfreedom.in) and our thread summarising the response [**here**](https://twitter.com/IFFonParliament/status/1736006281151086705?ref=static.internetfreedom.in).\\]\n\nParliamentary questions in India are a vital tool for government accountability and transparency. MPs use them to scrutinise government actions, seek information on policies, represent constituents, and contribute to public awareness. The suspension of 140+ MPs during the last leg of the Winter Session also resulted in several questions being deleted from the question list, raising questions on the intentions of the ruling party. Therefore, it not only hampered the free expression of diverse viewpoints within the legislative process, limiting the open exchange of ideas, but also compromised transparency, ethical democratic practices, and the principles of open governance. Effectively, the suspension of MPs diminished the representation of their constituents, denying a voice to the people they were elected to represent. This goes against the fundamental principle of democratic governance, which relies on the active participation and representation of citizens. \n\n## Important Documents:\n\n1. The Telecommunications Bill, 2023 ([**Link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/The%20Telecommunications%20Bill,%202023.pdf?ref=static.internetfreedom.in))\n2. The Bharatiya Nyaya (Second) Sanhita, 2023 ([**Link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bharatiya_Nyay_(Second)_Sanhita_2023.pdf?ref=static.internetfreedom.in))\n3. The Bharatiya Nagarik Suraksha (Second) Sanhita, 2023 ([**Link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bharatiya_Nagarik_Suraksha_(Second)_Sanhita_2023.pdf?ref=static.internetfreedom.in))\n4. The Bharatiya Sakshya (Second) Bill, 2023 ([**Link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bhartiya_Sakshya_(Second)_Bill_2023.pdf?ref=static.internetfreedom.in))\n5. IFF’s analysis of the three criminal reform bills ([**Link**](https://internetfreedom.in/three-new-criminal-law-bills/?ref=static.internetfreedom.in))\n6. IFF’s first read of the Telecommunications Bill, 2023 ([**Link**](https://internetfreedom.in/first-read-telecom-bill-2023/?ref=static.internetfreedom.in#:~:text=The%20entirety%20of%20Clause%2020,to%20direct%20suspension%20of%20any))",
    "flair": "Policy/Economy",
    "score": 12,
    "num_comments": 1,
    "created_utc": 1703660436.0,
    "convurl": "https://a.thumbs.redditmedia.com/B-y_RwLbSr2jAduKoh8_B-FD4eTpy7HymcEVX-p_Ig8.jpg",
    "comments": [],
    "cleaned_text": "winter session digital rights review xb xb tldr winter session parliament concluded december houses parliament adjourned sine die day schedule session saw introduction bills passage bills houses parliament include several key legislations namely telecommunications bill telecom bill three criminal reform bills post look parliament performed digital rights perspective care year winter session began december concluded december sitting total days session saw many bills get assent parliament worrying trend session lack proper meaningful discussion legislation paramount importance second half parliament winter session particularly notable lok sabha saw security breach post mps suspended lok sabha rajya sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin accounting strength house highest number suspensions history parliamenthttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin far strikingly suspended mps belonged opposition parties consequently led passage crucial bills houses telecom bill criminal law bills minimal debate little inputs opposition bills presented session successfully passed furthermore seven bills pending previous sessions also received approval even though lok sabha functionedhttpsprsindiaorgsessiontrackwintersessionplanperformancerefstaticinternetfreedomin scheduled time rajya sabha expedited passage significant legislations increased productivity influenced suspension several members parliament leading swift approvals limited deliberations minimal input opposition reflecting recently concluded session imperative due passage bills minimal amendments especially given circumstances multiple suspensions xb bills legislations concerning digital rights telecommunications bill telecom bill introduced lok sabha december passed lok sabha rajya sabha december respectively telecommunications bill restructures regulatory framework telecom sector passed within three days introduction discussed hour minutes lok sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin mps spoke telecommunications bill passed rajya sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin debate lasting hour minutes minister mps spoke opposition mp participated debate telecom bill empowers government pause transmission intercept messages public emergencies prevent incitement committing offenses particular measure provides officials significant authority monitor manage messages across entire telecom network broad grounds public safety also uncertainty regarding applicability bill overthetop ott communication services like whatsapp telecom bill much like counterpart continues hang colonial provisions predecessor purportedly aims overhaul misses huge opportunity reform telecommunication sector create rightscentric law protects user rights instead infringing read first read telecom bill herehttpsinternetfreedominfirstreadtelecombillrefstaticinternetfreedomintexttheentiretyofclausetodirectsuspensionofany three criminal reform bills three bills replacing indian penal code code criminal procedure indian evidence act discussed passed lok sabha rajya sabha december december respectively bharatiya nyaya second sanhita bns seeks replace ipc bharatiya nagarik suraksha second sanhita bnss seeks replace crpc bharatiya sakshya second bill bsb seeks replace iea referredhttpsdrivegooglecomfiledusbpryvjdqeniiiufonnskivzviewrefstaticinternetfreedomin parliamentary standing committee home affairs august rajya sabha chairperson consultation lok sabha speaker examination report within three months review recommendations parliamentary committee spanning pages page reports nothttpswwwmedianamacomparliamentarycommitteebharatiyanyayasanhitarefstaticinternetfreedomin adequately address provisions bills affecting individual privacy digital rights fundamental freedoms december union home minister amit shah conveyed lok sabha members three criminal codes withdrawn replaced three new bills incorporate modifications recommended parliamentary committee three amended bills discussed nine hours minutes lok sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin members participated discussion belonged bharatiya janata party rajya sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin three bills debated six hours eight minutes rajya sabha members participated members belonged bjp bills contain several provisions threaten fundamental rights privacy free speech digitising many aspects criminal procedure including digital evidence ambit evidence law without outlining procedural safeguards retaining concept sedition arbitrary vague provision widening executive powers pertaining search seizure digital evidence however similar numerous significant pieces legislation three crucial bills profoundly impact lives indians also hurried houses parliament explicit intention avoiding substantial debate genuine discussion read analysis three criminal reform bills herehttpsinternetfreedominthreenewcriminallawbillsrefstaticinternetfreedomin digital rights parliament throughout every session parliament track significant answers parliamentary questions placed houses various members starred unstarred questions submitted mps great tool holding incumbent government accountable answered union ministers responses become invaluable source authentic legitimate information key responses received xb deepfakes mp pal jagdambika brought attention deepfakes pose significant threat countrys unity national security serving source misinformation disinformation addition permanently harming reputation victim mp urged government address escalating use aigenerated deepfakes conducting comprehensive inquiry enacting efficient legislation deemed necessary read thread summarising response herehttpstwittercomiffonparliamentstatusrefstaticinternetfreedomin xb blockingremoving content mp john brittas asked government number directions issued social media intermediaries digital media last years blockremove posts accounts topic hashtags modifyblock content information data government shared till october total directions passed facebook instagram x twitter youtube others see responses herehttpsdrivegooglecomfiledwvkzdrgcaaqdwctoefnsflrioizviewuspsharingrefstaticinternetfreedomin thread summarising response herehttpstwittercomiffonparliamentstatusrefstaticinternetfreedomin xb net neutrality mp ritesh pandey raised concerns regarding potential threats net neutrality india questioned impact proposed fees ott services highlighted risk market concentration union minister ashwini vaishnaw response emphasised settled matter net neutrality citing trais recommendations assured technical audits found discrimination discussed utilization universal service obligation fund usof mp shashi tharoor expressed concern delay implementing trais recommendations impact encryption sought assurance regulation compromise free speech privacy net neutrality minister response mentioned ongoing discussion multistakeholder forum reiterated acceptance recommendations criticising regulatory conflicts telecom bill trais consultation paper mp gaurav gogoi questioned governments balance interests mp vaishnaw defended governments approach highlighting telecom sector growth increased investment transparency read thread summarising response herehttpstwittercomiffonparliamentstatusrefstaticinternetfreedomin xb linking voter id aadhar mps netam phulodevi vandana chavan asked ministry law justice number voter ids linked aadhaar since election laws amendment act came force linking done voluntarily method obtaining consent mps asked aadhaar details deleted voter takes back consent voter ids linked aadhaar struck voter list whether measures taken government protect voter database misuse molj replied linking aadhaar voter id voluntary election laws amendment act came force clarified consent obtained form b provision withdrawal see response herehttpsdrivegooglecomfiledcatbiyrwcurkncsfndbxjqiskviewuspsharingrefstaticinternetfreedomin thread summarising response herehttpstwittercomiffonparliamentstatusrefstaticinternetfreedomin parliamentary questions india vital tool government accountability transparency mps use scrutinise government actions seek information policies represent constituents contribute public awareness suspension mps last leg winter session also resulted several questions deleted question list raising questions intentions ruling party therefore hampered free expression diverse viewpoints within legislative process limiting open exchange ideas also compromised transparency ethical democratic practices principles open governance effectively suspension mps diminished representation constituents denying voice people elected represent goes fundamental principle democratic governance relies active participation representation citizens important documents telecommunications bill linkhttpsprsindiaorgfilesbillsactsbillsparliamentthetelecommunicationsbillpdfrefstaticinternetfreedomin bharatiya nyaya second sanhita linkhttpsprsindiaorgfilesbillsactsbillsparliamentbharatiyanyaysecondsanhitapdfrefstaticinternetfreedomin bharatiya nagarik suraksha second sanhita linkhttpsprsindiaorgfilesbillsactsbillsparliamentbharatiyanagariksurakshasecondsanhitapdfrefstaticinternetfreedomin bharatiya sakshya second bill linkhttpsprsindiaorgfilesbillsactsbillsparliamentbhartiyasakshyasecondbillpdfrefstaticinternetfreedomin iffs analysis three criminal reform bills linkhttpsinternetfreedominthreenewcriminallawbillsrefstaticinternetfreedomin iffs first read telecommunications bill linkhttpsinternetfreedominfirstreadtelecombillrefstaticinternetfreedomintexttheentiretyofclausetodirectsuspensionofany ",
    "cleaned_title": "winter session digital rights review",
    "cleaned_selftext": "xb xb tldr winter session parliament concluded december houses parliament adjourned sine die day schedule session saw introduction bills passage bills houses parliament include several key legislations namely telecommunications bill telecom bill three criminal reform bills post look parliament performed digital rights perspective care year winter session began december concluded december sitting total days session saw many bills get assent parliament worrying trend session lack proper meaningful discussion legislation paramount importance second half parliament winter session particularly notable lok sabha saw security breach post mps suspended lok sabha rajya sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin accounting strength house highest number suspensions history parliamenthttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin far strikingly suspended mps belonged opposition parties consequently led passage crucial bills houses telecom bill criminal law bills minimal debate little inputs opposition bills presented session successfully passed furthermore seven bills pending previous sessions also received approval even though lok sabha functionedhttpsprsindiaorgsessiontrackwintersessionplanperformancerefstaticinternetfreedomin scheduled time rajya sabha expedited passage significant legislations increased productivity influenced suspension several members parliament leading swift approvals limited deliberations minimal input opposition reflecting recently concluded session imperative due passage bills minimal amendments especially given circumstances multiple suspensions xb bills legislations concerning digital rights telecommunications bill telecom bill introduced lok sabha december passed lok sabha rajya sabha december respectively telecommunications bill restructures regulatory framework telecom sector passed within three days introduction discussed hour minutes lok sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin mps spoke telecommunications bill passed rajya sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin debate lasting hour minutes minister mps spoke opposition mp participated debate telecom bill empowers government pause transmission intercept messages public emergencies prevent incitement committing offenses particular measure provides officials significant authority monitor manage messages across entire telecom network broad grounds public safety also uncertainty regarding applicability bill overthetop ott communication services like whatsapp telecom bill much like counterpart continues hang colonial provisions predecessor purportedly aims overhaul misses huge opportunity reform telecommunication sector create rightscentric law protects user rights instead infringing read first read telecom bill herehttpsinternetfreedominfirstreadtelecombillrefstaticinternetfreedomintexttheentiretyofclausetodirectsuspensionofany three criminal reform bills three bills replacing indian penal code code criminal procedure indian evidence act discussed passed lok sabha rajya sabha december december respectively bharatiya nyaya second sanhita bns seeks replace ipc bharatiya nagarik suraksha second sanhita bnss seeks replace crpc bharatiya sakshya second bill bsb seeks replace iea referredhttpsdrivegooglecomfiledusbpryvjdqeniiiufonnskivzviewrefstaticinternetfreedomin parliamentary standing committee home affairs august rajya sabha chairperson consultation lok sabha speaker examination report within three months review recommendations parliamentary committee spanning pages page reports nothttpswwwmedianamacomparliamentarycommitteebharatiyanyayasanhitarefstaticinternetfreedomin adequately address provisions bills affecting individual privacy digital rights fundamental freedoms december union home minister amit shah conveyed lok sabha members three criminal codes withdrawn replaced three new bills incorporate modifications recommended parliamentary committee three amended bills discussed nine hours minutes lok sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin members participated discussion belonged bharatiya janata party rajya sabhahttpsprsindiaorgfilesparliamentsessiontrackvitalstatsvitalstatswintersessionpdfrefstaticinternetfreedomin three bills debated six hours eight minutes rajya sabha members participated members belonged bjp bills contain several provisions threaten fundamental rights privacy free speech digitising many aspects criminal procedure including digital evidence ambit evidence law without outlining procedural safeguards retaining concept sedition arbitrary vague provision widening executive powers pertaining search seizure digital evidence however similar numerous significant pieces legislation three crucial bills profoundly impact lives indians also hurried houses parliament explicit intention avoiding substantial debate genuine discussion read analysis three criminal reform bills herehttpsinternetfreedominthreenewcriminallawbillsrefstaticinternetfreedomin digital rights parliament throughout every session parliament track significant answers parliamentary questions placed houses various members starred unstarred questions submitted mps great tool holding incumbent government accountable answered union ministers responses become invaluable source authentic legitimate information key responses received xb deepfakes mp pal jagdambika brought attention deepfakes pose significant threat countrys unity national security serving source misinformation disinformation addition permanently harming reputation victim mp urged government address escalating use aigenerated deepfakes conducting comprehensive inquiry enacting efficient legislation deemed necessary read thread summarising response herehttpstwittercomiffonparliamentstatusrefstaticinternetfreedomin xb blockingremoving content mp john brittas asked government number directions issued social media intermediaries digital media last years blockremove posts accounts topic hashtags modifyblock content information data government shared till october total directions passed facebook instagram x twitter youtube others see responses herehttpsdrivegooglecomfiledwvkzdrgcaaqdwctoefnsflrioizviewuspsharingrefstaticinternetfreedomin thread summarising response herehttpstwittercomiffonparliamentstatusrefstaticinternetfreedomin xb net neutrality mp ritesh pandey raised concerns regarding potential threats net neutrality india questioned impact proposed fees ott services highlighted risk market concentration union minister ashwini vaishnaw response emphasised settled matter net neutrality citing trais recommendations assured technical audits found discrimination discussed utilization universal service obligation fund usof mp shashi tharoor expressed concern delay implementing trais recommendations impact encryption sought assurance regulation compromise free speech privacy net neutrality minister response mentioned ongoing discussion multistakeholder forum reiterated acceptance recommendations criticising regulatory conflicts telecom bill trais consultation paper mp gaurav gogoi questioned governments balance interests mp vaishnaw defended governments approach highlighting telecom sector growth increased investment transparency read thread summarising response herehttpstwittercomiffonparliamentstatusrefstaticinternetfreedomin xb linking voter id aadhar mps netam phulodevi vandana chavan asked ministry law justice number voter ids linked aadhaar since election laws amendment act came force linking done voluntarily method obtaining consent mps asked aadhaar details deleted voter takes back consent voter ids linked aadhaar struck voter list whether measures taken government protect voter database misuse molj replied linking aadhaar voter id voluntary election laws amendment act came force clarified consent obtained form b provision withdrawal see response herehttpsdrivegooglecomfiledcatbiyrwcurkncsfndbxjqiskviewuspsharingrefstaticinternetfreedomin thread summarising response herehttpstwittercomiffonparliamentstatusrefstaticinternetfreedomin parliamentary questions india vital tool government accountability transparency mps use scrutinise government actions seek information policies represent constituents contribute public awareness suspension mps last leg winter session also resulted several questions deleted question list raising questions intentions ruling party therefore hampered free expression diverse viewpoints within legislative process limiting open exchange ideas also compromised transparency ethical democratic practices principles open governance effectively suspension mps diminished representation constituents denying voice people elected represent goes fundamental principle democratic governance relies active participation representation citizens important documents telecommunications bill linkhttpsprsindiaorgfilesbillsactsbillsparliamentthetelecommunicationsbillpdfrefstaticinternetfreedomin bharatiya nyaya second sanhita linkhttpsprsindiaorgfilesbillsactsbillsparliamentbharatiyanyaysecondsanhitapdfrefstaticinternetfreedomin bharatiya nagarik suraksha second sanhita linkhttpsprsindiaorgfilesbillsactsbillsparliamentbharatiyanagariksurakshasecondsanhitapdfrefstaticinternetfreedomin bharatiya sakshya second bill linkhttpsprsindiaorgfilesbillsactsbillsparliamentbhartiyasakshyasecondbillpdfrefstaticinternetfreedomin iffs analysis three criminal reform bills linkhttpsinternetfreedominthreenewcriminallawbillsrefstaticinternetfreedomin iffs first read telecommunications bill linkhttpsinternetfreedominfirstreadtelecombillrefstaticinternetfreedomintexttheentiretyofclausetodirectsuspensionofany",
    "cleaned_comments": "",
    "light_cleaned_title": "Winter Session 2023: A Digital Rights Review",
    "light_cleaned_selftext": "&#x200B; &#x200B; ## tl;dr The Winter Session of Parliament concluded on December 21, 2023, when both Houses of Parliament adjourned sine die a day before schedule. The Session saw the introduction of 12 bills and the passage of 19 Bills by both the Houses of Parliament. These include several key legislations, namely, the Telecommunications Bill, 2023 (Telecom Bill, 2023) and the three criminal reform bills. In this post, we look at how our Parliament performed from a digital rights perspective. ## Why should you care? This year, the Winter Session began on December 4 and concluded on December 21 sitting for a total of 18 days. While the Session saw many bills get the assent of Parliament, a worrying trend this Session was the lack of proper and meaningful discussion on legislation of paramount importance. The second half of the Parliament Winter Session was particularly notable as the Lok Sabha saw a security breach, post which [**100 MPs were suspended from the Lok Sabha and 46 from the Rajya Sabha**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in), accounting for 19% of the strength of each House. This is the highest number of suspensions in the [**history of Parliament**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in) so far. Strikingly, the suspended MPs all belonged to the opposition parties, which consequently led to the passage of crucial bills in both Houses, such as the Telecom Bill and the Criminal Law Bills, with minimal debate and little to no inputs from the opposition. All 10 bills presented during this session were successfully passed. Furthermore, seven bills that were pending from previous sessions also received approval. Even though Lok Sabha [**functioned**](https://prsindia.org/sessiontrack/winter-session-2023/plan-performance?ref=static.internetfreedom.in) for 74% of its scheduled time, and Rajya Sabha for 81%, the expedited passage of significant legislations and the increased productivity was influenced by the suspension of several Members of Parliament, leading to swift approvals with limited deliberations and minimal input from the opposition. Reflecting on the recently concluded session is imperative due to the passage of 17 bills with minimal amendments, especially given the circumstances of multiple suspensions. &#x200B; **Bills and Legislations concerning digital rights are:** ### The Telecommunications Bill, 2023 The Telecom Bill, 2023 was introduced in the Lok Sabha on December 18, and passed in the Lok Sabha and Rajya Sabha on December 20 and 21 respectively. The Telecommunications Bill, 2023, restructures the regulatory framework of the telecom sector, and was passed within three days of introduction. It was discussed for 1 hour and 4 minutes in [**Lok Sabha**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in) during which only 4 MPs spoke. The Telecommunications Bill was passed in [**Rajya Sabha**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in) after a debate lasting 1 hour 11 minutes only, during which, other than the Minister himself, only 7 MPs spoke. No Opposition MP participated in the debate. The Telecom Bill, 2023, empowers the government to pause transmission and intercept messages \"during public emergencies to prevent incitement for committing offenses.\" This particular measure provides officials with significant authority to monitor and manage messages across the entire telecom network on the broad grounds of public safety. There is also uncertainty regarding the applicability of the Bill to Over-the-Top (OTT) communication services like WhatsApp. The Telecom Bill, 2023, much like its 2022 counterpart, continues to hang on to the colonial provisions of its 1885 predecessor it purportedly aims to overhaul. It misses a huge opportunity to reform the telecommunication sector and create a rights-centric law that protects user rights instead of infringing on it. Read our first read of the Telecom Bill, 2023 [**here**](https://internetfreedom.in/first-read-telecom-bill-2023/?ref=static.internetfreedom.in#:~:text=The%20entirety%20of%20Clause%2020,to%20direct%20suspension%20of%20any). ### Three criminal reform bills Three Bills replacing the Indian Penal Code, 1860, the Code of Criminal Procedure, 1973, and the Indian Evidence Act, 1872 were discussed and passed in the Lok Sabha and Rajya Sabha on December 19 and December 21 respectively. The Bharatiya Nyaya (Second) Sanhita (BNS), 2023 (which seeks to replace the IPC), the Bharatiya Nagarik Suraksha (Second) Sanhita (BNSS), 2023 (which seeks to replace the CrPC) and the Bharatiya Sakshya (Second) Bill (BSB), 2023 (which seeks to replace the IEA) were [**referred**](https://drive.google.com/file/d/1USBPRyVJDqeNii3-3iuF2o-NN05SKIvz/view?ref=static.internetfreedom.in) to the Parliamentary Standing Committee on Home Affairs on August 18, 2023 by the Rajya Sabha Chairperson in consultation with the Lok Sabha Speaker for examination and report within three months. The review and recommendations of the Parliamentary Committee, spanning 15-4215-42 pages in 250-530 page reports, [**do not**](https://www.medianama.com/2023/11/223-parliamentary-committee-bharatiya-nyaya-sanhita/?ref=static.internetfreedom.in) adequately address the provisions of the bills affecting individual privacy, digital rights, and fundamental freedoms. On December 11, Union Home Minister Amit Shah conveyed to the Lok Sabha members that the three criminal codes will be withdrawn to be replaced by three new bills that will incorporate modifications recommended by a parliamentary committee. The three amended Bills were discussed for nine hours and 28 minutes in the [**Lok Sabha**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in), during which 34 members participated in the discussion, 25 of whom belonged to Bharatiya Janata Party. In [**Rajya Sabha**](https://prsindia.org/files/parliament/session_track/2023/vital_stats/Vital_Stats_Winter_Session_2023.pdf?ref=static.internetfreedom.in), the three Bills were debated for six hours and eight minutes in Rajya Sabha, during which, 40 members participated, of which 30 members belonged to BJP. The bills contain several provisions that threaten fundamental rights to privacy and free speech – by digitising many aspects of criminal procedure, including ‘digital evidence’ under the ambit of the evidence law without outlining procedural safeguards, retaining the concept of sedition in a more arbitrary and vague provision, and widening executive powers pertaining to search and seizure of digital evidence. However, similar to numerous other significant pieces of legislation, these three crucial Bills, which will profoundly impact the lives of all Indians, were also hurried through both the Houses of Parliament with the explicit intention of avoiding any substantial debate or genuine discussion on them. Read our analysis of the three criminal reform Bills [**here**](https://internetfreedom.in/three-new-criminal-law-bills/?ref=static.internetfreedom.in). ## Digital rights in the Parliament Throughout every Session of the Parliament, we track significant answers to parliamentary questions placed in both Houses by various members. Starred and unstarred questions submitted by MPs are a great tool for holding the incumbent government accountable. Answered by the Union Ministers, the responses become an invaluable source of authentic and legitimate information. A few key responses received were: &#x200B; >**On deepfakes**: MP Pal Jagdambika brought attention to how deepfakes pose a significant threat to the country's unity & national security, serving as a source of misinformation & disinformation, in addition to permanently harming the reputation of the victim. The MP urged the Government to address the escalating use of AI-generated deepfakes by conducting a comprehensive inquiry, and enacting an efficient legislation, if deemed necessary. > >\\[Read our thread summarising the response [**here**](https://twitter.com/IFFonParliament/status/1731664193445581004?ref=static.internetfreedom.in).\\] &#x200B; >**On blocking/removing content**: MP John Brittas asked the Government the number of directions issued to social media intermediaries and digital media in the last 5 years to block/remove posts, accounts, or topic hashtags and modify/block any content, information, data. The Government shared that till October 2023 a total of 7502 directions were passed: > >Facebook👉2044 > >Instagram👉473 > >X (Twitter)👉3390 > >YouTube👉934 > >Others👉661 > >\\[See the responses [**here**](https://drive.google.com/file/d/11WV1kzDrgcAAqdwCToeFNsf2LrIO-5IZ/view?usp=sharing&ref=static.internetfreedom.in) and our thread summarising the response [**here**](https://twitter.com/IFFonParliament/status/1734150697057210492?ref=static.internetfreedom.in).\\] &#x200B; >**On net neutrality**, MP Ritesh Pandey raised concerns regarding the potential threats to net neutrality in India. He questioned the impact of proposed fees on OTT services and highlighted the risk of market concentration. Union Minister Ashwini Vaishnaw in response emphasised the settled matter of net neutrality by citing TRAI's recommendations in 2017. He assured that technical audits found no discrimination and discussed the utilization of the Universal Service Obligation Fund (USOF). > >Further, MP Shashi Tharoor expressed concern about the delay in implementing TRAI's 2020 recommendations and their impact on encryption. He sought assurance that regulation will not compromise free speech, privacy, and net neutrality. The Minister in response mentioned the ongoing discussion about a multistakeholder forum and reiterated the acceptance of 2015 recommendations. > >Criticising the regulatory conflicts in the Telecom Bill and TRAI’s consultation paper, MP Gaurav Gogoi questioned the government's balance of interests. MP Vaishnaw defended the Government's approach by highlighting telecom sector growth, increased investment, and transparency. > >\\[Read our thread summarising the response [**here**](https://twitter.com/IFFonParliament/status/1734817125100085726?ref=static.internetfreedom.in).\\] &#x200B; >**On linking Voter ID to Aadhar:** MPs Netam Phulodevi and Vandana Chavan asked Ministry of Law and Justice about the number of Voter IDs linked with Aadhaar since the Election Laws (Amendment) Act, 2021 came into force, if the linking is being done voluntarily, and the method of obtaining consent. The MPs further asked if Aadhaar details will be deleted if a voter takes back consent, if Voter IDs not linked with Aadhaar have been struck off from the voter list, and whether measures have been taken by the Government to protect the voter database from misuse. The MoL&J replied that linking Aadhaar with Voter ID is voluntary after the Election Laws (Amendment) Act came into force. He further clarified that while consent is obtained under Form 6B, there is no provision for withdrawal. \\[See the response [**here**](https://drive.google.com/file/d/1CA__t_BiyRwcuRK6n8cSFNd6bXjqis9K/view?usp=sharing&ref=static.internetfreedom.in) and our thread summarising the response [**here**](https://twitter.com/IFFonParliament/status/1736006281151086705?ref=static.internetfreedom.in).\\] Parliamentary questions in India are a vital tool for government accountability and transparency. MPs use them to scrutinise government actions, seek information on policies, represent constituents, and contribute to public awareness. The suspension of 140+ MPs during the last leg of the Winter Session also resulted in several questions being deleted from the question list, raising questions on the intentions of the ruling party. Therefore, it not only hampered the free expression of diverse viewpoints within the legislative process, limiting the open exchange of ideas, but also compromised transparency, ethical democratic practices, and the principles of open governance. Effectively, the suspension of MPs diminished the representation of their constituents, denying a voice to the people they were elected to represent. This goes against the fundamental principle of democratic governance, which relies on the active participation and representation of citizens. ## Important Documents: 1. The Telecommunications Bill, 2023 ([**Link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/The%20Telecommunications%20Bill,%202023.pdf?ref=static.internetfreedom.in)) 2. The Bharatiya Nyaya (Second) Sanhita, 2023 ([**Link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bharatiya_Nyay_(Second)_Sanhita_2023.pdf?ref=static.internetfreedom.in)) 3. The Bharatiya Nagarik Suraksha (Second) Sanhita, 2023 ([**Link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bharatiya_Nagarik_Suraksha_(Second)_Sanhita_2023.pdf?ref=static.internetfreedom.in)) 4. The Bharatiya Sakshya (Second) Bill, 2023 ([**Link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bhartiya_Sakshya_(Second)_Bill_2023.pdf?ref=static.internetfreedom.in)) 5. IFF’s analysis of the three criminal reform bills ([**Link**](https://internetfreedom.in/three-new-criminal-law-bills/?ref=static.internetfreedom.in)) 6. IFF’s first read of the Telecommunications Bill, 2023 ([**Link**](https://internetfreedom.in/first-read-telecom-bill-2023/?ref=static.internetfreedom.in#:~:text=The%20entirety%20of%20Clause%2020,to%20direct%20suspension%20of%20any))",
    "light_cleaned_comments": ""
}