{
    "id": "12yaqvd",
    "title": "What does the shrinking gap between hindu and muslim birthrate tells us?",
    "url": "https://www.reddit.com/r/india/comments/12yaqvd/what_does_the_shrinking_gap_between_hindu_and/",
    "selftext": "This has been a long running conspiracy theory and the main agenda of hindu nationalist that Hindus are in danger of a demographic take over by increasing muslim population.\n\nA quick look at the fertility and birth rate data of different religions tells a different story.\n\nBoth Hindu and [Muslim](https://scroll.in/latest/1023559/muslims-fertility-rate-sees-sharpest-decline-over-two-decades-shows-health-ministry-survey) birth rates are [declining](https://www.reuters.com/world/india/indias-birth-control-measures-resonate-among-its-muslims-priests-play-role-2023-04-12/) almost at the same rate. Only [Jain](https://www.statista.com/chart/29365/birth-rates-india/) birth rate is increasing.\n\n\n\nThe gap between hindu and muslim birthrate is also [shrinking](https://www.livemint.com/news/india/what-a-narrowing-hindu-muslim-fertility-gap-tells-us/1550686404387.html).\n\nWhich means that in the near future muslim birthrate is going to match and then fall below hindu birthrate and at that point muslim population will start [declining ](https://indianexpress.com/article/india/fertility-falling-in-all-communities-steepest-decline-among-muslims-nfhs-data-7906994/).\n\nWhich is not very surprising considering muslims, just like any other community are facing the same [economic stressors](https://www.washingtonpost.com/world/2021/11/25/india-birth-rate-replacement-population/) like increasing inflation and higher cost of living which is making it harder to raise children. \n\nBetter access and awareness to [contraception](https://www.reuters.com/world/india/indias-birth-control-measures-resonate-among-its-muslims-priests-play-role-2023-04-12) is also playing a role.",
    "flair": "AskIndia",
    "score": 15,
    "num_comments": 43,
    "created_utc": 1682404453.0,
    "convurl": "https://external-preview.redd.it/L2mWKtU3kYEMP-Rrtc5gqCtwOfQLn8tGgmRHef3g3U4.jpg?auto=webp&v=enabled&s=bea04d6e63699318df25c034ae765d80a95e4b24",
    "comments": [
        "Sources:\n\n[https://scroll.in/latest/1023559/muslims-fertility-rate-sees-sharpest-decline-over-two-decades-shows-health-ministry-survey](https://scroll.in/latest/1023559/muslims-fertility-rate-sees-sharpest-decline-over-two-decades-shows-health-ministry-survey)\n\n[https://www.reuters.com/world/india/indias-birth-control-measures-resonate-among-its-muslims-priests-play-role-2023-04-12/](https://www.reuters.com/world/india/indias-birth-control-measures-resonate-among-its-muslims-priests-play-role-2023-04-12/)\n\n[https://www.statista.com/chart/29365/birth-rates-india/](https://www.statista.com/chart/29365/birth-rates-india/)\n\n[https://www.livemint.com/news/india/what-a-narrowing-hindu-muslim-fertility-gap-tells-us/1550686404387.html](https://www.livemint.com/news/india/what-a-narrowing-hindu-muslim-fertility-gap-tells-us/1550686404387.html)\n\n[https://www.washingtonpost.com/world/2021/11/25/india-birth-rate-replacement-population/](https://www.washingtonpost.com/world/2021/11/25/india-birth-rate-replacement-population/)\n\n![img](h2zuqkcpatva1)\n\n[https://indianexpress.com/article/india/fertility-falling-in-all-communities-steepest-decline-among-muslims-nfhs-data-7906994/](https://indianexpress.com/article/india/fertility-falling-in-all-communities-steepest-decline-among-muslims-nfhs-data-7906994/)",
        "Isn't that great?",
        "It is what it is.",
        "Don't know if the Muslim birthrate is increasing or decreasing but illegal Muslim immigrants are obviously increasing.",
        "Do you have any stats on that?\n\nEven If  what you say is true. Isn't it a failure of BJP to control illegal immigration",
        "I will not go into other states you will find their data easily, I will talk about my state Maharashtra which is far from the Pak and Bangladesh borders. Last month 18 Bangladeshi were arrested for illegal stay,  Last year 182 Bangladeshi illegal immigrants were deported from my state 482 cases are registered but no action is taken yet. And if you want to experience it with your own eyes you can go into slums in Mumbai/Thane. Now if this is the condition of my state then you can think about Assam, West Bengal, and Delhi.\n\nhttps://www.ndtv.com/india-news/18-bangladeshi-nationals-arrested-in-maharashtra-for-illegal-stay-3833692\n\nhttps://indianexpress.com/article/cities/mumbai/49-bangladeshi-nationals-illegally-staying-in-maharashtra-bhiwandi-arrested-7651496/",
        "That doesn't prove that it's increasing.\n\nThese are news article not stats",
        "Assam was concerned about [illegal migration](https://www.satp.org/satporgtp/countries/india/states/assam/documents/papers/illegal_migration_in_assam.htm) way back in 1988. After disastrous policies, poor implementation of NRC and religion politics by parties in the region, what makes you think the situation would have gotten better? We won't have proper stats until the census is done, but it would be naive to believe that these immigrants would have reduced in numbers or returned home, especially after they are getting protection from local parties and human rights groups.",
        "No you claimed that it is increasing. Yet there are no stats to prove that",
        "Far too high imo. Our country needs significantly lesser population because we don’t have the resources or infra to support the population in its current form. Plus with thee expanding AI based services and solutions, I doubt manufacturing ever takes off in India.",
        "Yes we do need better population control measures.",
        "Yeah that's right more immigrants are leaving India.",
        "No. The only reason you believe this is  propaganda. The world is about to have a massive population crash. India is no exception. China's population will be down 50% on a century and a disproportionate number of those will be old. This is a terminal decline. Need to focus on pro family and pro child policies now while the population mix is still strong. If you wait the number of elderly will be too high.",
        "There only so much population our economy can handle before crumbling.\n\nThere will be excess old people for a few decades then the population will stabilizer",
        "Buddy our TFR is already just 2.05. If it goes any lower then we'll turn into a country of pensioners and India is not nearly rich enough for that.\n\nEveryone except the people in BIMARU belt should be having more children. Especially South India.",
        "No we don't. This is 70s era Malthusian nonsense. India's TFR is dangerously close to replacement levels now. We don't want a shrinking and aging population",
        ">There will be excess old people for a few decades then the population will stabilizer\n\nWhy would that happen? You can see European countries for counterfactuals",
        "And starve them? We have major climate events coming. Lack of clean air, water, and food. But the solution here is to have more people? Rather have more pensioners than starving hungry children that’ll have no employment opportunities due to AI and increased automation.",
        "The whole thing is a Jain conspiracy.  They have all the money, all the political power and soon once Hindus and Muslims fight each other and die, they will take over the country. Jains are the Jews of India/s.",
        "Once upon a time the economy was land and raw materials. Now the economy is people. More people, properly trained, the larger the economy. The economy can handle any foreseeable population of the education system is good.",
        "Hiw will an aging population solve the problems that you're talking about? Do we simply kill off all the old people?\n\n\nYou're under some misplaced notion that AI will lead to widespread unemployment in the future. This is not at all what most economists think. AI replaces tasks, not jobs. It makes jobs productive which generates more capital and jobs. Take it from MIT labor economist David Autor, the foremost expert in this field\n\nhttps://www.aeaweb.org/articles?id=10.1257/jep.29.3.3\n\n>In this paper, I begin by identifying the reasons that automation has not wiped out a majority of jobs over the decades and centuries. Automation does indeed substitute for labor—as it is typically intended to do. However, automation also complements labor, raises output in ways that leads to higher demand for labor, and interacts with adjustments in labor supply. Journalists and even expert commentators tend to overstate the extent of machine substitution for human labor and ignore the strong complementarities between automation and labor that increase productivity, raise earnings, and augment demand for labor. Changes in technology do alter the types of jobs available and what those jobs pay. In the last few decades, one noticeable change has been a \"polarization\" of the labor market, in which wage gains went disproportionately to those at the top and at the bottom of the income and skill distribution, not to those in the middle; however, I also argue, this polarization is unlikely to continue very far into future. The final section of this paper reflects on how recent and future advances in artificial intelligence and robotics should shape our thinking about the likely trajectory of occupational change and employment growth. I argue that the interplay between machine and human comparative advantage allows computers to substitute for workers in performing routine, codifiable tasks while amplifying the comparative advantage of workers in supplying problem-solving skills, adaptability, and creativity.\n\nDon't fall for Neomalthusian BS. India needs more children, not less.",
        "Who’s asking to kill all the old people? I don’t understand where you got that from. Your solution is to produce more kids and put further strain on resources. My solution is - ensure that we have peaked on resource consumption and rely on technology that consume little energy instead of making babies that will starve.",
        ">Who’s asking to kill all the old people?\n\nThen what do we do with all the old people then? Who'll pay their pensions, healthcare etc? \n\n>I don’t understand where you got that from. Your solution is to produce more kids and put further strain on resources.\n\nPeople are not consumers, they're producers. More people = more economies of scale = cheaper prices and more jobs. More people = more brains to solve problems. \n\n>My solution is - ensure that we have peaked on resource consumption\n\nBS. India is not a even middle income nation yet. We are nowhere close to peak resource consumption. \n\n>and rely on technology that consume little energy instead of making babies that will starve. \n\nThis is utopianism. This is not even happening in Europe where technological levels are much higher than India. Indian growth happens though catch up, not through tech innovations. \n\nYou have a very poor grasp on economics imo. I suggest you read more about Solow growth model and Solow residue. Robert Solow won the Nobel prize for it. You can simply jump from subsistence agriculture to high skilled service economy \n\nhttps://en.m.wikipedia.org/wiki/Solow%E2%80%93Swan_model#:~:text=The%20Solow%E2%80%93Swan%20model%20or,largely%20driven%20by%20technological%20progress.",
        "That means our window to use this demographic dividend we have been talking about for 2 decades is shorter than previously assumed.",
        "Atleast the population is decreasing, there will be less competition",
        "And you need resources and money to train these people, which are very limited",
        "There is no need to sound alarm. India will be just one of many countries which will see declining population.\n\nAnd yes India's fertility rate will crash, you can't move it back to 2.1. People don't jave jobs and you just want people to have kids mindlessly?",
        "Current education is massively overpriced. If you look at previous generations it is amazing how capable kids were with very limited resources.",
        "India tried a well intentioned sterilisation program under Indira Gandhi which would’ve avoided the population timebomb we are facing. But alas, “civil society” and NGO’s opposed it whereas China succeeded through one child policy.",
        "Spread fake news elsewhere. \n\nAlready debunked by /u/dontknow_anything\n\n> We already have actual data on illegal immigration, all pointing to it going down, not increasing.\n> \n> https://thewire.in/government/more-illegal-bangladeshi-migrants-leaving-india-than-entering-since-2017-govt-data\n> \n> https://www.thehindu.com/news/national/more-migrants-returning-to-bangladesh-shows-bsf-data/article33338577.ece\n> \n> Last month 18 Bangladeshi were arrested for illegal stay, Last year 182 Bangladeshi illegal immigrants were deported from my state 482 cases are registered but no action is taken yet\n> \n> Much lower than it used to be. It would in thousands in 1990s and 2000s for the same duration.",
        "Lol, I was shocked until I read the /s. But nothing is too stupid to say these days"
    ],
    "cleaned_text": "shrinking gap hindu muslim birthrate tells us long running conspiracy theory main agenda hindu nationalist hindus danger demographic take increasing muslim population quick look fertility birth rate data different religions tells different story hindu muslimhttpsscrollinlatestmuslimsfertilityrateseessharpestdeclineovertwodecadesshowshealthministrysurvey birth rates declininghttpswwwreuterscomworldindiaindiasbirthcontrolmeasuresresonateamongitsmuslimspriestsplayrole almost rate jainhttpswwwstatistacomchartbirthratesindia birth rate increasing gap hindu muslim birthrate also shrinkinghttpswwwlivemintcomnewsindiawhatanarrowinghindumuslimfertilitygaptellsushtml means near future muslim birthrate going match fall hindu birthrate point muslim population start declining httpsindianexpresscomarticleindiafertilityfallinginallcommunitiessteepestdeclineamongmuslimsnfhsdata surprising considering muslims like community facing economic stressorshttpswwwwashingtonpostcomworldindiabirthratereplacementpopulation like increasing inflation higher cost living making harder raise children better access awareness contraceptionhttpswwwreuterscomworldindiaindiasbirthcontrolmeasuresresonateamongitsmuslimspriestsplayrole also playing role ",
    "cleaned_title": "shrinking gap hindu muslim birthrate tells us",
    "cleaned_selftext": "long running conspiracy theory main agenda hindu nationalist hindus danger demographic take increasing muslim population quick look fertility birth rate data different religions tells different story hindu muslimhttpsscrollinlatestmuslimsfertilityrateseessharpestdeclineovertwodecadesshowshealthministrysurvey birth rates declininghttpswwwreuterscomworldindiaindiasbirthcontrolmeasuresresonateamongitsmuslimspriestsplayrole almost rate jainhttpswwwstatistacomchartbirthratesindia birth rate increasing gap hindu muslim birthrate also shrinkinghttpswwwlivemintcomnewsindiawhatanarrowinghindumuslimfertilitygaptellsushtml means near future muslim birthrate going match fall hindu birthrate point muslim population start declining httpsindianexpresscomarticleindiafertilityfallinginallcommunitiessteepestdeclineamongmuslimsnfhsdata surprising considering muslims like community facing economic stressorshttpswwwwashingtonpostcomworldindiabirthratereplacementpopulation like increasing inflation higher cost living making harder raise children better access awareness contraceptionhttpswwwreuterscomworldindiaindiasbirthcontrolmeasuresresonateamongitsmuslimspriestsplayrole also playing role",
    "cleaned_comments": "sources httpsscrollinlatestmuslimsfertilityrateseessharpestdeclineovertwodecadesshowshealthministrysurveyhttpsscrollinlatestmuslimsfertilityrateseessharpestdeclineovertwodecadesshowshealthministrysurvey httpswwwreuterscomworldindiaindiasbirthcontrolmeasuresresonateamongitsmuslimspriestsplayrolehttpswwwreuterscomworldindiaindiasbirthcontrolmeasuresresonateamongitsmuslimspriestsplayrole httpswwwstatistacomchartbirthratesindiahttpswwwstatistacomchartbirthratesindia httpswwwlivemintcomnewsindiawhatanarrowinghindumuslimfertilitygaptellsushtmlhttpswwwlivemintcomnewsindiawhatanarrowinghindumuslimfertilitygaptellsushtml httpswwwwashingtonpostcomworldindiabirthratereplacementpopulationhttpswwwwashingtonpostcomworldindiabirthratereplacementpopulation imghzuqkcpatva httpsindianexpresscomarticleindiafertilityfallinginallcommunitiessteepestdeclineamongmuslimsnfhsdatahttpsindianexpresscomarticleindiafertilityfallinginallcommunitiessteepestdeclineamongmuslimsnfhsdata isnt great dont know muslim birthrate increasing decreasing illegal muslim immigrants obviously increasing stats even say true isnt failure bjp control illegal immigration go states find data easily talk state maharashtra far pak bangladesh borders last month bangladeshi arrested illegal stay last year bangladeshi illegal immigrants deported state cases registered action taken yet want experience eyes go slums mumbaithane condition state think assam west bengal delhi doesnt prove increasing news article stats assam concerned illegal migrationhttpswwwsatporgsatporgtpcountriesindiastatesassamdocumentspapersillegalmigrationinassamhtm way back disastrous policies poor implementation nrc religion politics parties region makes think situation would gotten better wont proper stats census done would naive believe immigrants would reduced numbers returned home especially getting protection local parties human rights groups claimed increasing yet stats prove far high imo country needs significantly lesser population dont resources infra support population current form plus thee expanding ai based services solutions doubt manufacturing ever takes india yes need better population control measures yeah thats right immigrants leaving india reason believe propaganda world massive population crash india exception chinas population century disproportionate number old terminal decline need focus pro family pro child policies population mix still strong wait number elderly high much population economy handle crumbling excess old people decades population stabilizer buddy tfr already goes lower well turn country pensioners india nearly rich enough everyone except people bimaru belt children especially south india dont era malthusian nonsense indias tfr dangerously close replacement levels dont want shrinking aging population excess old people decades population stabilizer would happen see european countries counterfactuals starve major climate events coming lack clean air water food solution people rather pensioners starving hungry children thatll employment opportunities due ai increased automation whole thing jain conspiracy money political power soon hindus muslims fight die take country jains jews indias upon time economy land raw materials economy people people properly trained larger economy economy handle foreseeable population education system good hiw aging population solve problems youre talking simply kill old people youre misplaced notion ai lead widespread unemployment future economists think ai replaces tasks jobs makes jobs productive generates capital jobs take mit labor economist david autor foremost expert field paper begin identifying reasons automation wiped majority jobs decades centuries automation indeed substitute laboras typically intended however automation also complements labor raises output ways leads higher demand labor interacts adjustments labor supply journalists even expert commentators tend overstate extent machine substitution human labor ignore strong complementarities automation labor increase productivity raise earnings augment demand labor changes technology alter types jobs available jobs pay last decades one noticeable change polarization labor market wage gains went disproportionately top bottom income skill distribution middle however also argue polarization unlikely continue far future final section paper reflects recent future advances artificial intelligence robotics shape thinking likely trajectory occupational change employment growth argue interplay machine human comparative advantage allows computers substitute workers performing routine codifiable tasks amplifying comparative advantage workers supplying problemsolving skills adaptability creativity dont fall neomalthusian bs india needs children less whos asking kill old people dont understand got solution produce kids put strain resources solution ensure peaked resource consumption rely technology consume little energy instead making babies starve whos asking kill old people old people wholl pay pensions healthcare etc dont understand got solution produce kids put strain resources people consumers theyre producers people economies scale cheaper prices jobs people brains solve problems solution ensure peaked resource consumption bs india even middle income nation yet nowhere close peak resource consumption rely technology consume little energy instead making babies starve utopianism even happening europe technological levels much higher india indian growth happens though catch tech innovations poor grasp economics imo suggest read solow growth model solow residue robert solow nobel prize simply jump subsistence agriculture high skilled service economy means window use demographic dividend talking decades shorter previously assumed atleast population decreasing less competition need resources money train people limited need sound alarm india one many countries see declining population yes indias fertility rate crash cant move back people dont jave jobs want people kids mindlessly current education massively overpriced look previous generations amazing capable kids limited resources india tried well intentioned sterilisation program indira gandhi wouldve avoided population timebomb facing alas civil society ngos opposed whereas china succeeded one child policy spread fake news elsewhere already debunked udontknowanything already actual data illegal immigration pointing going increasing last month bangladeshi arrested illegal stay last year bangladeshi illegal immigrants deported state cases registered action taken yet much lower used would thousands duration lol shocked read nothing stupid say days",
    "light_cleaned_title": "What does the shrinking gap between hindu and muslim birthrate tells us?",
    "light_cleaned_selftext": "This has been a long running conspiracy theory and the main agenda of hindu nationalist that Hindus are in danger of a demographic take over by increasing muslim population. A quick look at the fertility and birth rate data of different religions tells a different story. Both Hindu and [Muslim](https://scroll.in/latest/1023559/muslims-fertility-rate-sees-sharpest-decline-over-two-decades-shows-health-ministry-survey) birth rates are [declining](https://www.reuters.com/world/india/indias-birth-control-measures-resonate-among-its-muslims-priests-play-role-2023-04-12/) almost at the same rate. Only [Jain](https://www.statista.com/chart/29365/birth-rates-india/) birth rate is increasing. The gap between hindu and muslim birthrate is also [shrinking](https://www.livemint.com/news/india/what-a-narrowing-hindu-muslim-fertility-gap-tells-us/1550686404387.html). Which means that in the near future muslim birthrate is going to match and then fall below hindu birthrate and at that point muslim population will start [declining ](https://indianexpress.com/article/india/fertility-falling-in-all-communities-steepest-decline-among-muslims-nfhs-data-7906994/). Which is not very surprising considering muslims, just like any other community are facing the same [economic stressors](https://www.washingtonpost.com/world/2021/11/25/india-birth-rate-replacement-population/) like increasing inflation and higher cost of living which is making it harder to raise children. Better access and awareness to [contraception](https://www.reuters.com/world/india/indias-birth-control-measures-resonate-among-its-muslims-priests-play-role-2023-04-12) is also playing a role.",
    "light_cleaned_comments": "Sources: [https://scroll.in/latest/1023559/muslims-fertility-rate-sees-sharpest-decline-over-two-decades-shows-health-ministry-survey](https://scroll.in/latest/1023559/muslims-fertility-rate-sees-sharpest-decline-over-two-decades-shows-health-ministry-survey) [https://www.reuters.com/world/india/indias-birth-control-measures-resonate-among-its-muslims-priests-play-role-2023-04-12/](https://www.reuters.com/world/india/indias-birth-control-measures-resonate-among-its-muslims-priests-play-role-2023-04-12/) [https://www.statista.com/chart/29365/birth-rates-india/](https://www.statista.com/chart/29365/birth-rates-india/) [https://www.livemint.com/news/india/what-a-narrowing-hindu-muslim-fertility-gap-tells-us/1550686404387.html](https://www.livemint.com/news/india/what-a-narrowing-hindu-muslim-fertility-gap-tells-us/1550686404387.html) [https://www.washingtonpost.com/world/2021/11/25/india-birth-rate-replacement-population/](https://www.washingtonpost.com/world/2021/11/25/india-birth-rate-replacement-population/) ![img](h2zuqkcpatva1) [https://indianexpress.com/article/india/fertility-falling-in-all-communities-steepest-decline-among-muslims-nfhs-data-7906994/](https://indianexpress.com/article/india/fertility-falling-in-all-communities-steepest-decline-among-muslims-nfhs-data-7906994/) Isn't that great? It is what it is. Don't know if the Muslim birthrate is increasing or decreasing but illegal Muslim immigrants are obviously increasing. Do you have any stats on that? Even If what you say is true. Isn't it a failure of BJP to control illegal immigration I will not go into other states you will find their data easily, I will talk about my state Maharashtra which is far from the Pak and Bangladesh borders. Last month 18 Bangladeshi were arrested for illegal stay, Last year 182 Bangladeshi illegal immigrants were deported from my state 482 cases are registered but no action is taken yet. And if you want to experience it with your own eyes you can go into slums in Mumbai/Thane. Now if this is the condition of my state then you can think about Assam, West Bengal, and Delhi. That doesn't prove that it's increasing. These are news article not stats Assam was concerned about [illegal migration](https://www.satp.org/satporgtp/countries/india/states/assam/documents/papers/illegal_migration_in_assam.htm) way back in 1988. After disastrous policies, poor implementation of NRC and religion politics by parties in the region, what makes you think the situation would have gotten better? We won't have proper stats until the census is done, but it would be naive to believe that these immigrants would have reduced in numbers or returned home, especially after they are getting protection from local parties and human rights groups. No you claimed that it is increasing. Yet there are no stats to prove that Far too high imo. Our country needs significantly lesser population because we don’t have the resources or infra to support the population in its current form. Plus with thee expanding AI based services and solutions, I doubt manufacturing ever takes off in India. Yes we do need better population control measures. Yeah that's right more immigrants are leaving India. No. The only reason you believe this is propaganda. The world is about to have a massive population crash. India is no exception. China's population will be down 50% on a century and a disproportionate number of those will be old. This is a terminal decline. Need to focus on pro family and pro child policies now while the population mix is still strong. If you wait the number of elderly will be too high. There only so much population our economy can handle before crumbling. There will be excess old people for a few decades then the population will stabilizer Buddy our TFR is already just 2.05. If it goes any lower then we'll turn into a country of pensioners and India is not nearly rich enough for that. Everyone except the people in BIMARU belt should be having more children. Especially South India. No we don't. This is 70s era Malthusian nonsense. India's TFR is dangerously close to replacement levels now. We don't want a shrinking and aging population >There will be excess old people for a few decades then the population will stabilizer Why would that happen? You can see European countries for counterfactuals And starve them? We have major climate events coming. Lack of clean air, water, and food. But the solution here is to have more people? Rather have more pensioners than starving hungry children that’ll have no employment opportunities due to AI and increased automation. The whole thing is a Jain conspiracy. They have all the money, all the political power and soon once Hindus and Muslims fight each other and die, they will take over the country. Jains are the Jews of India/s. Once upon a time the economy was land and raw materials. Now the economy is people. More people, properly trained, the larger the economy. The economy can handle any foreseeable population of the education system is good. Hiw will an aging population solve the problems that you're talking about? Do we simply kill off all the old people? You're under some misplaced notion that AI will lead to widespread unemployment in the future. This is not at all what most economists think. AI replaces tasks, not jobs. It makes jobs productive which generates more capital and jobs. Take it from MIT labor economist David Autor, the foremost expert in this field >In this paper, I begin by identifying the reasons that automation has not wiped out a majority of jobs over the decades and centuries. Automation does indeed substitute for labor—as it is typically intended to do. However, automation also complements labor, raises output in ways that leads to higher demand for labor, and interacts with adjustments in labor supply. Journalists and even expert commentators tend to overstate the extent of machine substitution for human labor and ignore the strong complementarities between automation and labor that increase productivity, raise earnings, and augment demand for labor. Changes in technology do alter the types of jobs available and what those jobs pay. In the last few decades, one noticeable change has been a \"polarization\" of the labor market, in which wage gains went disproportionately to those at the top and at the bottom of the income and skill distribution, not to those in the middle; however, I also argue, this polarization is unlikely to continue very far into future. The final section of this paper reflects on how recent and future advances in artificial intelligence and robotics should shape our thinking about the likely trajectory of occupational change and employment growth. I argue that the interplay between machine and human comparative advantage allows computers to substitute for workers in performing routine, codifiable tasks while amplifying the comparative advantage of workers in supplying problem-solving skills, adaptability, and creativity. Don't fall for Neomalthusian BS. India needs more children, not less. Who’s asking to kill all the old people? I don’t understand where you got that from. Your solution is to produce more kids and put further strain on resources. My solution is - ensure that we have peaked on resource consumption and rely on technology that consume little energy instead of making babies that will starve. >Who’s asking to kill all the old people? Then what do we do with all the old people then? Who'll pay their pensions, healthcare etc? >I don’t understand where you got that from. Your solution is to produce more kids and put further strain on resources. People are not consumers, they're producers. More people = more economies of scale = cheaper prices and more jobs. More people = more brains to solve problems. >My solution is - ensure that we have peaked on resource consumption BS. India is not a even middle income nation yet. We are nowhere close to peak resource consumption. >and rely on technology that consume little energy instead of making babies that will starve. This is utopianism. This is not even happening in Europe where technological levels are much higher than India. Indian growth happens though catch up, not through tech innovations. You have a very poor grasp on economics imo. I suggest you read more about Solow growth model and Solow residue. Robert Solow won the Nobel prize for it. You can simply jump from subsistence agriculture to high skilled service economy That means our window to use this demographic dividend we have been talking about for 2 decades is shorter than previously assumed. Atleast the population is decreasing, there will be less competition And you need resources and money to train these people, which are very limited There is no need to sound alarm. India will be just one of many countries which will see declining population. And yes India's fertility rate will crash, you can't move it back to 2.1. People don't jave jobs and you just want people to have kids mindlessly? Current education is massively overpriced. If you look at previous generations it is amazing how capable kids were with very limited resources. India tried a well intentioned sterilisation program under Indira Gandhi which would’ve avoided the population timebomb we are facing. But alas, “civil society” and NGO’s opposed it whereas China succeeded through one child policy. Spread fake news elsewhere. Already debunked by /u/dontknow_anything > We already have actual data on illegal immigration, all pointing to it going down, not increasing. > > > > > > Last month 18 Bangladeshi were arrested for illegal stay, Last year 182 Bangladeshi illegal immigrants were deported from my state 482 cases are registered but no action is taken yet > > Much lower than it used to be. It would in thousands in 1990s and 2000s for the same duration. Lol, I was shocked until I read the /s. But nothing is too stupid to say these days"
}