{
    "id": "15gzp49",
    "title": "Online purchase from Australia",
    "url": "https://www.reddit.com/gallery/15gzp49",
    "selftext": "I ordered clothes from Australia. I’m from India. Today when i went to collect from my post office they say i have to pay 8k rupees to get it. I already paid 15k above for this purchase. Now i have to pay . Is this customs?  How can i solve this issue? The post office officials say that it’s to be sent for revaluation and let’s see. Also there’s no bill attached to the parcel. Is it because of that ? If i show the bill to the officials, can i not pay the 8k rupees? Please give me a solution.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691056401.0,
    "convurl": "https://i.redd.it/0pzq696wavfb1.jpg",
    "comments": [
        "With customs duty it's a hit or miss. Sometimes they use the table values for the goods coming in and calculate duty on that, sometimes they let it pass without any duty. 🤷‍♂️"
    ],
    "cleaned_text": "online purchase australia ordered clothes australia im india today went collect post office say pay k rupees get already paid k purchase pay customs solve issue post office officials say sent revaluation lets see also theres bill attached parcel show bill officials pay k rupees please give solution ",
    "cleaned_title": "online purchase australia",
    "cleaned_selftext": "ordered clothes australia im india today went collect post office say pay k rupees get already paid k purchase pay customs solve issue post office officials say sent revaluation lets see also theres bill attached parcel show bill officials pay k rupees please give solution",
    "cleaned_comments": "customs duty hit miss sometimes use table values goods coming calculate duty sometimes let pass without duty",
    "light_cleaned_title": "Online purchase from Australia",
    "light_cleaned_selftext": "I ordered clothes from Australia. I’m from India. Today when i went to collect from my post office they say i have to pay 8k rupees to get it. I already paid 15k above for this purchase. Now i have to pay . Is this customs? How can i solve this issue? The post office officials say that it’s to be sent for revaluation and let’s see. Also there’s no bill attached to the parcel. Is it because of that ? If i show the bill to the officials, can i not pay the 8k rupees? Please give me a solution.",
    "light_cleaned_comments": "With customs duty it's a hit or miss. Sometimes they use the table values for the goods coming in and calculate duty on that, sometimes they let it pass without any duty. 🤷‍♂️"
}