{
    "id": "1b6t7t0",
    "title": "Honestly, I don't like this country anymore.",
    "url": "https://twitter.com/ANI/status/1764728990181347708?t=KxN8pdA21E87l3_urMc7-g&s=19",
    "selftext": "Look at the Photo OPS. Instead of making India safe, These Babus are giving away Tax Payer's money to hide their Shortcomings. They have estimated a women's integrity and dignity worth 10 Lakhs. Also This is only because It went Viral. These Gang Rapes happens daily with Poor women and they Don't get justice. These babus give those victims Minimum amount of money and Ask them to shut their mouth. Either we have a cultural revolution or We will see a day where nobody will set a foot in India. \n",
    "flair": "Rant / Vent",
    "score": 38,
    "num_comments": 17,
    "created_utc": 1709603895.0,
    "convurl": "https://external-preview.redd.it/Z0OEFkYO4mCbl3OjYi1q3zx9HUdhM9ttV3aIS-rQ9o0.jpg?auto=webp&s=3c414a878ed301dd1608e9882705d74b07abfba4",
    "comments": [
        "I’m gonna be honest, the stupidity and hyper-emotionality of people like you is the reason india is fucked up. \n\nIf you want a revolution, why don’t you lead it? I’m sure that will work out fine.",
        "Did they arrest the perpetrators? I didn't get anything from news or good sources.",
        "They arrested 3, 4 are still missing.",
        "Get fucked",
        "this is the 2nd funniest statement i ve heard this decade. 1st was ache din aayenge.",
        "I won’t need if we put you two in charge of ‘the revolution’. \n\nWhat would ‘the revolution’ entail anyway?",
        "\"Rahul is a Pappu\"\n\nMe: \"If you are so sure, why don't you lead it? I'm sure that will work out fine.\"",
        "Not rape women maybe.",
        "It’s just to cover up the further mess and don’t let it blow more than it already has in the international media. \n\nAlso to the culture revolution shit you’ve mentioned, Well do you remember Nirbhaya? People were on roads yet what changed? In a country where 90 rapes per day happened in 2022, as a cultural change this country has gotten used to the rapes news. \n\nNo offence to you or anyone else (unless it includes you), most people are talking about it because it’s a Spanish women, hot topic, matter of ego and blah blah. 3 days back 2 teenagers were raped and were found hanging, I didn’t hear people talking about it. For this one, people want live updates. Yesterday a 17 years old was raped in a wedding, people are mum about it and so many other cases (people would have skipped subconsciously).",
        "Ok, how will the revolution fix that? Go on, you’re asking for one, so you must’ve thought it out? \n\nTell me, what will this revolution do that will fix the fucking mess the country is? I’ll wait for you to articulate what it is you’re suggesting and how likely it is to work. Thanks.",
        "Exacrly. If you want to fix a problem, articulate the solution. ‘Cultural Revolution’, what does that mean? Offer concrete solutions if you’re asking for one. It’s always, ‘we need a cultural revolution….’ - nothing vaguer than that.",
        "I’m sure it is, your humour does seem a bit dead to me…\n\nBut I’ll be happy to hear solutions from you on how it can be fixed, as you want a revolution also.",
        "Ohh you really wanna Know? Kill the Rapist in the most brutal Possible on the Live Television. Make Adults watch It. Instill fear in their mind. Teach Sexual Education to every Childern above 13. Teach Basic Civic Manner to Every Indian. Teach Them that Staring and Catcalling is not Cool. Punish them if they don't follow the rule. Capital Punishment on Bribery and Dowry. Seperate Court for the Sexual Assault cases just like Family court. This is how you fix the country. Fix it by Fear.",
        "Need I say more guys? Your plan to outsource the revolution to this guy, may not work out the way you hope it to….",
        "Please tell me you are 13 years old or less.",
        "So, since you deleted the post, seems like you're not in the mood for \"Cultural Revolution\" anymore, Well, that was quick, only took a few downvotes on your other comments on this thread to change your heart. As I said, \"hot topic\". Ciao.",
        "You are absolutely right ...",
        "Same here. I am scared to go out after 10 pm and before 5 am. People stare at my sister who dresses very modestly. I am afraid to let my old mother go independently for any trip. \n\nThere are many alcohol shops in Chennai. Every 100 to 200 metres there is at least one alcohol shop. Can’t walk through those streets in evening with my sister or mother. Extremely chauvinistic pigs are in power, validated and taught by majority of movies that portray women in poor light.\n\nI am sorry for the rant. But, I got nowhere else to tell my sorrows.",
        "Can't fix something when the majority don't want it fixed. So, let's just pack our bags and leave.",
        "In country like India , where every minute rapes are happening and women are murdered ...wrong narrative of false rape cases is more popularised and getting views...I am not saying ignore victims of false rape cases ..rather I want to bring to notice that this false narrative tries to shut the voices of rape victims ..nobody cares number of women getting raped and killed every day in this country...instead they are telling us that indian men are victims of law in this country really ..wow look at the audacity ..pain of few men is considered more important , worthy of coverage, get million of likes than the thousand of women who are getting raped and killed in this country ...",
        "ask your elected representative these questions. the country would be a better place. the 3 levels that you voted for MP, MLA, local body. i am sure they will give u a list of ideas they wish to implement in the 5 years.",
        "Couldn’t even if I wanted to, I’m not an Indian citizen or an OCI holder. See, I assumed since you made a snarky comment you’d have suggestions. But as usual, you turned out to be nothing but athetypical fraud. The usual.",
        "nice , have a good day. i have my citizen duties ."
    ],
    "cleaned_text": "honestly dont like country anymore look photo ops instead making india safe babus giving away tax payers money hide shortcomings estimated womens integrity dignity worth lakhs also went viral gang rapes happens daily poor women dont get justice babus give victims minimum amount money ask shut mouth either cultural revolution see day nobody set foot india ",
    "cleaned_title": "honestly dont like country anymore",
    "cleaned_selftext": "look photo ops instead making india safe babus giving away tax payers money hide shortcomings estimated womens integrity dignity worth lakhs also went viral gang rapes happens daily poor women dont get justice babus give victims minimum amount money ask shut mouth either cultural revolution see day nobody set foot india",
    "cleaned_comments": "im gon na honest stupidity hyperemotionality people like reason india fucked want revolution dont lead im sure work fine arrest perpetrators didnt get anything news good sources arrested still missing get fucked nd funniest statement heard decade st ache din aayenge wont need put two charge revolution would revolution entail anyway rahul pappu sure dont lead im sure work fine rape women maybe cover mess dont let blow already international media also culture revolution shit youve mentioned well remember nirbhaya people roads yet changed country rapes per day happened cultural change country gotten used rapes news offence anyone else unless includes people talking spanish women hot topic matter ego blah blah days back teenagers raped found hanging didnt hear people talking one people want live updates yesterday years old raped wedding people mum many cases people would skipped subconsciously ok revolution fix go youre asking one mustve thought tell revolution fix fucking mess country ill wait articulate youre suggesting likely work thanks exacrly want fix problem articulate solution cultural revolution mean offer concrete solutions youre asking one always need cultural revolution nothing vaguer im sure humour seem bit dead ill happy hear solutions fixed want revolution also ohh really wan na know kill rapist brutal possible live television make adults watch instill fear mind teach sexual education every childern teach basic civic manner every indian teach staring catcalling cool punish dont follow rule capital punishment bribery dowry seperate court sexual assault cases like family court fix country fix fear need say guys plan outsource revolution guy may work way hope please tell years old less since deleted post seems like youre mood cultural revolution anymore well quick took downvotes comments thread change heart said hot topic ciao absolutely right scared go pm people stare sister dresses modestly afraid let old mother go independently trip many alcohol shops chennai every metres least one alcohol shop cant walk streets evening sister mother extremely chauvinistic pigs power validated taught majority movies portray women poor light sorry rant got nowhere else tell sorrows cant fix something majority dont want fixed lets pack bags leave country like india every minute rapes happening women murdered wrong narrative false rape cases popularised getting viewsi saying ignore victims false rape cases rather want bring notice false narrative tries shut voices rape victims nobody cares number women getting raped killed every day countryinstead telling us indian men victims law country really wow look audacity pain men considered important worthy coverage get million likes thousand women getting raped killed country ask elected representative questions country would better place levels voted mp mla local body sure give u list ideas wish implement years couldnt even wanted im indian citizen oci holder see assumed since made snarky comment youd suggestions usual turned nothing athetypical fraud usual nice good day citizen duties",
    "light_cleaned_title": "Honestly, I don't like this country anymore.",
    "light_cleaned_selftext": "Look at the Photo OPS. Instead of making India safe, These Babus are giving away Tax Payer's money to hide their Shortcomings. They have estimated a women's integrity and dignity worth 10 Lakhs. Also This is only because It went Viral. These Gang Rapes happens daily with Poor women and they Don't get justice. These babus give those victims Minimum amount of money and Ask them to shut their mouth. Either we have a cultural revolution or We will see a day where nobody will set a foot in India.",
    "light_cleaned_comments": "I’m gonna be honest, the stupidity and hyper-emotionality of people like you is the reason india is fucked up. If you want a revolution, why don’t you lead it? I’m sure that will work out fine. Did they arrest the perpetrators? I didn't get anything from news or good sources. They arrested 3, 4 are still missing. Get fucked this is the 2nd funniest statement i ve heard this decade. 1st was ache din aayenge. I won’t need if we put you two in charge of ‘the revolution’. What would ‘the revolution’ entail anyway? \"Rahul is a Pappu\" Me: \"If you are so sure, why don't you lead it? I'm sure that will work out fine.\" Not rape women maybe. It’s just to cover up the further mess and don’t let it blow more than it already has in the international media. Also to the culture revolution shit you’ve mentioned, Well do you remember Nirbhaya? People were on roads yet what changed? In a country where 90 rapes per day happened in 2022, as a cultural change this country has gotten used to the rapes news. No offence to you or anyone else (unless it includes you), most people are talking about it because it’s a Spanish women, hot topic, matter of ego and blah blah. 3 days back 2 teenagers were raped and were found hanging, I didn’t hear people talking about it. For this one, people want live updates. Yesterday a 17 years old was raped in a wedding, people are mum about it and so many other cases (people would have skipped subconsciously). Ok, how will the revolution fix that? Go on, you’re asking for one, so you must’ve thought it out? Tell me, what will this revolution do that will fix the fucking mess the country is? I’ll wait for you to articulate what it is you’re suggesting and how likely it is to work. Thanks. Exacrly. If you want to fix a problem, articulate the solution. ‘Cultural Revolution’, what does that mean? Offer concrete solutions if you’re asking for one. It’s always, ‘we need a cultural revolution….’ - nothing vaguer than that. I’m sure it is, your humour does seem a bit dead to me… But I’ll be happy to hear solutions from you on how it can be fixed, as you want a revolution also. Ohh you really wanna Know? Kill the Rapist in the most brutal Possible on the Live Television. Make Adults watch It. Instill fear in their mind. Teach Sexual Education to every Childern above 13. Teach Basic Civic Manner to Every Indian. Teach Them that Staring and Catcalling is not Cool. Punish them if they don't follow the rule. Capital Punishment on Bribery and Dowry. Seperate Court for the Sexual Assault cases just like Family court. This is how you fix the country. Fix it by Fear. Need I say more guys? Your plan to outsource the revolution to this guy, may not work out the way you hope it to…. Please tell me you are 13 years old or less. So, since you deleted the post, seems like you're not in the mood for \"Cultural Revolution\" anymore, Well, that was quick, only took a few downvotes on your other comments on this thread to change your heart. As I said, \"hot topic\". Ciao. You are absolutely right ... Same here. I am scared to go out after 10 pm and before 5 am. People stare at my sister who dresses very modestly. I am afraid to let my old mother go independently for any trip. There are many alcohol shops in Chennai. Every 100 to 200 metres there is at least one alcohol shop. Can’t walk through those streets in evening with my sister or mother. Extremely chauvinistic pigs are in power, validated and taught by majority of movies that portray women in poor light. I am sorry for the rant. But, I got nowhere else to tell my sorrows. Can't fix something when the majority don't want it fixed. So, let's just pack our bags and leave. In country like India , where every minute rapes are happening and women are murdered ...wrong narrative of false rape cases is more popularised and getting views...I am not saying ignore victims of false rape cases ..rather I want to bring to notice that this false narrative tries to shut the voices of rape victims ..nobody cares number of women getting raped and killed every day in this country...instead they are telling us that indian men are victims of law in this country really ..wow look at the audacity ..pain of few men is considered more important , worthy of coverage, get million of likes than the thousand of women who are getting raped and killed in this country ... ask your elected representative these questions. the country would be a better place. the 3 levels that you voted for MP, MLA, local body. i am sure they will give u a list of ideas they wish to implement in the 5 years. Couldn’t even if I wanted to, I’m not an Indian citizen or an OCI holder. See, I assumed since you made a snarky comment you’d have suggestions. But as usual, you turned out to be nothing but athetypical fraud. The usual. nice , have a good day. i have my citizen duties ."
}