{
    "id": "1hm0e9t",
    "title": "Chasing the mirage of crop insurance",
    "url": "https://www.deccanherald.com/opinion/chasing-the-mirage-of-crop-insurance-3331263",
    "selftext": "Is India perhaps the only country in the world where the governments collude with private insurance companies to profit from farmers’ distress?",
    "flair": "Policy/Economy",
    "score": 18,
    "num_comments": 3,
    "created_utc": 1735131936.0,
    "convurl": "https://external-preview.redd.it/lD3705UJ3e1217DdBOGUTcLtHOt4I-pzWp-ConAh29A.jpg?auto=webp&s=5ed77b715408ff8219f6790458f4008520471b83",
    "comments": [
        " > Given this reality, it is no surprise that the Parliamentary Standing Committee on agriculture reported that private insurance companies made profits ranging from Rs 10,000 crore to 20,000 crore, earning profits of 50 to 70% without any investment.",
        "This was the exact intention of the Modi government. Modi believes in profit/loss model of development. If private entities are making profit then things are going good. It is devoid of the welfare of the population."
    ],
    "cleaned_text": "chasing mirage crop insurance india perhaps country world governments collude private insurance companies profit farmers distress ",
    "cleaned_title": "chasing mirage crop insurance",
    "cleaned_selftext": "india perhaps country world governments collude private insurance companies profit farmers distress",
    "cleaned_comments": "given reality surprise parliamentary standing committee agriculture reported private insurance companies made profits ranging rs crore crore earning profits without investment exact intention modi government modi believes profitloss model development private entities making profit things going good devoid welfare population",
    "light_cleaned_title": "Chasing the mirage of crop insurance",
    "light_cleaned_selftext": "Is India perhaps the only country in the world where the governments collude with private insurance companies to profit from farmers’ distress?",
    "light_cleaned_comments": "> Given this reality, it is no surprise that the Parliamentary Standing Committee on agriculture reported that private insurance companies made profits ranging from Rs 10,000 crore to 20,000 crore, earning profits of 50 to 70% without any investment. This was the exact intention of the Modi government. Modi believes in profit/loss model of development. If private entities are making profit then things are going good. It is devoid of the welfare of the population."
}