{
    "id": "14ajusk",
    "title": "Produce rape accused in court to see if compromise possible: Gujarat HC judge",
    "url": "https://indianexpress.com/article/cities/ahmedabad/produce-rape-accused-in-court-to-see-if-compromise-possible-gujarat-hc-judge-8665566/",
    "selftext": "EIGHT DAYS after he advised reading of the Manusmriti during the hearing of a plea of a minor rape survivor seeking termination of her pregnancy, Gujarat High Court judge Justice Samir Dave on Thursday directed that the rape accused be produced before the court on Friday to ascertain whether a compromise is likely.",
    "flair": "Crime",
    "score": 399,
    "num_comments": 87,
    "created_utc": 1686880053.0,
    "convurl": "https://external-preview.redd.it/jvDoWu7MeGF1OfrEmxQVyNw0RsPsIfmabkYPFGLm79s.jpg?auto=webp&v=enabled&s=941ea8916bece0e7da414229687ecc0b4011e3cd",
    "comments": [
        ">Following the additional public prosecutor’s clarification, Justice Dave said, “The APP is saying that if something comes from the court, the people are criticising you…but one thing I may say, judge should be like Sthita Pragna the definition of which is given in Shrimad Bhagvad Gita chapter 2, shloka 54 to 72. And the judge has to be like that. So praising or criticising, one should ignore both the things.”\n\nDo they study law and constitution or manusmriti and gita?",
        "What type of compromise they want?",
        "Considering the past cases, definitely asking the victim to marry the rapist",
        "And then they go <surprised pikachu face> when people leave india for a safer life.",
        "The death penalty needs to be the minimum for rape and molestation with no change to proof of burden. Some of these fuckers need to hang. To hell with rehabilitation. You don't need to be rehabilitated if u can do something this heinous.",
        "☕",
        "Gujju never ceases to surprise me",
        "Is this guy close to retirement or.something? Then such shit would make sense.\n\nWhen people ask what has changed since 2014 what has changed, show them this news article, and how this has no impact on anyone anymore.  \n\nAnd then show them the BBC interview of the nirbhaya lawyer, and how he was rightfully mocked and condemned. \n\nYou want Hindu-Rashtra, then forget equality or justice. The Hindu rashtra of your dreams is not possible, best you will get is Hindu version of Saudi Arabia, minus the oil money.",
        "I guess I should have zero expectations from the justice system.",
        "Can't CJI actually do something about it? Why is he not firing this moron?",
        "This is so messed up! I honestly feel so bad for the girl. Being a girl myself, I just can’t imagine what that poor girl must be going through. She didn’t deserve any of this.And seriously how in the world are such disgusting people even allowed to be judges. One should never mix up religion with judiciary. But after all this is India, people put religion first before anything else in most cases and also try to justify their regressive views in the name of religion.That rapist should be hanged!!",
        "What the actual fuck in happening there? Are they practicing law or religion? Wth",
        "Bhai chal kya rha hai India mein?!",
        "A good chunk of gujju NRIs would be cheering this decision.",
        "SC can take it up as suo motu and give proper justice, but can't do much about the judge. Only thing close to \"firing\" is impeachment, which the opposition should definitely pursue in the Rajya Sabha",
        "Another question is why a rape accused isn't already present at his trial?",
        "To not terminate the pregnancy. The judge even said he will contact the rapist that is in jail, if something he can do.",
        "Considering the victim is minor can people file a case against the judge for promoting and abetting child marriage?",
        "Gujarat 🤢🤮",
        "The HC's chief justice can actually bar him from hearing matters. There's a lot of disciplinary powers Chief Justices employ. You're just never going to see them act against their own. The \"independent\" judiciary is functionally never going to hold itself to account.\n\nRemember that a former Chief Justice of India was accused of sexual harassment and the court ignored its own guidelines and orders on how such a complaint is to be handled while the CJI issued his defense from the bench.",
        "Time to leave the country",
        "Would love to see some idiot rape the judge and he gets to marry the rapist ..",
        "We need to do an exchange programme. Make all the 'India Numba Wan' NRIs move back and send the 'anti-nationals' out of India in their place. I'm sure that'll go down smoothly.",
        "I wonder if he would be saying the same thing for his own family, would he compromise if it was his wife or child that was the victim",
        "What the fuck is wrong with these pre-historic judges",
        "If I'm not wrong, case against judges cannot be filed without the CJ or CJI's approval",
        "If he didn’t have double standards, he wouldn’t have any standards",
        "What has the accused got to do with the termination of the victim's pregnancy?",
        "Ask the stupid judge. Looking for solutions for the the unborn child rather than the victim. If the doctor said ok to abort and petitioner is a rape victim, what the hell is the point of bringing the rapist or thinking of other possibilities. The girl's family doesn't want to keep the baby if forced to deliver, then why not just let them abort.",
        "Gujarat High Panchayat",
        ">Do they study law and constitution or manusmriti and gita\n\n  \n\n\nRegurgitating what dushyant dave said \"it's a targeted effort by incumbency, in recent times, towards inducting judges (like him, hemant gupta etc) who have a propensity of referring even the religious scriptures beyond the constitution so as to be able to have, in later times , supreme court benches and thereby collegium of judges of this nature which will suit the purpose of the incumbency\"",
        "No that's just wrong , not matter how shitty this person is.",
        "The hell is wrong with this guy?",
        "These asshole judges have never understood the pain, shame and helplessness of rape. First they face the pain, then they face pregnancy problems. While they are hardly ready to study, they're given a kid forcefully, who will always remind them of the traumatic incident.\n\nThen there are these insensitive judges.",
        "A perfect example of new india in new india question asked from rape victims to prove herself and not from the real culprit whether it is  brij bhushan case or in this case",
        "Laws gaye tel lene /s",
        "Gujarat = Vegetarian  Uttar Pradesh + massive scams.",
        "Your Honour! Please share the drugs you do with us.",
        "Rape accused is in Jail, trial is for petition regarding termination of pregnancy of minor rape victim.",
        "How do judges/advocates learn english in this manner? I mean like long sentences with tough words.",
        "We need a separate sub for Gujarat HC",
        "Okay, seriously! what's happening with mylord?",
        "I almost puked reading this comment. How could someone even think of proposing it? And that too a High Court Judge?\n\nWhat's happening to my country?",
        "I mean I didn't actually quote him, I just paraphrased what he said so these words are actually mine just the message is his. But indeed chaste english is the go to lingo of all the lawyers coz we've borrowed most of the institutions from british and major part of Constitution from british made laws (GOI act 1935) and this was one of the reason the constituent assembly criticised the constitution as \"paradise of the lawyers\" given how esoteric words they used for making the constitution which might not be legible to commoners",
        "Dude in Saudi, rape accused is killed after full evidence is there. Here the judge is giving mental torture to the girl",
        "Ab log bolenge\nPolice ko thulla Gunda\nAur justice ko gaandmasti and judge+lawyer ko kannon ke bhadwe kehna galat baat hai\n\nUss bacchi ke sath Jo hua galat hua, judge ho toh galat kaam baar baar kar sakte ho woh bhi public mein .",
        "Gujarat",
        "Thanks. Should have read the full article.",
        "*These* look like \"tough words\" to you? &nbsp; Which ones? &nbsp; Incumbency? Induct? Propensity?\n\nAnd about your question, judges and lawyers read verdicts, legal texts etc which use the same kind of English, so naturally learn to write in the same manner.",
        "What is the name of the judge and his qualifications age etc ? Haven't seen any of this on mainstream media ! Why isn't he named and shamed as well. Atleast his face should be out there everywhere.",
        "Gujarat HC be on any %ge speedrun of being the most chauvinist High Court.",
        "They punish the victim too. How many cases get reported?",
        "Haven't seen any victim getting killed. If they do it, wrong but it is not common. Also, there are not many rape cases as law is strict. If we made law strict here too, we may see less cases. How many rapists have given death sentence here? See it all works on psychology of fear.",
        "Because he's also likely to be another moron. \n\nI was randomly profiling GJ HC judges yesterday and many of them have ties to hindutva and BJP. One judge's husband is openly sucking up to BJP leaders on twitter.",
        "Disgusting",
        "A Hindu Saudi Arabia without oil money but Gobiji as half plate Veg Bin Salman - is exactly what BJP supporters want.",
        "The Hon'ble Supreme Court should disbar this criminal in robes.",
        "I don't know , how the lawyers keep their calm when the judges are spewing such shit. I would lose my shit.",
        "He most likely meant that since the \"father\" of the child is the accused, he has to know/ has the right to say no to termination which is absolutely fcking disgusting \"he fcking raped a child, got the said child with a child and he has right to her body?\" Wtf is wrong with our people, i am absolutely ashamed to be in this profession.",
        "In these kind of cases, I wish the only compromise was physical castration. Once the accused is proven guilty, take their weapon away.\n\nWhere draconian laws are required, we end up with compromises and half measures. Where progress is required, you see the most draconian laws getting passed.",
        "General rule of thumb is the punishment for rape should be less than that of murder. If opposite happens, then rapists are more likely to kill their victims.",
        "I'm super high right now. But if we make a super gruesome death the punishment for murder, then we can use the regular death as the punishment for rape.",
        "I m more surprises at female chaddis than anything else",
        "That does make sense, but also, I feel like if you can pass the law and make a public example out of just one of the perpetrators. Just national TV execution, you can instil a degree of fear that I think would go a long way on its own. It sounds fucked but also I think the situation in the country for women is also really fucked.",
        "Read the full ruling , if baby and girl are healthy judge won't allow abortion, the baby will be given up for adoption.",
        "Bruh... What does hindu rashtra have to do with this news? Nothing, It's just a shitty ass judge.",
        "I don't even understand why the judge is quoting Hindu law in a criminal trial. There's absolutely no relation between the two. The only offenses punishable by law are those in the IPC and everything else is not. Tradition does not dictate legality. 500 years ago kings had the authority to kill anyone they want without question. Are you saying according to that, the king equivalent of the current society has the same right as well? How the fuck do these idiots become judges with no morality or conscience.",
        "So this old sick fuck want to make a compromise between a rape accused and a minor rape victim. These old stone age mentality people really need to die off in a gutter or something. They really deserve all the hate they get.",
        "Why? Women can want a Hindu Rashtra too.",
        "Something just occurred to me. What if the rape victim was not a minor but a single mother? Would Court suggest the same thing? Marrying her rapist? So kid has to call the man 'Dad', who raped his/her mother?",
        "I have seen Muslim women, especially from more conservative families supporting Sharia law as well\n\nIt's surprising just how dumb humans can be",
        "When you find a group making a choice it's usually for a reason. The reason can be dumb, but it makes sense for them at the time. \n\nI guess in this specific case people are voting for the triple talaq ban and similar issues.",
        "Saudi Arabia charges those women who are unable to prove rape with adultery. They are punished with imprisonment, lashings and even death by stoning. Hence, the low number of rape cases in Saudi. Read some reports by human rights groups instead of blindly sucking up to those savages just because they are Muslim.",
        "Not sucking up to them. I know the law, you can't get punished if witness are not brought by you. If they are doing it then it is wrong. A person is only punished by death if they themselves do adultery and is seen by witnesses. Now who would have sex in open?",
        "Religious law..",
        "I read and what the fuck.....",
        "Want Israel, got Saudi.",
        "Lol so implementing their own version of sharia law and stuff. Save us man",
        "Girl also gets punished for adultery, so what happens more often is the victim is often married off to the rapist",
        "I hope the judge remembers that rape is a non-compoundable offense. Isme compromises nhi hoga ACCORDING TO THE LAW OF THE LAND.",
        "if his wife was raped, would he compromise with the rapist to share the wife? someone should ask this to the learned judge.",
        ">Saudi Arabia charges those women who are unable to prove rape with adultery.\n\nNo. Stop lying. According to sharia which Saudi Arabia follows, a women(or a man for that matter) can only be charged with adultery if you produce 4 eyewitness against them.",
        "No because you can only get charged for adultery if there are 4 eyewitness who have seen who commit adultery. I don't think you should speak false news."
    ],
    "cleaned_text": "produce rape accused court see compromise possible gujarat hc judge eight days advised reading manusmriti hearing plea minor rape survivor seeking termination pregnancy gujarat high court judge justice samir dave thursday directed rape accused produced court friday ascertain whether compromise likely ",
    "cleaned_title": "produce rape accused court see compromise possible gujarat hc judge",
    "cleaned_selftext": "eight days advised reading manusmriti hearing plea minor rape survivor seeking termination pregnancy gujarat high court judge justice samir dave thursday directed rape accused produced court friday ascertain whether compromise likely",
    "cleaned_comments": "following additional public prosecutors clarification justice dave said app saying something comes court people criticising youbut one thing may say judge like sthita pragna definition given shrimad bhagvad gita chapter shloka judge like praising criticising one ignore things study law constitution manusmriti gita type compromise want considering past cases definitely asking victim marry rapist go surprised pikachu face people leave india safer life death penalty needs minimum rape molestation change proof burden fuckers need hang hell rehabilitation dont need rehabilitated u something heinous gujju never ceases surprise guy close retirement orsomething shit would make sense people ask changed since changed show news article impact anyone anymore show bbc interview nirbhaya lawyer rightfully mocked condemned want hindurashtra forget equality justice hindu rashtra dreams possible best get hindu version saudi arabia minus oil money guess zero expectations justice system cant cji actually something firing moron messed honestly feel bad girl girl cant imagine poor girl must going didnt deserve thisand seriously world disgusting people even allowed judges one never mix religion judiciary india people put religion first anything else cases also try justify regressive views name religionthat rapist hanged actual fuck happening practicing law religion wth bhai chal kya rha hai india mein good chunk gujju nris would cheering decision sc take suo motu give proper justice cant much judge thing close firing impeachment opposition definitely pursue rajya sabha another question rape accused isnt already present trial terminate pregnancy judge even said contact rapist jail something considering victim minor people file case judge promoting abetting child marriage gujarat hcs chief justice actually bar hearing matters theres lot disciplinary powers chief justices employ youre never going see act independent judiciary functionally never going hold account remember former chief justice india accused sexual harassment court ignored guidelines orders complaint handled cji issued defense bench time leave country would love see idiot rape judge gets marry rapist need exchange programme make india numba wan nris move back send antinationals india place im sure thatll go smoothly wonder would saying thing family would compromise wife child victim fuck wrong prehistoric judges im wrong case judges filed without cj cjis approval didnt double standards wouldnt standards accused got termination victims pregnancy ask stupid judge looking solutions unborn child rather victim doctor said ok abort petitioner rape victim hell point bringing rapist thinking possibilities girls family doesnt want keep baby forced deliver let abort gujarat high panchayat study law constitution manusmriti gita regurgitating dushyant dave said targeted effort incumbency recent times towards inducting judges like hemant gupta etc propensity referring even religious scriptures beyond constitution able later times supreme court benches thereby collegium judges nature suit purpose incumbency thats wrong matter shitty person hell wrong guy asshole judges never understood pain shame helplessness rape first face pain face pregnancy problems hardly ready study theyre given kid forcefully always remind traumatic incident insensitive judges perfect example new india new india question asked rape victims prove real culprit whether brij bhushan case case laws gaye tel lene gujarat vegetarian uttar pradesh massive scams honour please share drugs us rape accused jail trial petition regarding termination pregnancy minor rape victim judgesadvocates learn english manner mean like long sentences tough words need separate sub gujarat hc okay seriously whats happening mylord almost puked reading comment could someone even think proposing high court judge whats happening country mean didnt actually quote paraphrased said words actually mine message indeed chaste english go lingo lawyers coz weve borrowed institutions british major part constitution british made laws goi act one reason constituent assembly criticised constitution paradise lawyers given esoteric words used making constitution might legible commoners dude saudi rape accused killed full evidence judge giving mental torture girl ab log bolenge police ko thulla gunda aur justice ko gaandmasti judgelawyer ko kannon ke bhadwe kehna galat baat hai uss bacchi ke sath jo hua galat hua judge ho toh galat kaam baar baar kar sakte ho woh bhi public mein gujarat thanks read full article look like tough words nbsp ones nbsp incumbency induct propensity question judges lawyers read verdicts legal texts etc use kind english naturally learn write manner name judge qualifications age etc havent seen mainstream media isnt named shamed well atleast face everywhere gujarat hc ge speedrun chauvinist high court punish victim many cases get reported havent seen victim getting killed wrong common also many rape cases law strict made law strict may see less cases many rapists given death sentence see works psychology fear hes also likely another moron randomly profiling gj hc judges yesterday many ties hindutva bjp one judges husband openly sucking bjp leaders twitter disgusting hindu saudi arabia without oil money gobiji half plate veg bin salman exactly bjp supporters want honble supreme court disbar criminal robes dont know lawyers keep calm judges spewing shit would lose shit likely meant since father child accused know right say termination absolutely fcking disgusting fcking raped child got said child child right body wtf wrong people absolutely ashamed profession kind cases wish compromise physical castration accused proven guilty take weapon away draconian laws required end compromises half measures progress required see draconian laws getting passed general rule thumb punishment rape less murder opposite happens rapists likely kill victims im super high right make super gruesome death punishment murder use regular death punishment rape surprises female chaddis anything else make sense also feel like pass law make public example one perpetrators national tv execution instil degree fear think would go long way sounds fucked also think situation country women also really fucked read full ruling baby girl healthy judge wont allow abortion baby given adoption bruh hindu rashtra news nothing shitty ass judge dont even understand judge quoting hindu law criminal trial theres absolutely relation two offenses punishable law ipc everything else tradition dictate legality years ago kings authority kill anyone want without question saying according king equivalent current society right well fuck idiots become judges morality conscience old sick fuck want make compromise rape accused minor rape victim old stone age mentality people really need die gutter something really deserve hate get women want hindu rashtra something occurred rape victim minor single mother would court suggest thing marrying rapist kid call man dad raped hisher mother seen muslim women especially conservative families supporting sharia law well surprising dumb humans find group making choice usually reason reason dumb makes sense time guess specific case people voting triple talaq ban similar issues saudi arabia charges women unable prove rape adultery punished imprisonment lashings even death stoning hence low number rape cases saudi read reports human rights groups instead blindly sucking savages muslim sucking know law cant get punished witness brought wrong person punished death adultery seen witnesses would sex open religious law read fuck want israel got saudi lol implementing version sharia law stuff save us man girl also gets punished adultery happens often victim often married rapist hope judge remembers rape noncompoundable offense isme compromises nhi hoga according law land wife raped would compromise rapist share wife someone ask learned judge saudi arabia charges women unable prove rape adultery stop lying according sharia saudi arabia follows womenor man matter charged adultery produce eyewitness get charged adultery eyewitness seen commit adultery dont think speak false news",
    "light_cleaned_title": "Produce rape accused in court to see if compromise possible: Gujarat HC judge",
    "light_cleaned_selftext": "EIGHT DAYS after he advised reading of the Manusmriti during the hearing of a plea of a minor rape survivor seeking termination of her pregnancy, Gujarat High Court judge Justice Samir Dave on Thursday directed that the rape accused be produced before the court on Friday to ascertain whether a compromise is likely.",
    "light_cleaned_comments": ">Following the additional public prosecutor’s clarification, Justice Dave said, “The APP is saying that if something comes from the court, the people are criticising you…but one thing I may say, judge should be like Sthita Pragna the definition of which is given in Shrimad Bhagvad Gita chapter 2, shloka 54 to 72. And the judge has to be like that. So praising or criticising, one should ignore both the things.” Do they study law and constitution or manusmriti and gita? What type of compromise they want? Considering the past cases, definitely asking the victim to marry the rapist And then they go <surprised pikachu face> when people leave india for a safer life. The death penalty needs to be the minimum for rape and molestation with no change to proof of burden. Some of these fuckers need to hang. To hell with rehabilitation. You don't need to be rehabilitated if u can do something this heinous. ☕ Gujju never ceases to surprise me Is this guy close to retirement or.something? Then such shit would make sense. When people ask what has changed since 2014 what has changed, show them this news article, and how this has no impact on anyone anymore. And then show them the BBC interview of the nirbhaya lawyer, and how he was rightfully mocked and condemned. You want Hindu-Rashtra, then forget equality or justice. The Hindu rashtra of your dreams is not possible, best you will get is Hindu version of Saudi Arabia, minus the oil money. I guess I should have zero expectations from the justice system. Can't CJI actually do something about it? Why is he not firing this moron? This is so messed up! I honestly feel so bad for the girl. Being a girl myself, I just can’t imagine what that poor girl must be going through. She didn’t deserve any of this.And seriously how in the world are such disgusting people even allowed to be judges. One should never mix up religion with judiciary. But after all this is India, people put religion first before anything else in most cases and also try to justify their regressive views in the name of religion.That rapist should be hanged!! What the actual fuck in happening there? Are they practicing law or religion? Wth Bhai chal kya rha hai India mein?! A good chunk of gujju NRIs would be cheering this decision. SC can take it up as suo motu and give proper justice, but can't do much about the judge. Only thing close to \"firing\" is impeachment, which the opposition should definitely pursue in the Rajya Sabha Another question is why a rape accused isn't already present at his trial? To not terminate the pregnancy. The judge even said he will contact the rapist that is in jail, if something he can do. Considering the victim is minor can people file a case against the judge for promoting and abetting child marriage? Gujarat 🤢🤮 The HC's chief justice can actually bar him from hearing matters. There's a lot of disciplinary powers Chief Justices employ. You're just never going to see them act against their own. The \"independent\" judiciary is functionally never going to hold itself to account. Remember that a former Chief Justice of India was accused of sexual harassment and the court ignored its own guidelines and orders on how such a complaint is to be handled while the CJI issued his defense from the bench. Time to leave the country Would love to see some idiot rape the judge and he gets to marry the rapist .. We need to do an exchange programme. Make all the 'India Numba Wan' NRIs move back and send the 'anti-nationals' out of India in their place. I'm sure that'll go down smoothly. I wonder if he would be saying the same thing for his own family, would he compromise if it was his wife or child that was the victim What the fuck is wrong with these pre-historic judges If I'm not wrong, case against judges cannot be filed without the CJ or CJI's approval If he didn’t have double standards, he wouldn’t have any standards What has the accused got to do with the termination of the victim's pregnancy? Ask the stupid judge. Looking for solutions for the the unborn child rather than the victim. If the doctor said ok to abort and petitioner is a rape victim, what the hell is the point of bringing the rapist or thinking of other possibilities. The girl's family doesn't want to keep the baby if forced to deliver, then why not just let them abort. Gujarat High Panchayat >Do they study law and constitution or manusmriti and gita Regurgitating what dushyant dave said \"it's a targeted effort by incumbency, in recent times, towards inducting judges (like him, hemant gupta etc) who have a propensity of referring even the religious scriptures beyond the constitution so as to be able to have, in later times , supreme court benches and thereby collegium of judges of this nature which will suit the purpose of the incumbency\" No that's just wrong , not matter how shitty this person is. The hell is wrong with this guy? These asshole judges have never understood the pain, shame and helplessness of rape. First they face the pain, then they face pregnancy problems. While they are hardly ready to study, they're given a kid forcefully, who will always remind them of the traumatic incident. Then there are these insensitive judges. A perfect example of new india in new india question asked from rape victims to prove herself and not from the real culprit whether it is brij bhushan case or in this case Laws gaye tel lene /s Gujarat = Vegetarian Uttar Pradesh + massive scams. Your Honour! Please share the drugs you do with us. Rape accused is in Jail, trial is for petition regarding termination of pregnancy of minor rape victim. How do judges/advocates learn english in this manner? I mean like long sentences with tough words. We need a separate sub for Gujarat HC Okay, seriously! what's happening with mylord? I almost puked reading this comment. How could someone even think of proposing it? And that too a High Court Judge? What's happening to my country? I mean I didn't actually quote him, I just paraphrased what he said so these words are actually mine just the message is his. But indeed chaste english is the go to lingo of all the lawyers coz we've borrowed most of the institutions from british and major part of Constitution from british made laws (GOI act 1935) and this was one of the reason the constituent assembly criticised the constitution as \"paradise of the lawyers\" given how esoteric words they used for making the constitution which might not be legible to commoners Dude in Saudi, rape accused is killed after full evidence is there. Here the judge is giving mental torture to the girl Ab log bolenge Police ko thulla Gunda Aur justice ko gaandmasti and judge+lawyer ko kannon ke bhadwe kehna galat baat hai Uss bacchi ke sath Jo hua galat hua, judge ho toh galat kaam baar baar kar sakte ho woh bhi public mein . Gujarat Thanks. Should have read the full article. *These* look like \"tough words\" to you? &nbsp; Which ones? &nbsp; Incumbency? Induct? Propensity? And about your question, judges and lawyers read verdicts, legal texts etc which use the same kind of English, so naturally learn to write in the same manner. What is the name of the judge and his qualifications age etc ? Haven't seen any of this on mainstream media ! Why isn't he named and shamed as well. Atleast his face should be out there everywhere. Gujarat HC be on any %ge speedrun of being the most chauvinist High Court. They punish the victim too. How many cases get reported? Haven't seen any victim getting killed. If they do it, wrong but it is not common. Also, there are not many rape cases as law is strict. If we made law strict here too, we may see less cases. How many rapists have given death sentence here? See it all works on psychology of fear. Because he's also likely to be another moron. I was randomly profiling GJ HC judges yesterday and many of them have ties to hindutva and BJP. One judge's husband is openly sucking up to BJP leaders on twitter. Disgusting A Hindu Saudi Arabia without oil money but Gobiji as half plate Veg Bin Salman - is exactly what BJP supporters want. The Hon'ble Supreme Court should disbar this criminal in robes. I don't know , how the lawyers keep their calm when the judges are spewing such shit. I would lose my shit. He most likely meant that since the \"father\" of the child is the accused, he has to know/ has the right to say no to termination which is absolutely fcking disgusting \"he fcking raped a child, got the said child with a child and he has right to her body?\" Wtf is wrong with our people, i am absolutely ashamed to be in this profession. In these kind of cases, I wish the only compromise was physical castration. Once the accused is proven guilty, take their weapon away. Where draconian laws are required, we end up with compromises and half measures. Where progress is required, you see the most draconian laws getting passed. General rule of thumb is the punishment for rape should be less than that of murder. If opposite happens, then rapists are more likely to kill their victims. I'm super high right now. But if we make a super gruesome death the punishment for murder, then we can use the regular death as the punishment for rape. I m more surprises at female chaddis than anything else That does make sense, but also, I feel like if you can pass the law and make a public example out of just one of the perpetrators. Just national TV execution, you can instil a degree of fear that I think would go a long way on its own. It sounds fucked but also I think the situation in the country for women is also really fucked. Read the full ruling , if baby and girl are healthy judge won't allow abortion, the baby will be given up for adoption. Bruh... What does hindu rashtra have to do with this news? Nothing, It's just a shitty ass judge. I don't even understand why the judge is quoting Hindu law in a criminal trial. There's absolutely no relation between the two. The only offenses punishable by law are those in the IPC and everything else is not. Tradition does not dictate legality. 500 years ago kings had the authority to kill anyone they want without question. Are you saying according to that, the king equivalent of the current society has the same right as well? How the fuck do these idiots become judges with no morality or conscience. So this old sick fuck want to make a compromise between a rape accused and a minor rape victim. These old stone age mentality people really need to die off in a gutter or something. They really deserve all the hate they get. Why? Women can want a Hindu Rashtra too. Something just occurred to me. What if the rape victim was not a minor but a single mother? Would Court suggest the same thing? Marrying her rapist? So kid has to call the man 'Dad', who raped his/her mother? I have seen Muslim women, especially from more conservative families supporting Sharia law as well It's surprising just how dumb humans can be When you find a group making a choice it's usually for a reason. The reason can be dumb, but it makes sense for them at the time. I guess in this specific case people are voting for the triple talaq ban and similar issues. Saudi Arabia charges those women who are unable to prove rape with adultery. They are punished with imprisonment, lashings and even death by stoning. Hence, the low number of rape cases in Saudi. Read some reports by human rights groups instead of blindly sucking up to those savages just because they are Muslim. Not sucking up to them. I know the law, you can't get punished if witness are not brought by you. If they are doing it then it is wrong. A person is only punished by death if they themselves do adultery and is seen by witnesses. Now who would have sex in open? Religious law.. I read and what the fuck..... Want Israel, got Saudi. Lol so implementing their own version of sharia law and stuff. Save us man Girl also gets punished for adultery, so what happens more often is the victim is often married off to the rapist I hope the judge remembers that rape is a non-compoundable offense. Isme compromises nhi hoga ACCORDING TO THE LAW OF THE LAND. if his wife was raped, would he compromise with the rapist to share the wife? someone should ask this to the learned judge. >Saudi Arabia charges those women who are unable to prove rape with adultery. No. Stop lying. According to sharia which Saudi Arabia follows, a women(or a man for that matter) can only be charged with adultery if you produce 4 eyewitness against them. No because you can only get charged for adultery if there are 4 eyewitness who have seen who commit adultery. I don't think you should speak false news."
}