{
    "id": "18mo42d",
    "title": "GDP per capita on Indian States (INR)",
    "url": "https://i.redd.it/5lrkwj49ae7c1.jpeg",
    "selftext": "Credit : @themapsdaily on X",
    "flair": "Policy/Economy",
    "score": 27,
    "num_comments": 13,
    "created_utc": 1703054112.0,
    "convurl": "https://i.redd.it/5lrkwj49ae7c1.jpeg",
    "comments": [
        "Source :https://twitter.com/themapsdaily/status/1698217869945999595?t=8-DXmMkEfYSRuEIVc5gomA&s=19",
        "Compared to the adjacent states, West Bengal is performing quite well.",
        "I wouldn't consider turning the wealthiest state during the British rule to one of the poorest state as performing quite well.",
        "It was wealtheist before British took over and then ruined it by sheer exploitation.\n\nThe reason being great patronage from the kings/nawabs/rich folks.\n\nThis patronage is what we now call subsidies.",
        "If you cannot feed your own people, being rich means nothing.",
        "Dumbest take ever"
    ],
    "cleaned_text": "gdp per capita indian states inr credit themapsdaily x ",
    "cleaned_title": "gdp per capita indian states inr",
    "cleaned_selftext": "credit themapsdaily x",
    "cleaned_comments": "source httpstwittercomthemapsdailystatustdxmmkefysrueivcgomas compared adjacent states west bengal performing quite well wouldnt consider turning wealthiest state british rule one poorest state performing quite well wealtheist british took ruined sheer exploitation reason great patronage kingsnawabsrich folks patronage call subsidies feed people rich means nothing dumbest take ever",
    "light_cleaned_title": "GDP per capita on Indian States (INR)",
    "light_cleaned_selftext": "Credit : @themapsdaily on X",
    "light_cleaned_comments": "Source :https://twitter.com/themapsdaily/status/1698217869945999595?t=8-DXmMkEfYSRuEIVc5gomA&s=19 Compared to the adjacent states, West Bengal is performing quite well. I wouldn't consider turning the wealthiest state during the British rule to one of the poorest state as performing quite well. It was wealtheist before British took over and then ruined it by sheer exploitation. The reason being great patronage from the kings/nawabs/rich folks. This patronage is what we now call subsidies. If you cannot feed your own people, being rich means nothing. Dumbest take ever"
}