{
    "id": "16nji8k",
    "title": "Parliament Watch Dispatches: an appreciation post for r/india",
    "url": "https://www.reddit.com/r/india/comments/16nji8k/parliament_watch_dispatches_an_appreciation_post/",
    "selftext": "Hi, this is a appreciation post for the [r/india](https://www.reddit.com/r/india/) community.\n\nI'm an old-timer here on Reddit India. This forum, honestly, is one big reason I started doing what I do right now.\n\n7 years ago, I used to do a series here called \"[Last Week in Parliament](https://www.reddit.com/r/india/comments/4h3ioz/last_week_in_the_indian_parliament_april_25_april/)\", where I gave updates on what is happening in the Indian Parliament, written in a fun consumable way. Back then I was working with an MP and had to do it anonymously, so Reddit was the best option. Strangely enough, an editor from newslaundry saw these posts and asked me to write for them. [So I did](https://www.newslaundry.com/2016/12/03/democracy-died-and-no-one-noticed).\n\nThat was my first foray into the public space and it's been a long journey since then. I am making this post because right now, it feels like I'm leveling up a bit, but also going back to what I used to do on this forum: Watching Parliament and attempting to tell you wtf is happening.\n\nStarted a [youtube channel](https://www.youtube.com/@meghnerd) a month ago and I've been following the current session of Parliament closely. Now, Last week in Parliament is a daily video update and I thought it would be appropriate to share it on the forum where the idea first originated.\n\n[**Dispatch #1**](https://youtu.be/4fl8Sy4bSms?si=c2erq4K1p0THXER6)**: no country for parliamentary reforms**\n\n[**Dispatch #2**](https://youtu.be/NlTTBYJv9Yc?si=wSIHIlL8Th0LnBMq)**: adarniya modiji's imperial march**\n\nI have no demands, no asks, just wanted to post this here and express how much I appreciate this community. This is where it all started for me afterall.\n\nRegards,  \nKumbhakaran",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695211357.0,
    "convurl": "https://external-preview.redd.it/2YRlGCSK3vxhlMYQ5MOiJ7ejJ4Vj2ET2TknhD0jPwQM.jpg?auto=webp&s=0c06ce9e9cd874f1c41c2fcfbc0ca99bec97cf0c",
    "comments": [
        "You're a famous guy on twitter",
        "Keep up the good work dude!",
        "Big fan of your content. I especially liked the Consti-tuition series. Back then I subscribed to newslaundry because of this.",
        "Meghnad you were Redditor? To be frank, I liked your video series on Parliament more."
    ],
    "cleaned_text": "parliament watch dispatches appreciation post rindia hi appreciation post rindiahttpswwwredditcomrindia community im oldtimer reddit india forum honestly one big reason started right years ago used series called last week parliamenthttpswwwredditcomrindiacommentshiozlastweekintheindianparliamentaprilapril gave updates happening indian parliament written fun consumable way back working mp anonymously reddit best option strangely enough editor newslaundry saw posts asked write didhttpswwwnewslaundrycomdemocracydiedandnoonenoticed first foray public space long journey since making post right feels like im leveling bit also going back used forum watching parliament attempting tell wtf happening started youtube channelhttpswwwyoutubecommeghnerd month ago ive following current session parliament closely last week parliament daily video update thought would appropriate share forum idea first originated dispatch httpsyoutubeflsybsmssicerqkpthxer country parliamentary reforms dispatch httpsyoutubenlttbyjvycsiwsihillthlnbmq adarniya modijis imperial march demands asks wanted post express much appreciate community started afterall regards kumbhakaran ",
    "cleaned_title": "parliament watch dispatches appreciation post rindia",
    "cleaned_selftext": "hi appreciation post rindiahttpswwwredditcomrindia community im oldtimer reddit india forum honestly one big reason started right years ago used series called last week parliamenthttpswwwredditcomrindiacommentshiozlastweekintheindianparliamentaprilapril gave updates happening indian parliament written fun consumable way back working mp anonymously reddit best option strangely enough editor newslaundry saw posts asked write didhttpswwwnewslaundrycomdemocracydiedandnoonenoticed first foray public space long journey since making post right feels like im leveling bit also going back used forum watching parliament attempting tell wtf happening started youtube channelhttpswwwyoutubecommeghnerd month ago ive following current session parliament closely last week parliament daily video update thought would appropriate share forum idea first originated dispatch httpsyoutubeflsybsmssicerqkpthxer country parliamentary reforms dispatch httpsyoutubenlttbyjvycsiwsihillthlnbmq adarniya modijis imperial march demands asks wanted post express much appreciate community started afterall regards kumbhakaran",
    "cleaned_comments": "youre famous guy twitter keep good work dude big fan content especially liked constituition series back subscribed newslaundry meghnad redditor frank liked video series parliament",
    "light_cleaned_title": "Parliament Watch Dispatches: an appreciation post for r/india",
    "light_cleaned_selftext": "Hi, this is a appreciation post for the [r/india](https://www.reddit.com/r/india/) community. I'm an old-timer here on Reddit India. This forum, honestly, is one big reason I started doing what I do right now. 7 years ago, I used to do a series here called \"[Last Week in Parliament](https://www.reddit.com/r/india/comments/4h3ioz/last_week_in_the_indian_parliament_april_25_april/)\", where I gave updates on what is happening in the Indian Parliament, written in a fun consumable way. Back then I was working with an MP and had to do it anonymously, so Reddit was the best option. Strangely enough, an editor from newslaundry saw these posts and asked me to write for them. [So I did](https://www.newslaundry.com/2016/12/03/democracy-died-and-no-one-noticed). That was my first foray into the public space and it's been a long journey since then. I am making this post because right now, it feels like I'm leveling up a bit, but also going back to what I used to do on this forum: Watching Parliament and attempting to tell you wtf is happening. Started a [youtube channel](https://www.youtube.com/@meghnerd) a month ago and I've been following the current session of Parliament closely. Now, Last week in Parliament is a daily video update and I thought it would be appropriate to share it on the forum where the idea first originated. [**Dispatch #1**](https://youtu.be/4fl8Sy4bSms?si=c2erq4K1p0THXER6)**: no country for parliamentary reforms** [**Dispatch #2**](https://youtu.be/NlTTBYJv9Yc?si=wSIHIlL8Th0LnBMq)**: adarniya modiji's imperial march** I have no demands, no asks, just wanted to post this here and express how much I appreciate this community. This is where it all started for me afterall. Regards, Kumbhakaran",
    "light_cleaned_comments": "You're a famous guy on twitter Keep up the good work dude! Big fan of your content. I especially liked the Consti-tuition series. Back then I subscribed to newslaundry because of this. Meghnad you were Redditor? To be frank, I liked your video series on Parliament more."
}