{
    "id": "1docnot",
    "title": "I became a victim of a financial fraud.",
    "url": "https://www.reddit.com/gallery/1docnot",
    "selftext": "Hello everyone, I am a victim of a financial fraud that is growing in India these days. The greed to get quick rich made me fall into a pit from where it is never coming back. The name of the scam is called [PCM](https://www.pcmests.com/). It works by asked you to recharge on their app and by products. These products give you income each day. Say you buy a product worth Rs. 3500 and your per day income is Rs. 175 for the next 52 days. So it will result in around 2.5X profit. But they will not let you complete that 52 days. They will just remove you one day randomly. The mentor that was talking to you everyday will just stop seeing your text, then you can go on calling them or do anything there is nothing that can be done. They also give bonuses on bring in new members. When they remove you they will also remove all your members so that no one can question your removal or anything. Best part is their whatsapp numbers aren't even Indian, it's some fake UK (+44) number. I'm a student and it's devastating for me. I lost more than 7 thousand rupees in this scam.\n\nPlease I request everyone to be aware of it and don't fall into such potholes. This fraud specially Focuses on students or old age people like our parents. Please stay aware and keep others aware.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1719339158.0,
    "convurl": "https://i.redd.it/r5uo0p91er8d1.jpg",
    "comments": [
        "So you fell twice for the scam?\n\nAnd bhai, look at that interface man, no one with a little bit of common sense can't see how scammy it even looks.",
        "btw does it really say: STABLY in the second screenshot?? 😂😭",
        "goofy ahh 2000's looking interface + shitty UI = SCAM"
    ],
    "cleaned_text": "became victim financial fraud hello everyone victim financial fraud growing india days greed get quick rich made fall pit never coming back name scam called pcmhttpswwwpcmestscom works asked recharge app products products give income day say buy product worth rs per day income rs next days result around x profit let complete days remove one day randomly mentor talking everyday stop seeing text go calling anything nothing done also give bonuses bring new members remove also remove members one question removal anything best part whatsapp numbers arent even indian fake uk number im student devastating lost thousand rupees scam please request everyone aware dont fall potholes fraud specially focuses students old age people like parents please stay aware keep others aware ",
    "cleaned_title": "became victim financial fraud",
    "cleaned_selftext": "hello everyone victim financial fraud growing india days greed get quick rich made fall pit never coming back name scam called pcmhttpswwwpcmestscom works asked recharge app products products give income day say buy product worth rs per day income rs next days result around x profit let complete days remove one day randomly mentor talking everyday stop seeing text go calling anything nothing done also give bonuses bring new members remove also remove members one question removal anything best part whatsapp numbers arent even indian fake uk number im student devastating lost thousand rupees scam please request everyone aware dont fall potholes fraud specially focuses students old age people like parents please stay aware keep others aware",
    "cleaned_comments": "fell twice scam bhai look interface man one little bit common sense cant see scammy even looks btw really say stably second screenshot goofy ahh looking interface shitty ui scam",
    "light_cleaned_title": "I became a victim of a financial fraud.",
    "light_cleaned_selftext": "Hello everyone, I am a victim of a financial fraud that is growing in India these days. The greed to get quick rich made me fall into a pit from where it is never coming back. The name of the scam is called [PCM](https://www.pcmests.com/). It works by asked you to recharge on their app and by products. These products give you income each day. Say you buy a product worth Rs. 3500 and your per day income is Rs. 175 for the next 52 days. So it will result in around 2.5X profit. But they will not let you complete that 52 days. They will just remove you one day randomly. The mentor that was talking to you everyday will just stop seeing your text, then you can go on calling them or do anything there is nothing that can be done. They also give bonuses on bring in new members. When they remove you they will also remove all your members so that no one can question your removal or anything. Best part is their whatsapp numbers aren't even Indian, it's some fake UK (+44) number. I'm a student and it's devastating for me. I lost more than 7 thousand rupees in this scam. Please I request everyone to be aware of it and don't fall into such potholes. This fraud specially Focuses on students or old age people like our parents. Please stay aware and keep others aware.",
    "light_cleaned_comments": "So you fell twice for the scam? And bhai, look at that interface man, no one with a little bit of common sense can't see how scammy it even looks. btw does it really say: STABLY in the second screenshot?? 😂😭 goofy ahh 2000's looking interface + shitty UI = SCAM"
}