{
    "id": "1bc4cb2",
    "title": "Looking for participants for my research study!",
    "url": "https://www.reddit.com/r/india/comments/1bc4cb2/looking_for_participants_for_my_research_study/",
    "selftext": "Looking for participants for my research study!\n\n&#x200B;\n\n\"Does this hit home?: Exploring the Impact of Introspective Art on Retraumatization\" \n\nWelcome!\n\nI am Urja Gokani, a student of TYBSc (Honors) in Psychology at SVKM's Mithibai College.\n\nThrough this study, I aim to understand the impact of introspective art on individuals who have experienced developmental or complex trauma before the age of 18.\n\nStudy Details:\n\n\\- Purpose: Explore emotional responses and potential retraumatization through introspective art.\n\n\\- Participant Criteria: a. Age: 20-30  b. Have experienced developmental or complex trauma.\n\n\\- Duration: Approximately 2 hours (virtual sessions).\n\n\\- Support: Access to a counseling psychologist during the study.\n\nDefinitions:\n\n\\- Developmental Trauma: Disruption or impairment of normal psychological and emotional development due to chronic exposure to traumatic events during childhood.\n\n&#x200B;\n\n\\- Complex Trauma: Ongoing exposure to multiple traumatic events, often within interpersonal relationships, leading to significant psychological and emotional impact.\n\n&#x200B;\n\n\\- This study has been reviewed and approved and will be under the guidance of my course professor.\n\n&#x200B;\n\nIn case you wish to participate please fill out this form, it contains all the necessary information regarding the study including the ethical guidelines followed, risks, and benefits. The intent is to conduct this study this week.\n\n&#x200B;\n\n[https://forms.gle/Vte7QZsM8LmjZutH9](https://forms.gle/Vte7QZsM8LmjZutH9) \n\n&#x200B;\n\nInterested or have any questions?\n\nPlease contact Urja Gokani at urja.gokani@gmail.com\n\n&#x200B;\n\nThank you for considering contributing to this research.",
    "flair": "Rant / Vent",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1710166905.0,
    "convurl": "https://external-preview.redd.it/2jc7Wy6sVXZO6qK7ZJlxUGdB7v1okA2lfbXe7Rfs9jI.jpg?auto=webp&s=ba2fa93bfa62ce4880ae73f3e255d2be6dd7837f",
    "comments": [],
    "cleaned_text": "looking participants research study looking participants research study xb hit home exploring impact introspective art retraumatization welcome urja gokani student tybsc honors psychology svkms mithibai college study aim understand impact introspective art individuals experienced developmental complex trauma age study details purpose explore emotional responses potential retraumatization introspective art participant criteria age b experienced developmental complex trauma duration approximately hours virtual sessions support access counseling psychologist study definitions developmental trauma disruption impairment normal psychological emotional development due chronic exposure traumatic events childhood xb complex trauma ongoing exposure multiple traumatic events often within interpersonal relationships leading significant psychological emotional impact xb study reviewed approved guidance course professor xb case wish participate please fill form contains necessary information regarding study including ethical guidelines followed risks benefits intent conduct study week xb httpsformsglevteqzsmlmjzuthhttpsformsglevteqzsmlmjzuth xb interested questions please contact urja gokani urjagokanigmailcom xb thank considering contributing research ",
    "cleaned_title": "looking participants research study",
    "cleaned_selftext": "looking participants research study xb hit home exploring impact introspective art retraumatization welcome urja gokani student tybsc honors psychology svkms mithibai college study aim understand impact introspective art individuals experienced developmental complex trauma age study details purpose explore emotional responses potential retraumatization introspective art participant criteria age b experienced developmental complex trauma duration approximately hours virtual sessions support access counseling psychologist study definitions developmental trauma disruption impairment normal psychological emotional development due chronic exposure traumatic events childhood xb complex trauma ongoing exposure multiple traumatic events often within interpersonal relationships leading significant psychological emotional impact xb study reviewed approved guidance course professor xb case wish participate please fill form contains necessary information regarding study including ethical guidelines followed risks benefits intent conduct study week xb httpsformsglevteqzsmlmjzuthhttpsformsglevteqzsmlmjzuth xb interested questions please contact urja gokani urjagokanigmailcom xb thank considering contributing research",
    "cleaned_comments": "",
    "light_cleaned_title": "Looking for participants for my research study!",
    "light_cleaned_selftext": "Looking for participants for my research study! &#x200B; \"Does this hit home?: Exploring the Impact of Introspective Art on Retraumatization\" Welcome! I am Urja Gokani, a student of TYBSc (Honors) in Psychology at SVKM's Mithibai College. Through this study, I aim to understand the impact of introspective art on individuals who have experienced developmental or complex trauma before the age of 18. Study Details: \\- Purpose: Explore emotional responses and potential retraumatization through introspective art. \\- Participant Criteria: a. Age: 20-30 b. Have experienced developmental or complex trauma. \\- Duration: Approximately 2 hours (virtual sessions). \\- Support: Access to a counseling psychologist during the study. Definitions: \\- Developmental Trauma: Disruption or impairment of normal psychological and emotional development due to chronic exposure to traumatic events during childhood. &#x200B; \\- Complex Trauma: Ongoing exposure to multiple traumatic events, often within interpersonal relationships, leading to significant psychological and emotional impact. &#x200B; \\- This study has been reviewed and approved and will be under the guidance of my course professor. &#x200B; In case you wish to participate please fill out this form, it contains all the necessary information regarding the study including the ethical guidelines followed, risks, and benefits. The intent is to conduct this study this week. &#x200B; [https://forms.gle/Vte7QZsM8LmjZutH9](https://forms.gle/Vte7QZsM8LmjZutH9) &#x200B; Interested or have any questions? Please contact Urja Gokani at urja.gokani@gmail.com &#x200B; Thank you for considering contributing to this research.",
    "light_cleaned_comments": ""
}