{
    "id": "142ziz8",
    "title": "Weekly Mental Health Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/142ziz8/weekly_mental_health_discussion_thread/",
    "selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here.\n\nYou may find someone who has gone through a similar episode and might be able to help/guide you.\n\nPlease be civil and maintain Reddiquette while participating or replying/helping out someone.\n\nYou can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic.\n\n**If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**.\n\n* **Helplines**: AASRA: 91-22-27546669 (24 hours)\n* **Sneha Foundation**: 91-44-24640050 (24 hours)\n* **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours)\n* **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm)\n* **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm)\n\n**Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/1fqd80djw8n61.png?width=1487&format=png&auto=webp&v=enabled&s=184ead1efd5057f53cc3236ab564a2ce3ac8a7f6",
    "flair": "Scheduled",
    "score": 10,
    "num_comments": 31,
    "created_utc": 1686101409.0,
    "convurl": "https://external-preview.redd.it/FUATMZm8JLDTc_Im2P2hwXDebj9H8XTUE2E46u7I0hY.jpg",
    "comments": [
        "Today one of my managers, escalated to senior management again. After me telling the management how she bullies people and screams and shouts and causes anxiety in the team due to which several of my colleagues have left the project quietly. \n\nI refused to go quietly so I escalated it further and said I won’t work on this project anymore because it is impacting my mental health now. Let’s see what happens.",
        "My mental health is a joke. Just like me. I have severe OCD (not that kiddie trypophobia jokes again please) and its making my life hell. CBT and ERP involve facing fears but I cant even make a small change. Its verry hard. Meds dont work. I fear everything(like someone is watching me, that I will go to jail if I talk to someone wrongly, that I will be killed if I dont wash my hands with three different soaps)",
        "Long distance sucks. It makes me sadder. We know we have to separate but one of us ends up calling after some months anyways. I was better when I was not dating at all. Also sucks that i am a little underweight but my head is so big, it looks weird especially with my hairline receding in my early 20s. Father's advice of padhega likhega banega mahan khelega kudega hoga kharab isn't true. I got a job but half of my body now hurts and feels weak and i can't sit for long and the job requires sitting for really long hours. Got hunched back. I wish I had been more physically active. Everything is so costly. Went to the govt medical hospital doctors so ignorant. He heard three lines gave a prescription with daily injections in my waist. No way I'm taking that.",
        "Do you want to share publicly how old you are? and how much distance?",
        "Are you getting professional help?",
        "Hang in strong. DM me if you want help.",
        "I try but meds dont work. I am resistant to them. And I am ashamed to share my thoughts with the therapist and the therapist is in another city so no good therapists near me",
        "23, banglore and Jaipur",
        "The last line seems like beginning of psychosis. See a psychiatrist.",
        "I am seeing psychiatrists. I have changed 5 of them till now. Nothing helps. No meds work.",
        "Have you tried antipsychotics?",
        "Some of my meds are antipsychotics I think. They are used in treatment of schizophrenias right?",
        "Yes. Which ones have you tried till now?",
        "Oh man I have tried like 20 pages worth of prescription changes. I will need to check all of them and which ones are antipsychotics. Any other way you can help me please tell. Psychiatrist or psychologist recommendation. Even a city where there are good therapists , psychiatrist  or something works.",
        "Do you have negative symptoms like anhedonia, depressed mood etc?",
        "I have OCD,Depression and Social Anxiety all officially diagnosed. I have comorbid symptoms as the therapist explained and anhedonia,ADHD,brain fog and similar also exist. I also have psychotic rage issues. I self harm with blunt force to my head using punches and objects. I break stuff , last time I broke a glass and bloodied my hand. Man its hell",
        "Oh I’m sorry for you. You can try to get low dose Amisulpride (25mg). It increases dopamine at lower doses and helps me significantly with the motivation issues. I have tried many meds in the past and nothing beats Amisulpride. It does have side effects like increased prolactin but nothing dangerous.",
        "Thanks but I would rather take meds with professional guidance. Tapering off meds make me go crazy. Changing meds make me go crazy. I will keep it in mind. I still look for the best psychiatrist in India but I dont know where they are",
        "Ask your psychiatrist about Amisulpride specifically for dysthymia / negative symptoms. BTW where do you live?",
        "Every second person is obsessed with \"Big D package\" of a random person. For example, I was on a vacation in North East of India, and I met people in a cafe and I was shocked when they started to collect my biodata. Why should I be interested in knowing what do you do, what \"package size\" do you have, are you a engineering manager or chola samosa? Then I wondered that's why Indians are so frustrated with their lives and they will go to limits to become a frustrated person. After that incident, I just stopped talking to people whereas in the background I heard about people discussing about IT, marriage plan, girl lafda at 12000ft. What? Yes.",
        "Ask your Dr to change the meds. \n\nAlso you should NEVER be ashamed to share your thoughts with your therapist.\n\nOnly if you open up will she be able to help you",
        "You listed many issues. Which is your biggest issue?",
        "Madhya Pradesh . Tier 2 city",
        "Is Nagpur is near to you? I know a good doctor there.",
        "Yeah\n\ndo tell",
        "Dr. Vivek Kirpekar (He treated me few months ago, decent doctor) \nDr. Sudhir Bhave (Heard good things about him too)",
        "Thanks",
        "You might want to try neuro modulation if drugs and therapy aren't helping. Also therapy is hard and takes a lot of resolve to challenge your thoughts.",
        "Off topic but do u think anti-depressants are effective?",
        "Trials have consistently shown that they're better than placebo. What is important is the proper diagnosis and intervention needs to be tailored to the patient. Some might do better with therapy and some might benefit more with medication or both."
    ],
    "cleaned_text": "weekly mental health discussion thread anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall ",
    "cleaned_title": "weekly mental health discussion thread",
    "cleaned_selftext": "anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall",
    "cleaned_comments": "today one managers escalated senior management telling management bullies people screams shouts causes anxiety team due several colleagues left project quietly refused go quietly escalated said wont work project anymore impacting mental health lets see happens mental health joke like severe ocd kiddie trypophobia jokes please making life hell cbt erp involve facing fears cant even make small change verry hard meds dont work fear everythinglike someone watching go jail talk someone wrongly killed dont wash hands three different soaps long distance sucks makes sadder know separate one us ends calling months anyways better dating also sucks little underweight head big looks weird especially hairline receding early fathers advice padhega likhega banega mahan khelega kudega hoga kharab isnt true got job half body hurts feels weak cant sit long job requires sitting really long hours got hunched back wish physically active everything costly went govt medical hospital doctors ignorant heard three lines gave prescription daily injections waist way im taking want share publicly old much distance getting professional help hang strong dm want help try meds dont work resistant ashamed share thoughts therapist therapist another city good therapists near banglore jaipur last line seems like beginning psychosis see psychiatrist seeing psychiatrists changed till nothing helps meds work tried antipsychotics meds antipsychotics think used treatment schizophrenias right yes ones tried till oh man tried like pages worth prescription changes need check ones antipsychotics way help please tell psychiatrist psychologist recommendation even city good therapists psychiatrist something works negative symptoms like anhedonia depressed mood etc ocddepression social anxiety officially diagnosed comorbid symptoms therapist explained anhedoniaadhdbrain fog similar also exist also psychotic rage issues self harm blunt force head using punches objects break stuff last time broke glass bloodied hand man hell oh im sorry try get low dose amisulpride mg increases dopamine lower doses helps significantly motivation issues tried many meds past nothing beats amisulpride side effects like increased prolactin nothing dangerous thanks would rather take meds professional guidance tapering meds make go crazy changing meds make go crazy keep mind still look best psychiatrist india dont know ask psychiatrist amisulpride specifically dysthymia negative symptoms btw live every second person obsessed big package random person example vacation north east india met people cafe shocked started collect biodata interested knowing package size engineering manager chola samosa wondered thats indians frustrated lives go limits become frustrated person incident stopped talking people whereas background heard people discussing marriage plan girl lafda ft yes ask dr change meds also never ashamed share thoughts therapist open able help listed many issues biggest issue madhya pradesh tier city nagpur near know good doctor yeah tell dr vivek kirpekar treated months ago decent doctor dr sudhir bhave heard good things thanks might want try neuro modulation drugs therapy arent helping also therapy hard takes lot resolve challenge thoughts topic u think antidepressants effective trials consistently shown theyre better placebo important proper diagnosis intervention needs tailored patient might better therapy might benefit medication",
    "light_cleaned_title": "Weekly Mental Health Discussion Thread",
    "light_cleaned_selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here. You may find someone who has gone through a similar episode and might be able to help/guide you. Please be civil and maintain Reddiquette while participating or replying/helping out someone. You can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic. **If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**. * **Helplines**: AASRA: 91-22-27546669 (24 hours) * **Sneha Foundation**: 91-44-24640050 (24 hours) * **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours) * **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm) * **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm) **Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Today one of my managers, escalated to senior management again. After me telling the management how she bullies people and screams and shouts and causes anxiety in the team due to which several of my colleagues have left the project quietly. I refused to go quietly so I escalated it further and said I won’t work on this project anymore because it is impacting my mental health now. Let’s see what happens. My mental health is a joke. Just like me. I have severe OCD (not that kiddie trypophobia jokes again please) and its making my life hell. CBT and ERP involve facing fears but I cant even make a small change. Its verry hard. Meds dont work. I fear everything(like someone is watching me, that I will go to jail if I talk to someone wrongly, that I will be killed if I dont wash my hands with three different soaps) Long distance sucks. It makes me sadder. We know we have to separate but one of us ends up calling after some months anyways. I was better when I was not dating at all. Also sucks that i am a little underweight but my head is so big, it looks weird especially with my hairline receding in my early 20s. Father's advice of padhega likhega banega mahan khelega kudega hoga kharab isn't true. I got a job but half of my body now hurts and feels weak and i can't sit for long and the job requires sitting for really long hours. Got hunched back. I wish I had been more physically active. Everything is so costly. Went to the govt medical hospital doctors so ignorant. He heard three lines gave a prescription with daily injections in my waist. No way I'm taking that. Do you want to share publicly how old you are? and how much distance? Are you getting professional help? Hang in strong. DM me if you want help. I try but meds dont work. I am resistant to them. And I am ashamed to share my thoughts with the therapist and the therapist is in another city so no good therapists near me 23, banglore and Jaipur The last line seems like beginning of psychosis. See a psychiatrist. I am seeing psychiatrists. I have changed 5 of them till now. Nothing helps. No meds work. Have you tried antipsychotics? Some of my meds are antipsychotics I think. They are used in treatment of schizophrenias right? Yes. Which ones have you tried till now? Oh man I have tried like 20 pages worth of prescription changes. I will need to check all of them and which ones are antipsychotics. Any other way you can help me please tell. Psychiatrist or psychologist recommendation. Even a city where there are good therapists , psychiatrist or something works. Do you have negative symptoms like anhedonia, depressed mood etc? I have OCD,Depression and Social Anxiety all officially diagnosed. I have comorbid symptoms as the therapist explained and anhedonia,ADHD,brain fog and similar also exist. I also have psychotic rage issues. I self harm with blunt force to my head using punches and objects. I break stuff , last time I broke a glass and bloodied my hand. Man its hell Oh I’m sorry for you. You can try to get low dose Amisulpride (25mg). It increases dopamine at lower doses and helps me significantly with the motivation issues. I have tried many meds in the past and nothing beats Amisulpride. It does have side effects like increased prolactin but nothing dangerous. Thanks but I would rather take meds with professional guidance. Tapering off meds make me go crazy. Changing meds make me go crazy. I will keep it in mind. I still look for the best psychiatrist in India but I dont know where they are Ask your psychiatrist about Amisulpride specifically for dysthymia / negative symptoms. BTW where do you live? Every second person is obsessed with \"Big D package\" of a random person. For example, I was on a vacation in North East of India, and I met people in a cafe and I was shocked when they started to collect my biodata. Why should I be interested in knowing what do you do, what \"package size\" do you have, are you a engineering manager or chola samosa? Then I wondered that's why Indians are so frustrated with their lives and they will go to limits to become a frustrated person. After that incident, I just stopped talking to people whereas in the background I heard about people discussing about IT, marriage plan, girl lafda at 12000ft. What? Yes. Ask your Dr to change the meds. Also you should NEVER be ashamed to share your thoughts with your therapist. Only if you open up will she be able to help you You listed many issues. Which is your biggest issue? Madhya Pradesh . Tier 2 city Is Nagpur is near to you? I know a good doctor there. Yeah do tell Dr. Vivek Kirpekar (He treated me few months ago, decent doctor) Dr. Sudhir Bhave (Heard good things about him too) Thanks You might want to try neuro modulation if drugs and therapy aren't helping. Also therapy is hard and takes a lot of resolve to challenge your thoughts. Off topic but do u think anti-depressants are effective? Trials have consistently shown that they're better than placebo. What is important is the proper diagnosis and intervention needs to be tailored to the patient. Some might do better with therapy and some might benefit more with medication or both."
}