{
    "id": "13ns957",
    "title": "Caffeinated drinks should not be sold to children",
    "url": "https://www.reddit.com/r/india/comments/13ns957/caffeinated_drinks_should_not_be_sold_to_children/",
    "selftext": "Nowadays  I see a lot of random brands of caffeinated drinks available at the  market for less than 50 rupees.  The cheapest is Rs. 20.  It is not  recommended for children and pregnant women.  Usually, these energy  drinks contain high amounts of caffeine which are not advisable for  adults to drink on a daily basis.  Children who can drink this regularly  can cause permanent damage to the kidneys and cardiovascular system at a  young age.  But, I see kids casually buying 2-3 bottles of these drinks  from local shops.  The worst I saw was a father who bought this drink  for a kid under 5 years old.\n\nAlso,  nowadays lots of teens and adults are binge drinking alcohol with these  kinds of energy drinks.  There is a high chance that it  can cause permanent liver and kidney damage.\n\nSome references:\n\n(1) [https://www.nccih.nih.gov/health/energy-drinks](https://www.nccih.nih.gov/health/energy-drinks)\n\n(2) [https://twitter.com/theliverdr/status/1653763473552314368](https://twitter.com/theliverdr/status/1653763473552314368)\n\nThere is a compound in energy drinks called \"taurine\". There have been numerous studies on harmful effects of consuming taurine.  Coffee contains caffeine, but does not contain taurine.  Also consuming low amounts of consuming coffee, shows lots of health benefits according to some studies.\n\n(3) [https://driftaway.coffee/coffee-vs-red-bull/](https://driftaway.coffee/coffee-vs-red-bull/)\n\n(4) [https://www.healthline.com/nutrition/what-is-taurine](https://www.healthline.com/nutrition/what-is-taurine)\n\n(5) [https://www.hsph.harvard.edu/news/hsph-in-the-news/is-coffee-good-or-bad-for-your-health/](https://www.hsph.harvard.edu/news/hsph-in-the-news/is-coffee-good-or-bad-for-your-health/)\n\n&#x200B;\n\n&#x200B;\n\np.s: I'm not a medical professional.  I'm posting this information based on the information, I collected from internet.",
    "flair": "AskIndia",
    "score": 188,
    "num_comments": 56,
    "created_utc": 1684673469.0,
    "convurl": "https://external-preview.redd.it/n3en-9HRX2D8EJZ1h9NqJ87nCbJyM2OMBZpOWbAok7I.jpg?auto=webp&v=enabled&s=973945f1735d078cd87d26c8256a5b01e365836d",
    "comments": [
        "They should be allowed for purchase by anyone but parents should raise awareness to their children about the risks of consuming such drinks. That’s what I think atleast.",
        "![gif](giphy|26ufq8k6RuyKjmdTW)",
        "What about drinking coffee",
        "If kids can drink tea and coffee they can drink thi.",
        "In college, I used to go around asking \"what, do you think, is the world's most used psychoactive drug?\". Most people would answer one those synthetic drugs like c0caine, h3roin, etc. The only guy who ever answered it correctly was the guy who was the biggest ganjedi in my college. The answer is caffeine.",
        "it's not alcohol? damn",
        "It's not just caffeine, there is an exorbitant amount of added sugar in it.  Also coffee contains caffeine, it doesn't contain a compound called Taurine. \n\n(1) [https://www.healthline.com/nutrition/what-is-taurine](https://www.healthline.com/nutrition/what-is-taurine)\n\n(2) [https://driftaway.coffee/coffee-vs-red-bull/](https://driftaway.coffee/coffee-vs-red-bull/)",
        "processed sugar is also highly addictive.",
        ">caffeine which are not advisable for adults to drink on a daily basis.\n\n![gif](giphy|H5C8CevNMbpBqNqFjl)",
        "There are no advertisements for these products.  They just appear out of nowhere.  People started buying and drinking it all of a sudden since it contains the term \"Energy\".",
        "I edited my post, added few points about coffee.",
        "Me who drinks 3 cups of tea everyday",
        "Me who drinks 3 cups of tea everyday",
        "![gif](giphy|eKh3F5CbqKtqfaPP63)",
        "Coffee has polyphenols that make you live longer so coffee isn't entirely bad for you",
        "Tea is ok. Energy drinks contain a lot more of it. That's why it is not advisable to drink them daily. 3 cups a day is ok.",
        "Avg Indian Millennial Parent will read this, discuss it with other Millennial Parents during their next meet-up while their kids sit on another table and drink Coke. Education isn’t the problem.",
        "It's insane just how unhealthy most food products are these days.\n\nAnd just as I was typing this, I saw a Sting ad on TV",
        "That's not psychoactive tho",
        "Energy drinks are indeed bad if you take it daily.  \n\n\nCoffee and tea have similar effects but not that bad.  \n\n\nat the end of the ay, anything in excessive is bad for you. so meh.",
        "Coffee and tea are actually way better to have than Coke. Personally, aside from energy drinks, I feel the caffeine is less of a concern than the absolutely ridiculous amounts of sugar in many drinks like Coke. Sugar is also an addicting, psychoactive drug, and it kills way more people than caffeine.",
        ">Usually, these energy drinks contain high amounts of caffeine which are not advisable for adults to drink on a daily basis\n\n250 ml Energy drink has just 72 mg of caffeine which isn't even near to 1 cup of Espresso which is around 120 mg of coffee and still many take and they are fine.",
        "....... Who said kids should drink tea and coffee",
        "Sting",
        "The absolute worst is when parents order diet coke for their children under 10. Aspartame is very bad for young people.",
        "I said can 😔",
        "Putting ban on things isn't going to stop anything. Legal drinking in India is, at least, 18 years yet I haven't met anyone who hasn't drank alcohol before attaining 18 years of age. Youngsters, definitely, do not wait till 21 years or 25 years to start drinking alcohol.\n\n\n\nAs for children, it's parents' responsibility to monitor their activities. The best we can do is ban school canteens from selling aerated drinks. \nParents shouldn't allow children to purchase products by themselves. They must instruct the adults, that accompanies their child, to not buy the child any aerated drink. \n\n\n\nI just think that an adult that has conceived children must have enough common sense to know what children should consume and should not consume. This isn't even about education or literacy. I have so many uneducated and illiterate folks discourage consumption of aerated drinks and junk food because they are harmful for body. They may not be able to pinpoint the exact issue with the items but they have enough common sense to know that processed food items are not good for health. \n\n\n\nHow come people with education, money to buy such things, literacy level high enough to read the contents of such items are unable to get such simply concept?",
        "Why is your one comment upvoted and one downvoted?",
        "*Aspartame is very bad for people",
        "I think you have a great point. Just only for high sugar content, there should be restrictions on cold drinks but that would create a problem. The same rule has to be applied on jalebis (and other sweets). Every filter coffee shop will have to adhere to the regulations. \n\nSo, the first step should be to identify how to do it. Without touching my coffee or jalebi because I will raise army to fight you if you do so. \n\nPS: I am pretty sure someone must have made coffee flavored jalebi. As much as I hate the idea, I would love to have that monstrosity",
        "Agreed. They should be injected directly into their bloodstream 🤠",
        "duplicate comment, good old reddit bug",
        "Good old “reliable” wifi",
        "Yea cos caffeine in a sense does provide energy.",
        "No my point is not that coffee or jalebi is not same as these energy drinks, these contains higher amounts of sugar, taurine, food colours, etc.  Comparing this energy drinks with Jalebis or homemade coffee, these drinks are more dangerous for kids is what I am saying.",
        "I had Sting once thinking or was just some red coloured cool drink. Oh man, the headache that I had that whole night. I have no idea how people drink these things.",
        "Bro as an Indian teen I NEED COFFEE to keep me studying for 12 hrs a day",
        "Coke is a caffeinated energy drink? What?",
        "Who's drinking espresso daily, and WHY?",
        "I am drinking sting right now, its 2 am",
        "I hope you being sarcastic 😭",
        "Caffeine does pose a lot of side effects and should be consumed fairly restrictively (equivalent to 400mg/day). \n\nTaurine's negative effects is debatable, though. It's an amino acid which is also naturally synthesised in the body for improvement in nervous system function, improve liver function, reduce heart failure (research shows significant reduction), along with cholesterol and blood pressure levels, it seems. The side effects are also relatively milder, and even if so, was unclear even if it was causal.\n\nThere's 1g in a Red Bull/Monster can, and you can safely take upto 6g (European Food Safety Authority satiety limits), and so unless there are other some more problematic compounds in Red Bull (like caffeine and sugar/sugar supplements maybe), you could possibly safely drink upto 4 cans of Red Bull or Monster (considering you would have any other taurine sources).",
        "Me who goes to gym\n\n![gif](giphy|H5C8CevNMbpBqNqFjl)",
        "Sugar along with fat is addictive. Only sugar is not.",
        "Bro got high on the wrong coke",
        "You're right. I guess I'm too harsh and was acting emotionally to it. I'll edit my comment to reflect more objectivity.",
        "I have a l Iocal retail shop and cheaper version of energy drinks like sting is very popular here and is only for ₹20. Its also owned by pepsi. Its has caffeine and taurine. We just plainely refuse the children and recommand parents to give icecream or fruit juice like maza or paperboat. But the issue is people sometimes still buy it for their child and we can't really deny them. Its sad that there is no restriction for something like that even when its owned by big brand company.",
        "I have made them perfectly balanced, as all things should be.",
        "Aerosmith",
        "![gif](giphy|hOclin2KcAEOcZEnXK|downsized)",
        "It's straight up good for you, but only if consumed black, no sugar.",
        "Coffee has caffeine which stimulates your brain to concentrate more and kinda gives you more energy to lift. Lifters usually either choose black coffee or Pre workout supplement or caffeine capsules. Anything of these works great."
    ],
    "cleaned_text": "caffeinated drinks sold children nowadays see lot random brands caffeinated drinks available market less rupees cheapest rs recommended children pregnant women usually energy drinks contain high amounts caffeine advisable adults drink daily basis children drink regularly cause permanent damage kidneys cardiovascular system young age see kids casually buying bottles drinks local shops worst saw father bought drink kid years old also nowadays lots teens adults binge drinking alcohol kinds energy drinks high chance cause permanent liver kidney damage references httpswwwnccihnihgovhealthenergydrinkshttpswwwnccihnihgovhealthenergydrinks httpstwittercomtheliverdrstatushttpstwittercomtheliverdrstatus compound energy drinks called taurine numerous studies harmful effects consuming taurine coffee contains caffeine contain taurine also consuming low amounts consuming coffee shows lots health benefits according studies httpsdriftawaycoffeecoffeevsredbullhttpsdriftawaycoffeecoffeevsredbull httpswwwhealthlinecomnutritionwhatistaurinehttpswwwhealthlinecomnutritionwhatistaurine httpswwwhsphharvardedunewshsphinthenewsiscoffeegoodorbadforyourhealthhttpswwwhsphharvardedunewshsphinthenewsiscoffeegoodorbadforyourhealth xb xb ps im medical professional im posting information based information collected internet ",
    "cleaned_title": "caffeinated drinks sold children",
    "cleaned_selftext": "nowadays see lot random brands caffeinated drinks available market less rupees cheapest rs recommended children pregnant women usually energy drinks contain high amounts caffeine advisable adults drink daily basis children drink regularly cause permanent damage kidneys cardiovascular system young age see kids casually buying bottles drinks local shops worst saw father bought drink kid years old also nowadays lots teens adults binge drinking alcohol kinds energy drinks high chance cause permanent liver kidney damage references httpswwwnccihnihgovhealthenergydrinkshttpswwwnccihnihgovhealthenergydrinks httpstwittercomtheliverdrstatushttpstwittercomtheliverdrstatus compound energy drinks called taurine numerous studies harmful effects consuming taurine coffee contains caffeine contain taurine also consuming low amounts consuming coffee shows lots health benefits according studies httpsdriftawaycoffeecoffeevsredbullhttpsdriftawaycoffeecoffeevsredbull httpswwwhealthlinecomnutritionwhatistaurinehttpswwwhealthlinecomnutritionwhatistaurine httpswwwhsphharvardedunewshsphinthenewsiscoffeegoodorbadforyourhealthhttpswwwhsphharvardedunewshsphinthenewsiscoffeegoodorbadforyourhealth xb xb ps im medical professional im posting information based information collected internet",
    "cleaned_comments": "allowed purchase anyone parents raise awareness children risks consuming drinks thats think atleast gifgiphyufqkruykjmdtw drinking coffee kids drink tea coffee drink thi college used go around asking think worlds used psychoactive drug people would answer one synthetic drugs like ccaine hroin etc guy ever answered correctly guy biggest ganjedi college answer caffeine alcohol damn caffeine exorbitant amount added sugar also coffee contains caffeine doesnt contain compound called taurine httpswwwhealthlinecomnutritionwhatistaurinehttpswwwhealthlinecomnutritionwhatistaurine httpsdriftawaycoffeecoffeevsredbullhttpsdriftawaycoffeecoffeevsredbull processed sugar also highly addictive caffeine advisable adults drink daily basis gifgiphyhccevnmbpbqnqfjl advertisements products appear nowhere people started buying drinking sudden since contains term energy edited post added points coffee drinks cups tea everyday drinks cups tea everyday gifgiphyekhfcbqktqfapp coffee polyphenols make live longer coffee isnt entirely bad tea ok energy drinks contain lot thats advisable drink daily cups day ok avg indian millennial parent read discuss millennial parents next meetup kids sit another table drink coke education isnt problem insane unhealthy food products days typing saw sting ad tv thats psychoactive tho energy drinks indeed bad take daily coffee tea similar effects bad end ay anything excessive bad meh coffee tea actually way better coke personally aside energy drinks feel caffeine less concern absolutely ridiculous amounts sugar many drinks like coke sugar also addicting psychoactive drug kills way people caffeine usually energy drinks contain high amounts caffeine advisable adults drink daily basis ml energy drink mg caffeine isnt even near cup espresso around mg coffee still many take fine said kids drink tea coffee sting absolute worst parents order diet coke children aspartame bad young people said putting ban things isnt going stop anything legal drinking india least years yet havent met anyone hasnt drank alcohol attaining years age youngsters definitely wait till years years start drinking alcohol children parents responsibility monitor activities best ban school canteens selling aerated drinks parents shouldnt allow children purchase products must instruct adults accompanies child buy child aerated drink think adult conceived children must enough common sense know children consume consume isnt even education literacy many uneducated illiterate folks discourage consumption aerated drinks junk food harmful body may able pinpoint exact issue items enough common sense know processed food items good health come people education money buy things literacy level high enough read contents items unable get simply concept one comment upvoted one downvoted aspartame bad people think great point high sugar content restrictions cold drinks would create problem rule applied jalebis sweets every filter coffee shop adhere regulations first step identify without touching coffee jalebi raise army fight ps pretty sure someone must made coffee flavored jalebi much hate idea would love monstrosity agreed injected directly bloodstream duplicate comment good old reddit bug good old reliable wifi yea cos caffeine sense provide energy point coffee jalebi energy drinks contains higher amounts sugar taurine food colours etc comparing energy drinks jalebis homemade coffee drinks dangerous kids saying sting thinking red coloured cool drink oh man headache whole night idea people drink things bro indian teen need coffee keep studying hrs day coke caffeinated energy drink whos drinking espresso daily drinking sting right hope sarcastic caffeine pose lot side effects consumed fairly restrictively equivalent mgday taurines negative effects debatable though amino acid also naturally synthesised body improvement nervous system function improve liver function reduce heart failure research shows significant reduction along cholesterol blood pressure levels seems side effects also relatively milder even unclear even causal theres g red bullmonster safely take upto g european food safety authority satiety limits unless problematic compounds red bull like caffeine sugarsugar supplements maybe could possibly safely drink upto cans red bull monster considering would taurine sources goes gym gifgiphyhccevnmbpbqnqfjl sugar along fat addictive sugar bro got high wrong coke youre right guess im harsh acting emotionally ill edit comment reflect objectivity l iocal retail shop cheaper version energy drinks like sting popular also owned pepsi caffeine taurine plainely refuse children recommand parents give icecream fruit juice like maza paperboat issue people sometimes still buy child cant really deny sad restriction something like even owned big brand company made perfectly balanced things aerosmith gifgiphyhoclinkcaeoczenxkdownsized straight good consumed black sugar coffee caffeine stimulates brain concentrate kinda gives energy lift lifters usually either choose black coffee pre workout supplement caffeine capsules anything works great",
    "light_cleaned_title": "Caffeinated drinks should not be sold to children",
    "light_cleaned_selftext": "Nowadays I see a lot of random brands of caffeinated drinks available at the market for less than 50 rupees. The cheapest is Rs. 20. It is not recommended for children and pregnant women. Usually, these energy drinks contain high amounts of caffeine which are not advisable for adults to drink on a daily basis. Children who can drink this regularly can cause permanent damage to the kidneys and cardiovascular system at a young age. But, I see kids casually buying 2-3 bottles of these drinks from local shops. The worst I saw was a father who bought this drink for a kid under 5 years old. Also, nowadays lots of teens and adults are binge drinking alcohol with these kinds of energy drinks. There is a high chance that it can cause permanent liver and kidney damage. Some references: (1) [https://www.nccih.nih.gov/health/energy-drinks](https://www.nccih.nih.gov/health/energy-drinks) (2) [https://twitter.com/theliverdr/status/1653763473552314368](https://twitter.com/theliverdr/status/1653763473552314368) There is a compound in energy drinks called \"taurine\". There have been numerous studies on harmful effects of consuming taurine. Coffee contains caffeine, but does not contain taurine. Also consuming low amounts of consuming coffee, shows lots of health benefits according to some studies. (3) [https://driftaway.coffee/coffee-vs-red-bull/](https://driftaway.coffee/coffee-vs-red-bull/) (4) [https://www.healthline.com/nutrition/what-is-taurine](https://www.healthline.com/nutrition/what-is-taurine) (5) [https://www.hsph.harvard.edu/news/hsph-in-the-news/is-coffee-good-or-bad-for-your-health/](https://www.hsph.harvard.edu/news/hsph-in-the-news/is-coffee-good-or-bad-for-your-health/) &#x200B; &#x200B; p.s: I'm not a medical professional. I'm posting this information based on the information, I collected from internet.",
    "light_cleaned_comments": "They should be allowed for purchase by anyone but parents should raise awareness to their children about the risks of consuming such drinks. That’s what I think atleast. ![gif](giphy|26ufq8k6RuyKjmdTW) What about drinking coffee If kids can drink tea and coffee they can drink thi. In college, I used to go around asking \"what, do you think, is the world's most used psychoactive drug?\". Most people would answer one those synthetic drugs like c0caine, h3roin, etc. The only guy who ever answered it correctly was the guy who was the biggest ganjedi in my college. The answer is caffeine. it's not alcohol? damn It's not just caffeine, there is an exorbitant amount of added sugar in it. Also coffee contains caffeine, it doesn't contain a compound called Taurine. (1) [https://www.healthline.com/nutrition/what-is-taurine](https://www.healthline.com/nutrition/what-is-taurine) (2) [https://driftaway.coffee/coffee-vs-red-bull/](https://driftaway.coffee/coffee-vs-red-bull/) processed sugar is also highly addictive. >caffeine which are not advisable for adults to drink on a daily basis. ![gif](giphy|H5C8CevNMbpBqNqFjl) There are no advertisements for these products. They just appear out of nowhere. People started buying and drinking it all of a sudden since it contains the term \"Energy\". I edited my post, added few points about coffee. Me who drinks 3 cups of tea everyday Me who drinks 3 cups of tea everyday ![gif](giphy|eKh3F5CbqKtqfaPP63) Coffee has polyphenols that make you live longer so coffee isn't entirely bad for you Tea is ok. Energy drinks contain a lot more of it. That's why it is not advisable to drink them daily. 3 cups a day is ok. Avg Indian Millennial Parent will read this, discuss it with other Millennial Parents during their next meet-up while their kids sit on another table and drink Coke. Education isn’t the problem. It's insane just how unhealthy most food products are these days. And just as I was typing this, I saw a Sting ad on TV That's not psychoactive tho Energy drinks are indeed bad if you take it daily. Coffee and tea have similar effects but not that bad. at the end of the ay, anything in excessive is bad for you. so meh. Coffee and tea are actually way better to have than Coke. Personally, aside from energy drinks, I feel the caffeine is less of a concern than the absolutely ridiculous amounts of sugar in many drinks like Coke. Sugar is also an addicting, psychoactive drug, and it kills way more people than caffeine. >Usually, these energy drinks contain high amounts of caffeine which are not advisable for adults to drink on a daily basis 250 ml Energy drink has just 72 mg of caffeine which isn't even near to 1 cup of Espresso which is around 120 mg of coffee and still many take and they are fine. ....... Who said kids should drink tea and coffee Sting The absolute worst is when parents order diet coke for their children under 10. Aspartame is very bad for young people. I said can 😔 Putting ban on things isn't going to stop anything. Legal drinking in India is, at least, 18 years yet I haven't met anyone who hasn't drank alcohol before attaining 18 years of age. Youngsters, definitely, do not wait till 21 years or 25 years to start drinking alcohol. As for children, it's parents' responsibility to monitor their activities. The best we can do is ban school canteens from selling aerated drinks. Parents shouldn't allow children to purchase products by themselves. They must instruct the adults, that accompanies their child, to not buy the child any aerated drink. I just think that an adult that has conceived children must have enough common sense to know what children should consume and should not consume. This isn't even about education or literacy. I have so many uneducated and illiterate folks discourage consumption of aerated drinks and junk food because they are harmful for body. They may not be able to pinpoint the exact issue with the items but they have enough common sense to know that processed food items are not good for health. How come people with education, money to buy such things, literacy level high enough to read the contents of such items are unable to get such simply concept? Why is your one comment upvoted and one downvoted? *Aspartame is very bad for people I think you have a great point. Just only for high sugar content, there should be restrictions on cold drinks but that would create a problem. The same rule has to be applied on jalebis (and other sweets). Every filter coffee shop will have to adhere to the regulations. So, the first step should be to identify how to do it. Without touching my coffee or jalebi because I will raise army to fight you if you do so. PS: I am pretty sure someone must have made coffee flavored jalebi. As much as I hate the idea, I would love to have that monstrosity Agreed. They should be injected directly into their bloodstream 🤠 duplicate comment, good old reddit bug Good old “reliable” wifi Yea cos caffeine in a sense does provide energy. No my point is not that coffee or jalebi is not same as these energy drinks, these contains higher amounts of sugar, taurine, food colours, etc. Comparing this energy drinks with Jalebis or homemade coffee, these drinks are more dangerous for kids is what I am saying. I had Sting once thinking or was just some red coloured cool drink. Oh man, the headache that I had that whole night. I have no idea how people drink these things. Bro as an Indian teen I NEED COFFEE to keep me studying for 12 hrs a day Coke is a caffeinated energy drink? What? Who's drinking espresso daily, and WHY? I am drinking sting right now, its 2 am I hope you being sarcastic 😭 Caffeine does pose a lot of side effects and should be consumed fairly restrictively (equivalent to 400mg/day). Taurine's negative effects is debatable, though. It's an amino acid which is also naturally synthesised in the body for improvement in nervous system function, improve liver function, reduce heart failure (research shows significant reduction), along with cholesterol and blood pressure levels, it seems. The side effects are also relatively milder, and even if so, was unclear even if it was causal. There's 1g in a Red Bull/Monster can, and you can safely take upto 6g (European Food Safety Authority satiety limits), and so unless there are other some more problematic compounds in Red Bull (like caffeine and sugar/sugar supplements maybe), you could possibly safely drink upto 4 cans of Red Bull or Monster (considering you would have any other taurine sources). Me who goes to gym ![gif](giphy|H5C8CevNMbpBqNqFjl) Sugar along with fat is addictive. Only sugar is not. Bro got high on the wrong coke You're right. I guess I'm too harsh and was acting emotionally to it. I'll edit my comment to reflect more objectivity. I have a l Iocal retail shop and cheaper version of energy drinks like sting is very popular here and is only for ₹20. Its also owned by pepsi. Its has caffeine and taurine. We just plainely refuse the children and recommand parents to give icecream or fruit juice like maza or paperboat. But the issue is people sometimes still buy it for their child and we can't really deny them. Its sad that there is no restriction for something like that even when its owned by big brand company. I have made them perfectly balanced, as all things should be. Aerosmith ![gif](giphy|hOclin2KcAEOcZEnXK|downsized) It's straight up good for you, but only if consumed black, no sugar. Coffee has caffeine which stimulates your brain to concentrate more and kinda gives you more energy to lift. Lifters usually either choose black coffee or Pre workout supplement or caffeine capsules. Anything of these works great."
}