{
    "id": "1bc1nfi",
    "title": "SC to examine Madras HC ruling that downloading, watching child porn not offence under POCSO, IT laws",
    "url": "https://www.thehindu.com/news/national/sc-to-examine-madras-hc-ruling-that-downloading-watching-child-porn-not-offence-under-pocso-it-laws/article67938830.ece",
    "selftext": "https://12ft.io/https://www.thehindu.com/news/national/sc-to-examine-madras-hc-ruling-that-downloading-watching-child-porn-not-offence-under-pocso-it-laws/article67938830.ece",
    "flair": "Law & Courts",
    "score": 68,
    "num_comments": 6,
    "created_utc": 1710158943.0,
    "convurl": "https://external-preview.redd.it/qqy024wWEABabQW_h_uTuglhtAaG1bH7N4MVb3Ps12k.jpg?auto=webp&s=d2b1f9897009b232bfbea6bf7d2359983c070bfa",
    "comments": [
        ">Terming as “atrocious”, the Supreme Court on March 11 agreed to hear a plea challenging a Madras High Court ruling which said that mere downloading and watching child pornography is not an offence under the POCSO Act and the Information Technology law.\n\n>The High Court had, on January 11, quashed the criminal proceedings against a 28-year-old man charged with downloading on his mobile phone pornographic content involving children.\n\n>The present-day children are grappling with the serious issue of watching porn and instead of punishing them, the society must be \"mature enough\" to educate them, it had also said.\n\n>“This (the high court judgement) is atrocious. How can the single judge say this? Issue notice returnable in three weeks,” the CJI said.",
        "Meanwhile someone just check that HC judge’s browser history.",
        "High court gave out the correct judgement imo, CJI being a dick like always, first you don't educate people what's wrong and what's not, on top of that the one who uploaded the CP should be tracked down first",
        "Someone check this guy's browser history.",
        "What. I didn't mean to say that the person watching CP is right, I just pointed out how stupid the system in our country is, no sex education is the reason people can't tell right from wrong. Again, not saying what the guy did is justifiable but the govt is also to be blamed",
        "Fair enough"
    ],
    "cleaned_text": "sc examine madras hc ruling downloading watching child porn offence pocso laws  ",
    "cleaned_title": "sc examine madras hc ruling downloading watching child porn offence pocso laws",
    "cleaned_selftext": "",
    "cleaned_comments": "terming atrocious supreme court march agreed hear plea challenging madras high court ruling said mere downloading watching child pornography offence pocso act information technology law high court january quashed criminal proceedings yearold man charged downloading mobile phone pornographic content involving children presentday children grappling serious issue watching porn instead punishing society must mature enough educate also said high court judgement atrocious single judge say issue notice returnable three weeks cji said meanwhile someone check hc judges browser history high court gave correct judgement imo cji dick like always first dont educate people whats wrong whats top one uploaded cp tracked first someone check guys browser history didnt mean say person watching cp right pointed stupid system country sex education reason people cant tell right wrong saying guy justifiable govt also blamed fair enough",
    "light_cleaned_title": "SC to examine Madras HC ruling that downloading, watching child porn not offence under POCSO, IT laws",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">Terming as “atrocious”, the Supreme Court on March 11 agreed to hear a plea challenging a Madras High Court ruling which said that mere downloading and watching child pornography is not an offence under the POCSO Act and the Information Technology law. >The High Court had, on January 11, quashed the criminal proceedings against a 28-year-old man charged with downloading on his mobile phone pornographic content involving children. >The present-day children are grappling with the serious issue of watching porn and instead of punishing them, the society must be \"mature enough\" to educate them, it had also said. >“This (the high court judgement) is atrocious. How can the single judge say this? Issue notice returnable in three weeks,” the CJI said. Meanwhile someone just check that HC judge’s browser history. High court gave out the correct judgement imo, CJI being a dick like always, first you don't educate people what's wrong and what's not, on top of that the one who uploaded the CP should be tracked down first Someone check this guy's browser history. What. I didn't mean to say that the person watching CP is right, I just pointed out how stupid the system in our country is, no sex education is the reason people can't tell right from wrong. Again, not saying what the guy did is justifiable but the govt is also to be blamed Fair enough"
}