{
    "id": "15346ls",
    "title": "Why is a video of SpaceX Falcon 9 launch being whatsapp shared as Chandrayaan 3?",
    "url": "https://www.reddit.com/r/india/comments/15346ls/why_is_a_video_of_spacex_falcon_9_launch_being/",
    "selftext": "Recently there has been a viral whatsapp share showing a footage of SpaceX Falcon 9 launch mentioning it as Chandrayaan 3 launch as seen from phone. It doesnt even make sense, why fake it if real footage is available? There is a footage of actual chandrayaan 3 from a plane ([Link](https://www.youtube.com/watch?v=fxeFGBv-sFI)), then there is one footage shared here from IIT Madras. It baffles me that those are not shared and instead a fake is being forwarded.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689700103.0,
    "convurl": "https://external-preview.redd.it/EuEK4RTUzhc0vUZIB8qpiVvYCJ0kUdjdV4_W0J6gP9U.jpg?auto=webp&s=f806e58b9a97c043050eda61807bc396d7464d90",
    "comments": [
        "Guess some people are really over the moon for both space launches, they're just trying to cover all their bases! https://motornewz.com/2023/07/18/spacexs-falcon-9-successfully-launches-starlink-mission-sets-stage-for-gen-2-satellites/",
        "Tesla, Tata, similar names"
    ],
    "cleaned_text": "video spacex falcon launch whatsapp shared chandrayaan recently viral whatsapp share showing footage spacex falcon launch mentioning chandrayaan launch seen phone doesnt even make sense fake real footage available footage actual chandrayaan plane linkhttpswwwyoutubecomwatchvfxefgbvsfi one footage shared iit madras baffles shared instead fake forwarded ",
    "cleaned_title": "video spacex falcon launch whatsapp shared chandrayaan",
    "cleaned_selftext": "recently viral whatsapp share showing footage spacex falcon launch mentioning chandrayaan launch seen phone doesnt even make sense fake real footage available footage actual chandrayaan plane linkhttpswwwyoutubecomwatchvfxefgbvsfi one footage shared iit madras baffles shared instead fake forwarded",
    "cleaned_comments": "guess people really moon space launches theyre trying cover bases tesla tata similar names",
    "light_cleaned_title": "Why is a video of SpaceX Falcon 9 launch being whatsapp shared as Chandrayaan 3?",
    "light_cleaned_selftext": "Recently there has been a viral whatsapp share showing a footage of SpaceX Falcon 9 launch mentioning it as Chandrayaan 3 launch as seen from phone. It doesnt even make sense, why fake it if real footage is available? There is a footage of actual chandrayaan 3 from a plane ([Link](https://www.youtube.com/watch?v=fxeFGBv-sFI)), then there is one footage shared here from IIT Madras. It baffles me that those are not shared and instead a fake is being forwarded.",
    "light_cleaned_comments": "Guess some people are really over the moon for both space launches, they're just trying to cover all their bases! Tesla, Tata, similar names"
}