{
    "id": "1hb4p81",
    "title": "Justice Surya Kant: Need 'civilian army' to protect nation's interests | India News - Times of India",
    "url": "https://timesofindia.indiatimes.com/india/need-civilian-army-to-protect-nations-interests-sc-judge-surya-kant/articleshow/116104354.cms",
    "selftext": "\"A nation growing economically, politically, democratically, in rule of law, in good governance, requires not only the military in dress but a lot of military elements in civilian dress also,\"\n-Justice Surya Kant said.",
    "flair": "Law & Courts",
    "score": 8,
    "num_comments": 3,
    "created_utc": 1733845585.0,
    "convurl": "https://external-preview.redd.it/pIBLtsv253PrM_ObSaK7fp0hUaVwthYbHnjXQny-Zs8.jpg?auto=webp&s=fa13fe40f20c1e31bf13cbaa4251d500b5441301",
    "comments": [
        "Like what Hezbollah?",
        "yes that is really true. But one thing is that people in India are not really tough.Tough and ambitious people with righteous civilians are very much needed.",
        "These idiots will certainly destroy the country and turn it into UP everywhere"
    ],
    "cleaned_text": "justice surya kant need civilian army protect nations interests india news times india nation growing economically politically democratically rule law good governance requires military dress lot military elements civilian dress also justice surya kant said ",
    "cleaned_title": "justice surya kant need civilian army protect nations interests india news times india",
    "cleaned_selftext": "nation growing economically politically democratically rule law good governance requires military dress lot military elements civilian dress also justice surya kant said",
    "cleaned_comments": "like hezbollah yes really true one thing people india really toughtough ambitious people righteous civilians much needed idiots certainly destroy country turn everywhere",
    "light_cleaned_title": "Justice Surya Kant: Need 'civilian army' to protect nation's interests | India News - Times of India",
    "light_cleaned_selftext": "\"A nation growing economically, politically, democratically, in rule of law, in good governance, requires not only the military in dress but a lot of military elements in civilian dress also,\" -Justice Surya Kant said.",
    "light_cleaned_comments": "Like what Hezbollah? yes that is really true. But one thing is that people in India are not really tough.Tough and ambitious people with righteous civilians are very much needed. These idiots will certainly destroy the country and turn it into UP everywhere"
}