{
    "id": "159w85z",
    "title": "Most scenic places to visit in India during September?",
    "url": "https://www.reddit.com/r/india/comments/159w85z/most_scenic_places_to_visit_in_india_during/",
    "selftext": "Hello guys, I am from India but have been living in the US for the past 5+ years. During my time in the States, I have developed a hobby of visiting National Parks over here and spending most of my free time hiking and exploring the nature (check out some of the pictures I posted on reddit from my recent Glacier National Park trip [here](https://www.reddit.com/r/NationalPark/comments/14z23xd/glacier_national_park_montana_united_states_july/?utm_source=share&utm_medium=web2x&context=3)).\n\nI realize that while I have travelled and seen most of the natural beauty the US has to offer, I have not explored much of the hidden gems of my own country. Therefore I wanted to visit some scenic places in India this September and do some short (<15 miles) hikes. I need some recommendations from you all in this regard. I have visited Goa and Kerala (Munnar) multiple times, so I'm not looking for those \"obvious\" recommendations, rather places which are less crowded, and where you have to actually hike (or make additional effort to travel) before you are treated with some fabulous views. I had the following places in my mind:\n\n1. [Valley of Flowers National Park](https://en.wikipedia.org/wiki/Valley_of_Flowers_National_Park) in Uttarakhand\n2. [Nubra Valley](https://en.wikipedia.org/wiki/Nubra), Ladakh\n3. [Silent Valley National Park](https://en.wikipedia.org/wiki/Silent_Valley_National_Park), Kerala\n\nIdeally I would have loved to go to Annapurna Base Camp, Nepal as I'm very fascinated by 8000m+ mountains but the total hiking distance for it is around \\~68 miles and I don't think I would have time for that. Are there any other places which you recommend where I can see gigantic (7000-8000m) mountains in India without having to hike more than 10-15 miles (basically 1 or 2 day hikes)? I would love to get the best views of such mountains if possible and observe them from a reasonably close distance.\n\nLet me know in case of any recommendations and thanks ya'll!!",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 3,
    "created_utc": 1690348209.0,
    "convurl": "https://external-preview.redd.it/FYU_FlfMovo1OOzQGvulm6afNo5kWytBFRSJXJ_v4jg.jpg?auto=webp&s=c73cbd8209cb28655a5b41eb33f37f13893ff4f4",
    "comments": [
        "Try the Kedarkantha trek"
    ],
    "cleaned_text": "scenic places visit india september hello guys india living us past years time states developed hobby visiting national parks spending free time hiking exploring nature check pictures posted reddit recent glacier national park trip herehttpswwwredditcomrnationalparkcommentszxdglaciernationalparkmontanaunitedstatesjulyutmsourceshareutmmediumwebxcontext realize travelled seen natural beauty us offer explored much hidden gems country therefore wanted visit scenic places india september short miles hikes need recommendations regard visited goa kerala munnar multiple times im looking obvious recommendations rather places less crowded actually hike make additional effort travel treated fabulous views following places mind valley flowers national parkhttpsenwikipediaorgwikivalleyofflowersnationalpark uttarakhand nubra valleyhttpsenwikipediaorgwikinubra ladakh silent valley national parkhttpsenwikipediaorgwikisilentvalleynationalpark kerala ideally would loved go annapurna base camp nepal im fascinated mountains total hiking distance around miles dont think would time places recommend see gigantic mountains india without hike miles basically day hikes would love get best views mountains possible observe reasonably close distance let know case recommendations thanks yall ",
    "cleaned_title": "scenic places visit india september",
    "cleaned_selftext": "hello guys india living us past years time states developed hobby visiting national parks spending free time hiking exploring nature check pictures posted reddit recent glacier national park trip herehttpswwwredditcomrnationalparkcommentszxdglaciernationalparkmontanaunitedstatesjulyutmsourceshareutmmediumwebxcontext realize travelled seen natural beauty us offer explored much hidden gems country therefore wanted visit scenic places india september short miles hikes need recommendations regard visited goa kerala munnar multiple times im looking obvious recommendations rather places less crowded actually hike make additional effort travel treated fabulous views following places mind valley flowers national parkhttpsenwikipediaorgwikivalleyofflowersnationalpark uttarakhand nubra valleyhttpsenwikipediaorgwikinubra ladakh silent valley national parkhttpsenwikipediaorgwikisilentvalleynationalpark kerala ideally would loved go annapurna base camp nepal im fascinated mountains total hiking distance around miles dont think would time places recommend see gigantic mountains india without hike miles basically day hikes would love get best views mountains possible observe reasonably close distance let know case recommendations thanks yall",
    "cleaned_comments": "try kedarkantha trek",
    "light_cleaned_title": "Most scenic places to visit in India during September?",
    "light_cleaned_selftext": "Hello guys, I am from India but have been living in the US for the past 5+ years. During my time in the States, I have developed a hobby of visiting National Parks over here and spending most of my free time hiking and exploring the nature (check out some of the pictures I posted on reddit from my recent Glacier National Park trip [here](https://www.reddit.com/r/NationalPark/comments/14z23xd/glacier_national_park_montana_united_states_july/?utm_source=share&utm_medium=web2x&context=3)). I realize that while I have travelled and seen most of the natural beauty the US has to offer, I have not explored much of the hidden gems of my own country. Therefore I wanted to visit some scenic places in India this September and do some short (<15 miles) hikes. I need some recommendations from you all in this regard. I have visited Goa and Kerala (Munnar) multiple times, so I'm not looking for those \"obvious\" recommendations, rather places which are less crowded, and where you have to actually hike (or make additional effort to travel) before you are treated with some fabulous views. I had the following places in my mind: 1. [Valley of Flowers National Park](https://en.wikipedia.org/wiki/Valley_of_Flowers_National_Park) in Uttarakhand 2. [Nubra Valley](https://en.wikipedia.org/wiki/Nubra), Ladakh 3. [Silent Valley National Park](https://en.wikipedia.org/wiki/Silent_Valley_National_Park), Kerala Ideally I would have loved to go to Annapurna Base Camp, Nepal as I'm very fascinated by 8000m+ mountains but the total hiking distance for it is around \\~68 miles and I don't think I would have time for that. Are there any other places which you recommend where I can see gigantic (7000-8000m) mountains in India without having to hike more than 10-15 miles (basically 1 or 2 day hikes)? I would love to get the best views of such mountains if possible and observe them from a reasonably close distance. Let me know in case of any recommendations and thanks ya'll!!",
    "light_cleaned_comments": "Try the Kedarkantha trek"
}