{
    "id": "qfvio4",
    "title": "Bi-Weekly Gaming Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/qfvio4/biweekly_gaming_discussion_thread/",
    "selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!)\n\nWhat game are you looking forward to? Are you a developer? Show us your wares!\n\nPlease don't just list the names of games, make sure to write a word or two about them as well.\n\nCheck out r/IndianGaming! They are an active community and also host a few co-op sessions.\n\n**Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/xagdqefyv8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=f975f1c3093a3d9598a1da39854b03d1250bd55d",
    "flair": "Scheduled",
    "score": 32,
    "num_comments": 80,
    "created_utc": 1635211818,
    "convurl": "https://b.thumbs.redditmedia.com/1yW1vnOXXLbj7GjIDC4BNEociU_mAxBuQABJNbaBbBc.jpg",
    "comments": [
        "Taking a break from New World (Amazon's MMORPG) because I've really gotten into Riftbreaker, which is a mix of an isometric action RPG and RTS. Anyone who likes either of the two genres should totally give it a go.\n\nPre purchased Forza Horizon 5, so looking forward to playing that from 5th November!",
        "PS5 kab aayega 😞",
        "Rich guy",
        "Got back to playing dota 2 is little bit more, slowly covering the storyline in FFXIV and Paladins for my casual shooter fix\nWill get back to Stellaris soon (steep learning curve but worth it!)",
        "I've heard that New World was frying people's GPUs. Did it happen to you too?",
        "Nah, that paranoia's been blown out of proportion and propagated by ignorant people who don't even own the game.\n\nThe only cards that got bricked were the high end (3080 and above) EVGA ones because they don't cap themselves well enough. The game basically went for max fps and ended up making the cards draw more power than they could handle.\n\nJayzTwoCents made a video about how GPUs from different brands behave while playing the game or running any benchmark in general. He compared an EVGA card to an MSI one and the EVGA was drawing a lot more power than it was supposed to.\n\nAmazon's asked all high end GPU users to limit New World's fps to 60 if they feel the need to take precautions.\n\nA few other cards crashed while playing the game but weren't damaged. The matter hasn't been investigated well enough to figure out what the issue really is.\n\nI have a Gigabyte 3060 Ti and it runs absolutely fine and I haven't even restricted the fps to 60.",
        "Cautiously excited for the GTA Trilogy Remasters.",
        "Visuals seem not so great, if the controls arent refined we are in for pain.  New age games have sort of spoiled us when it comes to control scheme of older gen.",
        "South Park Stick of Truth is a masterpiece. The jokes and dialogue are as good as it is in the show",
        "Sorry for the noob question but can I do light gaming on a MacBook? I just play ETS2 and ATS, WoTb on my Dell XPS. I really need a Mac for my creative work.",
        "It’s possible on the new ones, nobody will buy intel ones anymore. On the M1 MacBook, CSGO was running over a 100 FPS last year with emulation. So I hope a bunch of games will be playable.",
        "Age of History 2 is pretty good. \n\nI started as a single district of Gwalior, forced my neighbouring states to fight each other and sent army there to rule them. Slowly entire North India was under my rule. Then I attacked Bengal, fucked them hard,then Vijayanagara in South, then I expanded to Phillipenes, Africa and Australia. Conquered almost entire Asia except the Southern part of China.\n\n\nTo do:\nCapture South China, Middle America, and Europe(its literally untouched by me)\n\nThen I will become the leader of this fucking world.",
        "I just hope all these remasters are just mini-projects to keep us engaged till GTA VI",
        "I’ll be getting a M1 or M1pro MBP. I’ll be mostly playing World of Tanks Blitz , American Truck sim and Euro Truck Sim 2",
        "I also hope steam releases optimised versions for the M1 , M1 pro and M1Max as they’re certainly capable of gaming",
        "I’m not sure how steam is taking on it. But I saw Dave2D playing over watch in his video yesterday",
        "Check stores like Croma, vijay sales, reliance digital.",
        "Seren Banka",
        "War Mongrels!! Finally a masterpiece after commandos series.\n\nBack4Blood. if you ever played l4d2 with friends, this is another banger.\nred dead redemption 2, the most beautiful game ever imo. nothing comes close.",
        "Not sure about Quest 1 but quest 2 is easily available here. You can reset and update it first.",
        "All purchases are linked to your account. Similar to Android or iOS Store",
        "Already got it in around jul through prebooking on reliance digital 😃",
        "Recently finished all achievements on Hades. Great game! Good gameplay and combat. Great style, art, music and dialogue. Enjoyed hours of great gaming. Looking to start Frostpunk next. Looks like a fun city builder/survival games.",
        "I think my brother plays DotA2 on his work mac sometimes.",
        "Thinking of buying ps5",
        "You can do light gaming but mine overheats like hell",
        "Yea I think MBP will be slightly better because of the fans",
        "M1 or Intel?",
        "Mine was an Intel. Not sure about the M1",
        "Ah makes sense. M1 is ages ahead of it",
        "Just finished Deathloop. Great game. I’m a big fan of Arkane Studios, and this game continues their tradition of creative immersive sims.",
        "Planning to start Borderlands 3 from geerbox software. I ma play as FL4K with a pet.",
        "Playing Ghost Recon Wildlands with 3 other friends.",
        "You could get AoE2 Defnitive Edition. It is much smaller.",
        "Next: The Fractured but whole",
        "Terraria!",
        "Metro Exodus!",
        "Ironsight. F2p Cod clone on steam. Has a SEA server and better than most fps games out rn. Enough for me",
        "Minecraft, Minecraft Dungeons, Tomb Raider: Anniversary and Portal 2. Cycling through them all rn. Plan to play Hitman 2: Silent Assassin after I finish Portal 2",
        "Currently playing Highfleet. One of the most immersive games I have ever played.",
        "Path of exile!",
        "Ratchet and Clank (2016)",
        "Which city you live in? Mai Mumbai mein hun aur yaha pe rent pe milta hai.\n\nTho stock aane tak aise hi kaam chala leta hu",
        "Pune, kitna rent hai ?",
        "900 for a day, 3500 for a week + 2 free games of your choice.\n\nTry to google \"ps5 on rent near me\". Pune mein tho mil hi jayega",
        "Don't kill anyone",
        "Wow. 3.25 per year !",
        "Hitman Silent Assassin and Contracts are much more linear compared to Blood Money yet I found them better than Blood Money.",
        "Spider-Man 3 on PC\n\nNot as good as Web Of Shadows but its fun. I use a controller and advise anyone else to use it too. Spider-man games have atrocius keyboard controls. You cant win races without struggling.",
        "Hard-core Ranger?",
        "Anyone like Fromsoftware games - Souls, Bloodborne, Sekiro? They're the best and I can't get enough out of them.\n\nAside, anyone tried Darkest Dungeon",
        "Ah I forgot been I long time since I played it",
        "Eyup. Much easier to kill enemies as it becomes tactical at that difficulty but much easier to die too.",
        "Eh I mostly go for the good ending, so I just stealth around them, then I realise my mistake when I reach the final part of the game and not having enough bullets",
        "Games that will run nice on 3000g amd?",
        "Thinking of getting it for my PS5. Worth it ?",
        "Just got a PS5. Have Uncharted 4 and God Of War. Already finished God Of War on PS4 but replaying it again.",
        "Yea. Silent Assassin is an old favourite of mine. I replay it every couple of years. Blood money pretty good too and has better mechanics and game design. Haven't really gotten the chance for the new trilogy but youtube videos and the free demo make it seem to be a really good experience",
        "Horizon Zero Dawn! Loving the world and gameplay. Super excited for HFW",
        "finished Cyberpunk, had a blast with this game.",
        "Oh yeah definitely",
        "It's free for PS5 users under ps plus collection",
        "You should check out darkest dungeon 2 its out now.",
        "It's early access plus I don't have a pc. I'm still just starting out the first game though, seems fun although there's a lot to manage",
        "Oh that ducks, the first game is fun get the dlcs if you can and also check out cultist simulator its a card based game and has a similar vein.",
        "O yea I got a great deal on base game + all dlcs. I've kept crimson court off as I heard that it's not recommended for new players. \n\nI'll check cultist simulator out, I normally don't stray far from Soulslikes or Soulslike metroidvanias but I really loved the aesthetic and atmosphere of Darkest Dungeon",
        "Yoo anyone into Soulslike metroidvanias - stuff like Hollow Knight, Salt and Sanctuary, Ender Lilies",
        "If you like metroid and souls like games may i introduce you to dead cells and hollow knight they are awesome games. \nAlso yea crimson court is much more difficult and thats saying something as the base game can be hair tearing torture if you play in the hardest difficulty.",
        "Oh I've played Hollow Knight, it's one of my absolute favorites. I've also played Ender Lilies (another brilliant souls metroidvania) and Salt and Sanctuary (you can play couch coop with a friend and it's the most seamless experience I've had while cooping these games) \n\nI've had Dead Cells recommended to me before so I guess this is a chance to really check it out",
        "Ohhh i will check out both the games, also nice username.",
        "Haha thanks, surprisingly not many people catch on.\n\nEnder Lilies is a smaller game and a complete single player experience but the music, atmosphere and visuals are top class, the music alone is incredibly beautiful, capable of topping Hollow Knight.\n\nIf you have a friend you can play it with, Salt and Sanctuary is highly recommended. Even single player is a great experience but the coop is so seamless and so much fun",
        "Single player RPGs, any recommendations?👀\nFree wale hi batana ;_;",
        "Bhai PS5 kaha se khareed rhe ho ? Will it be available in the stores any time soon for offline purchase ?",
        "Recently finished **Just Cause 4** on PC (Epic Games freebie). Had previously played Just Cause 2 on PS3 and it was one of the most fun experiences I've had with a game ever. I was understandably excited to play a sequel to it, but while it didn't live up to my expectations, it was still a lot of fun.\n\nStarted **Bad North: Jotunn Edition** (again an Epic Game freebie). Have almost never played these indie roguelites before, so wanted to try something new. So far, I'm really liking it. It has a simple gameplay loop and it's easy to play in short bursts. A flaw I'm seeing with the roguelite genre is a mistake undoes the progress of the entire run, which is a bit disheartening.",
        "Add me on PSN: jimmyjhoncaseroc"
    ],
    "cleaned_text": "biweekly gaming discussion thread playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly gaming discussion thread",
    "cleaned_selftext": "playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "taking break new world amazons mmorpg ive really gotten riftbreaker mix isometric action rpg rts anyone likes either two genres totally give go pre purchased forza horizon looking forward playing th november ps kab aayega rich guy got back playing dota little bit slowly covering storyline ffxiv paladins casual shooter fix get back stellaris soon steep learning curve worth ive heard new world frying peoples gpus happen nah paranoias blown proportion propagated ignorant people dont even game cards got bricked high end evga ones dont cap well enough game basically went max fps ended making cards draw power could handle jayztwocents made video gpus different brands behave playing game running benchmark general compared evga card msi one evga drawing lot power supposed amazons asked high end gpu users limit new worlds fps feel need take precautions cards crashed playing game werent damaged matter hasnt investigated well enough figure issue really gigabyte ti runs absolutely fine havent even restricted fps cautiously excited gta trilogy remasters visuals seem great controls arent refined pain new age games sort spoiled us comes control scheme older gen south park stick truth masterpiece jokes dialogue good show sorry noob question light gaming macbook play ets ats wotb dell xps really need mac creative work possible new ones nobody buy intel ones anymore macbook csgo running fps last year emulation hope bunch games playable age history pretty good started single district gwalior forced neighbouring states fight sent army rule slowly entire north india rule attacked bengal fucked hardthen vijayanagara south expanded phillipenes africa australia conquered almost entire asia except southern part china capture south china middle america europeits literally untouched become leader fucking world hope remasters miniprojects keep us engaged till gta vi ill getting mpro mbp ill mostly playing world tanks blitz american truck sim euro truck sim also hope steam releases optimised versions pro mmax theyre certainly capable gaming im sure steam taking saw daved playing watch video yesterday check stores like croma vijay sales reliance digital seren banka war mongrels finally masterpiece commandos series backblood ever played ld friends another banger red dead redemption beautiful game ever imo nothing comes close sure quest quest easily available reset update first purchases linked account similar android ios store already got around jul prebooking reliance digital recently finished achievements hades great game good gameplay combat great style art music dialogue enjoyed hours great gaming looking start frostpunk next looks like fun city buildersurvival games think brother plays dota work mac sometimes thinking buying ps light gaming mine overheats like hell yea think mbp slightly better fans intel mine intel sure ah makes sense ages ahead finished deathloop great game im big fan arkane studios game continues tradition creative immersive sims planning start borderlands geerbox software play flk pet playing ghost recon wildlands friends could get aoe defnitive edition much smaller next fractured whole terraria metro exodus ironsight fp cod clone steam sea server better fps games rn enough minecraft minecraft dungeons tomb raider anniversary portal cycling rn plan play hitman silent assassin finish portal currently playing highfleet one immersive games ever played path exile ratchet clank city live mai mumbai mein hun aur yaha pe rent pe milta hai tho stock aane tak aise hi kaam chala leta hu pune kitna rent hai day week free games choice try google ps rent near pune mein tho mil hi jayega dont kill anyone wow per year hitman silent assassin contracts much linear compared blood money yet found better blood money spiderman pc good web shadows fun use controller advise anyone else use spiderman games atrocius keyboard controls cant win races without struggling hardcore ranger anyone like fromsoftware games souls bloodborne sekiro theyre best cant get enough aside anyone tried darkest dungeon ah forgot long time since played eyup much easier kill enemies becomes tactical difficulty much easier die eh mostly go good ending stealth around realise mistake reach final part game enough bullets games run nice g amd thinking getting ps worth got ps uncharted god war already finished god war ps replaying yea silent assassin old favourite mine replay every couple years blood money pretty good better mechanics game design havent really gotten chance new trilogy youtube videos free demo make seem really good experience horizon zero dawn loving world gameplay super excited hfw finished cyberpunk blast game oh yeah definitely free ps users ps plus collection check darkest dungeon early access plus dont pc im still starting first game though seems fun although theres lot manage oh ducks first game fun get dlcs also check cultist simulator card based game similar vein yea got great deal base game dlcs ive kept crimson court heard recommended new players ill check cultist simulator normally dont stray far soulslikes soulslike metroidvanias really loved aesthetic atmosphere darkest dungeon yoo anyone soulslike metroidvanias stuff like hollow knight salt sanctuary ender lilies like metroid souls like games may introduce dead cells hollow knight awesome games also yea crimson court much difficult thats saying something base game hair tearing torture play hardest difficulty oh ive played hollow knight one absolute favorites ive also played ender lilies another brilliant souls metroidvania salt sanctuary play couch coop friend seamless experience ive cooping games ive dead cells recommended guess chance really check ohhh check games also nice username haha thanks surprisingly many people catch ender lilies smaller game complete single player experience music atmosphere visuals top class music alone incredibly beautiful capable topping hollow knight friend play salt sanctuary highly recommended even single player great experience coop seamless much fun single player rpgs recommendations free wale hi batana bhai ps kaha se khareed rhe ho available stores time soon offline purchase recently finished cause pc epic games freebie previously played cause ps one fun experiences ive game ever understandably excited play sequel didnt live expectations still lot fun started bad north jotunn edition epic game freebie almost never played indie roguelites wanted try something new far im really liking simple gameplay loop easy play short bursts flaw im seeing roguelite genre mistake undoes progress entire run bit disheartening add psn jimmyjhoncaseroc",
    "light_cleaned_title": "Bi-Weekly Gaming Discussion Thread",
    "light_cleaned_selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!) What game are you looking forward to? Are you a developer? Show us your wares! Please don't just list the names of games, make sure to write a word or two about them as well. Check out r/IndianGaming! They are an active community and also host a few co-op sessions. **Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Taking a break from New World (Amazon's MMORPG) because I've really gotten into Riftbreaker, which is a mix of an isometric action RPG and RTS. Anyone who likes either of the two genres should totally give it a go. Pre purchased Forza Horizon 5, so looking forward to playing that from 5th November! PS5 kab aayega 😞 Rich guy Got back to playing dota 2 is little bit more, slowly covering the storyline in FFXIV and Paladins for my casual shooter fix Will get back to Stellaris soon (steep learning curve but worth it!) I've heard that New World was frying people's GPUs. Did it happen to you too? Nah, that paranoia's been blown out of proportion and propagated by ignorant people who don't even own the game. The only cards that got bricked were the high end (3080 and above) EVGA ones because they don't cap themselves well enough. The game basically went for max fps and ended up making the cards draw more power than they could handle. JayzTwoCents made a video about how GPUs from different brands behave while playing the game or running any benchmark in general. He compared an EVGA card to an MSI one and the EVGA was drawing a lot more power than it was supposed to. Amazon's asked all high end GPU users to limit New World's fps to 60 if they feel the need to take precautions. A few other cards crashed while playing the game but weren't damaged. The matter hasn't been investigated well enough to figure out what the issue really is. I have a Gigabyte 3060 Ti and it runs absolutely fine and I haven't even restricted the fps to 60. Cautiously excited for the GTA Trilogy Remasters. Visuals seem not so great, if the controls arent refined we are in for pain. New age games have sort of spoiled us when it comes to control scheme of older gen. South Park Stick of Truth is a masterpiece. The jokes and dialogue are as good as it is in the show Sorry for the noob question but can I do light gaming on a MacBook? I just play ETS2 and ATS, WoTb on my Dell XPS. I really need a Mac for my creative work. It’s possible on the new ones, nobody will buy intel ones anymore. On the M1 MacBook, CSGO was running over a 100 FPS last year with emulation. So I hope a bunch of games will be playable. Age of History 2 is pretty good. I started as a single district of Gwalior, forced my neighbouring states to fight each other and sent army there to rule them. Slowly entire North India was under my rule. Then I attacked Bengal, fucked them hard,then Vijayanagara in South, then I expanded to Phillipenes, Africa and Australia. Conquered almost entire Asia except the Southern part of China. To do: Capture South China, Middle America, and Europe(its literally untouched by me) Then I will become the leader of this fucking world. I just hope all these remasters are just mini-projects to keep us engaged till GTA VI I’ll be getting a M1 or M1pro MBP. I’ll be mostly playing World of Tanks Blitz , American Truck sim and Euro Truck Sim 2 I also hope steam releases optimised versions for the M1 , M1 pro and M1Max as they’re certainly capable of gaming I’m not sure how steam is taking on it. But I saw Dave2D playing over watch in his video yesterday Check stores like Croma, vijay sales, reliance digital. Seren Banka War Mongrels!! Finally a masterpiece after commandos series. Back4Blood. if you ever played l4d2 with friends, this is another banger. red dead redemption 2, the most beautiful game ever imo. nothing comes close. Not sure about Quest 1 but quest 2 is easily available here. You can reset and update it first. All purchases are linked to your account. Similar to Android or iOS Store Already got it in around jul through prebooking on reliance digital 😃 Recently finished all achievements on Hades. Great game! Good gameplay and combat. Great style, art, music and dialogue. Enjoyed hours of great gaming. Looking to start Frostpunk next. Looks like a fun city builder/survival games. I think my brother plays DotA2 on his work mac sometimes. Thinking of buying ps5 You can do light gaming but mine overheats like hell Yea I think MBP will be slightly better because of the fans M1 or Intel? Mine was an Intel. Not sure about the M1 Ah makes sense. M1 is ages ahead of it Just finished Deathloop. Great game. I’m a big fan of Arkane Studios, and this game continues their tradition of creative immersive sims. Planning to start Borderlands 3 from geerbox software. I ma play as FL4K with a pet. Playing Ghost Recon Wildlands with 3 other friends. You could get AoE2 Defnitive Edition. It is much smaller. Next: The Fractured but whole Terraria! Metro Exodus! Ironsight. F2p Cod clone on steam. Has a SEA server and better than most fps games out rn. Enough for me Minecraft, Minecraft Dungeons, Tomb Raider: Anniversary and Portal 2. Cycling through them all rn. Plan to play Hitman 2: Silent Assassin after I finish Portal 2 Currently playing Highfleet. One of the most immersive games I have ever played. Path of exile! Ratchet and Clank (2016) Which city you live in? Mai Mumbai mein hun aur yaha pe rent pe milta hai. Tho stock aane tak aise hi kaam chala leta hu Pune, kitna rent hai ? 900 for a day, 3500 for a week + 2 free games of your choice. Try to google \"ps5 on rent near me\". Pune mein tho mil hi jayega Don't kill anyone Wow. 3.25 per year ! Hitman Silent Assassin and Contracts are much more linear compared to Blood Money yet I found them better than Blood Money. Spider-Man 3 on PC Not as good as Web Of Shadows but its fun. I use a controller and advise anyone else to use it too. Spider-man games have atrocius keyboard controls. You cant win races without struggling. Hard-core Ranger? Anyone like Fromsoftware games - Souls, Bloodborne, Sekiro? They're the best and I can't get enough out of them. Aside, anyone tried Darkest Dungeon Ah I forgot been I long time since I played it Eyup. Much easier to kill enemies as it becomes tactical at that difficulty but much easier to die too. Eh I mostly go for the good ending, so I just stealth around them, then I realise my mistake when I reach the final part of the game and not having enough bullets Games that will run nice on 3000g amd? Thinking of getting it for my PS5. Worth it ? Just got a PS5. Have Uncharted 4 and God Of War. Already finished God Of War on PS4 but replaying it again. Yea. Silent Assassin is an old favourite of mine. I replay it every couple of years. Blood money pretty good too and has better mechanics and game design. Haven't really gotten the chance for the new trilogy but youtube videos and the free demo make it seem to be a really good experience Horizon Zero Dawn! Loving the world and gameplay. Super excited for HFW finished Cyberpunk, had a blast with this game. Oh yeah definitely It's free for PS5 users under ps plus collection You should check out darkest dungeon 2 its out now. It's early access plus I don't have a pc. I'm still just starting out the first game though, seems fun although there's a lot to manage Oh that ducks, the first game is fun get the dlcs if you can and also check out cultist simulator its a card based game and has a similar vein. O yea I got a great deal on base game + all dlcs. I've kept crimson court off as I heard that it's not recommended for new players. I'll check cultist simulator out, I normally don't stray far from Soulslikes or Soulslike metroidvanias but I really loved the aesthetic and atmosphere of Darkest Dungeon Yoo anyone into Soulslike metroidvanias - stuff like Hollow Knight, Salt and Sanctuary, Ender Lilies If you like metroid and souls like games may i introduce you to dead cells and hollow knight they are awesome games. Also yea crimson court is much more difficult and thats saying something as the base game can be hair tearing torture if you play in the hardest difficulty. Oh I've played Hollow Knight, it's one of my absolute favorites. I've also played Ender Lilies (another brilliant souls metroidvania) and Salt and Sanctuary (you can play couch coop with a friend and it's the most seamless experience I've had while cooping these games) I've had Dead Cells recommended to me before so I guess this is a chance to really check it out Ohhh i will check out both the games, also nice username. Haha thanks, surprisingly not many people catch on. Ender Lilies is a smaller game and a complete single player experience but the music, atmosphere and visuals are top class, the music alone is incredibly beautiful, capable of topping Hollow Knight. If you have a friend you can play it with, Salt and Sanctuary is highly recommended. Even single player is a great experience but the coop is so seamless and so much fun Single player RPGs, any recommendations?👀 Free wale hi batana ;_; Bhai PS5 kaha se khareed rhe ho ? Will it be available in the stores any time soon for offline purchase ? Recently finished **Just Cause 4** on PC (Epic Games freebie). Had previously played Just Cause 2 on PS3 and it was one of the most fun experiences I've had with a game ever. I was understandably excited to play a sequel to it, but while it didn't live up to my expectations, it was still a lot of fun. Started **Bad North: Jotunn Edition** (again an Epic Game freebie). Have almost never played these indie roguelites before, so wanted to try something new. So far, I'm really liking it. It has a simple gameplay loop and it's easy to play in short bursts. A flaw I'm seeing with the roguelite genre is a mistake undoes the progress of the entire run, which is a bit disheartening. Add me on PSN: jimmyjhoncaseroc"
}