{
    "id": "16ctwu9",
    "title": "Narendra Modi’s New New Delhi",
    "url": "https://www.newyorker.com/news/dispatch/narendra-modis-new-new-delhi",
    "selftext": "A well written article or a hit (depending your level of Bhakti) on Modi mindset\n\nWhile Ahmedabad changed, did Amdavadi’s benefit? While Modi will color India orange, will Indians benefit?\n\nCovering up poor areas with green or white sheets  for G20 shows how good Modi at his safai abhiyaan. If the capital can not be kept clean 365 days a year, what is the point of showing it off to the world for 2 days?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1694128665.0,
    "convurl": "https://external-preview.redd.it/OELW0rNcSK4P2VJHgDcJuwThm38djqOMAymhfSSmN1U.jpg?auto=webp&s=97c6cd5cee1eca1add56468cef4834db0b9afaf5",
    "comments": [
        "In a rush to put his name all over, Modi is benefiting his own and splitting his own position. Using taxpayer money to put his photos all over the city will only lead to resentment eventually.\n\nIt is just sad that the country’s leader is so insecure that he has to get his photo pasted every 10 meters on the Roads leading to pragati maidaan and the hotels and embassy areas.",
        "He isn't insecure, he is just a failed actor, narcissist megalomaniac who loves fame and his name/face on things. Quite desperate to hold on to this power, will do anything to win the next election. The guy is literally willing to change the name/brand of the country as a retort to the opposition calling themselves INDIA. Fudge the data, hide failures, appeal to base instincts like hate, feed people so much propaganda that they would forget the high prices of groceries but happily take that as a sacrifice for making this country into a monster's den. Frankly it is a waste to invest money in economic development of this country, people don't seem to want it, they want to go back to stone ages.",
        "Did anyone read the whole thing. It sounds like HCP and Bimal Patel knew what Modi wanted and got the contract. I wonder if there was any money exchanged.",
        "The only people keeping him in power and thus sliding our nation backwards are the fanatical cult of bhakts.",
        "> Covering up poor areas with green or white sheets for G20 shows how good Modi\n\nremoving data which shows them in bad light is modis operandi",
        "U forgot the guju business lobby like adani and Ambani, those rallies don't pay for themselves"
    ],
    "cleaned_text": "narendra modis new new delhi well written article hit depending level bhakti modi mindset ahmedabad changed amdavadis benefit modi color india orange indians benefit covering poor areas green white sheets g shows good modi safai abhiyaan capital kept clean days year point showing world days ",
    "cleaned_title": "narendra modis new new delhi",
    "cleaned_selftext": "well written article hit depending level bhakti modi mindset ahmedabad changed amdavadis benefit modi color india orange indians benefit covering poor areas green white sheets g shows good modi safai abhiyaan capital kept clean days year point showing world days",
    "cleaned_comments": "rush put name modi benefiting splitting position using taxpayer money put photos city lead resentment eventually sad countrys leader insecure get photo pasted every meters roads leading pragati maidaan hotels embassy areas isnt insecure failed actor narcissist megalomaniac loves fame nameface things quite desperate hold power anything win next election guy literally willing change namebrand country retort opposition calling india fudge data hide failures appeal base instincts like hate feed people much propaganda would forget high prices groceries happily take sacrifice making country monsters den frankly waste invest money economic development country people dont seem want want go back stone ages anyone read whole thing sounds like hcp bimal patel knew modi wanted got contract wonder money exchanged people keeping power thus sliding nation backwards fanatical cult bhakts covering poor areas green white sheets g shows good modi removing data shows bad light modis operandi u forgot guju business lobby like adani ambani rallies dont pay",
    "light_cleaned_title": "Narendra Modi’s New New Delhi",
    "light_cleaned_selftext": "A well written article or a hit (depending your level of Bhakti) on Modi mindset While Ahmedabad changed, did Amdavadi’s benefit? While Modi will color India orange, will Indians benefit? Covering up poor areas with green or white sheets for G20 shows how good Modi at his safai abhiyaan. If the capital can not be kept clean 365 days a year, what is the point of showing it off to the world for 2 days?",
    "light_cleaned_comments": "In a rush to put his name all over, Modi is benefiting his own and splitting his own position. Using taxpayer money to put his photos all over the city will only lead to resentment eventually. It is just sad that the country’s leader is so insecure that he has to get his photo pasted every 10 meters on the Roads leading to pragati maidaan and the hotels and embassy areas. He isn't insecure, he is just a failed actor, narcissist megalomaniac who loves fame and his name/face on things. Quite desperate to hold on to this power, will do anything to win the next election. The guy is literally willing to change the name/brand of the country as a retort to the opposition calling themselves INDIA. Fudge the data, hide failures, appeal to base instincts like hate, feed people so much propaganda that they would forget the high prices of groceries but happily take that as a sacrifice for making this country into a monster's den. Frankly it is a waste to invest money in economic development of this country, people don't seem to want it, they want to go back to stone ages. Did anyone read the whole thing. It sounds like HCP and Bimal Patel knew what Modi wanted and got the contract. I wonder if there was any money exchanged. The only people keeping him in power and thus sliding our nation backwards are the fanatical cult of bhakts. > Covering up poor areas with green or white sheets for G20 shows how good Modi removing data which shows them in bad light is modis operandi U forgot the guju business lobby like adani and Ambani, those rallies don't pay for themselves"
}