{
    "id": "15le58w",
    "title": "Greetings from France, we found a coin in a old house attic.",
    "url": "https://www.reddit.com/gallery/15le58w",
    "selftext": "we found some coins during an attic isolation , and this one is a 1946 quarter rupee with George 6 stamp. What can be said about this coin? (history, tiger (bengal?), metal, rarity,…) thanks",
    "flair": "AskIndia",
    "score": 71,
    "num_comments": 8,
    "created_utc": 1691490178.0,
    "convurl": "https://i.redd.it/3mzeci6p4vgb1.jpg",
    "comments": [
        "https://en.numista.com/catalogue/pieces6555.html",
        "Wow thank you",
        "How did a British Indian coin come to be in your house? &nbsp; Was someone in your family there?",
        "r/IndianCoins",
        "Nope, it’s in my brother’s newly acquired house, it was built in the 50’s and the attic was never cleaned nor modernly isolated (old glass fiber, we don’t use that bare anymore). We did it and found old Francs (before Euro, french coin), a danish Krone, Brazilian centavos and this one. The first owners must have loved traveling, they left or died at hospital without their children checking the house attic.",
        "Hey !! I know this is super unreasonable and out of the blue but please do let me know if you don't want them, I would be super grateful :)",
        "Hey mate, I have them stored, I keep them with other special coin. Its more a souvenir.",
        "Thank you for replying!! Ah well I did try , hope you have a lovely day.",
        "Thanks, you too!"
    ],
    "cleaned_text": "greetings france found coin old house attic found coins attic isolation one quarter rupee george stamp said coin history tiger bengal metal rarity thanks ",
    "cleaned_title": "greetings france found coin old house attic",
    "cleaned_selftext": "found coins attic isolation one quarter rupee george stamp said coin history tiger bengal metal rarity thanks",
    "cleaned_comments": "wow thank british indian coin come house nbsp someone family rindiancoins nope brothers newly acquired house built attic never cleaned modernly isolated old glass fiber dont use bare anymore found old francs euro french coin danish krone brazilian centavos one first owners must loved traveling left died hospital without children checking house attic hey know super unreasonable blue please let know dont want would super grateful hey mate stored keep special coin souvenir thank replying ah well try hope lovely day thanks",
    "light_cleaned_title": "Greetings from France, we found a coin in a old house attic.",
    "light_cleaned_selftext": "we found some coins during an attic isolation , and this one is a 1946 quarter rupee with George 6 stamp. What can be said about this coin? (history, tiger (bengal?), metal, rarity,…) thanks",
    "light_cleaned_comments": "Wow thank you How did a British Indian coin come to be in your house? &nbsp; Was someone in your family there? r/IndianCoins Nope, it’s in my brother’s newly acquired house, it was built in the 50’s and the attic was never cleaned nor modernly isolated (old glass fiber, we don’t use that bare anymore). We did it and found old Francs (before Euro, french coin), a danish Krone, Brazilian centavos and this one. The first owners must have loved traveling, they left or died at hospital without their children checking the house attic. Hey !! I know this is super unreasonable and out of the blue but please do let me know if you don't want them, I would be super grateful :) Hey mate, I have them stored, I keep them with other special coin. Its more a souvenir. Thank you for replying!! Ah well I did try , hope you have a lovely day. Thanks, you too!"
}