{
    "id": "12f9dlf",
    "title": "Why doesn't youth want to talk about politics?",
    "url": "https://www.reddit.com/r/india/comments/12f9dlf/why_doesnt_youth_want_to_talk_about_politics/",
    "selftext": "So, I was going through the subreddit and realised much of the youth doesn't want to talk about politics at all. I was reading through Manish Sisodia's arrest, Satyendar Jain's arrest and Rahul Gandhi's arrest posts and most people are apathetic towards it. They simply don't care, and if you're that way, you're already a product, commodity for companies like Cambridge Analytica and it's scary, because as claimed by Alexander nix, this is the first step towards their success, to make people apathetic, in any propaganda. \n\nI was watching the great hack  on Netflix and I'm pretty sure many of you have heard about Cambridge Analytica. A company who takes data from Meta (Facebook) and parses and predicts the voter's psychology, then targets them with propaganda ads.  The amount of similarities in Indian election campaigns made me wonder if they had a role in Indian elections, turns out, we were just puppets for them to experiment upon, so that they can strengthen themselves and change the presidency in USA, they were responsible for Trump's victory, a disgusting and disgraceful monster. Then we got to see Brexit, this ducking company literally single handedly divided the nation that divided the whole Earth, they played an Uno reverse on The Great Britain. It's just so ironic, England is no longer a part of EU, including Wales, Northern Ireland and Scotland but Scotland wants to be a part of EU, the amount of turmoil and instability they caused is amazing. \n\nSorry for going on a tangent but I just wanted to say how much power it has, how much power your data has that it can divide a country in 2020. Think what else it could do. We need to talk about the on going things, its hard to say what's right or what is wrong but some things just literally don't make sense, why wasn't Modi arrested himself for 2002? And Rahul is being arrested now, I'm not the one to stand with Congress, I hate congress but look at China and you'll realise what happens when you have no resistance. \n\nBut India doesn't stop there, it takes the worst traits of USA, a hyper capitalist state and China's authoritativeness and combines it to make a poor and corrupt country, wait till you see the effects of Modi's rule in 2025 onwards. For those who don't know, it takes around 10 years for the effects of policies laid to start showing effects. India might be fastest growing GDP even rn but its GDP per capita is so poor that its hard to look at, even GDP per capita isn't a true representation, the corporates can't even balance it out. \n\nCompanies and some parties don't want you to talk about politics, become apathetic, so that you can be shifted to voting for them, and it works, and people don't even realise their minds have been altered. I'm currently doing computer science and the amount of data these companies have on you is mind blowing, not that i know a lot but i just downloaded my data and I'm speechless. I think the woke culture was actually representative of something else than what the right wing has made it to appear like. \n\nPeople who don't have their own opinion is what these companies and these politicians want, because the more apathetic people, the more potential voters, just a little bit of wind of ads to target and boom. These companies know more about you than you do, not saying it as a part of woke culture or anything but in terms of your conscience, you need to wake up and learn to resist, bc if you just want to succumb to these shitheads, nothing can save you. Youth will suffer, for jobs for housing and for surviving. \n\nI'm a gen z too btw, I know it is depressing to look at but at least know where you're being manipulated, I'm not asking you to be left or right winged but you've every right to know what they are doing with your data. Cambridge Analytica had 5000 data points on ever American voter, they knew 5000 psychology points of you, that even you cannot tell about yourself. It is impossible to stay unbiased these days but trying to be aware that they want you to fall into this, they want you to not talk, they want to manipulate you is a must, nothing can help you, other than yourself. \n\nAfter 2018, there has been no mention of Cambridge Analytica in India, do you think it still affects elections? Christopher Wylie did openly commit to affecting elections previously. What do you guys think about this? Is it worth raising a voice, or is it too late already? \n\n[Cambridge Analytica partnered with parties in India](https://www.washingtonpost.com/world/asia_pacific/whistleblower-claims-cambridge-analyticas-partners-in-india-worked-on-elections-raising-privacy-fears/2018/03/28/1168c04c-328a-11e8-b6bd-0084a1666987_story.html)",
    "flair": "Politics",
    "score": 81,
    "num_comments": 79,
    "created_utc": 1680923089.0,
    "convurl": "https://external-preview.redd.it/VralmFO6rszoXHAh0IXfxAsQo0_f50oRNl1jY8qREtw.jpg?auto=webp&v=enabled&s=d676751411edf512702768e1d4f16ee6ed8c571c",
    "comments": [
        "No replies, how unsurprising.\n\nI've felt this so many times before, but India really really hates change, for better or for worse.\n\nI mean all people across the world dislike change but India is extraordinarily resistant to changes, doesn't matter whether they are for better or for worse. But people really don't want to fight against anything that doesn't directly slap them in the face.\n\nThere was a quote I read that fits perfectly, \"India didn't grow because of it's policies, India grew despite them.\"\n\n&#x200B;\n\nIndia has a wonderful opportunity to improve on right now but we are wasting everything in name of relics and burdens from the past. But this is not truly surprising, India, in general, has always been a crybaby that would rather bemoan on what could have been rather than what could be. \n\nAs people grow economically and get better education, the more they learn what is right and what is wrong, more they focus on development. The parents today in India were the first generation (as majority) to actually go to school, we are the first ones to go to colleges, our next generation will be the ones who would actually be the mature adults, though the growth is much faster now than it used to be and the lines blur more. \n\nThe older generation is messing up our country.\n\nThe newer generation is somewhat better in that it actually acknowledges the issues but doesn't actually want to fight them.\n\nHopefully our future generations will be better.",
        "A lot of people feel strongly against the stuff happening in the country. \n\nBut then, we fear the consequences of remotely being identified as an “anti-national”. That’s why the only political voices heard today are those that align with the rulers. \n\nIf the most visible leader of the opposition can be disqualified through the collusion of judiciary and executive, imagine what they can do to you.\n\nRead about Haren Pandya. You’ll be scared to go out on morning walks.",
        "Because most people say apolitical when they mean I am fine with things the way they are",
        "\"I don't like (or follow) politics\" is the biggest cop out line for many young ones. It was the same for the young ones of every generation. Politics is treated as this dirty thing you don't get involved in and things will correct itself magically",
        "A certain party in this country has already being buying data and manipulating social media like WhatsApp and Twitter on a staggering scale for over a decade. Their IT cells beat the pants off anything the US could hope to do with Cambridge Analytica.",
        "I want to talk/debate in politics a lot and i don't. Here are the reasons:\n1. Freedom of speech isn't protected in most cases.\n2. The judiciary is weaponised to serve our overlords.\n3. The police are also weaponised to serve our overlords.\n4. Most Indians lack critical thinking. This makes debates very hard. Most Indians are also incapable of holding back emotions while debating.\n5. You can change the opinion of 40 scholars with one fact. But you can't change the opinion of one idiot with 40 facts.\n\nThe only way we get changes is if everyone gets pissed and riots across the country. But that's not gonna happen because all the election winning companies (also called political parties) know how to keep at least one person/group of people happy. So a movement everywhere all at once is nearly impossible in India. I adore how the French protest against a system.",
        "When people don't discuss politics, it generally means they are happy with the state of affairs. They start becoming interested in politics when there is heavy dissatisfaction with what is happening and they feel a need for change.\n\nThe 2010-2013 period saw an increase in youth engagement with politics in India due to the situation at the time (And the interesting thing about being engaged with politics is that when you do become engaged, it is too addictive and is difficult to leave). Since 2014, however, the young generation has disengaged from politics again.\n\nthis is actually a norm for India. We saw a similar level of disinterest for politics among the youth from 1997-2010. Now, of course, this has some regional variations etc. and is not valid throughout the country.",
        "I think the best that any of us can do right now is to make sure we use our individual votes judiciously.",
        "Well Rahul's case is actually sad but the other two you mentioned are literally corrupt why do u want to save the corrupts",
        "What a load of crap.",
        "That or they have given up on hoping for better.",
        "Well I can't keep my views out there cause there is no freedom of speech, countless times I have been mocked, shamed for having certain views or opinions. People want to impose their views but aren't accepting at all to respect against theirs. I have lost friends over political views. As far as questioning the government is the concern we already see what is the result with those who do.",
        "(focusing on youth below 23)\n\n I have different take. When I talk to youth they are interested in specific discussions - such as lack of higher study options, unemployment, freedom (women), reservation etc.\n\nThey are definitely less interested in topic that is remote to them - for example health care for all",
        "cause they are too busy dealing with their mundane shize and inner demons.",
        "A wise man one said , “Debating about politics and religion is like banging your head against the wall” - you can never change the opposite persons opinion.",
        "In order to \"give up hoping for better\" you have to originally be engaged with politics in the first place.",
        "I'm in 12th grade and I see this among my classmates, hardly anyone has some political knowledge and almost no one answers political questions when asked in class, whenever I talk politics or make a political joke it goes over their heads and they think I'm crazy. There are elections next year and most of us are turning 18 I have honestly no hopes",
        "You don't have to be engaged in politics to hope for better, just as you don't have to be employed to hope for more money.",
        "If you are not employed and are hoping for money though, you will try go get employment. Similarly, if you want change, you will try to find likeminded people who also want change, discuss things with them. This is how most people start engaging in politics.",
        "The constitution provides us Freedom of speech but we're labelled as \"anti-nation\" if we say something against some political parties or politics.",
        "I have toned down a lot since I realised that ISP providers keep data for atleast 2 years. Plus I have stopped caring, I need to focus how to keep myself afloat rather than wasting my time.\n\nIt would be great if we could truly be a country without hate, a country that focus only on the welfare and development but we all know it's stupid to dream like that. Be it bjp or Congress, all these politicians come to power only for way to increase their own wealth.",
        "I dislike discussion on politics because:\n\n1. It doesn't make sense. Politicians don't say what they mean and don't mean what they say.\n2. It is almost impossible to oversee legislative. Of the 3 pillars of democracy it is the most powerful making the system unbalanced.\n3. People of India consider Ministers not as public servants but as feudal overlords.\n4. There is no correct side. It is a competition of evil and less evil.\n5. It is so easy to generate false information, why should I trust any information which I cannot actively verify?\n6. If you start discussion about politics it all about \"emotion\" it seems and not facts. Most of the opinion will be shallow and people don't realize many hypocritic opinions they have(I am guilty of same). It irritates me without any benifit or growth of knowledge. So no thanks!",
        "So retired individuals, students more concerned with their studies, children of no age to work or physically/mentally disabled or housewives/husbands, all of these people have no right to hope for a higher income?",
        "Exactly dude, I agree with all the reasons you've mentioned, also if you call out the flaws in their thinking or give reason as to why their beliefs are wrong, it only makes them defensive and they'll defend their ideology with more might and will stop listening to reason all together",
        "Also freedom of speech laws aren't great in this country and nobody wants to waste their time trying to convince these sheeps lol",
        "How will they hope for a higher income without a job or a business? Is there a money tree? Or are they hoping the breadwinner of the house earns more?",
        "So what? you want babies to go out and earn then?\n\nDid you not wish your father/mother/family made a little more money so you could afford a toy or something, when you were a kid?",
        "Nailed it bro. We have all become sheeps that are happy minding their own business. It will take a miracle to remove current dispensation from power and even if that happens, they will not go away. That is when real gas chambers will come out to eleminate any resistance.",
        "This is what is exactly wrong. These mofos who have no idea would come out and spew nonsesne about someone who gave it their all to make delhi a better state. Not one rupee of corrupt money has been recovered from both ywt they langush in jail because of fucked up lower courts prolonging even simple bail hearings.\n\nBut worry not. Your time will come too and there will be no one remaining to speak for you.",
        "Lol aap is corrupt as hell . Spending thousand of crores in advertising and now their two prominent leaders are in jail for corruption charges . Aap is a party to laugh at.",
        "As i said mofos who have no clue keep spewing the nonsense propagabda fed to them.",
        "They are corrupt . Modi has not told me so they are in jail because they are corrupt i hope soon bjp or congress form govt in delhi",
        "If you talk against bjp then our whatsapp unkills start hating you . All have good experience.\n\nEventually we have reached at a point that most people think its not good to question pm",
        "keep dreaming... they will be realeased as soon as their cases are out of crooked lower judiciary...\n\nit feels great to see Congress at ZERO in Delhi. Will be ZERO in Punjab in 2027 as well.\n\ncongis and bjp mofos can keep sulking for all i care.",
        "I hope they get released if they aren't guilty .",
        "Because I don't want to die for trying to do something decent in this country. Make too big of a splash or piss off the wrong people, and you will just die and never get justice. \n\nAlso, talking about it with friends and family? That happens sometimes. But talking about it with managers/colleagues will make you realise how both stupid and cruel they are. I think finding out the ugliness inside my peers makes me act less nice to them, which will not benefit me. \n\nI guess this makes me selfish and apathetic. I don't want to care anymore. I did care before but now I'm emotionally burnt out. I'll just live out this life, make sure I don't add any kids, and then die at 75 or 80.",
        "No. I was glad with what my parents did for me in my childhood because I saw them work very hard everyday. Materialistic things were not as important to me back then.",
        "Forgive me mr. saint, it was my fault assuming that an average 6-7 year old kid would prefer getting a toy, a little more than, attaining moksha.",
        "All of us know that no matter how open we are about politics the old uncles at top will have the power and ability to do whatever they please\n\nEdIt: grammar",
        "Yes a kid will prefer a toy but that is very different from wishing their parents earned more money. That is so disrespectful towards the parents.",
        "There is a difference between wishing their parents earned more money and condemning their parents for not earning enough money. Anyone and everyone should hope for better times, it doesn't mean they are being disrespectful 🤦‍♂️"
    ],
    "cleaned_text": "doesnt youth want talk politics going subreddit realised much youth doesnt want talk politics reading manish sisodias arrest satyendar jains arrest rahul gandhis arrest posts people apathetic towards simply dont care youre way youre already product commodity companies like cambridge analytica scary claimed alexander nix first step towards success make people apathetic propaganda watching great hack netflix im pretty sure many heard cambridge analytica company takes data meta facebook parses predicts voters psychology targets propaganda ads amount similarities indian election campaigns made wonder role indian elections turns puppets experiment upon strengthen change presidency usa responsible trumps victory disgusting disgraceful monster got see brexit ducking company literally single handedly divided nation divided whole earth played uno reverse great britain ironic england longer part eu including wales northern ireland scotland scotland wants part eu amount turmoil instability caused amazing sorry going tangent wanted say much power much power data divide country think else could need talk going things hard say whats right wrong things literally dont make sense wasnt modi arrested rahul arrested im one stand congress hate congress look china youll realise happens resistance india doesnt stop takes worst traits usa hyper capitalist state chinas authoritativeness combines make poor corrupt country wait till see effects modis rule onwards dont know takes around years effects policies laid start showing effects india might fastest growing gdp even rn gdp per capita poor hard look even gdp per capita isnt true representation corporates cant even balance companies parties dont want talk politics become apathetic shifted voting works people dont even realise minds altered im currently computer science amount data companies mind blowing know lot downloaded data im speechless think woke culture actually representative something else right wing made appear like people dont opinion companies politicians want apathetic people potential voters little bit wind ads target boom companies know saying part woke culture anything terms conscience need wake learn resist bc want succumb shitheads nothing save youth suffer jobs housing surviving im gen z btw know depressing look least know youre manipulated im asking left right winged youve every right know data cambridge analytica data points ever american voter knew psychology points even tell impossible stay unbiased days trying aware want fall want talk want manipulate must nothing help mention cambridge analytica india think still affects elections christopher wylie openly commit affecting elections previously guys think worth raising voice late already cambridge analytica partnered parties indiahttpswwwwashingtonpostcomworldasiapacificwhistleblowerclaimscambridgeanalyticaspartnersinindiaworkedonelectionsraisingprivacyfearsccaebbdastoryhtml ",
    "cleaned_title": "doesnt youth want talk politics",
    "cleaned_selftext": "going subreddit realised much youth doesnt want talk politics reading manish sisodias arrest satyendar jains arrest rahul gandhis arrest posts people apathetic towards simply dont care youre way youre already product commodity companies like cambridge analytica scary claimed alexander nix first step towards success make people apathetic propaganda watching great hack netflix im pretty sure many heard cambridge analytica company takes data meta facebook parses predicts voters psychology targets propaganda ads amount similarities indian election campaigns made wonder role indian elections turns puppets experiment upon strengthen change presidency usa responsible trumps victory disgusting disgraceful monster got see brexit ducking company literally single handedly divided nation divided whole earth played uno reverse great britain ironic england longer part eu including wales northern ireland scotland scotland wants part eu amount turmoil instability caused amazing sorry going tangent wanted say much power much power data divide country think else could need talk going things hard say whats right wrong things literally dont make sense wasnt modi arrested rahul arrested im one stand congress hate congress look china youll realise happens resistance india doesnt stop takes worst traits usa hyper capitalist state chinas authoritativeness combines make poor corrupt country wait till see effects modis rule onwards dont know takes around years effects policies laid start showing effects india might fastest growing gdp even rn gdp per capita poor hard look even gdp per capita isnt true representation corporates cant even balance companies parties dont want talk politics become apathetic shifted voting works people dont even realise minds altered im currently computer science amount data companies mind blowing know lot downloaded data im speechless think woke culture actually representative something else right wing made appear like people dont opinion companies politicians want apathetic people potential voters little bit wind ads target boom companies know saying part woke culture anything terms conscience need wake learn resist bc want succumb shitheads nothing save youth suffer jobs housing surviving im gen z btw know depressing look least know youre manipulated im asking left right winged youve every right know data cambridge analytica data points ever american voter knew psychology points even tell impossible stay unbiased days trying aware want fall want talk want manipulate must nothing help mention cambridge analytica india think still affects elections christopher wylie openly commit affecting elections previously guys think worth raising voice late already cambridge analytica partnered parties indiahttpswwwwashingtonpostcomworldasiapacificwhistleblowerclaimscambridgeanalyticaspartnersinindiaworkedonelectionsraisingprivacyfearsccaebbdastoryhtml",
    "cleaned_comments": "replies unsurprising ive felt many times india really really hates change better worse mean people across world dislike change india extraordinarily resistant changes doesnt matter whether better worse people really dont want fight anything doesnt directly slap face quote read fits perfectly india didnt grow policies india grew despite xb india wonderful opportunity improve right wasting everything name relics burdens past truly surprising india general always crybaby would rather bemoan could rather could people grow economically get better education learn right wrong focus development parents today india first generation majority actually go school first ones go colleges next generation ones would actually mature adults though growth much faster used lines blur older generation messing country newer generation somewhat better actually acknowledges issues doesnt actually want fight hopefully future generations better lot people feel strongly stuff happening country fear consequences remotely identified antinational thats political voices heard today align rulers visible leader opposition disqualified collusion judiciary executive imagine read haren pandya youll scared go morning walks people say apolitical mean fine things way dont like follow politics biggest cop line many young ones young ones every generation politics treated dirty thing dont get involved things correct magically certain party country already buying data manipulating social media like whatsapp twitter staggering scale decade cells beat pants anything us could hope cambridge analytica want talkdebate politics lot dont reasons freedom speech isnt protected cases judiciary weaponised serve overlords police also weaponised serve overlords indians lack critical thinking makes debates hard indians also incapable holding back emotions debating change opinion scholars one fact cant change opinion one idiot facts way get changes everyone gets pissed riots across country thats gon na happen election winning companies also called political parties know keep least one persongroup people happy movement everywhere nearly impossible india adore french protest system people dont discuss politics generally means happy state affairs start becoming interested politics heavy dissatisfaction happening feel need change period saw increase youth engagement politics india due situation time interesting thing engaged politics become engaged addictive difficult leave since however young generation disengaged politics actually norm india saw similar level disinterest politics among youth course regional variations etc valid throughout country think best us right make sure use individual votes judiciously well rahuls case actually sad two mentioned literally corrupt u want save corrupts load crap given hoping better well cant keep views cause freedom speech countless times mocked shamed certain views opinions people want impose views arent accepting respect lost friends political views far questioning government concern already see result focusing youth different take talk youth interested specific discussions lack higher study options unemployment freedom women reservation etc definitely less interested topic remote example health care cause busy dealing mundane shize inner demons wise man one said debating politics religion like banging head wall never change opposite persons opinion order give hoping better originally engaged politics first place im th grade see among classmates hardly anyone political knowledge almost one answers political questions asked class whenever talk politics make political joke goes heads think im crazy elections next year us turning honestly hopes dont engaged politics hope better dont employed hope money employed hoping money though try go get employment similarly want change try find likeminded people also want change discuss things people start engaging politics constitution provides us freedom speech labelled antination say something political parties politics toned lot since realised isp providers keep data atleast years plus stopped caring need focus keep afloat rather wasting time would great could truly country without hate country focus welfare development know stupid dream like bjp congress politicians come power way increase wealth dislike discussion politics doesnt make sense politicians dont say mean dont mean say almost impossible oversee legislative pillars democracy powerful making system unbalanced people india consider ministers public servants feudal overlords correct side competition evil less evil easy generate false information trust information actively verify start discussion politics emotion seems facts opinion shallow people dont realize many hypocritic opinions havei guilty irritates without benifit growth knowledge thanks retired individuals students concerned studies children age work physicallymentally disabled housewiveshusbands people right hope higher income exactly dude agree reasons youve mentioned also call flaws thinking give reason beliefs wrong makes defensive theyll defend ideology might stop listening reason together also freedom speech laws arent great country nobody wants waste time trying convince sheeps lol hope higher income without job business money tree hoping breadwinner house earns want babies go earn wish fathermotherfamily made little money could afford toy something kid nailed bro become sheeps happy minding business take miracle remove current dispensation power even happens go away real gas chambers come eleminate resistance exactly wrong mofos idea would come spew nonsesne someone gave make delhi better state one rupee corrupt money recovered ywt langush jail fucked lower courts prolonging even simple bail hearings worry time come one remaining speak lol aap corrupt hell spending thousand crores advertising two prominent leaders jail corruption charges aap party laugh said mofos clue keep spewing nonsense propagabda fed corrupt modi told jail corrupt hope soon bjp congress form govt delhi talk bjp whatsapp unkills start hating good experience eventually reached point people think good question pm keep dreaming realeased soon cases crooked lower judiciary feels great see congress zero delhi zero punjab well congis bjp mofos keep sulking care hope get released arent guilty dont want die trying something decent country make big splash piss wrong people die never get justice also talking friends family happens sometimes talking managerscolleagues make realise stupid cruel think finding ugliness inside peers makes act less nice benefit guess makes selfish apathetic dont want care anymore care im emotionally burnt ill live life make sure dont add kids die glad parents childhood saw work hard everyday materialistic things important back forgive mr saint fault assuming average year old kid would prefer getting toy little attaining moksha us know matter open politics old uncles top power ability whatever please edit grammar yes kid prefer toy different wishing parents earned money disrespectful towards parents difference wishing parents earned money condemning parents earning enough money anyone everyone hope better times doesnt mean disrespectful",
    "light_cleaned_title": "Why doesn't youth want to talk about politics?",
    "light_cleaned_selftext": "So, I was going through the subreddit and realised much of the youth doesn't want to talk about politics at all. I was reading through Manish Sisodia's arrest, Satyendar Jain's arrest and Rahul Gandhi's arrest posts and most people are apathetic towards it. They simply don't care, and if you're that way, you're already a product, commodity for companies like Cambridge Analytica and it's scary, because as claimed by Alexander nix, this is the first step towards their success, to make people apathetic, in any propaganda. I was watching the great hack on Netflix and I'm pretty sure many of you have heard about Cambridge Analytica. A company who takes data from Meta (Facebook) and parses and predicts the voter's psychology, then targets them with propaganda ads. The amount of similarities in Indian election campaigns made me wonder if they had a role in Indian elections, turns out, we were just puppets for them to experiment upon, so that they can strengthen themselves and change the presidency in USA, they were responsible for Trump's victory, a disgusting and disgraceful monster. Then we got to see Brexit, this ducking company literally single handedly divided the nation that divided the whole Earth, they played an Uno reverse on The Great Britain. It's just so ironic, England is no longer a part of EU, including Wales, Northern Ireland and Scotland but Scotland wants to be a part of EU, the amount of turmoil and instability they caused is amazing. Sorry for going on a tangent but I just wanted to say how much power it has, how much power your data has that it can divide a country in 2020. Think what else it could do. We need to talk about the on going things, its hard to say what's right or what is wrong but some things just literally don't make sense, why wasn't Modi arrested himself for 2002? And Rahul is being arrested now, I'm not the one to stand with Congress, I hate congress but look at China and you'll realise what happens when you have no resistance. But India doesn't stop there, it takes the worst traits of USA, a hyper capitalist state and China's authoritativeness and combines it to make a poor and corrupt country, wait till you see the effects of Modi's rule in 2025 onwards. For those who don't know, it takes around 10 years for the effects of policies laid to start showing effects. India might be fastest growing GDP even rn but its GDP per capita is so poor that its hard to look at, even GDP per capita isn't a true representation, the corporates can't even balance it out. Companies and some parties don't want you to talk about politics, become apathetic, so that you can be shifted to voting for them, and it works, and people don't even realise their minds have been altered. I'm currently doing computer science and the amount of data these companies have on you is mind blowing, not that i know a lot but i just downloaded my data and I'm speechless. I think the woke culture was actually representative of something else than what the right wing has made it to appear like. People who don't have their own opinion is what these companies and these politicians want, because the more apathetic people, the more potential voters, just a little bit of wind of ads to target and boom. These companies know more about you than you do, not saying it as a part of woke culture or anything but in terms of your conscience, you need to wake up and learn to resist, bc if you just want to succumb to these shitheads, nothing can save you. Youth will suffer, for jobs for housing and for surviving. I'm a gen z too btw, I know it is depressing to look at but at least know where you're being manipulated, I'm not asking you to be left or right winged but you've every right to know what they are doing with your data. Cambridge Analytica had 5000 data points on ever American voter, they knew 5000 psychology points of you, that even you cannot tell about yourself. It is impossible to stay unbiased these days but trying to be aware that they want you to fall into this, they want you to not talk, they want to manipulate you is a must, nothing can help you, other than yourself. After 2018, there has been no mention of Cambridge Analytica in India, do you think it still affects elections? Christopher Wylie did openly commit to affecting elections previously. What do you guys think about this? Is it worth raising a voice, or is it too late already? [Cambridge Analytica partnered with parties in India](https://www.washingtonpost.com/world/asia_pacific/whistleblower-claims-cambridge-analyticas-partners-in-india-worked-on-elections-raising-privacy-fears/2018/03/28/1168c04c-328a-11e8-b6bd-0084a1666987_story.html)",
    "light_cleaned_comments": "No replies, how unsurprising. I've felt this so many times before, but India really really hates change, for better or for worse. I mean all people across the world dislike change but India is extraordinarily resistant to changes, doesn't matter whether they are for better or for worse. But people really don't want to fight against anything that doesn't directly slap them in the face. There was a quote I read that fits perfectly, \"India didn't grow because of it's policies, India grew despite them.\" &#x200B; India has a wonderful opportunity to improve on right now but we are wasting everything in name of relics and burdens from the past. But this is not truly surprising, India, in general, has always been a crybaby that would rather bemoan on what could have been rather than what could be. As people grow economically and get better education, the more they learn what is right and what is wrong, more they focus on development. The parents today in India were the first generation (as majority) to actually go to school, we are the first ones to go to colleges, our next generation will be the ones who would actually be the mature adults, though the growth is much faster now than it used to be and the lines blur more. The older generation is messing up our country. The newer generation is somewhat better in that it actually acknowledges the issues but doesn't actually want to fight them. Hopefully our future generations will be better. A lot of people feel strongly against the stuff happening in the country. But then, we fear the consequences of remotely being identified as an “anti-national”. That’s why the only political voices heard today are those that align with the rulers. If the most visible leader of the opposition can be disqualified through the collusion of judiciary and executive, imagine what they can do to you. Read about Haren Pandya. You’ll be scared to go out on morning walks. Because most people say apolitical when they mean I am fine with things the way they are \"I don't like (or follow) politics\" is the biggest cop out line for many young ones. It was the same for the young ones of every generation. Politics is treated as this dirty thing you don't get involved in and things will correct itself magically A certain party in this country has already being buying data and manipulating social media like WhatsApp and Twitter on a staggering scale for over a decade. Their IT cells beat the pants off anything the US could hope to do with Cambridge Analytica. I want to talk/debate in politics a lot and i don't. Here are the reasons: 1. Freedom of speech isn't protected in most cases. 2. The judiciary is weaponised to serve our overlords. 3. The police are also weaponised to serve our overlords. 4. Most Indians lack critical thinking. This makes debates very hard. Most Indians are also incapable of holding back emotions while debating. 5. You can change the opinion of 40 scholars with one fact. But you can't change the opinion of one idiot with 40 facts. The only way we get changes is if everyone gets pissed and riots across the country. But that's not gonna happen because all the election winning companies (also called political parties) know how to keep at least one person/group of people happy. So a movement everywhere all at once is nearly impossible in India. I adore how the French protest against a system. When people don't discuss politics, it generally means they are happy with the state of affairs. They start becoming interested in politics when there is heavy dissatisfaction with what is happening and they feel a need for change. The 2010-2013 period saw an increase in youth engagement with politics in India due to the situation at the time (And the interesting thing about being engaged with politics is that when you do become engaged, it is too addictive and is difficult to leave). Since 2014, however, the young generation has disengaged from politics again. this is actually a norm for India. We saw a similar level of disinterest for politics among the youth from 1997-2010. Now, of course, this has some regional variations etc. and is not valid throughout the country. I think the best that any of us can do right now is to make sure we use our individual votes judiciously. Well Rahul's case is actually sad but the other two you mentioned are literally corrupt why do u want to save the corrupts What a load of crap. That or they have given up on hoping for better. Well I can't keep my views out there cause there is no freedom of speech, countless times I have been mocked, shamed for having certain views or opinions. People want to impose their views but aren't accepting at all to respect against theirs. I have lost friends over political views. As far as questioning the government is the concern we already see what is the result with those who do. (focusing on youth below 23) I have different take. When I talk to youth they are interested in specific discussions - such as lack of higher study options, unemployment, freedom (women), reservation etc. They are definitely less interested in topic that is remote to them - for example health care for all cause they are too busy dealing with their mundane shize and inner demons. A wise man one said , “Debating about politics and religion is like banging your head against the wall” - you can never change the opposite persons opinion. In order to \"give up hoping for better\" you have to originally be engaged with politics in the first place. I'm in 12th grade and I see this among my classmates, hardly anyone has some political knowledge and almost no one answers political questions when asked in class, whenever I talk politics or make a political joke it goes over their heads and they think I'm crazy. There are elections next year and most of us are turning 18 I have honestly no hopes You don't have to be engaged in politics to hope for better, just as you don't have to be employed to hope for more money. If you are not employed and are hoping for money though, you will try go get employment. Similarly, if you want change, you will try to find likeminded people who also want change, discuss things with them. This is how most people start engaging in politics. The constitution provides us Freedom of speech but we're labelled as \"anti-nation\" if we say something against some political parties or politics. I have toned down a lot since I realised that ISP providers keep data for atleast 2 years. Plus I have stopped caring, I need to focus how to keep myself afloat rather than wasting my time. It would be great if we could truly be a country without hate, a country that focus only on the welfare and development but we all know it's stupid to dream like that. Be it bjp or Congress, all these politicians come to power only for way to increase their own wealth. I dislike discussion on politics because: 1. It doesn't make sense. Politicians don't say what they mean and don't mean what they say. 2. It is almost impossible to oversee legislative. Of the 3 pillars of democracy it is the most powerful making the system unbalanced. 3. People of India consider Ministers not as public servants but as feudal overlords. 4. There is no correct side. It is a competition of evil and less evil. 5. It is so easy to generate false information, why should I trust any information which I cannot actively verify? 6. If you start discussion about politics it all about \"emotion\" it seems and not facts. Most of the opinion will be shallow and people don't realize many hypocritic opinions they have(I am guilty of same). It irritates me without any benifit or growth of knowledge. So no thanks! So retired individuals, students more concerned with their studies, children of no age to work or physically/mentally disabled or housewives/husbands, all of these people have no right to hope for a higher income? Exactly dude, I agree with all the reasons you've mentioned, also if you call out the flaws in their thinking or give reason as to why their beliefs are wrong, it only makes them defensive and they'll defend their ideology with more might and will stop listening to reason all together Also freedom of speech laws aren't great in this country and nobody wants to waste their time trying to convince these sheeps lol How will they hope for a higher income without a job or a business? Is there a money tree? Or are they hoping the breadwinner of the house earns more? So what? you want babies to go out and earn then? Did you not wish your father/mother/family made a little more money so you could afford a toy or something, when you were a kid? Nailed it bro. We have all become sheeps that are happy minding their own business. It will take a miracle to remove current dispensation from power and even if that happens, they will not go away. That is when real gas chambers will come out to eleminate any resistance. This is what is exactly wrong. These mofos who have no idea would come out and spew nonsesne about someone who gave it their all to make delhi a better state. Not one rupee of corrupt money has been recovered from both ywt they langush in jail because of fucked up lower courts prolonging even simple bail hearings. But worry not. Your time will come too and there will be no one remaining to speak for you. Lol aap is corrupt as hell . Spending thousand of crores in advertising and now their two prominent leaders are in jail for corruption charges . Aap is a party to laugh at. As i said mofos who have no clue keep spewing the nonsense propagabda fed to them. They are corrupt . Modi has not told me so they are in jail because they are corrupt i hope soon bjp or congress form govt in delhi If you talk against bjp then our whatsapp unkills start hating you . All have good experience. Eventually we have reached at a point that most people think its not good to question pm keep dreaming... they will be realeased as soon as their cases are out of crooked lower judiciary... it feels great to see Congress at ZERO in Delhi. Will be ZERO in Punjab in 2027 as well. congis and bjp mofos can keep sulking for all i care. I hope they get released if they aren't guilty . Because I don't want to die for trying to do something decent in this country. Make too big of a splash or piss off the wrong people, and you will just die and never get justice. Also, talking about it with friends and family? That happens sometimes. But talking about it with managers/colleagues will make you realise how both stupid and cruel they are. I think finding out the ugliness inside my peers makes me act less nice to them, which will not benefit me. I guess this makes me selfish and apathetic. I don't want to care anymore. I did care before but now I'm emotionally burnt out. I'll just live out this life, make sure I don't add any kids, and then die at 75 or 80. No. I was glad with what my parents did for me in my childhood because I saw them work very hard everyday. Materialistic things were not as important to me back then. Forgive me mr. saint, it was my fault assuming that an average 6-7 year old kid would prefer getting a toy, a little more than, attaining moksha. All of us know that no matter how open we are about politics the old uncles at top will have the power and ability to do whatever they please EdIt: grammar Yes a kid will prefer a toy but that is very different from wishing their parents earned more money. That is so disrespectful towards the parents. There is a difference between wishing their parents earned more money and condemning their parents for not earning enough money. Anyone and everyone should hope for better times, it doesn't mean they are being disrespectful 🤦‍♂️"
}