{
    "id": "1b5bu40",
    "title": "Woman’s body in pieces found stuffed in two bags in UP’s Amroha - Hindustan Times",
    "url": "https://www.hindustantimes.com/cities/lucknow-news/womans-body-in-pieces-found-stuffed-in-two-bags-in-up-s-amroha-101709042847398.html",
    "selftext": "Body of a young woman, aged between 20 and 25 years, suspected to be pregnant was found in 20 pieces.",
    "flair": "Crime",
    "score": 353,
    "num_comments": 39,
    "created_utc": 1709452679,
    "convurl": "https://external-preview.redd.it/S2zS79zRBgB-jYZugelha_RFmHzynZkIn7R2gIeiZtU.jpg?auto=webp&s=5701247a866a7ab0b15f201b4a47f5e6a00e3113",
    "comments": [
        "Amroha Woman Murder Case: In a shocking incident, Amroha Police discovered a mangled body of a young woman, cut into 20 pieces and stuffed in two gunny bags on Tuesday. The woman aged between 20 to 25 years is suspected to have been pregnant at the time of the murder, said senior police officials. The body was found within the jurisdiction of Naugawa Saadat police station Amroha district on Tuesday. (28th Feb. 2024)",
        "And here we are.",
        "This nation is so incredibly safe for women /s",
        "If we don't acknowledge the senseless violence towards woman by the culture then this is going to turn ugly",
        "400 seats hi aayengi tension na lo💀💀",
        "What is wrong with people.",
        "Another hour, another news about UP and India. And yet the majority wants to go ahead with the delimitation.\n\nI'm so done with this country, trying my best to leave with my loved ones asap.",
        "Everything",
        "That's so close to my home just a km away😢",
        "instead of focus on the actual issue and its remedial measures  \n  \nthat statement will start mindless discussions about which culture you are talking about!! and why not the other!!",
        "bro?nogawa k h?",
        "Amroha Railway station ke pas.",
        "acha phli bar koi yha k reddit p dka h lol",
        "Number one country, dont say lies /s",
        "When is this going to stop ? When is the NCW chief going to resign her post ?",
        "Someone needs to be held accountable for all these things happening.",
        "Until women's life matter in this country so called the hub of ethics, traditions and culture.",
        "This is the reason Movies like animal should not be celebrated",
        "I sometimes want to let all religious, guru gather around in a field and let them fight for whatever hypocrite moral they feel like shoving up someone's ass then....\n\n\nShow them these news and ask them if that's what they are fighting for, if that's what they claim with their superior heritage and ethics. \n\n\nAnd if they can't answer, and stay quite I'll burn them alive.",
        "We the people should be held responsible, we have demons among us and there's nothing can be done.",
        "Only if they are a minority",
        "It kinda sucked all round the even RRR was better and that was factually incorrect anti British propaganda ( hell, we've done so much bad shit as a country just telling the truth is enough to radicalised people)",
        "im talking about INDIAN culture because i am indian and i live in india and this incident happened in india and we are in r/india. would i be talking about french culture?? idiot",
        "We need immediate everyday mass campaigns about violence against women and their safety throughout the country. Need to educate the young about the seriousness of these crimes.",
        "As upsetting as it is to think about, much of human history has benefitted from the idea that “the smart ones get away with it.” It’s an antisocial, short-term scarcity-based mindset.",
        "https://preview.redd.it/hs53mgnik4mc1.jpeg?width=456&format=pjpg&auto=webp&s=6993bec09cd65bd4e3e4e0be76e4b60ce8868e5a",
        "I'll say it again, India is the world's UP.",
        "My heartaches after reading such news. Why are things going pear-shaped against women, or is it always like this?",
        "The news keeps coming eh?",
        "I can and will educate my immediate family and friends about consent but how can we ensure that sex education reaches the rural regions. I cannot fathom the idea that we will remain shitholes for the next 50 yrs too.",
        "Can you elaborate on the anti British propaganda part? They ruled on us and robbed our country so much, so what was the incorrect stuff shown in the movie except I guess fictional characters and some fictional narrative over the already established ground of our British Raj history.",
        "Asia's UP world's bihar",
        "Yes, let's hold someone accountable for the 1.4 billion people in the country..",
        "Bilkul nikal skti h.....bs inhone iski guarantee ni li k sahi-salamat waps b ayegi",
        "🐄🥩😋",
        "this happen just opposite my house, even now police is there with forensic team. am very scared 😰, police are checking everyones houses even my house. they checked my phone also.",
        "People are too focused on the wedding, while such crimes continue to take place. \n\nOf course people in that country are shameless. When the election time comes, they’d just queue up. They need an actor to put in an ad to tell them what to do, and even then can’t follow turn instructions.\n\nGovernment would do any and everything possible if this was related to someone slaughtering a core and consuming beef.\n\nTime to question the pee drinking clown. All he cares about are his pointless adventures, the started in the forest or your one underwater. The other clown from the so called rival party is useless. All he ever does is go around the country, wasting peoples time.",
        "Violence against women has increased & strangely ALSO been normalised since 2014. I can’t wait to get out of this country, honestly. Those who can’t see how women will suffer more if the current ruling party is elected again can go eat sh*t."
    ],
    "cleaned_text": "womans body pieces found stuffed two bags ups amroha hindustan times body young woman aged years suspected pregnant found pieces ",
    "cleaned_title": "womans body pieces found stuffed two bags ups amroha hindustan times",
    "cleaned_selftext": "body young woman aged years suspected pregnant found pieces",
    "cleaned_comments": "amroha woman murder case shocking incident amroha police discovered mangled body young woman cut pieces stuffed two gunny bags tuesday woman aged years suspected pregnant time murder said senior police officials body found within jurisdiction naugawa saadat police station amroha district tuesday th feb nation incredibly safe women dont acknowledge senseless violence towards woman culture going turn ugly seats hi aayengi tension na lo wrong people another hour another news india yet majority wants go ahead delimitation im done country trying best leave loved ones asap everything thats close home km away instead focus actual issue remedial measures statement start mindless discussions culture talking bronogawa k h amroha railway station ke pas acha phli bar koi yha k reddit p dka h lol number one country dont say lies going stop ncw chief going resign post someone needs held accountable things happening womens life matter country called hub ethics traditions culture reason movies like animal celebrated sometimes want let religious guru gather around field let fight whatever hypocrite moral feel like shoving someones ass show news ask thats fighting thats claim superior heritage ethics cant answer stay quite ill burn alive people held responsible demons among us theres nothing done minority kinda sucked round even rrr better factually incorrect anti british propaganda hell weve done much bad shit country telling truth enough radicalised people im talking indian culture indian live india incident happened india rindia would talking french culture idiot need immediate everyday mass campaigns violence women safety throughout country need educate young seriousness crimes upsetting think much human history benefitted idea smart ones get away antisocial shortterm scarcitybased mindset ill say india worlds heartaches reading news things going pearshaped women always like news keeps coming eh educate immediate family friends consent ensure sex education reaches rural regions fathom idea remain shitholes next yrs elaborate anti british propaganda part ruled us robbed country much incorrect stuff shown movie except guess fictional characters fictional narrative already established ground british raj history asias worlds bihar yes lets hold someone accountable billion people country bilkul nikal skti hbs inhone iski guarantee ni li k sahisalamat waps b ayegi happen opposite house even police forensic team scared police checking everyones houses even house checked phone also people focused wedding crimes continue take place course people country shameless election time comes theyd queue need actor put ad tell even cant follow turn instructions government would everything possible related someone slaughtering core consuming beef time question pee drinking clown cares pointless adventures started forest one underwater clown called rival party useless ever go around country wasting peoples time violence women increased strangely also normalised since cant wait get country honestly cant see women suffer current ruling party elected go eat sht",
    "light_cleaned_title": "Woman’s body in pieces found stuffed in two bags in UP’s Amroha - Hindustan Times",
    "light_cleaned_selftext": "Body of a young woman, aged between 20 and 25 years, suspected to be pregnant was found in 20 pieces.",
    "light_cleaned_comments": "Amroha Woman Murder Case: In a shocking incident, Amroha Police discovered a mangled body of a young woman, cut into 20 pieces and stuffed in two gunny bags on Tuesday. The woman aged between 20 to 25 years is suspected to have been pregnant at the time of the murder, said senior police officials. The body was found within the jurisdiction of Naugawa Saadat police station Amroha district on Tuesday. (28th Feb. 2024) And here we are. This nation is so incredibly safe for women /s If we don't acknowledge the senseless violence towards woman by the culture then this is going to turn ugly 400 seats hi aayengi tension na lo💀💀 What is wrong with people. Another hour, another news about UP and India. And yet the majority wants to go ahead with the delimitation. I'm so done with this country, trying my best to leave with my loved ones asap. Everything That's so close to my home just a km away😢 instead of focus on the actual issue and its remedial measures that statement will start mindless discussions about which culture you are talking about!! and why not the other!! bro?nogawa k h? Amroha Railway station ke pas. acha phli bar koi yha k reddit p dka h lol Number one country, dont say lies /s When is this going to stop ? When is the NCW chief going to resign her post ? Someone needs to be held accountable for all these things happening. Until women's life matter in this country so called the hub of ethics, traditions and culture. This is the reason Movies like animal should not be celebrated I sometimes want to let all religious, guru gather around in a field and let them fight for whatever hypocrite moral they feel like shoving up someone's ass then.... Show them these news and ask them if that's what they are fighting for, if that's what they claim with their superior heritage and ethics. And if they can't answer, and stay quite I'll burn them alive. We the people should be held responsible, we have demons among us and there's nothing can be done. Only if they are a minority It kinda sucked all round the even RRR was better and that was factually incorrect anti British propaganda ( hell, we've done so much bad shit as a country just telling the truth is enough to radicalised people) im talking about INDIAN culture because i am indian and i live in india and this incident happened in india and we are in r/india. would i be talking about french culture?? idiot We need immediate everyday mass campaigns about violence against women and their safety throughout the country. Need to educate the young about the seriousness of these crimes. As upsetting as it is to think about, much of human history has benefitted from the idea that “the smart ones get away with it.” It’s an antisocial, short-term scarcity-based mindset. I'll say it again, India is the world's UP. My heartaches after reading such news. Why are things going pear-shaped against women, or is it always like this? The news keeps coming eh? I can and will educate my immediate family and friends about consent but how can we ensure that sex education reaches the rural regions. I cannot fathom the idea that we will remain shitholes for the next 50 yrs too. Can you elaborate on the anti British propaganda part? They ruled on us and robbed our country so much, so what was the incorrect stuff shown in the movie except I guess fictional characters and some fictional narrative over the already established ground of our British Raj history. Asia's UP world's bihar Yes, let's hold someone accountable for the 1.4 billion people in the country.. Bilkul nikal skti h.....bs inhone iski guarantee ni li k sahi-salamat waps b ayegi 🐄🥩😋 this happen just opposite my house, even now police is there with forensic team. am very scared 😰, police are checking everyones houses even my house. they checked my phone also. People are too focused on the wedding, while such crimes continue to take place. Of course people in that country are shameless. When the election time comes, they’d just queue up. They need an actor to put in an ad to tell them what to do, and even then can’t follow turn instructions. Government would do any and everything possible if this was related to someone slaughtering a core and consuming beef. Time to question the pee drinking clown. All he cares about are his pointless adventures, the started in the forest or your one underwater. The other clown from the so called rival party is useless. All he ever does is go around the country, wasting peoples time. Violence against women has increased & strangely ALSO been normalised since 2014. I can’t wait to get out of this country, honestly. Those who can’t see how women will suffer more if the current ruling party is elected again can go eat sh*t."
}