{
    "id": "1doaazh",
    "title": "Received some unusual pictures from a unknown number ",
    "url": "https://www.reddit.com/gallery/1doaazh",
    "selftext": "These are pictures I received just now from an unknown number, and they look unusual. I don't know who the kid in the picture is . Later, this person deleted the pictures and did not reply to anything.I'm just 17 years and I don't know what to do or why I even received these pictures",
    "flair": "Crime",
    "score": 28,
    "num_comments": 18,
    "created_utc": 1719333191.0,
    "convurl": "https://i.redd.it/kxla53q9wq8d1.jpg",
    "comments": [
        "mathsamitkumar 😈",
        "Report to the police, just to b on the safer side",
        "Report the number to Childline as soon as possible. \n\nCall childline: 1098",
        "Probably just a wrong number. They're trying to prank you or some by creating YouTube video or shorts. \n\nOf course it's possible they captured rhe child and Calling the highest bidder.\n\nThough I don't think they'd be that i competent to misscall someone.",
        "post on x and tag police they will notice and take care of it or file complain here [Cyber Crime Portal](https://www.cybercrime.gov.in/) you do not have to go anywhere (believe me case of child abuse and kidnaping is in rise please report it  don't ignore it ) if you need other help message me",
        "kid is smiling in one photo so i don't know what to make of any of this",
        "replay how much",
        "Offtopic: That font on your phone is the visual equivalent of nails on a chalkboard. Typographical atrocity!",
        "Possible child porn. Report to the police immediately.",
        "the Chains of Olympus",
        "I like it. That’s just your opinion not an atrocity.",
        "Child abuse for sure!",
        "The kid looks disturbed",
        "Dont think this child abduction, considering there is no bruising around the wrists from the chains and it is quite an open space to take a supposed child abduction photo."
    ],
    "cleaned_text": "received unusual pictures unknown number pictures received unknown number look unusual dont know kid picture later person deleted pictures reply anythingim years dont know even received pictures ",
    "cleaned_title": "received unusual pictures unknown number",
    "cleaned_selftext": "pictures received unknown number look unusual dont know kid picture later person deleted pictures reply anythingim years dont know even received pictures",
    "cleaned_comments": "mathsamitkumar report police b safer side report number childline soon possible call childline probably wrong number theyre trying prank creating youtube video shorts course possible captured rhe child calling highest bidder though dont think theyd competent misscall someone post x tag police notice take care file complain cyber crime portalhttpswwwcybercrimegovin go anywhere believe case child abuse kidnaping rise please report dont ignore need help message kid smiling one photo dont know make replay much offtopic font phone visual equivalent nails chalkboard typographical atrocity possible child porn report police immediately chains olympus like thats opinion atrocity child abuse sure kid looks disturbed dont think child abduction considering bruising around wrists chains quite open space take supposed child abduction photo",
    "light_cleaned_title": "Received some unusual pictures from a unknown number",
    "light_cleaned_selftext": "These are pictures I received just now from an unknown number, and they look unusual. I don't know who the kid in the picture is . Later, this person deleted the pictures and did not reply to anything.I'm just 17 years and I don't know what to do or why I even received these pictures",
    "light_cleaned_comments": "mathsamitkumar 😈 Report to the police, just to b on the safer side Report the number to Childline as soon as possible. Call childline: 1098 Probably just a wrong number. They're trying to prank you or some by creating YouTube video or shorts. Of course it's possible they captured rhe child and Calling the highest bidder. Though I don't think they'd be that i competent to misscall someone. post on x and tag police they will notice and take care of it or file complain here [Cyber Crime Portal](https://www.cybercrime.gov.in/) you do not have to go anywhere (believe me case of child abuse and kidnaping is in rise please report it don't ignore it ) if you need other help message me kid is smiling in one photo so i don't know what to make of any of this replay how much Offtopic: That font on your phone is the visual equivalent of nails on a chalkboard. Typographical atrocity! Possible child porn. Report to the police immediately. the Chains of Olympus I like it. That’s just your opinion not an atrocity. Child abuse for sure! The kid looks disturbed Dont think this child abduction, considering there is no bruising around the wrists from the chains and it is quite an open space to take a supposed child abduction photo."
}