{
    "id": "1ac5nh6",
    "title": "Got this message today",
    "url": "https://i.redd.it/u0b7l6uttxec1.png",
    "selftext": "Anyone gets texts like these? I don't remember signing up for any loan application at Kreditbee, and I took chance with the link — it just took me to their app page on Play Store.\n\nI'm asking this since with all these NBFC scams and fake loans in your name scams going on, one can't be careful enough. Let me know if this is something about which I should be pursuing legal action (however ineffective it might be in India) or just a really troublesome notification copy?",
    "flair": "Law & Courts",
    "score": 5,
    "num_comments": 2,
    "created_utc": 1706341663.0,
    "convurl": "https://i.redd.it/u0b7l6uttxec1.png",
    "comments": [
        "It’s an ad. Just don’t click on anything"
    ],
    "cleaned_text": "got message today anyone gets texts like dont remember signing loan application kreditbee took chance link took app page play store im asking since nbfc scams fake loans name scams going one cant careful enough let know something pursuing legal action however ineffective might india really troublesome notification copy ",
    "cleaned_title": "got message today",
    "cleaned_selftext": "anyone gets texts like dont remember signing loan application kreditbee took chance link took app page play store im asking since nbfc scams fake loans name scams going one cant careful enough let know something pursuing legal action however ineffective might india really troublesome notification copy",
    "cleaned_comments": "ad dont click anything",
    "light_cleaned_title": "Got this message today",
    "light_cleaned_selftext": "Anyone gets texts like these? I don't remember signing up for any loan application at Kreditbee, and I took chance with the link — it just took me to their app page on Play Store. I'm asking this since with all these NBFC scams and fake loans in your name scams going on, one can't be careful enough. Let me know if this is something about which I should be pursuing legal action (however ineffective it might be in India) or just a really troublesome notification copy?",
    "light_cleaned_comments": "It’s an ad. Just don’t click on anything"
}