{
    "id": "1dcm7s4",
    "title": "Instant flour mixes for dosa, idli, khaman cannot be classified as sattu; to attract 18% GST",
    "url": "https://www.thehindu.com/business/Economy/instant-flour-mixes-for-dosa-idli-khaman-cannot-be-classified-as-sattu-to-attract-18-gst/article68269263.ece",
    "selftext": "Increasing Taxation of common man continues! We have one of the highest tax structures in the world. \n",
    "flair": "Policy/Economy",
    "score": 521,
    "num_comments": 82,
    "created_utc": 1718028033.0,
    "convurl": "https://external-preview.redd.it/EwFhDdxaSz31iXSR2oLhkvDKUU0uXB2JGMBT1k2p6a0.jpg?auto=webp&s=b1177cf6acb0811564163f3dbb2cc5d670731b20",
    "comments": [
        "Election over loot started! The day is not far when this non biological will impose GST on the air we breathe.",
        "Just the day after elections, the milk prices were increased, the prices of common vegetables are also rising and more GST. Yes, like someone said it’s after election loot.",
        "Highest tax , worst facility",
        "No Country for biological people.",
        "They already sell spectrum so you're actually right",
        "When are mobile tariffs going up?",
        "This is a direct attack on the South Indians. We need a separate country.\n\n/S and also Seriously.",
        "Also toll hike",
        "Get ready for using the toilet fringe benefit tax at companies and taking dump gst on public toilets. Nothing is untaxable as per this govt.",
        "Soon, it was declared few months back that it will go up post election",
        "They just wanna end the middle class of India don't they?",
        "No dosa and idli, if you don't vote.  😂. Luv, gobiji /s",
        "Lovely. The one thing this govt doesn’t do is surprise me.",
        "There has to be a way to not pay tax, my area have no facilities; except electricity that we pay for and garbage collection in odd days. There are no street lights, drainage, roads provided by government. Whatever is there is built privately by us people living there even we are paying for street lights electricity that we have installed. I work 2.5 months for this government if I talk about the amount of income tax I pay. Shameless government.",
        "When will they start GST on taking shit ?",
        "Fr. I wonder what happens with all that tax money and dividends they get from the RBI and PSUs. Is 24hrs hours electricity supply and pothole free roads a big ask?",
        "What the hell is wrong with Modi government. If it’s made or produced in India just charge a minimum tax amount of 5 percent. These classification bs needs to end.",
        "It’s funny people think BJP is good on taxes and blame and think that Congress would raise taxes if they had come to power when it is exactly they who reduced them (LTCG for investments to 0 always) and it is thr one wich promised in their manifesto to cut **GST to most products to a flat rate like 5%**\n\nAnd they promised to even remove angel tax which this govt brought , hampering investments in startups..\n\nAnd before anyone jumps the gun on me and says khatakhat , go see my previous posts on the entire issue of freebies. Reality is shocking when you find out BJP does equal if not more freebies. ([What if I told you BJP does equal if not more freebies/welfare (whatever you call it). What if I told you 34Lakh crore was given in direct cash transfers in last 10 years alone?](https://np.reddit.com/r/unitedstatesofindia/s/CozI0D18PE))\n\nThis govt only reduced corp tax expecting that corporations will reinvest and kick off a private capex cycle.. but guess what, it never happened to their expectations and is pretty low\n\n3 cheers to all those who voted for BJP.\n\nDownvote me but this is the truth.",
        "bjp already started marketing the 3crore house Yojana, aginveer decisions etc",
        "The next thing you know, they will tax the air we breath",
        "This comment made me laugh heartily. Thanks man.. :)",
        "Coming soon- A susu tax for urination...18  % GST",
        "This is punishment for TN. 0 seats? No Idli or Dosa for you. All southern states are just collateral damage.",
        "It's a luxury to be able to pee in an attached bathroom. 28% + Cess. Take it or leave it.",
        "RSS long term plan is a return to two class feudal society",
        "They are right. But please don’t make food any more costly",
        "Yes more GST. \n\nTax the fuck out of people.\n\nGood job peeJpee voters.",
        "Bruh why are our salaries are not adjusted to inflation!!! how can a middle or poor class afford this long term.",
        "Where are those who happily voted for dictatorship?",
        "The new old fm will say she doesn't use electricity or roads.",
        ">This govt only reduced corp tax expecting that corporations will reinvest and kick off a private capex cycle..\n\nOur very own Ronald Reagan",
        "Highways built are tolled too.",
        "Imagine people thinking the BJP is good for the middle class when they're out to tax our goddamn dosas",
        "I am good with my 30% taxes. I can still survive. I hope the ones who voted for bjp feel the pinch of rising prices. Aur karo dharam ke nam pe vote. When u cant afford food or medical care, dharam ko yaad karna.",
        "I wonder, why's it a big thing when RBI provides dividends to the Govt.? Hasn't this been done before 2014?",
        "Waiting for petrol hike, just filled up a full tank cos I know its going up soon",
        "They already are. It’s just indirect :)\n\nhttps://www.indiatoday.in/amp/health/story/air-pollution-can-reduce-life-expectancy-by-5-years-doctors-explain-why-2429264-2023-08-31\n\nHow dare you complain about it. In fact you should work 20% harder to compensate your employer for the 5% reduced lifespan!",
        "Taxed like europeans, benefits like Africa",
        "That's the idea, don't you see it? It's right in front of your eyes. We're moving back towards feudalism that's all it is about.",
        "BJP is just sore and showing hatred on Tamilians for not voting for Hindu terrorists.\n\nI guess we'll all just use our wet grinders and make it at home........",
        "They put it in their Swiss bank accounts - duh",
        "Guess it's time for electric vehicle then",
        "They don't care about any of us, they just want to bleed us dry, and they will. Unless we do it to them first.",
        "Lol, they didn't care about reviving economy.........corpos just bought these cheap prostitutes called politicians (sorry it's an insult to prostitutes to even compare) and now get vast benefits.",
        "I guess I'll bee peeing on Lord BeardFucker then",
        "Make dosa/idli mavuu at home.",
        "Actually even Africans have it better in many countries. Only some African countries have it bad.",
        "Because the greedy POS business owners don't care. They want use to be slaves and not complain.\n\nIt's going to get a lot worse unless we get rid of BJP and RSS. Permanently.",
        "Only industrialists allowed to do that. Buy electoral bond first.",
        "They were always looking for more opportunities to tax things.",
        "Exactly.",
        "This is the guy that started making porn at home after porn was banned",
        "If it was a congress govt, it would have been funny.",
        "Chandrababu Naidu must leave NDA 😂😂😂",
        "Circus continues",
        "GST collection to reach 5 trillion ton by 2025 - Amit Shah probably",
        " To all the bhakts out there. This is who you voted for. I hope you enjoy now, cz because of dumbfucks like you, common man in this country suffers.",
        "Idli satyagraha?",
        "You're missing the point here.",
        "Time for Idli Satyagraha.",
        "Russian Corruption + European Taxes + Chinese Labour Laws + Sub Saharan Infrastructure = Captain Vishwaguru",
        "Our public infrastructures are on ventilators. It is such a bad shape. And BJP says we have development India in past 10 years.",
        "Bro, even I am paying 30% income tax, the problem is in our area there is no public infrastructure or even any facilities. Not even roads and streets lights from government. Not parks for children nearby, no public transport, no government schools (worst conditions) why will I pay tax? To let these politicians enjoy their luxury?",
        "Exactly. Dude even bloody health insurance is taxed. Bacha kya he? For the amount of money we are paying. What d f are we even getting. For that matter what the f are the people who r supposed to be getting the benefits are getting? Kuch nai. \nBut politicians are growing richer as the days pass.",
        "Help me understand! RBI procedures aren't my strong suit",
        "What do you think the government will do/is supposed to do with the dividend it gets from the RBI? Smh",
        "That wasn't my question!",
        "Elections over. Now time to milk the cow.",
        "Yes, bloody health insurance is also under gst. It’s a basic need these days seeing the pandemic and cancer and other diseases so common now, it should be out of any kind of taxation.",
        "Wait till you find out 28% on ACs and 18% on health insurance in case you havent.",
        "Why isnt this comment on top? PIN THIS!",
        "This tax has been in place since 2021.",
        "Yeah I've been ranting about the 18% on health insurance for a while. What total bastards, as if this is for entertainment or fun that we have to take health insurance.",
        "It's called enterpreneurship and pulling yourself up by the bootstraps     /s",
        "no wonder tax law is a stable career choice in india"
    ],
    "cleaned_text": "instant flour mixes dosa idli khaman classified sattu attract gst increasing taxation common man continues one highest tax structures world ",
    "cleaned_title": "instant flour mixes dosa idli khaman classified sattu attract gst",
    "cleaned_selftext": "increasing taxation common man continues one highest tax structures world",
    "cleaned_comments": "election loot started day far non biological impose gst air breathe day elections milk prices increased prices common vegetables also rising gst yes like someone said election loot highest tax worst facility country biological people already sell spectrum youre actually right mobile tariffs going direct attack south indians need separate country also seriously also toll hike get ready using toilet fringe benefit tax companies taking dump gst public toilets nothing untaxable per govt soon declared months back go post election wan na end middle class india dont dosa idli dont vote luv gobiji lovely one thing govt doesnt surprise way pay tax area facilities except electricity pay garbage collection odd days street lights drainage roads provided government whatever built privately us people living even paying street lights electricity installed work months government talk amount income tax pay shameless government start gst taking shit fr wonder happens tax money dividends get rbi psus hrs hours electricity supply pothole free roads big ask hell wrong modi government made produced india charge minimum tax amount percent classification bs needs end funny people think bjp good taxes blame think congress would raise taxes come power exactly reduced ltcg investments always thr one wich promised manifesto cut gst products flat rate like promised even remove angel tax govt brought hampering investments startups anyone jumps gun says khatakhat go see previous posts entire issue freebies reality shocking find bjp equal freebies told bjp equal freebieswelfare whatever call told lakh crore given direct cash transfers last years alonehttpsnpredditcomrunitedstatesofindiascozidpe govt reduced corp tax expecting corporations reinvest kick private capex cycle guess never happened expectations pretty low cheers voted bjp downvote truth bjp already started marketing crore house yojana aginveer decisions etc next thing know tax air breath comment made laugh heartily thanks man coming soon susu tax urination gst punishment tn seats idli dosa southern states collateral damage luxury able pee attached bathroom cess take leave rss long term plan return two class feudal society right please dont make food costly yes gst tax fuck people good job peejpee voters bruh salaries adjusted inflation middle poor class afford long term happily voted dictatorship new old fm say doesnt use electricity roads govt reduced corp tax expecting corporations reinvest kick private capex cycle ronald reagan highways built tolled imagine people thinking bjp good middle class theyre tax goddamn dosas good taxes still survive hope ones voted bjp feel pinch rising prices aur karo dharam ke nam pe vote u cant afford food medical care dharam ko yaad karna wonder whys big thing rbi provides dividends govt hasnt done waiting petrol hike filled full tank cos know going soon already indirect dare complain fact work harder compensate employer reduced lifespan taxed like europeans benefits like africa thats idea dont see right front eyes moving back towards feudalism thats bjp sore showing hatred tamilians voting hindu terrorists guess well use wet grinders make home put swiss bank accounts duh guess time electric vehicle dont care us want bleed us dry unless first lol didnt care reviving economycorpos bought cheap prostitutes called politicians sorry insult prostitutes even compare get vast benefits guess ill bee peeing lord beardfucker make dosaidli mavuu home actually even africans better many countries african countries bad greedy pos business owners dont care want use slaves complain going get lot worse unless get rid bjp rss permanently industrialists allowed buy electoral bond first always looking opportunities tax things exactly guy started making porn home porn banned congress govt would funny chandrababu naidu must leave nda circus continues gst collection reach trillion ton amit shah probably bhakts voted hope enjoy cz dumbfucks like common man country suffers idli satyagraha youre missing point time idli satyagraha russian corruption european taxes chinese labour laws sub saharan infrastructure captain vishwaguru public infrastructures ventilators bad shape bjp says development india past years bro even paying income tax problem area public infrastructure even facilities even roads streets lights government parks children nearby public transport government schools worst conditions pay tax let politicians enjoy luxury exactly dude even bloody health insurance taxed bacha kya amount money paying f even getting matter f people r supposed getting benefits getting kuch nai politicians growing richer days pass help understand rbi procedures arent strong suit think government dois supposed dividend gets rbi smh wasnt question elections time milk cow yes bloody health insurance also gst basic need days seeing pandemic cancer diseases common kind taxation wait till find acs health insurance case havent isnt comment top pin tax place since yeah ive ranting health insurance total bastards entertainment fun take health insurance called enterpreneurship pulling bootstraps wonder tax law stable career choice india",
    "light_cleaned_title": "Instant flour mixes for dosa, idli, khaman cannot be classified as sattu; to attract 18% GST",
    "light_cleaned_selftext": "Increasing Taxation of common man continues! We have one of the highest tax structures in the world.",
    "light_cleaned_comments": "Election over loot started! The day is not far when this non biological will impose GST on the air we breathe. Just the day after elections, the milk prices were increased, the prices of common vegetables are also rising and more GST. Yes, like someone said it’s after election loot. Highest tax , worst facility No Country for biological people. They already sell spectrum so you're actually right When are mobile tariffs going up? This is a direct attack on the South Indians. We need a separate country. /S and also Seriously. Also toll hike Get ready for using the toilet fringe benefit tax at companies and taking dump gst on public toilets. Nothing is untaxable as per this govt. Soon, it was declared few months back that it will go up post election They just wanna end the middle class of India don't they? No dosa and idli, if you don't vote. 😂. Luv, gobiji /s Lovely. The one thing this govt doesn’t do is surprise me. There has to be a way to not pay tax, my area have no facilities; except electricity that we pay for and garbage collection in odd days. There are no street lights, drainage, roads provided by government. Whatever is there is built privately by us people living there even we are paying for street lights electricity that we have installed. I work 2.5 months for this government if I talk about the amount of income tax I pay. Shameless government. When will they start GST on taking shit ? Fr. I wonder what happens with all that tax money and dividends they get from the RBI and PSUs. Is 24hrs hours electricity supply and pothole free roads a big ask? What the hell is wrong with Modi government. If it’s made or produced in India just charge a minimum tax amount of 5 percent. These classification bs needs to end. It’s funny people think BJP is good on taxes and blame and think that Congress would raise taxes if they had come to power when it is exactly they who reduced them (LTCG for investments to 0 always) and it is thr one wich promised in their manifesto to cut **GST to most products to a flat rate like 5%** And they promised to even remove angel tax which this govt brought , hampering investments in startups.. And before anyone jumps the gun on me and says khatakhat , go see my previous posts on the entire issue of freebies. Reality is shocking when you find out BJP does equal if not more freebies. ([What if I told you BJP does equal if not more freebies/welfare (whatever you call it). What if I told you 34Lakh crore was given in direct cash transfers in last 10 years alone?](https://np.reddit.com/r/unitedstatesofindia/s/CozI0D18PE)) This govt only reduced corp tax expecting that corporations will reinvest and kick off a private capex cycle.. but guess what, it never happened to their expectations and is pretty low 3 cheers to all those who voted for BJP. Downvote me but this is the truth. bjp already started marketing the 3crore house Yojana, aginveer decisions etc The next thing you know, they will tax the air we breath This comment made me laugh heartily. Thanks man.. :) Coming soon- A susu tax for urination...18 % GST This is punishment for TN. 0 seats? No Idli or Dosa for you. All southern states are just collateral damage. It's a luxury to be able to pee in an attached bathroom. 28% + Cess. Take it or leave it. RSS long term plan is a return to two class feudal society They are right. But please don’t make food any more costly Yes more GST. Tax the fuck out of people. Good job peeJpee voters. Bruh why are our salaries are not adjusted to inflation!!! how can a middle or poor class afford this long term. Where are those who happily voted for dictatorship? The new old fm will say she doesn't use electricity or roads. >This govt only reduced corp tax expecting that corporations will reinvest and kick off a private capex cycle.. Our very own Ronald Reagan Highways built are tolled too. Imagine people thinking the BJP is good for the middle class when they're out to tax our goddamn dosas I am good with my 30% taxes. I can still survive. I hope the ones who voted for bjp feel the pinch of rising prices. Aur karo dharam ke nam pe vote. When u cant afford food or medical care, dharam ko yaad karna. I wonder, why's it a big thing when RBI provides dividends to the Govt.? Hasn't this been done before 2014? Waiting for petrol hike, just filled up a full tank cos I know its going up soon They already are. It’s just indirect :) How dare you complain about it. In fact you should work 20% harder to compensate your employer for the 5% reduced lifespan! Taxed like europeans, benefits like Africa That's the idea, don't you see it? It's right in front of your eyes. We're moving back towards feudalism that's all it is about. BJP is just sore and showing hatred on Tamilians for not voting for Hindu terrorists. I guess we'll all just use our wet grinders and make it at home........ They put it in their Swiss bank accounts - duh Guess it's time for electric vehicle then They don't care about any of us, they just want to bleed us dry, and they will. Unless we do it to them first. Lol, they didn't care about reviving economy.........corpos just bought these cheap prostitutes called politicians (sorry it's an insult to prostitutes to even compare) and now get vast benefits. I guess I'll bee peeing on Lord BeardFucker then Make dosa/idli mavuu at home. Actually even Africans have it better in many countries. Only some African countries have it bad. Because the greedy POS business owners don't care. They want use to be slaves and not complain. It's going to get a lot worse unless we get rid of BJP and RSS. Permanently. Only industrialists allowed to do that. Buy electoral bond first. They were always looking for more opportunities to tax things. Exactly. This is the guy that started making porn at home after porn was banned If it was a congress govt, it would have been funny. Chandrababu Naidu must leave NDA 😂😂😂 Circus continues GST collection to reach 5 trillion ton by 2025 - Amit Shah probably To all the bhakts out there. This is who you voted for. I hope you enjoy now, cz because of dumbfucks like you, common man in this country suffers. Idli satyagraha? You're missing the point here. Time for Idli Satyagraha. Russian Corruption + European Taxes + Chinese Labour Laws + Sub Saharan Infrastructure = Captain Vishwaguru Our public infrastructures are on ventilators. It is such a bad shape. And BJP says we have development India in past 10 years. Bro, even I am paying 30% income tax, the problem is in our area there is no public infrastructure or even any facilities. Not even roads and streets lights from government. Not parks for children nearby, no public transport, no government schools (worst conditions) why will I pay tax? To let these politicians enjoy their luxury? Exactly. Dude even bloody health insurance is taxed. Bacha kya he? For the amount of money we are paying. What d f are we even getting. For that matter what the f are the people who r supposed to be getting the benefits are getting? Kuch nai. But politicians are growing richer as the days pass. Help me understand! RBI procedures aren't my strong suit What do you think the government will do/is supposed to do with the dividend it gets from the RBI? Smh That wasn't my question! Elections over. Now time to milk the cow. Yes, bloody health insurance is also under gst. It’s a basic need these days seeing the pandemic and cancer and other diseases so common now, it should be out of any kind of taxation. Wait till you find out 28% on ACs and 18% on health insurance in case you havent. Why isnt this comment on top? PIN THIS! This tax has been in place since 2021. Yeah I've been ranting about the 18% on health insurance for a while. What total bastards, as if this is for entertainment or fun that we have to take health insurance. It's called enterpreneurship and pulling yourself up by the bootstraps /s no wonder tax law is a stable career choice in india"
}