{
    "id": "194s6jd",
    "title": "Merely Watching Child Pornography Not An Offence Under POCSO Act Or Section 67B Information Technology Act: Madras High Court",
    "url": "https://www.livelaw.in/high-court/madras-high-court/watching-child-pornography-not-offence-under-pocso-act-madras-high-court-246551",
    "selftext": "What now ? Even possession should be considered an offence but here we are...",
    "flair": "Law & Courts",
    "score": 207,
    "num_comments": 65,
    "created_utc": 1705056226.0,
    "convurl": "https://external-preview.redd.it/DeFDLmYNRDW0mezTY1IW8imYJfxuIP-OC7qdkVVZBW8.jpg?auto=webp&s=be05f4e9efbfc882cd000b38cd4622c9df0c6d18",
    "comments": [
        "Possessing Weed/cannabis is an offence but possessing CP isn't.. where the fk are we going as a society !?",
        "Madras High Court is giving stupid decisions for a while now",
        "Everyday we stray further from God's light....",
        "Holy shitballs Batman!\n\nSeriously though, I fully agree.",
        "well if u think like for example, ur in a big whatsapp group..suddenly some guy decided to post CP inbetween.so if there are 1000s of people who click on the blurred download link..it shall download to phone and u watch it before closing..can all 1000 be arrested??\nlaw can be  misused like that..\n\nbut for admins/creators of CP  and those spreading should get maximum punishement.",
        "Glad that grandpa Einstein concurs !",
        "Thank you friendly Redditor! Peace and love from the US!",
        "Well.. if this was the case here then we would have knows ! \n\nBut what you have said could certainly be happening in the future in light of this judgement..",
        "So when you coming to town, I mean Tamilnadu/Madras !",
        "If someone has seen CP intentionally or unintentionally, he/she must report to the concerned portals/authorities.\n\nIf you fail to do so, you risk getting charged with appropriate sections of the BNS.",
        "Yhis judgement should be challenged ASAP ",
        "Their name is definitely in the list",
        "Very logical.\n\nIf we listen to retards then watching a murder video should also be offence.",
        "We need to have a look at the judges devices 🤨🤨 no sane person would think like this.",
        "Probably never. Unfortunately I'm a poor.",
        "I wish I could travel there though.",
        "If those people don’t delete it off their phone then they are guilty of both possession and downloading CP. If they don’t report the video and the person/account that shared it then they are even more guilty. How anyone in such a situation could just shrug their shoulders and ignore it is beyond me. Each time one of those images/videos gets shared it’s another violation of the victim and makes it more likely that their abuse will forever be available to perverts on the internet.",
        "WHAT!!! By watching porn you are creating demand for child porn? Is that not straight forward?",
        "> Justice Anand Venkatesh noted that to attract the offences under the POCSO Act, a child or children must have been used for pornography purposes.\n\nI don't understand this decision.it sounds like only producing CP is a crime (what else would \"using a child\" mean). So the ruling is saying that posting and distrubuting CP is not a crime? That can't be true. Or may be it is a crime under another act?",
        "OP failed to understand the depth of judgement.",
        "I'm sure you don't know how internet works.\n\nHere's an explainer, I can literally embed a video in an email and you wouldn't realise it's their while video plays in background and you'll be guilty on both counts.\n\nSimilarly for telegram groups \n\nSame way I can just throw a dvd into your compound and have you arrested",
        "That’s why I said download. What you’re essentially arguing for is a carte blanche for offenders to horde CP as long as they don’t create it themselves. That’s a complete spit in the face to the many, many victims of child abuse images. \n\n> Same way I can just throw a dvd into your compound and have you arrested\n\nThat’s an utterly nonsensical example. If such a dvd were thrown over the wall of my compound I’d report it immediately so the one who threw it (and this had it in their possession) could be investigated. I’d find it highly suspicious if someone did not report such material immediately.  If you’re unaware that it’s there and the person who threw it reported it immediately then you would have more than enough grounds for reasonable doubt to have the case dismissed (if it even got that far) and the obvious question would be ‘why did the person reporting it know it was there?’\n\nPossession of child abuse material is an absolutely reprehensible and violent crime. I find it staggering that someone would argue otherwise. Such material exists because there are people who want to possess it therefore they hold just as much guilt for it’s existence",
        "Full PDF TL;Dr: Police were tipped off by someone. Police seized phone of 28 yo, find much porn. Selected two porn videos where involved persons who were male minors. Police charged him under POSCO 14.1.   \n\n\nCourt points out that 14.1 says \"(1) Whoever uses a child or children for pornographic purposes shall be punished with imprisonment for a term which shall not be less than five years and shall also be liable to fine and in the event of second or subsequent conviction with imprisonment for a term which shall not be less than seven years and also be liable to fine\".  \n\n\nCourts says watching a video is not same \"using a child\". Court finds no evidence of transmission. Accused agrees he has an addiction and agrees to seek help.   \n\n\nNow, possession of CP is actually criminalized under POSCO Sec 15.1, if found on personal device first offence carries Rs. 5000/- min. Commercial level transmission is under 15.3 and carries 10 years. P2P transmission under Sec 15.2 carries 3 years. The police messed up its case filing. Blame the police.",
        "What is BNS?",
        "Read my other comment. It is still illegal. The police charged him under the wrong section.",
        "Producing, posting, buying, selling, possession (if you have failed to delete i.e caught red-handed), and distributing CP is still a crime around India. Police arrested many people over the past few years and even recently if you search the news articles. People who were arrested specifically come under the categories I mentioned above.",
        "Bhartiya Nyay Samhita",
        "not sure why are you getting downloaded ",
        "This is not a great anology. Unlike a murder, CP is made to be watched. What you've said gives off the impression that only the abusers are in the wrong here and not the consumers of the content produced by them which certainly isn't true.",
        "Unless you are in law enforcement trying to catch the criminals or have stumbled upon CP by mistake, watching CP should be an offence.",
        "Well by your analogy a person buying weed and using it in private in their own home should be jailed for 10 yrs with rapists and murderers which is ridiculous.\n\nSame with cp. If a law can be misused easily then it's probably being up misused all the time.\n\nPossessing and viewing cp shouldn't be illegal.",
        "> Possessing and viewing cp shouldn't be illegal.\n\nDid you just typed that???",
        "Yes I'm a female doctor, with an interest in psychology and I did type that.",
        "Who you are matters not here. You've said above something about jailing weed consumers with rapist and murderers. How does that even relate to this here? Please elaborate how you're comparing weed, rapist and muderers here to the situation at hand. I can't wrap my head around it. CP consumers are actively consuming illegal stuff which results in more of it being produced at the expense of the children. Weed consumers only harm themselves in the end.",
        "That's what my point is .it should all be illegal but the judge's  statement doesn't say that. It is a poorly worded statement for sure.",
        "I'm saying possessing and possessing CP shouldn't be a crime.",
        "Viewing I can understand. One can definitely come across CP by accident. But possessing?? That is literally encouraging such content.",
        "Viewing is same as possessing.\n\nIf you view that means it gets downloaded to your device.\n\nAlso cp includes consensually made videos between teens!!!!!!\n\nHalf of today's youngsters will be in jail.",
        "By viewing I mean accidentally ofcourse. If someone download it to view it to fullfill their absolutely disgusting sexual desires of seeing underage children involved in sexual acts most likely without their consent then that person absolutely is a criminal!!!\n\nAnd sure CP includes consensually made videos between more than mature teens but it also includes 100% child rape videos too. \n\nSure the laws aren't perfect. I believe in the US you could get yourself arrested for possessing your own indesent content from when you were underage but that is no excuse for decriminalizing possessing of CP.",
        "You are right..guess I got a bit carried away by the sensational headline of the article but also because Judges are known to gave set bad Precedents, thought it was one such case.",
        "You can't view unless you are downloading something. In the background of a streaming app, it usually downloads the data packets to reconstruct the media for you to be played on the viewing window of the application. So, yes, it comes under possession. \n\nThe best thing a person can do in India is get rid of the media if they downloaded it intentionally or unintentionally that one time as POCSO section 15 explicitly mentioned if a person found to have deleted the media and had no intent of transmission, or distribution then they will not be charged.",
        "Finally the collection prevails",
        "Prolly IT cell !",
        "I just have a doubt......do you get arrested and prosecuted for searching child porn on the internet and watching it ( not downloading) or do you get arrested just for having possession of it on your phone (downloaded)",
        "Wow what a retarded judgement",
        "There is no depth. Even keeping cp leads to demand for such things which creates a market for it, meaning children will be made to be involved without their consent. Its banned in most of the educated world for a reason",
        "Creating demand for cp by keeping or watching it leads to children being forced to be involved in the creation which is wrong on 1000 levels bcz unlike adults there is no consent or understanding",
        "the point he is making is that this law can be used maliciously by government agencies and others, they can send the material to your devices without you even knowing it, and arresting you for it, western agencies have been accused of doing this in the past.",
        "If you will search for it on the \"normal internet\" or surface-web then one thing is for sure your IP and other personal info is certainly going to be on the radar of law enforcements!",
        "Almost every country in the developed world has strict laws against the downloading and possession of child abuse images. It’s a very, very weak excuse. \n\nOn the other hand, every day thousands and thousands of children in India and elsewhere are sexually abused in order to satisfy the demand for these videos and images. Each time those videos/images are viewed it’s another assault on those victims. It’s honestly staggering to me that anyone could argue that it should not be illegal to download and possess such images. I’ll happily eat the downvotes for saying so as well because I sincerely feel that to say anything else is so disgusting and immoral that I’d want no association whatsoever",
        "genuine question. if cp is made from ai, should it be legal or illegal? should cp drawings/hentai be legal or illegal? cuz no child is harmed in that.",
        "Weed and cannabis shouldn't be an offense. Internet is a pandoras box. You can't control ot.",
        "Brah you keep using the word \"download\" without realizing that in p2p transactions when someone sends you something, you download it.Those good morning messages you get from your relatives, downloaded. So if someone sends you explicit material, you downloaded it. You watch insta shorts or YT reels? You downloaded them all. You have zero control on what for downloaded but you did.\n\nNo one is arguing that it's okay to make or spread cp. But possession based on downloading is pretty dumb and is regularly abused by those in power",
        "🤢🤮",
        "Possessing a child will be sure an offence. Possessing photo/video of weed isn't a offence..\n\nNo supporting CP but your logic/example is flawed fo this case.",
        "Not an Indian lawyer, but Aussie chiming in. We use the phrase CSAM here, which stands for Child Sexual Abuse Material. It includes anything that represents a minor in a sexual way basically, so drawn images are included in the category of CSAM. There was a big hubbub about this specifically in relation to hentai a while back. In the USA, however, there was a case that I believe involved a drawing of Lisa Simpson that set a precedent excluding drawn content.\n\n\n\nFrom a psychological point of view, accessing this sort of material could encourage an individual to continue indulging in thoughts that normalise the perception of children in a sexual way. I know that's a slippery slope fallacy to an extent but there's evidence to support that it's a part of how we think. The issue with AI gen is that there could be real CSAM being used to train an AI to create images. It is also likely far more realistic than what an artist would make themselves, which further exacerbates the psychological issue above.\n\n\n\nLastly, chiming in as a person of Indian birth, it's clear that in such a populous country with such a profound wealth divide it is easy to exploit vulnerable people, which of course includes children. I firmly believe that there is an inherent element to pedophilia, and that some people are either born that way or predisposed to develop those tendencies. Unfortunately, their sexual desires cannot be acted upon without harming others, although I'm sure many people like this do not act upon their urges as they are also conscious it is going to harm a child irreparably. A certain percentage of the population are therefore, definitely inclined to view children in a sexual way and making it both harder and riskier to access content that might take someone who otherwise wouldn't offend over the edge is necessary. \n\n\nAs a quick addendum, I also think confidential therapy for people who find themselves attracted to children is also essential, but many other nations with a more progressive national view of mental health issues struggle with this so I don't see it as a realistic short or mid term goal for India (or even Australia).",
        ">telegram\n\nTelegram is quite notorious for these kind of things.\n\n\nOne day, you are in a Jack Sparrow group. The next day it becomes Epstein Island.",
        "The fuck is wrong with you?"
    ],
    "cleaned_text": "merely watching child pornography offence pocso act section b information technology act madras high court even possession considered offence ",
    "cleaned_title": "merely watching child pornography offence pocso act section b information technology act madras high court",
    "cleaned_selftext": "even possession considered offence",
    "cleaned_comments": "possessing weedcannabis offence possessing cp isnt fk going society madras high court giving stupid decisions everyday stray gods light holy shitballs batman seriously though fully agree well u think like example ur big whatsapp groupsuddenly guy decided post cp inbetweenso people click blurred download linkit shall download phone u watch closingcan arrested law misused like adminscreators cp spreading get maximum punishement glad grandpa einstein concurs thank friendly redditor peace love us well case would knows said could certainly happening future light judgement coming town mean tamilnadumadras someone seen cp intentionally unintentionally heshe must report concerned portalsauthorities fail risk getting charged appropriate sections bns yhis judgement challenged asap name definitely list logical listen retards watching murder video also offence need look judges devices sane person would think like probably never unfortunately im poor wish could travel though people dont delete phone guilty possession downloading cp dont report video personaccount shared even guilty anyone situation could shrug shoulders ignore beyond time one imagesvideos gets shared another violation victim makes likely abuse forever available perverts internet watching porn creating demand child porn straight forward justice anand venkatesh noted attract offences pocso act child children must used pornography purposes dont understand decisionit sounds like producing cp crime else would using child mean ruling saying posting distrubuting cp crime cant true may crime another act op failed understand depth judgement im sure dont know internet works heres explainer literally embed video email wouldnt realise video plays background youll guilty counts similarly telegram groups way throw dvd compound arrested thats said download youre essentially arguing carte blanche offenders horde cp long dont create thats complete spit face many many victims child abuse images way throw dvd compound arrested thats utterly nonsensical example dvd thrown wall compound id report immediately one threw possession could investigated id find highly suspicious someone report material immediately youre unaware person threw reported immediately would enough grounds reasonable doubt case dismissed even got far obvious question would person reporting know possession child abuse material absolutely reprehensible violent crime find staggering someone would argue otherwise material exists people want possess therefore hold much guilt existence full pdf tldr police tipped someone police seized phone yo find much porn selected two porn videos involved persons male minors police charged posco court points says whoever uses child children pornographic purposes shall punished imprisonment term shall less five years shall also liable fine event second subsequent conviction imprisonment term shall less seven years also liable fine courts says watching video using child court finds evidence transmission accused agrees addiction agrees seek help possession cp actually criminalized posco sec found personal device first offence carries rs min commercial level transmission carries years pp transmission sec carries years police messed case filing blame police bns read comment still illegal police charged wrong section producing posting buying selling possession failed delete ie caught redhanded distributing cp still crime around india police arrested many people past years even recently search news articles people arrested specifically come categories mentioned bhartiya nyay samhita sure getting downloaded great anology unlike murder cp made watched youve said gives impression abusers wrong consumers content produced certainly isnt true unless law enforcement trying catch criminals stumbled upon cp mistake watching cp offence well analogy person buying weed using private home jailed yrs rapists murderers ridiculous cp law misused easily probably misused time possessing viewing cp shouldnt illegal possessing viewing cp shouldnt illegal typed yes im female doctor interest psychology type matters youve said something jailing weed consumers rapist murderers even relate please elaborate youre comparing weed rapist muderers situation hand cant wrap head around cp consumers actively consuming illegal stuff results produced expense children weed consumers harm end thats point illegal judges statement doesnt say poorly worded statement sure im saying possessing possessing cp shouldnt crime viewing understand one definitely come across cp accident possessing literally encouraging content viewing possessing view means gets downloaded device also cp includes consensually made videos teens half todays youngsters jail viewing mean accidentally ofcourse someone download view fullfill absolutely disgusting sexual desires seeing underage children involved sexual acts likely without consent person absolutely criminal sure cp includes consensually made videos mature teens also includes child rape videos sure laws arent perfect believe us could get arrested possessing indesent content underage excuse decriminalizing possessing cp rightguess got bit carried away sensational headline article also judges known gave set bad precedents thought one case cant view unless downloading something background streaming app usually downloads data packets reconstruct media played viewing window application yes comes possession best thing person india get rid media downloaded intentionally unintentionally one time pocso section explicitly mentioned person found deleted media intent transmission distribution charged finally collection prevails prolly cell doubtdo get arrested prosecuted searching child porn internet watching downloading get arrested possession phone downloaded wow retarded judgement depth even keeping cp leads demand things creates market meaning children made involved without consent banned educated world reason creating demand cp keeping watching leads children forced involved creation wrong levels bcz unlike adults consent understanding point making law used maliciously government agencies others send material devices without even knowing arresting western agencies accused past search normal internet surfaceweb one thing sure ip personal info certainly going radar law enforcements almost every country developed world strict laws downloading possession child abuse images weak excuse hand every day thousands thousands children india elsewhere sexually abused order satisfy demand videos images time videosimages viewed another assault victims honestly staggering anyone could argue illegal download possess images ill happily eat downvotes saying well sincerely feel say anything else disgusting immoral id want association whatsoever genuine question cp made ai legal illegal cp drawingshentai legal illegal cuz child harmed weed cannabis shouldnt offense internet pandoras box cant control ot brah keep using word download without realizing pp transactions someone sends something download itthose good morning messages get relatives downloaded someone sends explicit material downloaded watch insta shorts yt reels downloaded zero control downloaded one arguing okay make spread cp possession based downloading pretty dumb regularly abused power possessing child sure offence possessing photovideo weed isnt offence supporting cp logicexample flawed fo case indian lawyer aussie chiming use phrase csam stands child sexual abuse material includes anything represents minor sexual way basically drawn images included category csam big hubbub specifically relation hentai back usa however case believe involved drawing lisa simpson set precedent excluding drawn content psychological point view accessing sort material could encourage individual continue indulging thoughts normalise perception children sexual way know thats slippery slope fallacy extent theres evidence support part think issue ai gen could real csam used train ai create images also likely far realistic artist would make exacerbates psychological issue lastly chiming person indian birth clear populous country profound wealth divide easy exploit vulnerable people course includes children firmly believe inherent element pedophilia people either born way predisposed develop tendencies unfortunately sexual desires acted upon without harming others although im sure many people like act upon urges also conscious going harm child irreparably certain percentage population therefore definitely inclined view children sexual way making harder riskier access content might take someone otherwise wouldnt offend edge necessary quick addendum also think confidential therapy people find attracted children also essential many nations progressive national view mental health issues struggle dont see realistic short mid term goal india even australia telegram telegram quite notorious kind things one day jack sparrow group next day becomes epstein island fuck wrong",
    "light_cleaned_title": "Merely Watching Child Pornography Not An Offence Under POCSO Act Or Section 67B Information Technology Act: Madras High Court",
    "light_cleaned_selftext": "What now ? Even possession should be considered an offence but here we are...",
    "light_cleaned_comments": "Possessing Weed/cannabis is an offence but possessing CP isn't.. where the fk are we going as a society !? Madras High Court is giving stupid decisions for a while now Everyday we stray further from God's light.... Holy shitballs Batman! Seriously though, I fully agree. well if u think like for example, ur in a big whatsapp group..suddenly some guy decided to post CP inbetween.so if there are 1000s of people who click on the blurred download link..it shall download to phone and u watch it before closing..can all 1000 be arrested?? law can be misused like that.. but for admins/creators of CP and those spreading should get maximum punishement. Glad that grandpa Einstein concurs ! Thank you friendly Redditor! Peace and love from the US! Well.. if this was the case here then we would have knows ! But what you have said could certainly be happening in the future in light of this judgement.. So when you coming to town, I mean Tamilnadu/Madras ! If someone has seen CP intentionally or unintentionally, he/she must report to the concerned portals/authorities. If you fail to do so, you risk getting charged with appropriate sections of the BNS. Yhis judgement should be challenged ASAP Their name is definitely in the list Very logical. If we listen to retards then watching a murder video should also be offence. We need to have a look at the judges devices 🤨🤨 no sane person would think like this. Probably never. Unfortunately I'm a poor. I wish I could travel there though. If those people don’t delete it off their phone then they are guilty of both possession and downloading CP. If they don’t report the video and the person/account that shared it then they are even more guilty. How anyone in such a situation could just shrug their shoulders and ignore it is beyond me. Each time one of those images/videos gets shared it’s another violation of the victim and makes it more likely that their abuse will forever be available to perverts on the internet. WHAT!!! By watching porn you are creating demand for child porn? Is that not straight forward? > Justice Anand Venkatesh noted that to attract the offences under the POCSO Act, a child or children must have been used for pornography purposes. I don't understand this decision.it sounds like only producing CP is a crime (what else would \"using a child\" mean). So the ruling is saying that posting and distrubuting CP is not a crime? That can't be true. Or may be it is a crime under another act? OP failed to understand the depth of judgement. I'm sure you don't know how internet works. Here's an explainer, I can literally embed a video in an email and you wouldn't realise it's their while video plays in background and you'll be guilty on both counts. Similarly for telegram groups Same way I can just throw a dvd into your compound and have you arrested That’s why I said download. What you’re essentially arguing for is a carte blanche for offenders to horde CP as long as they don’t create it themselves. That’s a complete spit in the face to the many, many victims of child abuse images. > Same way I can just throw a dvd into your compound and have you arrested That’s an utterly nonsensical example. If such a dvd were thrown over the wall of my compound I’d report it immediately so the one who threw it (and this had it in their possession) could be investigated. I’d find it highly suspicious if someone did not report such material immediately. If you’re unaware that it’s there and the person who threw it reported it immediately then you would have more than enough grounds for reasonable doubt to have the case dismissed (if it even got that far) and the obvious question would be ‘why did the person reporting it know it was there?’ Possession of child abuse material is an absolutely reprehensible and violent crime. I find it staggering that someone would argue otherwise. Such material exists because there are people who want to possess it therefore they hold just as much guilt for it’s existence Full PDF TL;Dr: Police were tipped off by someone. Police seized phone of 28 yo, find much porn. Selected two porn videos where involved persons who were male minors. Police charged him under POSCO 14.1. Court points out that 14.1 says \"(1) Whoever uses a child or children for pornographic purposes shall be punished with imprisonment for a term which shall not be less than five years and shall also be liable to fine and in the event of second or subsequent conviction with imprisonment for a term which shall not be less than seven years and also be liable to fine\". Courts says watching a video is not same \"using a child\". Court finds no evidence of transmission. Accused agrees he has an addiction and agrees to seek help. Now, possession of CP is actually criminalized under POSCO Sec 15.1, if found on personal device first offence carries Rs. 5000/- min. Commercial level transmission is under 15.3 and carries 10 years. P2P transmission under Sec 15.2 carries 3 years. The police messed up its case filing. Blame the police. What is BNS? Read my other comment. It is still illegal. The police charged him under the wrong section. Producing, posting, buying, selling, possession (if you have failed to delete i.e caught red-handed), and distributing CP is still a crime around India. Police arrested many people over the past few years and even recently if you search the news articles. People who were arrested specifically come under the categories I mentioned above. Bhartiya Nyay Samhita not sure why are you getting downloaded This is not a great anology. Unlike a murder, CP is made to be watched. What you've said gives off the impression that only the abusers are in the wrong here and not the consumers of the content produced by them which certainly isn't true. Unless you are in law enforcement trying to catch the criminals or have stumbled upon CP by mistake, watching CP should be an offence. Well by your analogy a person buying weed and using it in private in their own home should be jailed for 10 yrs with rapists and murderers which is ridiculous. Same with cp. If a law can be misused easily then it's probably being up misused all the time. Possessing and viewing cp shouldn't be illegal. > Possessing and viewing cp shouldn't be illegal. Did you just typed that??? Yes I'm a female doctor, with an interest in psychology and I did type that. Who you are matters not here. You've said above something about jailing weed consumers with rapist and murderers. How does that even relate to this here? Please elaborate how you're comparing weed, rapist and muderers here to the situation at hand. I can't wrap my head around it. CP consumers are actively consuming illegal stuff which results in more of it being produced at the expense of the children. Weed consumers only harm themselves in the end. That's what my point is .it should all be illegal but the judge's statement doesn't say that. It is a poorly worded statement for sure. I'm saying possessing and possessing CP shouldn't be a crime. Viewing I can understand. One can definitely come across CP by accident. But possessing?? That is literally encouraging such content. Viewing is same as possessing. If you view that means it gets downloaded to your device. Also cp includes consensually made videos between teens!!!!!! Half of today's youngsters will be in jail. By viewing I mean accidentally ofcourse. If someone download it to view it to fullfill their absolutely disgusting sexual desires of seeing underage children involved in sexual acts most likely without their consent then that person absolutely is a criminal!!! And sure CP includes consensually made videos between more than mature teens but it also includes 100% child rape videos too. Sure the laws aren't perfect. I believe in the US you could get yourself arrested for possessing your own indesent content from when you were underage but that is no excuse for decriminalizing possessing of CP. You are right..guess I got a bit carried away by the sensational headline of the article but also because Judges are known to gave set bad Precedents, thought it was one such case. You can't view unless you are downloading something. In the background of a streaming app, it usually downloads the data packets to reconstruct the media for you to be played on the viewing window of the application. So, yes, it comes under possession. The best thing a person can do in India is get rid of the media if they downloaded it intentionally or unintentionally that one time as POCSO section 15 explicitly mentioned if a person found to have deleted the media and had no intent of transmission, or distribution then they will not be charged. Finally the collection prevails Prolly IT cell ! I just have a doubt......do you get arrested and prosecuted for searching child porn on the internet and watching it ( not downloading) or do you get arrested just for having possession of it on your phone (downloaded) Wow what a retarded judgement There is no depth. Even keeping cp leads to demand for such things which creates a market for it, meaning children will be made to be involved without their consent. Its banned in most of the educated world for a reason Creating demand for cp by keeping or watching it leads to children being forced to be involved in the creation which is wrong on 1000 levels bcz unlike adults there is no consent or understanding the point he is making is that this law can be used maliciously by government agencies and others, they can send the material to your devices without you even knowing it, and arresting you for it, western agencies have been accused of doing this in the past. If you will search for it on the \"normal internet\" or surface-web then one thing is for sure your IP and other personal info is certainly going to be on the radar of law enforcements! Almost every country in the developed world has strict laws against the downloading and possession of child abuse images. It’s a very, very weak excuse. On the other hand, every day thousands and thousands of children in India and elsewhere are sexually abused in order to satisfy the demand for these videos and images. Each time those videos/images are viewed it’s another assault on those victims. It’s honestly staggering to me that anyone could argue that it should not be illegal to download and possess such images. I’ll happily eat the downvotes for saying so as well because I sincerely feel that to say anything else is so disgusting and immoral that I’d want no association whatsoever genuine question. if cp is made from ai, should it be legal or illegal? should cp drawings/hentai be legal or illegal? cuz no child is harmed in that. Weed and cannabis shouldn't be an offense. Internet is a pandoras box. You can't control ot. Brah you keep using the word \"download\" without realizing that in p2p transactions when someone sends you something, you download it.Those good morning messages you get from your relatives, downloaded. So if someone sends you explicit material, you downloaded it. You watch insta shorts or YT reels? You downloaded them all. You have zero control on what for downloaded but you did. No one is arguing that it's okay to make or spread cp. But possession based on downloading is pretty dumb and is regularly abused by those in power 🤢🤮 Possessing a child will be sure an offence. Possessing photo/video of weed isn't a offence.. No supporting CP but your logic/example is flawed fo this case. Not an Indian lawyer, but Aussie chiming in. We use the phrase CSAM here, which stands for Child Sexual Abuse Material. It includes anything that represents a minor in a sexual way basically, so drawn images are included in the category of CSAM. There was a big hubbub about this specifically in relation to hentai a while back. In the USA, however, there was a case that I believe involved a drawing of Lisa Simpson that set a precedent excluding drawn content. From a psychological point of view, accessing this sort of material could encourage an individual to continue indulging in thoughts that normalise the perception of children in a sexual way. I know that's a slippery slope fallacy to an extent but there's evidence to support that it's a part of how we think. The issue with AI gen is that there could be real CSAM being used to train an AI to create images. It is also likely far more realistic than what an artist would make themselves, which further exacerbates the psychological issue above. Lastly, chiming in as a person of Indian birth, it's clear that in such a populous country with such a profound wealth divide it is easy to exploit vulnerable people, which of course includes children. I firmly believe that there is an inherent element to pedophilia, and that some people are either born that way or predisposed to develop those tendencies. Unfortunately, their sexual desires cannot be acted upon without harming others, although I'm sure many people like this do not act upon their urges as they are also conscious it is going to harm a child irreparably. A certain percentage of the population are therefore, definitely inclined to view children in a sexual way and making it both harder and riskier to access content that might take someone who otherwise wouldn't offend over the edge is necessary. As a quick addendum, I also think confidential therapy for people who find themselves attracted to children is also essential, but many other nations with a more progressive national view of mental health issues struggle with this so I don't see it as a realistic short or mid term goal for India (or even Australia). >telegram Telegram is quite notorious for these kind of things. One day, you are in a Jack Sparrow group. The next day it becomes Epstein Island. The fuck is wrong with you?"
}