{
    "id": "14l348k",
    "title": "Not every thing is Islamophobia",
    "url": "https://i.redd.it/gz0l43dxrp8b1.jpg",
    "selftext": "Saw this [post on twitter](https://twitter.com/meerfaisal01/status/1673914724126429184?s=46&t=QffA4qwQIzlcmKVsIfTrzA) and I immediately hated how every criticism of Islam is looked at as islamaphobic. \n\nLook Il be the first one to admit I love myself some mutton/lamb. But the act of sacrificing an animal in a housing society is absolutely barbaric and opposing such an act isn’t islamaphobic.",
    "flair": "Rant / Vent",
    "score": 78,
    "num_comments": 71,
    "created_utc": 1687938552.0,
    "convurl": "https://i.redd.it/gz0l43dxrp8b1.jpg",
    "comments": [
        "Have provided link in text",
        "Should have brought a deer, like Shree Ram. I agree this is a violent act and the sacrifice itself shouldn't be done in the presence of other members of society. But rioting because of this and chanting jai shree ram doesn't make any other sense. It's communal .",
        "Bringing a live animal for butchering at home in an apartment is being inconsiderate towards neighbours.\n\nIf they were opposing it on grounds of inconsideration or animal rights, then they'd be shouting relevant slogans.\n\nBut since the slogan being shouted is jai shri ram, it makes it very much a case of Islamophobia. Pretending it's not is just masking the actual motivations here.\n\nAnd if the animal wasn't live at all but just its meat, then it's definitely a case of Islamophobia *and* disinformation.",
        "I should add something here. I don't know what's the location of this incident, but in my state, bringing an animal home to grow and then sacrifice (to devi) isn't uncommon for hindus either. But it's mainly male goats and cocks (male chicken), not lambs. I know it's cruel and nonsense, but done in the name of ritual.",
        "Again, why are they chanting Jai Shree Ram?",
        "Yes, it is pretty shitty and peak dehati move to slaughter animal in a housing society - it's a different story if you have your own house in your own private land. We've slaughtered animals too, for the animistic ritual of bhoota-kola in my native land in our own head family's property. But the war-cry weaponization of Lord Ram is a hint towards Islamophobia, let's not pretend that. If they were civil enough, this could have been bought up in a better manner.",
        "\n\n\nNice joke. Hindu mob shouting Jai Shri Ram at a Muslim family is not Islamophobia.\n\n>But the act of sacrificing an animal in a housing society is absolutely barbaric and opposing such an act isn’t islamaphobic. \n\nLynching muslims for beef is okay. But not sacrificing animals for eating\n\n\nhttps://m.timesofindia.com/city/nashik/meat-transporter-killed-by-mob-in-nashik-11-arrested/articleshow/101264838.cms\n\nhttps://www.ndtv.com/cities/neighbours-object-as-man-brings-goat-home-in-housing-society-cops-called-4158899\n\n>The police official said the man informs the police every year in advance about the procedure of bringing a goat to his house ahead of Bakrid as he has no other place to keep it.\n\n>The man takes the goat away the next day and the animal is not slaughtered at his residence,\" the official clarified",
        "He is not butchering it there.\n\nThe festival is tomorrow. He brought it today and he will take it to the butcher shop to get it slaughtered tomorrow morning.\n\n\n\nhttps://www.ndtv.com/cities/neighbours-object-as-man-brings-goat-home-in-housing-society-cops-called-4158899\n\n>The police official said the man informs the police every year in advance about the procedure of bringing a goat to his house ahead of Bakrid as he has no other place to keep it.\n\n\nThe man takes the goat away the next day and the animal is not slaughtered at his residence,\" the official clarified",
        "More brain-dead people.",
        "People be reposting tweets here without bare minimum context",
        "I am anti-religion but everything is Islamophobia to Islam followers.  If I say a 54 year old person having sex with 9 year old is a pedophile, that is Islamophobia.\n\nNow a days, everything is Hinduphobia as well. If I say Hanuman couldn't have lifted mountain, it is Hinduphobia.\n\nWell done on following one of the most heinous scriptures in the world though. That includes Islamic & Hindu scriptures.",
        "This is Islamaphobia. He brought goat to his own home for slaughtering it next day. Why anyone have to interfere in it?",
        "Hmm, then the only violation may have been of some society bylaws maybe, like rules against keeping pets. Or maybe not even that. \n\nEither way, the slogans are nothing but Islamophobia.",
        "Put board \"Mutton biryani free\" and see how many turn up and stop shouting.",
        "I have seen this many times that I am immune to it. Not exactly Islam related and idgaf about them but even in Hindu and tribal communities, it's so common.",
        "The society *does not object on* keeping pets, i.e is pet friendly. A friend of mine lives there with a pet.\nEdit: spellings.",
        "*To take it to butcher and then slaughter. Not even in the society.",
        "Apparently he isn't slaughtering it at the place of residence. He informed the police beforehand, just keeps the goat at his flat because he can't keep it anywhere else.",
        "OP, you could’ve done bare minimum research on the news and found out how this was probably related to islamophobia. All you had to do was read the news article, and what the officials (police in the case) had to say. Not that hard, you know.",
        "No not even that. Police said that there were no society rules against bringing goats to your flat.\n\nhttps://www.aajtak.in/amp/india/maharashtra/story/mumbai-highrise-society-uproar-for-hours-over-two-goats-brought-for-on-bakrid-lcla-1724198-2023-06-28",
        "No he can't do that",
        "Where is JP housing society located??",
        "Not everything is Islamophobia, but this definitely is.",
        "That's actually how sacrifice meat is used. 1/3rd to poor people, 1/3rd for friends and family and 1/3rd for home. If their neighbours had good relations with them, they would definitely get either the meat or at least the biryani.",
        "Context matters and in this case it's definitely Islamophobia",
        "Why is it barbaric to slaughter an animal in his own home? \nIt's his goat. His home. If there is blood he is gonna clean it. It's not like he is gonna ooze it out so it reaches your doorstep.\n\nAnd what's with assuming that he does it in his own home. He may go to an appropriate place to do it. \n\nAnd why Jai Shri Ram? Just tell him what you think instead of organising a mob.",
        "What hypocrisy!!\n\nSame hindus who would gladly eat mutton biryani and mock veg biryani as pulao now have problem with the man bringing lamb to his house (even when the man has mentioned that he will not slaughter it at home but take it to the butcher the next day)!!",
        "is it possible to slaughter the animal in a housing society..peak dehati thought...people just create hypothetical scenario and blame without knowing the fact!",
        "I swear we Indians are such hypocrites. \n\nI'm willing to bet that most of those protestors consume meat.\n\nHeck India is one of the biggest exporters of Beef.",
        ">I'll be the first one to admit I love myself some mutton/lamb\n\nBut I have a problem when someone else wants to eat mutton/lamb because they're doing it in a way that doesn't sit right with me because of my own preconceived notions about what is clean/pure/right.\n\nIf you like eating meat please cook with it a few times. \n\nIt'll help rid you of the idea that the mutton you like to eat spontaneously appears on your plate from the ether.",
        " Opposing the act isn’t Islamophobia. Opposing the act while chanting JSR is. Know the difference idiot.",
        "In a mob of hundreds, a few would be just shouting right. Imagine if a man would have brought a pig for slaughter into the opposite demographic, he would be killed and his family lynched.",
        "OP must have been so convinced he is on the right, just by reading some tweet without fact checking he is here to outburst. Then turns out he was wrong, he didn't bring the lamb to slaughter at his residence like most Muslims who live in a housing society (not their own home) he would have taken the lamb to the slaughterhouse the next day, and the least violation would have been keeping the animal but society is even pet friendly so you can bring animals in. Now he looks like an idiot and Islamophobic. Poor OP.",
        "Op, don't let your befuddled head keep clouding your judgement, read up on the facts of a case before you get all wElL I EnJoy mutTon biRyAnI MySeLf BuT tHiS Is WrOnG",
        " Didn't expected this from right wingers. If they had cut that goat in the society then it would be understandable",
        "🤣🤣\n\nbakra phas gaya bechara!\n\nbakra be like : agle janam mohe zehreela saanp kijo!",
        "Is your living room open? I'd like to butcher a couple live animals there if you don't mind....",
        "Pretty standard route. I guess the suspicions snowballed into fear, anger and then hatred too quick.\n\nSeeing this pattern all across the world. Don’t like it.",
        "Lol, it's funny how grown adults can't watch animals get killed, but are totally fine eating it regularly.",
        "Please give an example of this happening somewhere, because I can conjure up all sorts of things up in the air too",
        "Just wanted to clarify \n\nI’m against butchering of animals in residential hosing colonies. That’s it. Objecting this isn’t islamaphobia I mean. I hate the BJP, I oppose Hindu rashtra. I do think there is a huge issue with islamaphobia in this country. I think the PM completely misanswered the question in the White House. \n\nbut not all acts of scrutinising Islam is islamaphobia. All religions have extremist elements to it. The act of sacrificing A WHOLE ASS GOAT IN A RESIDENTIAL HOUSING COLONY IS A FORM OF EXTREMISM. Opposing it isn’t Islamophobia.",
        "Not the guy who wrote this above but I think the moradabad riots started like this. This is old news, moradabad is a city in UP",
        "do you have the same objections to rangoli???? are you repulsed by ugly color that a bunch of people decide to draw everywhere in your building because of their religious beliefs???  \n\n\nwill you similarly call for a ban on it????  \n\n\nIf not then you have your answer listen there as an ex muslim there are plenty of things where the \"everything isn't islamophobia\" argument works  \n\n\nThis isn't it this is a bunch of backward barbaric zealots offended by the religious practice of one group while simultaneously to far up their own asses to see that how other people perceive their religious practice to be a nuisance  \n\n\nwhat about yoga enforcement in Indian schools  \n\n\nWhat about making people shout Bharat mata ki jai knowing full well that this is literally a violation of their faith????  \n\n\nWhat about large and obnoxious bhajans during different sorts of Puja's????",
        "I think he is right, they were shouting jsr but your original point is correct too, slaughtering a goat inside an apartment is kinda weird. The disinfection n cleaning would be messy. \n\nI remember I had seen a fish getting killed once with the anvil like knife thing. The blood spatter went over my uncle's clothes. I can imagine something like this happening if u do it inside the house. If you do it outside then it's kk for me but I can see y a lot of people might take offence to that.",
        "yes you’re right, but who said he’s slaughtering the said animal in his home? Eid is tomorrow in India, he’s going to take the lamb/goat to slaughterhouse tomorrow. why would he sacrifice the animal one day before eid? are you retarded?",
        "yes, as a muslim i would condemn it too if an idiot is slaughtering in his apartment, imagine the smell and the blood but apparently he got police permission to keep the goat/lamb for the day and then slaughter it tomorrow (at the slaughterhouse) after the eid prayer.",
        "If it was really going to a slaughterhouse then I don't see a problem here. Btw why do u need police permission for this?",
        "https://www.ndtv.com/cities/neighbours-object-as-man-brings-goat-home-in-housing-society-cops-called-4158899\n\n\nread this article.",
        "So ig sm1 would've spread fake news that he's gonna slaughter it in the society but if he did it every year then people should have corrected the info. If that part was communicated to the mob then it's defo just nuisance value or some1petty  trying to win the society elections",
        "If he was taking the goat to slaughter in a residential area(atho he was not), opposing it would not have been Islamophobia(altho I hate the word cuz sometimes muslims say this even when someone is criticising Islam or its practices and not demonising the people themselves). But these people clearly weren't there for animal rights or caring about residential rules but cuz of hate against a community since they were shouting JSR while doing this",
        "ijbol while reading your comment",
        "Is being afraid of religions a \"phobia\" though? I would say even in context of India only, it's totally reasonable to fear the religious folk.",
        "Phobia is irrational fear of something. Nothing phobic about rational fear of religious teachings which are ridiculous, illogical, unscientific and heinous at times."
    ],
    "cleaned_text": "every thing islamophobia saw post twitterhttpstwittercommeerfaisalstatusstqffaqwqizlcmkvsiftrza immediately hated every criticism islam looked islamaphobic look il first one admit love muttonlamb act sacrificing animal housing society absolutely barbaric opposing act isnt islamaphobic ",
    "cleaned_title": "every thing islamophobia",
    "cleaned_selftext": "saw post twitterhttpstwittercommeerfaisalstatusstqffaqwqizlcmkvsiftrza immediately hated every criticism islam looked islamaphobic look il first one admit love muttonlamb act sacrificing animal housing society absolutely barbaric opposing act isnt islamaphobic",
    "cleaned_comments": "provided link text brought deer like shree ram agree violent act sacrifice shouldnt done presence members society rioting chanting jai shree ram doesnt make sense communal bringing live animal butchering home apartment inconsiderate towards neighbours opposing grounds inconsideration animal rights theyd shouting relevant slogans since slogan shouted jai shri ram makes much case islamophobia pretending masking actual motivations animal wasnt live meat definitely case islamophobia disinformation add something dont know whats location incident state bringing animal home grow sacrifice devi isnt uncommon hindus either mainly male goats cocks male chicken lambs know cruel nonsense done name ritual chanting jai shree ram yes pretty shitty peak dehati move slaughter animal housing society different story house private land weve slaughtered animals animistic ritual bhootakola native land head familys property warcry weaponization lord ram hint towards islamophobia lets pretend civil enough could bought better manner nice joke hindu mob shouting jai shri ram muslim family islamophobia act sacrificing animal housing society absolutely barbaric opposing act isnt islamaphobic lynching muslims beef okay sacrificing animals eating police official said man informs police every year advance procedure bringing goat house ahead bakrid place keep man takes goat away next day animal slaughtered residence official clarified butchering festival tomorrow brought today take butcher shop get slaughtered tomorrow morning police official said man informs police every year advance procedure bringing goat house ahead bakrid place keep man takes goat away next day animal slaughtered residence official clarified braindead people people reposting tweets without bare minimum context antireligion everything islamophobia islam followers say year old person sex year old pedophile islamophobia days everything hinduphobia well say hanuman couldnt lifted mountain hinduphobia well done following one heinous scriptures world though includes islamic hindu scriptures islamaphobia brought goat home slaughtering next day anyone interfere hmm violation may society bylaws maybe like rules keeping pets maybe even either way slogans nothing islamophobia put board mutton biryani free see many turn stop shouting seen many times immune exactly islam related idgaf even hindu tribal communities common society object keeping pets ie pet friendly friend mine lives pet edit spellings take butcher slaughter even society apparently isnt slaughtering place residence informed police beforehand keeps goat flat cant keep anywhere else op couldve done bare minimum research news found probably related islamophobia read news article officials police case say hard know even police said society rules bringing goats flat cant jp housing society located everything islamophobia definitely thats actually sacrifice meat used rd poor people rd friends family rd home neighbours good relations would definitely get either meat least biryani context matters case definitely islamophobia barbaric slaughter animal home goat home blood gon na clean like gon na ooze reaches doorstep whats assuming home may go appropriate place jai shri ram tell think instead organising mob hypocrisy hindus would gladly eat mutton biryani mock veg biryani pulao problem man bringing lamb house even man mentioned slaughter home take butcher next day possible slaughter animal housing societypeak dehati thoughtpeople create hypothetical scenario blame without knowing fact swear indians hypocrites im willing bet protestors consume meat heck india one biggest exporters beef ill first one admit love muttonlamb problem someone else wants eat muttonlamb theyre way doesnt sit right preconceived notions cleanpureright like eating meat please cook times itll help rid idea mutton like eat spontaneously appears plate ether opposing act isnt islamophobia opposing act chanting jsr know difference idiot mob hundreds would shouting right imagine man would brought pig slaughter opposite demographic would killed family lynched op must convinced right reading tweet without fact checking outburst turns wrong didnt bring lamb slaughter residence like muslims live housing society home would taken lamb slaughterhouse next day least violation would keeping animal society even pet friendly bring animals looks like idiot islamophobic poor op op dont let befuddled head keep clouding judgement read facts case get well enjoy mutton biryani wrong didnt expected right wingers cut goat society would understandable bakra phas gaya bechara bakra like agle janam mohe zehreela saanp kijo living room open id like butcher couple live animals dont mind pretty standard route guess suspicions snowballed fear anger hatred quick seeing pattern across world dont like lol funny grown adults cant watch animals get killed totally fine eating regularly please give example happening somewhere conjure sorts things air wanted clarify im butchering animals residential hosing colonies thats objecting isnt islamaphobia mean hate bjp oppose hindu rashtra think huge issue islamaphobia country think pm completely misanswered question white house acts scrutinising islam islamaphobia religions extremist elements act sacrificing whole ass goat residential housing colony form extremism opposing isnt islamophobia guy wrote think moradabad riots started like old news moradabad city objections rangoli repulsed ugly color bunch people decide draw everywhere building religious beliefs similarly call ban answer listen ex muslim plenty things everything isnt islamophobia argument works isnt bunch backward barbaric zealots offended religious practice one group simultaneously far asses see people perceive religious practice nuisance yoga enforcement indian schools making people shout bharat mata ki jai knowing full well literally violation faith large obnoxious bhajans different sorts pujas think right shouting jsr original point correct slaughtering goat inside apartment kinda weird disinfection n cleaning would messy remember seen fish getting killed anvil like knife thing blood spatter went uncles clothes imagine something like happening u inside house outside kk see lot people might take offence yes youre right said hes slaughtering said animal home eid tomorrow india hes going take lambgoat slaughterhouse tomorrow would sacrifice animal one day eid retarded yes muslim would condemn idiot slaughtering apartment imagine smell blood apparently got police permission keep goatlamb day slaughter tomorrow slaughterhouse eid prayer really going slaughterhouse dont see problem btw u need police permission read article ig sm wouldve spread fake news hes gon na slaughter society every year people corrected info part communicated mob defo nuisance value somepetty trying win society elections taking goat slaughter residential areaatho opposing would islamophobiaaltho hate word cuz sometimes muslims say even someone criticising islam practices demonising people people clearly werent animal rights caring residential rules cuz hate community since shouting jsr ijbol reading comment afraid religions phobia though would say even context india totally reasonable fear religious folk phobia irrational fear something nothing phobic rational fear religious teachings ridiculous illogical unscientific heinous times",
    "light_cleaned_title": "Not every thing is Islamophobia",
    "light_cleaned_selftext": "Saw this [post on twitter](https://twitter.com/meerfaisal01/status/1673914724126429184?s=46&t=QffA4qwQIzlcmKVsIfTrzA) and I immediately hated how every criticism of Islam is looked at as islamaphobic. Look Il be the first one to admit I love myself some mutton/lamb. But the act of sacrificing an animal in a housing society is absolutely barbaric and opposing such an act isn’t islamaphobic.",
    "light_cleaned_comments": "Have provided link in text Should have brought a deer, like Shree Ram. I agree this is a violent act and the sacrifice itself shouldn't be done in the presence of other members of society. But rioting because of this and chanting jai shree ram doesn't make any other sense. It's communal . Bringing a live animal for butchering at home in an apartment is being inconsiderate towards neighbours. If they were opposing it on grounds of inconsideration or animal rights, then they'd be shouting relevant slogans. But since the slogan being shouted is jai shri ram, it makes it very much a case of Islamophobia. Pretending it's not is just masking the actual motivations here. And if the animal wasn't live at all but just its meat, then it's definitely a case of Islamophobia *and* disinformation. I should add something here. I don't know what's the location of this incident, but in my state, bringing an animal home to grow and then sacrifice (to devi) isn't uncommon for hindus either. But it's mainly male goats and cocks (male chicken), not lambs. I know it's cruel and nonsense, but done in the name of ritual. Again, why are they chanting Jai Shree Ram? Yes, it is pretty shitty and peak dehati move to slaughter animal in a housing society - it's a different story if you have your own house in your own private land. We've slaughtered animals too, for the animistic ritual of bhoota-kola in my native land in our own head family's property. But the war-cry weaponization of Lord Ram is a hint towards Islamophobia, let's not pretend that. If they were civil enough, this could have been bought up in a better manner. Nice joke. Hindu mob shouting Jai Shri Ram at a Muslim family is not Islamophobia. >But the act of sacrificing an animal in a housing society is absolutely barbaric and opposing such an act isn’t islamaphobic. Lynching muslims for beef is okay. But not sacrificing animals for eating >The police official said the man informs the police every year in advance about the procedure of bringing a goat to his house ahead of Bakrid as he has no other place to keep it. >The man takes the goat away the next day and the animal is not slaughtered at his residence,\" the official clarified He is not butchering it there. The festival is tomorrow. He brought it today and he will take it to the butcher shop to get it slaughtered tomorrow morning. >The police official said the man informs the police every year in advance about the procedure of bringing a goat to his house ahead of Bakrid as he has no other place to keep it. The man takes the goat away the next day and the animal is not slaughtered at his residence,\" the official clarified More brain-dead people. People be reposting tweets here without bare minimum context I am anti-religion but everything is Islamophobia to Islam followers. If I say a 54 year old person having sex with 9 year old is a pedophile, that is Islamophobia. Now a days, everything is Hinduphobia as well. If I say Hanuman couldn't have lifted mountain, it is Hinduphobia. Well done on following one of the most heinous scriptures in the world though. That includes Islamic & Hindu scriptures. This is Islamaphobia. He brought goat to his own home for slaughtering it next day. Why anyone have to interfere in it? Hmm, then the only violation may have been of some society bylaws maybe, like rules against keeping pets. Or maybe not even that. Either way, the slogans are nothing but Islamophobia. Put board \"Mutton biryani free\" and see how many turn up and stop shouting. I have seen this many times that I am immune to it. Not exactly Islam related and idgaf about them but even in Hindu and tribal communities, it's so common. The society *does not object on* keeping pets, i.e is pet friendly. A friend of mine lives there with a pet. Edit: spellings. *To take it to butcher and then slaughter. Not even in the society. Apparently he isn't slaughtering it at the place of residence. He informed the police beforehand, just keeps the goat at his flat because he can't keep it anywhere else. OP, you could’ve done bare minimum research on the news and found out how this was probably related to islamophobia. All you had to do was read the news article, and what the officials (police in the case) had to say. Not that hard, you know. No not even that. Police said that there were no society rules against bringing goats to your flat. No he can't do that Where is JP housing society located?? Not everything is Islamophobia, but this definitely is. That's actually how sacrifice meat is used. 1/3rd to poor people, 1/3rd for friends and family and 1/3rd for home. If their neighbours had good relations with them, they would definitely get either the meat or at least the biryani. Context matters and in this case it's definitely Islamophobia Why is it barbaric to slaughter an animal in his own home? It's his goat. His home. If there is blood he is gonna clean it. It's not like he is gonna ooze it out so it reaches your doorstep. And what's with assuming that he does it in his own home. He may go to an appropriate place to do it. And why Jai Shri Ram? Just tell him what you think instead of organising a mob. What hypocrisy!! Same hindus who would gladly eat mutton biryani and mock veg biryani as pulao now have problem with the man bringing lamb to his house (even when the man has mentioned that he will not slaughter it at home but take it to the butcher the next day)!! is it possible to slaughter the animal in a housing society..peak dehati thought...people just create hypothetical scenario and blame without knowing the fact! I swear we Indians are such hypocrites. I'm willing to bet that most of those protestors consume meat. Heck India is one of the biggest exporters of Beef. >I'll be the first one to admit I love myself some mutton/lamb But I have a problem when someone else wants to eat mutton/lamb because they're doing it in a way that doesn't sit right with me because of my own preconceived notions about what is clean/pure/right. If you like eating meat please cook with it a few times. It'll help rid you of the idea that the mutton you like to eat spontaneously appears on your plate from the ether. Opposing the act isn’t Islamophobia. Opposing the act while chanting JSR is. Know the difference idiot. In a mob of hundreds, a few would be just shouting right. Imagine if a man would have brought a pig for slaughter into the opposite demographic, he would be killed and his family lynched. OP must have been so convinced he is on the right, just by reading some tweet without fact checking he is here to outburst. Then turns out he was wrong, he didn't bring the lamb to slaughter at his residence like most Muslims who live in a housing society (not their own home) he would have taken the lamb to the slaughterhouse the next day, and the least violation would have been keeping the animal but society is even pet friendly so you can bring animals in. Now he looks like an idiot and Islamophobic. Poor OP. Op, don't let your befuddled head keep clouding your judgement, read up on the facts of a case before you get all wElL I EnJoy mutTon biRyAnI MySeLf BuT tHiS Is WrOnG Didn't expected this from right wingers. If they had cut that goat in the society then it would be understandable 🤣🤣 bakra phas gaya bechara! bakra be like : agle janam mohe zehreela saanp kijo! Is your living room open? I'd like to butcher a couple live animals there if you don't mind.... Pretty standard route. I guess the suspicions snowballed into fear, anger and then hatred too quick. Seeing this pattern all across the world. Don’t like it. Lol, it's funny how grown adults can't watch animals get killed, but are totally fine eating it regularly. Please give an example of this happening somewhere, because I can conjure up all sorts of things up in the air too Just wanted to clarify I’m against butchering of animals in residential hosing colonies. That’s it. Objecting this isn’t islamaphobia I mean. I hate the BJP, I oppose Hindu rashtra. I do think there is a huge issue with islamaphobia in this country. I think the PM completely misanswered the question in the White House. but not all acts of scrutinising Islam is islamaphobia. All religions have extremist elements to it. The act of sacrificing A WHOLE ASS GOAT IN A RESIDENTIAL HOUSING COLONY IS A FORM OF EXTREMISM. Opposing it isn’t Islamophobia. Not the guy who wrote this above but I think the moradabad riots started like this. This is old news, moradabad is a city in UP do you have the same objections to rangoli???? are you repulsed by ugly color that a bunch of people decide to draw everywhere in your building because of their religious beliefs??? will you similarly call for a ban on it???? If not then you have your answer listen there as an ex muslim there are plenty of things where the \"everything isn't islamophobia\" argument works This isn't it this is a bunch of backward barbaric zealots offended by the religious practice of one group while simultaneously to far up their own asses to see that how other people perceive their religious practice to be a nuisance what about yoga enforcement in Indian schools What about making people shout Bharat mata ki jai knowing full well that this is literally a violation of their faith???? What about large and obnoxious bhajans during different sorts of Puja's???? I think he is right, they were shouting jsr but your original point is correct too, slaughtering a goat inside an apartment is kinda weird. The disinfection n cleaning would be messy. I remember I had seen a fish getting killed once with the anvil like knife thing. The blood spatter went over my uncle's clothes. I can imagine something like this happening if u do it inside the house. If you do it outside then it's kk for me but I can see y a lot of people might take offence to that. yes you’re right, but who said he’s slaughtering the said animal in his home? Eid is tomorrow in India, he’s going to take the lamb/goat to slaughterhouse tomorrow. why would he sacrifice the animal one day before eid? are you retarded? yes, as a muslim i would condemn it too if an idiot is slaughtering in his apartment, imagine the smell and the blood but apparently he got police permission to keep the goat/lamb for the day and then slaughter it tomorrow (at the slaughterhouse) after the eid prayer. If it was really going to a slaughterhouse then I don't see a problem here. Btw why do u need police permission for this? read this article. So ig sm1 would've spread fake news that he's gonna slaughter it in the society but if he did it every year then people should have corrected the info. If that part was communicated to the mob then it's defo just nuisance value or some1petty trying to win the society elections If he was taking the goat to slaughter in a residential area(atho he was not), opposing it would not have been Islamophobia(altho I hate the word cuz sometimes muslims say this even when someone is criticising Islam or its practices and not demonising the people themselves). But these people clearly weren't there for animal rights or caring about residential rules but cuz of hate against a community since they were shouting JSR while doing this ijbol while reading your comment Is being afraid of religions a \"phobia\" though? I would say even in context of India only, it's totally reasonable to fear the religious folk. Phobia is irrational fear of something. Nothing phobic about rational fear of religious teachings which are ridiculous, illogical, unscientific and heinous at times."
}