{
    "id": "14qelq5",
    "title": "Does anyone care about all of this?",
    "url": "https://i.redd.it/12lxdwyy4y9b1.jpg",
    "selftext": "Source : https://m.economictimes.com/news/economy/agriculture/tomatoes-at-rs-100-was-just-the-beginning-chillies-hit-rs-400/kg/articleshow/101458015.cms",
    "flair": "AskIndia",
    "score": 49,
    "num_comments": 33,
    "created_utc": 1688475646.0,
    "convurl": "https://i.redd.it/12lxdwyy4y9b1.jpg",
    "comments": [
        "Zeera is 800/kilo.",
        "https://m.economictimes.com/news/economy/agriculture/tomatoes-at-rs-100-was-just-the-beginning-chillies-hit-rs-400/kg/articleshow/101458015.cms",
        "Our great FM Nirmala Ji said \"don't use the vegetables when it's prices are high. I'm a baamen so I don't use onions in my food. Simple solution\" during the onions price increase months ago.",
        "Omg the poor folks here crying because prices have increased. Be like me. Buy a lot (to last for a year) of veggies, groceries, etc when prices are low. Keep adding up on more when you think the valuation is low. Sell them when the prices increase.\n\nEz money. Now, buy essential items with the profits that you've made. If you want to get more tips, you can join my finance course. I charge a very nominal fee of 100 rupees per person. You'll get life changing tips from me",
        "Inflation is rising all across the world. It’s an extremely sad situation unfortunately. India is still in a better situation compared to others. But that reason doesn’t excuse the government to take necessary steps. I wonder what they’ll use to combat the rising inflation.",
        "I was about to post around this, does any one remember there used to be protest and all around inflation. Things are so fucked that people just do not care about these things now. They know nothing is going to happen. And then we have stupid opposition can't even pick correct issue and raise it. That's why they keep on loosing",
        "Selling them part is illegal. This is called hoarding and you might end up in jail.",
        "# VEGETABLE JIHAD\n\nnow everyone will :D",
        "Wow you really think you did something smart there didn't you?\n\nIt's called Hoarding and it's illegal. \n\nPeople have been doing this for ages.",
        "Who needs chillies anyways bro?\n\nIn my village no one eats chillies. Just reduce your chilly consumption and this problem will go away.",
        "Tujhe mirchi lagi toh mein kya karu - Fin Min",
        "Where do you think all the 2rs / kg onions go to?",
        "Stupid people can cry about prices, but can't give up eating for the sake of the supreme leader.",
        "The question here is, does anyone care about the middle class families?\n\nFrom media to politicians they will talk about poor sections of the society and giving them tax rebates and schemes and all. They will talk lowering the corporate tax for the rich and whatnot. Every year middle class is given a lollipop of some sort which all of us will start sucking it not knowing whether of not it's good for us as we're all in a rat race of earning money. The more your earn the more tax the middle class will pay. It's punitive tax system.",
        "This guy be like: “The secret ingredient is crime”",
        "“I don’t eat chillies and ginger”",
        "People needs to calm down and protect their dharma first, cause in India religion feeds you hatred and that should be enough SO STOP BEING SO ANTI NATIONAL",
        "Go cry in poverty",
        "You really thought I was serious. God, people need /s to understand I'm joking I guess",
        "Average amer papa ki gaand choosne wala launda.",
        "Atta boy..!!",
        "That's what poor people say.",
        "Actually we do horde onions and potatoes and practically all non decomposing vegetables. We just don't sell it lol.",
        "Do you want to know how to do it legally? Join my course for 100 rupees.",
        "If you want to know how to do it legally, you are always welcome to join my course. It costs you 100rs but you'll learn tips worth 1 crore. Its probably better than ankur warikoos course",
        "Average Andrew Tatta fan trying to sell his stupid course.",
        "Andrew Tate's course is nothing when compared to mine. Give me 100rs and I will show you.",
        "You can have my dick for all I care",
        "My course also teaches how to deal with dicks. It just costs 100rs",
        "Oh so you work at a gay brothel?",
        "What's wrong with gays? They are also people"
    ],
    "cleaned_text": "anyone care source ",
    "cleaned_title": "anyone care",
    "cleaned_selftext": "source",
    "cleaned_comments": "zeera kilo great fm nirmala ji said dont use vegetables prices high im baamen dont use onions food simple solution onions price increase months ago omg poor folks crying prices increased like buy lot last year veggies groceries etc prices low keep adding think valuation low sell prices increase ez money buy essential items profits youve made want get tips join finance course charge nominal fee rupees per person youll get life changing tips inflation rising across world extremely sad situation unfortunately india still better situation compared others reason doesnt excuse government take necessary steps wonder theyll use combat rising inflation post around one remember used protest around inflation things fucked people care things know nothing going happen stupid opposition cant even pick correct issue raise thats keep loosing selling part illegal called hoarding might end jail vegetable jihad everyone wow really think something smart didnt called hoarding illegal people ages needs chillies anyways bro village one eats chillies reduce chilly consumption problem go away tujhe mirchi lagi toh mein kya karu fin min think rs kg onions go stupid people cry prices cant give eating sake supreme leader question anyone care middle class families media politicians talk poor sections society giving tax rebates schemes talk lowering corporate tax rich whatnot every year middle class given lollipop sort us start sucking knowing whether good us rat race earning money earn tax middle class pay punitive tax system guy like secret ingredient crime dont eat chillies ginger people needs calm protect dharma first cause india religion feeds hatred enough stop anti national go cry poverty really thought serious god people need understand im joking guess average amer papa ki gaand choosne wala launda atta boy thats poor people say actually horde onions potatoes practically non decomposing vegetables dont sell lol want know legally join course rupees want know legally always welcome join course costs rs youll learn tips worth crore probably better ankur warikoos course average andrew tatta fan trying sell stupid course andrew tates course nothing compared mine give rs show dick care course also teaches deal dicks costs rs oh work gay brothel whats wrong gays also people",
    "light_cleaned_title": "Does anyone care about all of this?",
    "light_cleaned_selftext": "Source :",
    "light_cleaned_comments": "Zeera is 800/kilo. Our great FM Nirmala Ji said \"don't use the vegetables when it's prices are high. I'm a baamen so I don't use onions in my food. Simple solution\" during the onions price increase months ago. Omg the poor folks here crying because prices have increased. Be like me. Buy a lot (to last for a year) of veggies, groceries, etc when prices are low. Keep adding up on more when you think the valuation is low. Sell them when the prices increase. Ez money. Now, buy essential items with the profits that you've made. If you want to get more tips, you can join my finance course. I charge a very nominal fee of 100 rupees per person. You'll get life changing tips from me Inflation is rising all across the world. It’s an extremely sad situation unfortunately. India is still in a better situation compared to others. But that reason doesn’t excuse the government to take necessary steps. I wonder what they’ll use to combat the rising inflation. I was about to post around this, does any one remember there used to be protest and all around inflation. Things are so fucked that people just do not care about these things now. They know nothing is going to happen. And then we have stupid opposition can't even pick correct issue and raise it. That's why they keep on loosing Selling them part is illegal. This is called hoarding and you might end up in jail. # VEGETABLE JIHAD now everyone will :D Wow you really think you did something smart there didn't you? It's called Hoarding and it's illegal. People have been doing this for ages. Who needs chillies anyways bro? In my village no one eats chillies. Just reduce your chilly consumption and this problem will go away. Tujhe mirchi lagi toh mein kya karu - Fin Min Where do you think all the 2rs / kg onions go to? Stupid people can cry about prices, but can't give up eating for the sake of the supreme leader. The question here is, does anyone care about the middle class families? From media to politicians they will talk about poor sections of the society and giving them tax rebates and schemes and all. They will talk lowering the corporate tax for the rich and whatnot. Every year middle class is given a lollipop of some sort which all of us will start sucking it not knowing whether of not it's good for us as we're all in a rat race of earning money. The more your earn the more tax the middle class will pay. It's punitive tax system. This guy be like: “The secret ingredient is crime” “I don’t eat chillies and ginger” People needs to calm down and protect their dharma first, cause in India religion feeds you hatred and that should be enough SO STOP BEING SO ANTI NATIONAL Go cry in poverty You really thought I was serious. God, people need /s to understand I'm joking I guess Average amer papa ki gaand choosne wala launda. Atta boy..!! That's what poor people say. Actually we do horde onions and potatoes and practically all non decomposing vegetables. We just don't sell it lol. Do you want to know how to do it legally? Join my course for 100 rupees. If you want to know how to do it legally, you are always welcome to join my course. It costs you 100rs but you'll learn tips worth 1 crore. Its probably better than ankur warikoos course Average Andrew Tatta fan trying to sell his stupid course. Andrew Tate's course is nothing when compared to mine. Give me 100rs and I will show you. You can have my dick for all I care My course also teaches how to deal with dicks. It just costs 100rs Oh so you work at a gay brothel? What's wrong with gays? They are also people"
}