{
    "id": "139c67u",
    "title": "Help! I don't know what to do about this situation!!!",
    "url": "https://v.redd.it/h4sw2z3v35ya1",
    "selftext": "I shifted at a new place a few days ago and there is this house near our building. Every night we hear a voice of a puppy crying. It would cry all night. This video was shot today morning and it was raining at the night. I asked my roommate if the puppy's owner was abusive but she told she never saw anyone assaulting him. Yesterday I was trying to take a peak and look at him through the railings to see if he's okay but the owner came out and started staring at me. I don't know if they are abusive or not but this doesn't feel right. I even thought about breaking in and letting him out but where would I take him? It also did not feel sane.This is Bangalore and I'm from north and new here and I don't know the local language and honestly I'm too afraid to talk to the owner personally. Can anyone help? What should I do? I tried posting this in Bangalore sub but couldn't get insights maybe due to the video attachment.",
    "flair": "AskIndia",
    "score": 264,
    "num_comments": 67,
    "created_utc": 1683347848.0,
    "convurl": "https://external-preview.redd.it/LxhBdUhSmpyp4HIE_oNsJTo-w7BkOYxaO4k-LwCK4Hg.png?format=pjpg&auto=webp&v=enabled&s=8bd9e1a6b5bbb3c563d132719d645db647374340",
    "comments": [
        "pro tip  \n\n\nDONT PEAK into strangers houses....  \n\n\nits considered CREEPY....",
        "Honestly, a very common sight in most part of India. Here, people buy dogs and just keep em in the cage for eternity. They buy them only as guard dogs even though they wouldn't even hurt a fly. Its a sad truth. Majority of the owners are not willing to take care of a dog the right way(mostly because it's expensive). My relatives had two dogs. Both em stayed in a cage majority of the time and only take em out to pee/poo. You can educate the owners but to no use because I don't think an Indian is willing to spend thousands of rupees just to take care of their pet.",
        "Check with some animal or pet NGO and connect them",
        "I see chickens in much worse situation. But no outage at all.",
        "But he's so small. And he cries all night...like seriously all night. The little soul must be so scared.",
        "Told this to my brother who wants to get a dog. But I think that all I did was just delay the outcome.",
        "This is so sad😭poor puppy\n\nPlease contact some ngo near to your place. There is an NGO named Sarvoham in Bangalore. You can check with them...I am sure they will help.",
        "Ignore it. You mentioned you're from north. You'd never know if someone would take an offence and go against you.",
        "Tell your neighbours about it,expose the person who keeps him this way and go to the elders or File a complaint",
        "I think we're not getting a dog soon. And I don't  want a dog I Want a cat. I also know how to take care of it than a dog.",
        "Please inform your local civic body. Upload this video on Twitter and tag maximum local animal welfare bodies ( govt or pvt). You can make a throwaway account if you dont want to be highlighted. But he certainly needs help.",
        "Just call some ngo who's working for animals and they'll surely help you",
        "I tried but they're currently not taking in any dogs due to shortage of space.",
        "Contact the nearest NGOs or shelter they’ll definitely help. Some ppl don’t deserve animals as pets. Poor doggo must be scared 🥺😢",
        "Complaint about it to animal welfare",
        "XD",
        "I wish someone can help that poor puppy.",
        "try at CARE.",
        "Contact petadoptionbangalore through Instagram. They rescue dogs in bad conditions.",
        "Not sure if it will help, but can you post this same video in banglore subreddit? That way you might get a solution or may be you'll be able to find local groups of animal welfare.\n\nThis feels very sad, that little puppy alone at night crying in the rain while owner being ignorant about those loud cries",
        "I did. Waiting for the reply. Thanks!",
        "I do understand what you are saying and it sounds practical too. But you aren't here to watch his condition yourself. It's really heartbreaking. I legit had a breakdown watching him today. It was crying and the owner came opened the gate angrily and shouted and then it went quiet.",
        "I tried. That too twice but its not showing on the page. There are no insights too. That's why I had to post it here.",
        "I'll keep this in mind. Thankyou for the advice.",
        "Inform PETA, they should be of some help",
        "I did. They said I'll have to file a police FIR first. But I can't speak the local language and honestly I'm too afraid idk what to do. I also don't have friends who'll go with me and talk to the police.",
        "Probably the worst people you could ask for help",
        "Another thing I'd like to add is they won't get their dog neutered and the reason is to earn money by selling their puppies. Male dogs are inherently aggressive, and they'd just never leash it when they walk him for pooping.",
        "That's food bro, people won't bat an eye about bad conditions when it comes to their food",
        "Why does peta get so much hate?",
        "I seriously don't understand why do people do such things.... nobody forced them to buy/adopt a dog .. then idk why they buy the dogs and put them in cage.\nIk a lot of people who think this is only the right way to raise a dog...they should be in cage all the time..or be tied somewhere all the time.\nMy heart really cries whenever i see anything like this.\nAnd mind you , this type of behaviour is not only in rural areas but also in urban educated people.\n.and you can't do anything to help these babies coz there are no rules...if we confront the owners they say the dog is getting food and is taken for a walk . What else do it need more??",
        "They do anything but help animals. If you want more info I highly suggest to do some research on the brain dead things they've done.",
        "OP how old are you! just wanted to know.",
        "22",
        "have you ever travelled on a highway. dogs/cats are literally run over by trucks/cars. you can't do much. btw peta has put down more animals than animals would kill themselves. Don't be hard on yourself.",
        "Putting a puppy in a cage is not illegal, but Indian law does not allow keeping it in there for an unreasonably long time. As far as I remember, exact times were not mentioned and there was some scope for subjectivity there. But keeping an animal caged or chained all day and night without giving it breaks for play, food, exercise is definitely illegal. Animal NGOs will be able to guide you further. \n\nThe other hurdle in the way of rescuing this guy will be the owner's ego. He likely regrets getting the dog on a whim, as if it was just a soft toy, and now cannot handle its mental physical and emotional needs. Unless you can collect evidence and fight him in the courts, the easier and more commonly successful way would be to offer him money in return of the pupper. He will probably be happy to part with the puppy if he thinks you are an eager buyer instead of a preachy animal welfare activist.\n\nThanks for caring, best of luck, and keep us updated!",
        "John wick wants to know that owner's location",
        "I don't think buying the puppy would be the solution. The cage is old and is made specifically for keeping a dog there. He'll probably cage another dog even if we get this one out. I'll gather the courage and try to talk to the owner once calmly or atleast talk him into letting me see him and pet him once a day. NGO's can't work unless I file a complaint in the police. I know I'll sound like a coward but I really don't have anyone who'll back me up here in the city.",
        "I do understand what you are saying. But with all due respect I can't feign ignorance. I have decided to talk to the owner. I'll talk calmly so that I don't hurt his ego because it won't do any good to the puppy.",
        "This is so sad.",
        "appreciate your effort goodluck.",
        "Why buy a dog if you cannot afford it amirite?",
        "Mera ek dost kutto pe pathar fekta tha aur unka pair rassi se ped pe bandh deta tha.... Ek sec ye kisi ka Ghar hai kya wtf",
        "Ask the owner of you can take care of it during the day and return it back to him at night. As you feel sad for him being locked up.\n\nThat way he will not be locked in the cage \n\nOwner pays for food.",
        "I work 9-5....that's the issue... But yeah I'll talk to the owner.",
        "Best of luck. You're doing a good thing. Don't be afraid. Report back in trooper.",
        "Thank you so much I'll talk to him and tell you how it went.",
        "This is so cruel and terrible. Your only option is an animal NGO. They can prolly help you file an animal cruelty FIR. It’s a puppy right? Poor baby that little doggo. How can anyone be that horrible?! Wishing you the best, hoping you can save that little guy/girl.",
        "Find someone responsible, ready to adopt and steal the dog at night.",
        "OP, please write to Maneka Gandhi on gandhim@nic.in. IMMEDIATELY. Mention your area, exact situation and name of the owner and where the puppy is located. They can help by sending their volunteers to educate the owner or rescue the pup. Please be as detailed as possible. In my experience, Maneka Gandhi's office has always been responsive in animal cruelty cases.",
        "Might be some rules with sub reddit 😕",
        "This is so heart-breaking..",
        "Hi please reach out i will help you contacts in Bangalore that can help",
        "Peta might help",
        "Steal",
        "Please contact local animal rescues like CUPA, Alai and Charlie’s rescue. They will act immediately. Their numbers can be found in google. Google Harish KB also. He’s an animal welfare officers and attends cases like these.",
        "Puppy cries alot, coz separated from there mother. don't worry in some days he will be fine .",
        "Wait wait, are we not jumping into conclusions here? Maybe the owners are away? I love dogs but I'm just trying to be the devil's advocate here.",
        "Oh God 😭",
        "There should be an instant death penalty for animal and child abusers...right on the spot.  No questions asked."
    ],
    "cleaned_text": "help dont know situation shifted new place days ago house near building every night hear voice puppy crying would cry night video shot today morning raining night asked roommate puppys owner abusive told never saw anyone assaulting yesterday trying take peak look railings see hes okay owner came started staring dont know abusive doesnt feel right even thought breaking letting would take also feel sanethis bangalore im north new dont know local language honestly im afraid talk owner personally anyone help tried posting bangalore sub couldnt get insights maybe due video attachment ",
    "cleaned_title": "help dont know situation",
    "cleaned_selftext": "shifted new place days ago house near building every night hear voice puppy crying would cry night video shot today morning raining night asked roommate puppys owner abusive told never saw anyone assaulting yesterday trying take peak look railings see hes okay owner came started staring dont know abusive doesnt feel right even thought breaking letting would take also feel sanethis bangalore im north new dont know local language honestly im afraid talk owner personally anyone help tried posting bangalore sub couldnt get insights maybe due video attachment",
    "cleaned_comments": "pro tip dont peak strangers houses considered creepy honestly common sight part india people buy dogs keep em cage eternity buy guard dogs even though wouldnt even hurt fly sad truth majority owners willing take care dog right waymostly expensive relatives two dogs em stayed cage majority time take em peepoo educate owners use dont think indian willing spend thousands rupees take care pet check animal pet ngo connect see chickens much worse situation outage hes small cries nightlike seriously night little soul must scared told brother wants get dog think delay outcome sadpoor puppy please contact ngo near place ngo named sarvoham bangalore check themi sure help ignore mentioned youre north youd never know someone would take offence go tell neighbours itexpose person keeps way go elders file complaint think getting dog soon dont want dog want cat also know take care dog please inform local civic body upload video twitter tag maximum local animal welfare bodies govt pvt make throwaway account dont want highlighted certainly needs help call ngo whos working animals theyll surely help tried theyre currently taking dogs due shortage space contact nearest ngos shelter theyll definitely help ppl dont deserve animals pets poor doggo must scared complaint animal welfare xd wish someone help poor puppy try care contact petadoptionbangalore instagram rescue dogs bad conditions sure help post video banglore subreddit way might get solution may youll able find local groups animal welfare feels sad little puppy alone night crying rain owner ignorant loud cries waiting reply thanks understand saying sounds practical arent watch condition really heartbreaking legit breakdown watching today crying owner came opened gate angrily shouted went quiet tried twice showing page insights thats post ill keep mind thankyou advice inform peta help said ill file police fir first cant speak local language honestly im afraid idk also dont friends wholl go talk police probably worst people could ask help another thing id like add wont get dog neutered reason earn money selling puppies male dogs inherently aggressive theyd never leash walk pooping thats food bro people wont bat eye bad conditions comes food peta get much hate seriously dont understand people things nobody forced buyadopt dog idk buy dogs put cage ik lot people think right way raise dogthey cage timeor tied somewhere time heart really cries whenever see anything like mind type behaviour rural areas also urban educated people cant anything help babies coz rulesif confront owners say dog getting food taken walk else need anything help animals want info highly suggest research brain dead things theyve done op old wanted know ever travelled highway dogscats literally run truckscars cant much btw peta put animals animals would kill dont hard putting puppy cage illegal indian law allow keeping unreasonably long time far remember exact times mentioned scope subjectivity keeping animal caged chained day night without giving breaks play food exercise definitely illegal animal ngos able guide hurdle way rescuing guy owners ego likely regrets getting dog whim soft toy handle mental physical emotional needs unless collect evidence fight courts easier commonly successful way would offer money return pupper probably happy part puppy thinks eager buyer instead preachy animal welfare activist thanks caring best luck keep us updated john wick wants know owners location dont think buying puppy would solution cage old made specifically keeping dog hell probably cage another dog even get one ill gather courage try talk owner calmly atleast talk letting see pet day ngos cant work unless file complaint police know ill sound like coward really dont anyone wholl back city understand saying due respect cant feign ignorance decided talk owner ill talk calmly dont hurt ego wont good puppy sad appreciate effort goodluck buy dog afford amirite mera ek dost kutto pe pathar fekta tha aur unka pair rassi se ped pe bandh deta tha ek sec ye kisi ka ghar hai kya wtf ask owner take care day return back night feel sad locked way locked cage owner pays food work thats issue yeah ill talk owner best luck youre good thing dont afraid report back trooper thank much ill talk tell went cruel terrible option animal ngo prolly help file animal cruelty fir puppy right poor baby little doggo anyone horrible wishing best hoping save little guygirl find someone responsible ready adopt steal dog night op please write maneka gandhi gandhimnicin immediately mention area exact situation name owner puppy located help sending volunteers educate owner rescue pup please detailed possible experience maneka gandhis office always responsive animal cruelty cases might rules sub reddit heartbreaking hi please reach help contacts bangalore help peta might help steal please contact local animal rescues like cupa alai charlies rescue act immediately numbers found google google harish kb also hes animal welfare officers attends cases like puppy cries alot coz separated mother dont worry days fine wait wait jumping conclusions maybe owners away love dogs im trying devils advocate oh god instant death penalty animal child abusersright spot questions asked",
    "light_cleaned_title": "Help! I don't know what to do about this situation!!!",
    "light_cleaned_selftext": "I shifted at a new place a few days ago and there is this house near our building. Every night we hear a voice of a puppy crying. It would cry all night. This video was shot today morning and it was raining at the night. I asked my roommate if the puppy's owner was abusive but she told she never saw anyone assaulting him. Yesterday I was trying to take a peak and look at him through the railings to see if he's okay but the owner came out and started staring at me. I don't know if they are abusive or not but this doesn't feel right. I even thought about breaking in and letting him out but where would I take him? It also did not feel sane.This is Bangalore and I'm from north and new here and I don't know the local language and honestly I'm too afraid to talk to the owner personally. Can anyone help? What should I do? I tried posting this in Bangalore sub but couldn't get insights maybe due to the video attachment.",
    "light_cleaned_comments": "pro tip DONT PEAK into strangers houses.... its considered CREEPY.... Honestly, a very common sight in most part of India. Here, people buy dogs and just keep em in the cage for eternity. They buy them only as guard dogs even though they wouldn't even hurt a fly. Its a sad truth. Majority of the owners are not willing to take care of a dog the right way(mostly because it's expensive). My relatives had two dogs. Both em stayed in a cage majority of the time and only take em out to pee/poo. You can educate the owners but to no use because I don't think an Indian is willing to spend thousands of rupees just to take care of their pet. Check with some animal or pet NGO and connect them I see chickens in much worse situation. But no outage at all. But he's so small. And he cries all night...like seriously all night. The little soul must be so scared. Told this to my brother who wants to get a dog. But I think that all I did was just delay the outcome. This is so sad😭poor puppy Please contact some ngo near to your place. There is an NGO named Sarvoham in Bangalore. You can check with them...I am sure they will help. Ignore it. You mentioned you're from north. You'd never know if someone would take an offence and go against you. Tell your neighbours about it,expose the person who keeps him this way and go to the elders or File a complaint I think we're not getting a dog soon. And I don't want a dog I Want a cat. I also know how to take care of it than a dog. Please inform your local civic body. Upload this video on Twitter and tag maximum local animal welfare bodies ( govt or pvt). You can make a throwaway account if you dont want to be highlighted. But he certainly needs help. Just call some ngo who's working for animals and they'll surely help you I tried but they're currently not taking in any dogs due to shortage of space. Contact the nearest NGOs or shelter they’ll definitely help. Some ppl don’t deserve animals as pets. Poor doggo must be scared 🥺😢 Complaint about it to animal welfare XD I wish someone can help that poor puppy. try at CARE. Contact petadoptionbangalore through Instagram. They rescue dogs in bad conditions. Not sure if it will help, but can you post this same video in banglore subreddit? That way you might get a solution or may be you'll be able to find local groups of animal welfare. This feels very sad, that little puppy alone at night crying in the rain while owner being ignorant about those loud cries I did. Waiting for the reply. Thanks! I do understand what you are saying and it sounds practical too. But you aren't here to watch his condition yourself. It's really heartbreaking. I legit had a breakdown watching him today. It was crying and the owner came opened the gate angrily and shouted and then it went quiet. I tried. That too twice but its not showing on the page. There are no insights too. That's why I had to post it here. I'll keep this in mind. Thankyou for the advice. Inform PETA, they should be of some help I did. They said I'll have to file a police FIR first. But I can't speak the local language and honestly I'm too afraid idk what to do. I also don't have friends who'll go with me and talk to the police. Probably the worst people you could ask for help Another thing I'd like to add is they won't get their dog neutered and the reason is to earn money by selling their puppies. Male dogs are inherently aggressive, and they'd just never leash it when they walk him for pooping. That's food bro, people won't bat an eye about bad conditions when it comes to their food Why does peta get so much hate? I seriously don't understand why do people do such things.... nobody forced them to buy/adopt a dog .. then idk why they buy the dogs and put them in cage. Ik a lot of people who think this is only the right way to raise a dog...they should be in cage all the time..or be tied somewhere all the time. My heart really cries whenever i see anything like this. And mind you , this type of behaviour is not only in rural areas but also in urban educated people. .and you can't do anything to help these babies coz there are no rules...if we confront the owners they say the dog is getting food and is taken for a walk . What else do it need more?? They do anything but help animals. If you want more info I highly suggest to do some research on the brain dead things they've done. OP how old are you! just wanted to know. 22 have you ever travelled on a highway. dogs/cats are literally run over by trucks/cars. you can't do much. btw peta has put down more animals than animals would kill themselves. Don't be hard on yourself. Putting a puppy in a cage is not illegal, but Indian law does not allow keeping it in there for an unreasonably long time. As far as I remember, exact times were not mentioned and there was some scope for subjectivity there. But keeping an animal caged or chained all day and night without giving it breaks for play, food, exercise is definitely illegal. Animal NGOs will be able to guide you further. The other hurdle in the way of rescuing this guy will be the owner's ego. He likely regrets getting the dog on a whim, as if it was just a soft toy, and now cannot handle its mental physical and emotional needs. Unless you can collect evidence and fight him in the courts, the easier and more commonly successful way would be to offer him money in return of the pupper. He will probably be happy to part with the puppy if he thinks you are an eager buyer instead of a preachy animal welfare activist. Thanks for caring, best of luck, and keep us updated! John wick wants to know that owner's location I don't think buying the puppy would be the solution. The cage is old and is made specifically for keeping a dog there. He'll probably cage another dog even if we get this one out. I'll gather the courage and try to talk to the owner once calmly or atleast talk him into letting me see him and pet him once a day. NGO's can't work unless I file a complaint in the police. I know I'll sound like a coward but I really don't have anyone who'll back me up here in the city. I do understand what you are saying. But with all due respect I can't feign ignorance. I have decided to talk to the owner. I'll talk calmly so that I don't hurt his ego because it won't do any good to the puppy. This is so sad. appreciate your effort goodluck. Why buy a dog if you cannot afford it amirite? Mera ek dost kutto pe pathar fekta tha aur unka pair rassi se ped pe bandh deta tha.... Ek sec ye kisi ka Ghar hai kya wtf Ask the owner of you can take care of it during the day and return it back to him at night. As you feel sad for him being locked up. That way he will not be locked in the cage Owner pays for food. I work 9-5....that's the issue... But yeah I'll talk to the owner. Best of luck. You're doing a good thing. Don't be afraid. Report back in trooper. Thank you so much I'll talk to him and tell you how it went. This is so cruel and terrible. Your only option is an animal NGO. They can prolly help you file an animal cruelty FIR. It’s a puppy right? Poor baby that little doggo. How can anyone be that horrible?! Wishing you the best, hoping you can save that little guy/girl. Find someone responsible, ready to adopt and steal the dog at night. OP, please write to Maneka Gandhi on gandhim@nic.in. IMMEDIATELY. Mention your area, exact situation and name of the owner and where the puppy is located. They can help by sending their volunteers to educate the owner or rescue the pup. Please be as detailed as possible. In my experience, Maneka Gandhi's office has always been responsive in animal cruelty cases. Might be some rules with sub reddit 😕 This is so heart-breaking.. Hi please reach out i will help you contacts in Bangalore that can help Peta might help Steal Please contact local animal rescues like CUPA, Alai and Charlie’s rescue. They will act immediately. Their numbers can be found in google. Google Harish KB also. He’s an animal welfare officers and attends cases like these. Puppy cries alot, coz separated from there mother. don't worry in some days he will be fine . Wait wait, are we not jumping into conclusions here? Maybe the owners are away? I love dogs but I'm just trying to be the devil's advocate here. Oh God 😭 There should be an instant death penalty for animal and child abusers...right on the spot. No questions asked."
}