{
    "id": "1e1jr75",
    "title": "An elopement, boycott and affidavit later, two Haryana villages settle for uneasy truce",
    "url": "https://indianexpress.com/article/long-reads/elopement-boycott-affidavit-haryana-villages-settle-uneasy-truce-9447588/",
    "selftext": "On June 9, a woman from Dholera village eloped with a man from Bighopur. Upset over their “unacceptable” marriage, for nearly a month, her village instituted a boycott of their neighbours.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1720796330.0,
    "convurl": "https://external-preview.redd.it/NA-_5KnsoHoPQQm3MRDe7wiYi3ujpgVULFArtx8987Q.jpg?auto=webp&s=bb8815e9f9e346739edbc7064be9a8819d35e98d",
    "comments": [
        "For nearly a month, all eyes were on the road connecting Dholera and Bighopur, two villages that are 2 km apart in Haryana’s Narnaul. Since June 12, all Bighopur residents spotted on the way to the bank, the post office or the bus stand — common for both villages — were turned away “for the sake of maintaining peace”.\n\n# A month of trouble for Bighopur\n\nAs part of the ban, Bighopur residents arriving in Dholera village for anything, “even to buy medicines”, were turned away. Eleven shops in the village owned by Bighopur residents too remained out of bounds for their owners during this time. Also, since Bighopur residents couldn’t use the bus stand they shared with Dholera, they were forced to walk till the main road, a few kilometres away. “Even school children suffered since buses are shared by those from both villages,” says Bighopur’s Subhash, 30, who owns a general store in Dholera. He adds the boycott cost him “Rs 30,000, his entire month’s income”.\n\nThe boycott was finally lifted after personnel from Nizampur police station asked both sides to patch up. SHO Govind Singh says, “We told Dholera residents that they cannot ban on Bighopur-based shop owners from entering the village. The shops opened on July 10.”\n\nResidents from both villages met and decided that the solution lay in Vikas’s family disowning him and the couple being asked to stay away. On July 9, Vikas’s father Sajjan Singh did so through an ‘affidavit’, a copy of which was given to the station house officer (SHO) of Nizampur police station. SHO Singh says, “They just gave me a copy of the affidavit. We never asked for one. It’s not a legal document.”\nHowever, the unease remained. Kawar Singh, the father-in-law of the Bighopur sarpanch, says, “Their marriage has tarnished the harmony between our villages. Marriages within a close-knit community like ours will never be tolerated because it is like siblings getting married.”\n\n# Families stunned\n\nSitting in stunned silence inside their unpainted, two-room house in Bighopur, Vikas’s parents seem less opposed to his marriage. “After I disowned him, both villages reached a compromise. We have nothing to do with them anymore,” his father Sajjan Singh, a farmer, tells The Indian Express.\n\nHinting that the boycott forced them to take the decision, his mother Maya, 56, says, “Both of them are adults. The girl left with Vikas willingly. She has also said that she wants to stay with him.”\nNearly 2 km away in Dholera village, Praveena’s family is equally shaken. Recalling the events of June 9, the day the couple eloped, her mother Nirmala 42, says Praveena left the house saying that she was going to pat cow dung cakes on the wall.\n\n“I went looking for her, but someone told me that she had gone with Vikas. Then, we got to know that she and Vikas had gone to Jaipur. When they returned to the village two days later, we discovered that they were married,” says Nirmala, sitting on the pavement in front of her house.\n\nMaintaining that the couple had “ruined the brotherhood in the villages”, Dholera sarpanch Devinder Kumar, 25, says it is up to their parents to decide the future course of action in case they decide to return.\n\nPraveena granduncle Kailash, 65, said the family was willing to “accept her” on one condition — “she needs to change her statement and leave Vikas. We will get her married to someone else to undo the damage”.\n\nPraveena’s two-storey house, wearing a fresh coat of grey paint, stands at the end of a lane in Bighopur. Her father Sanjay says he got the house renovated in the hopes of finding a “good match” for her. “We did not even know about that boy (Vikas). I would have put an end to it all had I known about it. I sent her to good schools and enrolled her in college. She was a good student, but she won’t go back to college now. I met her five times — at the safe house and at the court — but she refused to speak to me. I tried to persuade her, but she insists on staying with the boy,” he says, adding that his “brain has stopped working”.\n\nPraveena’s uncle Kailash places the “blame” squarely on Vikas. “Girls elope in every village and it is not a problem. Magar taqleef yeh hai ki pados gaon ka ladka hai, bhai hai hamara (but this boy is like a brother because he is from the neighbouring village). Such a marriage cannot be normalised. They may be from different gotras, but it is still wrong. It might happen in cities, but we don’t let it happen here,” he says.",
        "For nearly a month, all eyes were on the road connecting Dholera and Bighopur, two villages that are 2 km apart in Haryana’s Narnaul. Since June 12, all Bighopur residents spotted on the way to the bank, the post office or the bus stand — common for both villages — were turned away “for the sake of maintaining peace”.\n\nFor nearly a month after a woman from Dholera village fell in love and eloped with a man from Bighopur, her village instituted a boycott of their neighbours, upset over their “unacceptable” marriage. In several parts of Haryana, marriages between residents of neighbouring villages are “banned” by diktat.\n\nThe boycott was finally lifted on July 9 after the newlyweds were turned away and the man was publicly disowned by his family. With that, the two sides managed to forge a tentative truce, however tensions and disapprovals run high.\n\nLate on June 9, Bighopur’s Vikas Yadav, 26, and Dholera’s Praveena Yadav, 21, ran away from home and tied the knot at an Arya Samaj temple in Uttar Pradesh’s Ghaziabad, 243 km away. Residents of Dholera and Bighopur villages say the couple first met at the common bus stop from where they commuted to Narnaul. Praveena, the first in her family to attend college, is a second-year BSc student at a Narnaul college, while Vikas is preparing for government exams at a coaching institute there.\n\nSHO Govind Singh said that on June 9, the day the couple eloped, Praveena’s father Sanjay, 47, filed an FIR against Vikas under IPC sections related to wrongful confinement.\n\nThree days later, Praveena petitioned the court of the Judicial Magistrate, saying she feared for their safety, following which the couple were sent to a “safe house” at the Narnaul Police Lines. The Indian Express reached out to the couple, but they were unavailable for a comment.\n\nAngry over the developments, the Dholera panchayat met on June 12 and decided to impose a ban on residents of Bighopur. “The couple’s actions led to the June 12 ban,” says Dholera sarpanch Devinder Kumar, 25.",
        "India is a one wild country.",
        "# A month of trouble for Bighopur\n\nAs part of the ban, Bighopur residents arriving in Dholera village for anything, “even to buy medicines”, were turned away. Eleven shops in the village owned by Bighopur residents too remained out of bounds for their owners during this time. Also, since Bighopur residents couldn’t use the bus stand they shared with Dholera, they were forced to walk till the main road, a few kilometres away. “Even school children suffered since buses are shared by those from both villages,” says Bighopur’s Subhash, 30, who owns a general store in Dholera. He adds the boycott cost him “Rs 30,000, his entire month’s income”.\n\nThe boycott was finally lifted after personnel from Nizampur police station asked both sides to patch up. SHO Govind Singh says, “We told Dholera residents that they cannot ban on Bighopur-based shop owners from entering the village. The shops opened on July 10.”\n\nResidents from both villages met and decided that the solution lay in Vikas’s family disowning him and the couple being asked to stay away. On July 9, Vikas’s father Sajjan Singh did so through an ‘affidavit’, a copy of which was given to the station house officer (SHO) of Nizampur police station. SHO Singh says, “They just gave me a copy of the affidavit. We never asked for one. It’s not a legal document.”\n\nHowever, the unease remained. Kawar Singh, the father-in-law of the Bighopur sarpanch, says, “Their marriage has tarnished the harmony between our villages. Marriages within a close-knit community like ours will never be tolerated because it is like siblings getting married.”\n\n# Families stunned\n\nSitting in stunned silence inside their unpainted, two-room house in Bighopur, Vikas’s parents seem less opposed to his marriage. “After I disowned him, both villages reached a compromise. We have nothing to do with them anymore,” his father Sajjan Singh, a farmer, tells The Indian Express.\n\nHinting that the boycott forced them to take the decision, his mother Maya, 56, says, “Both of them are adults. The girl left with Vikas willingly. She has also said that she wants to stay with him.”\n\nNearly 2 km away in Dholera village, Praveena’s family is equally shaken. Recalling the events of June 9, the day the couple eloped, her mother Nirmala 42, says Praveena left the house saying that she was going to pat cow dung cakes on the wall.\n\n“I went looking for her, but someone told me that she had gone with Vikas. Then, we got to know that she and Vikas had gone to Jaipur. When they returned to the village two days later, we discovered that they were married,” says Nirmala, sitting on the pavement in front of her house.\n\nMaintaining that the couple had “ruined the brotherhood in the villages”, Dholera sarpanch Devinder Kumar, 25, says it is up to their parents to decide the future course of action in case they decide to return.\n\nPraveena granduncle Kailash, 65, said the family was willing to “accept her” on one condition — “she needs to change her statement and leave Vikas. We will get her married to someone else to undo the damage”.\n\nPraveena’s two-storey house, wearing a fresh coat of grey paint, stands at the end of a lane in Bighopur. Her father Sanjay says he got the house renovated in the hopes of finding a “good match” for her. “We did not even know about that boy (Vikas). I would have put an end to it all had I known about it. I sent her to good schools and enrolled her in college. She was a good student, but she won’t go back to college now. I met her five times — at the safe house and at the court — but she refused to speak to me. I tried to persuade her, but she insists on staying with the boy,” he says, adding that his “brain has stopped working”.\n\nPraveena’s uncle Kailash places the “blame” squarely on Vikas. “Girls elope in every village and it is not a problem. Magar taqleef yeh hai ki pados gaon ka ladka hai, bhai hai hamara (but this boy is like a brother because he is from the neighbouring village). Such a marriage cannot be normalised. They may be from different gotras, but it is still wrong. It might happen in cities, but we don’t let it happen here,” he says."
    ],
    "cleaned_text": "elopement boycott affidavit later two haryana villages settle uneasy truce june woman dholera village eloped man bighopur upset unacceptable marriage nearly month village instituted boycott neighbours ",
    "cleaned_title": "elopement boycott affidavit later two haryana villages settle uneasy truce",
    "cleaned_selftext": "june woman dholera village eloped man bighopur upset unacceptable marriage nearly month village instituted boycott neighbours",
    "cleaned_comments": "nearly month eyes road connecting dholera bighopur two villages km apart haryanas narnaul since june bighopur residents spotted way bank post office bus stand common villages turned away sake maintaining peace month trouble bighopur part ban bighopur residents arriving dholera village anything even buy medicines turned away eleven shops village owned bighopur residents remained bounds owners time also since bighopur residents couldnt use bus stand shared dholera forced walk till main road kilometres away even school children suffered since buses shared villages says bighopurs subhash owns general store dholera adds boycott cost rs entire months income boycott finally lifted personnel nizampur police station asked sides patch sho govind singh says told dholera residents ban bighopurbased shop owners entering village shops opened july residents villages met decided solution lay vikass family disowning couple asked stay away july vikass father sajjan singh affidavit copy given station house officer sho nizampur police station sho singh says gave copy affidavit never asked one legal document however unease remained kawar singh fatherinlaw bighopur sarpanch says marriage tarnished harmony villages marriages within closeknit community like never tolerated like siblings getting married families stunned sitting stunned silence inside unpainted tworoom house bighopur vikass parents seem less opposed marriage disowned villages reached compromise nothing anymore father sajjan singh farmer tells indian express hinting boycott forced take decision mother maya says adults girl left vikas willingly also said wants stay nearly km away dholera village praveenas family equally shaken recalling events june day couple eloped mother nirmala says praveena left house saying going pat cow dung cakes wall went looking someone told gone vikas got know vikas gone jaipur returned village two days later discovered married says nirmala sitting pavement front house maintaining couple ruined brotherhood villages dholera sarpanch devinder kumar says parents decide future course action case decide return praveena granduncle kailash said family willing accept one condition needs change statement leave vikas get married someone else undo damage praveenas twostorey house wearing fresh coat grey paint stands end lane bighopur father sanjay says got house renovated hopes finding good match even know boy vikas would put end known sent good schools enrolled college good student wont go back college met five times safe house court refused speak tried persuade insists staying boy says adding brain stopped working praveenas uncle kailash places blame squarely vikas girls elope every village problem magar taqleef yeh hai ki pados gaon ka ladka hai bhai hai hamara boy like brother neighbouring village marriage normalised may different gotras still wrong might happen cities dont let happen says nearly month eyes road connecting dholera bighopur two villages km apart haryanas narnaul since june bighopur residents spotted way bank post office bus stand common villages turned away sake maintaining peace nearly month woman dholera village fell love eloped man bighopur village instituted boycott neighbours upset unacceptable marriage several parts haryana marriages residents neighbouring villages banned diktat boycott finally lifted july newlyweds turned away man publicly disowned family two sides managed forge tentative truce however tensions disapprovals run high late june bighopurs vikas yadav dholeras praveena yadav ran away home tied knot arya samaj temple uttar pradeshs ghaziabad km away residents dholera bighopur villages say couple first met common bus stop commuted narnaul praveena first family attend college secondyear bsc student narnaul college vikas preparing government exams coaching institute sho govind singh said june day couple eloped praveenas father sanjay filed fir vikas ipc sections related wrongful confinement three days later praveena petitioned court judicial magistrate saying feared safety following couple sent safe house narnaul police lines indian express reached couple unavailable comment angry developments dholera panchayat met june decided impose ban residents bighopur couples actions led june ban says dholera sarpanch devinder kumar india one wild country month trouble bighopur part ban bighopur residents arriving dholera village anything even buy medicines turned away eleven shops village owned bighopur residents remained bounds owners time also since bighopur residents couldnt use bus stand shared dholera forced walk till main road kilometres away even school children suffered since buses shared villages says bighopurs subhash owns general store dholera adds boycott cost rs entire months income boycott finally lifted personnel nizampur police station asked sides patch sho govind singh says told dholera residents ban bighopurbased shop owners entering village shops opened july residents villages met decided solution lay vikass family disowning couple asked stay away july vikass father sajjan singh affidavit copy given station house officer sho nizampur police station sho singh says gave copy affidavit never asked one legal document however unease remained kawar singh fatherinlaw bighopur sarpanch says marriage tarnished harmony villages marriages within closeknit community like never tolerated like siblings getting married families stunned sitting stunned silence inside unpainted tworoom house bighopur vikass parents seem less opposed marriage disowned villages reached compromise nothing anymore father sajjan singh farmer tells indian express hinting boycott forced take decision mother maya says adults girl left vikas willingly also said wants stay nearly km away dholera village praveenas family equally shaken recalling events june day couple eloped mother nirmala says praveena left house saying going pat cow dung cakes wall went looking someone told gone vikas got know vikas gone jaipur returned village two days later discovered married says nirmala sitting pavement front house maintaining couple ruined brotherhood villages dholera sarpanch devinder kumar says parents decide future course action case decide return praveena granduncle kailash said family willing accept one condition needs change statement leave vikas get married someone else undo damage praveenas twostorey house wearing fresh coat grey paint stands end lane bighopur father sanjay says got house renovated hopes finding good match even know boy vikas would put end known sent good schools enrolled college good student wont go back college met five times safe house court refused speak tried persuade insists staying boy says adding brain stopped working praveenas uncle kailash places blame squarely vikas girls elope every village problem magar taqleef yeh hai ki pados gaon ka ladka hai bhai hai hamara boy like brother neighbouring village marriage normalised may different gotras still wrong might happen cities dont let happen says",
    "light_cleaned_title": "An elopement, boycott and affidavit later, two Haryana villages settle for uneasy truce",
    "light_cleaned_selftext": "On June 9, a woman from Dholera village eloped with a man from Bighopur. Upset over their “unacceptable” marriage, for nearly a month, her village instituted a boycott of their neighbours.",
    "light_cleaned_comments": "For nearly a month, all eyes were on the road connecting Dholera and Bighopur, two villages that are 2 km apart in Haryana’s Narnaul. Since June 12, all Bighopur residents spotted on the way to the bank, the post office or the bus stand — common for both villages — were turned away “for the sake of maintaining peace”. # A month of trouble for Bighopur As part of the ban, Bighopur residents arriving in Dholera village for anything, “even to buy medicines”, were turned away. Eleven shops in the village owned by Bighopur residents too remained out of bounds for their owners during this time. Also, since Bighopur residents couldn’t use the bus stand they shared with Dholera, they were forced to walk till the main road, a few kilometres away. “Even school children suffered since buses are shared by those from both villages,” says Bighopur’s Subhash, 30, who owns a general store in Dholera. He adds the boycott cost him “Rs 30,000, his entire month’s income”. The boycott was finally lifted after personnel from Nizampur police station asked both sides to patch up. SHO Govind Singh says, “We told Dholera residents that they cannot ban on Bighopur-based shop owners from entering the village. The shops opened on July 10.” Residents from both villages met and decided that the solution lay in Vikas’s family disowning him and the couple being asked to stay away. On July 9, Vikas’s father Sajjan Singh did so through an ‘affidavit’, a copy of which was given to the station house officer (SHO) of Nizampur police station. SHO Singh says, “They just gave me a copy of the affidavit. We never asked for one. It’s not a legal document.” However, the unease remained. Kawar Singh, the father-in-law of the Bighopur sarpanch, says, “Their marriage has tarnished the harmony between our villages. Marriages within a close-knit community like ours will never be tolerated because it is like siblings getting married.” # Families stunned Sitting in stunned silence inside their unpainted, two-room house in Bighopur, Vikas’s parents seem less opposed to his marriage. “After I disowned him, both villages reached a compromise. We have nothing to do with them anymore,” his father Sajjan Singh, a farmer, tells The Indian Express. Hinting that the boycott forced them to take the decision, his mother Maya, 56, says, “Both of them are adults. The girl left with Vikas willingly. She has also said that she wants to stay with him.” Nearly 2 km away in Dholera village, Praveena’s family is equally shaken. Recalling the events of June 9, the day the couple eloped, her mother Nirmala 42, says Praveena left the house saying that she was going to pat cow dung cakes on the wall. “I went looking for her, but someone told me that she had gone with Vikas. Then, we got to know that she and Vikas had gone to Jaipur. When they returned to the village two days later, we discovered that they were married,” says Nirmala, sitting on the pavement in front of her house. Maintaining that the couple had “ruined the brotherhood in the villages”, Dholera sarpanch Devinder Kumar, 25, says it is up to their parents to decide the future course of action in case they decide to return. Praveena granduncle Kailash, 65, said the family was willing to “accept her” on one condition — “she needs to change her statement and leave Vikas. We will get her married to someone else to undo the damage”. Praveena’s two-storey house, wearing a fresh coat of grey paint, stands at the end of a lane in Bighopur. Her father Sanjay says he got the house renovated in the hopes of finding a “good match” for her. “We did not even know about that boy (Vikas). I would have put an end to it all had I known about it. I sent her to good schools and enrolled her in college. She was a good student, but she won’t go back to college now. I met her five times — at the safe house and at the court — but she refused to speak to me. I tried to persuade her, but she insists on staying with the boy,” he says, adding that his “brain has stopped working”. Praveena’s uncle Kailash places the “blame” squarely on Vikas. “Girls elope in every village and it is not a problem. Magar taqleef yeh hai ki pados gaon ka ladka hai, bhai hai hamara (but this boy is like a brother because he is from the neighbouring village). Such a marriage cannot be normalised. They may be from different gotras, but it is still wrong. It might happen in cities, but we don’t let it happen here,” he says. For nearly a month, all eyes were on the road connecting Dholera and Bighopur, two villages that are 2 km apart in Haryana’s Narnaul. Since June 12, all Bighopur residents spotted on the way to the bank, the post office or the bus stand — common for both villages — were turned away “for the sake of maintaining peace”. For nearly a month after a woman from Dholera village fell in love and eloped with a man from Bighopur, her village instituted a boycott of their neighbours, upset over their “unacceptable” marriage. In several parts of Haryana, marriages between residents of neighbouring villages are “banned” by diktat. The boycott was finally lifted on July 9 after the newlyweds were turned away and the man was publicly disowned by his family. With that, the two sides managed to forge a tentative truce, however tensions and disapprovals run high. Late on June 9, Bighopur’s Vikas Yadav, 26, and Dholera’s Praveena Yadav, 21, ran away from home and tied the knot at an Arya Samaj temple in Uttar Pradesh’s Ghaziabad, 243 km away. Residents of Dholera and Bighopur villages say the couple first met at the common bus stop from where they commuted to Narnaul. Praveena, the first in her family to attend college, is a second-year BSc student at a Narnaul college, while Vikas is preparing for government exams at a coaching institute there. SHO Govind Singh said that on June 9, the day the couple eloped, Praveena’s father Sanjay, 47, filed an FIR against Vikas under IPC sections related to wrongful confinement. Three days later, Praveena petitioned the court of the Judicial Magistrate, saying she feared for their safety, following which the couple were sent to a “safe house” at the Narnaul Police Lines. The Indian Express reached out to the couple, but they were unavailable for a comment. Angry over the developments, the Dholera panchayat met on June 12 and decided to impose a ban on residents of Bighopur. “The couple’s actions led to the June 12 ban,” says Dholera sarpanch Devinder Kumar, 25. India is a one wild country. # A month of trouble for Bighopur As part of the ban, Bighopur residents arriving in Dholera village for anything, “even to buy medicines”, were turned away. Eleven shops in the village owned by Bighopur residents too remained out of bounds for their owners during this time. Also, since Bighopur residents couldn’t use the bus stand they shared with Dholera, they were forced to walk till the main road, a few kilometres away. “Even school children suffered since buses are shared by those from both villages,” says Bighopur’s Subhash, 30, who owns a general store in Dholera. He adds the boycott cost him “Rs 30,000, his entire month’s income”. The boycott was finally lifted after personnel from Nizampur police station asked both sides to patch up. SHO Govind Singh says, “We told Dholera residents that they cannot ban on Bighopur-based shop owners from entering the village. The shops opened on July 10.” Residents from both villages met and decided that the solution lay in Vikas’s family disowning him and the couple being asked to stay away. On July 9, Vikas’s father Sajjan Singh did so through an ‘affidavit’, a copy of which was given to the station house officer (SHO) of Nizampur police station. SHO Singh says, “They just gave me a copy of the affidavit. We never asked for one. It’s not a legal document.” However, the unease remained. Kawar Singh, the father-in-law of the Bighopur sarpanch, says, “Their marriage has tarnished the harmony between our villages. Marriages within a close-knit community like ours will never be tolerated because it is like siblings getting married.” # Families stunned Sitting in stunned silence inside their unpainted, two-room house in Bighopur, Vikas’s parents seem less opposed to his marriage. “After I disowned him, both villages reached a compromise. We have nothing to do with them anymore,” his father Sajjan Singh, a farmer, tells The Indian Express. Hinting that the boycott forced them to take the decision, his mother Maya, 56, says, “Both of them are adults. The girl left with Vikas willingly. She has also said that she wants to stay with him.” Nearly 2 km away in Dholera village, Praveena’s family is equally shaken. Recalling the events of June 9, the day the couple eloped, her mother Nirmala 42, says Praveena left the house saying that she was going to pat cow dung cakes on the wall. “I went looking for her, but someone told me that she had gone with Vikas. Then, we got to know that she and Vikas had gone to Jaipur. When they returned to the village two days later, we discovered that they were married,” says Nirmala, sitting on the pavement in front of her house. Maintaining that the couple had “ruined the brotherhood in the villages”, Dholera sarpanch Devinder Kumar, 25, says it is up to their parents to decide the future course of action in case they decide to return. Praveena granduncle Kailash, 65, said the family was willing to “accept her” on one condition — “she needs to change her statement and leave Vikas. We will get her married to someone else to undo the damage”. Praveena’s two-storey house, wearing a fresh coat of grey paint, stands at the end of a lane in Bighopur. Her father Sanjay says he got the house renovated in the hopes of finding a “good match” for her. “We did not even know about that boy (Vikas). I would have put an end to it all had I known about it. I sent her to good schools and enrolled her in college. She was a good student, but she won’t go back to college now. I met her five times — at the safe house and at the court — but she refused to speak to me. I tried to persuade her, but she insists on staying with the boy,” he says, adding that his “brain has stopped working”. Praveena’s uncle Kailash places the “blame” squarely on Vikas. “Girls elope in every village and it is not a problem. Magar taqleef yeh hai ki pados gaon ka ladka hai, bhai hai hamara (but this boy is like a brother because he is from the neighbouring village). Such a marriage cannot be normalised. They may be from different gotras, but it is still wrong. It might happen in cities, but we don’t let it happen here,” he says."
}