{
    "id": "1h4owwb",
    "title": "Many parts of the country do not adhere to the first name-middle name-surname system. It is time official documents are revised to reflect this.",
    "url": "https://amp.scroll.in/article/1075052/why-india-must-decolonise-the-rigid-naming-format-required-for-official-documents",
    "selftext": "My application process for PAN card is such pain in a**. I'm someone who is from Tamil Nadu and don't have surname. Mandating people to add surnames is such a bullshit thing to do when India is comprising of diverse language, cultures, customs etc. \n\nPS: The problem is mandatory linking of AADHAR and the name standards have to match with aadhar exactly. For people who don't have surnames, it'll be difficult to go thru the process of application.",
    "flair": "Rant / Vent",
    "score": 168,
    "num_comments": 23,
    "created_utc": 1733121547.0,
    "convurl": "https://external-preview.redd.it/2oiYK1alXoxj_W4gh9bmlgOVVZqRy4I__Yv7CkAfrgg.jpg?auto=webp&s=cb58804eb465e4b7255e9ba40a2da554772254c6",
    "comments": [
        "Same here OP. I'm from TN too and can't done any KYC done online. Because the names in my Adhar and PAN don't match. The problem is we can't get PAN card without a surname and the name in the adhar should match with our names on school certificates and the birth certificate. It's a checkmate situation. Hope they do something about this.",
        "They have to do😭. Otherwise a simple process of online application may make  us to seek the browsing centres and they will charge for 300 - 500 rs for this application process. (But I somehow find the solution and did it by myself. I was mandated to add my father name as surname so that the AADHAR and PAN gets matched).",
        "Can you clarify what the issue is? My youngster has a single name without surname and we have Aadhaar and Passport for them. What would be the issue if we try to apply for PAN?",
        "The issue you will encounter is: \n\n1. You cannot enter your initial as prefix or suffix in a name, because it is a single letter.so initially what i did was just entered my name alone as it is.\n2. When you proceed to aadhar verification it usually fails when you just enter your sister name alone. ( Note:For aadhar the exact spellings of your sister name should be matched with the PAN)\n\nThe workaround is \n\nUnder 'First name' enter your sister name and 'surname' enter your father's name so that AAADHAR gets matched and verification is complete.",
        "How about filling a online petition kind of thing? I am sure, all the people who are responsible for PAN and AADHAR are aware of this thing. More importantly, there are lakhs of people, if not millions, who don't use surnames and are spread all over india. ",
        "Sure, from my side I'll try complaining via their email and see what response they give. I'll surely update you, if they gave any reply.",
        "Even I had the same problem, just keep your father's name as surname.\n\nMost MNCs ask for Surname and they don't accept a single character as a surname.",
        "Nothing will change. I went through the same process 2 years back. I had to add my Dad's first name as a surname to get  PAN card but before that, had to change Aadhar name to add the surname from just having an initial as well...",
        "Not their fault if some regions don’t follow the global standard.",
        "Bruh! Having caste surname is not a global standard",
        "Having a first name, middle name and last name is.",
        "While that article does highlight the issue in India, the First Name + Last Name is pretty much becoming a global standard esp with increasing use of software. Most web forms do require you to fill both or you end up filling seem other term.(US uses FNU for those without surname, most use the FN as LN).\n\nIf you do plan to travel/deal with things outside India, better to use FN+LN.",
        "Just expand the initial for your surname. This concept of initials is downright silly that's used only in TN & some parts of KA, AP. \n\nFwiw, I have a two letter initial. All my documents except PAN & Passport have initials only. My Aadhar & PAN are linked.",
        "I’m a Bengali but grew up all over the country. Had my aadhar made when I was in Mumbai and they just added my dad’s name as my middle name even though I have no middle name. No asking me if that’s ok- they just did it on their own accord. It isn’t in my birth certificate or on my passport. I didn’t think much of it at that time. Fast forward a few years later, lost my passport in Paris and went to embassy and the name in my aadhar n my local id  doesn’t match. Cue excessive bureaucracy and running around to solve all this.",
        "Typical software developer mindset lol",
        "It's their fault since they allowed the \"non-standard\" name in other certificates.",
        "I highly recommend reading this link if you're taking about naming conventions\n\nhttps://www.kalzumeus.com/2010/06/17/falsehoods-programmers-believe-about-names/",
        "There is no such thing as initial. your surname would be your father's first name ( expansion of your initial). Your name + your father's first name. thats how it should be in your legal documents",
        "What do you mean by a 'global standard'? Do you just mean what is popular? Because popular and a global standard are two different things. There are other countries/cultures/groups where middle names are not common",
        "Its insane how many non govt websites ask for this. Normal social media websites ask for a first name and a last name while some ask for a middle name. Half of their problems would be solved if they had a single name field.",
        "Middle names are generally optional. I personally don’t use own either.",
        "Depends on the website I guess. I sometimes get away with it by typing a space or NA",
        "Single name was fine a hundred or one thousand years ago but with the current overpopulation how many Murali's can you have.",
        "Sad to hear you've gone all these hurdles that too in foreign nation like Paris."
    ],
    "cleaned_text": "many parts country adhere first namemiddle namesurname system time official documents revised reflect application process pan card pain im someone tamil nadu dont surname mandating people add surnames bullshit thing india comprising diverse language cultures customs etc ps problem mandatory linking aadhar name standards match aadhar exactly people dont surnames itll difficult go thru process application ",
    "cleaned_title": "many parts country adhere first namemiddle namesurname system time official documents revised reflect",
    "cleaned_selftext": "application process pan card pain im someone tamil nadu dont surname mandating people add surnames bullshit thing india comprising diverse language cultures customs etc ps problem mandatory linking aadhar name standards match aadhar exactly people dont surnames itll difficult go thru process application",
    "cleaned_comments": "op im tn cant done kyc done online names adhar pan dont match problem cant get pan card without surname name adhar match names school certificates birth certificate checkmate situation hope something otherwise simple process online application may make us seek browsing centres charge rs application process somehow find solution mandated add father name surname aadhar pan gets matched clarify issue youngster single name without surname aadhaar passport would issue try apply pan issue encounter enter initial prefix suffix name single letterso initially entered name alone proceed aadhar verification usually fails enter sister name alone notefor aadhar exact spellings sister name matched pan workaround first name enter sister name surname enter fathers name aaadhar gets matched verification complete filling online petition kind thing sure people responsible pan aadhar aware thing importantly lakhs people millions dont use surnames spread india sure side ill try complaining via email see response give ill surely update gave reply even problem keep fathers name surname mncs ask surname dont accept single character surname nothing change went process years back add dads first name surname get pan card change aadhar name add surname initial well fault regions dont follow global standard bruh caste surname global standard first name middle name last name article highlight issue india first name last name pretty much becoming global standard esp increasing use software web forms require fill end filling seem termus uses fnu without surname use fn ln plan traveldeal things outside india better use fnln expand initial surname concept initials downright silly thats used tn parts ka ap fwiw two letter initial documents except pan passport initials aadhar pan linked im bengali grew country aadhar made mumbai added dads name middle name even though middle name asking thats ok accord isnt birth certificate passport didnt think much time fast forward years later lost passport paris went embassy name aadhar n local id doesnt match cue excessive bureaucracy running around solve typical software developer mindset lol fault since allowed nonstandard name certificates highly recommend reading link youre taking naming conventions thing initial surname would fathers first name expansion initial name fathers first name thats legal documents mean global standard mean popular popular global standard two different things countriesculturesgroups middle names common insane many non govt websites ask normal social media websites ask first name last name ask middle name half problems would solved single name field middle names generally optional personally dont use either depends website guess sometimes get away typing space na single name fine hundred one thousand years ago current overpopulation many muralis sad hear youve gone hurdles foreign nation like paris",
    "light_cleaned_title": "Many parts of the country do not adhere to the first name-middle name-surname system. It is time official documents are revised to reflect this.",
    "light_cleaned_selftext": "My application process for PAN card is such pain in a**. I'm someone who is from Tamil Nadu and don't have surname. Mandating people to add surnames is such a bullshit thing to do when India is comprising of diverse language, cultures, customs etc. PS: The problem is mandatory linking of AADHAR and the name standards have to match with aadhar exactly. For people who don't have surnames, it'll be difficult to go thru the process of application.",
    "light_cleaned_comments": "Same here OP. I'm from TN too and can't done any KYC done online. Because the names in my Adhar and PAN don't match. The problem is we can't get PAN card without a surname and the name in the adhar should match with our names on school certificates and the birth certificate. It's a checkmate situation. Hope they do something about this. They have to do😭. Otherwise a simple process of online application may make us to seek the browsing centres and they will charge for 300 - 500 rs for this application process. (But I somehow find the solution and did it by myself. I was mandated to add my father name as surname so that the AADHAR and PAN gets matched). Can you clarify what the issue is? My youngster has a single name without surname and we have Aadhaar and Passport for them. What would be the issue if we try to apply for PAN? The issue you will encounter is: 1. You cannot enter your initial as prefix or suffix in a name, because it is a single letter.so initially what i did was just entered my name alone as it is. 2. When you proceed to aadhar verification it usually fails when you just enter your sister name alone. ( Note:For aadhar the exact spellings of your sister name should be matched with the PAN) The workaround is Under 'First name' enter your sister name and 'surname' enter your father's name so that AAADHAR gets matched and verification is complete. How about filling a online petition kind of thing? I am sure, all the people who are responsible for PAN and AADHAR are aware of this thing. More importantly, there are lakhs of people, if not millions, who don't use surnames and are spread all over india. Sure, from my side I'll try complaining via their email and see what response they give. I'll surely update you, if they gave any reply. Even I had the same problem, just keep your father's name as surname. Most MNCs ask for Surname and they don't accept a single character as a surname. Nothing will change. I went through the same process 2 years back. I had to add my Dad's first name as a surname to get PAN card but before that, had to change Aadhar name to add the surname from just having an initial as well... Not their fault if some regions don’t follow the global standard. Bruh! Having caste surname is not a global standard Having a first name, middle name and last name is. While that article does highlight the issue in India, the First Name + Last Name is pretty much becoming a global standard esp with increasing use of software. Most web forms do require you to fill both or you end up filling seem other term.(US uses FNU for those without surname, most use the FN as LN). If you do plan to travel/deal with things outside India, better to use FN+LN. Just expand the initial for your surname. This concept of initials is downright silly that's used only in TN & some parts of KA, AP. Fwiw, I have a two letter initial. All my documents except PAN & Passport have initials only. My Aadhar & PAN are linked. I’m a Bengali but grew up all over the country. Had my aadhar made when I was in Mumbai and they just added my dad’s name as my middle name even though I have no middle name. No asking me if that’s ok- they just did it on their own accord. It isn’t in my birth certificate or on my passport. I didn’t think much of it at that time. Fast forward a few years later, lost my passport in Paris and went to embassy and the name in my aadhar n my local id doesn’t match. Cue excessive bureaucracy and running around to solve all this. Typical software developer mindset lol It's their fault since they allowed the \"non-standard\" name in other certificates. I highly recommend reading this link if you're taking about naming conventions There is no such thing as initial. your surname would be your father's first name ( expansion of your initial). Your name + your father's first name. thats how it should be in your legal documents What do you mean by a 'global standard'? Do you just mean what is popular? Because popular and a global standard are two different things. There are other countries/cultures/groups where middle names are not common Its insane how many non govt websites ask for this. Normal social media websites ask for a first name and a last name while some ask for a middle name. Half of their problems would be solved if they had a single name field. Middle names are generally optional. I personally don’t use own either. Depends on the website I guess. I sometimes get away with it by typing a space or NA Single name was fine a hundred or one thousand years ago but with the current overpopulation how many Murali's can you have. Sad to hear you've gone all these hurdles that too in foreign nation like Paris."
}