{
    "id": "10zg2o7",
    "title": "How a typical iPhone theft and phishing occurs. (Hope it helps)",
    "url": "https://www.reddit.com/gallery/10zg2o7",
    "selftext": "So, my dad got pickpocketed and someone took his iPhone at the vegetable(sabzi) market. He only realized when he came out of the whole place but it was already too late, tried going back to the vendors but no success.\nWe tried calling, phone’s switched off. Apple has phone tracking and we tried all that and  managed to get the location of the phone (pic attached) in Asansol (W.Bengal), the place had bunch of mobile store in close proximity and funnily a police station nearby. \nDad went to police station, did all the paperwork even gave the screenshot of the location, (un)surprisingly nothing happened. \nA few days go by and I get I text (pic attached) that the phone is switched on and click to track it, because I had mentioned my number to contact me, it asks you to login into his Apple account, the UI is identical, and voila nothing happens and I try again, and a minute or two later the Apple account gets unlinked from the phone, there goes the last hope.\nSo that was it and nothing was ever heard, either from the competent thieves or the incompetent police.\n\nSo-\nDon’t lose the phone.\nIf you do, know the type of links to NOT click.",
    "flair": "Crime",
    "score": 242,
    "num_comments": 39,
    "created_utc": 1676103879,
    "convurl": "https://i.redd.it/z8gkfxfuriha1.jpg",
    "comments": [
        "Even a teenager would know not to click on the random url ending in \"live\" when it comes to tracking and stuff.\nSo you helped them log in and they get a clean phone? Well.",
        "Ik, mistakes were made.",
        "try contacting apple, they can still brick the phone",
        "Thanks for sharing.",
        "was it stolen in asansol?",
        "Nope.\nAsansol seems like a (regional) hub where all of them go to. It’s just my guess.",
        "Yep",
        "from where was it stolen?",
        "I don’t wanna give away my location but say 250-ish kms away.",
        "No spelling and grammer mistake in the message. Link is also not like \"clickraajiphone.com\". Even someone like me can get trapped in it who has never lost an iphone or tried to recover it.",
        "Jamshedpur",
        "This is very common technique used to unlock stolen iPhones. It’s very unfortunate that you had to learn about this the hard way.",
        "There are multiple grammatical mistakes, capitalised on, no period at the end and I don't think apple would say \"dear customer your lost iPhone\" , makers of one of the world's most advanced tech  brand doesn't send msgs like these.",
        "That's okay, it happens, you bought your father another phone yet or no? lol",
        "Could you please point out single spelling mistake?",
        "LOL OP your phone is at the police station just outside Nigha (Sripur Police Station)\n\nhttps://imgur.com/a/RWHecwV\n\nThe police found your phone and then scammed you  ☠️",
        "Tf lol my father just lost his phone few days ago in sabzi mandi too",
        "My phone was snatched in Delhi and when it was briefly turned on it was in Bangladesh 2 weeks after.",
        "You did a good job to share modus operandi, it makes hacker lives difficult which you can take it some kind of small revenge.\n\nNow people will advice\\\\joke how ignorant of you to click link but take my word , it look so genuine and so expected so anybody could fall. \n\nMost of us have had stolen phones. It 'sks'. But hope you moved on..",
        "Thanks",
        "Yeah the region seems to a hub to be resold.",
        "Mandi gang.",
        "If there’s a scam going on police is always in someway.",
        "Yeah, and when you’re in that desperation it’s easy to slip.",
        "Ik there is a police station nearby, by the phone was stolen 250ish kms away from that location and then sent there.",
        "Your should have blocked the phone by registering a complaint on CEIR",
        "The person who buys the phone be like, kyu nahi chal raha",
        "how would apple know the owner lost the phone?",
        "Technically if you gave them the IMEI number, police can know a lot of details from the carrier provider ( airtel/jio etc).  \n. For example, network identifies a phone by IMEI number and can fetch various information like the sim currently in use and from that you can gather who SIM owner details. \nDo post it on LegalAdviceIndia to know what your options are in such a situation and how to pressure the cops to act on it.",
        "shit this dad has 2 families",
        "Lol Bengali 🚨",
        "I am sorry this happened to you. One of my friend got his phone stolen in Goa. He got the same kind of msg you got but he read the link properly and understood what is happening. Apparently where you enter your details is a form and the thief trick you to enter the details including the OTP on the next screen. My friend didn't do it obviously and filled the form with all kind of abuses. He never got his phone neither the police helped. I am sorry again.",
        "I don't think it's that easy, at the very least you need an FIR and even then the operators are very hesitant.",
        "My father's android phone was snatched in November 2020, all I could do was file a fir and ask airtel to block the sim.\nthis January got a call from nearby police station to come and collect the phone .\n\nSo have faith in Police, they will find your phone (unless the thieves scrap it and sell individual parts then there's no hope)"
    ],
    "cleaned_text": "typical iphone theft phishing occurs hope helps dad got pickpocketed someone took iphone vegetablesabzi market realized came whole place already late tried going back vendors success tried calling phones switched apple phone tracking tried managed get location phone pic attached asansol wbengal place bunch mobile store close proximity funnily police station nearby dad went police station paperwork even gave screenshot location unsurprisingly nothing happened days go get text pic attached phone switched click track mentioned number contact asks login apple account ui identical voila nothing happens try minute two later apple account gets unlinked phone goes last hope nothing ever heard either competent thieves incompetent police dont lose phone know type links click ",
    "cleaned_title": "typical iphone theft phishing occurs hope helps",
    "cleaned_selftext": "dad got pickpocketed someone took iphone vegetablesabzi market realized came whole place already late tried going back vendors success tried calling phones switched apple phone tracking tried managed get location phone pic attached asansol wbengal place bunch mobile store close proximity funnily police station nearby dad went police station paperwork even gave screenshot location unsurprisingly nothing happened days go get text pic attached phone switched click track mentioned number contact asks login apple account ui identical voila nothing happens try minute two later apple account gets unlinked phone goes last hope nothing ever heard either competent thieves incompetent police dont lose phone know type links click",
    "cleaned_comments": "even teenager would know click random url ending live comes tracking stuff helped log get clean phone well ik mistakes made try contacting apple still brick phone thanks sharing stolen asansol nope asansol seems like regional hub go guess yep stolen dont wan na give away location say ish kms away spelling grammer mistake message link also like clickraajiphonecom even someone like get trapped never lost iphone tried recover jamshedpur common technique used unlock stolen iphones unfortunate learn hard way multiple grammatical mistakes capitalised period end dont think apple would say dear customer lost iphone makers one worlds advanced tech brand doesnt send msgs like thats okay happens bought father another phone yet lol could please point single spelling mistake lol op phone police station outside nigha sripur police station police found phone scammed tf lol father lost phone days ago sabzi mandi phone snatched delhi briefly turned bangladesh weeks good job share modus operandi makes hacker lives difficult take kind small revenge people advicejoke ignorant click link take word look genuine expected anybody could fall us stolen phones sks hope moved thanks yeah region seems hub resold mandi gang theres scam going police always someway yeah youre desperation easy slip ik police station nearby phone stolen ish kms away location sent blocked phone registering complaint ceir person buys phone like kyu nahi chal raha would apple know owner lost phone technically gave imei number police know lot details carrier provider airteljio etc example network identifies phone imei number fetch various information like sim currently use gather sim owner details post legaladviceindia know options situation pressure cops act shit dad families lol bengali sorry happened one friend got phone stolen goa got kind msg got read link properly understood happening apparently enter details form thief trick enter details including otp next screen friend didnt obviously filled form kind abuses never got phone neither police helped sorry dont think easy least need fir even operators hesitant fathers android phone snatched november could file fir ask airtel block sim january got call nearby police station come collect phone faith police find phone unless thieves scrap sell individual parts theres hope",
    "light_cleaned_title": "How a typical iPhone theft and phishing occurs. (Hope it helps)",
    "light_cleaned_selftext": "So, my dad got pickpocketed and someone took his iPhone at the vegetable(sabzi) market. He only realized when he came out of the whole place but it was already too late, tried going back to the vendors but no success. We tried calling, phone’s switched off. Apple has phone tracking and we tried all that and managed to get the location of the phone (pic attached) in Asansol (W.Bengal), the place had bunch of mobile store in close proximity and funnily a police station nearby. Dad went to police station, did all the paperwork even gave the screenshot of the location, (un)surprisingly nothing happened. A few days go by and I get I text (pic attached) that the phone is switched on and click to track it, because I had mentioned my number to contact me, it asks you to login into his Apple account, the UI is identical, and voila nothing happens and I try again, and a minute or two later the Apple account gets unlinked from the phone, there goes the last hope. So that was it and nothing was ever heard, either from the competent thieves or the incompetent police. So- Don’t lose the phone. If you do, know the type of links to NOT click.",
    "light_cleaned_comments": "Even a teenager would know not to click on the random url ending in \"live\" when it comes to tracking and stuff. So you helped them log in and they get a clean phone? Well. Ik, mistakes were made. try contacting apple, they can still brick the phone Thanks for sharing. was it stolen in asansol? Nope. Asansol seems like a (regional) hub where all of them go to. It’s just my guess. Yep from where was it stolen? I don’t wanna give away my location but say 250-ish kms away. No spelling and grammer mistake in the message. Link is also not like \"clickraajiphone.com\". Even someone like me can get trapped in it who has never lost an iphone or tried to recover it. Jamshedpur This is very common technique used to unlock stolen iPhones. It’s very unfortunate that you had to learn about this the hard way. There are multiple grammatical mistakes, capitalised on, no period at the end and I don't think apple would say \"dear customer your lost iPhone\" , makers of one of the world's most advanced tech brand doesn't send msgs like these. That's okay, it happens, you bought your father another phone yet or no? lol Could you please point out single spelling mistake? LOL OP your phone is at the police station just outside Nigha (Sripur Police Station) The police found your phone and then scammed you ☠️ Tf lol my father just lost his phone few days ago in sabzi mandi too My phone was snatched in Delhi and when it was briefly turned on it was in Bangladesh 2 weeks after. You did a good job to share modus operandi, it makes hacker lives difficult which you can take it some kind of small revenge. Now people will advice\\\\joke how ignorant of you to click link but take my word , it look so genuine and so expected so anybody could fall. Most of us have had stolen phones. It 'sks'. But hope you moved on.. Thanks Yeah the region seems to a hub to be resold. Mandi gang. If there’s a scam going on police is always in someway. Yeah, and when you’re in that desperation it’s easy to slip. Ik there is a police station nearby, by the phone was stolen 250ish kms away from that location and then sent there. Your should have blocked the phone by registering a complaint on CEIR The person who buys the phone be like, kyu nahi chal raha how would apple know the owner lost the phone? Technically if you gave them the IMEI number, police can know a lot of details from the carrier provider ( airtel/jio etc). . For example, network identifies a phone by IMEI number and can fetch various information like the sim currently in use and from that you can gather who SIM owner details. Do post it on LegalAdviceIndia to know what your options are in such a situation and how to pressure the cops to act on it. shit this dad has 2 families Lol Bengali 🚨 I am sorry this happened to you. One of my friend got his phone stolen in Goa. He got the same kind of msg you got but he read the link properly and understood what is happening. Apparently where you enter your details is a form and the thief trick you to enter the details including the OTP on the next screen. My friend didn't do it obviously and filled the form with all kind of abuses. He never got his phone neither the police helped. I am sorry again. I don't think it's that easy, at the very least you need an FIR and even then the operators are very hesitant. My father's android phone was snatched in November 2020, all I could do was file a fir and ask airtel to block the sim. this January got a call from nearby police station to come and collect the phone . So have faith in Police, they will find your phone (unless the thieves scrap it and sell individual parts then there's no hope)"
}