{
    "id": "szy1in",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/szy1in/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 19,
    "num_comments": 5,
    "created_utc": 1645666215,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "How does one go about negotiating offers with another firm when you already have an offer in hand? What’s the range (10-50%?) increase in base pay that you can ask for? How do you bring up the joining bonus in an interview?",
        "am I good enough to work in small digital marketing company?\n\nLast website I made is: whitefieldexim.com, I can make these type of website in 5-7 days in WordPress... I'm good at using ps &amp; illustrator (also made their company brochure, linked in footer).",
        "I am hiring for three roles right now:\n\na) Orcale SOA Middleware developer (3+ YOE)\nb) .net Developer (4+ years)\nc) HR managers \n\nAll three roles have multiple openings.",
        "HIRING \n(Interns / Freelance / Full-time)\n\n* UI/UX Designer (Web/Mobile App Design)\n* Frontend Developer (React/Next/JS)\n* Business Analyst (Agile, Scrum, Technical Writing)\n\nAll roles are immediate opening, paid, and remote!\n\nDM me if you're interested.",
        "Start with asking for 50% at least , they might say they may have a cap around 30% or something. It all depends on how much the industry and that company allows for that\n\nFor joining bonus straight up ask if there is a joining bonus especially if they ask you to join within a week"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "one go negotiating offers another firm already offer hand whats range increase base pay ask bring joining bonus interview good enough work small digital marketing company last website made whitefieldeximcom make type website days wordpress im good using ps amp illustrator also made company brochure linked footer hiring three roles right orcale soa middleware developer yoe b net developer years c hr managers three roles multiple openings hiring interns freelance fulltime uiux designer webmobile app design frontend developer reactnextjs business analyst agile scrum technical writing roles immediate opening paid remote dm youre interested start asking least might say may cap around something depends much industry company allows joining bonus straight ask joining bonus especially ask join within week",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "How does one go about negotiating offers with another firm when you already have an offer in hand? What’s the range (10-50%?) increase in base pay that you can ask for? How do you bring up the joining bonus in an interview? am I good enough to work in small digital marketing company? Last website I made is: whitefieldexim.com, I can make these type of website in 5-7 days in WordPress... I'm good at using ps &amp; illustrator (also made their company brochure, linked in footer). I am hiring for three roles right now: a) Orcale SOA Middleware developer (3+ YOE) b) .net Developer (4+ years) c) HR managers All three roles have multiple openings. HIRING (Interns / Freelance / Full-time) * UI/UX Designer (Web/Mobile App Design) * Frontend Developer (React/Next/JS) * Business Analyst (Agile, Scrum, Technical Writing) All roles are immediate opening, paid, and remote! DM me if you're interested. Start with asking for 50% at least , they might say they may have a cap around 30% or something. It all depends on how much the industry and that company allows for that For joining bonus straight up ask if there is a joining bonus especially if they ask you to join within a week"
}