{
    "id": "12a337w",
    "title": "BJP faces Bengal firestorm as TMC gets ammo after gunning down of ‘coal smuggler’ Raju Jha",
    "url": "https://indianexpress.com/article/political-pulse/bjp-faces-bengal-firestorm-as-tmc-gets-ammo-after-gunning-down-of-coal-smuggler-raju-jha-8534142/",
    "selftext": "Raju had joined BJP ahead of 2021 Assembly polls; what made killing of the ‘history-sheeter’ murkier was that the SUV he was riding allegedly belongs to an accused of cattle smuggling case being probed by CBI",
    "flair": "Crime",
    "score": 116,
    "num_comments": 28,
    "created_utc": 1680480241.0,
    "convurl": "https://external-preview.redd.it/ZdtY9rIlRybwdbMuTY4aWQDH7Gy8WRquSbajaDcjiKY.jpg?auto=webp&v=enabled&s=032166c46aff3d5959ab5ed14b9d4cbc8d194c5e",
    "comments": [
        "We don't need killings to make things right Baba. We need inquiry commissions, police reforms and Justice. Also a national media that reports consistently on these things.",
        "Good joke. We need not expect to have what we cannot do in the next 100 years. We should focus on what we can do now with the options we have now. We don't have time.",
        "Exactly. Bcoz the very same things can be done by BJP. Less power in the hands of the govt and administration is always better. Govt and administration should also be held accountable. You never know when the table turns. There may br a BJP govt in bengal some day. They could also do what Mamta is doing.",
        "We need to ensure that there is no BJP govt in Bengal and we need to ensure it by hook or by crook instead of doing nothing because BJP can retaliate or they may oneday come to power. Moreover, BJP does not need a reason to kill us. They will kill us or put us in jail by hook or by crook even if we just protest or even if we are mere bystanders.",
        "Nope. The people of bengal have to decide who they want. I stay in MH and I dont want BJP. It is upto people of bengal who thry select. By hook or by crook means no matter what. Maybe if power was with someone like you, you would be a dictator. No wonder leftist ideas are on a decline.",
        "Which idiot told you I am a leftist? Never make silly assumptions. Yes, I mean \"no matter what\", because our lives, our culture, our future are at stake, not yours my friend. And we have to do everything to save it, everything in our capacity. If for that you wanna call me a dictator, that's a badge of honor for me.",
        "You may not identify as a leftist but this is a leftist sub.Everything should be done to defeat BJP. But that means by not voting for BJP and raising voice against BJP. Targeted killing should not happen. If BJP comes to power in bengal and does the same things, self glorified dictators like you would be the first ones calling BJP a dictatorship. The problem with people like you is that you think - means justify the end. People like you make actual liberals look like hypocrites.",
        "I don't care what you label me. I would rather be called a dictator or a hypocrite or whatever but we won't let our brothers lynched. I won't  get lynched for eating beef. No way. \n\nApna ghar sambhalo bhai. Lekin sambhalega kaise? Wo to gaya haath se. Because BJP maharashtra mein democratically haarkar bhi jeet gayi. Only a fool thinks that BJP can be defeated only by democratic means. No political party in India wins by just democratic means. Moreover, fascists have never been defeated democratically. Have you read the history of fascism, by any chance?",
        "Even i dont want anyone to get lynched for eating beef. Doesnt mean i want BJP leaders to be killed . Difference between you and me is that you will only have a problem if YOUR people will be killed and you are happy if OTHERS get killed. \n\nAnd talking about MH, Infact BJP+SS got the mandate of people bcoz they fought elections together. I have been a student of history for a decade so please spare me the history bs. It is you who THINKS BJP is fascist. Mamta is far more fascist as compared to BJP. But she got the votes from her people and she deserves to be the CM. I support her bcoz she got the mandate whereas you think that if peoples madate means nothing.  You dont even know who was given the mandate in Maharashtra. All you care is BJP and Modi.",
        "If you don't want anybody to get lynched, ensure by every means that the lynchers dont get to power. I dont care if you want BJP guys to be alive or dead. Is none of my concern.  They can go to hell for all I care. \n\nHaan..toh MH mein kya kar liye? Kuchh kar paye? Nahi. If you are good in math, teach math. If you can't do math, don't teach math to others. First you folks defeat BJP. Then tell us what to do with BJP. Haarkar mat sikhao hamein ki kaise hamein jeetna chahiye. \n\nI don't  like Momo ta didi. But that does not mean I have to like BJP. Don't give me that crap logic. \n\nYou have been a student of history for a decade? Good. Tell me which KZ had a gas chamber but nobody was ever gassed in that KZ during the Nazi regime.",
        "How do we get all of those?",
        "We can start with resisting cynical proclivities towards the effectiveness of mass violence. Assuming hanging people brings justice or retains power is a vector towards meaningless cycles of violence \n\nFor the path ahead, we have our constitution and the collective struggle for rights that it guarantees should we choose to fight for them.",
        "Shouldn't TMC be questioned instead?"
    ],
    "cleaned_text": "bjp faces bengal firestorm tmc gets ammo gunning coal smuggler raju jha raju joined bjp ahead assembly polls made killing historysheeter murkier suv riding allegedly belongs accused cattle smuggling case probed cbi ",
    "cleaned_title": "bjp faces bengal firestorm tmc gets ammo gunning coal smuggler raju jha",
    "cleaned_selftext": "raju joined bjp ahead assembly polls made killing historysheeter murkier suv riding allegedly belongs accused cattle smuggling case probed cbi",
    "cleaned_comments": "dont need killings make things right baba need inquiry commissions police reforms justice also national media reports consistently things good joke need expect next years focus options dont time exactly bcoz things done bjp less power hands govt administration always better govt administration also held accountable never know table turns may br bjp govt bengal day could also mamta need ensure bjp govt bengal need ensure hook crook instead nothing bjp retaliate may oneday come power moreover bjp need reason kill us kill us put us jail hook crook even protest even mere bystanders nope people bengal decide want stay mh dont want bjp upto people bengal thry select hook crook means matter maybe power someone like would dictator wonder leftist ideas decline idiot told leftist never make silly assumptions yes mean matter lives culture future stake friend everything save everything capacity wan na call dictator thats badge honor may identify leftist leftist subeverything done defeat bjp means voting bjp raising voice bjp targeted killing happen bjp comes power bengal things self glorified dictators like would first ones calling bjp dictatorship problem people like think means justify end people like make actual liberals look like hypocrites dont care label would rather called dictator hypocrite whatever wont let brothers lynched wont get lynched eating beef way apna ghar sambhalo bhai lekin sambhalega kaise wo gaya haath se bjp maharashtra mein democratically haarkar bhi jeet gayi fool thinks bjp defeated democratic means political party india wins democratic means moreover fascists never defeated democratically read history fascism chance even dont want anyone get lynched eating beef doesnt mean want bjp leaders killed difference problem people killed happy others get killed talking mh infact bjpss got mandate people bcoz fought elections together student history decade please spare history bs thinks bjp fascist mamta far fascist compared bjp got votes people deserves cm support bcoz got mandate whereas think peoples madate means nothing dont even know given mandate maharashtra care bjp modi dont want anybody get lynched ensure every means lynchers dont get power dont care want bjp guys alive dead none concern go hell care haantoh mh mein kya kar liye kuchh kar paye nahi good math teach math cant math dont teach math others first folks defeat bjp tell us bjp haarkar mat sikhao hamein ki kaise hamein jeetna chahiye dont like momo ta didi mean like bjp dont give crap logic student history decade good tell kz gas chamber nobody ever gassed kz nazi regime get start resisting cynical proclivities towards effectiveness mass violence assuming hanging people brings justice retains power vector towards meaningless cycles violence path ahead constitution collective struggle rights guarantees choose fight shouldnt tmc questioned instead",
    "light_cleaned_title": "BJP faces Bengal firestorm as TMC gets ammo after gunning down of ‘coal smuggler’ Raju Jha",
    "light_cleaned_selftext": "Raju had joined BJP ahead of 2021 Assembly polls; what made killing of the ‘history-sheeter’ murkier was that the SUV he was riding allegedly belongs to an accused of cattle smuggling case being probed by CBI",
    "light_cleaned_comments": "We don't need killings to make things right Baba. We need inquiry commissions, police reforms and Justice. Also a national media that reports consistently on these things. Good joke. We need not expect to have what we cannot do in the next 100 years. We should focus on what we can do now with the options we have now. We don't have time. Exactly. Bcoz the very same things can be done by BJP. Less power in the hands of the govt and administration is always better. Govt and administration should also be held accountable. You never know when the table turns. There may br a BJP govt in bengal some day. They could also do what Mamta is doing. We need to ensure that there is no BJP govt in Bengal and we need to ensure it by hook or by crook instead of doing nothing because BJP can retaliate or they may oneday come to power. Moreover, BJP does not need a reason to kill us. They will kill us or put us in jail by hook or by crook even if we just protest or even if we are mere bystanders. Nope. The people of bengal have to decide who they want. I stay in MH and I dont want BJP. It is upto people of bengal who thry select. By hook or by crook means no matter what. Maybe if power was with someone like you, you would be a dictator. No wonder leftist ideas are on a decline. Which idiot told you I am a leftist? Never make silly assumptions. Yes, I mean \"no matter what\", because our lives, our culture, our future are at stake, not yours my friend. And we have to do everything to save it, everything in our capacity. If for that you wanna call me a dictator, that's a badge of honor for me. You may not identify as a leftist but this is a leftist sub.Everything should be done to defeat BJP. But that means by not voting for BJP and raising voice against BJP. Targeted killing should not happen. If BJP comes to power in bengal and does the same things, self glorified dictators like you would be the first ones calling BJP a dictatorship. The problem with people like you is that you think - means justify the end. People like you make actual liberals look like hypocrites. I don't care what you label me. I would rather be called a dictator or a hypocrite or whatever but we won't let our brothers lynched. I won't get lynched for eating beef. No way. Apna ghar sambhalo bhai. Lekin sambhalega kaise? Wo to gaya haath se. Because BJP maharashtra mein democratically haarkar bhi jeet gayi. Only a fool thinks that BJP can be defeated only by democratic means. No political party in India wins by just democratic means. Moreover, fascists have never been defeated democratically. Have you read the history of fascism, by any chance? Even i dont want anyone to get lynched for eating beef. Doesnt mean i want BJP leaders to be killed . Difference between you and me is that you will only have a problem if YOUR people will be killed and you are happy if OTHERS get killed. And talking about MH, Infact BJP+SS got the mandate of people bcoz they fought elections together. I have been a student of history for a decade so please spare me the history bs. It is you who THINKS BJP is fascist. Mamta is far more fascist as compared to BJP. But she got the votes from her people and she deserves to be the CM. I support her bcoz she got the mandate whereas you think that if peoples madate means nothing. You dont even know who was given the mandate in Maharashtra. All you care is BJP and Modi. If you don't want anybody to get lynched, ensure by every means that the lynchers dont get to power. I dont care if you want BJP guys to be alive or dead. Is none of my concern. They can go to hell for all I care. Haan..toh MH mein kya kar liye? Kuchh kar paye? Nahi. If you are good in math, teach math. If you can't do math, don't teach math to others. First you folks defeat BJP. Then tell us what to do with BJP. Haarkar mat sikhao hamein ki kaise hamein jeetna chahiye. I don't like Momo ta didi. But that does not mean I have to like BJP. Don't give me that crap logic. You have been a student of history for a decade? Good. Tell me which KZ had a gas chamber but nobody was ever gassed in that KZ during the Nazi regime. How do we get all of those? We can start with resisting cynical proclivities towards the effectiveness of mass violence. Assuming hanging people brings justice or retains power is a vector towards meaningless cycles of violence For the path ahead, we have our constitution and the collective struggle for rights that it guarantees should we choose to fight for them. Shouldn't TMC be questioned instead?"
}