{
    "id": "16nfjtw",
    "title": "Sonia echoes party’s call for OBC quota within women’s Bill; Cong govt differed in 2010",
    "url": "https://indianexpress.com/article/political-pulse/sonia-gandhi-congress-obc-quota-womens-reservation-bill-speech-lok-sabha-8948169/",
    "selftext": "Before Bill was passed by RS in 2010, UPA govt said no data was available for quota within quota including OBCs in absence of caste census",
    "flair": "Politics",
    "score": 2,
    "num_comments": 2,
    "created_utc": 1695197156.0,
    "convurl": "https://external-preview.redd.it/JbyinaBJr2rLU2XZKvsK9DglkxhdhdeUb59iGfmEBMU.jpg?auto=webp&s=05049e1f2190bbf2b9d4d0a7e772c3cbe1517843",
    "comments": [
        ">Replying to the discussion on the Bill on March 9, 2010, before its passage in the Rajya Sabha, the then Law Minister M Veerappa Moily said: “I would like to clarify about reservation for OBCs, minorities and the rest. As you all know, as on today, we have reservations only for Scheduled Castes/Scheduled Tribes. We do not have the data for the entire nation because after 1931, no national Census (for castes) has been done.”\n\n>Speaking on the Bill brought by the Modi government Wednesday, Sonia demanded that a caste census be conducted immediately.\n\n>“The Congress party supports this Bill. We will be happy if this Bill is passed. But, at the same time, we have concerns. I want to ask a question: For the last 13 years, Indian women have been waiting for their political responsibility. Now they are being told to wait for some more years, Sonia said, adding: “How many years? Two years, four years, six years, eight years? Is this behaviour towards Indian women appropriate? The Indian National Congress demands that this Bill be operationalised immediately. Along with that, caste census should be conducted to ensure reservation for women from Scheduled Castes, Scheduled Tribes and OBCs… The government should take those steps needed to make it a reality,” Gandhi said.\n\n>She said any delay in implementation of the Bill would be gross injustice to Indian women"
    ],
    "cleaned_text": "sonia echoes partys call obc quota within womens bill cong govt differed bill passed rs upa govt said data available quota within quota including obcs absence caste census ",
    "cleaned_title": "sonia echoes partys call obc quota within womens bill cong govt differed",
    "cleaned_selftext": "bill passed rs upa govt said data available quota within quota including obcs absence caste census",
    "cleaned_comments": "replying discussion bill march passage rajya sabha law minister veerappa moily said would like clarify reservation obcs minorities rest know today reservations scheduled castesscheduled tribes data entire nation national census castes done speaking bill brought modi government wednesday sonia demanded caste census conducted immediately congress party supports bill happy bill passed time concerns want ask question last years indian women waiting political responsibility told wait years sonia said adding many years two years four years six years eight years behaviour towards indian women appropriate indian national congress demands bill operationalised immediately along caste census conducted ensure reservation women scheduled castes scheduled tribes obcs government take steps needed make reality gandhi said said delay implementation bill would gross injustice indian women",
    "light_cleaned_title": "Sonia echoes party’s call for OBC quota within women’s Bill; Cong govt differed in 2010",
    "light_cleaned_selftext": "Before Bill was passed by RS in 2010, UPA govt said no data was available for quota within quota including OBCs in absence of caste census",
    "light_cleaned_comments": ">Replying to the discussion on the Bill on March 9, 2010, before its passage in the Rajya Sabha, the then Law Minister M Veerappa Moily said: “I would like to clarify about reservation for OBCs, minorities and the rest. As you all know, as on today, we have reservations only for Scheduled Castes/Scheduled Tribes. We do not have the data for the entire nation because after 1931, no national Census (for castes) has been done.” >Speaking on the Bill brought by the Modi government Wednesday, Sonia demanded that a caste census be conducted immediately. >“The Congress party supports this Bill. We will be happy if this Bill is passed. But, at the same time, we have concerns. I want to ask a question: For the last 13 years, Indian women have been waiting for their political responsibility. Now they are being told to wait for some more years, Sonia said, adding: “How many years? Two years, four years, six years, eight years? Is this behaviour towards Indian women appropriate? The Indian National Congress demands that this Bill be operationalised immediately. Along with that, caste census should be conducted to ensure reservation for women from Scheduled Castes, Scheduled Tribes and OBCs… The government should take those steps needed to make it a reality,” Gandhi said. >She said any delay in implementation of the Bill would be gross injustice to Indian women"
}