{
    "id": "1c3ztje",
    "title": "Air India is still a joke. Not only do the planes suck but the ground staff is extremely incompetent as well",
    "url": "https://www.reddit.com/gallery/1c3ztje",
    "selftext": "Was flying delhi to San Francisco on Air India unfortunately (not in my hands). The queue to checkin baggage in delhi was one of the slowest. The person in front of me was supposed to fly to Riyadh. His flight was delayed by some 14 hours (was supposed to leave at 200 but now 1800) and the moron staff gave him his ticket saying its morning 6am when it clearly read 1800. They even forgot to return him his passport and the lady also forgot to hand back mine to me. Thankfully, i realized walking not 20 m away from the kiosk.\n\nI had a connection to san diego from SF. She said you can collect your luggage at san diego when i was 100% sure that is not how it works and ill have to collect it at SF. And thats how it happened as well. Imagine some poor elderly people travelling instead who wouldnt know how it works.\n\nThe planed sucked as usual with broken seats. In flight entertainment is a joke with the most piss poor collection of movies.\n\nWas flying a b777 and the way it shook in turbulence made me believe it might be my last flight given how poorly these are maintained.\n\nThe flight landed 30 min early but had to wait for 30 min in the plane for the sky bridge.\n\nNet net avoid air india if you can.",
    "flair": "Rant / Vent",
    "score": 509,
    "num_comments": 144,
    "created_utc": 1713117915.0,
    "convurl": "https://i.redd.it/jwvbals3jhuc1.jpg",
    "comments": [
        "Time to say TaTa",
        "The crowd which travels on these planes treats them like the worst. Children going berserk testing their strength on trays and screen. Parents not giving a shit. Toilets gone to shit an hour into the flight. \n\nNot defending AI. They can of course replace the broken parts, maintain a semblance of cleanliness so that people take the cue and behave accordingly. But there is probably something psychological at play here that the moment these NRIs step into an AI plane they think they have landed in India and start treating the craft accordingly.",
        "Dont disagree. I dont even know how some of these things broke down. Parents cant keep a check on their infants while they go rummaging and destroying things. We as a society suck, honestly",
        "Avoid air India ❌\n\n\nAvoid India ✅ ",
        "Really. The reason I won't fly AI even on new 787 Dreamliner is their sorry record of letting people in the cabin, smuggling family members onboard. Service doesn't matter much if the price is right but I dread to think what if the same unprofessional attitude extends to pilots, which does to some extent. I hope the takeover gets rid of the unprofessionalism.",
        "Looks like you were unlucky with the plane as AI has 2 flights sfo-del (173/174 and 183/184) and only the former uses the old crappy 77Ls while the latter one uses the Delta planes leased by AI. Also SFO-BOM and SFO-BLR use the new A350s which are all nice. \n\nBut yes rest of the service is probably the same.",
        "That's the plan man",
        "Same.\n\n\nI always felt I that I deserve better than what this country offers me with my taxes ",
        "Where did you get the info that a350 have been deployed for intl routes ? AFAIK its still doing domestic routes",
        "The Mumbai and Bangalore flights to SFO use the leased Delta 777-200s and not A350s",
        "I wouldn't get on one even if it was free.",
        "It will take at least 5-7 years to see meaningful changes. The old ‘unionised’ people will exit and a newer lot will come in. Performance based pay etc will come in. It will take time…",
        "I was very surprised when I found out that they have 787",
        "Yes you are right. I had read somewhere that they were going to put the new A350s on those routes and assumed it had already happened. My bad.",
        "Yes my mistake. Removing the wrong info from my comment.",
        "Me and my parents go to india twice a year from jfk and never fly air india. The business class in air india is worse than economy in emirates. The service is absolutely garbage and airplanes are dated.",
        "5-7 is mighty optimistic",
        "I mean…I’d go if it was free. Heck even half the ticket price of Qatar airways.\n\nProblem is, they don’t operate from dfw and they’re not cheap. So Qatar it is.",
        "I live in the US and travel back to India atleast once every year. I’ve tried a few airlines (Swiss, Finn air, Lufthansa, United, Air India etc) \n\nI usually prefer direct flights cause the pain is over faster lol but whenever I have a hopping flight. The second leg (to India) and the first leg (from India) is usually more chaotic than the other leg. It has yo be because of the crowd. It’s been more than 7 years and every time I notice that crew is checked out on the India leg cause people just don’t respect queues, orders. They treat the crew and the planes like shit just cause they paid for it. I’m not surprised crew doesn’t give a fuck. And when the crew tries to be a little strict, these fucks will cry racism. It’s a cycle. Such stereotypes are perpetuated cause of genuinely shitty behaviors by Indian travelers",
        "Air india is one of the biggest images of how pathetic & terrible our country's infrastructure quality is regardless of the immensely increasing quantity in infrastructure projects since 2014",
        "And they want to merge Vistara with this crap😪",
        "Yes, true. My family travelled AI 3 months back from Toronto to Delhi & it was worst flight experience out of 5 different airlines we have tried.",
        "Abe randi",
        "Average r/india member",
        "Air India is the \"SBI\" of the aviation industry.",
        "Sfo delhi has the absolute worst flight. I flew it and it was like flying a trash can. My parents flew it and my dad was so mad at the quality he turned into a Karen for the first time and they ended up giving a voucher upon landing and the staff told my mom not to ever fly that sector again. Even the staff are helpless. \n\nI was hopeful that this year they would start introducing all the new planes they purchased but it looks like it was just a PR stunt",
        "Man, that's extremely dangerous actually. That plane can end up on an episode of Mentour Pilot really soon. I pray for the innocent lives that have to travel with this broken plane.",
        "And then become a burden on another country while hating Biharis.",
        "Boeing is shit company. A fine example of failure of crapitalism.",
        "dude i flew their 787 from zurich to delhi twice this year unfortunately, i was in business class and holy shit was it bad, everything was broken, the electro chromatic windows didnt work and some kid had fucking scribbled on the side pane it seemed",
        "SBI offers best online services, better exchange rate than any other Indian bank on Indian soil.\n\n\nMy stupid ICICI card got locked when I was out of India but SBI stayed strong.",
        "orders with Boeing & Airbus for new aircraft’s + signed contracts for existing fleet with leading MROs for TCS services is actually a very very good sign. I’m aware LHT is also pursuing them for MRO business.",
        "Thanks for proving the point.",
        "Vistara was the gold standard of domestic flights. By far the best in the Indian market.",
        "Haaaaaa I can see when Qatar and emirates from DFW taking off every other day.",
        "So, when are you both leaving? Better leave fast because western countries are starting to hate immigration. Might not get a chance later.",
        "Flew AI inside India (Delhi to Bombay) around end December. Broken arm rests, television not working - anything that could break, broke.\n\nResponse to complaint? “Please bear with us, we are in the process of upgrading our fleet” upgraded nahin hai toh muft mein chalao, seat ka charge kar rahe ho toh bare minimum is a working seat.",
        "modijis and many indians answer : privatization is the solution to all indian ills",
        "I took Air India for my first flight out of India as it was \"India's official carrier\". Journey was almost 24h long and obviously bad. However next time I flew Air France and then I realized what a shitshow Air India was. And AI was also the most expensive one. \n\nSince then, I use [flights.google.com](http://flights.google.com) to pick my flight and not much \"brand conscious\".",
        "I think, you received the services during lunch at counter number 3, without going to counter number 2 and 1.",
        "Better wait in line than pay whatever the fuck those \"hidden card charges\" are. I know it's not the best in terms of customer service but i value \"value\" more than fancy lady speaking in English.\n\n\nI use SBI for remittance and by far it's the cheapest. ",
        "Their fleet is one of the most diverse fleets in the world and the ground assets such as the Heathrow Hangar are mouth watering to a proper aviation executive. The problem is government blasting has caused one the premier airlines in the world.to become this way. And when it is sold, everyone has a hue and cry about the government selling assets away. Wait for a few years. With the Singapore airlines funding, and tata operating it, it will get back. I flew in the new plane and they were really good. The entertainment section is the only one that needs to be looked after.",
        "I had to fly in emergency during covid. I had to fly it, after 20+ years.   \nI was not ready for the horrer...broken plane and panels. Staff was really friendly but the plane was in shambles.  \nI felt embarrased that this is the national carrier.",
        "I was on an AI flight from Vancouver to Delhi about 6 weeks ago. It was a 13 hour flight if I remember correctly. The plane was by far the worst I had ever seen. If I ordered a taxi that was in such a state, I wouldn't get in. Some of the arm rests were being held together with duct tape covering the controls and headphone outlet, the backside of the arm rest of the seat in front of me had no cover on it anymore, exposing bent away and sharp metal edges. NONE of the board entertainment worked in the whole plane and to add insult to injury they put complimentary headphones on every seat. The goddamn board entertainment didn't even work, WTF do I need headphones for??? The worst thing was the flight attendant whom I asked if she had any way of finding out what's in the food we were going to receive later because I am allergic to nuts. By the time they gave out the food she had completely forgotten (or plain ignored) my request, so I asked again if there were nuts in the meal she gave me. She simply said no, I got the aluminum container with the main meal, looked at the bottom and found a sticker that had the ingredients listed on it, clearly stating that it contained nuts. No need to say, WORST F***ING AIRLINE EVER. 4 weeks later I flew from Delhi to Frankfurt with Vistara. Amazing plane, great entertainment, good food and friendly staff.",
        "BSNL.",
        "I believe air india is getting new planes or renovating their current planes, I went from toronto to delhi and the flight was exactly how youve shown, it was complete garbage, it was unhygienic, things were broken, and the TV didnt work on a 14 hour flight, and the staff didnt speak english or hindi either but on my return flight it was completely different, the plane looked pretty new and modern and it was clean and nothing was broken, the TV also worked, its honestly a 50/50 with Air India as of now, but I think it will change as I believe they're renovating their fleet and getting new planes, though i'm still not flying with them again (for now), I dont mind paying an extra $200 for a more consistent and overall better experience with another airline.",
        "When was air India ever a premier airline in the world. I've been flying since the 80s and have never thought close to that",
        "If you're not changing things you are just as useless as you're treating them",
        "They're in a transition, hoepfully things get better",
        "You’re lucky your in-flight entertainment was working. Sometimes it’s broken for the whole cabin and they’re handing out magazines to the passengers instead.\n\nI once opened the lavatory door and the whole panel below the sink came off hanging. Lol",
        "Yeah it's really bad. Especially entertainment system. My touch screen was not working, the controller was barely operational and it was so dirty too. But atleast I was lucky to have a working one. The system beside couldn't even turn on at all. He was so bored and pissed off during the flight. And the movie library is crap. Food was really really bad. As if all this was not enough the plane itself was dirty and broken all over the place. That's it, that's the last time I flew on air India. Going with British airways (even though it's not the best it's at least better than AI) and virgin Atlantic. \n\nThen there's a weird thing I noticed. Air India gives out instructions in Hindi and English no regional language while British airways took time to include instructions in regional language. I thought it was the only flight. Someone posted the same that even the domestic flights don't bother to give instructions in regional languages. When an international airline (one from a country like the UK) had cared enough to include regional language, why couldn't our airlines do the same?",
        "Air India is now run by Tata and everything has changed /s.",
        "Ratan Tata has made Air India da best saar! Ratan sir rox! ^/s",
        "AI is that deathtrap of a choice that 1 should take only if there's absolutely no other option left. And if you do take that option, factor in a 10hr delay on both ends for some peace of mind. Otherwise you'll lose your sanity!",
        "It's in the midst of a multi-year transition. It's going to take time and there is a 50-50 chance it can't be saved.",
        "Till JRD Tata ran it. It was world class. At that point, first class had actual silver cutlery.",
        "Ratan Tata Saar, India is so praud of you Saar. 🇳🇪",
        "SBI credit card app and Yono is good and smooth. I was irritated when I first used the HDFC app.",
        "Regarding the windows, the crew can lock them (they are supposed to be locked in zero shade during takeoff and landing so that your eyes are adjusted for outdoor lighting in the event of a crash), but the crew is sometimes too lazy to unlock the windows when it is safe.",
        "Nationalizing air india caused all of this.  The company had huge debts.   For your info we made the same freaking ambassador car from 1950 to 1990s.  with almost same cost.   Capitalism and privatization is good if it is regulated properly..!",
        "They are terrible, but that is not the reason for Air India's issues. Emirates has more than a hundred Boeing planes and they have great service.",
        "I mean they had placed orders for new planes and that may have lead to some funding problems for the pilots. \nBut, overall a lot of recapitalization will be required for a turn around. Also, they went with new planes that will have long production times, so we wil be stuck with these planes, that came from the govt as is.",
        "You are getting downvoted by AI employees.",
        "Thankfully i was carrying a loaded ipad so killing time wasnt that difficult",
        "My recent flight MAA-SIN entire trip and flight urine smells. Economy class just two toilets available 100+ passengers.",
        "How am I treating them?",
        "More I read about India in reddit, the more I feel it is difficult to be proud indian. How much patriotic does one have to be to  like Air India?",
        "Because they don't need to leave fast, they're allowed to be displeased. What a stupid reply you have for that",
        "I have Air India stories that still give me nightmares. AC conking off 10 mins after a 17 hr flight takes off. No AC for 14 hours on the flight!! Tray tables falling out of place, overhead cabins opening during flight, crew wearing crumpled clothes, flight interiors smelling like an old Indian kitchen. Drunk, ill mannered passengers, out of control children. This was 10 years ago and I have never traveled via AI since.",
        "It will take few more years for tata to turn things around. Everyone is still in the govt job mentality. Overhauling of existing planes will be done this and next year. A350s are gonna be used in these routes soon as well. \nBiggest mistake in aviation sector that Indian govt did was nationalising all airlines.",
        "There is a reason people choose Air-India though even with all these problems eh? It provides a direct connection to US when US airlines cannot compete on. There are no direct flights from SF/LA to India. And when you can complete that journey in less than 24 hours why not. Why deal with the 3-4hr stopover in Dubai/Doha.",
        "They want to leave, i told them to leave. What's stupid about that? Showing displeasure is fine. But wanting to leave by comparing the standard of living between India and rich countries is stupid. India has a very large poor population, so tax benefits will be going towards them. You can't expect EU level of benefits from taxes. Also, the government provides free healthcare, cheap schooling, free baby childbirth, vaccination, ration for newborns etc. to all citizens. But waiting time will be more for obvious reasons (large poor population). So, these people will hardly go there. And complain that I deserve better for the taxes I pay.\n\nIf someone wants to leave what do you expect me to say? Beg them to stay back? If they want to leave, let them leave.",
        "Tata thought it would buy AirIndia for peanuts and transform that to Vistara.\nToday Vistara looks more like AirIndia.",
        "Air india right now is the most sarkari airline that it can exiet",
        "Not for all ills, but this one sure. AI has been known for poor quality even before the sale to Tata. Earlier it was the taxpayer's problem to pay for the repair of stuff like this, and the ensuing corruption. Now it's the problem of Tata's shareholders",
        "To be honest, I'm always abused much harsher whenever I say I want to leave India ",
        "The scariest moment of my life was when I was flying with Air India and I noticed the plane wings have cello tape sticking around. \n\nI admire your courage to travel with them all the way to New York in such broken condition.",
        "I have to clear some government exams & complete my PhD, after that I'll leave. ",
        "Give them some time, they're fixing it.\nThe new A350s are killer",
        "Please don't insult SBI , they're bad but still way better than Air India ☠️😂",
        "Leave it... nobody wants you a hater",
        "We cannot wait to have a door plug opening incident with AI in order to call out boeing. However it's true that issues of AI lately have been service related.",
        "I dont hate anything.\n\n\nI just feel I deserve better lifestyle than what this country offers & I'm working forwards to attain it ",
        "That what decades of 'government job' does to you....",
        "If your goal was to leave then, you should have completed your PhD from abroad itself. PhD is better aboard.\n\nIf you are a PhD student, what taxes are you paying to expect you deserve a better country?",
        "To be fair, passengers also don’t treat Air India as they would treat a Vistara or Indigo, most are at their worst behaviour. Yes, it because how AirIndia is perceived, but still..",
        "PhD abroad is much more costly.\n\n\nHere it's way cheaper. \n\n\nIf required, I'll do post PhD fellowships abroad or even repeat my PhD if required \n\n\nWhatever you buy, you pay some taxes. \n\n\nTaxes are paid by multiple people if my family.\n\n\nAnyway, like I said earlier, I feel I deserve better than what this country offers me. There's something beautiful about having much less pollution & being in a well developed country ",
        "Bye. 👋",
        "Not patriotic but an idiot. A true patriot realises the shortcomings of their country when they exist",
        "good lord this is some exaggeration I've flown AI quite a few times never had a 10 hr delay lol",
        "Thanks man. I'll miss you and other toxic trolls of this country ",
        "How am I toxic troll?",
        "Survived a failed take off AI814 > Delhi : BGL. 8th March. News suppressed. High handed mess shown after a panic moment. Awful.",
        "Last time I fly air India was about 3 years ago.  The turbulence was so bad, I legit thought I was gonna be ded. Never again.",
        "Indians don’t give a rats ass about another fellow Indian, they will be ready to sacrifice or kill anyone just for some small gain",
        "Air india breaks the parts before Boeing can",
        "Air india breaks the parts before Boeing can",
        "Agree SBI still works.",
        " \\>the way it shook in turbulence \n\nYou really shouldn't be talking about air travel with comments like that.",
        "all saying tata will change airindia,never visited tcs offices or used voltas air conditioning.\nTata can do good only in premium sector.\nin economical things it shits.",
        "Just because you have not faced it means someone else is exaggerating right? The fuck kind of logic is that? Go on YouTube and type in Air India delays. You'll see a shit tonne of videos. \n\nAlso, I've missed connecting flights due to this bullshit, so there's multiple issues around it.",
        "Atleast they are improving slowly and steadily.",
        ">🇳🇪\n\nRatan Tata from Niger😮",
        "India is pretty much known for its toxic trolls these days,any anti Islam thread will have atleast 1 indian,my goal was to get my degrees abroad and then return to India for strengthening a certain sector in the future like how the Israelis did by returning to their motherland and did that hence why I said that's my goal,if my home state doesn't have any advancement in the near future, only then I will leave",
        "I had a similar experience flying Air India from Del to Chicago. As so pathetic flight, half of the seats don't recline and on some sitting seats come out once you try to recline.\nEven in-flight staff was complaining about the plane. Stating they have complained to managent several times regarding grounding this aircraft.",
        "10 hr delay is definitely an exaggeration lol get outta here",
        "yap yap yap, you'd still travel in Ryan Air",
        "Good sir SBI is way better. It's app and services are still reliable. Although, their f2f banking lacks a lot. But I have never needed to deal with bank employees directly in the last 4-5 years. Since most of the services I can avail on it's net banking which is quite cool tbh.",
        "Tbh with you I’m not an Air India fan either. But one must understand that these planes incl the one you flew are from the old fleet which are horribly neglected from the time when the govt used to run things. \n\nThe newer aircrafts of air India are better maintained and even the crew is quite capable and diligent. \n\nSeems like the turnaround will happen overtime and not immediately. I for one am happy with the newer aircrafts, crew and service that have been started by Air India under the Tata Regime.",
        "Had to travel AI recently, the guy was chewing gum while serving and making announcements.",
        "True. they handled electoral bonds so nicely. LOL",
        "https://youtu.be/oFqHFrIIeSk enough proof for you dumbass?",
        "https://youtu.be/rRQw4N0kmbY\n\nHere's another one.",
        "The AI planes on this route are about 14 years old, so there's that. And obviously AI sucks at maintaining planes and customer relationships.",
        "Now food and all has detoriarated. Acche din",
        "no i am aware, it was not the case, basically the button was just popped",
        "I haven’t had any poor experience with their staff but Terribly old planes! They might be well maintained but very old planes.",
        "Let them. 🤷🏽‍♂️\n\nUpvote aur downvote se mere ticket ke paise thodi vaapas aa jaane hain.",
        "Oh, that's pretty bad.",
        ">India is pretty much known for its toxic trolls these days,any anti Islam thread will have atleast 1 indian,\n\nOk. But I was asking the other person, why he labelled me as a toxic troll.\n\n>my goal was to get my degrees abroad and then return to India for strengthening a certain sector in the future like how the Israelis did by returning to their motherland and did that hence why I said that's my goal,if my home state doesn't have any advancement in the near future, only then I will leave\n\nYour goal is good. It will be great to help society upliftment. But my comment was directed to another commentator, who said he deserved better country if he pays tax. Note currently he doesn't pay any tax, studying PhD here because it's cheaper and then plans to live abroad because he deserve better country. So, I just told him \"bye\" and he labelled me as toxic troll 🤷.",
        "They do have above average legroom though",
        "Why'd he lump me in idk why",
        "I agree but the problem is govt or public banks will bail out tata airlines just like they bailed out Yes bank . if that is not done I am all for this to be just tatas headache",
        "100 percent agree but Nationalism of air india was the issue . the merging of air india and indian airlines plus some favor to cronies by congress ans then by bjp was the reason for this mess. privatization is good if it makes sense..here it does but we already bore the brunt of this mess coz it when it was sold half the debt was taken over by the govt.",
        "I couldn't find a direct AI flight from Zurich to Delhi this year? What's the flight number?",
        "Hdfc apps are good at only selling if you ever use their WhatsApp banking services they will sent 10+ promotion msg",
        "Loaded with nikhil's podcast (wtf)",
        "> Why deal with the 3-4hr stopover in Dubai/Doha.\n\nThe answers are in this thread multiple times. AI make it absolutely possible for the US/ME carriers to compete even after they break up your journey in two legs. The AI service is that bad.",
        "People here are cribbing like its the only option you have... Air India is not monopoly anymore. Stupid dolts are starting to blame Indian people for poor service of Airline. Come on people did your brain got sucked by something??",
        "Air India was a butt of jokes when owned by GOI....it continues to be a butt of jokes when owned by Tatas!",
        "Good roast mate 😂💯",
        "787 was delivered in 2014s and is already 10 year old",
        "even the last delivered 787 (VT-NAC) in October 2017 is as bad as the older ones' , only retrofitting them with fresh new cabins can save them (which they are starting with their legacy 777s later this year)",
        "A lot of it Air India not giving a fuck. This is the toilet in business class at the beginning of an international flight:\n\n> https://i.imgur.com/vgo6dgB.jpg\n\nThis grime isn't because passengers were careless. It has built over time because they haven't bothered to clean it. It will take 5 minutes to clean it. How can the staff not notice it beyond me.",
        "I though there would be changes when Tata bought Air India but meh it's still the same. I use Vistara as a frequent flyer nowadays and I love it.",
        "oh right sorry it wasnt direct its zurich to vienna via austrian and vienna to delhi",
        "Reading all the comments is making me anxious. I am travelling for the first time with my 5yo alone coz AI from Chennai to Delhi. 😭",
        "Best online services my ass. Goto home branch for every single service",
        "a single news clip is still an exaggeration. no point debating with people having the n word on their username. have a good day",
        "Can't help dumbfucks. Initially you denied it completely. Now you say that a single news clip is an exaggeration when I posted 2. I can dig up more, but it's pointless to argue with someone who attacks your personality when they start losing their shitty arguments.",
        "If you want a functional AI plane for long haul, choose the one with 31” legroom(as on Google flights) because they’re the better maintained delta/etihad jets(although the etihad plane is the worst because it also has 17” seats).",
        "I've seen similar flights on Lufthansa and Etihad. All fleets have old planes and someone gets to sit on them at some time.",
        "Sure if private banks meet your requirements go for it\n\n\nI am happy with my no nonsense banking with SBI. Got low interest loan through campus branch and it has been my primary account since day 1",
        "Air India did not do that damage,  Indians like you did. Do you really think air India staff went around doing that?",
        "Stfu. Do you realise its the responsibility of the company to maintain it?",
        "I mean, it’ll take a few more years to see any meaningful changes. Good thing, GOI got done with it. The babus have already sucked on public money",
        "Failed takeoff? What happened? I’m flying Boeing 777 air India to India tomorrow morning and this comment section is scaring me..",
        "I had the worst experience with air India ground staff a few days ago. They postponed our connecting flight by 7 hours and when we reached the check in counter 2 hours earlier, said that seats are not available. Completely unapologetic. We were travelling with our infant who was crying due to discomfort of waiting, and they had the atrocity of commenting that our child is upset because we are tensed. Will never fly air India ever",
        "Reporting live today! The SFO-DEL route flight was supposed to take off at 10:30. They moved it to 11:30. It’s 11:26 already and nothing has moved. They aren’t even update the new time. \n\nAnother surprise was while tryna check on online, they made one of my family’s seat free the other two I was forced to pay 50 USDs extra. The only other free seats available were at crazily isolated spots at the tail. \n\nThe inflight experience I will share after the flight.",
        "the biggest idiotic mistake, assuming Tata's are a wonderful corporate entity.  they are the most exploitative entity on the face of earth, worse than the Africa slave trade of the 17th century.  Tata, as a corporate entity, sucks big time.",
        "I think air India management gets bribes , kickbacks , favors from other domestic carriers in India to make decisions which are not good for the airlines. I can't understand how can airline constantly perform sooo poorly and not improve even a bit over decades. Define sometging shady going on in there and it's not uncommon in corporate world to bribe competitors employees",
        "I’m shocked how an international airline can still operate with such terrible service.\n\nAir India misplaced and lost my bag during my flight from SFO. They only responded after long twitter posts. And still no resolution.\n\nNow, they’re asking me, a foreign national, to get an Indian visa to visit some warehouse and attempt to retrieve it! \n\nIncident Details: https://x.com/ayeshahmed_/status/1859583287699943462\n\nCurrent Status: https://x.com/ayeshahmed_/status/1860179394037448720"
    ],
    "cleaned_text": "air india still joke planes suck ground staff extremely incompetent well flying delhi san francisco air india unfortunately hands queue checkin baggage delhi one slowest person front supposed fly riyadh flight delayed hours supposed leave moron staff gave ticket saying morning clearly read even forgot return passport lady also forgot hand back mine thankfully realized walking away kiosk connection san diego sf said collect luggage san diego sure works ill collect sf thats happened well imagine poor elderly people travelling instead wouldnt know works planed sucked usual broken seats flight entertainment joke piss poor collection movies flying b way shook turbulence made believe might last flight given poorly maintained flight landed min early wait min plane sky bridge net net avoid air india ",
    "cleaned_title": "air india still joke planes suck ground staff extremely incompetent well",
    "cleaned_selftext": "flying delhi san francisco air india unfortunately hands queue checkin baggage delhi one slowest person front supposed fly riyadh flight delayed hours supposed leave moron staff gave ticket saying morning clearly read even forgot return passport lady also forgot hand back mine thankfully realized walking away kiosk connection san diego sf said collect luggage san diego sure works ill collect sf thats happened well imagine poor elderly people travelling instead wouldnt know works planed sucked usual broken seats flight entertainment joke piss poor collection movies flying b way shook turbulence made believe might last flight given poorly maintained flight landed min early wait min plane sky bridge net net avoid air india",
    "cleaned_comments": "time say tata crowd travels planes treats like worst children going berserk testing strength trays screen parents giving shit toilets gone shit hour flight defending ai course replace broken parts maintain semblance cleanliness people take cue behave accordingly probably something psychological play moment nris step ai plane think landed india start treating craft accordingly dont disagree dont even know things broke parents cant keep check infants go rummaging destroying things society suck honestly avoid air india avoid india really reason wont fly ai even new dreamliner sorry record letting people cabin smuggling family members onboard service doesnt matter much price right dread think unprofessional attitude extends pilots extent hope takeover gets rid unprofessionalism looks like unlucky plane ai flights sfodel former uses old crappy ls latter one uses delta planes leased ai also sfobom sfoblr use new nice yes rest service probably thats plan man always felt deserve better country offers taxes get info deployed intl routes afaik still domestic routes mumbai bangalore flights sfo use leased delta wouldnt get one even free take least years see meaningful changes old unionised people exit newer lot come performance based pay etc come take time surprised found yes right read somewhere going put new routes assumed already happened bad yes mistake removing wrong info comment parents go india twice year jfk never fly air india business class air india worse economy emirates service absolutely garbage airplanes dated mighty optimistic meanid go free heck even half ticket price qatar airways problem dont operate dfw theyre cheap qatar live us travel back india atleast every year ive tried airlines swiss finn air lufthansa united air india etc usually prefer direct flights cause pain faster lol whenever hopping flight second leg india first leg india usually chaotic leg yo crowd years every time notice crew checked india leg cause people dont respect queues orders treat crew planes like shit cause paid im surprised crew doesnt give fuck crew tries little strict fucks cry racism cycle stereotypes perpetuated cause genuinely shitty behaviors indian travelers air india one biggest images pathetic terrible countrys infrastructure quality regardless immensely increasing quantity infrastructure projects since want merge vistara crap yes true family travelled ai months back toronto delhi worst flight experience different airlines tried abe randi average rindia member air india sbi aviation industry sfo delhi absolute worst flight flew like flying trash parents flew dad mad quality turned karen first time ended giving voucher upon landing staff told mom ever fly sector even staff helpless hopeful year would start introducing new planes purchased looks like pr stunt man thats extremely dangerous actually plane end episode mentour pilot really soon pray innocent lives travel broken plane become burden another country hating biharis boeing shit company fine example failure crapitalism dude flew zurich delhi twice year unfortunately business class holy shit bad everything broken electro chromatic windows didnt work kid fucking scribbled side pane seemed sbi offers best online services better exchange rate indian bank indian soil stupid icici card got locked india sbi stayed strong orders boeing airbus new aircrafts signed contracts existing fleet leading mros tcs services actually good sign im aware lht also pursuing mro business thanks proving point vistara gold standard domestic flights far best indian market haaaaaa see qatar emirates dfw taking every day leaving better leave fast western countries starting hate immigration might get chance later flew ai inside india delhi bombay around end december broken arm rests television working anything could break broke response complaint please bear us process upgrading fleet upgraded nahin hai toh muft mein chalao seat ka charge kar rahe ho toh bare minimum working seat modijis many indians answer privatization solution indian ills took air india first flight india indias official carrier journey almost h long obviously bad however next time flew air france realized shitshow air india ai also expensive one since use flightsgooglecomhttpflightsgooglecom pick flight much brand conscious think received services lunch counter number without going counter number better wait line pay whatever fuck hidden card charges know best terms customer service value value fancy lady speaking english use sbi remittance far cheapest fleet one diverse fleets world ground assets heathrow hangar mouth watering proper aviation executive problem government blasting caused one premier airlines worldto become way sold everyone hue cry government selling assets away wait years singapore airlines funding tata operating get back flew new plane really good entertainment section one needs looked fly emergency covid fly years ready horrerbroken plane panels staff really friendly plane shambles felt embarrased national carrier ai flight vancouver delhi weeks ago hour flight remember correctly plane far worst ever seen ordered taxi state wouldnt get arm rests held together duct tape covering controls headphone outlet backside arm rest seat front cover anymore exposing bent away sharp metal edges none board entertainment worked whole plane add insult injury put complimentary headphones every seat goddamn board entertainment didnt even work wtf need headphones worst thing flight attendant asked way finding whats food going receive later allergic nuts time gave food completely forgotten plain ignored request asked nuts meal gave simply said got aluminum container main meal looked bottom found sticker ingredients listed clearly stating contained nuts need say worst fing airline ever weeks later flew delhi frankfurt vistara amazing plane great entertainment good food friendly staff bsnl believe air india getting new planes renovating current planes went toronto delhi flight exactly youve shown complete garbage unhygienic things broken tv didnt work hour flight staff didnt speak english hindi either return flight completely different plane looked pretty new modern clean nothing broken tv also worked honestly air india think change believe theyre renovating fleet getting new planes though im still flying dont mind paying extra consistent overall better experience another airline air india ever premier airline world ive flying since never thought close youre changing things useless youre treating theyre transition hoepfully things get better youre lucky inflight entertainment working sometimes broken whole cabin theyre handing magazines passengers instead opened lavatory door whole panel sink came hanging lol yeah really bad especially entertainment system touch screen working controller barely operational dirty atleast lucky working one system beside couldnt even turn bored pissed flight movie library crap food really really bad enough plane dirty broken place thats thats last time flew air india going british airways even though best least better ai virgin atlantic theres weird thing noticed air india gives instructions hindi english regional language british airways took time include instructions regional language thought flight someone posted even domestic flights dont bother give instructions regional languages international airline one country like uk cared enough include regional language couldnt airlines air india run tata everything changed ratan tata made air india da best saar ratan sir rox ai deathtrap choice take theres absolutely option left take option factor hr delay ends peace mind otherwise youll lose sanity midst multiyear transition going take time chance cant saved till jrd tata ran world class point first class actual silver cutlery ratan tata saar india praud saar sbi credit card app yono good smooth irritated first used hdfc app regarding windows crew lock supposed locked zero shade takeoff landing eyes adjusted outdoor lighting event crash crew sometimes lazy unlock windows safe nationalizing air india caused company huge debts info made freaking ambassador car almost cost capitalism privatization good regulated properly terrible reason air indias issues emirates hundred boeing planes great service mean placed orders new planes may lead funding problems pilots overall lot recapitalization required turn around also went new planes long production times wil stuck planes came govt getting downvoted ai employees thankfully carrying loaded ipad killing time wasnt difficult recent flight maasin entire trip flight urine smells economy class two toilets available passengers treating read india reddit feel difficult proud indian much patriotic one like air india dont need leave fast theyre allowed displeased stupid reply air india stories still give nightmares ac conking mins hr flight takes ac hours flight tray tables falling place overhead cabins opening flight crew wearing crumpled clothes flight interiors smelling like old indian kitchen drunk ill mannered passengers control children years ago never traveled via ai since take years tata turn things around everyone still govt job mentality overhauling existing planes done next year gon na used routes soon well biggest mistake aviation sector indian govt nationalising airlines reason people choose airindia though even problems eh provides direct connection us us airlines compete direct flights sfla india complete journey less hours deal hr stopover dubaidoha want leave told leave whats stupid showing displeasure fine wanting leave comparing standard living india rich countries stupid india large poor population tax benefits going towards cant expect eu level benefits taxes also government provides free healthcare cheap schooling free baby childbirth vaccination ration newborns etc citizens waiting time obvious reasons large poor population people hardly go complain deserve better taxes pay someone wants leave expect say beg stay back want leave let leave tata thought would buy airindia peanuts transform vistara today vistara looks like airindia air india right sarkari airline exiet ills one sure ai known poor quality even sale tata earlier taxpayers problem pay repair stuff like ensuing corruption problem tatas shareholders honest im always abused much harsher whenever say want leave india scariest moment life flying air india noticed plane wings cello tape sticking around admire courage travel way new york broken condition clear government exams complete phd ill leave give time theyre fixing new killer please dont insult sbi theyre bad still way better air india leave nobody wants hater wait door plug opening incident ai order call boeing however true issues ai lately service related dont hate anything feel deserve better lifestyle country offers im working forwards attain decades government job goal leave completed phd abroad phd better aboard phd student taxes paying expect deserve better country fair passengers also dont treat air india would treat vistara indigo worst behaviour yes airindia perceived still phd abroad much costly way cheaper required ill post phd fellowships abroad even repeat phd required whatever buy pay taxes taxes paid multiple people family anyway like said earlier feel deserve better country offers theres something beautiful much less pollution well developed country bye patriotic idiot true patriot realises shortcomings country exist good lord exaggeration ive flown ai quite times never hr delay lol thanks man ill miss toxic trolls country toxic troll survived failed take ai delhi bgl th march news suppressed high handed mess shown panic moment awful last time fly air india years ago turbulence bad legit thought gon na ded never indians dont give rats ass another fellow indian ready sacrifice kill anyone small gain air india breaks parts boeing air india breaks parts boeing agree sbi still works way shook turbulence really shouldnt talking air travel comments like saying tata change airindianever visited tcs offices used voltas air conditioning tata good premium sector economical things shits faced means someone else exaggerating right fuck kind logic go youtube type air india delays youll see shit tonne videos also ive missed connecting flights due bullshit theres multiple issues around atleast improving slowly steadily ratan tata niger india pretty much known toxic trolls daysany anti islam thread atleast indianmy goal get degrees abroad return india strengthening certain sector future like israelis returning motherland hence said thats goalif home state doesnt advancement near future leave similar experience flying air india del chicago pathetic flight half seats dont recline sitting seats come try recline even inflight staff complaining plane stating complained managent several times regarding grounding aircraft hr delay definitely exaggeration lol get outta yap yap yap youd still travel ryan air good sir sbi way better app services still reliable although ff banking lacks lot never needed deal bank employees directly last years since services avail net banking quite cool tbh tbh im air india fan either one must understand planes incl one flew old fleet horribly neglected time govt used run things newer aircrafts air india better maintained even crew quite capable diligent seems like turnaround happen overtime immediately one happy newer aircrafts crew service started air india tata regime travel ai recently guy chewing gum serving making announcements true handled electoral bonds nicely lol enough proof dumbass heres another one ai planes route years old theres obviously ai sucks maintaining planes customer relationships food detoriarated acche din aware case basically button popped havent poor experience staff terribly old planes might well maintained old planes let upvote aur downvote se mere ticket ke paise thodi vaapas aa jaane hain oh thats pretty bad india pretty much known toxic trolls daysany anti islam thread atleast indian ok asking person labelled toxic troll goal get degrees abroad return india strengthening certain sector future like israelis returning motherland hence said thats goalif home state doesnt advancement near future leave goal good great help society upliftment comment directed another commentator said deserved better country pays tax note currently doesnt pay tax studying phd cheaper plans live abroad deserve better country told bye labelled toxic troll average legroom though whyd lump idk agree problem govt public banks bail tata airlines like bailed yes bank done tatas headache percent agree nationalism air india issue merging air india indian airlines plus favor cronies congress ans bjp reason mess privatization good makes sensehere already bore brunt mess coz sold half debt taken govt couldnt find direct ai flight zurich delhi year whats flight number hdfc apps good selling ever use whatsapp banking services sent promotion msg loaded nikhils podcast wtf deal hr stopover dubaidoha answers thread multiple times ai make absolutely possible usme carriers compete even break journey two legs ai service bad people cribbing like option air india monopoly anymore stupid dolts starting blame indian people poor service airline come people brain got sucked something air india butt jokes owned goiit continues butt jokes owned tatas good roast mate delivered already year old even last delivered vtnac october bad older ones retrofitting fresh new cabins save starting legacy later year lot air india giving fuck toilet business class beginning international flight grime isnt passengers careless built time havent bothered clean take minutes clean staff notice beyond though would changes tata bought air india meh still use vistara frequent flyer nowadays love oh right sorry wasnt direct zurich vienna via austrian vienna delhi reading comments making anxious travelling first time yo alone coz ai chennai delhi best online services ass goto home branch every single service single news clip still exaggeration point debating people n word username good day cant help dumbfucks initially denied completely say single news clip exaggeration posted dig pointless argue someone attacks personality start losing shitty arguments want functional ai plane long haul choose one legroomas google flights theyre better maintained deltaetihad jetsalthough etihad plane worst also seats ive seen similar flights lufthansa etihad fleets old planes someone gets sit time sure private banks meet requirements go happy nonsense banking sbi got low interest loan campus branch primary account since day air india damage indians like really think air india staff went around stfu realise responsibility company maintain mean itll take years see meaningful changes good thing goi got done babus already sucked public money failed takeoff happened im flying boeing air india india tomorrow morning comment section scaring worst experience air india ground staff days ago postponed connecting flight hours reached check counter hours earlier said seats available completely unapologetic travelling infant crying due discomfort waiting atrocity commenting child upset tensed never fly air india ever reporting live today sfodel route flight supposed take moved already nothing moved arent even update new time another surprise tryna check online made one familys seat free two forced pay usds extra free seats available crazily isolated spots tail inflight experience share flight biggest idiotic mistake assuming tatas wonderful corporate entity exploitative entity face earth worse africa slave trade th century tata corporate entity sucks big time think air india management gets bribes kickbacks favors domestic carriers india make decisions good airlines cant understand airline constantly perform sooo poorly improve even bit decades define sometging shady going uncommon corporate world bribe competitors employees im shocked international airline still operate terrible service air india misplaced lost bag flight sfo responded long twitter posts still resolution theyre asking foreign national get indian visa visit warehouse attempt retrieve incident details current status",
    "light_cleaned_title": "Air India is still a joke. Not only do the planes suck but the ground staff is extremely incompetent as well",
    "light_cleaned_selftext": "Was flying delhi to San Francisco on Air India unfortunately (not in my hands). The queue to checkin baggage in delhi was one of the slowest. The person in front of me was supposed to fly to Riyadh. His flight was delayed by some 14 hours (was supposed to leave at 200 but now 1800) and the moron staff gave him his ticket saying its morning 6am when it clearly read 1800. They even forgot to return him his passport and the lady also forgot to hand back mine to me. Thankfully, i realized walking not 20 m away from the kiosk. I had a connection to san diego from SF. She said you can collect your luggage at san diego when i was 100% sure that is not how it works and ill have to collect it at SF. And thats how it happened as well. Imagine some poor elderly people travelling instead who wouldnt know how it works. The planed sucked as usual with broken seats. In flight entertainment is a joke with the most piss poor collection of movies. Was flying a b777 and the way it shook in turbulence made me believe it might be my last flight given how poorly these are maintained. The flight landed 30 min early but had to wait for 30 min in the plane for the sky bridge. Net net avoid air india if you can.",
    "light_cleaned_comments": "Time to say TaTa The crowd which travels on these planes treats them like the worst. Children going berserk testing their strength on trays and screen. Parents not giving a shit. Toilets gone to shit an hour into the flight. Not defending AI. They can of course replace the broken parts, maintain a semblance of cleanliness so that people take the cue and behave accordingly. But there is probably something psychological at play here that the moment these NRIs step into an AI plane they think they have landed in India and start treating the craft accordingly. Dont disagree. I dont even know how some of these things broke down. Parents cant keep a check on their infants while they go rummaging and destroying things. We as a society suck, honestly Avoid air India ❌ Avoid India ✅ Really. The reason I won't fly AI even on new 787 Dreamliner is their sorry record of letting people in the cabin, smuggling family members onboard. Service doesn't matter much if the price is right but I dread to think what if the same unprofessional attitude extends to pilots, which does to some extent. I hope the takeover gets rid of the unprofessionalism. Looks like you were unlucky with the plane as AI has 2 flights sfo-del (173/174 and 183/184) and only the former uses the old crappy 77Ls while the latter one uses the Delta planes leased by AI. Also SFO-BOM and SFO-BLR use the new A350s which are all nice. But yes rest of the service is probably the same. That's the plan man Same. I always felt I that I deserve better than what this country offers me with my taxes Where did you get the info that a350 have been deployed for intl routes ? AFAIK its still doing domestic routes The Mumbai and Bangalore flights to SFO use the leased Delta 777-200s and not A350s I wouldn't get on one even if it was free. It will take at least 5-7 years to see meaningful changes. The old ‘unionised’ people will exit and a newer lot will come in. Performance based pay etc will come in. It will take time… I was very surprised when I found out that they have 787 Yes you are right. I had read somewhere that they were going to put the new A350s on those routes and assumed it had already happened. My bad. Yes my mistake. Removing the wrong info from my comment. Me and my parents go to india twice a year from jfk and never fly air india. The business class in air india is worse than economy in emirates. The service is absolutely garbage and airplanes are dated. 5-7 is mighty optimistic I mean…I’d go if it was free. Heck even half the ticket price of Qatar airways. Problem is, they don’t operate from dfw and they’re not cheap. So Qatar it is. I live in the US and travel back to India atleast once every year. I’ve tried a few airlines (Swiss, Finn air, Lufthansa, United, Air India etc) I usually prefer direct flights cause the pain is over faster lol but whenever I have a hopping flight. The second leg (to India) and the first leg (from India) is usually more chaotic than the other leg. It has yo be because of the crowd. It’s been more than 7 years and every time I notice that crew is checked out on the India leg cause people just don’t respect queues, orders. They treat the crew and the planes like shit just cause they paid for it. I’m not surprised crew doesn’t give a fuck. And when the crew tries to be a little strict, these fucks will cry racism. It’s a cycle. Such stereotypes are perpetuated cause of genuinely shitty behaviors by Indian travelers Air india is one of the biggest images of how pathetic & terrible our country's infrastructure quality is regardless of the immensely increasing quantity in infrastructure projects since 2014 And they want to merge Vistara with this crap😪 Yes, true. My family travelled AI 3 months back from Toronto to Delhi & it was worst flight experience out of 5 different airlines we have tried. Abe randi Average r/india member Air India is the \"SBI\" of the aviation industry. Sfo delhi has the absolute worst flight. I flew it and it was like flying a trash can. My parents flew it and my dad was so mad at the quality he turned into a Karen for the first time and they ended up giving a voucher upon landing and the staff told my mom not to ever fly that sector again. Even the staff are helpless. I was hopeful that this year they would start introducing all the new planes they purchased but it looks like it was just a PR stunt Man, that's extremely dangerous actually. That plane can end up on an episode of Mentour Pilot really soon. I pray for the innocent lives that have to travel with this broken plane. And then become a burden on another country while hating Biharis. Boeing is shit company. A fine example of failure of crapitalism. dude i flew their 787 from zurich to delhi twice this year unfortunately, i was in business class and holy shit was it bad, everything was broken, the electro chromatic windows didnt work and some kid had fucking scribbled on the side pane it seemed SBI offers best online services, better exchange rate than any other Indian bank on Indian soil. My stupid ICICI card got locked when I was out of India but SBI stayed strong. orders with Boeing & Airbus for new aircraft’s + signed contracts for existing fleet with leading MROs for TCS services is actually a very very good sign. I’m aware LHT is also pursuing them for MRO business. Thanks for proving the point. Vistara was the gold standard of domestic flights. By far the best in the Indian market. Haaaaaa I can see when Qatar and emirates from DFW taking off every other day. So, when are you both leaving? Better leave fast because western countries are starting to hate immigration. Might not get a chance later. Flew AI inside India (Delhi to Bombay) around end December. Broken arm rests, television not working - anything that could break, broke. Response to complaint? “Please bear with us, we are in the process of upgrading our fleet” upgraded nahin hai toh muft mein chalao, seat ka charge kar rahe ho toh bare minimum is a working seat. modijis and many indians answer : privatization is the solution to all indian ills I took Air India for my first flight out of India as it was \"India's official carrier\". Journey was almost 24h long and obviously bad. However next time I flew Air France and then I realized what a shitshow Air India was. And AI was also the most expensive one. Since then, I use [flights.google.com](http://flights.google.com) to pick my flight and not much \"brand conscious\". I think, you received the services during lunch at counter number 3, without going to counter number 2 and 1. Better wait in line than pay whatever the fuck those \"hidden card charges\" are. I know it's not the best in terms of customer service but i value \"value\" more than fancy lady speaking in English. I use SBI for remittance and by far it's the cheapest. Their fleet is one of the most diverse fleets in the world and the ground assets such as the Heathrow Hangar are mouth watering to a proper aviation executive. The problem is government blasting has caused one the premier airlines in the world.to become this way. And when it is sold, everyone has a hue and cry about the government selling assets away. Wait for a few years. With the Singapore airlines funding, and tata operating it, it will get back. I flew in the new plane and they were really good. The entertainment section is the only one that needs to be looked after. I had to fly in emergency during covid. I had to fly it, after 20+ years. I was not ready for the horrer...broken plane and panels. Staff was really friendly but the plane was in shambles. I felt embarrased that this is the national carrier. I was on an AI flight from Vancouver to Delhi about 6 weeks ago. It was a 13 hour flight if I remember correctly. The plane was by far the worst I had ever seen. If I ordered a taxi that was in such a state, I wouldn't get in. Some of the arm rests were being held together with duct tape covering the controls and headphone outlet, the backside of the arm rest of the seat in front of me had no cover on it anymore, exposing bent away and sharp metal edges. NONE of the board entertainment worked in the whole plane and to add insult to injury they put complimentary headphones on every seat. The goddamn board entertainment didn't even work, WTF do I need headphones for??? The worst thing was the flight attendant whom I asked if she had any way of finding out what's in the food we were going to receive later because I am allergic to nuts. By the time they gave out the food she had completely forgotten (or plain ignored) my request, so I asked again if there were nuts in the meal she gave me. She simply said no, I got the aluminum container with the main meal, looked at the bottom and found a sticker that had the ingredients listed on it, clearly stating that it contained nuts. No need to say, WORST F***ING AIRLINE EVER. 4 weeks later I flew from Delhi to Frankfurt with Vistara. Amazing plane, great entertainment, good food and friendly staff. BSNL. I believe air india is getting new planes or renovating their current planes, I went from toronto to delhi and the flight was exactly how youve shown, it was complete garbage, it was unhygienic, things were broken, and the TV didnt work on a 14 hour flight, and the staff didnt speak english or hindi either but on my return flight it was completely different, the plane looked pretty new and modern and it was clean and nothing was broken, the TV also worked, its honestly a 50/50 with Air India as of now, but I think it will change as I believe they're renovating their fleet and getting new planes, though i'm still not flying with them again (for now), I dont mind paying an extra $200 for a more consistent and overall better experience with another airline. When was air India ever a premier airline in the world. I've been flying since the 80s and have never thought close to that If you're not changing things you are just as useless as you're treating them They're in a transition, hoepfully things get better You’re lucky your in-flight entertainment was working. Sometimes it’s broken for the whole cabin and they’re handing out magazines to the passengers instead. I once opened the lavatory door and the whole panel below the sink came off hanging. Lol Yeah it's really bad. Especially entertainment system. My touch screen was not working, the controller was barely operational and it was so dirty too. But atleast I was lucky to have a working one. The system beside couldn't even turn on at all. He was so bored and pissed off during the flight. And the movie library is crap. Food was really really bad. As if all this was not enough the plane itself was dirty and broken all over the place. That's it, that's the last time I flew on air India. Going with British airways (even though it's not the best it's at least better than AI) and virgin Atlantic. Then there's a weird thing I noticed. Air India gives out instructions in Hindi and English no regional language while British airways took time to include instructions in regional language. I thought it was the only flight. Someone posted the same that even the domestic flights don't bother to give instructions in regional languages. When an international airline (one from a country like the UK) had cared enough to include regional language, why couldn't our airlines do the same? Air India is now run by Tata and everything has changed /s. Ratan Tata has made Air India da best saar! Ratan sir rox! ^/s AI is that deathtrap of a choice that 1 should take only if there's absolutely no other option left. And if you do take that option, factor in a 10hr delay on both ends for some peace of mind. Otherwise you'll lose your sanity! It's in the midst of a multi-year transition. It's going to take time and there is a 50-50 chance it can't be saved. Till JRD Tata ran it. It was world class. At that point, first class had actual silver cutlery. Ratan Tata Saar, India is so praud of you Saar. 🇳🇪 SBI credit card app and Yono is good and smooth. I was irritated when I first used the HDFC app. Regarding the windows, the crew can lock them (they are supposed to be locked in zero shade during takeoff and landing so that your eyes are adjusted for outdoor lighting in the event of a crash), but the crew is sometimes too lazy to unlock the windows when it is safe. Nationalizing air india caused all of this. The company had huge debts. For your info we made the same freaking ambassador car from 1950 to 1990s. with almost same cost. Capitalism and privatization is good if it is regulated properly..! They are terrible, but that is not the reason for Air India's issues. Emirates has more than a hundred Boeing planes and they have great service. I mean they had placed orders for new planes and that may have lead to some funding problems for the pilots. But, overall a lot of recapitalization will be required for a turn around. Also, they went with new planes that will have long production times, so we wil be stuck with these planes, that came from the govt as is. You are getting downvoted by AI employees. Thankfully i was carrying a loaded ipad so killing time wasnt that difficult My recent flight MAA-SIN entire trip and flight urine smells. Economy class just two toilets available 100+ passengers. How am I treating them? More I read about India in reddit, the more I feel it is difficult to be proud indian. How much patriotic does one have to be to like Air India? Because they don't need to leave fast, they're allowed to be displeased. What a stupid reply you have for that I have Air India stories that still give me nightmares. AC conking off 10 mins after a 17 hr flight takes off. No AC for 14 hours on the flight!! Tray tables falling out of place, overhead cabins opening during flight, crew wearing crumpled clothes, flight interiors smelling like an old Indian kitchen. Drunk, ill mannered passengers, out of control children. This was 10 years ago and I have never traveled via AI since. It will take few more years for tata to turn things around. Everyone is still in the govt job mentality. Overhauling of existing planes will be done this and next year. A350s are gonna be used in these routes soon as well. Biggest mistake in aviation sector that Indian govt did was nationalising all airlines. There is a reason people choose Air-India though even with all these problems eh? It provides a direct connection to US when US airlines cannot compete on. There are no direct flights from SF/LA to India. And when you can complete that journey in less than 24 hours why not. Why deal with the 3-4hr stopover in Dubai/Doha. They want to leave, i told them to leave. What's stupid about that? Showing displeasure is fine. But wanting to leave by comparing the standard of living between India and rich countries is stupid. India has a very large poor population, so tax benefits will be going towards them. You can't expect EU level of benefits from taxes. Also, the government provides free healthcare, cheap schooling, free baby childbirth, vaccination, ration for newborns etc. to all citizens. But waiting time will be more for obvious reasons (large poor population). So, these people will hardly go there. And complain that I deserve better for the taxes I pay. If someone wants to leave what do you expect me to say? Beg them to stay back? If they want to leave, let them leave. Tata thought it would buy AirIndia for peanuts and transform that to Vistara. Today Vistara looks more like AirIndia. Air india right now is the most sarkari airline that it can exiet Not for all ills, but this one sure. AI has been known for poor quality even before the sale to Tata. Earlier it was the taxpayer's problem to pay for the repair of stuff like this, and the ensuing corruption. Now it's the problem of Tata's shareholders To be honest, I'm always abused much harsher whenever I say I want to leave India The scariest moment of my life was when I was flying with Air India and I noticed the plane wings have cello tape sticking around. I admire your courage to travel with them all the way to New York in such broken condition. I have to clear some government exams & complete my PhD, after that I'll leave. Give them some time, they're fixing it. The new A350s are killer Please don't insult SBI , they're bad but still way better than Air India ☠️😂 Leave it... nobody wants you a hater We cannot wait to have a door plug opening incident with AI in order to call out boeing. However it's true that issues of AI lately have been service related. I dont hate anything. I just feel I deserve better lifestyle than what this country offers & I'm working forwards to attain it That what decades of 'government job' does to you.... If your goal was to leave then, you should have completed your PhD from abroad itself. PhD is better aboard. If you are a PhD student, what taxes are you paying to expect you deserve a better country? To be fair, passengers also don’t treat Air India as they would treat a Vistara or Indigo, most are at their worst behaviour. Yes, it because how AirIndia is perceived, but still.. PhD abroad is much more costly. Here it's way cheaper. If required, I'll do post PhD fellowships abroad or even repeat my PhD if required Whatever you buy, you pay some taxes. Taxes are paid by multiple people if my family. Anyway, like I said earlier, I feel I deserve better than what this country offers me. There's something beautiful about having much less pollution & being in a well developed country Bye. 👋 Not patriotic but an idiot. A true patriot realises the shortcomings of their country when they exist good lord this is some exaggeration I've flown AI quite a few times never had a 10 hr delay lol Thanks man. I'll miss you and other toxic trolls of this country How am I toxic troll? Survived a failed take off AI814 > Delhi : BGL. 8th March. News suppressed. High handed mess shown after a panic moment. Awful. Last time I fly air India was about 3 years ago. The turbulence was so bad, I legit thought I was gonna be ded. Never again. Indians don’t give a rats ass about another fellow Indian, they will be ready to sacrifice or kill anyone just for some small gain Air india breaks the parts before Boeing can Air india breaks the parts before Boeing can Agree SBI still works. \\>the way it shook in turbulence You really shouldn't be talking about air travel with comments like that. all saying tata will change airindia,never visited tcs offices or used voltas air conditioning. Tata can do good only in premium sector. in economical things it shits. Just because you have not faced it means someone else is exaggerating right? The fuck kind of logic is that? Go on YouTube and type in Air India delays. You'll see a shit tonne of videos. Also, I've missed connecting flights due to this bullshit, so there's multiple issues around it. Atleast they are improving slowly and steadily. >🇳🇪 Ratan Tata from Niger😮 India is pretty much known for its toxic trolls these days,any anti Islam thread will have atleast 1 indian,my goal was to get my degrees abroad and then return to India for strengthening a certain sector in the future like how the Israelis did by returning to their motherland and did that hence why I said that's my goal,if my home state doesn't have any advancement in the near future, only then I will leave I had a similar experience flying Air India from Del to Chicago. As so pathetic flight, half of the seats don't recline and on some sitting seats come out once you try to recline. Even in-flight staff was complaining about the plane. Stating they have complained to managent several times regarding grounding this aircraft. 10 hr delay is definitely an exaggeration lol get outta here yap yap yap, you'd still travel in Ryan Air Good sir SBI is way better. It's app and services are still reliable. Although, their f2f banking lacks a lot. But I have never needed to deal with bank employees directly in the last 4-5 years. Since most of the services I can avail on it's net banking which is quite cool tbh. Tbh with you I’m not an Air India fan either. But one must understand that these planes incl the one you flew are from the old fleet which are horribly neglected from the time when the govt used to run things. The newer aircrafts of air India are better maintained and even the crew is quite capable and diligent. Seems like the turnaround will happen overtime and not immediately. I for one am happy with the newer aircrafts, crew and service that have been started by Air India under the Tata Regime. Had to travel AI recently, the guy was chewing gum while serving and making announcements. True. they handled electoral bonds so nicely. LOL enough proof for you dumbass? Here's another one. The AI planes on this route are about 14 years old, so there's that. And obviously AI sucks at maintaining planes and customer relationships. Now food and all has detoriarated. Acche din no i am aware, it was not the case, basically the button was just popped I haven’t had any poor experience with their staff but Terribly old planes! They might be well maintained but very old planes. Let them. 🤷🏽‍♂️ Upvote aur downvote se mere ticket ke paise thodi vaapas aa jaane hain. Oh, that's pretty bad. >India is pretty much known for its toxic trolls these days,any anti Islam thread will have atleast 1 indian, Ok. But I was asking the other person, why he labelled me as a toxic troll. >my goal was to get my degrees abroad and then return to India for strengthening a certain sector in the future like how the Israelis did by returning to their motherland and did that hence why I said that's my goal,if my home state doesn't have any advancement in the near future, only then I will leave Your goal is good. It will be great to help society upliftment. But my comment was directed to another commentator, who said he deserved better country if he pays tax. Note currently he doesn't pay any tax, studying PhD here because it's cheaper and then plans to live abroad because he deserve better country. So, I just told him \"bye\" and he labelled me as toxic troll 🤷. They do have above average legroom though Why'd he lump me in idk why I agree but the problem is govt or public banks will bail out tata airlines just like they bailed out Yes bank . if that is not done I am all for this to be just tatas headache 100 percent agree but Nationalism of air india was the issue . the merging of air india and indian airlines plus some favor to cronies by congress ans then by bjp was the reason for this mess. privatization is good if it makes sense..here it does but we already bore the brunt of this mess coz it when it was sold half the debt was taken over by the govt. I couldn't find a direct AI flight from Zurich to Delhi this year? What's the flight number? Hdfc apps are good at only selling if you ever use their WhatsApp banking services they will sent 10+ promotion msg Loaded with nikhil's podcast (wtf) > Why deal with the 3-4hr stopover in Dubai/Doha. The answers are in this thread multiple times. AI make it absolutely possible for the US/ME carriers to compete even after they break up your journey in two legs. The AI service is that bad. People here are cribbing like its the only option you have... Air India is not monopoly anymore. Stupid dolts are starting to blame Indian people for poor service of Airline. Come on people did your brain got sucked by something?? Air India was a butt of jokes when owned by GOI....it continues to be a butt of jokes when owned by Tatas! Good roast mate 😂💯 787 was delivered in 2014s and is already 10 year old even the last delivered 787 (VT-NAC) in October 2017 is as bad as the older ones' , only retrofitting them with fresh new cabins can save them (which they are starting with their legacy 777s later this year) A lot of it Air India not giving a fuck. This is the toilet in business class at the beginning of an international flight: > This grime isn't because passengers were careless. It has built over time because they haven't bothered to clean it. It will take 5 minutes to clean it. How can the staff not notice it beyond me. I though there would be changes when Tata bought Air India but meh it's still the same. I use Vistara as a frequent flyer nowadays and I love it. oh right sorry it wasnt direct its zurich to vienna via austrian and vienna to delhi Reading all the comments is making me anxious. I am travelling for the first time with my 5yo alone coz AI from Chennai to Delhi. 😭 Best online services my ass. Goto home branch for every single service a single news clip is still an exaggeration. no point debating with people having the n word on their username. have a good day Can't help dumbfucks. Initially you denied it completely. Now you say that a single news clip is an exaggeration when I posted 2. I can dig up more, but it's pointless to argue with someone who attacks your personality when they start losing their shitty arguments. If you want a functional AI plane for long haul, choose the one with 31” legroom(as on Google flights) because they’re the better maintained delta/etihad jets(although the etihad plane is the worst because it also has 17” seats). I've seen similar flights on Lufthansa and Etihad. All fleets have old planes and someone gets to sit on them at some time. Sure if private banks meet your requirements go for it I am happy with my no nonsense banking with SBI. Got low interest loan through campus branch and it has been my primary account since day 1 Air India did not do that damage, Indians like you did. Do you really think air India staff went around doing that? Stfu. Do you realise its the responsibility of the company to maintain it? I mean, it’ll take a few more years to see any meaningful changes. Good thing, GOI got done with it. The babus have already sucked on public money Failed takeoff? What happened? I’m flying Boeing 777 air India to India tomorrow morning and this comment section is scaring me.. I had the worst experience with air India ground staff a few days ago. They postponed our connecting flight by 7 hours and when we reached the check in counter 2 hours earlier, said that seats are not available. Completely unapologetic. We were travelling with our infant who was crying due to discomfort of waiting, and they had the atrocity of commenting that our child is upset because we are tensed. Will never fly air India ever Reporting live today! The SFO-DEL route flight was supposed to take off at 10:30. They moved it to 11:30. It’s 11:26 already and nothing has moved. They aren’t even update the new time. Another surprise was while tryna check on online, they made one of my family’s seat free the other two I was forced to pay 50 USDs extra. The only other free seats available were at crazily isolated spots at the tail. The inflight experience I will share after the flight. the biggest idiotic mistake, assuming Tata's are a wonderful corporate entity. they are the most exploitative entity on the face of earth, worse than the Africa slave trade of the 17th century. Tata, as a corporate entity, sucks big time. I think air India management gets bribes , kickbacks , favors from other domestic carriers in India to make decisions which are not good for the airlines. I can't understand how can airline constantly perform sooo poorly and not improve even a bit over decades. Define sometging shady going on in there and it's not uncommon in corporate world to bribe competitors employees I’m shocked how an international airline can still operate with such terrible service. Air India misplaced and lost my bag during my flight from SFO. They only responded after long twitter posts. And still no resolution. Now, they’re asking me, a foreign national, to get an Indian visa to visit some warehouse and attempt to retrieve it! Incident Details: Current Status:"
}