{
    "id": "15deufo",
    "title": "Guys please help me.",
    "url": "https://www.reddit.com/gallery/15deufo",
    "selftext": "Hi!!\nI am Betch student. Today I was going through my bank passbook and saw two deductions that I didn't remember. Both were Rs. 411/- \nFirts one was done in june and second one in july. \nI didn't know what were these supposed to be. So I checked my text messages for bank message. I found that these deductions were made using something called protean for A.P.Y. \nI had no idea what these two things were. I did some googling and what I can understand is that A.P.Y is Atal Pension Yojna and Protean is an app theough which it was initiated. I didn't do any of this. I downloaded the app and entered using the credentials provided in text message. There I found that a pension was created using my Pan and bank details. The nominee was some Kamal Singh who acted as my father(he is not). I also find some documents related to transactions(can't shar on social media). \nI don't know what to do. I am currently in between my finals and can't go to bank. My dad doesn't know about my bnak account (my mom uses to hide savings from Dad) and my mom doesn't know how to use banking system. \nPlease help me \nHow do I complaint online and wher eto complaint? To my bank or A.P.Y authority?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690700382.0,
    "convurl": "https://i.redd.it/fm2uc7g9w1fb1.jpg",
    "comments": [
        "To apy and protean both complain via a mail first or try calling their customer service they will probably give you a way",
        "Protean = NSDL. Protean is their new name.\n\nFile a complaint with the bank.",
        "Your bank has enrolled you in Atal Pension Yojana. Just go to your bank and ask them to cancel it.",
        "Can they do that without my permission?",
        "Yes, this was in the news. Branches have been enrolling customers in govt-run schemes like PMBSY and PMJJBY due to pressure and targets from management [since last year](https://thewire.in/banking/banks-have-been-charging-customers-for-government-insurance-they-never-wanted). It appears this year it is APY pressure. Go to your bank and given them in writing to cancel your APY. Collect signed and received xerox copy. All your money will be refund to your a/c. If further debits happen after a month, send that xerox copy to RBI Ombudsman with a compliant email.",
        "Ok I will try to do that.\n\nBut the bank surely can't lie on the documents and put a random person as my father.",
        "Apparently they have. Usually they will attach the APY enrollment form with account opening, KYC updation or any other service request forms. You might have signed it without knowing. Have you signed anything in your last visit to your branch?",
        "The bank probably checked who is your nominee in your saving account and put that as your nominee in your APY a/c. You can probably check that by downloading the [APY app]([https://play.google.com/store/apps/details?id=nsdl.npslite&hl=en&gl=US](https://play.google.com/store/apps/details?id=nsdl.npslite&hl=en&gl=US)) or on their [website]([https://npslite-nsdl.com/CRAlite/EPranAPYOnloadAction.do](https://npslite-nsdl.com/CRAlite/EPranAPYOnloadAction.do)).",
        "I have already checked both the app and the website.\nI don't have any nominee in my bank account. \nThis Kamal Singh who has been placed my nominee has no relation with me.",
        "I have only visited my bank a few times and only time I had to sign anything was when I was ther to open a bank account or when I was collecting my debit card. \nI try to read everything that I have to sign or try to atleast get the the basic purpose of that document. I don't remember signing any document related to A.P.Y.",
        "Opened an account with sbi or any state bank ? Sbi has a target for pension scheme. So they gives a form and casually asks you to sign it..",
        "That bank did fuck up. Raise a complaint immediately.",
        "it looks like a kyc document but has the permissions for this stuff later on. they tried this with my MIL, i was around so did not let that happen.",
        "It's Bank of India which is a Gov bank.",
        "It's Bank of India which is a Gov bank.",
        "Ya.\nSo the same case.\nThey have targets to achieve",
        "This P.O.S will do anything to take money from us. On top of that we have to face the inconvenience of going to the bank filling numerous forms just so we could get ourselves out of this mess made by them."
    ],
    "cleaned_text": "guys please help hi betch student today going bank passbook saw two deductions didnt remember rs firts one done june second one july didnt know supposed checked text messages bank message found deductions made using something called protean apy idea two things googling understand apy atal pension yojna protean app theough initiated didnt downloaded app entered using credentials provided text message found pension created using pan bank details nominee kamal singh acted fatherhe also find documents related transactionscant shar social media dont know currently finals cant go bank dad doesnt know bnak account mom uses hide savings dad mom doesnt know use banking system please help complaint online wher eto complaint bank apy authority ",
    "cleaned_title": "guys please help",
    "cleaned_selftext": "hi betch student today going bank passbook saw two deductions didnt remember rs firts one done june second one july didnt know supposed checked text messages bank message found deductions made using something called protean apy idea two things googling understand apy atal pension yojna protean app theough initiated didnt downloaded app entered using credentials provided text message found pension created using pan bank details nominee kamal singh acted fatherhe also find documents related transactionscant shar social media dont know currently finals cant go bank dad doesnt know bnak account mom uses hide savings dad mom doesnt know use banking system please help complaint online wher eto complaint bank apy authority",
    "cleaned_comments": "apy protean complain via mail first try calling customer service probably give way protean nsdl protean new name file complaint bank bank enrolled atal pension yojana go bank ask cancel without permission yes news branches enrolling customers govtrun schemes like pmbsy pmjjby due pressure targets management since last yearhttpsthewireinbankingbankshavebeenchargingcustomersforgovernmentinsurancetheyneverwanted appears year apy pressure go bank given writing cancel apy collect signed received xerox copy money refund ac debits happen month send xerox copy rbi ombudsman compliant email ok try bank surely cant lie documents put random person father apparently usually attach apy enrollment form account opening kyc updation service request forms might signed without knowing signed anything last visit branch bank probably checked nominee saving account put nominee apy ac probably check downloading apy apphttpsplaygooglecomstoreappsdetailsidnsdlnpslitehlenglushttpsplaygooglecomstoreappsdetailsidnsdlnpslitehlenglus websitehttpsnpslitensdlcomcraliteepranapyonloadactiondohttpsnpslitensdlcomcraliteepranapyonloadactiondo already checked app website dont nominee bank account kamal singh placed nominee relation visited bank times time sign anything ther open bank account collecting debit card try read everything sign try atleast get basic purpose document dont remember signing document related apy opened account sbi state bank sbi target pension scheme gives form casually asks sign bank fuck raise complaint immediately looks like kyc document permissions stuff later tried mil around let happen bank india gov bank bank india gov bank ya case targets achieve pos anything take money us top face inconvenience going bank filling numerous forms could get mess made",
    "light_cleaned_title": "Guys please help me.",
    "light_cleaned_selftext": "Hi!! I am Betch student. Today I was going through my bank passbook and saw two deductions that I didn't remember. Both were Rs. 411/- Firts one was done in june and second one in july. I didn't know what were these supposed to be. So I checked my text messages for bank message. I found that these deductions were made using something called protean for A.P.Y. I had no idea what these two things were. I did some googling and what I can understand is that A.P.Y is Atal Pension Yojna and Protean is an app theough which it was initiated. I didn't do any of this. I downloaded the app and entered using the credentials provided in text message. There I found that a pension was created using my Pan and bank details. The nominee was some Kamal Singh who acted as my father(he is not). I also find some documents related to transactions(can't shar on social media). I don't know what to do. I am currently in between my finals and can't go to bank. My dad doesn't know about my bnak account (my mom uses to hide savings from Dad) and my mom doesn't know how to use banking system. Please help me How do I complaint online and wher eto complaint? To my bank or A.P.Y authority?",
    "light_cleaned_comments": "To apy and protean both complain via a mail first or try calling their customer service they will probably give you a way Protean = NSDL. Protean is their new name. File a complaint with the bank. Your bank has enrolled you in Atal Pension Yojana. Just go to your bank and ask them to cancel it. Can they do that without my permission? Yes, this was in the news. Branches have been enrolling customers in govt-run schemes like PMBSY and PMJJBY due to pressure and targets from management [since last year](https://thewire.in/banking/banks-have-been-charging-customers-for-government-insurance-they-never-wanted). It appears this year it is APY pressure. Go to your bank and given them in writing to cancel your APY. Collect signed and received xerox copy. All your money will be refund to your a/c. If further debits happen after a month, send that xerox copy to RBI Ombudsman with a compliant email. Ok I will try to do that. But the bank surely can't lie on the documents and put a random person as my father. Apparently they have. Usually they will attach the APY enrollment form with account opening, KYC updation or any other service request forms. You might have signed it without knowing. Have you signed anything in your last visit to your branch? The bank probably checked who is your nominee in your saving account and put that as your nominee in your APY a/c. You can probably check that by downloading the [APY app]([https://play.google.com/store/apps/details?id=nsdl.npslite&hl=en&gl=US](https://play.google.com/store/apps/details?id=nsdl.npslite&hl=en&gl=US)) or on their [website]([https://npslite-nsdl.com/CRAlite/EPranAPYOnloadAction.do](https://npslite-nsdl.com/CRAlite/EPranAPYOnloadAction.do)). I have already checked both the app and the website. I don't have any nominee in my bank account. This Kamal Singh who has been placed my nominee has no relation with me. I have only visited my bank a few times and only time I had to sign anything was when I was ther to open a bank account or when I was collecting my debit card. I try to read everything that I have to sign or try to atleast get the the basic purpose of that document. I don't remember signing any document related to A.P.Y. Opened an account with sbi or any state bank ? Sbi has a target for pension scheme. So they gives a form and casually asks you to sign it.. That bank did fuck up. Raise a complaint immediately. it looks like a kyc document but has the permissions for this stuff later on. they tried this with my MIL, i was around so did not let that happen. It's Bank of India which is a Gov bank. It's Bank of India which is a Gov bank. Ya. So the same case. They have targets to achieve This P.O.S will do anything to take money from us. On top of that we have to face the inconvenience of going to the bank filling numerous forms just so we could get ourselves out of this mess made by them."
}