{
    "id": "15krz4p",
    "title": "They killed my first child with a stone in front of my eyes 💔",
    "url": "https://twitter.com/BBCHindi/status/1688581016850403330?t=HFJ7jMU-54Gey3tzkbTd9w&s=19",
    "selftext": "Imagine what she must have gone through in her entire life and what she'd be feeling right now since her all rapists were released by a mass murderer and a insensitive person called narendra modi, it makes me feel anguish and furious to see how narendra modi and BJP as ruined the entire country and made Indians morally corrupt. I can't see any light coming anywhere near. I feel sad I just hate bjp more than anything in this world and I hate their supporters even more than lundendra modi.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691431126.0,
    "convurl": "https://external-preview.redd.it/uwGpzpTUPBOwiNGC9fCPsvSYwn-EIJPSQ9Krx0rTNtw.jpg?auto=webp&s=d96c663c4141b63136c22c9e9ddeb982bbe126c8",
    "comments": [],
    "cleaned_text": "killed first child stone front eyes imagine must gone entire life shed feeling right since rapists released mass murderer insensitive person called narendra modi makes feel anguish furious see narendra modi bjp ruined entire country made indians morally corrupt cant see light coming anywhere near feel sad hate bjp anything world hate supporters even lundendra modi ",
    "cleaned_title": "killed first child stone front eyes",
    "cleaned_selftext": "imagine must gone entire life shed feeling right since rapists released mass murderer insensitive person called narendra modi makes feel anguish furious see narendra modi bjp ruined entire country made indians morally corrupt cant see light coming anywhere near feel sad hate bjp anything world hate supporters even lundendra modi",
    "cleaned_comments": "",
    "light_cleaned_title": "They killed my first child with a stone in front of my eyes 💔",
    "light_cleaned_selftext": "Imagine what she must have gone through in her entire life and what she'd be feeling right now since her all rapists were released by a mass murderer and a insensitive person called narendra modi, it makes me feel anguish and furious to see how narendra modi and BJP as ruined the entire country and made Indians morally corrupt. I can't see any light coming anywhere near. I feel sad I just hate bjp more than anything in this world and I hate their supporters even more than lundendra modi.",
    "light_cleaned_comments": ""
}