{
    "id": "1e0s2hz",
    "title": "Techies as slaves? All about Indians-run programming racket in US",
    "url": "https://www.indiatoday.in/amp/world/us-news/story/princeton-programming-racket-indians-arrested-human-trafficking-forced-labor-texas-javascript-jobs-2565377-2024-07-11",
    "selftext": "What is happening?😭\n",
    "flair": "Crime",
    "score": 45,
    "num_comments": 7,
    "created_utc": 1720712723.0,
    "convurl": "https://external-preview.redd.it/ut0Sf7BwHZ4gH8O8IbJ6GdNO38WNVFhli7i2TB0aWXA.jpg?auto=webp&s=c92f9d974a2ffefcf337809d6be32d621f965593",
    "comments": [
        "Oh! So this is what white collar crime in the software sector look like? 😅",
        "This was the visionaries lecturing us about 70hr work week before they became famous.",
        "The real crime is that they were forced to learn and use Javascript",
        "> The women were made to learn JavaScript   \n\nThat's a crime against humanity right there.",
        "We need to take them to The Hague!\n\nUnspeakable brutality right here!!",
        "How do you force someone to do programming work?",
        "Telugu consultations has already created bad reputation for h1b visa fraud and now this",
        "It’s not a joke… I wouldn’t wish Javascript on my worst enemy.",
        "**javascript**"
    ],
    "cleaned_text": "techies slaves indiansrun programming racket us happening ",
    "cleaned_title": "techies slaves indiansrun programming racket us",
    "cleaned_selftext": "happening",
    "cleaned_comments": "oh white collar crime software sector look like visionaries lecturing us hr work week became famous real crime forced learn use javascript women made learn javascript thats crime humanity right need take hague unspeakable brutality right force someone programming work telugu consultations already created bad reputation hb visa fraud joke wouldnt wish javascript worst enemy javascript",
    "light_cleaned_title": "Techies as slaves? All about Indians-run programming racket in US",
    "light_cleaned_selftext": "What is happening?😭",
    "light_cleaned_comments": "Oh! So this is what white collar crime in the software sector look like? 😅 This was the visionaries lecturing us about 70hr work week before they became famous. The real crime is that they were forced to learn and use Javascript > The women were made to learn JavaScript That's a crime against humanity right there. We need to take them to The Hague! Unspeakable brutality right here!! How do you force someone to do programming work? Telugu consultations has already created bad reputation for h1b visa fraud and now this It’s not a joke… I wouldn’t wish Javascript on my worst enemy. **javascript**"
}