{
    "id": "17ru0db",
    "title": "Small kid got slapped and kicked",
    "url": "https://www.reddit.com/r/india/comments/17ru0db/small_kid_got_slapped_and_kicked/",
    "selftext": "[https://twitter.com/SachinGuptaUP/status/1722476795868459068](https://twitter.com/SachinGuptaUP/status/1722476795868459068)\n\nSome people are such aholes, how do these people think its okay do such things to a kid.\n\nIf they'd issues, they could've politely ask the kid to leave the shop.",
    "flair": "Crime",
    "score": 4,
    "num_comments": 1,
    "created_utc": 1699583591.0,
    "convurl": "https://external-preview.redd.it/AGnVf1qx0L6sS2zeCIdknPuC2EMVf0-paDk0piO6scg.jpg?auto=webp&s=aa8f24f128a8975d2fad6a6804919b8d5775b568",
    "comments": [
        "To the guys who were too engrossed enjoyingin your food whilst a child was almost beaten to death a few feet from you, there are many more like you amongst us. \n\nWe are the new India. \n\nNo /s.",
        "Its not new India, people like this always existed in India. Also such people exist in every other country/society."
    ],
    "cleaned_text": "small kid got slapped kicked httpstwittercomsachinguptaupstatushttpstwittercomsachinguptaupstatus people aholes people think okay things kid theyd issues couldve politely ask kid leave shop ",
    "cleaned_title": "small kid got slapped kicked",
    "cleaned_selftext": "httpstwittercomsachinguptaupstatushttpstwittercomsachinguptaupstatus people aholes people think okay things kid theyd issues couldve politely ask kid leave shop",
    "cleaned_comments": "guys engrossed enjoyingin food whilst child almost beaten death feet many like amongst us new india new india people like always existed india also people exist every countrysociety",
    "light_cleaned_title": "Small kid got slapped and kicked",
    "light_cleaned_selftext": "[https://twitter.com/SachinGuptaUP/status/1722476795868459068](https://twitter.com/SachinGuptaUP/status/1722476795868459068) Some people are such aholes, how do these people think its okay do such things to a kid. If they'd issues, they could've politely ask the kid to leave the shop.",
    "light_cleaned_comments": "To the guys who were too engrossed enjoyingin your food whilst a child was almost beaten to death a few feet from you, there are many more like you amongst us. We are the new India. No /s. Its not new India, people like this always existed in India. Also such people exist in every other country/society."
}