{
    "id": "129jp28",
    "title": "Karnataka elections: Civil society groups release people’s manifesto, organise datajam",
    "url": "https://www.thehindu.com/elections/karnataka-assembly/karnataka-elections-civil-society-forum-releases-peoples-manifesto-in-bengaluru/article66687534.ece",
    "selftext": "The manifesto advises political parties to have a commitment towards strengthening democracy",
    "flair": "Politics",
    "score": 18,
    "num_comments": 2,
    "created_utc": 1680438149.0,
    "convurl": "https://external-preview.redd.it/buRz0MRTawQOpYp0FzrlE7ap9VzAtptb-3Z2o2ABSnI.jpg?auto=webp&v=enabled&s=0835d71bec709a98930fc15bec50170c2e3aa276",
    "comments": [
        "On Saturday, the Civil Society Forum released a ‘people’s manifesto’ with the hope that political parties include the issues in their manifestos.\n\nHistorian and writer Ramachandra Guha, who presided over the event, said, “Today, our nation has become an ‘election only democracy’. There is no accountability of the government to the citizens, judiciary or media between elections. .”\n\nHe lamented that political parties were not interested in having a dialogue with civil society organisations (CSOs), though the CSOs came with much knowledge, expertise, and understanding of ground-level realities. “Sadly, election results were not being honoured and duly elected governments were being toppled,” Mr. Guha added.\n\nThe ‘people’s manifesto’ has demands pertaining to administrative measures, curbing corruption, urban governance, housing, and slums, panchayat raj, agriculture, right to food, health, education, labour issues, women’s right, rights of the differently abled, environment, solid waste management, and transportation.\n\nOn religious freedom, the manifesto states that there is an atmosphere of fear and apprehension in the minds of the common man because of hate politics.",
        "While they found that in health, Bengaluru does fairly well in terms of primary healthcare centres with the addition of Namma Clinics, they said anganwadi centres are severely lacking in our city. “It was observed that the number of private schools in Bengaluru far exceeds that of public schools. There is an urgent need for MLAs to look at medical facilities and sanitation in public schools. We noted that schools in 22 constituencies failed to meet pupil-teacher ratios. Recruitment of teachers is an urgent need,” they pointed out.\n\nA release said, “Nearly 2,900 bus stops and 63 metro stations have been analysed to understand how the Bengaluru constituencies fare in terms of access to public transport. Ten are yet to have any metro connectivity. While the inner constituencies were well connected by buses, outer constituencies need better public transport investment, both in terms of stops and frequencies. Anekal, Bengaluru South, Byatarayanapura, and Yelahanka have limited access to public transport when compared with other constituencies.\n\nLooking at voter participation, ward committee meetings conducted and minutes uploaded, and complaints filed in IChangeMyCity (Public Eye) as well as Fix My Street, the team found that participation in elections does not correlate to how often people complain about issues with the BBMP.\n\n“Such analysis can be useful for the MLAs who will be elected next month to know where the gaps are that need to be addressed,” the release said"
    ],
    "cleaned_text": "karnataka elections civil society groups release peoples manifesto organise datajam manifesto advises political parties commitment towards strengthening democracy ",
    "cleaned_title": "karnataka elections civil society groups release peoples manifesto organise datajam",
    "cleaned_selftext": "manifesto advises political parties commitment towards strengthening democracy",
    "cleaned_comments": "saturday civil society forum released peoples manifesto hope political parties include issues manifestos historian writer ramachandra guha presided event said today nation become election democracy accountability government citizens judiciary media elections lamented political parties interested dialogue civil society organisations csos though csos came much knowledge expertise understanding groundlevel realities sadly election results honoured duly elected governments toppled mr guha added peoples manifesto demands pertaining administrative measures curbing corruption urban governance housing slums panchayat raj agriculture right food health education labour issues womens right rights differently abled environment solid waste management transportation religious freedom manifesto states atmosphere fear apprehension minds common man hate politics found health bengaluru fairly well terms primary healthcare centres addition namma clinics said anganwadi centres severely lacking city observed number private schools bengaluru far exceeds public schools urgent need mlas look medical facilities sanitation public schools noted schools constituencies failed meet pupilteacher ratios recruitment teachers urgent need pointed release said nearly bus stops metro stations analysed understand bengaluru constituencies fare terms access public transport ten yet metro connectivity inner constituencies well connected buses outer constituencies need better public transport investment terms stops frequencies anekal bengaluru south byatarayanapura yelahanka limited access public transport compared constituencies looking voter participation ward committee meetings conducted minutes uploaded complaints filed ichangemycity public eye well fix street team found participation elections correlate often people complain issues bbmp analysis useful mlas elected next month know gaps need addressed release said",
    "light_cleaned_title": "Karnataka elections: Civil society groups release people’s manifesto, organise datajam",
    "light_cleaned_selftext": "The manifesto advises political parties to have a commitment towards strengthening democracy",
    "light_cleaned_comments": "On Saturday, the Civil Society Forum released a ‘people’s manifesto’ with the hope that political parties include the issues in their manifestos. Historian and writer Ramachandra Guha, who presided over the event, said, “Today, our nation has become an ‘election only democracy’. There is no accountability of the government to the citizens, judiciary or media between elections. .” He lamented that political parties were not interested in having a dialogue with civil society organisations (CSOs), though the CSOs came with much knowledge, expertise, and understanding of ground-level realities. “Sadly, election results were not being honoured and duly elected governments were being toppled,” Mr. Guha added. The ‘people’s manifesto’ has demands pertaining to administrative measures, curbing corruption, urban governance, housing, and slums, panchayat raj, agriculture, right to food, health, education, labour issues, women’s right, rights of the differently abled, environment, solid waste management, and transportation. On religious freedom, the manifesto states that there is an atmosphere of fear and apprehension in the minds of the common man because of hate politics. While they found that in health, Bengaluru does fairly well in terms of primary healthcare centres with the addition of Namma Clinics, they said anganwadi centres are severely lacking in our city. “It was observed that the number of private schools in Bengaluru far exceeds that of public schools. There is an urgent need for MLAs to look at medical facilities and sanitation in public schools. We noted that schools in 22 constituencies failed to meet pupil-teacher ratios. Recruitment of teachers is an urgent need,” they pointed out. A release said, “Nearly 2,900 bus stops and 63 metro stations have been analysed to understand how the Bengaluru constituencies fare in terms of access to public transport. Ten are yet to have any metro connectivity. While the inner constituencies were well connected by buses, outer constituencies need better public transport investment, both in terms of stops and frequencies. Anekal, Bengaluru South, Byatarayanapura, and Yelahanka have limited access to public transport when compared with other constituencies. Looking at voter participation, ward committee meetings conducted and minutes uploaded, and complaints filed in IChangeMyCity (Public Eye) as well as Fix My Street, the team found that participation in elections does not correlate to how often people complain about issues with the BBMP. “Such analysis can be useful for the MLAs who will be elected next month to know where the gaps are that need to be addressed,” the release said"
}