{
    "id": "1edl54k",
    "title": "Student Abuse at DPS Ranipur: Help Needed",
    "url": "https://www.reddit.com/r/india/comments/1edl54k/student_abuse_at_dps_ranipur_help_needed/",
    "selftext": "Hello there,\n\nI am reaching out to you for help reaching the media. This is a charter that has been made to sign at DPS Ranipur.\n\n[https://imgur.com/a/BhfKMhH](https://imgur.com/a/BhfKMhH)\n\nI am an ex-student at DPS Ranipur and it pains me to see what has happened to the school.\n\nThe following are some examples of what is happening.\n\n* Using social media in any form not being allowed for 16 17 year old children, wtf?\n* Students being removed or suspended (around 8-12 till now) from the school due to just USING social media\n* No conversation with the parents before removal of said students\n* Students being harassed by color of their undergarments being called out (especially for girls)\n* If a student's phone is found at school, they are forced to open the phone and then all their message are read and their phone is checked.\n* The students are suspended for attending any parties without their parents\n* Asking other students to snitch on each other by taking screenshots of their private profiles\n\nAny help would be greatly appreciated, thanks you fuckers.\n\nThese are the links of the school, you should be able to find them using any DPS Ranipur / DPS Haridwar pages.\n\n[https://dpshardwar.com/](https://dpshardwar.com/)",
    "flair": "Rant / Vent",
    "score": 14,
    "num_comments": 5,
    "created_utc": 1722099839.0,
    "convurl": "https://external-preview.redd.it/nbJC62YJhubL8GBjQT9Ztsdz0PMetJlTvYabDJxeUEM.jpg?auto=webp&s=dae278a212d21c997fe1fefb03077abc314b9ead",
    "comments": [
        "Hi ex fellow alumni, I dont mean to discourage you but I do hope you realize the parents of the students are very conservative and push for a lot of these things. The entire school ecosystem is super toxic, dont expect backing from them. That said, I think you should mention some of the more problematic slut-shaming and rape culture that seems to get normalized there.",
        "You're right perhaps. It's just harder to prove those things given I can't provide a charter showing\n\n\"Baal kyu khol ke rakhein hain. Ladko ke liye?\" or the teachers who hit me on my ass just 3-4 years ago.\n\nHorrible place, seems to be going tos hit even more.",
        "Absolutely horrific place. Also wait, are you a girl? Did a teacher hit you there as a girl?",
        "I'm not a guy but I can vouch for seeing few of the guy teachers hitting girls so... yeah.",
        "Not somewhere inappropriate, right?",
        "Thankfully not, not that it makes it better."
    ],
    "cleaned_text": "student abuse dps ranipur help needed hello reaching help reaching media charter made sign dps ranipur httpsimgurcomabhfkmhhhttpsimgurcomabhfkmhh exstudent dps ranipur pains see happened school following examples happening using social media form allowed year old children wtf students removed suspended around till school due using social media conversation parents removal said students students harassed color undergarments called especially girls students phone found school forced open phone message read phone checked students suspended attending parties without parents asking students snitch taking screenshots private profiles help would greatly appreciated thanks fuckers links school able find using dps ranipur dps haridwar pages httpsdpshardwarcomhttpsdpshardwarcom ",
    "cleaned_title": "student abuse dps ranipur help needed",
    "cleaned_selftext": "hello reaching help reaching media charter made sign dps ranipur httpsimgurcomabhfkmhhhttpsimgurcomabhfkmhh exstudent dps ranipur pains see happened school following examples happening using social media form allowed year old children wtf students removed suspended around till school due using social media conversation parents removal said students students harassed color undergarments called especially girls students phone found school forced open phone message read phone checked students suspended attending parties without parents asking students snitch taking screenshots private profiles help would greatly appreciated thanks fuckers links school able find using dps ranipur dps haridwar pages httpsdpshardwarcomhttpsdpshardwarcom",
    "cleaned_comments": "hi ex fellow alumni dont mean discourage hope realize parents students conservative push lot things entire school ecosystem super toxic dont expect backing said think mention problematic slutshaming rape culture seems get normalized youre right perhaps harder prove things given cant provide charter showing baal kyu khol ke rakhein hain ladko ke liye teachers hit ass years ago horrible place seems going tos hit even absolutely horrific place also wait girl teacher hit girl im guy vouch seeing guy teachers hitting girls yeah somewhere inappropriate right thankfully makes better",
    "light_cleaned_title": "Student Abuse at DPS Ranipur: Help Needed",
    "light_cleaned_selftext": "Hello there, I am reaching out to you for help reaching the media. This is a charter that has been made to sign at DPS Ranipur. [https://imgur.com/a/BhfKMhH](https://imgur.com/a/BhfKMhH) I am an ex-student at DPS Ranipur and it pains me to see what has happened to the school. The following are some examples of what is happening. * Using social media in any form not being allowed for 16 17 year old children, wtf? * Students being removed or suspended (around 8-12 till now) from the school due to just USING social media * No conversation with the parents before removal of said students * Students being harassed by color of their undergarments being called out (especially for girls) * If a student's phone is found at school, they are forced to open the phone and then all their message are read and their phone is checked. * The students are suspended for attending any parties without their parents * Asking other students to snitch on each other by taking screenshots of their private profiles Any help would be greatly appreciated, thanks you fuckers. These are the links of the school, you should be able to find them using any DPS Ranipur / DPS Haridwar pages. [https://dpshardwar.com/](https://dpshardwar.com/)",
    "light_cleaned_comments": "Hi ex fellow alumni, I dont mean to discourage you but I do hope you realize the parents of the students are very conservative and push for a lot of these things. The entire school ecosystem is super toxic, dont expect backing from them. That said, I think you should mention some of the more problematic slut-shaming and rape culture that seems to get normalized there. You're right perhaps. It's just harder to prove those things given I can't provide a charter showing \"Baal kyu khol ke rakhein hain. Ladko ke liye?\" or the teachers who hit me on my ass just 3-4 years ago. Horrible place, seems to be going tos hit even more. Absolutely horrific place. Also wait, are you a girl? Did a teacher hit you there as a girl? I'm not a guy but I can vouch for seeing few of the guy teachers hitting girls so... yeah. Not somewhere inappropriate, right? Thankfully not, not that it makes it better."
}