{
    "id": "1hb4nbw",
    "title": "Supreme Court Expresses Concerns At Several Temples In UP Coming Under Receivership Of Advocates, Seeks Report From Mathura District Court",
    "url": "https://www.livelaw.in/top-stories/supreme-court-temple-administration-in-uttar-pradesh-report-called-from-principal-district-judge-mathura-277914",
    "selftext": "Taking note of issues surrounding temple administration in Uttar Pradesh, and the \"vested interest\" of Advocates appointed as Receivers in keeping litigations around such issues pending, the Supreme Court recently called for a report from Principal District Judge, Mathura.\n\nThe report sought from the District Judge shall specify the following:\n\ni. List of Temples in the District of Mathura in respect of which the litigations are pending and in which the Receivers appointed by the Courts.\n\nii. Since when such litigations are pending and the status of such proceedings.\n\niii. The names and status of the persons, particularly of the Advocates appointed by the Courts as Receivers.\n\niv. The remuneration, if any, being paid to the Receivers appointed in such proceedings.\n\n\n\"The interest of Receiver lies in keeping the litigation pending. No effort is made to conclude the civil proceedings, as the entire control of temple administration vest in the hands of Receiver. Most of the litigation is in respect of management of temples and appointment of Receivers.\"\n\n",
    "flair": "Law & Courts",
    "score": 6,
    "num_comments": 1,
    "created_utc": 1733845443.0,
    "convurl": "https://external-preview.redd.it/YSy2l3l04nXZQgIPk_wcyTke50Sv7Ajg0kI6ARMOabs.jpg?auto=webp&s=591ed3f30af5f416cc8b307de5e364cc8331d78a",
    "comments": [
        "UP being UP. \n\nIn a single day, \nHC judge \nJaunpur judge\nAnd now this"
    ],
    "cleaned_text": "supreme court expresses concerns several temples coming receivership advocates seeks report mathura district court taking note issues surrounding temple administration uttar pradesh vested interest advocates appointed receivers keeping litigations around issues pending supreme court recently called report principal district judge mathura report sought district judge shall specify following list temples district mathura respect litigations pending receivers appointed courts ii since litigations pending status proceedings iii names status persons particularly advocates appointed courts receivers iv remuneration paid receivers appointed proceedings interest receiver lies keeping litigation pending effort made conclude civil proceedings entire control temple administration vest hands receiver litigation respect management temples appointment receivers ",
    "cleaned_title": "supreme court expresses concerns several temples coming receivership advocates seeks report mathura district court",
    "cleaned_selftext": "taking note issues surrounding temple administration uttar pradesh vested interest advocates appointed receivers keeping litigations around issues pending supreme court recently called report principal district judge mathura report sought district judge shall specify following list temples district mathura respect litigations pending receivers appointed courts ii since litigations pending status proceedings iii names status persons particularly advocates appointed courts receivers iv remuneration paid receivers appointed proceedings interest receiver lies keeping litigation pending effort made conclude civil proceedings entire control temple administration vest hands receiver litigation respect management temples appointment receivers",
    "cleaned_comments": "single day hc judge jaunpur judge",
    "light_cleaned_title": "Supreme Court Expresses Concerns At Several Temples In UP Coming Under Receivership Of Advocates, Seeks Report From Mathura District Court",
    "light_cleaned_selftext": "Taking note of issues surrounding temple administration in Uttar Pradesh, and the \"vested interest\" of Advocates appointed as Receivers in keeping litigations around such issues pending, the Supreme Court recently called for a report from Principal District Judge, Mathura. The report sought from the District Judge shall specify the following: i. List of Temples in the District of Mathura in respect of which the litigations are pending and in which the Receivers appointed by the Courts. ii. Since when such litigations are pending and the status of such proceedings. iii. The names and status of the persons, particularly of the Advocates appointed by the Courts as Receivers. iv. The remuneration, if any, being paid to the Receivers appointed in such proceedings. \"The interest of Receiver lies in keeping the litigation pending. No effort is made to conclude the civil proceedings, as the entire control of temple administration vest in the hands of Receiver. Most of the litigation is in respect of management of temples and appointment of Receivers.\"",
    "light_cleaned_comments": "UP being UP. In a single day, HC judge Jaunpur judge And now this"
}