{
    "id": "1dsplsv",
    "title": "Men on motorcycle fire outside Mahindra showroom",
    "url": "https://v.redd.it/k3clsqtsvv9d1",
    "selftext": "Demand ransom of Rs 5 crores ",
    "flair": "Crime",
    "score": 153,
    "num_comments": 17,
    "created_utc": 1719829404.0,
    "convurl": "https://external-preview.redd.it/OG03dWF5anN2djlkMedhu4HYdvbj-yvO8uyP6uJmSDBUTflAvVJZQ49O3HH_.png?format=pjpg&auto=webp&s=b78a020add73499aba41a34c2abc331188a1a682",
    "comments": [
        "Lmao guy driving the motorbike has no face covering. Some CCTV would have definitely caught them. Only a matter of time before they're busted.",
        "They demanding early delivery of their Thar/Scorpio/xuv700",
        "Helmets save in multiple ways.",
        "People tired of Thar's atrocities.",
        "Bullat fanbois vs Thar fanbois\n\nFight for hollow supremacy, who spend more on maintenance & who pays more for basic accessories that should come for free.",
        "Maybe fed up due to waiting period 🤣",
        "I think they're blanks",
        "Which city?",
        "Koi dara hi nai...",
        "Where is the fire?",
        "I think they are fire crackers ..no recoil at all",
        "Hahahaha",
        "Thar Nahi mili hogi unko...",
        "kuch na scar-peo ki waiting khatam hi na hori to 2-4 goli-gali chaladi sai ma bhalle jaat ka toh koi na haa.",
        "These men be like “ Aa police meri g@@nd maar” 😂🙏",
        "Didi with whiper was so chill \"aree goli hi to hai, eh to Roz dekhat hai hum gaon me\"",
        "Pre Thar booking Test"
    ],
    "cleaned_text": "men motorcycle fire outside mahindra showroom demand ransom rs crores ",
    "cleaned_title": "men motorcycle fire outside mahindra showroom",
    "cleaned_selftext": "demand ransom rs crores",
    "cleaned_comments": "lmao guy driving motorbike face covering cctv would definitely caught matter time theyre busted demanding early delivery tharscorpioxuv helmets save multiple ways people tired thars atrocities bullat fanbois vs thar fanbois fight hollow supremacy spend maintenance pays basic accessories come free maybe fed due waiting period think theyre blanks city koi dara hi nai fire think fire crackers recoil hahahaha thar nahi mili hogi unko kuch na scarpeo ki waiting khatam hi na hori goligali chaladi sai bhalle jaat ka toh koi na haa men like aa police meri gnd maar didi whiper chill aree goli hi hai eh roz dekhat hai hum gaon pre thar booking test",
    "light_cleaned_title": "Men on motorcycle fire outside Mahindra showroom",
    "light_cleaned_selftext": "Demand ransom of Rs 5 crores",
    "light_cleaned_comments": "Lmao guy driving the motorbike has no face covering. Some CCTV would have definitely caught them. Only a matter of time before they're busted. They demanding early delivery of their Thar/Scorpio/xuv700 Helmets save in multiple ways. People tired of Thar's atrocities. Bullat fanbois vs Thar fanbois Fight for hollow supremacy, who spend more on maintenance & who pays more for basic accessories that should come for free. Maybe fed up due to waiting period 🤣 I think they're blanks Which city? Koi dara hi nai... Where is the fire? I think they are fire crackers ..no recoil at all Hahahaha Thar Nahi mili hogi unko... kuch na scar-peo ki waiting khatam hi na hori to 2-4 goli-gali chaladi sai ma bhalle jaat ka toh koi na haa. These men be like “ Aa police meri g@@nd maar” 😂🙏 Didi with whiper was so chill \"aree goli hi to hai, eh to Roz dekhat hai hum gaon me\" Pre Thar booking Test"
}