{
    "id": "164g00v",
    "title": "Kids nowadays are the epitome of every negative connotation that comes from being a Zoomer.",
    "url": "https://www.reddit.com/r/india/comments/164g00v/kids_nowadays_are_the_epitome_of_every_negative/",
    "selftext": "I watch a lot of videos on Indian history and world history more widely on YouTube \\[the rare, unbiased type videos\\]. One day to relax I hopped on YT Shorts, and saw an edit on the War of 1971 that had numerous factual inaccuracies.\n\n* It claimed that both the United States and UK attempted to invade India from the west and planned to jointly colonize it after the war. Absolute bullshit, and they provided almost zero non-verbal assistance to Pakistan, only sending a few submarines to intimidate India. \n* It claimed the USSR had helped India by sending millions of men and billions of dollars worth of equipment in the hopes that India could take over Pakistan after the war but the great plan was foiled by evil UN, again absolute nonsense.\n* Only India, Bangladesh and Pakistan are listed on Wikipedia's [belligerents list](https://en.wikipedia.org/wiki/Bangladesh_Liberation_War).\n\nI pointed out these inaccuracies and he said, \"you dont know real history\", I just replied with a source \\[Wiki\\] not intending to drag it out further and he just said \"you're being brainwashed by stupid west media\".\n\nI left it there \\[can't win arguments against stupid people\\].\n\nOverall that channel was just a communal soapbox with pro-India, pro-Hindu and anti-Muslim content.\n\nAdditionally the core BJP supporters in general, the bhakts, cannot ever accept that they're wrong, and always blame apparent anti-India and pro-Muslim bias in the West.\n\n&#x200B;\n\nThoughts?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693308921.0,
    "convurl": "https://external-preview.redd.it/Nupga6oA9QX2sDHXkfhYJozzgh7DMhrmx6J2pQME8h0.jpg?auto=webp&s=4243d579ed2c5261038d131ab3da2e4b1025131c",
    "comments": [
        "You should report the channel, such channels that peddle in fake news and half truths are already under the radar of the government, and reporting them for hate speech should at least bring it to the attention of YouTube at the very least",
        "The channel is more than likely run by a kid, it's called \"savage\\_gamer\".\n\nThe issue is that kids don't believe truth now and are more susceptible to lies and propaganda, not just savage\\_gamer, all kids with an online presence.",
        "I actually feel bad for them rather than angry, we older generations had the basic advantage of knowing something is true based on the source but still struggle with fake news today.\nImagine what it's like for zoomers who have only had the internet for information and no way of knowing if something is true or not",
        "You are generalizing an entire generation based on your interactions in a YouTube comment section?",
        "It's this and many other such incidents."
    ],
    "cleaned_text": "kids nowadays epitome every negative connotation comes zoomer watch lot videos indian history world history widely youtube rare unbiased type videos one day relax hopped yt shorts saw edit war numerous factual inaccuracies claimed united states uk attempted invade india west planned jointly colonize war absolute bullshit provided almost zero nonverbal assistance pakistan sending submarines intimidate india claimed ussr helped india sending millions men billions dollars worth equipment hopes india could take pakistan war great plan foiled evil un absolute nonsense india bangladesh pakistan listed wikipedias belligerents listhttpsenwikipediaorgwikibangladeshliberationwar pointed inaccuracies said dont know real history replied source wiki intending drag said youre brainwashed stupid west media left cant win arguments stupid people overall channel communal soapbox proindia prohindu antimuslim content additionally core bjp supporters general bhakts ever accept theyre wrong always blame apparent antiindia promuslim bias west xb thoughts ",
    "cleaned_title": "kids nowadays epitome every negative connotation comes zoomer",
    "cleaned_selftext": "watch lot videos indian history world history widely youtube rare unbiased type videos one day relax hopped yt shorts saw edit war numerous factual inaccuracies claimed united states uk attempted invade india west planned jointly colonize war absolute bullshit provided almost zero nonverbal assistance pakistan sending submarines intimidate india claimed ussr helped india sending millions men billions dollars worth equipment hopes india could take pakistan war great plan foiled evil un absolute nonsense india bangladesh pakistan listed wikipedias belligerents listhttpsenwikipediaorgwikibangladeshliberationwar pointed inaccuracies said dont know real history replied source wiki intending drag said youre brainwashed stupid west media left cant win arguments stupid people overall channel communal soapbox proindia prohindu antimuslim content additionally core bjp supporters general bhakts ever accept theyre wrong always blame apparent antiindia promuslim bias west xb thoughts",
    "cleaned_comments": "report channel channels peddle fake news half truths already radar government reporting hate speech least bring attention youtube least channel likely run kid called savagegamer issue kids dont believe truth susceptible lies propaganda savagegamer kids online presence actually feel bad rather angry older generations basic advantage knowing something true based source still struggle fake news today imagine like zoomers internet information way knowing something true generalizing entire generation based interactions youtube comment section many incidents",
    "light_cleaned_title": "Kids nowadays are the epitome of every negative connotation that comes from being a Zoomer.",
    "light_cleaned_selftext": "I watch a lot of videos on Indian history and world history more widely on YouTube \\[the rare, unbiased type videos\\]. One day to relax I hopped on YT Shorts, and saw an edit on the War of 1971 that had numerous factual inaccuracies. * It claimed that both the United States and UK attempted to invade India from the west and planned to jointly colonize it after the war. Absolute bullshit, and they provided almost zero non-verbal assistance to Pakistan, only sending a few submarines to intimidate India. * It claimed the USSR had helped India by sending millions of men and billions of dollars worth of equipment in the hopes that India could take over Pakistan after the war but the great plan was foiled by evil UN, again absolute nonsense. * Only India, Bangladesh and Pakistan are listed on Wikipedia's [belligerents list](https://en.wikipedia.org/wiki/Bangladesh_Liberation_War). I pointed out these inaccuracies and he said, \"you dont know real history\", I just replied with a source \\[Wiki\\] not intending to drag it out further and he just said \"you're being brainwashed by stupid west media\". I left it there \\[can't win arguments against stupid people\\]. Overall that channel was just a communal soapbox with pro-India, pro-Hindu and anti-Muslim content. Additionally the core BJP supporters in general, the bhakts, cannot ever accept that they're wrong, and always blame apparent anti-India and pro-Muslim bias in the West. &#x200B; Thoughts?",
    "light_cleaned_comments": "You should report the channel, such channels that peddle in fake news and half truths are already under the radar of the government, and reporting them for hate speech should at least bring it to the attention of YouTube at the very least The channel is more than likely run by a kid, it's called \"savage\\_gamer\". The issue is that kids don't believe truth now and are more susceptible to lies and propaganda, not just savage\\_gamer, all kids with an online presence. I actually feel bad for them rather than angry, we older generations had the basic advantage of knowing something is true based on the source but still struggle with fake news today. Imagine what it's like for zoomers who have only had the internet for information and no way of knowing if something is true or not You are generalizing an entire generation based on your interactions in a YouTube comment section? It's this and many other such incidents."
}