{
    "id": "16hiwag",
    "title": "Special Session's Agenda Unknown, Centre Calls All Party Meet Day Before",
    "url": "https://www.reddit.com/r/india/comments/16hiwag/special_sessions_agenda_unknown_centre_calls_all/",
    "selftext": "https://www.ndtv.com/india-news/centre-calls-all-party-meeting-on-september-17-day-before-special-session-of-parliament-4385559\n\n\n>The government has called for an all-party meeting on Monday evening - hours before the start of a five-day special session of Parliament summoned by Union Minister Pralhad Joshi earlier this month. The meeting may discuss the agenda for next week's special session, which, sources had said will start in the old building and move to the new on September 19.\n\nHow can the agenda be kept a secret? How will the opposition prepare for the discussion?",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694599150.0,
    "convurl": "https://external-preview.redd.it/qDyBJAwBkXS9bdLVqOyeXa3ju8e6CnrDR5R5CcTjv_E.jpg?auto=webp&s=082f2b402821b41c9514686c7ebf01caf9db249a",
    "comments": [],
    "cleaned_text": "special sessions agenda unknown centre calls party meet day government called allparty meeting monday evening hours start fiveday special session parliament summoned union minister pralhad joshi earlier month meeting may discuss agenda next weeks special session sources said start old building move new september agenda kept secret opposition prepare discussion ",
    "cleaned_title": "special sessions agenda unknown centre calls party meet day",
    "cleaned_selftext": "government called allparty meeting monday evening hours start fiveday special session parliament summoned union minister pralhad joshi earlier month meeting may discuss agenda next weeks special session sources said start old building move new september agenda kept secret opposition prepare discussion",
    "cleaned_comments": "",
    "light_cleaned_title": "Special Session's Agenda Unknown, Centre Calls All Party Meet Day Before",
    "light_cleaned_selftext": ">The government has called for an all-party meeting on Monday evening - hours before the start of a five-day special session of Parliament summoned by Union Minister Pralhad Joshi earlier this month. The meeting may discuss the agenda for next week's special session, which, sources had said will start in the old building and move to the new on September 19. How can the agenda be kept a secret? How will the opposition prepare for the discussion?",
    "light_cleaned_comments": ""
}