{
    "id": "1dp6hjr",
    "title": "New criminal code: Days to go for new codes but official translations still pending, states wait",
    "url": "https://indianexpress.com/article/india/new-criminal-code-days-to-go-for-new-codes-but-official-translations-still-pending-states-wait-9415181/",
    "selftext": "This may take time, said the official: “We had written to Chief Secretaries of states to facilitate translations of the laws and even sent a reminder last month…A few states sent their translations of the evidence act to the Ministry for vetting. However, the process may take over six months to complete for all states,” the official added.",
    "flair": "Law & Courts",
    "score": 33,
    "num_comments": 11,
    "created_utc": 1719428323.0,
    "convurl": "https://external-preview.redd.it/HAsOYVX9EdPStcYmZUQvPP6JkZ8abdHF9UkwVpdvENQ.jpg?auto=webp&s=127a5299ea092b1f3537bd9fad0157c9dd07e269",
    "comments": [
        "The article\nIn five days, in a move that will overhaul the country’s criminal laws, the Bharatiya Nyaya (Second) Sanhita, 2023 (the new IPC); the Bharatiya Nagarik Suraksha (Second) Sanhita, 2023 (the new CrPC); and the Bharatiya Sakshya (Second) Act, 2023 (the new Evidence Act), – are set to be operationalised.\n\nEven as states prepare for the implementation, organising training sessions for bureaucrats, judges and police personnel, a key concern remains: these laws are yet to be officially notified in regional languages.\n\nFrom Kerala, Karnataka and Tamil Nadu to Odisha and West Bengal, local translations will be crucial to ensure people can access this at the police station level, the trial courts and prisons.\n\nIt is learnt that the Centre had written to states in March, three months after the laws had been passed, to translate them to scheduled languages. The Hindi and English versions of the law received the President’s assent in December last year. Although criminal laws fall in the concurrent list, the three Sanhitas are a Central legislation.\n\nWhile the three Sanhitas will be effective July 1, according to notification in the official gazette, several states told The Indian Express that it will take over six months to finish translation of the laws.\n\nWhile a Law Ministry spokesperson did not respond to requests for comment, a senior Ministry official said that, usually, translations are done by the respective states and sent to the Centre for vetting. “If any changes are to be made, they are incorporated and sent by the Ministry for the President’s assent, following which it is sent back to the states for notification in their gazette,” the official said.\n\nJust having these laws in English and Hindi is not going to ensure effective access for the massive bureaucratic machinery in different parts of this country. For millions in this country, criminal law is wielded by that police constable on the street or the IO in the police station – it should be painfully obvious that thousands of such personnel are going to need these laws in their local languages as the first step towards understanding these laws.",
        "There is a constant running theme with all the reforms put up by the government; they tend to fall short in execution. Be it Labour codes, demonetisation,gst,farm laws and now this. It is due to many factors imo including not being able to build a consensus with stake holders, lack of coordination between state and central governments, not forming parliament committees for deliberations are some reasons among others.",
        "Honestly the whole thing with the law is idiotic. The changes they've made are so superficial that they could have just amended the existing literature.\n\nBut no. They wanted to bang a drum about how they're ending colonialism so they proceeded to rearrange shit. Problem is there are decades upon decades of legal precedent built on the order of the IPC and CrPC and CPC. Rearranging all the sections is going to create tons of work for courts to harmonize those precedents. They'll be even more clogged up for years.",
        "Agreed. Also it has some weird laws such as they have criminalised sex with the promise of marrying the women and not marrying thereafter. ig this is to counter the love jihad narrative they have set. It's 'criminal' to have such gendered laws. And why to  put terrorism under ordinary law when you already have uapa which is much more stringent. And obviously they have added draconian laws such as in fake news and they have widened the scope of sedition now :(",
        ">Agreed. Also it has some weird laws such as they have criminalised sex with the promise of marrying the women and not marrying thereafter. \n\nGotta blame the courts for that. They invented it. But yeah instead of striking it down the legislature doubled down on it. Buncha mouthbreathing morons the lot of them. That said, its regressive and so popular in India.\n\n>ig this is to counter the love jihad narrative they have set. It's 'criminal' to have such gendered laws. And why to  put terrorism under ordinary law when you already have uapa which is much more stringent. \n\nOh this is deliberate. The UAPA requires prosecution by the NIA. This lets them take two whacks at people. Fuck up the case or generally screw it up? Try again with a complaint under the regular criminal code. \n\n>And obviously they have added draconian laws such as in fake news and they have widened the scope of sedition now :(",
        "Well if a person isn't able to get convicted under uapa, will it be possible for them to charge him for the same  offences again? I guess that would be double jeopardy and would be in violation of art 20.",
        "They won't wait till someone is adjudged innocent. I'm talking about arresting the dude all over again if he manages to get bail after sitting in jail for half a decade. These people don't actually care about convicting anyone. The process is the punishment. India's conviction rates for corruption and terrorism are abysmal and nobody, neither courts nor lawyers nor the government is interested in fixing that.",
        "Still it will be violative of art 20(2) no. I am not a lawyer but it seems like that to me.\n(No person shall be *prosecuted* and punished for the same offence more than once.)",
        "You're allowed to tack on multiple criminal indictments for the same act though. And since now there are multiple laws governing the same act with differing penalties they get to tack those on if they want.\n\nIf you're found innocent or guilty they don't get to redo it with even more sections but Indian law routinely lets you hit someone with multiple indictments for a crime.",
        "But all these laws are applied at the same time na against an individual, my question is can you try an individual twice for the same offence? That would amount to double jeopardy I feel.",
        "I edited my comment to include a link that explains it better than I do. But you'd best hope it doesn't take the court a long time to figure it out since all the old precedents based on the old codes might need to be argued afresh",
        "Yeah got it now!",
        "> Even as states prepare for the implementation, organising training sessions for bureaucrats, judges and police personnel, a key concern remains: these laws are yet to be officially notified in regional languages.\n\nJustice delayed is justice denied."
    ],
    "cleaned_text": "new criminal code days go new codes official translations still pending states wait may take time said official written chief secretaries states facilitate translations laws even sent reminder last montha states sent translations evidence act ministry vetting however process may take six months complete states official added ",
    "cleaned_title": "new criminal code days go new codes official translations still pending states wait",
    "cleaned_selftext": "may take time said official written chief secretaries states facilitate translations laws even sent reminder last montha states sent translations evidence act ministry vetting however process may take six months complete states official added",
    "cleaned_comments": "article five days move overhaul countrys criminal laws bharatiya nyaya second sanhita new ipc bharatiya nagarik suraksha second sanhita new crpc bharatiya sakshya second act new evidence act set operationalised even states prepare implementation organising training sessions bureaucrats judges police personnel key concern remains laws yet officially notified regional languages kerala karnataka tamil nadu odisha west bengal local translations crucial ensure people access police station level trial courts prisons learnt centre written states march three months laws passed translate scheduled languages hindi english versions law received presidents assent december last year although criminal laws fall concurrent list three sanhitas central legislation three sanhitas effective july according notification official gazette several states told indian express take six months finish translation laws law ministry spokesperson respond requests comment senior ministry official said usually translations done respective states sent centre vetting changes made incorporated sent ministry presidents assent following sent back states notification gazette official said laws english hindi going ensure effective access massive bureaucratic machinery different parts country millions country criminal law wielded police constable street io police station painfully obvious thousands personnel going need laws local languages first step towards understanding laws constant running theme reforms put government tend fall short execution labour codes demonetisationgstfarm laws due many factors imo including able build consensus stake holders lack coordination state central governments forming parliament committees deliberations reasons among others honestly whole thing law idiotic changes theyve made superficial could amended existing literature wanted bang drum theyre ending colonialism proceeded rearrange shit problem decades upon decades legal precedent built order ipc crpc cpc rearranging sections going create tons work courts harmonize precedents theyll even clogged years agreed also weird laws criminalised sex promise marrying women marrying thereafter ig counter love jihad narrative set criminal gendered laws put terrorism ordinary law already uapa much stringent obviously added draconian laws fake news widened scope sedition agreed also weird laws criminalised sex promise marrying women marrying thereafter got ta blame courts invented yeah instead striking legislature doubled buncha mouthbreathing morons lot said regressive popular india ig counter love jihad narrative set criminal gendered laws put terrorism ordinary law already uapa much stringent oh deliberate uapa requires prosecution nia lets take two whacks people fuck case generally screw try complaint regular criminal code obviously added draconian laws fake news widened scope sedition well person isnt able get convicted uapa possible charge offences guess would double jeopardy would violation art wont wait till someone adjudged innocent im talking arresting dude manages get bail sitting jail half decade people dont actually care convicting anyone process punishment indias conviction rates corruption terrorism abysmal nobody neither courts lawyers government interested fixing still violative art lawyer seems like person shall prosecuted punished offence youre allowed tack multiple criminal indictments act though since multiple laws governing act differing penalties get tack want youre found innocent guilty dont get redo even sections indian law routinely lets hit someone multiple indictments crime laws applied time na individual question try individual twice offence would amount double jeopardy feel edited comment include link explains better youd best hope doesnt take court long time figure since old precedents based old codes might need argued afresh yeah got even states prepare implementation organising training sessions bureaucrats judges police personnel key concern remains laws yet officially notified regional languages justice delayed justice denied",
    "light_cleaned_title": "New criminal code: Days to go for new codes but official translations still pending, states wait",
    "light_cleaned_selftext": "This may take time, said the official: “We had written to Chief Secretaries of states to facilitate translations of the laws and even sent a reminder last month…A few states sent their translations of the evidence act to the Ministry for vetting. However, the process may take over six months to complete for all states,” the official added.",
    "light_cleaned_comments": "The article In five days, in a move that will overhaul the country’s criminal laws, the Bharatiya Nyaya (Second) Sanhita, 2023 (the new IPC); the Bharatiya Nagarik Suraksha (Second) Sanhita, 2023 (the new CrPC); and the Bharatiya Sakshya (Second) Act, 2023 (the new Evidence Act), – are set to be operationalised. Even as states prepare for the implementation, organising training sessions for bureaucrats, judges and police personnel, a key concern remains: these laws are yet to be officially notified in regional languages. From Kerala, Karnataka and Tamil Nadu to Odisha and West Bengal, local translations will be crucial to ensure people can access this at the police station level, the trial courts and prisons. It is learnt that the Centre had written to states in March, three months after the laws had been passed, to translate them to scheduled languages. The Hindi and English versions of the law received the President’s assent in December last year. Although criminal laws fall in the concurrent list, the three Sanhitas are a Central legislation. While the three Sanhitas will be effective July 1, according to notification in the official gazette, several states told The Indian Express that it will take over six months to finish translation of the laws. While a Law Ministry spokesperson did not respond to requests for comment, a senior Ministry official said that, usually, translations are done by the respective states and sent to the Centre for vetting. “If any changes are to be made, they are incorporated and sent by the Ministry for the President’s assent, following which it is sent back to the states for notification in their gazette,” the official said. Just having these laws in English and Hindi is not going to ensure effective access for the massive bureaucratic machinery in different parts of this country. For millions in this country, criminal law is wielded by that police constable on the street or the IO in the police station – it should be painfully obvious that thousands of such personnel are going to need these laws in their local languages as the first step towards understanding these laws. There is a constant running theme with all the reforms put up by the government; they tend to fall short in execution. Be it Labour codes, demonetisation,gst,farm laws and now this. It is due to many factors imo including not being able to build a consensus with stake holders, lack of coordination between state and central governments, not forming parliament committees for deliberations are some reasons among others. Honestly the whole thing with the law is idiotic. The changes they've made are so superficial that they could have just amended the existing literature. But no. They wanted to bang a drum about how they're ending colonialism so they proceeded to rearrange shit. Problem is there are decades upon decades of legal precedent built on the order of the IPC and CrPC and CPC. Rearranging all the sections is going to create tons of work for courts to harmonize those precedents. They'll be even more clogged up for years. Agreed. Also it has some weird laws such as they have criminalised sex with the promise of marrying the women and not marrying thereafter. ig this is to counter the love jihad narrative they have set. It's 'criminal' to have such gendered laws. And why to put terrorism under ordinary law when you already have uapa which is much more stringent. And obviously they have added draconian laws such as in fake news and they have widened the scope of sedition now :( >Agreed. Also it has some weird laws such as they have criminalised sex with the promise of marrying the women and not marrying thereafter. Gotta blame the courts for that. They invented it. But yeah instead of striking it down the legislature doubled down on it. Buncha mouthbreathing morons the lot of them. That said, its regressive and so popular in India. >ig this is to counter the love jihad narrative they have set. It's 'criminal' to have such gendered laws. And why to put terrorism under ordinary law when you already have uapa which is much more stringent. Oh this is deliberate. The UAPA requires prosecution by the NIA. This lets them take two whacks at people. Fuck up the case or generally screw it up? Try again with a complaint under the regular criminal code. >And obviously they have added draconian laws such as in fake news and they have widened the scope of sedition now :( Well if a person isn't able to get convicted under uapa, will it be possible for them to charge him for the same offences again? I guess that would be double jeopardy and would be in violation of art 20. They won't wait till someone is adjudged innocent. I'm talking about arresting the dude all over again if he manages to get bail after sitting in jail for half a decade. These people don't actually care about convicting anyone. The process is the punishment. India's conviction rates for corruption and terrorism are abysmal and nobody, neither courts nor lawyers nor the government is interested in fixing that. Still it will be violative of art 20(2) no. I am not a lawyer but it seems like that to me. (No person shall be *prosecuted* and punished for the same offence more than once.) You're allowed to tack on multiple criminal indictments for the same act though. And since now there are multiple laws governing the same act with differing penalties they get to tack those on if they want. If you're found innocent or guilty they don't get to redo it with even more sections but Indian law routinely lets you hit someone with multiple indictments for a crime. But all these laws are applied at the same time na against an individual, my question is can you try an individual twice for the same offence? That would amount to double jeopardy I feel. I edited my comment to include a link that explains it better than I do. But you'd best hope it doesn't take the court a long time to figure it out since all the old precedents based on the old codes might need to be argued afresh Yeah got it now! > Even as states prepare for the implementation, organising training sessions for bureaucrats, judges and police personnel, a key concern remains: these laws are yet to be officially notified in regional languages. Justice delayed is justice denied."
}