{
    "id": "1523xvu",
    "title": "Why do people hate us progressing so much? The entire comment section was just disturbing.",
    "url": "https://www.reddit.com/gallery/1523xvu",
    "selftext": "So many people hating, It just makes me sad.\nI know we have our problems but can't we just be happy be about this?I am glad some people other than fellow indians were defending this.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689605089.0,
    "convurl": "https://i.redd.it/xiilfbgdfjcb1.jpg",
    "comments": [
        "White supremacy never heard about that?",
        "It's not only white people, it's the Arabs, Africans, Hispanic and even nri indians!",
        "Jealousy. Nothing else.",
        "Western Media projects india like pre 2000's era still now they think most of us dont have toilets its ignorance just ignore those clowns",
        "Internet is a sh*t place. And it is one place you can get out your sh*t thoughts while being anonymous (when no one like the authorities are after you), as compared to the real world.",
        "Lol don't expect anything more from Instagram users tbh.\nYou will find people spewing the most racist, homophobic , misogyistic shit and getting thousands of likes. \n\nNo sane person has enough time to be bothered enough to say these things.",
        "Anyone can be racist",
        "I'm an NRI Indian.  \n\n\nMost people in the West are really really angry about Indian scam call centres. If the Indian government was smart they should go to any lengths to shut down these industries. They are really hurting India's image in the world.",
        "Racism",
        "why are they so obsessed with shit lolololol. i feel bad for these misinformed losers. White people are the worst of the lot, eating till their arteries are clogged, eating tide pods, doing menial jobs, killing each other, getting high on anything and everything and not even knowing what gender they are. fuckers.",
        "And that gives yall the right to shit talk your own country, cmon man no one like the call centres but that doesn't mean everytime there is some appreciation post about india you guys have to shittalk.",
        "Well most of them are ignorant racists, but we do have some problems that need immediate fixing.",
        "True, these same people will be made fun of if they said same things in real life.and I don't think we as Indians should be bothered by what these broke racist fucks are saying.",
        "Mostly non BJP ruled states where the local admin is getting a cut. As basic law enforcement is a state level activity , these chaps escape.",
        "Oh we definitely have shit tons of problems but that doesn't mean that our rare wins should be looked down upon.",
        "Absolutely true.",
        "What can men do against such reckless hate?",
        "That's the reality, they just hate indians because the sanitary system in india is not much developed in some parts. I feel like that's just a pathetic excuse to make themselves feel better and think that they are better than us, just because they shit in closed space and wipe their white asses with toilet paper. Feel sorry for them instead!🥱",
        "Found this on the same\n\nhttps://preview.redd.it/yvzbiva2pjcb1.png?width=640&format=png&auto=webp&s=287557e17cc2b7642cd74ab167eba305a56e2599",
        "It's the reputation we have created. Not everyone falls under that blanket perception,  but the vast majority of our countrymen have a lot to learn or rather change in our public & social behaviors (including online).\n\nWhile some comments may stem out of racist behavior, the reason their attention draws up to India (Indians) is also how we treat others & on the global stage.\n\nOur reputation & image needs a serious & urgent course correction, while our real-life issues will be addressed over the course of time",
        "You have to keep in mind that in order for them to maintain their deluded sense of \"superiority\" they need someone to feel superior *to*. When they see evidence that those they like to look down on aren't actually inferior at all, their poor brains can't handle it, and they resort to silly stereotyping and insults.\n\nAdditionally, you have to keep in mind that in the west a lot of the people who spend time online posting nonsense like this are the dregs of their societies. The marginalized, the socially ostracized, the lonely, the bitter, the unhappy. \n\nRise above it, and keep doing what you're doing.",
        "what the f\\*\\*\\*",
        "Yeah BJP is ruling West Bengal, isn't it?",
        "I wouldnt concern yourself with what Americans think.",
        "Insta should have an option to post images in comments.",
        "r/2westerneurope4u people made such disgusting comments too",
        "There are racists who are vomiting stereotypes, there are people who are telling to rather help the poor which I believe they also do when their government also does something like this. I have seen videos and articles on that.\n\nBut then there are shitfucks who say that we are doing this operation from their aid money.\nThose cunts will get a knuckle punch to the throat if I ever hear someone say that.",
        "Check the no of likes and the no of comments OP . The people who are not racist would rarely comment just have a like and move on.. You can't everyone to be not racist there will be atleast no of people who are racist and would remain so. Always the check the ratio of the comment to the post in these cases because people are majority non racist... You are overthinking like what I used to do by checking these comments in insta , it just shows you one reality ... So don't fall in this trap",
        "But those call centres are literally stealing millions of dollars from people in the west. It’s not just annoying, it’s fraud and theft on a huge scale.",
        "What do you suggest government to do.. plus you are really emphasing the really really... Part \n\nGive some solution too here what can be done",
        "People talk shit about US everyday, people talk shit about China everyday, people talk shit about UK everyday. Similarly people talk shit about India everyday, but the difference is I don’t see any of those countries being sensitive about it, there will be haters everywhere so who gives af. We do what’s best for us and move on.",
        "\"Sala jalta hai muhjse, Majnu!\"",
        "Also by checking the no of comments to likes this post is not that racist too ... I have fallen in this trap ... But most of the people just like and move on",
        "generally pak.i and chinese bots",
        "It's racism but which every country faces",
        "We know and it fucking sucks they target us indians too! Stop trying to defend racists",
        "Bro racist people would be everywhere do you think they are only hating exclusively indian",
        "This fr ^",
        "you would be surprised how most of this is only bcuz of indians who complain to whites for conditions in India like a toddler runs to their parents after being hit. No, seriously, the stereotyoe of India being the R\\* capital is only bcuz our people like to strip in front of others for a few upvotes. Add to that the fact that foreigners always somehow end up in poorest and dirtiest streets and slums only to complain about feeling unsafe/scammed or being a victim of a crime.",
        "People would be jealous everywhere. Even Indian incels comments on dumb things. Best is to ignore and continue doing great work at ISRO. Let these fkers burn",
        "why are you so obsessed with gender?",
        "Bro as much as I have nothing but contempt for these idiots spewing their hatred for India, most of us really don’t have toilets. I live in a tier 3 city, 15 km away from a state capital and I’m a hiker and cyclist. Open defecation is very, very rampant and I’ve stepped on fresh human poop on multiple occasions. \n\nEven in my city, streets near landmarks have very common open drain defecation throughout the day. It’s unbearable!",
        "Ain't no way you're trying to defend these people",
        "I'm not going to give attention to Instagram comments. \n\nBut, I do want to highlight why ISRO was started in the 60s in India. There was a greater cry of \"What about the poor?\" then. \n\nVikram Sarabhai answered it this way - it is an investment for the poor of this country. The tech that ISRO developed made sure that the country didn't rely on foreign relations for launching satellites. It ensured the ecosystem for the nascent missile program. It ensured a platform for countless scientific papers. \n\nAnd, most importantly, provided India with its own remote sensing capabilities. That helped India become self sufficient in agriculture. That's how we helped the poor.\n\nWhile I am not against subsidies (we must think of the now, as hunger and thirst comes in the present) but true development comes from foresight and strategic planning.",
        "Trying be Devils advocate here. Indian scammers specifically target senior citizen demographic because they are not well versed in technology. Imagine your grandparents getting scammed by people from a specific country (es), If it was me I would shit on these scammers every chance I get.\nThe western media continuously portarays poverty, castism, extreme inequality and downplay our positive sides. I have to make extra efforts with my western friends to make them believe that our middle class is decently rich and we have MacDonalds, movie theatres etc.\nAnd racism...",
        "Isme galat kya bola?",
        "India does have it's problems but let's not forget the pathetic condition of US and Europe during The Great Depression. They were so poor that they couldn't even afford a loaf of bread and yet they spent huge amounts of money on war and colonization.",
        "Karma. We treat our minorities the same",
        "Because there isn't any progression. All those \"progressive\" you think of only because the other part of the world did so and India follow by a bit.",
        "Its the same on reddit",
        "Takleef ho raha h baechaaro ko , bolne do",
        "It’s mostly from Pakistan and China with English fake accounts.",
        "1. Toilet - ek prem katha (Sanitation)\n2. Tech guys (Scammers)\n3. Bobs and vagene (Rape)",
        "Atleast I can control what I can consume to a lot of extent.",
        "Racist motherfuckers.",
        "What fuck is this ? Justifying racist behaviour just because its against Indians, I really wish psychos like you just get the fuck out of here.",
        "As bad it may be now, Indians are in no way saints. our people are so vulgur in online communities, ie a foreign girl posted couple days ago wht Indians were so crude and horny while she was in english learning interactive platform. many living in tht country are miserable and we expect outside world to respect is. yesterday an old man was peeing on a govt school compound, not hidden or anything but near the main gate .",
        "Empty cans make the most noise.",
        "I don't think he is defending these guys specifically. But he does have a point regarding how Indians behave on the internet. Cheap internet has given voices to the dumbest people.and we don't want them to represent our country",
        "Who shits on NASA? Whenever NASA launches a rocket most people praise it, no one trolls like this. \n\nHowever I agree with your points, we should stop being bothered by such people...",
        "As well as on Twitter too",
        "Because it isn't progress, just like Pakistan having nukes, and having more nukes than India or Israel isn't progress for Pak. \n\nClean water, clean air, human rights, (lack of) police brutality, womens rights, minority rights, decent healthcare, sewage and trash management, press freedom, low corruption, upholding laws, civic sense etc etc is progress.  \n\nHow are we \"progressing\" on any of these?",
        "Face it, what they are saying is not wrong. We have to improve in  those sectors too.",
        "Say the people who have to pay for calling an ambulance at an accident, come to India for medical tourism, steal from freight trains in San Francisco, has one of the most famous slums (Skid Row), hundreds of innocent children and teachers are killed in schools each month, has one of the highest obesity rates in the world and more importantly highest cases of racism and Nazi ideology. Yeah ok 👍",
        "Fair enough. But if you wander off to some popular subs like someone posted the lmv3 launch video on damnthatsinteresting and it was filled with racist comments right off the bat.",
        "So much negatively, but we have to agree that we as society and our government failed to provide the basic services to majority of the population. May it be sanitisation, clean drinking water, education, health care etc. Can't turn a blind eye.",
        "These the same people who fail at basic maths?   \nOr are they the ones who r gays/trans/airplanes?   \nOr the country where no one is a virgin from the age of 12?  \nOr the country whose 8 year old kids deal drugs?  \nOr the country that hands out guns to everyone and their moms?",
        "its straight jealousy and dumb people believing on stereotypes.",
        "You would be surprised at people who asks for further budget cuts for NASA because they believe there are bigger priorities like healthcare, social security etc though NASA budget is minuscule. \n\nNot everyone thinks space tech and research is important unfortunately",
        "Read my comment again, slowly",
        "Blame it on the politicians not isro, they only get a small percent of the annual budget but still show results.",
        "every race was hating on it.",
        "There are two ways for a country to become rich. 1. To invade and steal the land, resources everything or 2. To work hard and grow.\n\nThe ones commenting are decendents of thieves who stole our wealth. Ignore them we will reply woth our work instead of words.",
        "yes, because being able to afford the pre-jio internet correlates with virtue indeed",
        "Ofcourse sir, that's why I mentioned government. ISRO deserve every ounce of our respect & support.",
        "Relax OP, just relax. It's only a matter of time. There is gonna be like 700 to a billion Indians online in the coming years and a lot of them are gonna be speaking English. We'll get them before they go extinct.",
        "No body shots on anyone for scientific advancement. People shit on USA for bombing other countries",
        "Not to blame the victim but these are the one's getting frauded by us,so jokes on them.",
        "Nobody wants the poorer side of the town rise up economically. Especially not at a time when west is in a recession.",
        "For a time. Many people even then saw it as a waste. \"We could feed...\"\n\"We could house...\"\nAlot of these arguments were levied at them.",
        "The typical whataboutery! SM it is..so anyone and their cousin can go shit their verbal diarrhea there and leave.",
        "Vikram Sarabhai gave that statement in the 60s. 60 years have passed. I see so much improvement for our poor. Great going. I see so much of “true development” for the poor from the foresight and strategic planning from 60 years ago.",
        "Fr, foreign tourists in in India go to ghettos then complain about mugging or poverty.",
        "Nah I don't want the dumb right winger uncles and aunties to find instagram, let them stay on facebook and twitter bruh",
        "Lol I never said people who had access to internet before jio are saints. But then again making it accessible will result in more dumb people on the internet than before.",
        "I saw a meme regarding this that this is india ( slums ) and this is not india ( high rise building ) haha",
        "Ignore them. Both Soviet and American space advancement was mostly due to rivalry. Even today NASA suffers from funding shortage and used Russian spacecraft to send their astronauts to ISS. It took a private player to put an end to it. \nIndia on other hand did it purely for scientific purpose and accomplished what we needed. \n\nJust look at it this way. If we used all the money spent on space, military and technology, then our people would be well fed but we would be also be flying American,russian or chinese flag. How can we fill our stomachs knowing we are so behind others that many nations could cripple us anytime? We would be colonized again.",
        "Do people go to hoods and their immigrant labour ghettos when touring in west? no right? that's bcuz everyone goes there to enjoy and have a beautiful and safe place to be in. but these guys.. OMG",
        "Are they wrong tho?",
        "This was what I was going to say. And TBH, some or the criticisms are mean but legit.  The U.S. lets tons of homeless elders die in the streets but there's still plenty of money to give trillion dollar corporations extra tax cuts.  You see no shortage of criticisms like this on the internet, man you them from U.S. citizens themselves.",
        "Criticisms are part of any democratic society, which is why I find it a bit annoying that as soon as there is a criticism aimed at us we think it’s some grand Western conspiracy. For the most part, no one in West really cares about India (don’t know if it’s good or bad) and most people say only good things about it. \n\nThere are always some racists and some haters, but the vast majority like the country and its cultures. We should stop amplifying the voices of these minority of trolls and try to victimize ourselves, we need to be more mature.",
        "Your interpretation skills are rather poor. Maybe you should attend some workshops before opening that filthy mouth.\n\nJustifying racist behavior? Seriously? Is that the best you can read out if it?",
        "Ignore the hate or let their hate fuel you to do better. But never let it get to you.\nJAI HIND",
        "Some youtuber in America was able to shut down a lot of scam call centres right?\n\nIf a youtuber can do it I have no doubt an India which launches rockets to the moon can also do it.",
        "It's too late already",
        "two wrongs don't make a right",
        "If you see \"Skid row\" in Los Angeles is pathetic and full of street shitters and druggies. 😒 Imagine if Indians make it a tourist spot and a spectacle. 😂"
    ],
    "cleaned_text": "people hate us progressing much entire comment section disturbing many people hating makes sad know problems cant happy thisi glad people fellow indians defending ",
    "cleaned_title": "people hate us progressing much entire comment section disturbing",
    "cleaned_selftext": "many people hating makes sad know problems cant happy thisi glad people fellow indians defending",
    "cleaned_comments": "white supremacy never heard white people arabs africans hispanic even nri indians jealousy nothing else western media projects india like pre era still think us dont toilets ignorance ignore clowns internet sht place one place get sht thoughts anonymous one like authorities compared real world lol dont expect anything instagram users tbh find people spewing racist homophobic misogyistic shit getting thousands likes sane person enough time bothered enough say things anyone racist im nri indian people west really really angry indian scam call centres indian government smart go lengths shut industries really hurting indias image world racism obsessed shit lolololol feel bad misinformed losers white people worst lot eating till arteries clogged eating tide pods menial jobs killing getting high anything everything even knowing gender fuckers gives yall right shit talk country cmon man one like call centres doesnt mean everytime appreciation post india guys shittalk well ignorant racists problems need immediate fixing true people made fun said things real lifeand dont think indians bothered broke racist fucks saying mostly non bjp ruled states local admin getting cut basic law enforcement state level activity chaps escape oh definitely shit tons problems doesnt mean rare wins looked upon absolutely true men reckless hate thats reality hate indians sanitary system india much developed parts feel like thats pathetic excuse make feel better think better us shit closed space wipe white asses toilet paper feel sorry instead found reputation created everyone falls blanket perception vast majority countrymen lot learn rather change public social behaviors including online comments may stem racist behavior reason attention draws india indians also treat others global stage reputation image needs serious urgent course correction reallife issues addressed course time keep mind order maintain deluded sense superiority need someone feel superior see evidence like look arent actually inferior poor brains cant handle resort silly stereotyping insults additionally keep mind west lot people spend time online posting nonsense like dregs societies marginalized socially ostracized lonely bitter unhappy rise keep youre f yeah bjp ruling west bengal isnt wouldnt concern americans think insta option post images comments rwesterneuropeu people made disgusting comments racists vomiting stereotypes people telling rather help poor believe also government also something like seen videos articles shitfucks say operation aid money cunts get knuckle punch throat ever hear someone say check likes comments op people racist would rarely comment like move cant everyone racist atleast people racist would remain always check ratio comment post cases people majority non racist overthinking like used checking comments insta shows one reality dont fall trap call centres literally stealing millions dollars people west annoying fraud theft huge scale suggest government plus really emphasing really really part give solution done people talk shit us everyday people talk shit china everyday people talk shit uk everyday similarly people talk shit india everyday difference dont see countries sensitive haters everywhere gives af whats best us move sala jalta hai muhjse majnu also checking comments likes post racist fallen trap people like move generally paki chinese bots racism every country faces know fucking sucks target us indians stop trying defend racists bro racist people would everywhere think hating exclusively indian fr would surprised bcuz indians complain whites conditions india like toddler runs parents hit seriously stereotyoe india r capital bcuz people like strip front others upvotes add fact foreigners always somehow end poorest dirtiest streets slums complain feeling unsafescammed victim crime people would jealous everywhere even indian incels comments dumb things best ignore continue great work isro let fkers burn obsessed gender bro much nothing contempt idiots spewing hatred india us really dont toilets live tier city km away state capital im hiker cyclist open defecation rampant ive stepped fresh human poop multiple occasions even city streets near landmarks common open drain defecation throughout day unbearable aint way youre trying defend people im going give attention instagram comments want highlight isro started india greater cry poor vikram sarabhai answered way investment poor country tech isro developed made sure country didnt rely foreign relations launching satellites ensured ecosystem nascent missile program ensured platform countless scientific papers importantly provided india remote sensing capabilities helped india become self sufficient agriculture thats helped poor subsidies must think hunger thirst comes present true development comes foresight strategic planning trying devils advocate indian scammers specifically target senior citizen demographic well versed technology imagine grandparents getting scammed people specific country es would shit scammers every chance get western media continuously portarays poverty castism extreme inequality downplay positive sides make extra efforts western friends make believe middle class decently rich macdonalds movie theatres etc racism isme galat kya bola india problems lets forget pathetic condition us europe great depression poor couldnt even afford loaf bread yet spent huge amounts money war colonization karma treat minorities isnt progression progressive think part world india follow bit reddit takleef ho raha h baechaaro ko bolne mostly pakistan china english fake accounts toilet ek prem katha sanitation tech guys scammers bobs vagene rape atleast control consume lot extent racist motherfuckers fuck justifying racist behaviour indians really wish psychos like get fuck bad may indians way saints people vulgur online communities ie foreign girl posted couple days ago wht indians crude horny english learning interactive platform many living tht country miserable expect outside world respect yesterday old man peeing govt school compound hidden anything near main gate empty cans make noise dont think defending guys specifically point regarding indians behave internet cheap internet given voices dumbest peopleand dont want represent country shits nasa whenever nasa launches rocket people praise one trolls like however agree points stop bothered people well twitter isnt progress like pakistan nukes nukes india israel isnt progress pak clean water clean air human rights lack police brutality womens rights minority rights decent healthcare sewage trash management press freedom low corruption upholding laws civic sense etc etc progress progressing face saying wrong improve sectors say people pay calling ambulance accident come india medical tourism steal freight trains san francisco one famous slums skid row hundreds innocent children teachers killed schools month one highest obesity rates world importantly highest cases racism nazi ideology yeah ok fair enough wander popular subs like someone posted lmv launch video damnthatsinteresting filled racist comments right bat much negatively agree society government failed provide basic services majority population may sanitisation clean drinking water education health care etc cant turn blind eye people fail basic maths ones r gaystransairplanes country one virgin age country whose year old kids deal drugs country hands guns everyone moms straight jealousy dumb people believing stereotypes would surprised people asks budget cuts nasa believe bigger priorities like healthcare social security etc though nasa budget minuscule everyone thinks space tech research important unfortunately read comment slowly blame politicians isro get small percent annual budget still show results every race hating two ways country become rich invade steal land resources everything work hard grow ones commenting decendents thieves stole wealth ignore reply woth work instead words yes able afford prejio internet correlates virtue indeed ofcourse sir thats mentioned government isro deserve every ounce respect support relax op relax matter time gon na like billion indians online coming years lot gon na speaking english well get go extinct body shots anyone scientific advancement people shit usa bombing countries blame victim ones getting frauded usso jokes nobody wants poorer side town rise economically especially time west recession time many people even saw waste could feed could house alot arguments levied typical whataboutery sm isso anyone cousin go shit verbal diarrhea leave vikram sarabhai gave statement years passed see much improvement poor great going see much true development poor foresight strategic planning years ago fr foreign tourists india go ghettos complain mugging poverty nah dont want dumb right winger uncles aunties find instagram let stay facebook twitter bruh lol never said people access internet jio saints making accessible result dumb people internet saw meme regarding india slums india high rise building haha ignore soviet american space advancement mostly due rivalry even today nasa suffers funding shortage used russian spacecraft send astronauts iss took private player put end india hand purely scientific purpose accomplished needed look way used money spent space military technology people would well fed would also flying americanrussian chinese flag fill stomachs knowing behind others many nations could cripple us anytime would colonized people go hoods immigrant labour ghettos touring west right thats bcuz everyone goes enjoy beautiful safe place guys omg wrong tho going say tbh criticisms mean legit us lets tons homeless elders die streets theres still plenty money give trillion dollar corporations extra tax cuts see shortage criticisms like internet man us citizens criticisms part democratic society find bit annoying soon criticism aimed us think grand western conspiracy part one west really cares india dont know good bad people say good things always racists haters vast majority like country cultures stop amplifying voices minority trolls try victimize need mature interpretation skills rather poor maybe attend workshops opening filthy mouth justifying racist behavior seriously best read ignore hate let hate fuel better never let get jai hind youtuber america able shut lot scam call centres right youtuber doubt india launches rockets moon also late already two wrongs dont make right see skid row los angeles pathetic full street shitters druggies imagine indians make tourist spot spectacle",
    "light_cleaned_title": "Why do people hate us progressing so much? The entire comment section was just disturbing.",
    "light_cleaned_selftext": "So many people hating, It just makes me sad. I know we have our problems but can't we just be happy be about this?I am glad some people other than fellow indians were defending this.",
    "light_cleaned_comments": "White supremacy never heard about that? It's not only white people, it's the Arabs, Africans, Hispanic and even nri indians! Jealousy. Nothing else. Western Media projects india like pre 2000's era still now they think most of us dont have toilets its ignorance just ignore those clowns Internet is a sh*t place. And it is one place you can get out your sh*t thoughts while being anonymous (when no one like the authorities are after you), as compared to the real world. Lol don't expect anything more from Instagram users tbh. You will find people spewing the most racist, homophobic , misogyistic shit and getting thousands of likes. No sane person has enough time to be bothered enough to say these things. Anyone can be racist I'm an NRI Indian. Most people in the West are really really angry about Indian scam call centres. If the Indian government was smart they should go to any lengths to shut down these industries. They are really hurting India's image in the world. Racism why are they so obsessed with shit lolololol. i feel bad for these misinformed losers. White people are the worst of the lot, eating till their arteries are clogged, eating tide pods, doing menial jobs, killing each other, getting high on anything and everything and not even knowing what gender they are. fuckers. And that gives yall the right to shit talk your own country, cmon man no one like the call centres but that doesn't mean everytime there is some appreciation post about india you guys have to shittalk. Well most of them are ignorant racists, but we do have some problems that need immediate fixing. True, these same people will be made fun of if they said same things in real life.and I don't think we as Indians should be bothered by what these broke racist fucks are saying. Mostly non BJP ruled states where the local admin is getting a cut. As basic law enforcement is a state level activity , these chaps escape. Oh we definitely have shit tons of problems but that doesn't mean that our rare wins should be looked down upon. Absolutely true. What can men do against such reckless hate? That's the reality, they just hate indians because the sanitary system in india is not much developed in some parts. I feel like that's just a pathetic excuse to make themselves feel better and think that they are better than us, just because they shit in closed space and wipe their white asses with toilet paper. Feel sorry for them instead!🥱 Found this on the same It's the reputation we have created. Not everyone falls under that blanket perception, but the vast majority of our countrymen have a lot to learn or rather change in our public & social behaviors (including online). While some comments may stem out of racist behavior, the reason their attention draws up to India (Indians) is also how we treat others & on the global stage. Our reputation & image needs a serious & urgent course correction, while our real-life issues will be addressed over the course of time You have to keep in mind that in order for them to maintain their deluded sense of \"superiority\" they need someone to feel superior *to*. When they see evidence that those they like to look down on aren't actually inferior at all, their poor brains can't handle it, and they resort to silly stereotyping and insults. Additionally, you have to keep in mind that in the west a lot of the people who spend time online posting nonsense like this are the dregs of their societies. The marginalized, the socially ostracized, the lonely, the bitter, the unhappy. Rise above it, and keep doing what you're doing. what the f\\*\\*\\* Yeah BJP is ruling West Bengal, isn't it? I wouldnt concern yourself with what Americans think. Insta should have an option to post images in comments. r/2westerneurope4u people made such disgusting comments too There are racists who are vomiting stereotypes, there are people who are telling to rather help the poor which I believe they also do when their government also does something like this. I have seen videos and articles on that. But then there are shitfucks who say that we are doing this operation from their aid money. Those cunts will get a knuckle punch to the throat if I ever hear someone say that. Check the no of likes and the no of comments OP . The people who are not racist would rarely comment just have a like and move on.. You can't everyone to be not racist there will be atleast no of people who are racist and would remain so. Always the check the ratio of the comment to the post in these cases because people are majority non racist... You are overthinking like what I used to do by checking these comments in insta , it just shows you one reality ... So don't fall in this trap But those call centres are literally stealing millions of dollars from people in the west. It’s not just annoying, it’s fraud and theft on a huge scale. What do you suggest government to do.. plus you are really emphasing the really really... Part Give some solution too here what can be done People talk shit about US everyday, people talk shit about China everyday, people talk shit about UK everyday. Similarly people talk shit about India everyday, but the difference is I don’t see any of those countries being sensitive about it, there will be haters everywhere so who gives af. We do what’s best for us and move on. \"Sala jalta hai muhjse, Majnu!\" Also by checking the no of comments to likes this post is not that racist too ... I have fallen in this trap ... But most of the people just like and move on generally pak.i and chinese bots It's racism but which every country faces We know and it fucking sucks they target us indians too! Stop trying to defend racists Bro racist people would be everywhere do you think they are only hating exclusively indian This fr ^ you would be surprised how most of this is only bcuz of indians who complain to whites for conditions in India like a toddler runs to their parents after being hit. No, seriously, the stereotyoe of India being the R\\* capital is only bcuz our people like to strip in front of others for a few upvotes. Add to that the fact that foreigners always somehow end up in poorest and dirtiest streets and slums only to complain about feeling unsafe/scammed or being a victim of a crime. People would be jealous everywhere. Even Indian incels comments on dumb things. Best is to ignore and continue doing great work at ISRO. Let these fkers burn why are you so obsessed with gender? Bro as much as I have nothing but contempt for these idiots spewing their hatred for India, most of us really don’t have toilets. I live in a tier 3 city, 15 km away from a state capital and I’m a hiker and cyclist. Open defecation is very, very rampant and I’ve stepped on fresh human poop on multiple occasions. Even in my city, streets near landmarks have very common open drain defecation throughout the day. It’s unbearable! Ain't no way you're trying to defend these people I'm not going to give attention to Instagram comments. But, I do want to highlight why ISRO was started in the 60s in India. There was a greater cry of \"What about the poor?\" then. Vikram Sarabhai answered it this way - it is an investment for the poor of this country. The tech that ISRO developed made sure that the country didn't rely on foreign relations for launching satellites. It ensured the ecosystem for the nascent missile program. It ensured a platform for countless scientific papers. And, most importantly, provided India with its own remote sensing capabilities. That helped India become self sufficient in agriculture. That's how we helped the poor. While I am not against subsidies (we must think of the now, as hunger and thirst comes in the present) but true development comes from foresight and strategic planning. Trying be Devils advocate here. Indian scammers specifically target senior citizen demographic because they are not well versed in technology. Imagine your grandparents getting scammed by people from a specific country (es), If it was me I would shit on these scammers every chance I get. The western media continuously portarays poverty, castism, extreme inequality and downplay our positive sides. I have to make extra efforts with my western friends to make them believe that our middle class is decently rich and we have MacDonalds, movie theatres etc. And racism... Isme galat kya bola? India does have it's problems but let's not forget the pathetic condition of US and Europe during The Great Depression. They were so poor that they couldn't even afford a loaf of bread and yet they spent huge amounts of money on war and colonization. Karma. We treat our minorities the same Because there isn't any progression. All those \"progressive\" you think of only because the other part of the world did so and India follow by a bit. Its the same on reddit Takleef ho raha h baechaaro ko , bolne do It’s mostly from Pakistan and China with English fake accounts. 1. Toilet - ek prem katha (Sanitation) 2. Tech guys (Scammers) 3. Bobs and vagene (Rape) Atleast I can control what I can consume to a lot of extent. Racist motherfuckers. What fuck is this ? Justifying racist behaviour just because its against Indians, I really wish psychos like you just get the fuck out of here. As bad it may be now, Indians are in no way saints. our people are so vulgur in online communities, ie a foreign girl posted couple days ago wht Indians were so crude and horny while she was in english learning interactive platform. many living in tht country are miserable and we expect outside world to respect is. yesterday an old man was peeing on a govt school compound, not hidden or anything but near the main gate . Empty cans make the most noise. I don't think he is defending these guys specifically. But he does have a point regarding how Indians behave on the internet. Cheap internet has given voices to the dumbest people.and we don't want them to represent our country Who shits on NASA? Whenever NASA launches a rocket most people praise it, no one trolls like this. However I agree with your points, we should stop being bothered by such people... As well as on Twitter too Because it isn't progress, just like Pakistan having nukes, and having more nukes than India or Israel isn't progress for Pak. Clean water, clean air, human rights, (lack of) police brutality, womens rights, minority rights, decent healthcare, sewage and trash management, press freedom, low corruption, upholding laws, civic sense etc etc is progress. How are we \"progressing\" on any of these? Face it, what they are saying is not wrong. We have to improve in those sectors too. Say the people who have to pay for calling an ambulance at an accident, come to India for medical tourism, steal from freight trains in San Francisco, has one of the most famous slums (Skid Row), hundreds of innocent children and teachers are killed in schools each month, has one of the highest obesity rates in the world and more importantly highest cases of racism and Nazi ideology. Yeah ok 👍 Fair enough. But if you wander off to some popular subs like someone posted the lmv3 launch video on damnthatsinteresting and it was filled with racist comments right off the bat. So much negatively, but we have to agree that we as society and our government failed to provide the basic services to majority of the population. May it be sanitisation, clean drinking water, education, health care etc. Can't turn a blind eye. These the same people who fail at basic maths? Or are they the ones who r gays/trans/airplanes? Or the country where no one is a virgin from the age of 12? Or the country whose 8 year old kids deal drugs? Or the country that hands out guns to everyone and their moms? its straight jealousy and dumb people believing on stereotypes. You would be surprised at people who asks for further budget cuts for NASA because they believe there are bigger priorities like healthcare, social security etc though NASA budget is minuscule. Not everyone thinks space tech and research is important unfortunately Read my comment again, slowly Blame it on the politicians not isro, they only get a small percent of the annual budget but still show results. every race was hating on it. There are two ways for a country to become rich. 1. To invade and steal the land, resources everything or 2. To work hard and grow. The ones commenting are decendents of thieves who stole our wealth. Ignore them we will reply woth our work instead of words. yes, because being able to afford the pre-jio internet correlates with virtue indeed Ofcourse sir, that's why I mentioned government. ISRO deserve every ounce of our respect & support. Relax OP, just relax. It's only a matter of time. There is gonna be like 700 to a billion Indians online in the coming years and a lot of them are gonna be speaking English. We'll get them before they go extinct. No body shots on anyone for scientific advancement. People shit on USA for bombing other countries Not to blame the victim but these are the one's getting frauded by us,so jokes on them. Nobody wants the poorer side of the town rise up economically. Especially not at a time when west is in a recession. For a time. Many people even then saw it as a waste. \"We could feed...\" \"We could house...\" Alot of these arguments were levied at them. The typical whataboutery! SM it is..so anyone and their cousin can go shit their verbal diarrhea there and leave. Vikram Sarabhai gave that statement in the 60s. 60 years have passed. I see so much improvement for our poor. Great going. I see so much of “true development” for the poor from the foresight and strategic planning from 60 years ago. Fr, foreign tourists in in India go to ghettos then complain about mugging or poverty. Nah I don't want the dumb right winger uncles and aunties to find instagram, let them stay on facebook and twitter bruh Lol I never said people who had access to internet before jio are saints. But then again making it accessible will result in more dumb people on the internet than before. I saw a meme regarding this that this is india ( slums ) and this is not india ( high rise building ) haha Ignore them. Both Soviet and American space advancement was mostly due to rivalry. Even today NASA suffers from funding shortage and used Russian spacecraft to send their astronauts to ISS. It took a private player to put an end to it. India on other hand did it purely for scientific purpose and accomplished what we needed. Just look at it this way. If we used all the money spent on space, military and technology, then our people would be well fed but we would be also be flying American,russian or chinese flag. How can we fill our stomachs knowing we are so behind others that many nations could cripple us anytime? We would be colonized again. Do people go to hoods and their immigrant labour ghettos when touring in west? no right? that's bcuz everyone goes there to enjoy and have a beautiful and safe place to be in. but these guys.. OMG Are they wrong tho? This was what I was going to say. And TBH, some or the criticisms are mean but legit. The U.S. lets tons of homeless elders die in the streets but there's still plenty of money to give trillion dollar corporations extra tax cuts. You see no shortage of criticisms like this on the internet, man you them from U.S. citizens themselves. Criticisms are part of any democratic society, which is why I find it a bit annoying that as soon as there is a criticism aimed at us we think it’s some grand Western conspiracy. For the most part, no one in West really cares about India (don’t know if it’s good or bad) and most people say only good things about it. There are always some racists and some haters, but the vast majority like the country and its cultures. We should stop amplifying the voices of these minority of trolls and try to victimize ourselves, we need to be more mature. Your interpretation skills are rather poor. Maybe you should attend some workshops before opening that filthy mouth. Justifying racist behavior? Seriously? Is that the best you can read out if it? Ignore the hate or let their hate fuel you to do better. But never let it get to you. JAI HIND Some youtuber in America was able to shut down a lot of scam call centres right? If a youtuber can do it I have no doubt an India which launches rockets to the moon can also do it. It's too late already two wrongs don't make a right If you see \"Skid row\" in Los Angeles is pathetic and full of street shitters and druggies. 😒 Imagine if Indians make it a tourist spot and a spectacle. 😂"
}