{
    "id": "14b0sas",
    "title": "Total failure of law and order, says Union Minister as his home is burnt in Manipur",
    "url": "https://indianexpress.com/article/india/failure-law-order-union-minister-r-k-ranjan-home-burnt-manipur-8667445/",
    "selftext": "These Ministers only worry about law and order when it affects them personally.",
    "flair": "Politics",
    "score": 221,
    "num_comments": 22,
    "created_utc": 1686931682.0,
    "convurl": "https://external-preview.redd.it/r-sQ-6hppMw_nnZIY4CFRTlMYtbGPq0aLyOvRe-jBQA.jpg?auto=webp&v=enabled&s=5a8e8a69d114725cccfdf32e2b485f0113b46b67",
    "comments": [
        "Are wah! Badi jaldi pata chal gaya 👌",
        "Acha matlab dange mein aam aadmi mare or uska nuksaan ho , toh 'total failure' nahi hota h kya?",
        "*you asked for a gujrat model*",
        "You sown the winds, now you shall reap the whirlwinds - bomber Harris",
        "As per Mahabharata, in the Ashwamedha yagna, the horse of Yudhishthira was held by a Manipuri boy who defeated Arjun. (The boy was  actually son of Arjun).\n\nThe unstoppable force of 2014 may not be turned out to be unstoppable in 2024.",
        "So now it’s total failure? Not when a kid was burnt in ambulance?",
        "Abhi samajh mein aa raha tujhe Fatherchod!!",
        "Looks like the only way to get ministers to acknowledge the truth is when shit happens to them personally. This is what happened in SL and Pakistan. When ministers' homes started going up in flames, \"oh there is a problem!\"",
        "Law and order only fails when ministers home are burnt.",
        "Aur karo vote double engine sarkar.",
        "Oh, now it has failed. Right.",
        "Proves the capabilities of our home minister!!",
        "What do you think will make BJP lose in 2024? What has happened that will cause their core supporters to not vote for them?\n\nI can understand if they slowly lose supporter base over next 10-20 years, or if their voter base decreases significantly post Modi(Bisht and Shah might not garner same support). They might lose manipur election at most.",
        "Double engine (BJP) failure!",
        "Jab khud ka Ghar jalta hai tab law and order yaad aata hai inko....\n\nHe should have raised this a month ago..",
        "I just hope his words don’t turn out to be true for the rest of the country",
        "Jokes apart. Abhi bhi kch kar re h vaha peace lane ke liye or the violence is the same as it was?"
    ],
    "cleaned_text": "total failure law order says union minister home burnt manipur ministers worry law order affects personally ",
    "cleaned_title": "total failure law order says union minister home burnt manipur",
    "cleaned_selftext": "ministers worry law order affects personally",
    "cleaned_comments": "wah badi jaldi pata chal gaya acha matlab dange mein aam aadmi mare uska nuksaan ho toh total failure nahi hota h kya asked gujrat model sown winds shall reap whirlwinds bomber harris per mahabharata ashwamedha yagna horse yudhishthira held manipuri boy defeated arjun boy actually son arjun unstoppable force may turned unstoppable total failure kid burnt ambulance abhi samajh mein aa raha tujhe fatherchod looks like way get ministers acknowledge truth shit happens personally happened sl pakistan ministers homes started going flames oh problem law order fails ministers home burnt aur karo vote double engine sarkar oh failed right proves capabilities home minister think make bjp lose happened cause core supporters vote understand slowly lose supporter base next years voter base decreases significantly post modibisht shah might garner support might lose manipur election double engine bjp failure jab khud ka ghar jalta hai tab law order yaad aata hai inko raised month ago hope words dont turn true rest country jokes apart abhi bhi kch kar h vaha peace lane ke liye violence",
    "light_cleaned_title": "Total failure of law and order, says Union Minister as his home is burnt in Manipur",
    "light_cleaned_selftext": "These Ministers only worry about law and order when it affects them personally.",
    "light_cleaned_comments": "Are wah! Badi jaldi pata chal gaya 👌 Acha matlab dange mein aam aadmi mare or uska nuksaan ho , toh 'total failure' nahi hota h kya? *you asked for a gujrat model* You sown the winds, now you shall reap the whirlwinds - bomber Harris As per Mahabharata, in the Ashwamedha yagna, the horse of Yudhishthira was held by a Manipuri boy who defeated Arjun. (The boy was actually son of Arjun). The unstoppable force of 2014 may not be turned out to be unstoppable in 2024. So now it’s total failure? Not when a kid was burnt in ambulance? Abhi samajh mein aa raha tujhe Fatherchod!! Looks like the only way to get ministers to acknowledge the truth is when shit happens to them personally. This is what happened in SL and Pakistan. When ministers' homes started going up in flames, \"oh there is a problem!\" Law and order only fails when ministers home are burnt. Aur karo vote double engine sarkar. Oh, now it has failed. Right. Proves the capabilities of our home minister!! What do you think will make BJP lose in 2024? What has happened that will cause their core supporters to not vote for them? I can understand if they slowly lose supporter base over next 10-20 years, or if their voter base decreases significantly post Modi(Bisht and Shah might not garner same support). They might lose manipur election at most. Double engine (BJP) failure! Jab khud ka Ghar jalta hai tab law and order yaad aata hai inko.... He should have raised this a month ago.. I just hope his words don’t turn out to be true for the rest of the country Jokes apart. Abhi bhi kch kar re h vaha peace lane ke liye or the violence is the same as it was?"
}