{
    "id": "1bg4uks",
    "title": "India's New EV Policy Makes Importing Electric Cars More Affordable!",
    "url": "https://www.reddit.com/r/india/comments/1bg4uks/indias_new_ev_policy_makes_importing_electric/",
    "selftext": "The Ministry of Heavy Industries (MHI) in India has introduced a new electric vehicle (EV) policy that's making waves globally. It's designed to lure top EV makers like Tesla and BYD to India. \n\n&#x200B;\n\nThe aim? To boost the country's EV manufacturing and make it a hub for technological innovation.\n\nOne of the key features is the slashing of import duties. Currently, importing an EV can attract taxes of 70% or even 100%. But with the new policy, for EVs valued over $35,000, this drops to 15% for five years. This move could make a wider array of EVs available in India, potentially at lower prices.\n\nBut there's more. To ensure that India benefits fully, the policy insists that a significant part of the EV components be made locally. This is great for building a strong, local EV ecosystem and could transform India's manufacturing scene.\n\nFor companies to grab this golden opportunity, they need to invest big - at least $500 million. Plus, they've got to get their manufacturing plants up and running within three years. It's a clear signal to both global and Indian companies: invest in the Indian EV market, and let's grow together.\n\nHowever, there's a catch for companies from certain countries, like China. They'll need extra permissions because of tweaks in the Foreign Direct Investment (FDI) policy. It's all about keeping the investment clean and in line with national interests.\n\nTo ensure companies are serious, they'll need to provide a bank guarantee. It's like a promise that they'll meet their investment and manufacturing targets. If they do, the guarantee is returned. This smart move minimizes risks linked to the policy's perks.\n\nLastly, the government's got a structured way for companies to apply for these benefits. There's a set timeframe to submit applications, giving the ministry the flexibility to manage the process smoothly over the first two years.\n\nWith the automotive sector's market size in India projected to surpass Rs 24.9 lakh crore by 2030, this policy represents a strategic effort by the Indian government to drive sustainable growth, technological innovation, and environmental benefits through the promotion of the EV manufacturing industry. Thus, positioning India at the forefront of the global shift towards sustainable mobility while contributing to the country's economic development and environmental preservation efforts.\n\nThis literally just happened and the whole article has been [extrapolated here](https://topgeartimes.beehiiv.com/subscribe) as well for convenience.\n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1710591723.0,
    "convurl": "https://external-preview.redd.it/rIFo77gtcm3BFySlUZVp1qP88v5RnhQIX60y6K3WWko.jpg?auto=webp&s=7e42613005462cf6419619bcdc15ccc7b3f5c248",
    "comments": [],
    "cleaned_text": "indias new ev policy makes importing electric cars affordable ministry heavy industries mhi india introduced new electric vehicle ev policy thats making waves globally designed lure top ev makers like tesla byd india xb aim boost countrys ev manufacturing make hub technological innovation one key features slashing import duties currently importing ev attract taxes even new policy evs valued drops five years move could make wider array evs available india potentially lower prices theres ensure india benefits fully policy insists significant part ev components made locally great building strong local ev ecosystem could transform indias manufacturing scene companies grab golden opportunity need invest big least million plus theyve got get manufacturing plants running within three years clear signal global indian companies invest indian ev market lets grow together however theres catch companies certain countries like china theyll need extra permissions tweaks foreign direct investment fdi policy keeping investment clean line national interests ensure companies serious theyll need provide bank guarantee like promise theyll meet investment manufacturing targets guarantee returned smart move minimizes risks linked policys perks lastly governments got structured way companies apply benefits theres set timeframe submit applications giving ministry flexibility manage process smoothly first two years automotive sectors market size india projected surpass rs lakh crore policy represents strategic effort indian government drive sustainable growth technological innovation environmental benefits promotion ev manufacturing industry thus positioning india forefront global shift towards sustainable mobility contributing countrys economic development environmental preservation efforts literally happened whole article extrapolated herehttpstopgeartimesbeehiivcomsubscribe well convenience xb ",
    "cleaned_title": "indias new ev policy makes importing electric cars affordable",
    "cleaned_selftext": "ministry heavy industries mhi india introduced new electric vehicle ev policy thats making waves globally designed lure top ev makers like tesla byd india xb aim boost countrys ev manufacturing make hub technological innovation one key features slashing import duties currently importing ev attract taxes even new policy evs valued drops five years move could make wider array evs available india potentially lower prices theres ensure india benefits fully policy insists significant part ev components made locally great building strong local ev ecosystem could transform indias manufacturing scene companies grab golden opportunity need invest big least million plus theyve got get manufacturing plants running within three years clear signal global indian companies invest indian ev market lets grow together however theres catch companies certain countries like china theyll need extra permissions tweaks foreign direct investment fdi policy keeping investment clean line national interests ensure companies serious theyll need provide bank guarantee like promise theyll meet investment manufacturing targets guarantee returned smart move minimizes risks linked policys perks lastly governments got structured way companies apply benefits theres set timeframe submit applications giving ministry flexibility manage process smoothly first two years automotive sectors market size india projected surpass rs lakh crore policy represents strategic effort indian government drive sustainable growth technological innovation environmental benefits promotion ev manufacturing industry thus positioning india forefront global shift towards sustainable mobility contributing countrys economic development environmental preservation efforts literally happened whole article extrapolated herehttpstopgeartimesbeehiivcomsubscribe well convenience xb",
    "cleaned_comments": "",
    "light_cleaned_title": "India's New EV Policy Makes Importing Electric Cars More Affordable!",
    "light_cleaned_selftext": "The Ministry of Heavy Industries (MHI) in India has introduced a new electric vehicle (EV) policy that's making waves globally. It's designed to lure top EV makers like Tesla and BYD to India. &#x200B; The aim? To boost the country's EV manufacturing and make it a hub for technological innovation. One of the key features is the slashing of import duties. Currently, importing an EV can attract taxes of 70% or even 100%. But with the new policy, for EVs valued over $35,000, this drops to 15% for five years. This move could make a wider array of EVs available in India, potentially at lower prices. But there's more. To ensure that India benefits fully, the policy insists that a significant part of the EV components be made locally. This is great for building a strong, local EV ecosystem and could transform India's manufacturing scene. For companies to grab this golden opportunity, they need to invest big - at least $500 million. Plus, they've got to get their manufacturing plants up and running within three years. It's a clear signal to both global and Indian companies: invest in the Indian EV market, and let's grow together. However, there's a catch for companies from certain countries, like China. They'll need extra permissions because of tweaks in the Foreign Direct Investment (FDI) policy. It's all about keeping the investment clean and in line with national interests. To ensure companies are serious, they'll need to provide a bank guarantee. It's like a promise that they'll meet their investment and manufacturing targets. If they do, the guarantee is returned. This smart move minimizes risks linked to the policy's perks. Lastly, the government's got a structured way for companies to apply for these benefits. There's a set timeframe to submit applications, giving the ministry the flexibility to manage the process smoothly over the first two years. With the automotive sector's market size in India projected to surpass Rs 24.9 lakh crore by 2030, this policy represents a strategic effort by the Indian government to drive sustainable growth, technological innovation, and environmental benefits through the promotion of the EV manufacturing industry. Thus, positioning India at the forefront of the global shift towards sustainable mobility while contributing to the country's economic development and environmental preservation efforts. This literally just happened and the whole article has been [extrapolated here](https://topgeartimes.beehiiv.com/subscribe) as well for convenience. &#x200B;",
    "light_cleaned_comments": ""
}