{
    "id": "16fmtmb",
    "title": "Farm Laws: Looking for nuanced views",
    "url": "https://www.reddit.com/r/india/comments/16fmtmb/farm_laws_looking_for_nuanced_views/",
    "selftext": "**My opinion**: I always believed that farm laws were necessary. Majority believed that.^(\\[1\\]) But NDA passed these laws with voice votes without much discussions. They failed to communicate it properly to the farmers also. Some mallicious forces from Punjab and Haryana utilized farmers unions to choke up Delhi long enough (and that US-capitol-like humiliation on the red fort) to force the government to repeal the laws. I consider it one of the biggest losses of India in the past decade (right beside the overwhelming increase in communal hate online). \n\n**My questions**: (1) I don't think any government will touch this topic for the next 15-20 years. Will India be better without these farm laws than it would have been with these farm laws? (2) If you are against these laws, what changes would you like to have in them? (3) Is there anyone who believes that the current farming laws and APMC centric infrastructure is the best for India? Why?\n\n\\[1\\] [https://en.wikipedia.org/wiki/2020%E2%80%932021\\_Indian\\_farmers%27\\_protest#Academics](https://en.wikipedia.org/wiki/2020%E2%80%932021_Indian_farmers%27_protest#Academics)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694409690.0,
    "convurl": "https://external-preview.redd.it/jvsXB28o7082A0kt9rIG9Lyab5-tdHeXBjFPJoB8oik.jpg?auto=webp&s=89211f0eb76b8a7b185e357a111cf7138560db19",
    "comments": [
        "better do what the RSS's farmer groups wanted - bring in the farm laws and 1 more - that even private parties must buy it over MSP.",
        "I was aginst farm laws. Changes i wanted - Msp so that no private company can harass farmers, give right of moving to court to farmers which were not in these laws. These were also the major demands of protesting farmers. And fuck those who think Farmer protest in anyway anti national or by malicious forces🤬",
        "We need reform in the agriculture industry. \n\nBut Modi government doesnt seem to have taken the needs of farmers into account when making these laws. Also, during the protest they were inflexible and chose to break rather than bend. \n\nThis is a major failure and yes, no reform may come for another 15-20 yeats. \n\nAPMCs are corrupt, but are logically sound. Rather than reform them, government should empower farmers and provide more support in selling agricultural produce so that APMCs can not exploit them.",
        "Your topic should have been - how could the government avoided this situation. They could have had rounds of consultation and consensus building - instead coming in the morning and saying aaj ka taja law is - Farm laws. and since I have majority - I give a damn about what anyone else thinks.",
        "> malicious forces from Punjab and Haryana \n\nThe three farm laws were pushed by the corporates to privatize agriculture and exploit the farmers. We fought against these laws for over a year. Protests took place all across India. I had organized numerous large-scale protests in Bihar. Over 800 farmers died in the struggle. Most of the farmer unions opposed the law. Agriculture experts like Devinder Sharma and P Sainath opposed the law. Economists opposed the law. Lawyers opposed the law. And here a bunch of ignorant morons are calling us malicious.",
        "This is the impact and the objective of Godi Media.",
        "When petrol and diesel prices were disconnected from subsidy, we were told public will get benefits i.e. when prices fall, we will get the benefit. Are you getting the benefit? May be if you are rich enough to invest into oil companies but as small consumers on limited budget you are not. \n\nWhy do you believe that IMF and Gita Gopinath have the interest of small customers in mind instead of large corps?",
        "MSP & Free market cant exist together. Either the goverment buys all produce at MSP, or the free market buys at market price.\n\nIf the goverment sets a MSP and there is a low output, the prices would suddenly shoot up. The free market would not like these prices and would much rather just buy it from the goverment/APMC. Where there is a surplus, the goverment would be paying tax money to buy stock and then sell it at a loss to the market.",
        "Peddling corporate agenda in the name of farm laws. Only law that is necessary is to pay a fair price to farmers so they can earn decent living wages. But crooks corporates would rather pick farm produce at as little price as possible to fulfill their own coffers.\n\nAnd then we have idiots peddling this same agenda without realizing that it is hitting their own pockets as well.",
        "yeah. Either way, the farmers benefit. Dont see whats wrong in that",
        "In both cases its the tax payer who loses.",
        "Lmao nope.",
        "Lmao yes?",
        "90% of Indian farmers are marginal farmers. I.E. their land holding is too small (less than 2 acres equivalent). For such small farm size, the only ways to give them a decent living wage (equal to national average 172k per year per person in family of 4 = 6.9Lpa) are \n\nA) farm prices to increase by 11X (2.5 acres is avg farm size ). That means food as % of income has to become 20% of average salary (even higher than most expensive developed country)\n\nB)Or other part of population has to subsidise 60% of population in farming. \n\nWhich option do you recommend?",
        "Just do something so they arent left to commit suicides. Is it too much to ask for?",
        "Now you have asked for a fair goal. \n\nBut the path to that goal starts with an acknowledgment that marginal farming is not a sustainable enterprise. Till this truth is not said out loud, people will romanticise the misery. \n\nSince marginal farming does not meet family needs, over time it eventually leads to debt trap. And that leads to desperate situation. \n\nSolution is as follows \n- China method: Accelerate transition of marginal farmers into manufacturing and service sector. It’s side effect will be accelerate urbanisation. Less than 5% of population should be employed in farming\n- Deregulate farm produce market. APMC are a textbook solution that does not work in practical world. Example: fruits and vegetables are outside APMC framework but work much better for farmers. \n- Let food prices rise: it is not farmer’s burden to feed the urban poor by sacrificing their own family. \n\nAll tough choices that are difficult to explain in simple slogans.",
        "But if you leave it in the hands of a few corporates, there will be NO solution.\n\nAPMCs have been systematically killed and made defunct across the board. The solution could be to fix corrupt practices there and let everyone receive their fair share. \n\nAnd the last solution suggested, food prices are already rising with absolutely zero gain for the farming community. It's the corrupt middlemen that are making merry. Address this issue alone and farmers will never complain.",
        "Agriculture is a commodity. It is only valuable if it is scarce. There is a reason why you don’t see any agricultural commodity companies as even too 500 most valuable companies in any middle income country. \n\nIt is an unfounded fear.",
        "Unfounded fears? Really? Heard of that gobhi's friend? This is exactly what they want to do with these so called farm laws.\n\nhttps://thewire.in/rights/himachals-apple-growers-gherao-adani-group-centres-over-low-procurement-rates-rising-input-costs",
        "Gobhi’s friends will get their cutlet no matter what. Petrochemicals, Ports, Airports, Telecom, Retail etc\n\nBut fact remains that agriculture commodity based companies are not the most valuable ones in middle income and developed economies in any country. Unless you create national monopolies by law.",
        "Dont worry... matter of time INDIA will be relishing gobhis friend's cutlets. Along with Gobhi pakodas and of course tea as well.",
        "Agreed.\nProtests weren't anti national. But they weren't innocent either. There were a lot of political forces trying to benefit from it. Many actually did.",
        "1. People on the left opposed it because it was Modi who introduced them. \n2. Arthiyas in Punjab opposed them because it killed their monopoly. \n3. Jat farmers of Haryana opposed them because BJP removed their OBC reservations.",
        "Farmers pay tax too lol",
        "Ther is no Income Tax on agricultural income. Small farmers do not have enough disposable income to spend on > 12% GST items. And they also get subsidized electricity, fertiliser, etc.",
        "still, they pay taxes.",
        "Not income taxes. Everyone pays indirect taxes.",
        "only 7% of the population even pays income taxes in the first place"
    ],
    "cleaned_text": "farm laws looking nuanced views opinion always believed farm laws necessary majority believed nda passed laws voice votes without much discussions failed communicate properly farmers also mallicious forces punjab haryana utilized farmers unions choke delhi long enough uscapitollike humiliation red fort force government repeal laws consider one biggest losses india past decade right beside overwhelming increase communal hate online questions dont think government touch topic next years india better without farm laws would farm laws laws changes would like anyone believes current farming laws apmc centric infrastructure best india httpsenwikipediaorgwikieindianfarmersprotestacademicshttpsenwikipediaorgwikieindianfarmersprotestacademics ",
    "cleaned_title": "farm laws looking nuanced views",
    "cleaned_selftext": "opinion always believed farm laws necessary majority believed nda passed laws voice votes without much discussions failed communicate properly farmers also mallicious forces punjab haryana utilized farmers unions choke delhi long enough uscapitollike humiliation red fort force government repeal laws consider one biggest losses india past decade right beside overwhelming increase communal hate online questions dont think government touch topic next years india better without farm laws would farm laws laws changes would like anyone believes current farming laws apmc centric infrastructure best india httpsenwikipediaorgwikieindianfarmersprotestacademicshttpsenwikipediaorgwikieindianfarmersprotestacademics",
    "cleaned_comments": "better rsss farmer groups wanted bring farm laws even private parties must buy msp aginst farm laws changes wanted msp private company harass farmers give right moving court farmers laws also major demands protesting farmers fuck think farmer protest anyway anti national malicious forces need reform agriculture industry modi government doesnt seem taken needs farmers account making laws also protest inflexible chose break rather bend major failure yes reform may come another yeats apmcs corrupt logically sound rather reform government empower farmers provide support selling agricultural produce apmcs exploit topic could government avoided situation could rounds consultation consensus building instead coming morning saying aaj ka taja law farm laws since majority give damn anyone else thinks malicious forces punjab haryana three farm laws pushed corporates privatize agriculture exploit farmers fought laws year protests took place across india organized numerous largescale protests bihar farmers died struggle farmer unions opposed law agriculture experts like devinder sharma p sainath opposed law economists opposed law lawyers opposed law bunch ignorant morons calling us malicious impact objective godi media petrol diesel prices disconnected subsidy told public get benefits ie prices fall get benefit getting benefit may rich enough invest oil companies small consumers limited budget believe imf gita gopinath interest small customers mind instead large corps msp free market cant exist together either goverment buys produce msp free market buys market price goverment sets msp low output prices would suddenly shoot free market would like prices would much rather buy govermentapmc surplus goverment would paying tax money buy stock sell loss market peddling corporate agenda name farm laws law necessary pay fair price farmers earn decent living wages crooks corporates would rather pick farm produce little price possible fulfill coffers idiots peddling agenda without realizing hitting pockets well yeah either way farmers benefit dont see whats wrong cases tax payer loses lmao nope lmao yes indian farmers marginal farmers ie land holding small less acres equivalent small farm size ways give decent living wage equal national average k per year per person family lpa farm prices increase x acres avg farm size means food income become average salary even higher expensive developed country bor part population subsidise population farming option recommend something arent left commit suicides much ask asked fair goal path goal starts acknowledgment marginal farming sustainable enterprise till truth said loud people romanticise misery since marginal farming meet family needs time eventually leads debt trap leads desperate situation solution follows china method accelerate transition marginal farmers manufacturing service sector side effect accelerate urbanisation less population employed farming deregulate farm produce market apmc textbook solution work practical world example fruits vegetables outside apmc framework work much better farmers let food prices rise farmers burden feed urban poor sacrificing family tough choices difficult explain simple slogans leave hands corporates solution apmcs systematically killed made defunct across board solution could fix corrupt practices let everyone receive fair share last solution suggested food prices already rising absolutely zero gain farming community corrupt middlemen making merry address issue alone farmers never complain agriculture commodity valuable scarce reason dont see agricultural commodity companies even valuable companies middle income country unfounded fear unfounded fears really heard gobhis friend exactly want called farm laws gobhis friends get cutlet matter petrochemicals ports airports telecom retail etc fact remains agriculture commodity based companies valuable ones middle income developed economies country unless create national monopolies law dont worry matter time india relishing gobhis friends cutlets along gobhi pakodas course tea well agreed protests werent anti national werent innocent either lot political forces trying benefit many actually people left opposed modi introduced arthiyas punjab opposed killed monopoly jat farmers haryana opposed bjp removed obc reservations farmers pay tax lol ther income tax agricultural income small farmers enough disposable income spend gst items also get subsidized electricity fertiliser etc still pay taxes income taxes everyone pays indirect taxes population even pays income taxes first place",
    "light_cleaned_title": "Farm Laws: Looking for nuanced views",
    "light_cleaned_selftext": "**My opinion**: I always believed that farm laws were necessary. Majority believed that.^(\\[1\\]) But NDA passed these laws with voice votes without much discussions. They failed to communicate it properly to the farmers also. Some mallicious forces from Punjab and Haryana utilized farmers unions to choke up Delhi long enough (and that US-capitol-like humiliation on the red fort) to force the government to repeal the laws. I consider it one of the biggest losses of India in the past decade (right beside the overwhelming increase in communal hate online). **My questions**: (1) I don't think any government will touch this topic for the next 15-20 years. Will India be better without these farm laws than it would have been with these farm laws? (2) If you are against these laws, what changes would you like to have in them? (3) Is there anyone who believes that the current farming laws and APMC centric infrastructure is the best for India? Why? \\[1\\] [https://en.wikipedia.org/wiki/2020%E2%80%932021\\_Indian\\_farmers%27\\_protest#Academics](https://en.wikipedia.org/wiki/2020%E2%80%932021_Indian_farmers%27_protest#Academics)",
    "light_cleaned_comments": "better do what the RSS's farmer groups wanted - bring in the farm laws and 1 more - that even private parties must buy it over MSP. I was aginst farm laws. Changes i wanted - Msp so that no private company can harass farmers, give right of moving to court to farmers which were not in these laws. These were also the major demands of protesting farmers. And fuck those who think Farmer protest in anyway anti national or by malicious forces🤬 We need reform in the agriculture industry. But Modi government doesnt seem to have taken the needs of farmers into account when making these laws. Also, during the protest they were inflexible and chose to break rather than bend. This is a major failure and yes, no reform may come for another 15-20 yeats. APMCs are corrupt, but are logically sound. Rather than reform them, government should empower farmers and provide more support in selling agricultural produce so that APMCs can not exploit them. Your topic should have been - how could the government avoided this situation. They could have had rounds of consultation and consensus building - instead coming in the morning and saying aaj ka taja law is - Farm laws. and since I have majority - I give a damn about what anyone else thinks. > malicious forces from Punjab and Haryana The three farm laws were pushed by the corporates to privatize agriculture and exploit the farmers. We fought against these laws for over a year. Protests took place all across India. I had organized numerous large-scale protests in Bihar. Over 800 farmers died in the struggle. Most of the farmer unions opposed the law. Agriculture experts like Devinder Sharma and P Sainath opposed the law. Economists opposed the law. Lawyers opposed the law. And here a bunch of ignorant morons are calling us malicious. This is the impact and the objective of Godi Media. When petrol and diesel prices were disconnected from subsidy, we were told public will get benefits i.e. when prices fall, we will get the benefit. Are you getting the benefit? May be if you are rich enough to invest into oil companies but as small consumers on limited budget you are not. Why do you believe that IMF and Gita Gopinath have the interest of small customers in mind instead of large corps? MSP & Free market cant exist together. Either the goverment buys all produce at MSP, or the free market buys at market price. If the goverment sets a MSP and there is a low output, the prices would suddenly shoot up. The free market would not like these prices and would much rather just buy it from the goverment/APMC. Where there is a surplus, the goverment would be paying tax money to buy stock and then sell it at a loss to the market. Peddling corporate agenda in the name of farm laws. Only law that is necessary is to pay a fair price to farmers so they can earn decent living wages. But crooks corporates would rather pick farm produce at as little price as possible to fulfill their own coffers. And then we have idiots peddling this same agenda without realizing that it is hitting their own pockets as well. yeah. Either way, the farmers benefit. Dont see whats wrong in that In both cases its the tax payer who loses. Lmao nope. Lmao yes? 90% of Indian farmers are marginal farmers. I.E. their land holding is too small (less than 2 acres equivalent). For such small farm size, the only ways to give them a decent living wage (equal to national average 172k per year per person in family of 4 = 6.9Lpa) are A) farm prices to increase by 11X (2.5 acres is avg farm size ). That means food as % of income has to become 20% of average salary (even higher than most expensive developed country) B)Or other part of population has to subsidise 60% of population in farming. Which option do you recommend? Just do something so they arent left to commit suicides. Is it too much to ask for? Now you have asked for a fair goal. But the path to that goal starts with an acknowledgment that marginal farming is not a sustainable enterprise. Till this truth is not said out loud, people will romanticise the misery. Since marginal farming does not meet family needs, over time it eventually leads to debt trap. And that leads to desperate situation. Solution is as follows - China method: Accelerate transition of marginal farmers into manufacturing and service sector. It’s side effect will be accelerate urbanisation. Less than 5% of population should be employed in farming - Deregulate farm produce market. APMC are a textbook solution that does not work in practical world. Example: fruits and vegetables are outside APMC framework but work much better for farmers. - Let food prices rise: it is not farmer’s burden to feed the urban poor by sacrificing their own family. All tough choices that are difficult to explain in simple slogans. But if you leave it in the hands of a few corporates, there will be NO solution. APMCs have been systematically killed and made defunct across the board. The solution could be to fix corrupt practices there and let everyone receive their fair share. And the last solution suggested, food prices are already rising with absolutely zero gain for the farming community. It's the corrupt middlemen that are making merry. Address this issue alone and farmers will never complain. Agriculture is a commodity. It is only valuable if it is scarce. There is a reason why you don’t see any agricultural commodity companies as even too 500 most valuable companies in any middle income country. It is an unfounded fear. Unfounded fears? Really? Heard of that gobhi's friend? This is exactly what they want to do with these so called farm laws. Gobhi’s friends will get their cutlet no matter what. Petrochemicals, Ports, Airports, Telecom, Retail etc But fact remains that agriculture commodity based companies are not the most valuable ones in middle income and developed economies in any country. Unless you create national monopolies by law. Dont worry... matter of time INDIA will be relishing gobhis friend's cutlets. Along with Gobhi pakodas and of course tea as well. Agreed. Protests weren't anti national. But they weren't innocent either. There were a lot of political forces trying to benefit from it. Many actually did. 1. People on the left opposed it because it was Modi who introduced them. 2. Arthiyas in Punjab opposed them because it killed their monopoly. 3. Jat farmers of Haryana opposed them because BJP removed their OBC reservations. Farmers pay tax too lol Ther is no Income Tax on agricultural income. Small farmers do not have enough disposable income to spend on > 12% GST items. And they also get subsidized electricity, fertiliser, etc. still, they pay taxes. Not income taxes. Everyone pays indirect taxes. only 7% of the population even pays income taxes in the first place"
}