{
    "id": "1dz07zf",
    "title": "BMW hit and run: Shinde Sena leader’s son arrested by Worli police, 3 days after he went missing (alcohol via urine test also detectable  till 3 days only after drinking)",
    "url": "https://indianexpress.com/article/cities/mumbai/police-arrests-mihir-shah-bmw-hit-and-run-case-9442517/",
    "selftext": "Worli Police on Tuesday arrested 24-year-old Mihir Shah, son of CM Eknath Shinde-led Shiv Sena leader Rajesh Shah, who was absconding for three days after he allegedly mowed down a woman with his speeding BMW.",
    "flair": "Crime",
    "score": 28,
    "num_comments": 4,
    "created_utc": 1720525109.0,
    "convurl": "https://external-preview.redd.it/89kJGlp_5GJn1wjxe3cBcvPL-reMC3cVK9BccRolmag.jpg?auto=webp&s=1630091457a0c813d5df6ee19c02bf06dbe9d3d8",
    "comments": [
        "Coincidence? I think not.",
        "Funny that I don't see any outrage this time  , 2 possibilities we already know the outcome or know that law nd order is not applicable for those associated with BJP ..",
        "Yeah all of us have given up ig.",
        "Law for the poor, justice for the rich.",
        "this isn't justice though, it's twisting the law for the rich. Justice implies something right happening, this is injustice."
    ],
    "cleaned_text": "bmw hit run shinde sena leaders son arrested worli police days went missing alcohol via urine test also detectable till days drinking worli police tuesday arrested yearold mihir shah son cm eknath shindeled shiv sena leader rajesh shah absconding three days allegedly mowed woman speeding bmw ",
    "cleaned_title": "bmw hit run shinde sena leaders son arrested worli police days went missing alcohol via urine test also detectable till days drinking",
    "cleaned_selftext": "worli police tuesday arrested yearold mihir shah son cm eknath shindeled shiv sena leader rajesh shah absconding three days allegedly mowed woman speeding bmw",
    "cleaned_comments": "coincidence think funny dont see outrage time possibilities already know outcome know law nd order applicable associated bjp yeah us given ig law poor justice rich isnt justice though twisting law rich justice implies something right happening injustice",
    "light_cleaned_title": "BMW hit and run: Shinde Sena leader’s son arrested by Worli police, 3 days after he went missing (alcohol via urine test also detectable till 3 days only after drinking)",
    "light_cleaned_selftext": "Worli Police on Tuesday arrested 24-year-old Mihir Shah, son of CM Eknath Shinde-led Shiv Sena leader Rajesh Shah, who was absconding for three days after he allegedly mowed down a woman with his speeding BMW.",
    "light_cleaned_comments": "Coincidence? I think not. Funny that I don't see any outrage this time , 2 possibilities we already know the outcome or know that law nd order is not applicable for those associated with BJP .. Yeah all of us have given up ig. Law for the poor, justice for the rich. this isn't justice though, it's twisting the law for the rich. Justice implies something right happening, this is injustice."
}