{
    "id": "1579jj8",
    "title": "Old Post - Manipur | 'Scared To Step Out': Father of 7-Yr-Old Boy Burnt Alive in Ambulance",
    "url": "https://www.thequint.com/news/india/manipur-violence-ambulance-attack-by-mob-imphal-boy-mother-killed#read-more",
    "selftext": "This is an old post\n\nThere is apparently no video of this but had the we Indians woken up by the widespread news of a child, his mother, his aunt getting burnt alive, maybe the government would have take some steps, some actions to restore peace.\n\nSadly, we all have been desensitized to such an extent that it is now taking the next level shocking videos for a PM to talk about the state that has been burning.\n\nWe will forget all this in a few hours or a few more days",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1690102133.0,
    "convurl": "https://external-preview.redd.it/sLtiL3ytO_0fSNYKzIMRvS33acjAYvbPDmrpCXumai8.jpg?auto=webp&s=b069e5c5b4e7b5b6aac8c5ff0e50ddb924196f04",
    "comments": [
        "Shame on us Indians that it takes increasingly sensational videos to shake our conscience for a few hours or few days.\n\nIs this what we want to be as a society?",
        "Ignorance of the centre towards these crimes is just awful. I hope the state gets its justice"
    ],
    "cleaned_text": "old post manipur scared step father yrold boy burnt alive ambulance old post apparently video indians woken widespread news child mother aunt getting burnt alive maybe government would take steps actions restore peace sadly desensitized extent taking next level shocking videos pm talk state burning forget hours days ",
    "cleaned_title": "old post manipur scared step father yrold boy burnt alive ambulance",
    "cleaned_selftext": "old post apparently video indians woken widespread news child mother aunt getting burnt alive maybe government would take steps actions restore peace sadly desensitized extent taking next level shocking videos pm talk state burning forget hours days",
    "cleaned_comments": "shame us indians takes increasingly sensational videos shake conscience hours days want society ignorance centre towards crimes awful hope state gets justice",
    "light_cleaned_title": "Old Post - Manipur | 'Scared To Step Out': Father of 7-Yr-Old Boy Burnt Alive in Ambulance",
    "light_cleaned_selftext": "This is an old post There is apparently no video of this but had the we Indians woken up by the widespread news of a child, his mother, his aunt getting burnt alive, maybe the government would have take some steps, some actions to restore peace. Sadly, we all have been desensitized to such an extent that it is now taking the next level shocking videos for a PM to talk about the state that has been burning. We will forget all this in a few hours or a few more days",
    "light_cleaned_comments": "Shame on us Indians that it takes increasingly sensational videos to shake our conscience for a few hours or few days. Is this what we want to be as a society? Ignorance of the centre towards these crimes is just awful. I hope the state gets its justice"
}