{
    "id": "12j59n3",
    "title": "Weekly Mental Health Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/12j59n3/weekly_mental_health_discussion_thread/",
    "selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here.\n\nYou may find someone who has gone through a similar episode and might be able to help/guide you.\n\nPlease be civil and maintain Reddiquette while participating or replying/helping out someone.\n\nYou can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic.\n\n**If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**.\n\n* **Helplines**: AASRA: 91-22-27546669 (24 hours)\n* **Sneha Foundation**: 91-44-24640050 (24 hours)\n* **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours)\n* **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm)\n* **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm)\n\n**Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/1fqd80djw8n61.png?width=1487&format=png&auto=webp&v=enabled&s=184ead1efd5057f53cc3236ab564a2ce3ac8a7f6",
    "flair": "Scheduled",
    "score": 2,
    "num_comments": 2,
    "created_utc": 1681263012.0,
    "convurl": "https://external-preview.redd.it/FUATMZm8JLDTc_Im2P2hwXDebj9H8XTUE2E46u7I0hY.jpg",
    "comments": [
        "I clicked on comments and kept trying to scroll only to discover no one commented 😭. People we need to do better, this is a great initiative"
    ],
    "cleaned_text": "weekly mental health discussion thread anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall ",
    "cleaned_title": "weekly mental health discussion thread",
    "cleaned_selftext": "anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall",
    "cleaned_comments": "clicked comments kept trying scroll discover one commented people need better great initiative",
    "light_cleaned_title": "Weekly Mental Health Discussion Thread",
    "light_cleaned_selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here. You may find someone who has gone through a similar episode and might be able to help/guide you. Please be civil and maintain Reddiquette while participating or replying/helping out someone. You can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic. **If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**. * **Helplines**: AASRA: 91-22-27546669 (24 hours) * **Sneha Foundation**: 91-44-24640050 (24 hours) * **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours) * **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm) * **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm) **Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "I clicked on comments and kept trying to scroll only to discover no one commented 😭. People we need to do better, this is a great initiative"
}