{
    "id": "12ed4zq",
    "title": "Consumerhelpline not working, need opinion on how to proceed",
    "url": "https://www.reddit.com/r/india/comments/12ed4zq/consumerhelpline_not_working_need_opinion_on_how/",
    "selftext": "I recently saw a post here about consumerhelpline being super useful for grievances against companies. Hoping to resolve an issue that I had with Zoomcar for charging me unreasonable refueling charges and not reimbursing toll penalty charges (as their car's FASTag had insufficient balance), I filed a complaint against them on the website.\n\n>However, the status of my grievance recently changed to \"Disposed\", and the Company Remark says *\" Hello, With reference to the above mentioned concerned, As checked we have processed the fastag bill refund of 50% asper the time of fastag policy and the refueling charges are valid the gest picked the vehicle 47% and dropped the vehicle with 25%, With this we close the case here amicably. \"*\n\nThis is a **direct lie** and **I have evidence to prove it** (photos of every toll receipt and the distance to empty meter before and after the trip), but despite submitting this evidence in my grievance, I got this response.\n\nAccording to consumerhelpline, I have the option of filing a case at Consumer Commission. But I am not aware of the kind of steps that I'll need to take for it. Will I need legal consultation? Will it work? Is it worth the hassle? Would appreciate if someone shares their experience/advice about this.\n\nhttps://preview.redd.it/bo2u2p9oyesa1.png?width=1920&format=png&auto=webp&v=enabled&s=e11072e1534f49521e22de320fb7863826cf28e9\n\n*To provide some context, I'd forgotten about any remaining dues after my trip. A few months later, Zoomcar started threatening me, saying I owed them money and that they would take me to court. When I checked, it turned out that instead of reimbursing toll penalty charges, they were falsely charging me a hefty refueling charge, despite the fact that I returned their car at the exact same fuel level. When I replied to their WhatsApp number with all the evidence, they didn't respond. Which led me to file the above mentioned grievance.*",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1680852142.0,
    "convurl": "https://b.thumbs.redditmedia.com/_LB2VvlSbCsF_ku1gSkD6Gh6XpuwC4BQ4_jxKdbEbaE.jpg",
    "comments": [
        "So I had an issue with Jiomart and despite me having uploaded proofs of all the return requests I had raised, their reply was that I had not raised a return within the stipulated time. Not true, my first return request was the very next day of receiving the order. \n\nAnyway, I called the consumer helpline and spoke directly to one of their representatives. I explained that Jiomart's reply was BS and contradictory to the screenshots I had uploaded. The consumer helpline then wrote to Jiomart with this and mentioned my proofs. The case was solved shortly after. \n\nMy guess is that every company probably tries the BS route despite the proofs you submit and then waits to see if you will follow up. \n\nGive the consumer helpline a call and explain your issue. Might help."
    ],
    "cleaned_text": "consumerhelpline working need opinion proceed recently saw post consumerhelpline super useful grievances companies hoping resolve issue zoomcar charging unreasonable refueling charges reimbursing toll penalty charges cars fastag insufficient balance filed complaint website however status grievance recently changed disposed company remark says hello reference mentioned concerned checked processed fastag bill refund asper time fastag policy refueling charges valid gest picked vehicle dropped vehicle close case amicably direct lie evidence prove photos every toll receipt distance empty meter trip despite submitting evidence grievance got response according consumerhelpline option filing case consumer commission aware kind steps ill need take need legal consultation work worth hassle would appreciate someone shares experienceadvice provide context id forgotten remaining dues trip months later zoomcar started threatening saying owed money would take court checked turned instead reimbursing toll penalty charges falsely charging hefty refueling charge despite fact returned car exact fuel level replied whatsapp number evidence didnt respond led file mentioned grievance ",
    "cleaned_title": "consumerhelpline working need opinion proceed",
    "cleaned_selftext": "recently saw post consumerhelpline super useful grievances companies hoping resolve issue zoomcar charging unreasonable refueling charges reimbursing toll penalty charges cars fastag insufficient balance filed complaint website however status grievance recently changed disposed company remark says hello reference mentioned concerned checked processed fastag bill refund asper time fastag policy refueling charges valid gest picked vehicle dropped vehicle close case amicably direct lie evidence prove photos every toll receipt distance empty meter trip despite submitting evidence grievance got response according consumerhelpline option filing case consumer commission aware kind steps ill need take need legal consultation work worth hassle would appreciate someone shares experienceadvice provide context id forgotten remaining dues trip months later zoomcar started threatening saying owed money would take court checked turned instead reimbursing toll penalty charges falsely charging hefty refueling charge despite fact returned car exact fuel level replied whatsapp number evidence didnt respond led file mentioned grievance",
    "cleaned_comments": "issue jiomart despite uploaded proofs return requests raised reply raised return within stipulated time true first return request next day receiving order anyway called consumer helpline spoke directly one representatives explained jiomarts reply bs contradictory screenshots uploaded consumer helpline wrote jiomart mentioned proofs case solved shortly guess every company probably tries bs route despite proofs submit waits see follow give consumer helpline call explain issue might help",
    "light_cleaned_title": "Consumerhelpline not working, need opinion on how to proceed",
    "light_cleaned_selftext": "I recently saw a post here about consumerhelpline being super useful for grievances against companies. Hoping to resolve an issue that I had with Zoomcar for charging me unreasonable refueling charges and not reimbursing toll penalty charges (as their car's FASTag had insufficient balance), I filed a complaint against them on the website. >However, the status of my grievance recently changed to \"Disposed\", and the Company Remark says *\" Hello, With reference to the above mentioned concerned, As checked we have processed the fastag bill refund of 50% asper the time of fastag policy and the refueling charges are valid the gest picked the vehicle 47% and dropped the vehicle with 25%, With this we close the case here amicably. \"* This is a **direct lie** and **I have evidence to prove it** (photos of every toll receipt and the distance to empty meter before and after the trip), but despite submitting this evidence in my grievance, I got this response. According to consumerhelpline, I have the option of filing a case at Consumer Commission. But I am not aware of the kind of steps that I'll need to take for it. Will I need legal consultation? Will it work? Is it worth the hassle? Would appreciate if someone shares their experience/advice about this. *To provide some context, I'd forgotten about any remaining dues after my trip. A few months later, Zoomcar started threatening me, saying I owed them money and that they would take me to court. When I checked, it turned out that instead of reimbursing toll penalty charges, they were falsely charging me a hefty refueling charge, despite the fact that I returned their car at the exact same fuel level. When I replied to their WhatsApp number with all the evidence, they didn't respond. Which led me to file the above mentioned grievance.*",
    "light_cleaned_comments": "So I had an issue with Jiomart and despite me having uploaded proofs of all the return requests I had raised, their reply was that I had not raised a return within the stipulated time. Not true, my first return request was the very next day of receiving the order. Anyway, I called the consumer helpline and spoke directly to one of their representatives. I explained that Jiomart's reply was BS and contradictory to the screenshots I had uploaded. The consumer helpline then wrote to Jiomart with this and mentioned my proofs. The case was solved shortly after. My guess is that every company probably tries the BS route despite the proofs you submit and then waits to see if you will follow up. Give the consumer helpline a call and explain your issue. Might help."
}