{
    "id": "rvhw9u",
    "title": "Bi-Weekly Gaming Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/rvhw9u/biweekly_gaming_discussion_thread/",
    "selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!)\n\nWhat game are you looking forward to? Are you a developer? Show us your wares!\n\nPlease don't just list the names of games, make sure to write a word or two about them as well.\n\nCheck out r/IndianGaming! They are an active community and also host a few co-op sessions.\n\n**Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/xagdqefyv8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=f975f1c3093a3d9598a1da39854b03d1250bd55d",
    "flair": "Scheduled",
    "score": 7,
    "num_comments": 11,
    "created_utc": 1641259817,
    "convurl": "https://b.thumbs.redditmedia.com/1yW1vnOXXLbj7GjIDC4BNEociU_mAxBuQABJNbaBbBc.jpg",
    "comments": [
        "I am currently obsessed with Dragon Age: Origins.\n\nIt is of course a dated game, the visuals and the environment show their age, the gameplay is clunky... and yet I can spend hours just listening to the dialogue here. The story line is engrossing and the world is rich.\n\nIn some respects this game was ahead of its time.\n\nI also recently finished Bastion. Gorgeous game, great experience. The reactive narrator is fascinating.",
        "Love paradox titles eu4 and rts like aoe2. Eu4 is always challenging and the game is still active even after 9 years of release.",
        "Well just started playing Oblivion. Bugs took the fun out of Skyrim for me, hope Oblivion doesn't have a lot of bugs.",
        "There are few bug fixing mods for Skyrim. What bugs were deal-breaker for you?",
        "There are a lot of fan made community patches that fix thousands of bugs in Skyrim. I couldnt imagine playing Skyrim without those.",
        "I did get past the bugs using commands, then tried more things with commands like turing player model into that of dragon but ended up ruining my save file, will try another playthrough after finishing Oblivion",
        "Nah dont use those commands. Like you said, they can really mess up your game. Instead, have a look at [this mod](https://www.nexusmods.com/skyrimspecialedition/mods/266). Its considered the most comprehensive bugfixing mod for Skyrim till now.\n\nDo give it a try after you finish Oblivion.",
        "\"Swooping is bad\" - Alastair",
        "Dragon Age 2 and Pillars Of Eternity 2",
        "Witcher 3 DLC. Loved 3 and it took me the better part of the second half of 2021 to finish. DLC is much more fleshed out than I expected it to ever be, really enjoying it.",
        "Just finished playing Homeworld Remastered. Currently playing Homeworld Deserts of Kharak and looking forwoard to the relase of Homeworld 3."
    ],
    "cleaned_text": "biweekly gaming discussion thread playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly gaming discussion thread",
    "cleaned_selftext": "playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "currently obsessed dragon age origins course dated game visuals environment show age gameplay clunky yet spend hours listening dialogue story line engrossing world rich respects game ahead time also recently finished bastion gorgeous game great experience reactive narrator fascinating love paradox titles eu rts like aoe eu always challenging game still active even years release well started playing oblivion bugs took fun skyrim hope oblivion doesnt lot bugs bug fixing mods skyrim bugs dealbreaker lot fan made community patches fix thousands bugs skyrim couldnt imagine playing skyrim without get past bugs using commands tried things commands like turing player model dragon ended ruining save file try another playthrough finishing oblivion nah dont use commands like said really mess game instead look modhttpswwwnexusmodscomskyrimspecialeditionmods considered comprehensive bugfixing mod skyrim till give try finish oblivion swooping bad alastair dragon age pillars eternity witcher dlc loved took better part second half finish dlc much fleshed expected ever really enjoying finished playing homeworld remastered currently playing homeworld deserts kharak looking forwoard relase homeworld",
    "light_cleaned_title": "Bi-Weekly Gaming Discussion Thread",
    "light_cleaned_selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!) What game are you looking forward to? Are you a developer? Show us your wares! Please don't just list the names of games, make sure to write a word or two about them as well. Check out r/IndianGaming! They are an active community and also host a few co-op sessions. **Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "I am currently obsessed with Dragon Age: Origins. It is of course a dated game, the visuals and the environment show their age, the gameplay is clunky... and yet I can spend hours just listening to the dialogue here. The story line is engrossing and the world is rich. In some respects this game was ahead of its time. I also recently finished Bastion. Gorgeous game, great experience. The reactive narrator is fascinating. Love paradox titles eu4 and rts like aoe2. Eu4 is always challenging and the game is still active even after 9 years of release. Well just started playing Oblivion. Bugs took the fun out of Skyrim for me, hope Oblivion doesn't have a lot of bugs. There are few bug fixing mods for Skyrim. What bugs were deal-breaker for you? There are a lot of fan made community patches that fix thousands of bugs in Skyrim. I couldnt imagine playing Skyrim without those. I did get past the bugs using commands, then tried more things with commands like turing player model into that of dragon but ended up ruining my save file, will try another playthrough after finishing Oblivion Nah dont use those commands. Like you said, they can really mess up your game. Instead, have a look at [this mod](https://www.nexusmods.com/skyrimspecialedition/mods/266). Its considered the most comprehensive bugfixing mod for Skyrim till now. Do give it a try after you finish Oblivion. \"Swooping is bad\" - Alastair Dragon Age 2 and Pillars Of Eternity 2 Witcher 3 DLC. Loved 3 and it took me the better part of the second half of 2021 to finish. DLC is much more fleshed out than I expected it to ever be, really enjoying it. Just finished playing Homeworld Remastered. Currently playing Homeworld Deserts of Kharak and looking forwoard to the relase of Homeworld 3."
}