{
    "id": "16j1h0g",
    "title": "Bill downgrades Election Commissioner to status of Cabinet Secy from that of SC Judge",
    "url": "https://indianexpress.com/article/india/bill-downgrades-election-commission-to-status-of-cabinet-secy-from-that-of-sc-judge-8940629/",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Findianexpress.com%2Farticle%2Findia%2Fbill-downgrades-election-commission-to-status-of-cabinet-secy-from-that-of-sc-judge-8940629%2F",
    "flair": "Politics",
    "score": 1,
    "num_comments": 21,
    "created_utc": 1694745580.0,
    "convurl": "https://external-preview.redd.it/ondaznKQMKAHqIVKCYMlSDBxbU88k3cyJ8N18pOKQE0.jpg?auto=webp&s=31504148ef4572d1b6ace5ccc47006f00e82905b",
    "comments": [
        ">“Being seen as the equal of a Cabinet Secretary means you’re even below an MoS (Minister of State) in stature. How do you think that will play out when the Commission tries to discipline a Union minister for violations during an election,” said a source.\n\n\n>Not about salary\n\n>THE Election Commission (Conditions of Service of Election Commissioners and Transaction of Business) Act, 1991, specifies that the three election commissioners are equivalent in pay and service conditions to Supreme Court Judges. Changing this provision raises concerns about the political signal it sends.",
        "Power corrupts.\n\nAbsolute power corrupts absolutely.",
        "mother of democracy",
        "Democracy ki ma ki...",
        "> According to him, equating the EC with the Cabinet Secretary may have been an oversight. “In the past few years, the government has similarly equated the salary of the CIC (Chief Information Commissioner) and CVC (Chief Vigilance Commissioner) with that of the Cabinet Secretary instead of an apex court Judge. The difference is that the CVC and CIC are not Constitutional bodies like the EC. The equivalence of the EC to a Judge is implied in the Constitution itself as it says the CEC can only be removed through impeachment,” Quraishi said   \n\nSystematic erosion of democratic powers? I would not apply Hanlon's razor to politicians, ever.",
        "Umm. This is some grade A bullshit. \n\n[Article 324 of the Constitution](https://indiankanoon.org/doc/950881/) states:\n>Provided that the Chief Election Commissioner shall not be removed from his office except in like manner and on the like grounds as a **Judge of the Supreme Court** and the conditions of service of the Chief Election Commissioner shall not be varied to his disadvantage after his appointment:",
        "They don't have absolute power.",
        "LOL. Now forget about fair elections forever since one nation one election is going to become a reality too.",
        "Link?",
        "Link for who has majority in Rajya Sabha? Seriously?",
        "If genuine question then here you go. https://en.m.wikipedia.org/wiki/Rajya_Sabha",
        ".. jai ho!",
        "*murder?",
        "BJP-RSS have gone so far against their rivals (who they practically consider as their enemies) that they cannot afford to lose elections",
        "masterstroke by modi -- le bhakths defending this move\n\nthe bhakths are the real pappus",
        "Ground reality is much different. If the last 9 years isn't the proof of it, don't know what is.",
        "What? Then how are bills getting passed in RS?",
        "No controversial bill has been brought to a vote in quite some time.",
        "Heinji? Delhi ordinance bill?",
        "Some opposition party was probably going to break rank. So opposition decided to save face and boycotted the vote.",
        "[Bill to demote Election Commissioners' status: What it says — and how it can affect their autonomy](https://indianexpress.com/article/explained/explained-law/bill-demote-election-commissioners-status-8941373/)\n\n[Opinion: The government must not control the watchdog](https://indianexpress.com/article/opinion/columns/appointing-election-commissioners-the-government-must-not-control-the-watchdog-8917864/)",
        "Not all parties are opposition. YSRCP, BJD even though opposition at state level, are aligned with the BJP in RS."
    ],
    "cleaned_text": "bill downgrades election commissioner status cabinet secy sc judge  ",
    "cleaned_title": "bill downgrades election commissioner status cabinet secy sc judge",
    "cleaned_selftext": "",
    "cleaned_comments": "seen equal cabinet secretary means youre even mos minister state stature think play commission tries discipline union minister violations election said source salary election commission conditions service election commissioners transaction business act specifies three election commissioners equivalent pay service conditions supreme court judges changing provision raises concerns political signal sends power corrupts absolute power corrupts absolutely mother democracy democracy ki ki according equating ec cabinet secretary may oversight past years government similarly equated salary cic chief information commissioner cvc chief vigilance commissioner cabinet secretary instead apex court judge difference cvc cic constitutional bodies like ec equivalence ec judge implied constitution says cec removed impeachment quraishi said systematic erosion democratic powers would apply hanlons razor politicians ever umm grade bullshit article constitutionhttpsindiankanoonorgdoc states provided chief election commissioner shall removed office except like manner like grounds judge supreme court conditions service chief election commissioner shall varied disadvantage appointment dont absolute power lol forget fair elections forever since one nation one election going become reality link link majority rajya sabha seriously genuine question go jai ho murder bjprss gone far rivals practically consider enemies afford lose elections masterstroke modi le bhakths defending move bhakths real pappus ground reality much different last years isnt proof dont know bills getting passed rs controversial bill brought vote quite time heinji delhi ordinance bill opposition party probably going break rank opposition decided save face boycotted vote bill demote election commissioners status says affect autonomyhttpsindianexpresscomarticleexplainedexplainedlawbilldemoteelectioncommissionersstatus opinion government must control watchdoghttpsindianexpresscomarticleopinioncolumnsappointingelectioncommissionersthegovernmentmustnotcontrolthewatchdog parties opposition ysrcp bjd even though opposition state level aligned bjp rs",
    "light_cleaned_title": "Bill downgrades Election Commissioner to status of Cabinet Secy from that of SC Judge",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">“Being seen as the equal of a Cabinet Secretary means you’re even below an MoS (Minister of State) in stature. How do you think that will play out when the Commission tries to discipline a Union minister for violations during an election,” said a source. >Not about salary >THE Election Commission (Conditions of Service of Election Commissioners and Transaction of Business) Act, 1991, specifies that the three election commissioners are equivalent in pay and service conditions to Supreme Court Judges. Changing this provision raises concerns about the political signal it sends. Power corrupts. Absolute power corrupts absolutely. mother of democracy Democracy ki ma ki... > According to him, equating the EC with the Cabinet Secretary may have been an oversight. “In the past few years, the government has similarly equated the salary of the CIC (Chief Information Commissioner) and CVC (Chief Vigilance Commissioner) with that of the Cabinet Secretary instead of an apex court Judge. The difference is that the CVC and CIC are not Constitutional bodies like the EC. The equivalence of the EC to a Judge is implied in the Constitution itself as it says the CEC can only be removed through impeachment,” Quraishi said Systematic erosion of democratic powers? I would not apply Hanlon's razor to politicians, ever. Umm. This is some grade A bullshit. [Article 324 of the Constitution](https://indiankanoon.org/doc/950881/) states: >Provided that the Chief Election Commissioner shall not be removed from his office except in like manner and on the like grounds as a **Judge of the Supreme Court** and the conditions of service of the Chief Election Commissioner shall not be varied to his disadvantage after his appointment: They don't have absolute power. LOL. Now forget about fair elections forever since one nation one election is going to become a reality too. Link? Link for who has majority in Rajya Sabha? Seriously? If genuine question then here you go. .. jai ho! *murder? BJP-RSS have gone so far against their rivals (who they practically consider as their enemies) that they cannot afford to lose elections masterstroke by modi -- le bhakths defending this move the bhakths are the real pappus Ground reality is much different. If the last 9 years isn't the proof of it, don't know what is. What? Then how are bills getting passed in RS? No controversial bill has been brought to a vote in quite some time. Heinji? Delhi ordinance bill? Some opposition party was probably going to break rank. So opposition decided to save face and boycotted the vote. [Bill to demote Election Commissioners' status: What it says — and how it can affect their autonomy](https://indianexpress.com/article/explained/explained-law/bill-demote-election-commissioners-status-8941373/) [Opinion: The government must not control the watchdog](https://indianexpress.com/article/opinion/columns/appointing-election-commissioners-the-government-must-not-control-the-watchdog-8917864/) Not all parties are opposition. YSRCP, BJD even though opposition at state level, are aligned with the BJP in RS."
}