{
    "id": "mcmhe6",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/mcmhe6/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or YOUR COMPANY is HIRING:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**The Career Thread is posted every two weeks on Thursday mornings.**\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 33,
    "num_comments": 12,
    "created_utc": 1616635820,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "Looking for a job:\n1. Software Developer. Backend, Java, sql, rdbms, agile development. 1 year experience\n\n2.\n\n3. Bangalore, Hyderabad, Mumbai, Ahmedabad, WFH\n\n4. Dm for resume/experience related discussions",
        "Looking to get hired for graphic design, video editing, proof reading, content writing\n\n1. 7 years of experience writing content, copy, proof reading. 1 year of experience with graphic design and video editing\n\n3. Chennai/WFH\n4. DM on Reddit",
        "Looking to get hired!\n\n5 years of experience in programming.\n\nPython, Django, Flask, Docker and SQL along with basic familiarity with HTML, CSS and client side JavaScript and VueJS.\n\nProficient at using Git &amp; Docker. Work with Ubuntu and centOS as my local and production environment.\n\nCurrently located in Mumbai. Looking for Remote - Full Time / Part Time / Contract positions.\n\nPM to get in touch and/or share details of Open Source contributions.",
        "I had a general question and I found this is the place place I could ask, please don't mind. I was referred for a position at Salesforce however I have already applied online and now my refree says that they cannot read for me. Can I simply withdraw my application and ask them to refer me instead?",
        "Web developer with 5 years of Experience\n\nPortfolio - https://chethanbhat.com\n\nLocation - Remote\n\nLooking for freelance Web Development Work",
        "Looking to get hired:\n\n* Experience building full stack applications using React (with Redux), ExpressJs, Mongoose, Firebase.\n* Have handled email integration (password reset and email verification) and multifactor authentication.\n* Have knowledge of Git and GitHub\n* Have knowledge of websockets (socket.io) and WebRTC\n* Remote Full Time/Part Time. Could relocate based on the city/town. Dm for more details on this",
        "Have a look at whether the jd satisfies your criteria for employment\n \nhttps://angel.co/company/refier-easeasist/jobs"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings",
    "cleaned_comments": "looking job software developer backend java sql rdbms agile development year experience bangalore hyderabad mumbai ahmedabad wfh dm resumeexperience related discussions looking get hired graphic design video editing proof reading content writing years experience writing content copy proof reading year experience graphic design video editing chennaiwfh dm reddit looking get hired years experience programming python django flask docker sql along basic familiarity html css client side javascript vuejs proficient using git amp docker work ubuntu centos local production environment currently located mumbai looking remote full time part time contract positions pm get touch andor share details open source contributions general question found place place could ask please dont mind referred position salesforce however already applied online refree says read simply withdraw application ask refer instead web developer years experience portfolio location remote looking freelance web development work looking get hired experience building full stack applications using react redux expressjs mongoose firebase handled email integration password reset email verification multifactor authentication knowledge git github knowledge websockets socketio webrtc remote full timepart time could relocate based citytown dm details look whether jd satisfies criteria employment",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or YOUR COMPANY is HIRING:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **The Career Thread is posted every two weeks on Thursday mornings.**",
    "light_cleaned_comments": "Looking for a job: 1. Software Developer. Backend, Java, sql, rdbms, agile development. 1 year experience 2. 3. Bangalore, Hyderabad, Mumbai, Ahmedabad, WFH 4. Dm for resume/experience related discussions Looking to get hired for graphic design, video editing, proof reading, content writing 1. 7 years of experience writing content, copy, proof reading. 1 year of experience with graphic design and video editing 3. Chennai/WFH 4. DM on Reddit Looking to get hired! 5 years of experience in programming. Python, Django, Flask, Docker and SQL along with basic familiarity with HTML, CSS and client side JavaScript and VueJS. Proficient at using Git &amp; Docker. Work with Ubuntu and centOS as my local and production environment. Currently located in Mumbai. Looking for Remote - Full Time / Part Time / Contract positions. PM to get in touch and/or share details of Open Source contributions. I had a general question and I found this is the place place I could ask, please don't mind. I was referred for a position at Salesforce however I have already applied online and now my refree says that they cannot read for me. Can I simply withdraw my application and ask them to refer me instead? Web developer with 5 years of Experience Portfolio - Location - Remote Looking for freelance Web Development Work Looking to get hired: * Experience building full stack applications using React (with Redux), ExpressJs, Mongoose, Firebase. * Have handled email integration (password reset and email verification) and multifactor authentication. * Have knowledge of Git and GitHub * Have knowledge of websockets (socket.io) and WebRTC * Remote Full Time/Part Time. Could relocate based on the city/town. Dm for more details on this Have a look at whether the jd satisfies your criteria for employment"
}