{
    "id": "134rb6w",
    "title": "40-Year-Old Man Marries Minor Girl After Mother Fails To Repay Debt",
    "url": "https://www.shethepeople.tv/news/man-marries-minor-girl-debt/",
    "selftext": "Tf is wrong with some people.",
    "flair": "Crime",
    "score": 114,
    "num_comments": 46,
    "created_utc": 1682958746.0,
    "convurl": "https://external-preview.redd.it/qWo9KxhIYTE_iQOCdsPWpl9Vx3LCKdUEZHTlgku_sME.jpg?auto=webp&v=enabled&s=2d4935d005ed6a3c61e307364994481fe537ed3c",
    "comments": [
        "Dafaq is this person still not publicly beaten? Hand him over to me please.",
        "Bihar 🤢🤮",
        "Most of the comments here are and will blame ONLY the man. While the man is scum, I blame that girl's mother even more - as a parent it's primarily her responsibility to protect her child, and she used her as payment. Why are people like that even allowed to breed?",
        "Also part of your country, is it not?",
        "Man how do these things happen in this day and age. Barbarism like this shouldn't happen anymore",
        "What a piece of shit",
        "Her perents should also punished equally, how could she sold her child for money, Furthermore, what is wrong with society that such a heinous act was allowed to happen?",
        "just the idea of this made me puke",
        "unfortunate",
        "Tiger or lion, bone meh dalke thokdenge",
        "It's so convenient to take the higher ground and judge the parents. Clearly you've never lived in a village and haven't seen poverty from close enough to even fathom the struggle for survival.",
        " Wow, what a great excuse to sell a child. Why breed if you cannot provide?. This issue pertains to morals, not merely poverty.",
        "I hope the marriage was not consummated..",
        "It would have been the first thing that the pedophile would've done. Lifetime trauma for the kid.",
        ">Why are people like that even allowed to breed?\n\nHaa Bhai, logon ke chehron pe likha hota hai ki kon apni beti ko bechne wala aur kon nahi. \n\nAlso, you're no one to stop anyone from breeding. Don't think so highly of yourself.\n\nThe problem here is poverty and you're talking about breeding and shit gtfo man.\n\nDo you have any solution to this problem other than  victim blaming?",
        "Yes I have the solution - if you aren't sure of being able to provide a decent education and quality of life, don't fucking breed.\n\nAnd you're right, I'm no one to stop anyone from breeding, else I absolutely would have - including my own parents before anyone else.",
        "Most people have children in the hopes that they'll take them out of poverty.\nFollowing your logic all poor people would simply go extinct.\n\nThat's not really a solution, it's close to genocide. You're telling people to die because they are poor",
        "The saying that 'All kids deserve parents but not all parents deserve kids' rings true here. \nTo sell a 11-yo child to pay one's own debt is almost as bad of a sin as marrying a minor.",
        "Did you really just compare wanting the best possible life for your kids to genocide??\n\nDid you really just promote the extreme narcissism and disgusting selfishness of pushing a new life into a shithole just in the hope that maybe it'll bring you out of it??\n\nYou're a special kind of moron. But on the bright side you'll never suffer a lack of company. Have a good one.",
        "Your solution is not a solution at all. You're literally denying life to poor people how can you be so blind to your own foolery? It should be impossible to be this stupid\n\n\nYou're literally blaming the poorest of all and not the system that breeds and keeps people employed and poor so that they can squeeze their workers for few more rupees. \n\nThere's no point in calling others moron when you can't even give a proper solution",
        "Exactly, there used to be  a maid at our house and we were all a bit shocked to find out she has 7* kids, and in the time she was working at our house got another one, my grandmother tried to make her understand many times about contraceptives but no, finnally she helped her schedule a procedure to tie off the oviducts back in the day or without a doubt she would have has 4-5 more children by now.",
        "Behen, how can we presume that they've sold the child. Duniya mein bohot dukh hai and privileged people like us can never understand their hardships. So all I am saying is that the world can use a little bit of compassion. Let's not judge someone without knowing ko unn bechaaro par kya beeti hogi.",
        "nope, you are absolutely wrong here. I have seen even our local maids birthing 6-7 children while they are unable to provide for even a quarter of them properly. Their husbands come home drunk using their wages and do not contribute to home. We are not denying them the right to give birth and continue their generation to every poor person, just saying that those who are in extreme poverty where situations are dire that you cannot provide for even yourself. Maybe you should refrain at that time from having a kid and wait for a better opportunity when you can provide atleast 1 meal to them. And specially dont go birthing a whole football team if you cannot provide them even 1 meal.",
        "So if they can't get out of poverty till they are in old age, they should not have kids?\n\nOnly the privileged can have kids?\n\nInstead of asking the government to help the poor you all just want them to die.  \n\nI'm not wrong, neither are you. It's just that your approach is not poor friendly.",
        "If they were being threatened and forced due to non-payment of a loan, does it justify exchanging a child for the loan? This is a huge violation of the child's rights. While I understand their hardship, I have seen many families who are even poorer, and if someone were to attempt to touch their children in bad menner, they would rip him apart. I am not biased, and I feel pity for their situation, but I am expressing deep anger because this is not the first time I have heard of something like this happening, and the parents' excuse is always the same: 'THE MONEY'. The problem is that if they are not punished for their crimes, cases like these will continue to occur. I know that living in this world is hard, and being poor is one of the worst things that can happen to someone, but it cannot be justified that someone's life can be ruined in this manner",
        "Fair enough.",
        "Welcome to Bihar",
        "almost?",
        "12th pass kr li tuney ?",
        "Haan",
        ">why breed if you cannot provide\n\nWhat a narrow view.\n\nAs a doctor who has studied and worked at government hospitals and has seen and delivered babies of poor people who had multiple children, their very poverty and lack of bodily autonomy is the reason for this. \n\nWomen with little to no education don’t even understand their own bodies and contraception half the time. \n\nThe singlemost important and accurate indicator of planned conception is the education level of the woman in the couple.",
        "I understand that education is important for people to make informed decisions about their reproductive health. However, I believe that it is also important to judge people who exploit children. Selling children is a crime, and it is a violation of their rights. I have no pity or shame for judging people who do this, as they are supposed to protect their children, not exchange them for money. If we will not hold them accountable cases like this will continues to occur.",
        "Of course- I never said otherwise. \n\nI only responded to one phrase of your comment- I agree with the rest of your comment and that it is absolutely unacceptable to sell a child. I’m not here to justify the actions of anyone who is selling their child to be a sex slave.",
        "I don't really blame the parents here or the established ***Indian*** tradition of selling off your children to pay off debts.\n\nThese are products of a desperately poor nation where parts of the country have actively fought against poverty prevention, industrialization, family planning etc.\n\nThis country is a democracy and we can't just blame it on the generations of people and the leaders they elect. It is our culture and thank the Gods that our culture changes from region to region so the whole country is not a complete shithole.\n\nBut still, massive parts of it are case studies on how a country should not be run and that is not improving anytime too since culture takes time to change and in parts of my country, the culture is regressing instead of progressing. Blaming it on individuals is just scapegoating.",
        "ok so starkcasm, kindly you tell me what would be a appropriate approach towards this group of people. They should produce as many children as they want. Well how would you provide food for so many kids? On top of this, they don't even send their kids to school, even though government schools are dirt cheap in our country, and till high school the fees is free. Often government can provide scholarships to continue for children after 9th. We are already helping them by making subsidies and laws to help them. They get those from our taxes only. I am not asking to let them die. If they are even barely hard working they can earn enough to feed 1-2 kids while sending them to school. Its the thing that they are too high on their addictions or do not have such a mentality to make their children literate rather put them on jobs early to get another earning hand as quickly as possible.",
        "Poverty excuses child sex \nTrafficking ?",
        "Don’t bother replying to idiots who justify evil"
    ],
    "cleaned_text": "yearold man marries minor girl mother fails repay debt tf wrong people ",
    "cleaned_title": "yearold man marries minor girl mother fails repay debt",
    "cleaned_selftext": "tf wrong people",
    "cleaned_comments": "dafaq person still publicly beaten hand please bihar comments blame man man scum blame girls mother even parent primarily responsibility protect child used payment people like even allowed breed also part country man things happen day age barbarism like shouldnt happen anymore piece shit perents also punished equally could sold child money furthermore wrong society heinous act allowed happen idea made puke unfortunate tiger lion bone meh dalke thokdenge convenient take higher ground judge parents clearly youve never lived village havent seen poverty close enough even fathom struggle survival wow great excuse sell child breed provide issue pertains morals merely poverty hope marriage consummated would first thing pedophile wouldve done lifetime trauma kid people like even allowed breed haa bhai logon ke chehron pe likha hota hai ki kon apni beti ko bechne wala aur kon nahi also youre one stop anyone breeding dont think highly problem poverty youre talking breeding shit gtfo man solution problem victim blaming yes solution arent sure able provide decent education quality life dont fucking breed youre right im one stop anyone breeding else absolutely would including parents anyone else people children hopes theyll take poverty following logic poor people would simply go extinct thats really solution close genocide youre telling people die poor saying kids deserve parents parents deserve kids rings true sell yo child pay ones debt almost bad sin marrying minor really compare wanting best possible life kids genocide really promote extreme narcissism disgusting selfishness pushing new life shithole hope maybe itll bring youre special kind moron bright side youll never suffer lack company good one solution solution youre literally denying life poor people blind foolery impossible stupid youre literally blaming poorest system breeds keeps people employed poor squeeze workers rupees theres point calling others moron cant even give proper solution exactly used maid house bit shocked find kids time working house got another one grandmother tried make understand many times contraceptives finnally helped schedule procedure tie oviducts back day without doubt would children behen presume theyve sold child duniya mein bohot dukh hai privileged people like us never understand hardships saying world use little bit compassion lets judge someone without knowing ko unn bechaaro par kya beeti hogi nope absolutely wrong seen even local maids birthing children unable provide even quarter properly husbands come home drunk using wages contribute home denying right give birth continue generation every poor person saying extreme poverty situations dire provide even maybe refrain time kid wait better opportunity provide atleast meal specially dont go birthing whole football team provide even meal cant get poverty till old age kids privileged kids instead asking government help poor want die im wrong neither approach poor friendly threatened forced due nonpayment loan justify exchanging child loan huge violation childs rights understand hardship seen many families even poorer someone attempt touch children bad menner would rip apart biased feel pity situation expressing deep anger first time heard something like happening parents excuse always money problem punished crimes cases like continue occur know living world hard poor one worst things happen someone justified someones life ruined manner fair enough welcome bihar almost th pass kr li tuney haan breed provide narrow view doctor studied worked government hospitals seen delivered babies poor people multiple children poverty lack bodily autonomy reason women little education dont even understand bodies contraception half time singlemost important accurate indicator planned conception education level woman couple understand education important people make informed decisions reproductive health however believe also important judge people exploit children selling children crime violation rights pity shame judging people supposed protect children exchange money hold accountable cases like continues occur course never said otherwise responded one phrase comment agree rest comment absolutely unacceptable sell child im justify actions anyone selling child sex slave dont really blame parents established indian tradition selling children pay debts products desperately poor nation parts country actively fought poverty prevention industrialization family planning etc country democracy cant blame generations people leaders elect culture thank gods culture changes region region whole country complete shithole still massive parts case studies country run improving anytime since culture takes time change parts country culture regressing instead progressing blaming individuals scapegoating ok starkcasm kindly tell would appropriate approach towards group people produce many children want well would provide food many kids top dont even send kids school even though government schools dirt cheap country till high school fees free often government provide scholarships continue children th already helping making subsidies laws help get taxes asking let die even barely hard working earn enough feed kids sending school thing high addictions mentality make children literate rather put jobs early get another earning hand quickly possible poverty excuses child sex trafficking dont bother replying idiots justify evil",
    "light_cleaned_title": "40-Year-Old Man Marries Minor Girl After Mother Fails To Repay Debt",
    "light_cleaned_selftext": "Tf is wrong with some people.",
    "light_cleaned_comments": "Dafaq is this person still not publicly beaten? Hand him over to me please. Bihar 🤢🤮 Most of the comments here are and will blame ONLY the man. While the man is scum, I blame that girl's mother even more - as a parent it's primarily her responsibility to protect her child, and she used her as payment. Why are people like that even allowed to breed? Also part of your country, is it not? Man how do these things happen in this day and age. Barbarism like this shouldn't happen anymore What a piece of shit Her perents should also punished equally, how could she sold her child for money, Furthermore, what is wrong with society that such a heinous act was allowed to happen? just the idea of this made me puke unfortunate Tiger or lion, bone meh dalke thokdenge It's so convenient to take the higher ground and judge the parents. Clearly you've never lived in a village and haven't seen poverty from close enough to even fathom the struggle for survival. Wow, what a great excuse to sell a child. Why breed if you cannot provide?. This issue pertains to morals, not merely poverty. I hope the marriage was not consummated.. It would have been the first thing that the pedophile would've done. Lifetime trauma for the kid. >Why are people like that even allowed to breed? Haa Bhai, logon ke chehron pe likha hota hai ki kon apni beti ko bechne wala aur kon nahi. Also, you're no one to stop anyone from breeding. Don't think so highly of yourself. The problem here is poverty and you're talking about breeding and shit gtfo man. Do you have any solution to this problem other than victim blaming? Yes I have the solution - if you aren't sure of being able to provide a decent education and quality of life, don't fucking breed. And you're right, I'm no one to stop anyone from breeding, else I absolutely would have - including my own parents before anyone else. Most people have children in the hopes that they'll take them out of poverty. Following your logic all poor people would simply go extinct. That's not really a solution, it's close to genocide. You're telling people to die because they are poor The saying that 'All kids deserve parents but not all parents deserve kids' rings true here. To sell a 11-yo child to pay one's own debt is almost as bad of a sin as marrying a minor. Did you really just compare wanting the best possible life for your kids to genocide?? Did you really just promote the extreme narcissism and disgusting selfishness of pushing a new life into a shithole just in the hope that maybe it'll bring you out of it?? You're a special kind of moron. But on the bright side you'll never suffer a lack of company. Have a good one. Your solution is not a solution at all. You're literally denying life to poor people how can you be so blind to your own foolery? It should be impossible to be this stupid You're literally blaming the poorest of all and not the system that breeds and keeps people employed and poor so that they can squeeze their workers for few more rupees. There's no point in calling others moron when you can't even give a proper solution Exactly, there used to be a maid at our house and we were all a bit shocked to find out she has 7* kids, and in the time she was working at our house got another one, my grandmother tried to make her understand many times about contraceptives but no, finnally she helped her schedule a procedure to tie off the oviducts back in the day or without a doubt she would have has 4-5 more children by now. Behen, how can we presume that they've sold the child. Duniya mein bohot dukh hai and privileged people like us can never understand their hardships. So all I am saying is that the world can use a little bit of compassion. Let's not judge someone without knowing ko unn bechaaro par kya beeti hogi. nope, you are absolutely wrong here. I have seen even our local maids birthing 6-7 children while they are unable to provide for even a quarter of them properly. Their husbands come home drunk using their wages and do not contribute to home. We are not denying them the right to give birth and continue their generation to every poor person, just saying that those who are in extreme poverty where situations are dire that you cannot provide for even yourself. Maybe you should refrain at that time from having a kid and wait for a better opportunity when you can provide atleast 1 meal to them. And specially dont go birthing a whole football team if you cannot provide them even 1 meal. So if they can't get out of poverty till they are in old age, they should not have kids? Only the privileged can have kids? Instead of asking the government to help the poor you all just want them to die. I'm not wrong, neither are you. It's just that your approach is not poor friendly. If they were being threatened and forced due to non-payment of a loan, does it justify exchanging a child for the loan? This is a huge violation of the child's rights. While I understand their hardship, I have seen many families who are even poorer, and if someone were to attempt to touch their children in bad menner, they would rip him apart. I am not biased, and I feel pity for their situation, but I am expressing deep anger because this is not the first time I have heard of something like this happening, and the parents' excuse is always the same: 'THE MONEY'. The problem is that if they are not punished for their crimes, cases like these will continue to occur. I know that living in this world is hard, and being poor is one of the worst things that can happen to someone, but it cannot be justified that someone's life can be ruined in this manner Fair enough. Welcome to Bihar almost? 12th pass kr li tuney ? Haan >why breed if you cannot provide What a narrow view. As a doctor who has studied and worked at government hospitals and has seen and delivered babies of poor people who had multiple children, their very poverty and lack of bodily autonomy is the reason for this. Women with little to no education don’t even understand their own bodies and contraception half the time. The singlemost important and accurate indicator of planned conception is the education level of the woman in the couple. I understand that education is important for people to make informed decisions about their reproductive health. However, I believe that it is also important to judge people who exploit children. Selling children is a crime, and it is a violation of their rights. I have no pity or shame for judging people who do this, as they are supposed to protect their children, not exchange them for money. If we will not hold them accountable cases like this will continues to occur. Of course- I never said otherwise. I only responded to one phrase of your comment- I agree with the rest of your comment and that it is absolutely unacceptable to sell a child. I’m not here to justify the actions of anyone who is selling their child to be a sex slave. I don't really blame the parents here or the established ***Indian*** tradition of selling off your children to pay off debts. These are products of a desperately poor nation where parts of the country have actively fought against poverty prevention, industrialization, family planning etc. This country is a democracy and we can't just blame it on the generations of people and the leaders they elect. It is our culture and thank the Gods that our culture changes from region to region so the whole country is not a complete shithole. But still, massive parts of it are case studies on how a country should not be run and that is not improving anytime too since culture takes time to change and in parts of my country, the culture is regressing instead of progressing. Blaming it on individuals is just scapegoating. ok so starkcasm, kindly you tell me what would be a appropriate approach towards this group of people. They should produce as many children as they want. Well how would you provide food for so many kids? On top of this, they don't even send their kids to school, even though government schools are dirt cheap in our country, and till high school the fees is free. Often government can provide scholarships to continue for children after 9th. We are already helping them by making subsidies and laws to help them. They get those from our taxes only. I am not asking to let them die. If they are even barely hard working they can earn enough to feed 1-2 kids while sending them to school. Its the thing that they are too high on their addictions or do not have such a mentality to make their children literate rather put them on jobs early to get another earning hand as quickly as possible. Poverty excuses child sex Trafficking ? Don’t bother replying to idiots who justify evil"
}