{
    "id": "17v0gq0",
    "title": "\"Make Adultery Crime Again\": Panel To Centre, Eye On Supreme Court Verdict",
    "url": "https://www.ndtv.com/india-news/bharatiya-nyan-sanhita-adultery-a-crime-again-4573340",
    "selftext": "\"Make Adultery Crime Again\": Panel To Centre, Eye On Supreme Court Verdict\n\nhttps://www.ndtv.com/india-news/bharatiya-nyan-sanhita-adultery-a-crime-again-4573340",
    "flair": "Law & Courts",
    "score": 236,
    "num_comments": 63,
    "created_utc": 1699962116.0,
    "convurl": "https://external-preview.redd.it/LcIGKtSEAtnK95HALRVJtj7S1AYap5JcYUP8PHVn0N4.jpg?auto=webp&s=322855c3e7523373c7f5d0673108e86e6adcd235",
    "comments": [
        "GenZ be like\n\n![gif](giphy|2BZtE0df5GeI9zTEkQ)",
        "A most forward-thinking, progressive, positive proposal! Definitely another \"nEEd oF tHe hOUr.\"",
        "It is utmost important that we know what people are doing in their bedrooms! \nThis is a Sankari society! \n😂😂😂",
        "Not to be confused with Sanskari society!\n\n/S",
        "Looks like our MPs have too much free time.",
        "PM : Remove outdated British Laws ...\n\nMPs : Make adultery a crime again ......",
        "😂 thanks for the errata!",
        "![gif](giphy|ULVE0UUW5JSaJ4RhVT)\n\n/S",
        "Finally, a common-sense law that most certainly won't be abused by the public. 😎",
        "![gif](giphy|IPlurp1TLz8rrJHZwj)\n\n/S",
        "Bhai Rukh jaoo Maine abhi tak cheating nhi Kiya toh thodi der  baad Lana.",
        "I support this. Women can cheat and then file for divorce and then get away with half of the property and live with the other guy.\n\nThat's unacceptable",
        "![gif](giphy|xULW8MYvpNOfMXfDH2)\n\n/S",
        "Tbh I support this.\n\nA lot of women cheats and then files for divorce or Husband files for divorce n then husband loses half of everything n have to pay alimony. \n\nThis needs to happen. Along with complete removal of rape on the pretext of marriage.\n\n(Why did I say women n not men? Doesn't matter if man cheated or not, 99% he will lose n will have to pay alimony)",
        "Jeez, what an absolutely piss poor take. If it was as simple as that no one would fucking marry.",
        "The only piss poor take is yours. Women of this country have weaponized laws against men to the point that even judges are commenting on it.\n\nAnd most of them starts with adultery.\n\nMaybe don't marry at all if you can't stop having sex with everyone other than the one who you think is your retirement scheme?",
        "No facts, no data, bas kuch bhi bolna hai. I'm a law student myself, and believe me, I know that some of the laws are definitely in favour of women, to the point that it is unfair sometimes. But adultery doesn't even come close. This just your hate manifesting itself as nothing more than, I reiterate, a piss poor opinion. \n\nBtw who hurt you, my man?",
        "Then make gender neutral marriage and divorce laws, make alimony legal, and update existing laws. No need to evolve backward.",
        "I would support this as well.\nBut that wont happen.\n\nSo whats the next best thing for MOST MEN? Making adultery a crime.",
        "alimony law in India is gender neutral depending on who is the earner, I know it's rare but this one teacher from Bombay is paying alimony to her ex-husband. It's nice if we make gender neutral laws rather than inviting gender war. Both men and women cheat.",
        "Ek to pata le fir cheating karne ka soch.",
        "Need your opinions over this : Should adultery by either party forfeit their claim over alimony?",
        "![gif](giphy|aOPINgmqpVXNK)\n\n/S",
        "So will it be gender neutral ?",
        "![gif](giphy|3ohhwAaoGzLRGM6jqo|downsized)\n\n/S",
        "Sure, if it pave ways for easy divorce without settlement. Otherwise it has no meaning.",
        "Bhai wohi sabse difficult part hai.",
        "Alimony is already legal right.",
        "Let’s ban Divorce.",
        "The law criminalizing Adultery should have never been removed. Even the Petitioner who filed the case in SC regarding the same wanted the law to be just amended.",
        "![gif](giphy|McPX868ZmoAF7zNJa6)\n\n/S",
        "He's hurt because he never got laid.",
        "Adultery should be a \"**legal**\" reason for divorce, not a punishable offense like middle age",
        "That will forfeit alimony claim",
        "Offices around the country in shambles rn",
        "Bro who talked about alimony here 😭",
        "Indian men have been cheating and being domestic abusers and rapists for decades, and get away with it because societal, judicial, and police actively prevents and discourages women from reporting about it.\n\n\nThis doesn't concern you one bit, but because news channels glorifies a few cases of divorce, then suddenly women are the enemy and archaic laws must be brought back to punish them.",
        "Of course it doesn't concern me because what older generations did is not my concern. \n\nI just want protection for me and people like me at present. Or the future. This gives that.\n\n\nAs for \"archaic\" laws, truly progressive societies don't need these because women over there don't weaponize laws like most Indian women do. They are generally just normal people.\n\nFiend is the word I'd use for most of ours.",
        "absolutely",
        "Just chiming in, does that splitting half of everything (after divorce) applies in India as well? Afaik its a law in US, not India. Can anyone enlighten?. \n\nAlso, how strong are prenups in Indian courts, do they stand or are just blown away?",
        "I hope you’re also against dowry, domestic violence, marital rape, joint family systems, treating wives like maids and sex slaves etc. It’s so pathetic to see men act like victims in a country known for having the highest number of female foeticides/infanticides, dowry deaths, and where the birth of a girl is considered a burden and boys are considered blessings. It’s also usually men and their families treating the woman as a retirement scheme by harassing her family for lakhs/crores in dowry. \n\nBut oh no, a country globally known for being extremely misogynistic and patriarchal is so hard to live in for a man!",
        "Yes, you are 100% right about our hanarable PM. He wants to remove the outdated 18/19th century British laws and replace them with 14th century Indian laws.",
        "Just dont cheat. simple. /s",
        "Cheating is grounds gor divorce though,no?",
        "Brother just triggered butthurt adulterers, lol the replies.\n\nRedditors do live in a bubble, what you just mentioned is quite rampant in the society, infact I have close relatives facing the same issue.\n\nI know of a relative whose wife neither divorces him nor agrees to live with him, she lives in a different city with their kid and the husband lives in other, she even has a bf or whatever arrangement you might call. She doesn't want to reconcile and just wants monthly allowance, on refusal/asking for divorce she threatens him for domestic abuse/dowry. The guy comes from a respectable family and works in a PSU at a high level and anything involving court and jail would tarnish his rep, so it makes him cave in to her demands.\n\nAnd if people think the guy must have issues and all, his wife made a scene of domestic abuse/dowry and went back to her parent's house just after a few weeks into marriage. And I know the family too well, they're not even close to being violent or someone who'd harrass for dowry. And neither is it a joint family, the guy lives alone, with househelp and all. Its all a case of adultery,",
        "As long as men get punished as much as women",
        "Why? Adultery is personal, government has no business to get involved. It can be grounds for divorce but it shouldn't lead to jail",
        "Adultery does not mean that the spouse forfeit her share of marital asset. That's just the risk of marriage. Men cheat in greater Numbers and get away with it.",
        "Read the article you imbecile, it's a gender neutral proposal",
        "Prenups don't exist in India since they are not recognized by law. As for splitting half it's every nebulous in India. Many times people just live together in parents home so there isn't a house for the divorcing couple and even the son's parents asset become fair game. In US too I think many states have fair and equitable distribution rather than just equal.",
        "Governor, adultery does not forfeit ones right to martial assets and alimony. Please read up a little how marriages work",
        "Thanks a lot.",
        "You have a point there.",
        "Sad for the chap. But to think the some how adultery would mean no share of martial assets in divorce is just wrong line of thinking. People don't lose share of martial assets because of adultery.",
        "Not according to Christian sharia law....",
        "Or he thinks his stay at home wife did not contribute anything to the household or eased any home burden that facilitated his promotions at work.",
        "Wish you had the minimum intellectual capabilities to understand a sentence n context.",
        "The very point of adultery being a crime comes from the idea that women are \"property\" of their husbands and adultery is akin to stealing or using somebody else's property without their permission. Outside of that archaic premise, there is absolutely no reason for adultery being a crime. So, women are always treated as a victim of adultery regardless of who initiated the relationship. \n\nCourts have already established that adultery or occasional bouts of infidelity by wife is not a basis for denial of maintenance. The husband has to prove that the wife is constantly living in adultery while married to them for the maintenance request to be denied and that too its temporary. Once she stops, she would again become eligible for maintenance.\n\nBottom-line, what you said is never gonna happen.",
        "Reason shouldn't be needed for divorce.\n\nFor alimony and custody of the child? Sure.",
        "Common theme of all religious doctrine. Manusmriti, the so called text book of Sanatana Dharma pretty much stereotypes all women as lustful sex crazy beings who would sleep around all over the place if not constantly controlled and kept dependent on men. See Chapter IX, Verse 2-20\n\n[https://eweb.furman.edu/\\~ateipen/ReligionA45/protected/manusmriti.htm](https://eweb.furman.edu/~ateipen/ReligionA45/protected/manusmriti.htm)",
        ">Courts have already established that adultery or occasional bouts of infidelity by wife is not a basis for denial of maintenance.\n\nSo basically I need to pay money and see my wife get railed by another guy? \n\nI am definitely never marrying lmao",
        "Are you mentally challenged? How is his message on the misuse of current laws has anything to do with your generalizations?",
        "It should clearly.",
        "Isn't the appeal of the new bill to make the law gender neutral? Why are most comments in this group taking it as detrimental to one gender?\nNote: I have not gone through the exact bill, so I may be incorrect. Let me know if that is the case.",
        "The men who think that they are the victims in a patriarchal and misogynistic society are the ones who are mentally challenged.",
        "Adultery is a sin in Hinduism , it should be reciminalised as it always was .",
        "You get married under religious Ceremony not in your bedroom , Adultery is a sin in Hinduism and punishment should follow."
    ],
    "cleaned_text": "make adultery crime panel centre eye supreme court verdict make adultery crime panel centre eye supreme court verdict ",
    "cleaned_title": "make adultery crime panel centre eye supreme court verdict",
    "cleaned_selftext": "make adultery crime panel centre eye supreme court verdict",
    "cleaned_comments": "genz like gifgiphybztedfgeiztekq forwardthinking progressive positive proposal definitely another need hour utmost important know people bedrooms sankari society confused sanskari society looks like mps much free time pm remove outdated british laws mps make adultery crime thanks errata gifgiphyulveuuwjsajrhvt finally commonsense law certainly wont abused public gifgiphyiplurptlzrrjhzwj bhai rukh jaoo maine abhi tak cheating nhi kiya toh thodi der baad lana support women cheat file divorce get away half property live guy thats unacceptable gifgiphyxulwmyvpnofmxfdh tbh support lot women cheats files divorce husband files divorce n husband loses half everything n pay alimony needs happen along complete removal rape pretext marriage say women n men doesnt matter man cheated lose n pay alimony jeez absolutely piss poor take simple one would fucking marry piss poor take women country weaponized laws men point even judges commenting starts adultery maybe dont marry cant stop sex everyone one think retirement scheme facts data bas kuch bhi bolna hai im law student believe know laws definitely favour women point unfair sometimes adultery doesnt even come close hate manifesting nothing reiterate piss poor opinion btw hurt man make gender neutral marriage divorce laws make alimony legal update existing laws need evolve backward would support well wont happen whats next best thing men making adultery crime alimony law india gender neutral depending earner know rare one teacher bombay paying alimony exhusband nice make gender neutral laws rather inviting gender war men women cheat ek pata le fir cheating karne ka soch need opinions adultery either party forfeit claim alimony gifgiphyaopingmqpvxnk gender neutral gifgiphyohhwaaogzlrgmjqodownsized sure pave ways easy divorce without settlement otherwise meaning bhai wohi sabse difficult part hai alimony already legal right lets ban divorce law criminalizing adultery never removed even petitioner filed case sc regarding wanted law amended gifgiphymcpxzmoafznja hes hurt never got laid adultery legal reason divorce punishable offense like middle age forfeit alimony claim offices around country shambles rn bro talked alimony indian men cheating domestic abusers rapists decades get away societal judicial police actively prevents discourages women reporting doesnt concern one bit news channels glorifies cases divorce suddenly women enemy archaic laws must brought back punish course doesnt concern older generations concern want protection people like present future gives archaic laws truly progressive societies dont need women dont weaponize laws like indian women generally normal people fiend word id use absolutely chiming splitting half everything divorce applies india well afaik law us india anyone enlighten also strong prenups indian courts stand blown away hope youre also dowry domestic violence marital rape joint family systems treating wives like maids sex slaves etc pathetic see men act like victims country known highest number female foeticidesinfanticides dowry deaths birth girl considered burden boys considered blessings also usually men families treating woman retirement scheme harassing family lakhscrores dowry oh country globally known extremely misogynistic patriarchal hard live man yes right hanarable pm wants remove outdated th century british laws replace th century indian laws dont cheat simple cheating grounds gor divorce thoughno brother triggered butthurt adulterers lol replies redditors live bubble mentioned quite rampant society infact close relatives facing issue know relative whose wife neither divorces agrees live lives different city kid husband lives even bf whatever arrangement might call doesnt want reconcile wants monthly allowance refusalasking divorce threatens domestic abusedowry guy comes respectable family works psu high level anything involving court jail would tarnish rep makes cave demands people think guy must issues wife made scene domestic abusedowry went back parents house weeks marriage know family well theyre even close violent someone whod harrass dowry neither joint family guy lives alone househelp case adultery long men get punished much women adultery personal government business get involved grounds divorce shouldnt lead jail adultery mean spouse forfeit share marital asset thats risk marriage men cheat greater numbers get away read article imbecile gender neutral proposal prenups dont exist india since recognized law splitting half every nebulous india many times people live together parents home isnt house divorcing couple even sons parents asset become fair game us think many states fair equitable distribution rather equal governor adultery forfeit ones right martial assets alimony please read little marriages work thanks lot point sad chap think adultery would mean share martial assets divorce wrong line thinking people dont lose share martial assets adultery according christian sharia law thinks stay home wife contribute anything household eased home burden facilitated promotions work wish minimum intellectual capabilities understand sentence n context point adultery crime comes idea women property husbands adultery akin stealing using somebody elses property without permission outside archaic premise absolutely reason adultery crime women always treated victim adultery regardless initiated relationship courts already established adultery occasional bouts infidelity wife basis denial maintenance husband prove wife constantly living adultery married maintenance request denied temporary stops would become eligible maintenance bottomline said never gon na happen reason shouldnt needed divorce alimony custody child sure common theme religious doctrine manusmriti called text book sanatana dharma pretty much stereotypes women lustful sex crazy beings would sleep around place constantly controlled kept dependent men see chapter ix verse httpsewebfurmaneduateipenreligionaprotectedmanusmritihtmhttpsewebfurmaneduateipenreligionaprotectedmanusmritihtm courts already established adultery occasional bouts infidelity wife basis denial maintenance basically need pay money see wife get railed another guy definitely never marrying lmao mentally challenged message misuse current laws anything generalizations clearly isnt appeal new bill make law gender neutral comments group taking detrimental one gender note gone exact bill may incorrect let know case men think victims patriarchal misogynistic society ones mentally challenged adultery sin hinduism reciminalised always get married religious ceremony bedroom adultery sin hinduism punishment follow",
    "light_cleaned_title": "\"Make Adultery Crime Again\": Panel To Centre, Eye On Supreme Court Verdict",
    "light_cleaned_selftext": "\"Make Adultery Crime Again\": Panel To Centre, Eye On Supreme Court Verdict",
    "light_cleaned_comments": "GenZ be like ![gif](giphy|2BZtE0df5GeI9zTEkQ) A most forward-thinking, progressive, positive proposal! Definitely another \"nEEd oF tHe hOUr.\" It is utmost important that we know what people are doing in their bedrooms! This is a Sankari society! 😂😂😂 Not to be confused with Sanskari society! /S Looks like our MPs have too much free time. PM : Remove outdated British Laws ... MPs : Make adultery a crime again ...... 😂 thanks for the errata! ![gif](giphy|ULVE0UUW5JSaJ4RhVT) /S Finally, a common-sense law that most certainly won't be abused by the public. 😎 ![gif](giphy|IPlurp1TLz8rrJHZwj) /S Bhai Rukh jaoo Maine abhi tak cheating nhi Kiya toh thodi der baad Lana. I support this. Women can cheat and then file for divorce and then get away with half of the property and live with the other guy. That's unacceptable ![gif](giphy|xULW8MYvpNOfMXfDH2) /S Tbh I support this. A lot of women cheats and then files for divorce or Husband files for divorce n then husband loses half of everything n have to pay alimony. This needs to happen. Along with complete removal of rape on the pretext of marriage. (Why did I say women n not men? Doesn't matter if man cheated or not, 99% he will lose n will have to pay alimony) Jeez, what an absolutely piss poor take. If it was as simple as that no one would fucking marry. The only piss poor take is yours. Women of this country have weaponized laws against men to the point that even judges are commenting on it. And most of them starts with adultery. Maybe don't marry at all if you can't stop having sex with everyone other than the one who you think is your retirement scheme? No facts, no data, bas kuch bhi bolna hai. I'm a law student myself, and believe me, I know that some of the laws are definitely in favour of women, to the point that it is unfair sometimes. But adultery doesn't even come close. This just your hate manifesting itself as nothing more than, I reiterate, a piss poor opinion. Btw who hurt you, my man? Then make gender neutral marriage and divorce laws, make alimony legal, and update existing laws. No need to evolve backward. I would support this as well. But that wont happen. So whats the next best thing for MOST MEN? Making adultery a crime. alimony law in India is gender neutral depending on who is the earner, I know it's rare but this one teacher from Bombay is paying alimony to her ex-husband. It's nice if we make gender neutral laws rather than inviting gender war. Both men and women cheat. Ek to pata le fir cheating karne ka soch. Need your opinions over this : Should adultery by either party forfeit their claim over alimony? ![gif](giphy|aOPINgmqpVXNK) /S So will it be gender neutral ? ![gif](giphy|3ohhwAaoGzLRGM6jqo|downsized) /S Sure, if it pave ways for easy divorce without settlement. Otherwise it has no meaning. Bhai wohi sabse difficult part hai. Alimony is already legal right. Let’s ban Divorce. The law criminalizing Adultery should have never been removed. Even the Petitioner who filed the case in SC regarding the same wanted the law to be just amended. ![gif](giphy|McPX868ZmoAF7zNJa6) /S He's hurt because he never got laid. Adultery should be a \"**legal**\" reason for divorce, not a punishable offense like middle age That will forfeit alimony claim Offices around the country in shambles rn Bro who talked about alimony here 😭 Indian men have been cheating and being domestic abusers and rapists for decades, and get away with it because societal, judicial, and police actively prevents and discourages women from reporting about it. This doesn't concern you one bit, but because news channels glorifies a few cases of divorce, then suddenly women are the enemy and archaic laws must be brought back to punish them. Of course it doesn't concern me because what older generations did is not my concern. I just want protection for me and people like me at present. Or the future. This gives that. As for \"archaic\" laws, truly progressive societies don't need these because women over there don't weaponize laws like most Indian women do. They are generally just normal people. Fiend is the word I'd use for most of ours. absolutely Just chiming in, does that splitting half of everything (after divorce) applies in India as well? Afaik its a law in US, not India. Can anyone enlighten?. Also, how strong are prenups in Indian courts, do they stand or are just blown away? I hope you’re also against dowry, domestic violence, marital rape, joint family systems, treating wives like maids and sex slaves etc. It’s so pathetic to see men act like victims in a country known for having the highest number of female foeticides/infanticides, dowry deaths, and where the birth of a girl is considered a burden and boys are considered blessings. It’s also usually men and their families treating the woman as a retirement scheme by harassing her family for lakhs/crores in dowry. But oh no, a country globally known for being extremely misogynistic and patriarchal is so hard to live in for a man! Yes, you are 100% right about our hanarable PM. He wants to remove the outdated 18/19th century British laws and replace them with 14th century Indian laws. Just dont cheat. simple. /s Cheating is grounds gor divorce though,no? Brother just triggered butthurt adulterers, lol the replies. Redditors do live in a bubble, what you just mentioned is quite rampant in the society, infact I have close relatives facing the same issue. I know of a relative whose wife neither divorces him nor agrees to live with him, she lives in a different city with their kid and the husband lives in other, she even has a bf or whatever arrangement you might call. She doesn't want to reconcile and just wants monthly allowance, on refusal/asking for divorce she threatens him for domestic abuse/dowry. The guy comes from a respectable family and works in a PSU at a high level and anything involving court and jail would tarnish his rep, so it makes him cave in to her demands. And if people think the guy must have issues and all, his wife made a scene of domestic abuse/dowry and went back to her parent's house just after a few weeks into marriage. And I know the family too well, they're not even close to being violent or someone who'd harrass for dowry. And neither is it a joint family, the guy lives alone, with househelp and all. Its all a case of adultery, As long as men get punished as much as women Why? Adultery is personal, government has no business to get involved. It can be grounds for divorce but it shouldn't lead to jail Adultery does not mean that the spouse forfeit her share of marital asset. That's just the risk of marriage. Men cheat in greater Numbers and get away with it. Read the article you imbecile, it's a gender neutral proposal Prenups don't exist in India since they are not recognized by law. As for splitting half it's every nebulous in India. Many times people just live together in parents home so there isn't a house for the divorcing couple and even the son's parents asset become fair game. In US too I think many states have fair and equitable distribution rather than just equal. Governor, adultery does not forfeit ones right to martial assets and alimony. Please read up a little how marriages work Thanks a lot. You have a point there. Sad for the chap. But to think the some how adultery would mean no share of martial assets in divorce is just wrong line of thinking. People don't lose share of martial assets because of adultery. Not according to Christian sharia law.... Or he thinks his stay at home wife did not contribute anything to the household or eased any home burden that facilitated his promotions at work. Wish you had the minimum intellectual capabilities to understand a sentence n context. The very point of adultery being a crime comes from the idea that women are \"property\" of their husbands and adultery is akin to stealing or using somebody else's property without their permission. Outside of that archaic premise, there is absolutely no reason for adultery being a crime. So, women are always treated as a victim of adultery regardless of who initiated the relationship. Courts have already established that adultery or occasional bouts of infidelity by wife is not a basis for denial of maintenance. The husband has to prove that the wife is constantly living in adultery while married to them for the maintenance request to be denied and that too its temporary. Once she stops, she would again become eligible for maintenance. Bottom-line, what you said is never gonna happen. Reason shouldn't be needed for divorce. For alimony and custody of the child? Sure. Common theme of all religious doctrine. Manusmriti, the so called text book of Sanatana Dharma pretty much stereotypes all women as lustful sex crazy beings who would sleep around all over the place if not constantly controlled and kept dependent on men. See Chapter IX, Verse 2-20 [https://eweb.furman.edu/\\~ateipen/ReligionA45/protected/manusmriti.htm](https://eweb.furman.edu/~ateipen/ReligionA45/protected/manusmriti.htm) >Courts have already established that adultery or occasional bouts of infidelity by wife is not a basis for denial of maintenance. So basically I need to pay money and see my wife get railed by another guy? I am definitely never marrying lmao Are you mentally challenged? How is his message on the misuse of current laws has anything to do with your generalizations? It should clearly. Isn't the appeal of the new bill to make the law gender neutral? Why are most comments in this group taking it as detrimental to one gender? Note: I have not gone through the exact bill, so I may be incorrect. Let me know if that is the case. The men who think that they are the victims in a patriarchal and misogynistic society are the ones who are mentally challenged. Adultery is a sin in Hinduism , it should be reciminalised as it always was . You get married under religious Ceremony not in your bedroom , Adultery is a sin in Hinduism and punishment should follow."
}