{
    "id": "12f6zid",
    "title": "Bi-Weekly Books & Reading Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/12f6zid/biweekly_books_reading_discussion_thread/",
    "selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories!\n\nDid you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations!\n\nCheck out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related.\n\nAlso, visit r/Bharat, to read and share well-written, insightful long-form articles about India.\n\nr/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)!\n\n**Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/obor0v8vx8n61.png?width=1487&format=png&auto=webp&v=enabled&s=26bc0642916d86c8e02a80ae0eb06417f74c209f",
    "flair": "Scheduled",
    "score": 11,
    "num_comments": 8,
    "created_utc": 1680917412.0,
    "convurl": "https://external-preview.redd.it/4-MB5BkKm6EYrEla9dN9w0T2n_gnXtFrCL-kOTKmNbI.jpg",
    "comments": [
        "Anyone read Hindi books here? Currently reading Godan by Premchand. It's probably my first Hindi novel read.",
        "Reading Work rules! by Laszlo block. Loving it so far. Any suggestions for similar books?",
        "Is anyone into technical reading?",
        "Has anyone read Don Quixote?\nI bought it, but it is an old translation by John Ormsby so was wondering if I should continue with it, or read a more modern translation.",
        "John Ormsby's one is in the public domain. I would suggest to continue reading the first few pages and check if you are comfortable with it. Else, you can switch to Edith Grossman's translation.",
        "If you are looking for tech management-related books, then *Staff Engineer* and *An Elegant Puzzle*, both by Will Larson would be a good starting point. Anything specific that you are looking for, in terms of the topics?",
        "Godan is Premchand's most mature work. Highly recommend completing it."
    ],
    "cleaned_text": "biweekly books reading discussion thread bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly books reading discussion thread",
    "cleaned_selftext": "bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall",
    "cleaned_comments": "anyone read hindi books currently reading godan premchand probably first hindi novel read reading work rules laszlo block loving far suggestions similar books anyone technical reading anyone read quixote bought old translation john ormsby wondering continue read modern translation john ormsbys one public domain would suggest continue reading first pages check comfortable else switch edith grossmans translation looking tech managementrelated books staff engineer elegant puzzle larson would good starting point anything specific looking terms topics godan premchands mature work highly recommend completing",
    "light_cleaned_title": "Bi-Weekly Books & Reading Discussion Thread",
    "light_cleaned_selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories! Did you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations! Check out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related. Also, visit r/Bharat, to read and share well-written, insightful long-form articles about India. r/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)! **Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Anyone read Hindi books here? Currently reading Godan by Premchand. It's probably my first Hindi novel read. Reading Work rules! by Laszlo block. Loving it so far. Any suggestions for similar books? Is anyone into technical reading? Has anyone read Don Quixote? I bought it, but it is an old translation by John Ormsby so was wondering if I should continue with it, or read a more modern translation. John Ormsby's one is in the public domain. I would suggest to continue reading the first few pages and check if you are comfortable with it. Else, you can switch to Edith Grossman's translation. If you are looking for tech management-related books, then *Staff Engineer* and *An Elegant Puzzle*, both by Will Larson would be a good starting point. Anything specific that you are looking for, in terms of the topics? Godan is Premchand's most mature work. Highly recommend completing it."
}