{
    "id": "14tal5j",
    "title": "Zee news criticising the gormint? This is not something i had expected to see in a life time",
    "url": "https://i.redd.it/tv22z6h2bkab1.jpg",
    "selftext": "Saw this news piece criticising the cm from the ruling party. Was shocked to see this, honestly. Is it because mr chaudhary is no longer with them or because they are trying to save their bankrupt a**!",
    "flair": "Politics",
    "score": 25,
    "num_comments": 3,
    "created_utc": 1688744049.0,
    "convurl": "https://i.redd.it/tv22z6h2bkab1.jpg",
    "comments": [
        "https://thewire.in/media/punya-prasun-bajpai-abp-news-narendra-modi\n\n>“Can you refrain from mentioning the name of Prime Minister Modi [in your programme]? Mention the names of his ministers by all means; point out anything amiss in a government policy if you want to, even name the minister of the concerned ministry. Just don’t refer to Prime Minister Modi anywhere.”\n\nThere is only one person that they cannot criticize. Rest are expendable.",
        "They must have not received the monthly \"payment\" . This is their way of informing that monthly payment is due."
    ],
    "cleaned_text": "zee news criticising gormint something expected see life time saw news piece criticising cm ruling party shocked see honestly mr chaudhary longer trying save bankrupt ",
    "cleaned_title": "zee news criticising gormint something expected see life time",
    "cleaned_selftext": "saw news piece criticising cm ruling party shocked see honestly mr chaudhary longer trying save bankrupt",
    "cleaned_comments": "refrain mentioning name prime minister modi programme mention names ministers means point anything amiss government policy want even name minister concerned ministry dont refer prime minister modi anywhere one person criticize rest expendable must received monthly payment way informing monthly payment due",
    "light_cleaned_title": "Zee news criticising the gormint? This is not something i had expected to see in a life time",
    "light_cleaned_selftext": "Saw this news piece criticising the cm from the ruling party. Was shocked to see this, honestly. Is it because mr chaudhary is no longer with them or because they are trying to save their bankrupt a**!",
    "light_cleaned_comments": ">“Can you refrain from mentioning the name of Prime Minister Modi [in your programme]? Mention the names of his ministers by all means; point out anything amiss in a government policy if you want to, even name the minister of the concerned ministry. Just don’t refer to Prime Minister Modi anywhere.” There is only one person that they cannot criticize. Rest are expendable. They must have not received the monthly \"payment\" . This is their way of informing that monthly payment is due."
}