{
    "id": "1dp4nkp",
    "title": "India's new criminal code states that only women can be r*ped. This is a massive setback that will leave male and transgender survivors of sexual abuse without legal recourse.",
    "url": "https://www.reddit.com/r/india/comments/1dp4nkp/indias_new_criminal_code_states_that_only_women/",
    "selftext": "We are regressing yet again in an age where we should be moving towards equity for all human and non-human beings. \n\n**Bharatiya Nyaya Sanhita 2023, the new official criminal code of India, is set to come into effect on 1 July, 2024.** \n\n# Bharatiya Nyaya Sanhita defines rape only as a situation where the perpetrator is a man, and the victim is a woman.\n\nModi Government ignored the recommendations of the Standing Committee on Home Affairs (246th report) which notes that the law has no provision for non-consensual sexual offences against males and transgender persons. The new criminal code also has no punishments for bestiality.\n\nWhat disgusts me a lot is that while there are detailed provisions for rape against girls (which are very needed). There is NOT EVEN A SINGLE MENTION of sexual abuse against boys in the entire code!\n\n**Every 1 in 2 children in India are sexually abused, and 53% of those abused are boys.**^(2)\n\n# Why is noone talking about this?! 😓\n\nTwo JDS party workers filed separate cases of sexual assault against politician Suraj Revanna. It's insanely courageous of these two men to come out publicly with this. But soon what recourse and protection will be there for the many men like him who are assaulted, not to mention transgender people?\n\nIndia stands to regress even further from being a constitutional democracy if the Bharatiya Nyay Sanhita 2023 goes into effect in its current inadequate form. A petition is being circulated to include provisions. I'm not sure it will actually change anything, but you can [see it here](https://www.change.org/p/bns-2023-ignores-sexual-crimes-against-men-and-transgender-persons?recruiter=172063649&recruited_by_id=c9509c60-5e77-11e4-9990-6f32f578132d&utm_source=share_petition&utm_campaign=petition_dashboard&utm_medium=copylink).\n\nPS: Yes, accused Suraj Revanna is the brother of that same disgraced MLA Prajwal Revanna who fled to Germany after he was outed as a serial rapist. Same guy who assaulted his elderly female household staff. \n\nSources:\n\n1. [Read the law yourself: Page 23, Chapter 5.](https://www.mha.gov.in/sites/default/files/250883_english_01042024.pdf)\n2. [Ministry of Women and Child Rights study on child sexual abuse in India.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5547862/#:~:text=In%202007%2C%20Ministry%20of%20Women,of%20boys%20abused%20was%2052.94%25)\n3. [Citizens for Justice and Peace's reportage on the new law.](https://cjp.org.in/new-rape-laws-leave-men-and-the-transgender-community-vulnerable/#:~:text=The%20Bharatiya%20Nyaya%20Samhita%2C%202023,the%20victim%20is%20a%20woman)",
    "flair": "Law & Courts",
    "score": 10,
    "num_comments": 0,
    "created_utc": 1719423715.0,
    "convurl": "https://external-preview.redd.it/EXspQU2TklNSokAdjYEVL76hj9J0_mn87xQ-0EnGBc8.jpg?auto=webp&s=8cf1ee9f264b053c16a636ad28606abca2a77304",
    "comments": [],
    "cleaned_text": "indias new criminal code states women rped massive setback leave male transgender survivors sexual abuse without legal recourse regressing yet age moving towards equity human nonhuman beings bharatiya nyaya sanhita new official criminal code india set come effect july bharatiya nyaya sanhita defines rape situation perpetrator man victim woman modi government ignored recommendations standing committee home affairs th report notes law provision nonconsensual sexual offences males transgender persons new criminal code also punishments bestiality disgusts lot detailed provisions rape girls needed even single mention sexual abuse boys entire code every children india sexually abused abused boys noone talking two jds party workers filed separate cases sexual assault politician suraj revanna insanely courageous two men come publicly soon recourse protection many men like assaulted mention transgender people india stands regress even constitutional democracy bharatiya nyay sanhita goes effect current inadequate form petition circulated include provisions im sure actually change anything see herehttpswwwchangeorgpbnsignoressexualcrimesagainstmenandtransgenderpersonsrecruiterrecruitedbyidcceeffdutmsourcesharepetitionutmcampaignpetitiondashboardutmmediumcopylink ps yes accused suraj revanna brother disgraced mla prajwal revanna fled germany outed serial rapist guy assaulted elderly female household staff sources read law page chapter httpswwwmhagovinsitesdefaultfilesenglishpdf ministry women child rights study child sexual abuse indiahttpswwwncbinlmnihgovpmcarticlespmctextincministryofwomenofboysabusedwas citizens justice peaces reportage new lawhttpscjporginnewrapelawsleavemenandthetransgendercommunityvulnerabletextthebharatiyanyayasamhitacthevictimisawoman ",
    "cleaned_title": "indias new criminal code states women rped massive setback leave male transgender survivors sexual abuse without legal recourse",
    "cleaned_selftext": "regressing yet age moving towards equity human nonhuman beings bharatiya nyaya sanhita new official criminal code india set come effect july bharatiya nyaya sanhita defines rape situation perpetrator man victim woman modi government ignored recommendations standing committee home affairs th report notes law provision nonconsensual sexual offences males transgender persons new criminal code also punishments bestiality disgusts lot detailed provisions rape girls needed even single mention sexual abuse boys entire code every children india sexually abused abused boys noone talking two jds party workers filed separate cases sexual assault politician suraj revanna insanely courageous two men come publicly soon recourse protection many men like assaulted mention transgender people india stands regress even constitutional democracy bharatiya nyay sanhita goes effect current inadequate form petition circulated include provisions im sure actually change anything see herehttpswwwchangeorgpbnsignoressexualcrimesagainstmenandtransgenderpersonsrecruiterrecruitedbyidcceeffdutmsourcesharepetitionutmcampaignpetitiondashboardutmmediumcopylink ps yes accused suraj revanna brother disgraced mla prajwal revanna fled germany outed serial rapist guy assaulted elderly female household staff sources read law page chapter httpswwwmhagovinsitesdefaultfilesenglishpdf ministry women child rights study child sexual abuse indiahttpswwwncbinlmnihgovpmcarticlespmctextincministryofwomenofboysabusedwas citizens justice peaces reportage new lawhttpscjporginnewrapelawsleavemenandthetransgendercommunityvulnerabletextthebharatiyanyayasamhitacthevictimisawoman",
    "cleaned_comments": "",
    "light_cleaned_title": "India's new criminal code states that only women can be r*ped. This is a massive setback that will leave male and transgender survivors of sexual abuse without legal recourse.",
    "light_cleaned_selftext": "We are regressing yet again in an age where we should be moving towards equity for all human and non-human beings. **Bharatiya Nyaya Sanhita 2023, the new official criminal code of India, is set to come into effect on 1 July, 2024.** # Bharatiya Nyaya Sanhita defines rape only as a situation where the perpetrator is a man, and the victim is a woman. Modi Government ignored the recommendations of the Standing Committee on Home Affairs (246th report) which notes that the law has no provision for non-consensual sexual offences against males and transgender persons. The new criminal code also has no punishments for bestiality. What disgusts me a lot is that while there are detailed provisions for rape against girls (which are very needed). There is NOT EVEN A SINGLE MENTION of sexual abuse against boys in the entire code! **Every 1 in 2 children in India are sexually abused, and 53% of those abused are boys.**^(2) # Why is noone talking about this?! 😓 Two JDS party workers filed separate cases of sexual assault against politician Suraj Revanna. It's insanely courageous of these two men to come out publicly with this. But soon what recourse and protection will be there for the many men like him who are assaulted, not to mention transgender people? India stands to regress even further from being a constitutional democracy if the Bharatiya Nyay Sanhita 2023 goes into effect in its current inadequate form. A petition is being circulated to include provisions. I'm not sure it will actually change anything, but you can [see it here](https://www.change.org/p/bns-2023-ignores-sexual-crimes-against-men-and-transgender-persons?recruiter=172063649&recruited_by_id=c9509c60-5e77-11e4-9990-6f32f578132d&utm_source=share_petition&utm_campaign=petition_dashboard&utm_medium=copylink). PS: Yes, accused Suraj Revanna is the brother of that same disgraced MLA Prajwal Revanna who fled to Germany after he was outed as a serial rapist. Same guy who assaulted his elderly female household staff. Sources: 1. [Read the law yourself: Page 23, Chapter 5.](https://www.mha.gov.in/sites/default/files/250883_english_01042024.pdf) 2. [Ministry of Women and Child Rights study on child sexual abuse in India.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5547862/#:~:text=In%202007%2C%20Ministry%20of%20Women,of%20boys%20abused%20was%2052.94%25) 3. [Citizens for Justice and Peace's reportage on the new law.](https://cjp.org.in/new-rape-laws-leave-men-and-the-transgender-community-vulnerable/#:~:text=The%20Bharatiya%20Nyaya%20Samhita%2C%202023,the%20victim%20is%20a%20woman)",
    "light_cleaned_comments": ""
}