{
    "id": "1fnqq8z",
    "title": "Imparting Sex Education & Awareness About POCSO Act Obligation Of Governments : Supreme Court",
    "url": "https://www.livelaw.in/top-stories/imparting-sex-education-awareness-about-pocso-act-obligation-of-governments-supreme-court-270453",
    "selftext": "Today, the Supreme Court has held that mere storage of “child sexual exploitative and abuse material\" (child pornography) without deleting or reporting the same would indicate the intention to transmit, and merely watching it without download would amount to \"possession\" under the Protection of Children from Sexual Offences Act, 2012 (POCSO Act).\n\nA bench comprising CJI DY Chandrachud and Justice JB Pardiwala has interpreted Sections 43 and 44 of the POCSO Act and held that it also entails imparting sex education and awareness amongst the general public. It held: \"We are of the considered view that the obligation of the appropriate government and the commission under Section(s) 43 and 44 of the POCSO respectively, does not end at just spreading awareness about the provisions of the POCSO.\"",
    "flair": "Law & Courts",
    "score": 9,
    "num_comments": 9,
    "created_utc": 1727113933.0,
    "convurl": "https://external-preview.redd.it/qtKwz9Vfb5U69Hx4V5X3JQDw-kitzctyZSey9Ikitfs.jpg?auto=webp&s=706734087caaab5136463dcb638555b660527a1a",
    "comments": [
        "It's all happening for a good reason so no one is gonna complain but it feels like an over reach of the judiciary. Isn't it the job of the legislature to make laws and this feels like the judiciary making the law into what they feel is right.",
        "Agree with the first part that we do need to intervene through education for real societal transformation. But POSCO is a draconian law and it won't help us. Remember what the Delhi rape perpetrators said in an interview? ",
        ">Remember what the Delhi rape perpetrators said in an interview\n\nNo, what did he say?",
        "I thought parliament enacted POCSO.",
        "Just before he was hanged he said that it was the girl's mistake that she was out late night !",
        "Oh yes. But how is it an argument against POCSO?",
        "I mean that a strict law is not going to get us anywhere. Education is perhaps the only solution, at least in my honest opinion.",
        "Explain how POCSO is 'draconian'?",
        "Government is useless. They can't even run one damn thing properly.",
        "Not supporting the claim but pointing out a major flaw which is practically misused. \n\nMakes consensual relations between minors a crime and becomes a tool for parents disapproving of relationships to exploit and ends up affecting the minors involved in a relationship unequally based on gender. \n\nThis is a case of statutory rape with both parties being minors and if the law is insisting that it be considered as such under POCSO it means that both parties raped each other. POCSO is gender neutral but the sentiment of men can't be raped permeates when it comes to the police framing charges. \n\nA Romeo - Juliet Ammendment is necessary."
    ],
    "cleaned_text": "imparting sex education awareness pocso act obligation governments supreme court today supreme court held mere storage child sexual exploitative abuse material child pornography without deleting reporting would indicate intention transmit merely watching without download would amount possession protection children sexual offences act pocso act bench comprising cji dy chandrachud justice jb pardiwala interpreted sections pocso act held also entails imparting sex education awareness amongst general public held considered view obligation appropriate government commission sections pocso respectively end spreading awareness provisions pocso ",
    "cleaned_title": "imparting sex education awareness pocso act obligation governments supreme court",
    "cleaned_selftext": "today supreme court held mere storage child sexual exploitative abuse material child pornography without deleting reporting would indicate intention transmit merely watching without download would amount possession protection children sexual offences act pocso act bench comprising cji dy chandrachud justice jb pardiwala interpreted sections pocso act held also entails imparting sex education awareness amongst general public held considered view obligation appropriate government commission sections pocso respectively end spreading awareness provisions pocso",
    "cleaned_comments": "happening good reason one gon na complain feels like reach judiciary isnt job legislature make laws feels like judiciary making law feel right agree first part need intervene education real societal transformation posco draconian law wont help us remember delhi rape perpetrators said interview remember delhi rape perpetrators said interview say thought parliament enacted pocso hanged said girls mistake late night oh yes argument pocso mean strict law going get us anywhere education perhaps solution least honest opinion explain pocso draconian government useless cant even run one damn thing properly supporting claim pointing major flaw practically misused makes consensual relations minors crime becomes tool parents disapproving relationships exploit ends affecting minors involved relationship unequally based gender case statutory rape parties minors law insisting considered pocso means parties raped pocso gender neutral sentiment men cant raped permeates comes police framing charges romeo juliet ammendment necessary",
    "light_cleaned_title": "Imparting Sex Education & Awareness About POCSO Act Obligation Of Governments : Supreme Court",
    "light_cleaned_selftext": "Today, the Supreme Court has held that mere storage of “child sexual exploitative and abuse material\" (child pornography) without deleting or reporting the same would indicate the intention to transmit, and merely watching it without download would amount to \"possession\" under the Protection of Children from Sexual Offences Act, 2012 (POCSO Act). A bench comprising CJI DY Chandrachud and Justice JB Pardiwala has interpreted Sections 43 and 44 of the POCSO Act and held that it also entails imparting sex education and awareness amongst the general public. It held: \"We are of the considered view that the obligation of the appropriate government and the commission under Section(s) 43 and 44 of the POCSO respectively, does not end at just spreading awareness about the provisions of the POCSO.\"",
    "light_cleaned_comments": "It's all happening for a good reason so no one is gonna complain but it feels like an over reach of the judiciary. Isn't it the job of the legislature to make laws and this feels like the judiciary making the law into what they feel is right. Agree with the first part that we do need to intervene through education for real societal transformation. But POSCO is a draconian law and it won't help us. Remember what the Delhi rape perpetrators said in an interview? >Remember what the Delhi rape perpetrators said in an interview No, what did he say? I thought parliament enacted POCSO. Just before he was hanged he said that it was the girl's mistake that she was out late night ! Oh yes. But how is it an argument against POCSO? I mean that a strict law is not going to get us anywhere. Education is perhaps the only solution, at least in my honest opinion. Explain how POCSO is 'draconian'? Government is useless. They can't even run one damn thing properly. Not supporting the claim but pointing out a major flaw which is practically misused. Makes consensual relations between minors a crime and becomes a tool for parents disapproving of relationships to exploit and ends up affecting the minors involved in a relationship unequally based on gender. This is a case of statutory rape with both parties being minors and if the law is insisting that it be considered as such under POCSO it means that both parties raped each other. POCSO is gender neutral but the sentiment of men can't be raped permeates when it comes to the police framing charges. A Romeo - Juliet Ammendment is necessary."
}