{
    "id": "14yayy6",
    "title": "How do you find a 'trustworthy' agent to bribe local officials?",
    "url": "https://www.reddit.com/r/india/comments/14yayy6/how_do_you_find_a_trustworthy_agent_to_bribe/",
    "selftext": "Firstly, I am not even going to suggest NO to bribe, because in some departments in local governments (e.g revenue department, housing, property registration, RTO etc) NOTHING will move unless you get a high-level recommendation or grease the palms. Fact of life. \n\nThe problem is simple - in today's digital era with cameras around, many officials are hesitant to take a direct bribe. Also, some of us feel queasy about offering a bribe. Therefore, most offices like RTO have an 'organized crime' system with a network of agents and touts sitting outside who will get work done for a fee. \n\nHowever, larger departments like urban property, land-records and revenue departments are more opaque and it is harder to find agents who can be trusted. This is a bigger challenge when the bribe/'fee' amount can run into lakhs.\n\nHow do you navigate the process? \n\n-------\n\nBefore you tell me 'take the legal route' get off the high-horse and just [read my story](\nhttps://www.thehindu.com/news/cities/bangalore/bengaluru-urban-dc-accused-of-violating-hc-order-over-issuance-of-khata/article66985535.ece)",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689223588.0,
    "convurl": "https://external-preview.redd.it/fZ-LkH51-tLfTZG9a_r18hQblPi0KLatlaUOsCZ0og8.jpg",
    "comments": [
        "Hello anti corruption bureau, this is not the way to do work. Come on atleast try something better.",
        "lol... BTW, did you read the linked story?",
        "For RTO there is always a photostate shop next to RTO office who is assigned for “chai”. They’ll act bossy at first to check your gut & then will get your job done i a week which could have taken months (yes months). Sad but true :/",
        "Yes. Busier RTOs have multiple Xerox shops that act as the network",
        "My friend whose trial allotment was in Sept. (he applied in June) was shifted to June itself by the photostate guy. I wonder are they given direct access to the RTO software or do they convey into someone inside of the office.\n\nThe “chai” was around 5x the licences fee, he needed in urgently & waiting till September was not the option."
    ],
    "cleaned_text": "find trustworthy agent bribe local officials firstly even going suggest bribe departments local governments eg revenue department housing property registration rto etc nothing move unless get highlevel recommendation grease palms fact life problem simple todays digital era cameras around many officials hesitant take direct bribe also us feel queasy offering bribe therefore offices like rto organized crime system network agents touts sitting outside get work done fee however larger departments like urban property landrecords revenue departments opaque harder find agents trusted bigger challenge bribefee amount run lakhs navigate process tell take legal route get highhorse read story ",
    "cleaned_title": "find trustworthy agent bribe local officials",
    "cleaned_selftext": "firstly even going suggest bribe departments local governments eg revenue department housing property registration rto etc nothing move unless get highlevel recommendation grease palms fact life problem simple todays digital era cameras around many officials hesitant take direct bribe also us feel queasy offering bribe therefore offices like rto organized crime system network agents touts sitting outside get work done fee however larger departments like urban property landrecords revenue departments opaque harder find agents trusted bigger challenge bribefee amount run lakhs navigate process tell take legal route get highhorse read story",
    "cleaned_comments": "hello anti corruption bureau way work come atleast try something better lol btw read linked story rto always photostate shop next rto office assigned chai theyll act bossy first check gut get job done week could taken months yes months sad true yes busier rtos multiple xerox shops act network friend whose trial allotment sept applied june shifted june photostate guy wonder given direct access rto software convey someone inside office chai around x licences fee needed urgently waiting till september option",
    "light_cleaned_title": "How do you find a 'trustworthy' agent to bribe local officials?",
    "light_cleaned_selftext": "Firstly, I am not even going to suggest NO to bribe, because in some departments in local governments (e.g revenue department, housing, property registration, RTO etc) NOTHING will move unless you get a high-level recommendation or grease the palms. Fact of life. The problem is simple - in today's digital era with cameras around, many officials are hesitant to take a direct bribe. Also, some of us feel queasy about offering a bribe. Therefore, most offices like RTO have an 'organized crime' system with a network of agents and touts sitting outside who will get work done for a fee. However, larger departments like urban property, land-records and revenue departments are more opaque and it is harder to find agents who can be trusted. This is a bigger challenge when the bribe/'fee' amount can run into lakhs. How do you navigate the process? ------- Before you tell me 'take the legal route' get off the high-horse and just [read my story](",
    "light_cleaned_comments": "Hello anti corruption bureau, this is not the way to do work. Come on atleast try something better. lol... BTW, did you read the linked story? For RTO there is always a photostate shop next to RTO office who is assigned for “chai”. They’ll act bossy at first to check your gut & then will get your job done i a week which could have taken months (yes months). Sad but true :/ Yes. Busier RTOs have multiple Xerox shops that act as the network My friend whose trial allotment was in Sept. (he applied in June) was shifted to June itself by the photostate guy. I wonder are they given direct access to the RTO software or do they convey into someone inside of the office. The “chai” was around 5x the licences fee, he needed in urgently & waiting till September was not the option."
}