{
    "id": "17d9o0b",
    "title": "Rant: I got cheated by Flipkart.",
    "url": "https://www.reddit.com/r/india/comments/17d9o0b/rant_i_got_cheated_by_flipkart/",
    "selftext": "I bought Elon Musk's biography from Flipkart and the seller sent me a counterfeit copy. Flipkart doesn't have a refund option only a replacement. WTF!\n\n&#x200B;\n\n&#x200B;\n\n[I bought Elon Musk's biography from Flipkart, and the seller sent me a counterfeit copy. Flipkart doesn't have a refund option, only a replacement. WTF!!](https://preview.redd.it/jqr76kltrlvb1.jpg?width=3024&format=pjpg&auto=webp&s=5b2ceb79d9175821a4ed44c68e4e09aba13ef521)",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697914635.0,
    "convurl": "https://a.thumbs.redditmedia.com/pPccZYeT6SKmUokF0q0EDyuYTuHXsHvejIN0FAWL9J8.jpg",
    "comments": [
        "Not a day goes by when I don't read a post about somebody getting scammed by Flipkart. Surprised why people still use that site.",
        "Just replace one or two times then you'll get a return option I returned a set of books the same way to Flipkart"
    ],
    "cleaned_text": "rant got cheated flipkart bought elon musks biography flipkart seller sent counterfeit copy flipkart doesnt refund option replacement wtf xb xb bought elon musks biography flipkart seller sent counterfeit copy flipkart doesnt refund option replacement wtfhttpspreviewredditjqrkltrlvbjpgwidthformatpjpgautowebpsbcebdaedceeabaef ",
    "cleaned_title": "rant got cheated flipkart",
    "cleaned_selftext": "bought elon musks biography flipkart seller sent counterfeit copy flipkart doesnt refund option replacement wtf xb xb bought elon musks biography flipkart seller sent counterfeit copy flipkart doesnt refund option replacement wtfhttpspreviewredditjqrkltrlvbjpgwidthformatpjpgautowebpsbcebdaedceeabaef",
    "cleaned_comments": "day goes dont read post somebody getting scammed flipkart surprised people still use site replace one two times youll get return option returned set books way flipkart",
    "light_cleaned_title": "Rant: I got cheated by Flipkart.",
    "light_cleaned_selftext": "I bought Elon Musk's biography from Flipkart and the seller sent me a counterfeit copy. Flipkart doesn't have a refund option only a replacement. WTF! &#x200B; &#x200B; [I bought Elon Musk's biography from Flipkart, and the seller sent me a counterfeit copy. Flipkart doesn't have a refund option, only a replacement. WTF!!](https://preview.redd.it/jqr76kltrlvb1.jpg?width=3024&format=pjpg&auto=webp&s=5b2ceb79d9175821a4ed44c68e4e09aba13ef521)",
    "light_cleaned_comments": "Not a day goes by when I don't read a post about somebody getting scammed by Flipkart. Surprised why people still use that site. Just replace one or two times then you'll get a return option I returned a set of books the same way to Flipkart"
}