{
    "id": "16hebl3",
    "title": "Indian exchange student killed by Seattle(US) police patrol car, jokes about it",
    "url": "https://www.reddit.com/r/india/comments/16hebl3/indian_exchange_student_killed_by_seattleus/",
    "selftext": "As if out of control gun violence was not enough already, USA even has police killing innocent civilians by running down people with their cars. And they are joking about it.\n\nTragic death, RIP to the victim and her family. I hope they get justice.\n\n>Newly-released bodycam footage shows a Seattle police officer audibly laughing and joking on a phone call the day after an incident where a fellow officer **had hit and killed a pedestrian with their patrol car**.  \n>  \n>The officer on the call is identified as Seattle Police Officers’ Guild Vice President Daniel Auderer. In it, Auderer can be heard speaking to SPOG President Mike Solan, as he talked about the incident where 23-year-old exchange student Jaahnavi Kandula was fatally hit by Officer Kevin Dave.  \n>  \n>Shortly after saying “she’s dead,” Auderer laughs and says “it’s a regular person,” referring to Kandula. He then says “just write a check -- $11,000, she was 26 anyway, she had limited value.”  \n>  \n>Auderer also mentions that Dave was “going 50 \\[miles an hour\\],” stating how “that’s not out of control” for a trained driver. A report released in June revealed that Dave was actually traveling at 74 miles an hour in a 25 mile an hour zone while responding to a different call.\n\n\\[[source](https://www.kiro7.com/news/local/video-shows-spd-cop-laughing-joking-about-pedestrian-killed-by-officer-hours-earlier/373KZLGIYVHD5B5ORS3WEOPG5U/)\\]",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694582584.0,
    "convurl": "https://external-preview.redd.it/GtKFOPBomMH1yyDW_35mv99Mg19Y8DIJnnDfyLRhwOg.jpg?auto=webp&s=abbf473515bbcddf436e78b63653a7f3b2b20227",
    "comments": [
        "What’s the difference between a police officer and a bullet? When a bullet kills someone else, you know it’s been fired",
        "She was 23 years old",
        "and the horrible thing is cops dont even pay blood money, its paid using taxpayer's money",
        "It's awful what happened. The dude is a piece of shit and should have never been a cop."
    ],
    "cleaned_text": "indian exchange student killed seattleus police patrol car jokes control gun violence enough already usa even police killing innocent civilians running people cars joking tragic death rip victim family hope get justice newlyreleased bodycam footage shows seattle police officer audibly laughing joking phone call day incident fellow officer hit killed pedestrian patrol car officer call identified seattle police officers guild vice president daniel auderer auderer heard speaking spog president mike solan talked incident yearold exchange student jaahnavi kandula fatally hit officer kevin dave shortly saying shes dead auderer laughs says regular person referring kandula says write check anyway limited value auderer also mentions dave going miles hour stating thats control trained driver report released june revealed dave actually traveling miles hour mile hour zone responding different call sourcehttpswwwkirocomnewslocalvideoshowsspdcoplaughingjokingaboutpedestriankilledbyofficerhoursearlierkzlgiyvhdborsweopgu ",
    "cleaned_title": "indian exchange student killed seattleus police patrol car jokes",
    "cleaned_selftext": "control gun violence enough already usa even police killing innocent civilians running people cars joking tragic death rip victim family hope get justice newlyreleased bodycam footage shows seattle police officer audibly laughing joking phone call day incident fellow officer hit killed pedestrian patrol car officer call identified seattle police officers guild vice president daniel auderer auderer heard speaking spog president mike solan talked incident yearold exchange student jaahnavi kandula fatally hit officer kevin dave shortly saying shes dead auderer laughs says regular person referring kandula says write check anyway limited value auderer also mentions dave going miles hour stating thats control trained driver report released june revealed dave actually traveling miles hour mile hour zone responding different call sourcehttpswwwkirocomnewslocalvideoshowsspdcoplaughingjokingaboutpedestriankilledbyofficerhoursearlierkzlgiyvhdborsweopgu",
    "cleaned_comments": "whats difference police officer bullet bullet kills someone else know fired years old horrible thing cops dont even pay blood money paid using taxpayers money awful happened dude piece shit never cop",
    "light_cleaned_title": "Indian exchange student killed by Seattle(US) police patrol car, jokes about it",
    "light_cleaned_selftext": "As if out of control gun violence was not enough already, USA even has police killing innocent civilians by running down people with their cars. And they are joking about it. Tragic death, RIP to the victim and her family. I hope they get justice. >Newly-released bodycam footage shows a Seattle police officer audibly laughing and joking on a phone call the day after an incident where a fellow officer **had hit and killed a pedestrian with their patrol car**. > >The officer on the call is identified as Seattle Police Officers’ Guild Vice President Daniel Auderer. In it, Auderer can be heard speaking to SPOG President Mike Solan, as he talked about the incident where 23-year-old exchange student Jaahnavi Kandula was fatally hit by Officer Kevin Dave. > >Shortly after saying “she’s dead,” Auderer laughs and says “it’s a regular person,” referring to Kandula. He then says “just write a check -- $11,000, she was 26 anyway, she had limited value.” > >Auderer also mentions that Dave was “going 50 \\[miles an hour\\],” stating how “that’s not out of control” for a trained driver. A report released in June revealed that Dave was actually traveling at 74 miles an hour in a 25 mile an hour zone while responding to a different call. \\[[source](https://www.kiro7.com/news/local/video-shows-spd-cop-laughing-joking-about-pedestrian-killed-by-officer-hours-earlier/373KZLGIYVHD5B5ORS3WEOPG5U/)\\]",
    "light_cleaned_comments": "What’s the difference between a police officer and a bullet? When a bullet kills someone else, you know it’s been fired She was 23 years old and the horrible thing is cops dont even pay blood money, its paid using taxpayer's money It's awful what happened. The dude is a piece of shit and should have never been a cop."
}