{
    "id": "17jy98g",
    "title": "The Aadhar card data has been leaked to dark web.",
    "url": "https://www.reddit.com/r/india/comments/17jy98g/the_aadhar_card_data_has_been_leaked_to_dark_web/",
    "selftext": " On October 9th, a threat actor going by the alias **‘pwn0001’** posted a thread on Breach Forums brokering access to 815 million “Indian Citizen Aadhaar & Passport” records. To put this victim group in perspective, India’s entire population is just over 1.486 billion people.\n\n[source](https://www.resecurity.com/blog/article/pii-belonging-to-indian-citizens-including-their-aadhaar-ids-offered-for-sale-on-the-dark-web)\n\nhttps://preview.redd.it/0y3pl26hgdxb1.png?width=1681&format=png&auto=webp&s=dab0465c8716996afb2d64c4f6aceffa4cc96360",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698685642.0,
    "convurl": "https://b.thumbs.redditmedia.com/VuwJuR9ohc8zdE3QkcxVvOsOaXmr9MngaCW-zTcGP2I.jpg",
    "comments": [
        "I guess the wall didn't work",
        "Is it possible to sue the Indian government for failing to protect our sensitive information?",
        "Is it possible to sue the Indian government for failing to protect our sensitive information?",
        "The Indian government is a broad term. I guess a case can be filed against UIDAI in supreme court for leaking sensitive information but considering the current system that case will not go anywhere.",
        "wanna know the same.",
        "U might wanna blur tht image, there's names and phones numbers visible......",
        "So we can't hold any asshole responsible for this accountable. My full name is so unique I'm damn sure I am the only one with that name. So anyone who buys this data can ctrl f my name and can get my address, phone, passport details and stuff. I feel like my dress is torn apart by Modiji on top of Redfort and he is making the world see my naked butt.",
        "13 whole feet of it. \n\nIncidentally when the government was telling the court there was a 13 ft wall protecting your data, it forgot to mention that that wall was only in the front. The back of the yidai headquarters was protected by a wasteland where people dumped their construction ruble in a swamp and a 5ft tall wall.",
        "It's certainly possible to file cases against the government and the uidai for contempt of court for lying to the supreme court saying the system was foolproof.",
        "OK, Christopher Mohammed sanatan akbar, chill. Nothings gonna happen supreme leader will not take criticism. This is Amrit kaal. Nothing bad will happen to India.",
        "Why isn't it in the limelight already? Some random religious dude makes a statement and it's all over the internet, but not something as serious as this?",
        "Some form of accountability is definitely possible if we generate enough public outcry about it.",
        "Do you think Indian mainstream media has 'Zameer' or sense of responsibility? TRP is all what matters. Also showing failure of govt! LOL cant imagine in 2023.",
        "Indian media has its head up BJPs a$$. In any other country, such news warrants a resignation of its country's head.",
        "OP how much was it going for?\nI really wanna know the price for the privacy of so many people.",
        "Exactly, I cannot find it in today's newspapers. I would guess since its election time, all news where Govt is in bad light is likely to be suppressed.",
        "It's not media it's the people. If people weren't like that godi media would be running at a loss",
        "I think for $80,000 which is roughly 66 lakh INR. I'd wager someone has already bought it.",
        "IT minister gadhe ko resign kardena chahiye",
        "L corrupted indian government",
        "There will now be a question in the parliament regarding this.\n\nGovernment response: There is no evidence of any Bhartiya citizen enrolled in the scheme called \"Aadhaar\".",
        "Can someone give me context on the wall? Or is it referring to firewall?",
        "Idk why but i assumed it must be 10+cr inr at the very least",
        "Bhakts will work as a firewall against the outcry",
        "Baad mai pata chalega IT minister ne bhi aapna hissa liya h",
        "Hello mitro....",
        "They would say adhaar is voluntary and it's people's fault to make adhaar",
        "I'm not surprised 🙂",
        "The problem is most of the Indian population is not going to realize the severity of this.\n\nThey will be like \"Toh kya, bas aadhar hi to hai, isme kaunsi badi baat hogayi\"",
        "Maybe if you (or anti-Bhakts in general) tried to convince them, instead of dismissing them using slurs, we could actually move ahead with the outcry.",
        "Damn I thought will be around $1000.",
        "Just think why are they called aandh bhakts, unke saamne bolna bhi paap h unke according. And honestly, jyaada political debate karni bhi nhi chahiye with people you are close with",
        "Oh yes our personal information is worth 0.85 paise (yes paise, not rupees)",
        "Explain the severity and possible consequences",
        "Quick Google search threw this up  [AG emphasises on Aadhaar data centre’s physical security, Twitter mocks (thenewsminute.com)](https://www.thenewsminute.com/news/ag-emphasises-aadhaar-data-centre-s-physical-security-twitter-mocks-78395)",
        "Is there a way to check our personal data was in there like ik many people have been targeted I wanna know is any of my info is out there",
        "I think if the guy was selling something regarding cows the modi government might be interested or at least started an investigation",
        "Is it possible that someone hacked the database?",
        "Shit country man I'm leaving it.",
        "It has your address and passport and address is the privacy concern"
    ],
    "cleaned_text": "aadhar card data leaked dark web october th threat actor going alias pwn posted thread breach forums brokering access million indian citizen aadhaar passport records put victim group perspective indias entire population billion people sourcehttpswwwresecuritycomblogarticlepiibelongingtoindiancitizensincludingtheiraadhaaridsofferedforsaleonthedarkweb ",
    "cleaned_title": "aadhar card data leaked dark web",
    "cleaned_selftext": "october th threat actor going alias pwn posted thread breach forums brokering access million indian citizen aadhaar passport records put victim group perspective indias entire population billion people sourcehttpswwwresecuritycomblogarticlepiibelongingtoindiancitizensincludingtheiraadhaaridsofferedforsaleonthedarkweb",
    "cleaned_comments": "guess wall didnt work possible sue indian government failing protect sensitive information possible sue indian government failing protect sensitive information indian government broad term guess case filed uidai supreme court leaking sensitive information considering current system case go anywhere wan na know u might wan na blur tht image theres names phones numbers visible cant hold asshole responsible accountable full name unique im damn sure one name anyone buys data ctrl f name get address phone passport details stuff feel like dress torn apart modiji top redfort making world see naked butt whole feet incidentally government telling court ft wall protecting data forgot mention wall front back yidai headquarters protected wasteland people dumped construction ruble swamp ft tall wall certainly possible file cases government uidai contempt court lying supreme court saying system foolproof ok christopher mohammed sanatan akbar chill nothings gon na happen supreme leader take criticism amrit kaal nothing bad happen india isnt limelight already random religious dude makes statement internet something serious form accountability definitely possible generate enough public outcry think indian mainstream media zameer sense responsibility trp matters also showing failure govt lol cant imagine indian media head bjps country news warrants resignation countrys head op much going really wan na know price privacy many people exactly find todays newspapers would guess since election time news govt bad light likely suppressed media people people werent like godi media would running loss think roughly lakh inr id wager someone already bought minister gadhe ko resign kardena chahiye l corrupted indian government question parliament regarding government response evidence bhartiya citizen enrolled scheme called aadhaar someone give context wall referring firewall idk assumed must cr inr least bhakts work firewall outcry baad mai pata chalega minister ne bhi aapna hissa liya h hello mitro would say adhaar voluntary peoples fault make adhaar im surprised problem indian population going realize severity like toh kya bas aadhar hi hai isme kaunsi badi baat hogayi maybe antibhakts general tried convince instead dismissing using slurs could actually move ahead outcry damn thought around think called aandh bhakts unke saamne bolna bhi paap h unke according honestly jyaada political debate karni bhi nhi chahiye people close oh yes personal information worth paise yes paise rupees explain severity possible consequences quick google search threw ag emphasises aadhaar data centres physical security twitter mocks thenewsminutecomhttpswwwthenewsminutecomnewsagemphasisesaadhaardatacentresphysicalsecuritytwittermocks way check personal data like ik many people targeted wan na know info think guy selling something regarding cows modi government might interested least started investigation possible someone hacked database shit country man im leaving address passport address privacy concern",
    "light_cleaned_title": "The Aadhar card data has been leaked to dark web.",
    "light_cleaned_selftext": "On October 9th, a threat actor going by the alias **‘pwn0001’** posted a thread on Breach Forums brokering access to 815 million “Indian Citizen Aadhaar & Passport” records. To put this victim group in perspective, India’s entire population is just over 1.486 billion people. [source](https://www.resecurity.com/blog/article/pii-belonging-to-indian-citizens-including-their-aadhaar-ids-offered-for-sale-on-the-dark-web)",
    "light_cleaned_comments": "I guess the wall didn't work Is it possible to sue the Indian government for failing to protect our sensitive information? Is it possible to sue the Indian government for failing to protect our sensitive information? The Indian government is a broad term. I guess a case can be filed against UIDAI in supreme court for leaking sensitive information but considering the current system that case will not go anywhere. wanna know the same. U might wanna blur tht image, there's names and phones numbers visible...... So we can't hold any asshole responsible for this accountable. My full name is so unique I'm damn sure I am the only one with that name. So anyone who buys this data can ctrl f my name and can get my address, phone, passport details and stuff. I feel like my dress is torn apart by Modiji on top of Redfort and he is making the world see my naked butt. 13 whole feet of it. Incidentally when the government was telling the court there was a 13 ft wall protecting your data, it forgot to mention that that wall was only in the front. The back of the yidai headquarters was protected by a wasteland where people dumped their construction ruble in a swamp and a 5ft tall wall. It's certainly possible to file cases against the government and the uidai for contempt of court for lying to the supreme court saying the system was foolproof. OK, Christopher Mohammed sanatan akbar, chill. Nothings gonna happen supreme leader will not take criticism. This is Amrit kaal. Nothing bad will happen to India. Why isn't it in the limelight already? Some random religious dude makes a statement and it's all over the internet, but not something as serious as this? Some form of accountability is definitely possible if we generate enough public outcry about it. Do you think Indian mainstream media has 'Zameer' or sense of responsibility? TRP is all what matters. Also showing failure of govt! LOL cant imagine in 2023. Indian media has its head up BJPs a$$. In any other country, such news warrants a resignation of its country's head. OP how much was it going for? I really wanna know the price for the privacy of so many people. Exactly, I cannot find it in today's newspapers. I would guess since its election time, all news where Govt is in bad light is likely to be suppressed. It's not media it's the people. If people weren't like that godi media would be running at a loss I think for $80,000 which is roughly 66 lakh INR. I'd wager someone has already bought it. IT minister gadhe ko resign kardena chahiye L corrupted indian government There will now be a question in the parliament regarding this. Government response: There is no evidence of any Bhartiya citizen enrolled in the scheme called \"Aadhaar\". Can someone give me context on the wall? Or is it referring to firewall? Idk why but i assumed it must be 10+cr inr at the very least Bhakts will work as a firewall against the outcry Baad mai pata chalega IT minister ne bhi aapna hissa liya h Hello mitro.... They would say adhaar is voluntary and it's people's fault to make adhaar I'm not surprised 🙂 The problem is most of the Indian population is not going to realize the severity of this. They will be like \"Toh kya, bas aadhar hi to hai, isme kaunsi badi baat hogayi\" Maybe if you (or anti-Bhakts in general) tried to convince them, instead of dismissing them using slurs, we could actually move ahead with the outcry. Damn I thought will be around $1000. Just think why are they called aandh bhakts, unke saamne bolna bhi paap h unke according. And honestly, jyaada political debate karni bhi nhi chahiye with people you are close with Oh yes our personal information is worth 0.85 paise (yes paise, not rupees) Explain the severity and possible consequences Quick Google search threw this up [AG emphasises on Aadhaar data centre’s physical security, Twitter mocks (thenewsminute.com)](https://www.thenewsminute.com/news/ag-emphasises-aadhaar-data-centre-s-physical-security-twitter-mocks-78395) Is there a way to check our personal data was in there like ik many people have been targeted I wanna know is any of my info is out there I think if the guy was selling something regarding cows the modi government might be interested or at least started an investigation Is it possible that someone hacked the database? Shit country man I'm leaving it. It has your address and passport and address is the privacy concern"
}