{
    "id": "1cgyove",
    "title": "Prajwal Revanna case: BJP says ‘no authority over ally’, asks what did state Congress govt do",
    "url": "https://indianexpress.com/article/political-pulse/prajwal-revanna-case-bjp-asks-what-did-state-congress-govt-do-9299675/",
    "selftext": "The BJP can not shirk responsibility in letting the person contest the Election. Is the 'Chanakya' Amit Shah and the 'mighty' BJP so incompetent?\n\nAnd yet, he is not wrong about the Congress State government failing to act on it properly. Remember, JD(S) was a Congress ally in earlier government and could very well have been in the current one too if Congress hadn't won clear majority. \n\nMultiple parties and governments have wilfully turned a blind eye to an heinous Act and now that it's been exposed they are more than happy to turn it into a political blame game rather than take some actual coercive action. ",
    "flair": "Crime",
    "score": 6,
    "num_comments": 3,
    "created_utc": 1714498557.0,
    "convurl": "https://external-preview.redd.it/G6dwoE4JiSXQxrKKSOK35MO7oVq-Zd00Pht8wfc-j-M.jpg?auto=webp&s=28e0bc3ea150c09f413e1269e93c7098a9bbeda9",
    "comments": [
        "Your PM asked for vote for tbis guy and did a rally for him even when you knew existence of a pen drive. You still chose to share a stage with him",
        "BJP : Prajwal Revanna Who? We don't know anyone."
    ],
    "cleaned_text": "prajwal revanna case bjp says authority ally asks state congress govt bjp shirk responsibility letting person contest election chanakya amit shah mighty bjp incompetent yet wrong congress state government failing act properly remember jds congress ally earlier government could well current one congress hadnt clear majority multiple parties governments wilfully turned blind eye heinous act exposed happy turn political blame game rather take actual coercive action ",
    "cleaned_title": "prajwal revanna case bjp says authority ally asks state congress govt",
    "cleaned_selftext": "bjp shirk responsibility letting person contest election chanakya amit shah mighty bjp incompetent yet wrong congress state government failing act properly remember jds congress ally earlier government could well current one congress hadnt clear majority multiple parties governments wilfully turned blind eye heinous act exposed happy turn political blame game rather take actual coercive action",
    "cleaned_comments": "pm asked vote tbis guy rally even knew existence pen drive still chose share stage bjp prajwal revanna dont know anyone",
    "light_cleaned_title": "Prajwal Revanna case: BJP says ‘no authority over ally’, asks what did state Congress govt do",
    "light_cleaned_selftext": "The BJP can not shirk responsibility in letting the person contest the Election. Is the 'Chanakya' Amit Shah and the 'mighty' BJP so incompetent? And yet, he is not wrong about the Congress State government failing to act on it properly. Remember, JD(S) was a Congress ally in earlier government and could very well have been in the current one too if Congress hadn't won clear majority. Multiple parties and governments have wilfully turned a blind eye to an heinous Act and now that it's been exposed they are more than happy to turn it into a political blame game rather than take some actual coercive action.",
    "light_cleaned_comments": "Your PM asked for vote for tbis guy and did a rally for him even when you knew existence of a pen drive. You still chose to share a stage with him BJP : Prajwal Revanna Who? We don't know anyone."
}