{
    "id": "1ebtzeh",
    "title": "Son ‘died in fake encounter’, woman dies awaiting justice; probe officer found no time to appear before court for 12 years",
    "url": "https://indianexpress.com/article/india/son-died-in-fake-encounter-woman-dies-awaiting-justice-probe-officer-found-no-time-to-appear-before-court-for-12-years-9473992/",
    "selftext": "Madhya Pradesh HC imposes cost of Rs 1 lakh on state, observes it is “nothing but insensitivity on the part of the police department”.",
    "flair": "Law & Courts",
    "score": 382,
    "num_comments": 22,
    "created_utc": 1721911548.0,
    "convurl": "https://external-preview.redd.it/CFyJt9vO6_vemqV7Pwe5Kk4bcaCIEa1qYXU6_fsLjJo.jpg?auto=webp&s=2af5e4a4255e520628d08218511c1c238331486a",
    "comments": [
        "There is no justice for poor in India, not from the administration, police or from the courts. Makes me afraid sometimes ngl.",
        "1 Lakh?! How will 1 lakh help here?",
        "Don’t you know? It is enough to bring the woman and her son back from their death and also enough to make them pay their current taxes.",
        "Imagine your son dying an unjustified death, and in the process of finding justice for him, you had to wait so long that you also die without even hearing a semblance of justice.\n\n\nThat is actual hell. Something about how drawn out this is is truly fucked.",
        "Our legal system from police to the judiciary is just fucked up.",
        "Vishwaguru moment ? Everything is wrong in this country.",
        "There is no justice in India, anyone can get away with anything. When 1% Indians understand this, India will change for better.",
        "It's not just about Modi or bjp, our legal system has been like this for a long period. We need some serious reforms.",
        "Gundaraj",
        "Never took any political name. But hate when someone starts chest thumping as if we are above all countries doing godly things.",
        "Yeah I agree with you, but this post wasn't about this.",
        "no justice for people",
        "Humanity is a lost cause.",
        "Indian legal system - from the grassroot level police to court, everything is fucked beyond imagination. I don't think she will get justice for her son's death. It has been 12 years, I can't even imagine what pain a mother had to go through for his son's unjustified death. There is no justice in India, if you do not have political links it's nearly impossible to get anything done.  This is so sad, it sucks that we can't even do anything about it.",
        "She has died btw while waiting for justice to be served. Heartbreaking honestly. There are so many similar cases like this eg the faizan case which is also in the news recently. Police and judiciary both are fucked up tbh.",
        "Very painful.",
        "Oh no, may she rest in peace. I literally have tears in my eyes as I type this. I wonder how many people have to go through this harassment in India daily asking for justice. Politicians and their relatives get away with disgusting crimes like rape and murder but an innocent poor Indian doesn't get justice. I have no hopes from this country anymore. This is inhumane.\n\nI have seen people getting away with rape, murder, fraud and what not just because of their political links. It honestly breaks my heart and infuriates me so much, but what can we even do - we are helpless. If we try to speak against these politicians or police officers they'll just lodge a fake case against us and put us in jail. They have done the same with a lot of journalists who tried exposing them. Worst case scenario, the politicians will use their goon to wipe the person who speaks against them out. Police won't even do anything because the police are just the puppet of politicians.",
        " Oh no, may she rest in peace. I literally have tears in my eyes as I type this. I wonder how many people have to go through this harassment in India daily asking for justice. Politicians and their relatives get away with disgusting crimes like rape and murder but an innocent poor Indian doesn't get justice. I have no hopes from this country anymore. This is inhumane.\n\nI have seen people getting away with rape, murder, fraud and what not just because of their political links. It honestly breaks my heart and infuriates me so much, but what can we even do - we are helpless. If we try to speak against these politicians or police officers they'll just lodge a fake case against us and put us in jail. They have done the same with a lot of journalists who tried exposing them. Worst case scenario, the politicians will use their goon to wipe the person who speaks against them out. Police won't even do anything because the police are just the puppet of politicians.",
        "Forget about us normal peeps. Even sitting chief Ministers are in jail without any evidence and trials.",
        "And Modi & bhakts take pride in claiming India is world's \"largest democracy\". It's borderline dictatorship and fascism.",
        "The legal system is a mess,and it's the system problem,people working in it are a whole different breed altogether 💀",
        "How TF can you put a man in jail without any warrant or sentence?"
    ],
    "cleaned_text": "son died fake encounter woman dies awaiting justice probe officer found time appear court years madhya pradesh hc imposes cost rs lakh state observes nothing insensitivity part police department ",
    "cleaned_title": "son died fake encounter woman dies awaiting justice probe officer found time appear court years",
    "cleaned_selftext": "madhya pradesh hc imposes cost rs lakh state observes nothing insensitivity part police department",
    "cleaned_comments": "justice poor india administration police courts makes afraid sometimes ngl lakh lakh help dont know enough bring woman son back death also enough make pay current taxes imagine son dying unjustified death process finding justice wait long also die without even hearing semblance justice actual hell something drawn truly fucked legal system police judiciary fucked vishwaguru moment everything wrong country justice india anyone get away anything indians understand india change better modi bjp legal system like long period need serious reforms gundaraj never took political name hate someone starts chest thumping countries godly things yeah agree post wasnt justice people humanity lost cause indian legal system grassroot level police court everything fucked beyond imagination dont think get justice sons death years cant even imagine pain mother go sons unjustified death justice india political links nearly impossible get anything done sad sucks cant even anything died btw waiting justice served heartbreaking honestly many similar cases like eg faizan case also news recently police judiciary fucked tbh painful oh may rest peace literally tears eyes type wonder many people go harassment india daily asking justice politicians relatives get away disgusting crimes like rape murder innocent poor indian doesnt get justice hopes country anymore inhumane seen people getting away rape murder fraud political links honestly breaks heart infuriates much even helpless try speak politicians police officers theyll lodge fake case us put us jail done lot journalists tried exposing worst case scenario politicians use goon wipe person speaks police wont even anything police puppet politicians oh may rest peace literally tears eyes type wonder many people go harassment india daily asking justice politicians relatives get away disgusting crimes like rape murder innocent poor indian doesnt get justice hopes country anymore inhumane seen people getting away rape murder fraud political links honestly breaks heart infuriates much even helpless try speak politicians police officers theyll lodge fake case us put us jail done lot journalists tried exposing worst case scenario politicians use goon wipe person speaks police wont even anything police puppet politicians forget us normal peeps even sitting chief ministers jail without evidence trials modi bhakts take pride claiming india worlds largest democracy borderline dictatorship fascism legal system messand system problempeople working whole different breed altogether tf put man jail without warrant sentence",
    "light_cleaned_title": "Son ‘died in fake encounter’, woman dies awaiting justice; probe officer found no time to appear before court for 12 years",
    "light_cleaned_selftext": "Madhya Pradesh HC imposes cost of Rs 1 lakh on state, observes it is “nothing but insensitivity on the part of the police department”.",
    "light_cleaned_comments": "There is no justice for poor in India, not from the administration, police or from the courts. Makes me afraid sometimes ngl. 1 Lakh?! How will 1 lakh help here? Don’t you know? It is enough to bring the woman and her son back from their death and also enough to make them pay their current taxes. Imagine your son dying an unjustified death, and in the process of finding justice for him, you had to wait so long that you also die without even hearing a semblance of justice. That is actual hell. Something about how drawn out this is is truly fucked. Our legal system from police to the judiciary is just fucked up. Vishwaguru moment ? Everything is wrong in this country. There is no justice in India, anyone can get away with anything. When 1% Indians understand this, India will change for better. It's not just about Modi or bjp, our legal system has been like this for a long period. We need some serious reforms. Gundaraj Never took any political name. But hate when someone starts chest thumping as if we are above all countries doing godly things. Yeah I agree with you, but this post wasn't about this. no justice for people Humanity is a lost cause. Indian legal system - from the grassroot level police to court, everything is fucked beyond imagination. I don't think she will get justice for her son's death. It has been 12 years, I can't even imagine what pain a mother had to go through for his son's unjustified death. There is no justice in India, if you do not have political links it's nearly impossible to get anything done. This is so sad, it sucks that we can't even do anything about it. She has died btw while waiting for justice to be served. Heartbreaking honestly. There are so many similar cases like this eg the faizan case which is also in the news recently. Police and judiciary both are fucked up tbh. Very painful. Oh no, may she rest in peace. I literally have tears in my eyes as I type this. I wonder how many people have to go through this harassment in India daily asking for justice. Politicians and their relatives get away with disgusting crimes like rape and murder but an innocent poor Indian doesn't get justice. I have no hopes from this country anymore. This is inhumane. I have seen people getting away with rape, murder, fraud and what not just because of their political links. It honestly breaks my heart and infuriates me so much, but what can we even do - we are helpless. If we try to speak against these politicians or police officers they'll just lodge a fake case against us and put us in jail. They have done the same with a lot of journalists who tried exposing them. Worst case scenario, the politicians will use their goon to wipe the person who speaks against them out. Police won't even do anything because the police are just the puppet of politicians. Oh no, may she rest in peace. I literally have tears in my eyes as I type this. I wonder how many people have to go through this harassment in India daily asking for justice. Politicians and their relatives get away with disgusting crimes like rape and murder but an innocent poor Indian doesn't get justice. I have no hopes from this country anymore. This is inhumane. I have seen people getting away with rape, murder, fraud and what not just because of their political links. It honestly breaks my heart and infuriates me so much, but what can we even do - we are helpless. If we try to speak against these politicians or police officers they'll just lodge a fake case against us and put us in jail. They have done the same with a lot of journalists who tried exposing them. Worst case scenario, the politicians will use their goon to wipe the person who speaks against them out. Police won't even do anything because the police are just the puppet of politicians. Forget about us normal peeps. Even sitting chief Ministers are in jail without any evidence and trials. And Modi & bhakts take pride in claiming India is world's \"largest democracy\". It's borderline dictatorship and fascism. The legal system is a mess,and it's the system problem,people working in it are a whole different breed altogether 💀 How TF can you put a man in jail without any warrant or sentence?"
}