{
    "id": "176shgo",
    "title": "Is this Depressing or Enlightening or both for you?",
    "url": "https://i.redd.it/88ylt0oz1xtb1.jpg",
    "selftext": "Looking at everything thats happening around us, this perspective is both enlightening and depressing at the same time for me..",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1697179494.0,
    "convurl": "https://i.redd.it/88ylt0oz1xtb1.jpg",
    "comments": [
        "It really puts all our petty dramas into perspective.   And the original image that caused him to say this is even tinier, the Earth is just a tiny speck of dust in the image. It's called the [Pale Blue Dot](https://news.cornell.edu/stories/2020/02/iconic-pale-blue-dot-photo-carl-sagans-idea-turns-30).",
        "enlightening..…i really admire carl sagan, one of the greatest minds and scientists of our generation…cosmos is one of my favorite video series….",
        "Idk how I feel about this but I remember reading somewhere that Pluto hadn't completed one orbit around the sun when it lost its planet status. imagine if you're trying your best but your road is so long and you're so small and a little bit slow and everyone is just  \"you know what, you're not good enough. out.\"",
        "This is more of a call to action to not be lost in your situations/problems. No one exists in a vacuum.",
        "https://preview.redd.it/ysvwidcn9ytb1.jpeg?width=557&format=pjpg&auto=webp&s=187b13a68997dcef3cdc4b0e64cf85b14ae9fdce\n\nThe actual picture that's relevant to this quote",
        "Its humbling.\n\nWe (and all our problems) are but a tiny speck."
    ],
    "cleaned_text": "depressing enlightening looking everything thats happening around us perspective enlightening depressing time ",
    "cleaned_title": "depressing enlightening",
    "cleaned_selftext": "looking everything thats happening around us perspective enlightening depressing time",
    "cleaned_comments": "really puts petty dramas perspective original image caused say even tinier earth tiny speck dust image called pale blue dothttpsnewscornelledustoriesiconicpalebluedotphotocarlsagansideaturns enlighteningi really admire carl sagan one greatest minds scientists generationcosmos one favorite video series idk feel remember reading somewhere pluto hadnt completed one orbit around sun lost planet status imagine youre trying best road long youre small little bit slow everyone know youre good enough call action lost situationsproblems one exists vacuum actual picture thats relevant quote humbling problems tiny speck",
    "light_cleaned_title": "Is this Depressing or Enlightening or both for you?",
    "light_cleaned_selftext": "Looking at everything thats happening around us, this perspective is both enlightening and depressing at the same time for me..",
    "light_cleaned_comments": "It really puts all our petty dramas into perspective. And the original image that caused him to say this is even tinier, the Earth is just a tiny speck of dust in the image. It's called the [Pale Blue Dot](https://news.cornell.edu/stories/2020/02/iconic-pale-blue-dot-photo-carl-sagans-idea-turns-30). enlightening..…i really admire carl sagan, one of the greatest minds and scientists of our generation…cosmos is one of my favorite video series…. Idk how I feel about this but I remember reading somewhere that Pluto hadn't completed one orbit around the sun when it lost its planet status. imagine if you're trying your best but your road is so long and you're so small and a little bit slow and everyone is just \"you know what, you're not good enough. out.\" This is more of a call to action to not be lost in your situations/problems. No one exists in a vacuum. The actual picture that's relevant to this quote Its humbling. We (and all our problems) are but a tiny speck."
}