{
    "id": "1ef4eri",
    "title": "Remember the Pune Porsche Crash Case? Yea well, me neither. Here's a little update.",
    "url": "https://www.reddit.com/r/india/comments/1ef4eri/remember_the_pune_porsche_crash_case_yea_well_me/",
    "selftext": "We forget too quickly. The internet was screaming to give justice by punishing the allegedly drunk kid who allegedly was driving and allegedly crashed into two innocent people. The kid who was released even before the bodies of victims were cremated by their [families](https://www.thequint.com/news/india/pune-porsche-car-accident-victim-aneesh-awdhiya-mother-savita-justice-minor-punishment). Then there were attempts to sabotage the evidences and bail conditions which became a field day for memes.  \n  \nBut then we got new things to talk about. The Ambani weddings, the Olympics and what not. \n\nHere are some recent articles on what happened after the internet forgot:  \n  \n1. No name of teen in the 900-page chargesheet filed by police recently - [Times Now Article](https://www.timesnownews.com/pune/pune-news-porsche-crash-case-in-900-page-chargesheet-filed-by-police-against-7-accused-teen-not-mentioned-article-112048568)  \n2. Accused submits the required essay on July 3 (For reference car crash was on May 19 and the order for bail was given on June 25) - [Indian Express Article](https://indianexpress.com/article/cities/pune/minor-in-porsche-case-complies-with-bail-conditions-submits-essay-on-road-accidents-9433586/#:~:text=In%20the%20early%20hours%20of,Aneesh%20Awadhiya%20and%20Ashwini%20Koshta) - Yes the memes came before the essay did.  \n3. Maharashtra Women and Child Development Panel recommends actions against JJB members (people who gave bail and bail conditions) for lapses in procedures - [The Hindu Article](https://www.thehindu.com/news/national/maharashtra/porsche-crash-wcd-panel-recommends-action-against-jjb-members-for-procedural-lapses-in-bail-to-minor/article68413896.ece)  \n  \nBy the time the order of any judicial authority comes, the internet would have forgotten, as always. Most people who wrote full length essays on twitter and \"10 things to learn from Pune Crash\" on LinkedIn wont even bother to know what happened after. If the internet had not pressured the local authorities to act, who knows if the case even made it out of Pune, let alone a national issue. ",
    "flair": "Crime",
    "score": 26,
    "num_comments": 3,
    "created_utc": 1722271735.0,
    "convurl": "https://external-preview.redd.it/9F3vV0-gQ29H7CshStp6pX-4Vflv2vnYTqPnlv-VYWo.jpg",
    "comments": [
        "case was extra ordinarily manhandled, butchered, ignored and put off the table as we have seen from time to time-SSR, divya bharati, jiah khan, and especially if the accused is rich or influencial. they in all literal sense bought their way out.  \ni am ashamed to say this but life is cheap here. so shameful.",
        "I generally do not post my opinions anywhere but I was moved by this incident. I am also a young student. I had to drive miles on highway for my work. I have seen really bad accidents in front of my eyes.   \n  \nEven though I have huge hopes for this country as my future, there is no denying that you can buy your way out of any situation. My friend used to say \"The justice sides the pockets\". I think he referred to the scale which the lady justice holds. Does it tip the scale in the side of who puts in larger sums of money?",
        "Thank you for informing OP."
    ],
    "cleaned_text": "remember pune porsche crash case yea well neither heres little update forget quickly internet screaming give justice punishing allegedly drunk kid allegedly driving allegedly crashed two innocent people kid released even bodies victims cremated familieshttpswwwthequintcomnewsindiapuneporschecaraccidentvictimaneeshawdhiyamothersavitajusticeminorpunishment attempts sabotage evidences bail conditions became field day memes got new things talk ambani weddings olympics recent articles happened internet forgot name teen page chargesheet filed police recently times articlehttpswwwtimesnownewscompunepunenewsporschecrashcaseinpagechargesheetfiledbypoliceagainstaccusedteennotmentionedarticle accused submits required essay july reference car crash may order bail given june indian express articlehttpsindianexpresscomarticlecitiespuneminorinporschecasecomplieswithbailconditionssubmitsessayonroadaccidentstextintheearlyhoursofaneeshawadhiyaandashwinikoshta yes memes came essay maharashtra women child development panel recommends actions jjb members people gave bail bail conditions lapses procedures hindu articlehttpswwwthehinducomnewsnationalmaharashtraporschecrashwcdpanelrecommendsactionagainstjjbmembersforprocedurallapsesinbailtominorarticleece time order judicial authority comes internet would forgotten always people wrote full length essays twitter things learn pune crash linkedin wont even bother know happened internet pressured local authorities act knows case even made pune let alone national issue ",
    "cleaned_title": "remember pune porsche crash case yea well neither heres little update",
    "cleaned_selftext": "forget quickly internet screaming give justice punishing allegedly drunk kid allegedly driving allegedly crashed two innocent people kid released even bodies victims cremated familieshttpswwwthequintcomnewsindiapuneporschecaraccidentvictimaneeshawdhiyamothersavitajusticeminorpunishment attempts sabotage evidences bail conditions became field day memes got new things talk ambani weddings olympics recent articles happened internet forgot name teen page chargesheet filed police recently times articlehttpswwwtimesnownewscompunepunenewsporschecrashcaseinpagechargesheetfiledbypoliceagainstaccusedteennotmentionedarticle accused submits required essay july reference car crash may order bail given june indian express articlehttpsindianexpresscomarticlecitiespuneminorinporschecasecomplieswithbailconditionssubmitsessayonroadaccidentstextintheearlyhoursofaneeshawadhiyaandashwinikoshta yes memes came essay maharashtra women child development panel recommends actions jjb members people gave bail bail conditions lapses procedures hindu articlehttpswwwthehinducomnewsnationalmaharashtraporschecrashwcdpanelrecommendsactionagainstjjbmembersforprocedurallapsesinbailtominorarticleece time order judicial authority comes internet would forgotten always people wrote full length essays twitter things learn pune crash linkedin wont even bother know happened internet pressured local authorities act knows case even made pune let alone national issue",
    "cleaned_comments": "case extra ordinarily manhandled butchered ignored put table seen time timessr divya bharati jiah khan especially accused rich influencial literal sense bought way ashamed say life cheap shameful generally post opinions anywhere moved incident also young student drive miles highway work seen really bad accidents front eyes even though huge hopes country future denying buy way situation friend used say justice sides pockets think referred scale lady justice holds tip scale side puts larger sums money thank informing op",
    "light_cleaned_title": "Remember the Pune Porsche Crash Case? Yea well, me neither. Here's a little update.",
    "light_cleaned_selftext": "We forget too quickly. The internet was screaming to give justice by punishing the allegedly drunk kid who allegedly was driving and allegedly crashed into two innocent people. The kid who was released even before the bodies of victims were cremated by their [families](https://www.thequint.com/news/india/pune-porsche-car-accident-victim-aneesh-awdhiya-mother-savita-justice-minor-punishment). Then there were attempts to sabotage the evidences and bail conditions which became a field day for memes. But then we got new things to talk about. The Ambani weddings, the Olympics and what not. Here are some recent articles on what happened after the internet forgot: 1. No name of teen in the 900-page chargesheet filed by police recently - [Times Now Article](https://www.timesnownews.com/pune/pune-news-porsche-crash-case-in-900-page-chargesheet-filed-by-police-against-7-accused-teen-not-mentioned-article-112048568) 2. Accused submits the required essay on July 3 (For reference car crash was on May 19 and the order for bail was given on June 25) - [Indian Express Article](https://indianexpress.com/article/cities/pune/minor-in-porsche-case-complies-with-bail-conditions-submits-essay-on-road-accidents-9433586/#:~:text=In%20the%20early%20hours%20of,Aneesh%20Awadhiya%20and%20Ashwini%20Koshta) - Yes the memes came before the essay did. 3. Maharashtra Women and Child Development Panel recommends actions against JJB members (people who gave bail and bail conditions) for lapses in procedures - [The Hindu Article](https://www.thehindu.com/news/national/maharashtra/porsche-crash-wcd-panel-recommends-action-against-jjb-members-for-procedural-lapses-in-bail-to-minor/article68413896.ece) By the time the order of any judicial authority comes, the internet would have forgotten, as always. Most people who wrote full length essays on twitter and \"10 things to learn from Pune Crash\" on LinkedIn wont even bother to know what happened after. If the internet had not pressured the local authorities to act, who knows if the case even made it out of Pune, let alone a national issue.",
    "light_cleaned_comments": "case was extra ordinarily manhandled, butchered, ignored and put off the table as we have seen from time to time-SSR, divya bharati, jiah khan, and especially if the accused is rich or influencial. they in all literal sense bought their way out. i am ashamed to say this but life is cheap here. so shameful. I generally do not post my opinions anywhere but I was moved by this incident. I am also a young student. I had to drive miles on highway for my work. I have seen really bad accidents in front of my eyes. Even though I have huge hopes for this country as my future, there is no denying that you can buy your way out of any situation. My friend used to say \"The justice sides the pockets\". I think he referred to the scale which the lady justice holds. Does it tip the scale in the side of who puts in larger sums of money? Thank you for informing OP."
}