{
    "id": "1904wr2",
    "title": "Muslim student strength in higher education fell by 1.79 lakh in 2020-21 - The Hindu",
    "url": "https://www.thehindu.com/news/national/over-179-lakh-fewer-muslim-students-pursued-higher-education-in-2020-21-says-report/article67583855.ece",
    "selftext": "This is as per a 2023 study. Also, the percentage of Muslim students enrolled in higher education relative to the total number of students enrolled also saw a slight decrease, falling from 4.87 in 2016-17 to 4.64 in 2020-21.\n\nI don't think this is because govt is discriminating against Muslims but really because govt is discriminating against the poor. Education was said to be the only hope of upwards mobility for poor in India, a country with huge inequalities. Govt policies of making education unaffordable and out of reach of masses have started working finally. Wow India!! Soon, by 2047 , we might become a paradox of rich country with very poor people.",
    "flair": "Policy/Economy",
    "score": 6,
    "num_comments": 7,
    "created_utc": 1704561762.0,
    "convurl": "https://external-preview.redd.it/d89IT0aAHtOISbhCKZKaB1kdRMjtvC5SKzB6dGD9vgQ.jpg?auto=webp&s=7722dbc0f1fa90276d2735d37816747ef1de27d2",
    "comments": [
        "So now the govt is to be blamed for this as well? I swear if tomorrow some Muslim stubs his toe yall will blame govt for this as well",
        "Govt Policies making education unaffordable? What?",
        "Can you elaborate on how the govt has made education unaffordable? \nI , however, would like to point out that the free education is not up to the mark when it comes to quality and they definitely need to up it so that students coming from these schools can compete with private schools students",
        "It is the government that reduces education budget.\n\nWhy credit the govt when GDP or toilets increase, but if these numbers go down it is the fault of 100M+ poor people or Muslims."
    ],
    "cleaned_text": "muslim student strength higher education fell lakh hindu per study also percentage muslim students enrolled higher education relative total number students enrolled also saw slight decrease falling dont think govt discriminating muslims really govt discriminating poor education said hope upwards mobility poor india country huge inequalities govt policies making education unaffordable reach masses started working finally wow india soon might become paradox rich country poor people ",
    "cleaned_title": "muslim student strength higher education fell lakh hindu",
    "cleaned_selftext": "per study also percentage muslim students enrolled higher education relative total number students enrolled also saw slight decrease falling dont think govt discriminating muslims really govt discriminating poor education said hope upwards mobility poor india country huge inequalities govt policies making education unaffordable reach masses started working finally wow india soon might become paradox rich country poor people",
    "cleaned_comments": "govt blamed well swear tomorrow muslim stubs toe yall blame govt well govt policies making education unaffordable elaborate govt made education unaffordable however would like point free education mark comes quality definitely need students coming schools compete private schools students government reduces education budget credit govt gdp toilets increase numbers go fault poor people muslims",
    "light_cleaned_title": "Muslim student strength in higher education fell by 1.79 lakh in 2020-21 - The Hindu",
    "light_cleaned_selftext": "This is as per a 2023 study. Also, the percentage of Muslim students enrolled in higher education relative to the total number of students enrolled also saw a slight decrease, falling from 4.87 in 2016-17 to 4.64 in 2020-21. I don't think this is because govt is discriminating against Muslims but really because govt is discriminating against the poor. Education was said to be the only hope of upwards mobility for poor in India, a country with huge inequalities. Govt policies of making education unaffordable and out of reach of masses have started working finally. Wow India!! Soon, by 2047 , we might become a paradox of rich country with very poor people.",
    "light_cleaned_comments": "So now the govt is to be blamed for this as well? I swear if tomorrow some Muslim stubs his toe yall will blame govt for this as well Govt Policies making education unaffordable? What? Can you elaborate on how the govt has made education unaffordable? I , however, would like to point out that the free education is not up to the mark when it comes to quality and they definitely need to up it so that students coming from these schools can compete with private schools students It is the government that reduces education budget. Why credit the govt when GDP or toilets increase, but if these numbers go down it is the fault of 100M+ poor people or Muslims."
}