{
    "id": "15ogi69",
    "title": "Is English colonialism a topic commonly discussed?",
    "url": "https://www.reddit.com/r/india/comments/15ogi69/is_english_colonialism_a_topic_commonly_discussed/",
    "selftext": "Hello, I am from Mexico and I recently came across this very insightful [video](https://youtu.be/gIzQxNZfGM4).\n\nHere in Mexico, colonialism and its negative effects are talked about commonly (with the occasional person that is in favor). I was wondering if it is the same case for India. \n\nI know India is a much much older country so I wonder if it as present in your culture as it is here. Mexico hasn't been around nearly as long so I was thinking maybe colonialism is more impactful here versus a country thousands of years old. I am very curious! Cheers!",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691778249.0,
    "convurl": "https://external-preview.redd.it/zgwBXMoll8zWdcTwFar0a-GQysU9Q8F2wv7s4ZV65uU.jpg?auto=webp&s=34c1d6df1c189ff00f19eaca73c7c020f0ca55a1",
    "comments": [
        "People don't typically talk about colonialism in casual conversation, unless they're college students. However, almost everyone acknowledges that colonialism devastated the Indian economy, Indian agriculture, and Indian industry. \n\n>Mexico hasn't been around nearly as long so I was thinking maybe colonialism is more impactful here versus a country thousands of years old. \n\nDon't sell yourself short, fam. While India does have a better-documented ancient history, Mexico's indigenous peoples had many impressive accomplishments.",
        "Yea, I didn't meant to say that people are just talking about all the time here but it's \"fresh\" in our history, if that makes sense, so it comes up in political discussions.",
        "Absolutely, there were great civilizations here ... Just probably don't go as far back in time I meant to say",
        "The effects of Independence and Partition are still being studied today. \n\nAs mentioned in my since-edited comment, it's worth remembering that there are many, many Indians who grew up under the Raj. My mother-in-law, for instance, would've been a teenager by the time that the last British soldiers left Kolkata. \n\nI live in the U.S., and I somewhat recently met an older Pakistani man who told me a long story about how his family had abandoned their properties amidst riots to move from modern-day India to modern-day Pakistan during Partition. \n\nA lot of contemporary \"Subcontinental\" tensions have their origins in the trauma of Partition. \n\nIMO, it's all very relevant, but--as time wears on--is becoming part of a broader discourse.",
        "What do you mean by \"Mexico Hasn't been around nearly as long\" isn't the Mayan Civilisation from Mexico??",
        "Yes absolutely but the Mayans earliest known settlements are around 1800 BC and not very much remains from that culture or language. Colonization was a sorta bloody \"reset\" point",
        " The generation which experienced the cruelty of British Rule is at the end. The impact of colonialism has been far to great to understand and hardly understood by any nation. Some of the modern wounds are the direct cause of the colonialism, eg Ind v/s pak conflict. Now, we   don't have time to hate them for what they did, a new era awaits and as a nation we will rise again for our people.\n\nMy grandfather, if he was aliive, would have turned 76 in the next 3 days. From what he told me, the poverty after british left was far too great, the conditions in which we are living right now was far beyond imagination for him, people use to fight among themselves for one course meal (thx to green revolution).",
        "That is a very positive perspective. You guys are on the up without a doubt",
        "No. But we probably should. Most people view it negatively here too.",
        "Colonialism is taught in school and almost everyone views it negatively.\n\nThat said, most Indians don't blame the UK for our current circumstances. We're a free country and own our destiny, we blame our own politicians and government for their ineptness.\n\nThe easiest thing to do is to blame the past for all your problems, the harder thing to do is to move forward and find solutions.",
        "Ah, a glorified advert for Shashi Tharoor's book. I suggest you do some more reading to get a more nuanced picture of the legacy of colonialism in India."
    ],
    "cleaned_text": "english colonialism topic commonly discussed hello mexico recently came across insightful videohttpsyoutubegizqxnzfgm mexico colonialism negative effects talked commonly occasional person favor wondering case india know india much much older country wonder present culture mexico hasnt around nearly long thinking maybe colonialism impactful versus country thousands years old curious cheers ",
    "cleaned_title": "english colonialism topic commonly discussed",
    "cleaned_selftext": "hello mexico recently came across insightful videohttpsyoutubegizqxnzfgm mexico colonialism negative effects talked commonly occasional person favor wondering case india know india much much older country wonder present culture mexico hasnt around nearly long thinking maybe colonialism impactful versus country thousands years old curious cheers",
    "cleaned_comments": "people dont typically talk colonialism casual conversation unless theyre college students however almost everyone acknowledges colonialism devastated indian economy indian agriculture indian industry mexico hasnt around nearly long thinking maybe colonialism impactful versus country thousands years old dont sell short fam india betterdocumented ancient history mexicos indigenous peoples many impressive accomplishments yea didnt meant say people talking time fresh history makes sense comes political discussions absolutely great civilizations probably dont go far back time meant say effects independence partition still studied today mentioned sinceedited comment worth remembering many many indians grew raj motherinlaw instance wouldve teenager time last british soldiers left kolkata live us somewhat recently met older pakistani man told long story family abandoned properties amidst riots move modernday india modernday pakistan partition lot contemporary subcontinental tensions origins trauma partition imo relevant butas time wears onis becoming part broader discourse mean mexico hasnt around nearly long isnt mayan civilisation mexico yes absolutely mayans earliest known settlements around bc much remains culture language colonization sorta bloody reset point generation experienced cruelty british rule end impact colonialism far great understand hardly understood nation modern wounds direct cause colonialism eg ind vs pak conflict dont time hate new era awaits nation rise people grandfather aliive would turned next days told poverty british left far great conditions living right far beyond imagination people use fight among one course meal thx green revolution positive perspective guys without doubt probably people view negatively colonialism taught school almost everyone views negatively said indians dont blame uk current circumstances free country destiny blame politicians government ineptness easiest thing blame past problems harder thing move forward find solutions ah glorified advert shashi tharoors book suggest reading get nuanced picture legacy colonialism india",
    "light_cleaned_title": "Is English colonialism a topic commonly discussed?",
    "light_cleaned_selftext": "Hello, I am from Mexico and I recently came across this very insightful [video](https://youtu.be/gIzQxNZfGM4). Here in Mexico, colonialism and its negative effects are talked about commonly (with the occasional person that is in favor). I was wondering if it is the same case for India. I know India is a much much older country so I wonder if it as present in your culture as it is here. Mexico hasn't been around nearly as long so I was thinking maybe colonialism is more impactful here versus a country thousands of years old. I am very curious! Cheers!",
    "light_cleaned_comments": "People don't typically talk about colonialism in casual conversation, unless they're college students. However, almost everyone acknowledges that colonialism devastated the Indian economy, Indian agriculture, and Indian industry. >Mexico hasn't been around nearly as long so I was thinking maybe colonialism is more impactful here versus a country thousands of years old. Don't sell yourself short, fam. While India does have a better-documented ancient history, Mexico's indigenous peoples had many impressive accomplishments. Yea, I didn't meant to say that people are just talking about all the time here but it's \"fresh\" in our history, if that makes sense, so it comes up in political discussions. Absolutely, there were great civilizations here ... Just probably don't go as far back in time I meant to say The effects of Independence and Partition are still being studied today. As mentioned in my since-edited comment, it's worth remembering that there are many, many Indians who grew up under the Raj. My mother-in-law, for instance, would've been a teenager by the time that the last British soldiers left Kolkata. I live in the U.S., and I somewhat recently met an older Pakistani man who told me a long story about how his family had abandoned their properties amidst riots to move from modern-day India to modern-day Pakistan during Partition. A lot of contemporary \"Subcontinental\" tensions have their origins in the trauma of Partition. IMO, it's all very relevant, but--as time wears on--is becoming part of a broader discourse. What do you mean by \"Mexico Hasn't been around nearly as long\" isn't the Mayan Civilisation from Mexico?? Yes absolutely but the Mayans earliest known settlements are around 1800 BC and not very much remains from that culture or language. Colonization was a sorta bloody \"reset\" point The generation which experienced the cruelty of British Rule is at the end. The impact of colonialism has been far to great to understand and hardly understood by any nation. Some of the modern wounds are the direct cause of the colonialism, eg Ind v/s pak conflict. Now, we don't have time to hate them for what they did, a new era awaits and as a nation we will rise again for our people. My grandfather, if he was aliive, would have turned 76 in the next 3 days. From what he told me, the poverty after british left was far too great, the conditions in which we are living right now was far beyond imagination for him, people use to fight among themselves for one course meal (thx to green revolution). That is a very positive perspective. You guys are on the up without a doubt No. But we probably should. Most people view it negatively here too. Colonialism is taught in school and almost everyone views it negatively. That said, most Indians don't blame the UK for our current circumstances. We're a free country and own our destiny, we blame our own politicians and government for their ineptness. The easiest thing to do is to blame the past for all your problems, the harder thing to do is to move forward and find solutions. Ah, a glorified advert for Shashi Tharoor's book. I suggest you do some more reading to get a more nuanced picture of the legacy of colonialism in India."
}