{
    "id": "15gu1aq",
    "title": "What are your thoughts? Let's have a civil discussion.",
    "url": "https://www.reddit.com/r/india/comments/15gu1aq/what_are_your_thoughts_lets_have_a_civil/",
    "selftext": "My viewpoint on this video of Amit Sengupta: [https://www.youtube.com/watch?v=LaAsCJchH10](https://www.youtube.com/watch?v=LaAsCJchH10)\n\nI had admired his central right belief until now. But now I see he is just buttlicking Modi and calling India the greatest democracy(best form, adding Hindutva) while in the past 9 years, Modi hasn't even got the guts to face one real question not just on minorities. It is like calling democracy and acting like Putin, Xi, and Kim. Man Ki Baat is a similar translation of Hitler's Radio Address. It's good to reject criticism when India is either self-sufficient or India is being sanctioned like North Korea. You buy all of your state media like China, Russia, and North Korea did, which is just seeding communal polarization into people's minds, making India a new playground for fascism. I have seen him making videos on India's rising reputation on a global scale but not a single video on heightened communal politics inside India.  Yes, India is a great country but can't we just let go of the religious polarization and walk forward?\n\nWhat are your thoughts on Amit Sengupta's view Point on rejecting criticism?\n\n(PS: I don't support any wrongdoings of any other opposition parties in any state. I feel they are equally wrong. But here we are just talking about the central government and its strategy. Also, I am from Nepal, I am just concerned and curious about Indian Politics.)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691037185.0,
    "convurl": "https://external-preview.redd.it/PJVFQTsn0p2IzpwrDjKrCTR2-GY6NXapuzQAhBwt1DM.jpg?auto=webp&s=d856e2f04b34bd2fc9cb4ba0b0eeb54edcab6a28",
    "comments": [
        "Modi is an RSS man. And RSS was inspired by Hitlers Brown Shirts. \n\nIt is not surprising then, that the country is run by fascists. \n\nI dont know who amit sengupta is."
    ],
    "cleaned_text": "thoughts lets civil discussion viewpoint video amit sengupta httpswwwyoutubecomwatchvlaascjchhhttpswwwyoutubecomwatchvlaascjchh admired central right belief see buttlicking modi calling india greatest democracybest form adding hindutva past years modi hasnt even got guts face one real question minorities like calling democracy acting like putin xi kim man ki baat similar translation hitlers radio address good reject criticism india either selfsufficient india sanctioned like north korea buy state media like china russia north korea seeding communal polarization peoples minds making india new playground fascism seen making videos indias rising reputation global scale single video heightened communal politics inside india yes india great country cant let go religious polarization walk forward thoughts amit senguptas view point rejecting criticism ps dont support wrongdoings opposition parties state feel equally wrong talking central government strategy also nepal concerned curious indian politics ",
    "cleaned_title": "thoughts lets civil discussion",
    "cleaned_selftext": "viewpoint video amit sengupta httpswwwyoutubecomwatchvlaascjchhhttpswwwyoutubecomwatchvlaascjchh admired central right belief see buttlicking modi calling india greatest democracybest form adding hindutva past years modi hasnt even got guts face one real question minorities like calling democracy acting like putin xi kim man ki baat similar translation hitlers radio address good reject criticism india either selfsufficient india sanctioned like north korea buy state media like china russia north korea seeding communal polarization peoples minds making india new playground fascism seen making videos indias rising reputation global scale single video heightened communal politics inside india yes india great country cant let go religious polarization walk forward thoughts amit senguptas view point rejecting criticism ps dont support wrongdoings opposition parties state feel equally wrong talking central government strategy also nepal concerned curious indian politics",
    "cleaned_comments": "modi rss man rss inspired hitlers brown shirts surprising country run fascists dont know amit sengupta",
    "light_cleaned_title": "What are your thoughts? Let's have a civil discussion.",
    "light_cleaned_selftext": "My viewpoint on this video of Amit Sengupta: [https://www.youtube.com/watch?v=LaAsCJchH10](https://www.youtube.com/watch?v=LaAsCJchH10) I had admired his central right belief until now. But now I see he is just buttlicking Modi and calling India the greatest democracy(best form, adding Hindutva) while in the past 9 years, Modi hasn't even got the guts to face one real question not just on minorities. It is like calling democracy and acting like Putin, Xi, and Kim. Man Ki Baat is a similar translation of Hitler's Radio Address. It's good to reject criticism when India is either self-sufficient or India is being sanctioned like North Korea. You buy all of your state media like China, Russia, and North Korea did, which is just seeding communal polarization into people's minds, making India a new playground for fascism. I have seen him making videos on India's rising reputation on a global scale but not a single video on heightened communal politics inside India. Yes, India is a great country but can't we just let go of the religious polarization and walk forward? What are your thoughts on Amit Sengupta's view Point on rejecting criticism? (PS: I don't support any wrongdoings of any other opposition parties in any state. I feel they are equally wrong. But here we are just talking about the central government and its strategy. Also, I am from Nepal, I am just concerned and curious about Indian Politics.)",
    "light_cleaned_comments": "Modi is an RSS man. And RSS was inspired by Hitlers Brown Shirts. It is not surprising then, that the country is run by fascists. I dont know who amit sengupta is."
}