{
    "id": "1bfzjln",
    "title": "Fedex Parcel Scam Escape",
    "url": "https://www.reddit.com/gallery/1bfzjln",
    "selftext": "Watch out for the FedEx Parcel Scam!\nToday, someone tried to scam me. I got a call from someone claiming to be from FedEx. \n\nThey said a package with my name on it was caught with drugs and linked to my Aadhaar. They transferred the call to someone claiming to be from the \"Cyber Police\" to file a complaint. \n\nThese so-called \"cyber police\" asked me to join a Skype call to give a video statement. During the call, they threatened me, saying I could face 3-6 years in jail if found guilty. They told me to transfer money to their account for verification. The even sent few pdfs with govt stamps on it.\n\nLuckily, I became suspicious and ended the call without sending any money.",
    "flair": "Crime",
    "score": 7,
    "num_comments": 8,
    "created_utc": 1710569539.0,
    "convurl": "https://i.redd.it/eii64otg1noc1.jpg",
    "comments": [
        "You actually joined a Skype call? 😭",
        "76 people with specific kink enjoyed this short livestream \n/s",
        "Maybe OP did. From what I read elsewhere, scammers also have a police station setup and they wear police uniforms for the video call.",
        "People got too much time and energy for scamming rather than doing some genuine business",
        "Look at the english on that notice. They should use ChatGPT for better....",
        "> \"And your case will be cancelled and solve immediately\" \n\nHa ha these guys are big time clowns",
        "Wrong penal codes too what .. these guys not doing proper homework",
        "I do hope you reported the SKype ID on Phishbowl. Its a community based scammer database where others can watch their backs by checking. You can check phones, emails, message headers, all social profiles etc. there. For next time!",
        "I received same type of call.. but I became suspicious when they said ki they can connect to cyber crime",
        "I have gotten 2 or 3 such calls and each time, I disconnect the call and block the number.",
        "I wish I'd come across your post sooner OP. Just had a conversation with my brother who fell for this. Word for word same experience and same documents. Unfortunately he lost a good amount of money. I was speechless and only thing I can do is comfort him."
    ],
    "cleaned_text": "fedex parcel scam escape watch fedex parcel scam today someone tried scam got call someone claiming fedex said package name caught drugs linked aadhaar transferred call someone claiming cyber police file complaint socalled cyber police asked join skype call give video statement call threatened saying could face years jail found guilty told transfer money account verification even sent pdfs govt stamps luckily became suspicious ended call without sending money ",
    "cleaned_title": "fedex parcel scam escape",
    "cleaned_selftext": "watch fedex parcel scam today someone tried scam got call someone claiming fedex said package name caught drugs linked aadhaar transferred call someone claiming cyber police file complaint socalled cyber police asked join skype call give video statement call threatened saying could face years jail found guilty told transfer money account verification even sent pdfs govt stamps luckily became suspicious ended call without sending money",
    "cleaned_comments": "actually joined skype call people specific kink enjoyed short livestream maybe op read elsewhere scammers also police station setup wear police uniforms video call people got much time energy scamming rather genuine business look english notice use chatgpt better case cancelled solve immediately ha ha guys big time clowns wrong penal codes guys proper homework hope reported skype id phishbowl community based scammer database others watch backs checking check phones emails message headers social profiles etc next time received type call became suspicious said ki connect cyber crime gotten calls time disconnect call block number wish id come across post sooner op conversation brother fell word word experience documents unfortunately lost good amount money speechless thing comfort",
    "light_cleaned_title": "Fedex Parcel Scam Escape",
    "light_cleaned_selftext": "Watch out for the FedEx Parcel Scam! Today, someone tried to scam me. I got a call from someone claiming to be from FedEx. They said a package with my name on it was caught with drugs and linked to my Aadhaar. They transferred the call to someone claiming to be from the \"Cyber Police\" to file a complaint. These so-called \"cyber police\" asked me to join a Skype call to give a video statement. During the call, they threatened me, saying I could face 3-6 years in jail if found guilty. They told me to transfer money to their account for verification. The even sent few pdfs with govt stamps on it. Luckily, I became suspicious and ended the call without sending any money.",
    "light_cleaned_comments": "You actually joined a Skype call? 😭 76 people with specific kink enjoyed this short livestream /s Maybe OP did. From what I read elsewhere, scammers also have a police station setup and they wear police uniforms for the video call. People got too much time and energy for scamming rather than doing some genuine business Look at the english on that notice. They should use ChatGPT for better.... > \"And your case will be cancelled and solve immediately\" Ha ha these guys are big time clowns Wrong penal codes too what .. these guys not doing proper homework I do hope you reported the SKype ID on Phishbowl. Its a community based scammer database where others can watch their backs by checking. You can check phones, emails, message headers, all social profiles etc. there. For next time! I received same type of call.. but I became suspicious when they said ki they can connect to cyber crime I have gotten 2 or 3 such calls and each time, I disconnect the call and block the number. I wish I'd come across your post sooner OP. Just had a conversation with my brother who fell for this. Word for word same experience and same documents. Unfortunately he lost a good amount of money. I was speechless and only thing I can do is comfort him."
}