{
    "id": "16uqpuh",
    "title": "statement from LiverDoc ",
    "url": "https://v.redd.it/5u5gcihr32rb1",
    "selftext": "statement from LiverDoc aka Dr Cyriac Abb Philips regarding his recent account ban as a result of litigation filed by Himalaya Drug company. His studies and presentations on drug induced liver injuries caused by ayurvedic/homeopathic \"medicines\" was an eye-opener. He was often abused both online and in real life by government and pseudoscience pedalers. It's disheartened to see a citizen is abused for exercising article 15-AH.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1695933083.0,
    "convurl": "https://external-preview.redd.it/NW94MWJzY3IzMnJiMQHpcpeFOPctWCx5A42Zd-prQT-Vwl9-n4KLIeNmwwXA.png?format=pjpg&auto=webp&s=7f5b1cc4532d82dac6f74315d10d5ce6b17e1423",
    "comments": [],
    "cleaned_text": "statement liverdoc statement liverdoc aka dr cyriac abb philips regarding recent account ban result litigation filed himalaya drug company studies presentations drug induced liver injuries caused ayurvedichomeopathic medicines eyeopener often abused online real life government pseudoscience pedalers disheartened see citizen abused exercising article ah ",
    "cleaned_title": "statement liverdoc",
    "cleaned_selftext": "statement liverdoc aka dr cyriac abb philips regarding recent account ban result litigation filed himalaya drug company studies presentations drug induced liver injuries caused ayurvedichomeopathic medicines eyeopener often abused online real life government pseudoscience pedalers disheartened see citizen abused exercising article ah",
    "cleaned_comments": "",
    "light_cleaned_title": "statement from LiverDoc",
    "light_cleaned_selftext": "statement from LiverDoc aka Dr Cyriac Abb Philips regarding his recent account ban as a result of litigation filed by Himalaya Drug company. His studies and presentations on drug induced liver injuries caused by ayurvedic/homeopathic \"medicines\" was an eye-opener. He was often abused both online and in real life by government and pseudoscience pedalers. It's disheartened to see a citizen is abused for exercising article 15-AH.",
    "light_cleaned_comments": ""
}