{
    "id": "15dfh8i",
    "title": "Sexual harassment case: Brij Bhushan exempted from court appearance",
    "url": "https://www.thehindu.com/news/cities/Delhi/sexual-harassment-case-brij-bhushan-exempted-from-court-appearance/article67133094.ece",
    "selftext": "Relief given to the WFI chief based on Bharatiya Janata Party MP’s plea citing Monsoon Session of Parliament\nA court here on Friday granted exemption to outgoing Wrestling Federation of India (WFI) chief Brij Bhushan Sharan Singh from personal appearance in a case of alleged sexual harassment of women wrestlers.\n\nAdditional Chief Metropolitan Magistrate Harjeet Singh Jaspal of the Rouse Avenue Court gave the relief to Mr. Singh, a Bharatiya Janata Party MP, based on his application citing the ongoing Monsoon Session of Parliament.\n\nThe matter will be heard next on August 3.\n\nSeveral Olympic and world championship medal-winning wrestlers — including Sakshi Malik, Vinesh Phogat, Bajrang Punia and Sangeeta Phogat — have been demanding Mr. Singh’s arrest for months and had earlier this year protested at Jantar Mantar.\n\nFollowing the intervention of the Supreme Court in May, the police filed an FIR against Mr. Singh.\n\nOn June 15, the police filed a 1,000-page chargesheet in the case, accusing Mr. Singh and former WFI assistant secretary Virendra Tomar of various offences, including outraging modesty, making sexually coloured remarks, stalking, and criminal intimidation.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 24,
    "created_utc": 1690702642.0,
    "convurl": "https://external-preview.redd.it/wzpS7CPT5oU-zG4cCHpFkblEFnQW713piz3x7rYApUg.jpg?auto=webp&s=5aa5ac7d83ee9124a025634f676d5d56099563a4",
    "comments": [
        "Man it pays to be a politician associated  with the ruling party ,u literally can commit any crime (rape , kill someone  , cause a riot , burn states )nd still get away  with it.",
        "The way they are still protecting him is insane. It's like they are not even worried about the party's image.",
        "Delhi police literally reports to the center. Does nobody see that as a conflict of interest when it is tasked with prosecuting a ruling party mp? The fact that they only took action after the Supreme Court forced them to do so says everything",
        "if garlanding rapists didn't anger their support base then surely this won't as well",
        "Good decision. He's a busy man - Groping young ladies and stalking them takes time and dedication.",
        "Vishwaguru ka achaar chaatne ka fal.",
        "Manish Sisodiya is still in jail.\n\nUmar Khalid is still in jail.",
        "Yeah man honestly I am horrified at the state of Gujarat right now. How can they celebrate rapists just because they raped muslims?",
        "Remember the number of times Sita had to prove her chastity? Or when Lakshmana was instructed to leave Sita in the forest while pregnant with the twins? Or the time she had to go through another test of fire to prove the paternity of her sons?",
        "> they are not even worried about the party's image\n\nBJP knows their fanbase. Their fanbase hope the wrestlers lose in international matches because they dared to defame this BJP rapist. Why should Modi kick out Bushan? BJP voters have no issues with rapists and goondas, as long as Muslim homes are demolished.",
        "Pakka iske pass gobhi ka sextape hai..",
        "Indian judiciary's motto: Injustice must not only be done, but must also be seen to be done.",
        "Bro these are criminals of highest order who are threat to the nation. Mr Brij on the other hand just molested few female athletes. I hope you understand the difference now. \n\n/s",
        "https://preview.redd.it/aej7t0d2h3fb1.jpeg?width=739&format=pjpg&auto=webp&s=e6277d91c5fe612e542125c763eadb3355975fd4",
        "Brij's case is different. He is loaded like no other politician from UP. \n\nBJP right now is making allainces with parties than can win 1 seat with them. He can make or break four to five LS seats for them.\n\nPlus BJP strategy in UP is to support Rajputs but not Jatts. They are ready to take an L in Haryana and Rajasthan by ignoring Jatt agitation for the purpose of retaining UP.",
        "Yea we’re a REAL democracy and certainly “mOtHeR of democracy” like big inch chest likes to quote",
        "Oppressing women exists within Hinduism.",
        "Izzat, Biradri, 4log.",
        "Even if convicted will get Presidential pardon mostly.\n\nI know we are more likely to overtake US economy, than this person ever being convicted.",
        "It's the Ram Mandir election. It's done and dusted before it is conducted.\n\nAnd 2029 is too far in the future to be bothered about for now.",
        "They got the posco charge removed from him. So realistically there is no strong evidence against him. But giving him judial relaxation is sad. Manipur is trending topic now so BJP can save brij among these chaos because the heat is low around him.",
        "That would explain a lot",
        "Their support base has the same values as them.  They probably commit same crimes but on lower scale.",
        "\"Will no one think of the rapists?\" - BJP"
    ],
    "cleaned_text": "sexual harassment case brij bhushan exempted court appearance relief given wfi chief based bharatiya janata party mps plea citing monsoon session parliament court friday granted exemption outgoing wrestling federation india wfi chief brij bhushan sharan singh personal appearance case alleged sexual harassment women wrestlers additional chief metropolitan magistrate harjeet singh jaspal rouse avenue court gave relief mr singh bharatiya janata party mp based application citing ongoing monsoon session parliament matter heard next august several olympic world championship medalwinning wrestlers including sakshi malik vinesh phogat bajrang punia sangeeta phogat demanding mr singhs arrest months earlier year protested jantar mantar following intervention supreme court may police filed fir mr singh june police filed page chargesheet case accusing mr singh former wfi assistant secretary virendra tomar various offences including outraging modesty making sexually coloured remarks stalking criminal intimidation ",
    "cleaned_title": "sexual harassment case brij bhushan exempted court appearance",
    "cleaned_selftext": "relief given wfi chief based bharatiya janata party mps plea citing monsoon session parliament court friday granted exemption outgoing wrestling federation india wfi chief brij bhushan sharan singh personal appearance case alleged sexual harassment women wrestlers additional chief metropolitan magistrate harjeet singh jaspal rouse avenue court gave relief mr singh bharatiya janata party mp based application citing ongoing monsoon session parliament matter heard next august several olympic world championship medalwinning wrestlers including sakshi malik vinesh phogat bajrang punia sangeeta phogat demanding mr singhs arrest months earlier year protested jantar mantar following intervention supreme court may police filed fir mr singh june police filed page chargesheet case accusing mr singh former wfi assistant secretary virendra tomar various offences including outraging modesty making sexually coloured remarks stalking criminal intimidation",
    "cleaned_comments": "man pays politician associated ruling party u literally commit crime rape kill someone cause riot burn states nd still get away way still protecting insane like even worried partys image delhi police literally reports center nobody see conflict interest tasked prosecuting ruling party mp fact took action supreme court forced says everything garlanding rapists didnt anger support base surely wont well good decision hes busy man groping young ladies stalking takes time dedication vishwaguru ka achaar chaatne ka fal manish sisodiya still jail umar khalid still jail yeah man honestly horrified state gujarat right celebrate rapists raped muslims remember number times sita prove chastity lakshmana instructed leave sita forest pregnant twins time go another test fire prove paternity sons even worried partys image bjp knows fanbase fanbase hope wrestlers lose international matches dared defame bjp rapist modi kick bushan bjp voters issues rapists goondas long muslim homes demolished pakka iske pass gobhi ka sextape hai indian judiciarys motto injustice must done must also seen done bro criminals highest order threat nation mr brij hand molested female athletes hope understand difference brijs case different loaded like politician bjp right making allainces parties win seat make break four five ls seats plus bjp strategy support rajputs jatts ready take l haryana rajasthan ignoring jatt agitation purpose retaining yea real democracy certainly mother democracy like big inch chest likes quote oppressing women exists within hinduism izzat biradri log even convicted get presidential pardon mostly know likely overtake us economy person ever convicted ram mandir election done dusted conducted far future bothered got posco charge removed realistically strong evidence giving judial relaxation sad manipur trending topic bjp save brij among chaos heat low around would explain lot support base values probably commit crimes lower scale one think rapists bjp",
    "light_cleaned_title": "Sexual harassment case: Brij Bhushan exempted from court appearance",
    "light_cleaned_selftext": "Relief given to the WFI chief based on Bharatiya Janata Party MP’s plea citing Monsoon Session of Parliament A court here on Friday granted exemption to outgoing Wrestling Federation of India (WFI) chief Brij Bhushan Sharan Singh from personal appearance in a case of alleged sexual harassment of women wrestlers. Additional Chief Metropolitan Magistrate Harjeet Singh Jaspal of the Rouse Avenue Court gave the relief to Mr. Singh, a Bharatiya Janata Party MP, based on his application citing the ongoing Monsoon Session of Parliament. The matter will be heard next on August 3. Several Olympic and world championship medal-winning wrestlers — including Sakshi Malik, Vinesh Phogat, Bajrang Punia and Sangeeta Phogat — have been demanding Mr. Singh’s arrest for months and had earlier this year protested at Jantar Mantar. Following the intervention of the Supreme Court in May, the police filed an FIR against Mr. Singh. On June 15, the police filed a 1,000-page chargesheet in the case, accusing Mr. Singh and former WFI assistant secretary Virendra Tomar of various offences, including outraging modesty, making sexually coloured remarks, stalking, and criminal intimidation.",
    "light_cleaned_comments": "Man it pays to be a politician associated with the ruling party ,u literally can commit any crime (rape , kill someone , cause a riot , burn states )nd still get away with it. The way they are still protecting him is insane. It's like they are not even worried about the party's image. Delhi police literally reports to the center. Does nobody see that as a conflict of interest when it is tasked with prosecuting a ruling party mp? The fact that they only took action after the Supreme Court forced them to do so says everything if garlanding rapists didn't anger their support base then surely this won't as well Good decision. He's a busy man - Groping young ladies and stalking them takes time and dedication. Vishwaguru ka achaar chaatne ka fal. Manish Sisodiya is still in jail. Umar Khalid is still in jail. Yeah man honestly I am horrified at the state of Gujarat right now. How can they celebrate rapists just because they raped muslims? Remember the number of times Sita had to prove her chastity? Or when Lakshmana was instructed to leave Sita in the forest while pregnant with the twins? Or the time she had to go through another test of fire to prove the paternity of her sons? > they are not even worried about the party's image BJP knows their fanbase. Their fanbase hope the wrestlers lose in international matches because they dared to defame this BJP rapist. Why should Modi kick out Bushan? BJP voters have no issues with rapists and goondas, as long as Muslim homes are demolished. Pakka iske pass gobhi ka sextape hai.. Indian judiciary's motto: Injustice must not only be done, but must also be seen to be done. Bro these are criminals of highest order who are threat to the nation. Mr Brij on the other hand just molested few female athletes. I hope you understand the difference now. /s Brij's case is different. He is loaded like no other politician from UP. BJP right now is making allainces with parties than can win 1 seat with them. He can make or break four to five LS seats for them. Plus BJP strategy in UP is to support Rajputs but not Jatts. They are ready to take an L in Haryana and Rajasthan by ignoring Jatt agitation for the purpose of retaining UP. Yea we’re a REAL democracy and certainly “mOtHeR of democracy” like big inch chest likes to quote Oppressing women exists within Hinduism. Izzat, Biradri, 4log. Even if convicted will get Presidential pardon mostly. I know we are more likely to overtake US economy, than this person ever being convicted. It's the Ram Mandir election. It's done and dusted before it is conducted. And 2029 is too far in the future to be bothered about for now. They got the posco charge removed from him. So realistically there is no strong evidence against him. But giving him judial relaxation is sad. Manipur is trending topic now so BJP can save brij among these chaos because the heat is low around him. That would explain a lot Their support base has the same values as them. They probably commit same crimes but on lower scale. \"Will no one think of the rapists?\" - BJP"
}