{
    "id": "16nori1",
    "title": "I'm making about 35 percent return per month, I'm afraid that my trading strategy is borderline illegal, what can I do to remain on the side of law so that I continue to make the same amount of money without getting charged for crime or should I change my trading strategy altogether.",
    "url": "https://www.reddit.com/r/india/comments/16nori1/im_making_about_35_percent_return_per_month_im/",
    "selftext": "I've developed a software which allows me to predict which stock is going to move up before it actually starts to move up so far it has delivered great returns to anyone who has bought stocks based on my recommendations as can be evidenced by this video [https://www.youtube.com/watch?v=vtfktYo-upA&t=148s](https://www.youtube.com/watch?v=vtfktYo-upA&t=148s), I haven't made a video related to my recent recommendations but they too have achieved their target in time. the stock I recommended a few days back is continuously going up despite the market crash today, I'm expecting it to double just like my previous recommendation before that.\n\nThe stocks I recommend are highly undervalued with very small market cap and after my recommendations these stocks skyrocket because of very low supply coupled with high demand thereby making me a lot of money in a very short span of time. I'm generating about 35 percent return per month doing that again and again.\n\nI don't think I am breaking any law since I make this videos for free , I haven't made even a single dime through these videos directly since my channel isn't monetized, and people who are watching it have made the killing and some of them have personally called and messaged me to make more such videos which I wouldn't mind.\n\nAm I breaking any law? If yes, what can I do to remain on the side of law and continue making the same amount of money. If I managed to do that for a few years I would get insanely rich.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695225152.0,
    "convurl": "https://external-preview.redd.it/x8M1BRvpyMNqUcEi6u3gFrZJerRYDK2X1cpWNTBoMBg.jpg?auto=webp&s=c1853603274984c79cc928de3543ad19f93714e8",
    "comments": [
        "Don't scam people bro, everyone's struggling.",
        "Yeah ok bro",
        "Mind sharing your verified P&L link?",
        "Share your ITR, only then we will believe.",
        "So if you invested ₹1 lakh 3 years ago, you now have ₹4920 Cr. I totally believe you. It gets even better, in another 12 months, you have ₹ 18000 Cr. Maybe in few years you will be richer than Ambani. Why worry bro? Just go to jail.",
        "Scam artists are working hard"
    ],
    "cleaned_text": "im making percent return per month im afraid trading strategy borderline illegal remain side law continue make amount money without getting charged crime change trading strategy altogether ive developed software allows predict stock going move actually starts move far delivered great returns anyone bought stocks based recommendations evidenced video httpswwwyoutubecomwatchvvtfktyoupatshttpswwwyoutubecomwatchvvtfktyoupats havent made video related recent recommendations achieved target time stock recommended days back continuously going despite market crash today im expecting double like previous recommendation stocks recommend highly undervalued small market cap recommendations stocks skyrocket low supply coupled high demand thereby making lot money short span time im generating percent return per month dont think breaking law since make videos free havent made even single dime videos directly since channel isnt monetized people watching made killing personally called messaged make videos wouldnt mind breaking law yes remain side law continue making amount money managed years would get insanely rich ",
    "cleaned_title": "im making percent return per month im afraid trading strategy borderline illegal remain side law continue make amount money without getting charged crime change trading strategy altogether",
    "cleaned_selftext": "ive developed software allows predict stock going move actually starts move far delivered great returns anyone bought stocks based recommendations evidenced video httpswwwyoutubecomwatchvvtfktyoupatshttpswwwyoutubecomwatchvvtfktyoupats havent made video related recent recommendations achieved target time stock recommended days back continuously going despite market crash today im expecting double like previous recommendation stocks recommend highly undervalued small market cap recommendations stocks skyrocket low supply coupled high demand thereby making lot money short span time im generating percent return per month dont think breaking law since make videos free havent made even single dime videos directly since channel isnt monetized people watching made killing personally called messaged make videos wouldnt mind breaking law yes remain side law continue making amount money managed years would get insanely rich",
    "cleaned_comments": "dont scam people bro everyones struggling yeah ok bro mind sharing verified pl link share itr believe invested lakh years ago cr totally believe gets even better another months cr maybe years richer ambani worry bro go jail scam artists working hard",
    "light_cleaned_title": "I'm making about 35 percent return per month, I'm afraid that my trading strategy is borderline illegal, what can I do to remain on the side of law so that I continue to make the same amount of money without getting charged for crime or should I change my trading strategy altogether.",
    "light_cleaned_selftext": "I've developed a software which allows me to predict which stock is going to move up before it actually starts to move up so far it has delivered great returns to anyone who has bought stocks based on my recommendations as can be evidenced by this video [https://www.youtube.com/watch?v=vtfktYo-upA&t=148s](https://www.youtube.com/watch?v=vtfktYo-upA&t=148s), I haven't made a video related to my recent recommendations but they too have achieved their target in time. the stock I recommended a few days back is continuously going up despite the market crash today, I'm expecting it to double just like my previous recommendation before that. The stocks I recommend are highly undervalued with very small market cap and after my recommendations these stocks skyrocket because of very low supply coupled with high demand thereby making me a lot of money in a very short span of time. I'm generating about 35 percent return per month doing that again and again. I don't think I am breaking any law since I make this videos for free , I haven't made even a single dime through these videos directly since my channel isn't monetized, and people who are watching it have made the killing and some of them have personally called and messaged me to make more such videos which I wouldn't mind. Am I breaking any law? If yes, what can I do to remain on the side of law and continue making the same amount of money. If I managed to do that for a few years I would get insanely rich.",
    "light_cleaned_comments": "Don't scam people bro, everyone's struggling. Yeah ok bro Mind sharing your verified P&L link? Share your ITR, only then we will believe. So if you invested ₹1 lakh 3 years ago, you now have ₹4920 Cr. I totally believe you. It gets even better, in another 12 months, you have ₹ 18000 Cr. Maybe in few years you will be richer than Ambani. Why worry bro? Just go to jail. Scam artists are working hard"
}