{
    "id": "1do7og1",
    "title": "Why Indians Aren’t Happy With 8% Economic Growth",
    "url": "https://www.bloomberg.com/opinion/articles/2024-06-17/india-s-fast-growing-economy-has-a-problem",
    "selftext": "A long-delayed survey of small firms offers clues to what ails the fast-growing economy.",
    "flair": "Policy/Economy",
    "score": 205,
    "num_comments": 60,
    "created_utc": 1719326539.0,
    "convurl": "https://external-preview.redd.it/Jm_wB_hKzPPp2Vu_4hOtmx3deBuM-JAnsUtHwQgl258.jpg?auto=webp&s=8615010dbfd17b1e992a700e395946a1a0aa4a94",
    "comments": [
        "[Archive link](https://archive.is/2024.06.18-005202/https://www.bloomberg.com/opinion/articles/2024-06-17/india-s-fast-growing-economy-has-a-problem).",
        "The growth rate is meaningless and the GdP is pointless as the salary of the middle class largely remains low and lagging behind",
        "Tldr; meaning _India is packet of **‘Lays’**_ .",
        "Also burden of high taxes",
        "When my income goes up 0%, but my boss’ goes up 16%, that doesn’t necessarily mean we’re both celebrating our average.",
        "Guys I don’t if you have noticed but private consumption has a feeble growth rate, that’s means people don’t have money to spend. Also this growth is majorly boosted by government capex, private expenditure is still isn’t stepping up as per expectations. Plus there is a huge gap between gdp and gva because of decreased subsidies and high taxes this past year, I think that’s gonna change too! https://indianexpress.com/article/opinion/columns/indias-gdp-growth-is-impressive-but-can-it-be-sustained-9368172/",
        "Also unemployment and last year’s low monsoon d/t El Niño really affected rural economy!",
        "https://preview.redd.it/dz2cvxh9xq8d1.jpeg?width=400&format=pjpg&auto=webp&s=51a6e7d037a8fcbe51346a870d3402788079759a\n\nShould the guy without an umbrella be happy that both of them have a total of 5 umbrellas?",
        "Ya how much after real inflation daddy, -2 %",
        "Robber Baron growth. Common man sees nothing except skyrocketing inflation.",
        "This comment should be up higher.",
        "Also I have a quoted a really nice article!",
        "Inflation 10%, interest on savings acc 7-9%. 8% growth in India is a joke.",
        "Poor's have to cut back on basic things like food, meds, clothes, a decent living home i.e. not stinking just to survive.  \nPeople like us cut on good clothes, healthy food, a decent living home, just coz we can pay EMI or rent.  \n\n\npeople who earn lakhs a month; tell me? does the world revolve around you. People keep saying India is progressing but that's just for top 10%.",
        "Inflation is not 10 percent! It’s high but it’s not this high mate.",
        "Because it does not affect the aam janta , only the friends who own ports or Antilla benefit from this",
        "And average Indian spends how much on food? I read some where that it is close to 40% or something high like that. It is one of the highest in the world.",
        "We are.assuming that the numbers that come.out of this govt is honest. That is a big assumption. All data collection institutions are rigged and numbers are pulled out of their rear. My opinion.",
        "No it’s not that high first of all and second cpi basket itself is based on how an average guy spends.",
        "Because it’s pointless. Education, real estate, medical inflation are easily 15%+ over the past few years. On top of that, Nirmala Tai doesn’t adjust tax slabs with inflation and adds new surcharges every year.\n\nIn real term, even if I get 10-12% salary growth every year(which is India’s nominal GDP growth) and inflation of items I consume is more than that I’m actually experiencing de growth. Add to that the fact that my taxes as a percentage of income grow every year (thanks Tai) it just stinks it up even more.",
        "Nirmala Tai being FM means taxes are going even higher. This government just wants to confiscate everything from the salaried class and then embezzle it using over inflated receipts on substandard infrastructure.",
        "CPI doesn’t include real estate properly. Only rent whose index doesn’t reflect reality, and given low weightage. House prices increasing aren’t even captured.\n\nHousing (purchase and rent) are one of the biggest expenses anyone has in their life",
        "Yeah I think 10 percent weightage which is quite low.",
        "Haha very accurate, imo populist subsidies will also now increase!",
        "7-9% interest on savings account??",
        "Is there anyway I can leave the country with a bachelors and 12 years of work experience? I don’t want to go to Canada or the US. I’d prefer Europe where atleast there are social safety nets I can invest in through the taxes I pay.",
        "As a deflator also they take wpi instead of cpi! And cpi is much higher than wpi. Upar se they only consider input prices.",
        "More like top 1%. If you earn more than 25k/month you are top top 10% in India",
        "Apparently yes because he can now feel superior to that other group standing there with fewer aggregate umbrellas.",
        "Remind me! 2 days",
        "I will be messaging you in 2 days on [**2024-06-27 20:19:31 UTC**](http://www.wolframalpha.com/input/?i=2024-06-27%2020:19:31%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1do7og1/why_indians_arent_happy_with_8_economic_growth/la9crrm/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1do7og1%2Fwhy_indians_arent_happy_with_8_economic_growth%2Fla9crrm%2F%5D%0A%0ARemindMe%21%202024-06-27%2020%3A19%3A31%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201do7og1)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        "So we are straight up making things up now? Which savings account is giving you 9% interest?",
        "How much is the rate these days? If it’s even lower then that answers and making it even worse.",
        "well, neither is inflation 10% (not the cpi at least), nor the interest rates 9%\n\nto reply to your comment with some actual numbers, hdfc offers a 3% interest on savings accounts right now , while petrol, a good indicator of inflation has shown inflation of about 7% since 2020, not too bad for a developing economy",
        "This is inaccurate. Sure this guy may have 20 extra umbrellas but the person who never had an umbrella before has one now.",
        "What if the guy deserved two, but because of crony capitalism just got one or even none at all? I am not making a commentary on capitalism here but crony  capitalism in the context of india!",
        "Taxes, inflation 😭",
        "I highly support high taxes and increasing taxes in India. But given this government, it is more likely to make the rich richer than help the lower classes with that money. \nRoad construction helps the upper class more than the lower class. If they had focused it on railway instead, it would have helped lower classes more.",
        "Hindus not happy with hindu growth rate?\n\nThats a shocker!!",
        "https://www.business-standard.com/finance/personal-finance/germany-s-new-visa-rules-great-opportunity-for-skilled-foreign-workers-124053000610_1.html",
        "Most of the growth is in top 5-10 percent of Indian...the rest are just Poor ....",
        "Growth rukwa di paw paw",
        "Pass on the same jobs down family and support more nepotismic practices and then cry about economic disparity is typical in our country.",
        "8% for whom?",
        "with no good service in return",
        "True",
        "that's a grossly underrated number, People own lots of land, have wealth, assets, no way this 10% 25K pm is close to reality. This could be just numbers from organized sector and people who pay tax. Ask how much your chole bhature wala makes and does he file taxes.",
        "Link without paywall:\n\nhttps://www.deccanherald.com/opinion/why-indians-arent-happy-with-8-economic-growth-3070661",
        "With shit railways",
        "Haven't these numbers been given by the World Bank and IMF? Do these govt. institutions report false numbers?",
        "Was looking for this",
        "We do realise that a lower growth rate would reduce the tax collection and end up affecting poor people the most?",
        "GDP should only be used when comparing one country to another.\nFor the people GDP per capita should be used. And that will reveal all the jumlas of this gobhi sarkar.",
        "Opposite tho"
    ],
    "cleaned_text": "indians arent happy economic growth longdelayed survey small firms offers clues ails fastgrowing economy ",
    "cleaned_title": "indians arent happy economic growth",
    "cleaned_selftext": "longdelayed survey small firms offers clues ails fastgrowing economy",
    "cleaned_comments": "archive linkhttpsarchiveishttpswwwbloombergcomopinionarticlesindiasfastgrowingeconomyhasaproblem growth rate meaningless gdp pointless salary middle class largely remains low lagging behind tldr meaning india packet lays also burden high taxes income goes boss goes doesnt necessarily mean celebrating average guys dont noticed private consumption feeble growth rate thats means people dont money spend also growth majorly boosted government capex private expenditure still isnt stepping per expectations plus huge gap gdp gva decreased subsidies high taxes past year think thats gon na change also unemployment last years low monsoon dt el nio really affected rural economy guy without umbrella happy total umbrellas ya much real inflation daddy robber baron growth common man sees nothing except skyrocketing inflation comment higher also quoted really nice article inflation interest savings acc growth india joke poors cut back basic things like food meds clothes decent living home ie stinking survive people like us cut good clothes healthy food decent living home coz pay emi rent people earn lakhs month tell world revolve around people keep saying india progressing thats top inflation percent high high mate affect aam janta friends ports antilla benefit average indian spends much food read close something high like one highest world areassuming numbers comeout govt honest big assumption data collection institutions rigged numbers pulled rear opinion high first second cpi basket based average guy spends pointless education real estate medical inflation easily past years top nirmala tai doesnt adjust tax slabs inflation adds new surcharges every year real term even get salary growth every yearwhich indias nominal gdp growth inflation items consume im actually experiencing de growth add fact taxes percentage income grow every year thanks tai stinks even nirmala tai fm means taxes going even higher government wants confiscate everything salaried class embezzle using inflated receipts substandard infrastructure cpi doesnt include real estate properly rent whose index doesnt reflect reality given low weightage house prices increasing arent even captured housing purchase rent one biggest expenses anyone life yeah think percent weightage quite low haha accurate imo populist subsidies also increase interest savings account anyway leave country bachelors years work experience dont want go canada us id prefer europe atleast social safety nets invest taxes pay deflator also take wpi instead cpi cpi much higher wpi upar se consider input prices like top earn kmonth top top india apparently yes feel superior group standing fewer aggregate umbrellas remind days messaging days utchttpwwwwolframalphacominputiutctolocaltime remind linkhttpswwwredditcomrindiacommentsdoogwhyindiansarenthappywitheconomicgrowthlacrrmcontext click linkhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessagebhttpsaffwwwredditcomfrfindiafcommentsfdoogfwhyindiansarenthappywitheconomicgrowthflacrrmfdaaremindmeaautc send pm also reminded reduce spam parent commenter delete message hide othershttpswwwredditcommessagecomposetoremindmebotsubjectdeletecommentmessagedeletedoog infohttpswwwredditcomrremindmebotcommentsebkoremindmebotinfovcustomhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessageblinkormessageinsidesquarebracketsdaaremindmetimeperiodhereyour remindershttpswwwredditcommessagecomposetoremindmebotsubjectlistofremindersmessagemyremindersfeedbackhttpswwwredditcommessagecomposetowatchfulsubjectremindmebotfeedback straight making things savings account giving interest much rate days even lower answers making even worse well neither inflation cpi least interest rates reply comment actual numbers hdfc offers interest savings accounts right petrol good indicator inflation shown inflation since bad developing economy inaccurate sure guy may extra umbrellas person never umbrella one guy deserved two crony capitalism got one even none making commentary capitalism crony capitalism context india taxes inflation highly support high taxes increasing taxes india given government likely make rich richer help lower classes money road construction helps upper class lower class focused railway instead would helped lower classes hindus happy hindu growth rate thats shocker growth top percent indianthe rest poor growth rukwa di paw paw pass jobs family support nepotismic practices cry economic disparity typical country good service return true thats grossly underrated number people lots land wealth assets way k pm close reality could numbers organized sector people pay tax ask much chole bhature wala makes file taxes link without paywall shit railways havent numbers given world bank imf govt institutions report false numbers looking realise lower growth rate would reduce tax collection end affecting poor people gdp used comparing one country another people gdp per capita used reveal jumlas gobhi sarkar opposite tho",
    "light_cleaned_title": "Why Indians Aren’t Happy With 8% Economic Growth",
    "light_cleaned_selftext": "A long-delayed survey of small firms offers clues to what ails the fast-growing economy.",
    "light_cleaned_comments": "[Archive link](https://archive.is/2024.06.18-005202/https://www.bloomberg.com/opinion/articles/2024-06-17/india-s-fast-growing-economy-has-a-problem). The growth rate is meaningless and the GdP is pointless as the salary of the middle class largely remains low and lagging behind Tldr; meaning _India is packet of **‘Lays’**_ . Also burden of high taxes When my income goes up 0%, but my boss’ goes up 16%, that doesn’t necessarily mean we’re both celebrating our average. Guys I don’t if you have noticed but private consumption has a feeble growth rate, that’s means people don’t have money to spend. Also this growth is majorly boosted by government capex, private expenditure is still isn’t stepping up as per expectations. Plus there is a huge gap between gdp and gva because of decreased subsidies and high taxes this past year, I think that’s gonna change too! Also unemployment and last year’s low monsoon d/t El Niño really affected rural economy! Should the guy without an umbrella be happy that both of them have a total of 5 umbrellas? Ya how much after real inflation daddy, -2 % Robber Baron growth. Common man sees nothing except skyrocketing inflation. This comment should be up higher. Also I have a quoted a really nice article! Inflation 10%, interest on savings acc 7-9%. 8% growth in India is a joke. Poor's have to cut back on basic things like food, meds, clothes, a decent living home i.e. not stinking just to survive. People like us cut on good clothes, healthy food, a decent living home, just coz we can pay EMI or rent. people who earn lakhs a month; tell me? does the world revolve around you. People keep saying India is progressing but that's just for top 10%. Inflation is not 10 percent! It’s high but it’s not this high mate. Because it does not affect the aam janta , only the friends who own ports or Antilla benefit from this And average Indian spends how much on food? I read some where that it is close to 40% or something high like that. It is one of the highest in the world. We are.assuming that the numbers that come.out of this govt is honest. That is a big assumption. All data collection institutions are rigged and numbers are pulled out of their rear. My opinion. No it’s not that high first of all and second cpi basket itself is based on how an average guy spends. Because it’s pointless. Education, real estate, medical inflation are easily 15%+ over the past few years. On top of that, Nirmala Tai doesn’t adjust tax slabs with inflation and adds new surcharges every year. In real term, even if I get 10-12% salary growth every year(which is India’s nominal GDP growth) and inflation of items I consume is more than that I’m actually experiencing de growth. Add to that the fact that my taxes as a percentage of income grow every year (thanks Tai) it just stinks it up even more. Nirmala Tai being FM means taxes are going even higher. This government just wants to confiscate everything from the salaried class and then embezzle it using over inflated receipts on substandard infrastructure. CPI doesn’t include real estate properly. Only rent whose index doesn’t reflect reality, and given low weightage. House prices increasing aren’t even captured. Housing (purchase and rent) are one of the biggest expenses anyone has in their life Yeah I think 10 percent weightage which is quite low. Haha very accurate, imo populist subsidies will also now increase! 7-9% interest on savings account?? Is there anyway I can leave the country with a bachelors and 12 years of work experience? I don’t want to go to Canada or the US. I’d prefer Europe where atleast there are social safety nets I can invest in through the taxes I pay. As a deflator also they take wpi instead of cpi! And cpi is much higher than wpi. Upar se they only consider input prices. More like top 1%. If you earn more than 25k/month you are top top 10% in India Apparently yes because he can now feel superior to that other group standing there with fewer aggregate umbrellas. Remind me! 2 days I will be messaging you in 2 days on [**2024-06-27 20:19:31 UTC**](http://www.wolframalpha.com/input/?i=2024-06-27%2020:19:31%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1do7og1/why_indians_arent_happy_with_8_economic_growth/la9crrm/?context=3) [**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1do7og1%2Fwhy_indians_arent_happy_with_8_economic_growth%2Fla9crrm%2F%5D%0A%0ARemindMe%21%202024-06-27%2020%3A19%3A31%20UTC) to send a PM to also be reminded and to reduce spam. ^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201do7og1) ***** |[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)| |-|-|-|-| So we are straight up making things up now? Which savings account is giving you 9% interest? How much is the rate these days? If it’s even lower then that answers and making it even worse. well, neither is inflation 10% (not the cpi at least), nor the interest rates 9% to reply to your comment with some actual numbers, hdfc offers a 3% interest on savings accounts right now , while petrol, a good indicator of inflation has shown inflation of about 7% since 2020, not too bad for a developing economy This is inaccurate. Sure this guy may have 20 extra umbrellas but the person who never had an umbrella before has one now. What if the guy deserved two, but because of crony capitalism just got one or even none at all? I am not making a commentary on capitalism here but crony capitalism in the context of india! Taxes, inflation 😭 I highly support high taxes and increasing taxes in India. But given this government, it is more likely to make the rich richer than help the lower classes with that money. Road construction helps the upper class more than the lower class. If they had focused it on railway instead, it would have helped lower classes more. Hindus not happy with hindu growth rate? Thats a shocker!! Most of the growth is in top 5-10 percent of Indian...the rest are just Poor .... Growth rukwa di paw paw Pass on the same jobs down family and support more nepotismic practices and then cry about economic disparity is typical in our country. 8% for whom? with no good service in return True that's a grossly underrated number, People own lots of land, have wealth, assets, no way this 10% 25K pm is close to reality. This could be just numbers from organized sector and people who pay tax. Ask how much your chole bhature wala makes and does he file taxes. Link without paywall: With shit railways Haven't these numbers been given by the World Bank and IMF? Do these govt. institutions report false numbers? Was looking for this We do realise that a lower growth rate would reduce the tax collection and end up affecting poor people the most? GDP should only be used when comparing one country to another. For the people GDP per capita should be used. And that will reveal all the jumlas of this gobhi sarkar. Opposite tho"
}