{
    "id": "16kr37h",
    "title": "From 1-Oct-23, Birth Certificate will be the single document needed to get admission in educational institutions, getting driving licenses, applying for Aadhaar / Passport, registration of marriage etc",
    "url": "https://www.reddit.com/r/india/comments/16kr37h/from_1oct23_birth_certificate_will_be_the_single/",
    "selftext": "Source:\n\n###India Today\n##Sep 14, 2023\n#[Birth certificate can soon be used to apply for Aadhaar, driving license, more](https://www.indiatoday.in/india/story/birth-certificate-to-be-single-document-for-various-services-from-october-1-after-registration-of-births-and-deaths-amendment-act-2023-2435771-2023-09-14)\n\n>A new amended law will facilitate the use of a birth certificate as a single document for a host of works and services like **admission to educational institutes**, issuance of driving licences, applying for an Aadhaar Card or a passport and registration of marriage and will come into effect from October 1.\n\n>The law will provide for use of the birth certificate as a single document to prove the date and place of birth of a person born on or after the date of commencement of the Registration of Births and Deaths (Amendment) Act, 2023, for **admission to an educational institution**, issuance of driving licence, preparation of voter list, marriage registration, appointment to a post in central or state government or a local body or public sector undertaking or in any statutory or autonomous body under the central or state government.\n\n>It will help create a **national and state-level database** of registered births and deaths which eventually would ensure efficient and transparent delivery of public services and social benefits, and digital registration.\n\n***To get more context and to folllow the chronology of policy direction, you can see the below news stories***\n\n###Indian Express\n##August 8, 2023\n#[Registration of Births & Deaths (Amendment) Bill passed in RS](https://indianexpress.com/article/india/registration-of-births-deaths-amendment-bill-passed-in-rs-8881518/)\n\n>Rajya Sabha on Monday passed a Bill that allows the use of a birth certificate as a single document for **admission to an educational institution**, issuance of a driving licence, preparation of voter list, Aadhaar number, registration of marriage or appointment to a government job.\n\n###Indian Express\n##August 1, 2023\n#[Lok Sabha passes Registration of Births and Deaths Bill by voice vote amid Oppn din](https://indianexpress.com/article/india/lok-sabha-passes-registration-of-births-and-deaths-bill-voice-vote-8871344/)\n\n>The Registration of Births and Deaths (Amendment) Bill makes provisions for digital registration and electronic delivery of certificates of births and deaths for the benefit of public at large.\n\n>It also aims to create a **national and state-level database** of registered births and deaths, which would help in updating other databases resulting in efficient and transparent delivery of public services and social benefits. It also makes provisions for collection of Aadhaar numbers of parents and informants, if available, in case of birth registration.\n\n###PRS Legislative Research\n## July 26, 2023\n#[Bill Summary - The Registration of Births and Deaths Amendment Bill, 2023](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bill_Summary_Registration_of_Births_and_Deaths_\\(Amendment\\)_Bill_2023.pdf)\n\n>Connecting database: The Bill states that the \nnational database may be made available to other \nauthorities preparing or maintaining other \ndatabases. Such databases include: (i) population \nregister, (ii) electoral rolls, (iii) ration card, and \n(iv) any other national databases as notified. The \nuse of the national database must be approved by \nthe central government. Similarly, the state \ndatabase may be made available to authorities \ndealing with other state databases, subject to. \nstate government’s approval.\n\n>Use of birth certificate: The Bill requires the use \nof birth and death certificates to prove the date \nand place of birth for persons born on or after this\nBill comes into effect. The information will be \nused for purposes including: (i) **admission to an \neducational institution**, (ii) **preparation of voter \nlist**, (iii) appointment to a government post, and \n(iv) any other purpose determined by the central \ngovernment.\n\n###Economic Times\n##Apr 26, 2023\n#[Aadhaar vetting by private entities against Supreme Court ruling: Experts](https://economictimes.indiatimes.com/tech/technology/aadhaar-vetting-by-private-entities-against-supreme-court-ruling-experts/articleshow/99769150.cms)\n\n>Former Supreme Court judge BN Srikrishna told ET: “The Supreme Court has already examined this aspect. It says it should not be done (allowing private entities to perform Aadhaar authentication). Now the government cannot issue a rule and overcome the Supreme Court judgement. Supreme Court judgement can only be overcome in a proper parliamentary enactment, if passed.”\n\n>The government cannot overcome the Supreme Court judgement by amending the IT rules, said Srikrishna, who headed a ten-member committee that released the first draft of the Personal Data Protection Bill in 2018.\n\n>“**The SC has said private entities cannot perform Aadhaar authentication**. No number of amendments to the IT Rules will help it. They will have to pass a special Act or amend the IT Act itself. That is the only way it can be done, otherwise it cannot be done,” he explained.\n\n###***Older news stories***\n\n###Indian Express\n##September 26, 2018\n#[Supreme Court rules Aadhaar not mandatory for bank accounts, mobile numbers, school admissions](https://indianexpress.com/article/india/aadhaar-verdict-supreme-court-judgment-uidai-5374829/)\n\n>While the majority judgment, written by Justice AK Sikri in concurrence with CJI Dipak Misra and Justice AM Khanwilkar, upheld seeding of PAN with Aadhaar, **it set aside linking Aadhaar to bank accounts and mobile phone numbers**. In his concurring decision, Justice Bhushan said the Central government had given sufficient reasons to uphold Section 7 of Aadhaar Act, which deals with grant of subsidies and welfare benefits.\n\n>Ruling that Aadhaar was **not compulsory for school admissions**, the SC said **no child could be denied benefits of any scheme for not having Aadhaar number. “CBSE, NEET, UGC cannot make Aadhaar mandatory, also it is not compulsory for school admissions**,” Justice AK Sikri, who is part of the five-judge bench that heard a clutch of petitions challenging the constitutional validity of the Aadhaar Act, said.\n\n###Indian Express\n##September 26, 2018\n#[Full text: Supreme Court Aadhaar judgment](https://indianexpress.com/article/india/aadhaar-verdict-full-text-judgment-supreme-court-order-5374794/)\n\nRead [full judgement](https://www.scribd.com/document/389491704/Supreme-Court-Aadhaar-Verdict) on Scribd",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694923773.0,
    "convurl": "https://external-preview.redd.it/nRMO53YXGwOlUQJzTrf3HIm0ZppCxW4f52KoHufGUpo.jpg?auto=webp&s=cbd5485c4152a6eca0bb3c2660da2f83d7896ba7",
    "comments": [
        "Thanks for writing this post.\n\nToo bad that no one is following the SC ruling of 2018.",
        "I think the rule implies that it's *sufficient*, not *needed* (at least on paper).",
        "My cousin who didn't have his own adhaar, made one 3 months back. The application is still not accepted and is pending for approval since then. I know it probably due to his age factor (18+), but we had all necessary documents. Wonder if this will help him out.",
        "Tl;dr \n\nThis applicable only for those born in and after October 2023."
    ],
    "cleaned_text": "oct birth certificate single document needed get admission educational institutions getting driving licenses applying aadhaar passport registration marriage etc source india today sep birth certificate soon used apply aadhaar driving license morehttpswwwindiatodayinindiastorybirthcertificatetobesingledocumentforvariousservicesfromoctoberafterregistrationofbirthsanddeathsamendmentact new amended law facilitate use birth certificate single document host works services like admission educational institutes issuance driving licences applying aadhaar card passport registration marriage come effect october law provide use birth certificate single document prove date place birth person born date commencement registration births deaths amendment act admission educational institution issuance driving licence preparation voter list marriage registration appointment post central state government local body public sector undertaking statutory autonomous body central state government help create national statelevel database registered births deaths eventually would ensure efficient transparent delivery public services social benefits digital registration get context folllow chronology policy direction see news stories indian express august registration births deaths amendment bill passed rshttpsindianexpresscomarticleindiaregistrationofbirthsdeathsamendmentbillpassedinrs rajya sabha monday passed bill allows use birth certificate single document admission educational institution issuance driving licence preparation voter list aadhaar number registration marriage appointment government job indian express august lok sabha passes registration births deaths bill voice vote amid oppn dinhttpsindianexpresscomarticleindialoksabhapassesregistrationofbirthsanddeathsbillvoicevote registration births deaths amendment bill makes provisions digital registration electronic delivery certificates births deaths benefit public large also aims create national statelevel database registered births deaths would help updating databases resulting efficient transparent delivery public services social benefits also makes provisions collection aadhaar numbers parents informants available case birth registration prs legislative research july bill summary registration births deaths amendment bill httpsprsindiaorgfilesbillsactsbillsparliamentbillsummaryregistrationofbirthsanddeathsamendmentbillpdf connecting database bill states national database may made available authorities preparing maintaining databases databases include population register ii electoral rolls iii ration card iv national databases notified use national database must approved central government similarly state database may made available authorities dealing state databases subject state governments approval use birth certificate bill requires use birth death certificates prove date place birth persons born bill comes effect information used purposes including admission educational institution ii preparation voter list iii appointment government post iv purpose determined central government economic times apr aadhaar vetting private entities supreme court ruling expertshttpseconomictimesindiatimescomtechtechnologyaadhaarvettingbyprivateentitiesagainstsupremecourtrulingexpertsarticleshowcms former supreme court judge bn srikrishna told et supreme court already examined aspect says done allowing private entities perform aadhaar authentication government issue rule overcome supreme court judgement supreme court judgement overcome proper parliamentary enactment passed government overcome supreme court judgement amending rules said srikrishna headed tenmember committee released first draft personal data protection bill sc said private entities perform aadhaar authentication number amendments rules help pass special act amend act way done otherwise done explained older news stories indian express september supreme court rules aadhaar mandatory bank accounts mobile numbers school admissionshttpsindianexpresscomarticleindiaaadhaarverdictsupremecourtjudgmentuidai majority judgment written justice ak sikri concurrence cji dipak misra justice khanwilkar upheld seeding pan aadhaar set aside linking aadhaar bank accounts mobile phone numbers concurring decision justice bhushan said central government given sufficient reasons uphold section aadhaar act deals grant subsidies welfare benefits ruling aadhaar compulsory school admissions sc said child could denied benefits scheme aadhaar number cbse neet ugc make aadhaar mandatory also compulsory school admissions justice ak sikri part fivejudge bench heard clutch petitions challenging constitutional validity aadhaar act said indian express september full text supreme court aadhaar judgmenthttpsindianexpresscomarticleindiaaadhaarverdictfulltextjudgmentsupremecourtorder read full judgementhttpswwwscribdcomdocumentsupremecourtaadhaarverdict scribd ",
    "cleaned_title": "oct birth certificate single document needed get admission educational institutions getting driving licenses applying aadhaar passport registration marriage etc",
    "cleaned_selftext": "source india today sep birth certificate soon used apply aadhaar driving license morehttpswwwindiatodayinindiastorybirthcertificatetobesingledocumentforvariousservicesfromoctoberafterregistrationofbirthsanddeathsamendmentact new amended law facilitate use birth certificate single document host works services like admission educational institutes issuance driving licences applying aadhaar card passport registration marriage come effect october law provide use birth certificate single document prove date place birth person born date commencement registration births deaths amendment act admission educational institution issuance driving licence preparation voter list marriage registration appointment post central state government local body public sector undertaking statutory autonomous body central state government help create national statelevel database registered births deaths eventually would ensure efficient transparent delivery public services social benefits digital registration get context folllow chronology policy direction see news stories indian express august registration births deaths amendment bill passed rshttpsindianexpresscomarticleindiaregistrationofbirthsdeathsamendmentbillpassedinrs rajya sabha monday passed bill allows use birth certificate single document admission educational institution issuance driving licence preparation voter list aadhaar number registration marriage appointment government job indian express august lok sabha passes registration births deaths bill voice vote amid oppn dinhttpsindianexpresscomarticleindialoksabhapassesregistrationofbirthsanddeathsbillvoicevote registration births deaths amendment bill makes provisions digital registration electronic delivery certificates births deaths benefit public large also aims create national statelevel database registered births deaths would help updating databases resulting efficient transparent delivery public services social benefits also makes provisions collection aadhaar numbers parents informants available case birth registration prs legislative research july bill summary registration births deaths amendment bill httpsprsindiaorgfilesbillsactsbillsparliamentbillsummaryregistrationofbirthsanddeathsamendmentbillpdf connecting database bill states national database may made available authorities preparing maintaining databases databases include population register ii electoral rolls iii ration card iv national databases notified use national database must approved central government similarly state database may made available authorities dealing state databases subject state governments approval use birth certificate bill requires use birth death certificates prove date place birth persons born bill comes effect information used purposes including admission educational institution ii preparation voter list iii appointment government post iv purpose determined central government economic times apr aadhaar vetting private entities supreme court ruling expertshttpseconomictimesindiatimescomtechtechnologyaadhaarvettingbyprivateentitiesagainstsupremecourtrulingexpertsarticleshowcms former supreme court judge bn srikrishna told et supreme court already examined aspect says done allowing private entities perform aadhaar authentication government issue rule overcome supreme court judgement supreme court judgement overcome proper parliamentary enactment passed government overcome supreme court judgement amending rules said srikrishna headed tenmember committee released first draft personal data protection bill sc said private entities perform aadhaar authentication number amendments rules help pass special act amend act way done otherwise done explained older news stories indian express september supreme court rules aadhaar mandatory bank accounts mobile numbers school admissionshttpsindianexpresscomarticleindiaaadhaarverdictsupremecourtjudgmentuidai majority judgment written justice ak sikri concurrence cji dipak misra justice khanwilkar upheld seeding pan aadhaar set aside linking aadhaar bank accounts mobile phone numbers concurring decision justice bhushan said central government given sufficient reasons uphold section aadhaar act deals grant subsidies welfare benefits ruling aadhaar compulsory school admissions sc said child could denied benefits scheme aadhaar number cbse neet ugc make aadhaar mandatory also compulsory school admissions justice ak sikri part fivejudge bench heard clutch petitions challenging constitutional validity aadhaar act said indian express september full text supreme court aadhaar judgmenthttpsindianexpresscomarticleindiaaadhaarverdictfulltextjudgmentsupremecourtorder read full judgementhttpswwwscribdcomdocumentsupremecourtaadhaarverdict scribd",
    "cleaned_comments": "thanks writing post bad one following sc ruling think rule implies sufficient needed least paper cousin didnt adhaar made one months back application still accepted pending approval since know probably due age factor necessary documents wonder help tldr applicable born october",
    "light_cleaned_title": "From 1-Oct-23, Birth Certificate will be the single document needed to get admission in educational institutions, getting driving licenses, applying for Aadhaar / Passport, registration of marriage etc",
    "light_cleaned_selftext": "Source: ###India Today ##Sep 14, 2023 #[Birth certificate can soon be used to apply for Aadhaar, driving license, more](https://www.indiatoday.in/india/story/birth-certificate-to-be-single-document-for-various-services-from-october-1-after-registration-of-births-and-deaths-amendment-act-2023-2435771-2023-09-14) >A new amended law will facilitate the use of a birth certificate as a single document for a host of works and services like **admission to educational institutes**, issuance of driving licences, applying for an Aadhaar Card or a passport and registration of marriage and will come into effect from October 1. >The law will provide for use of the birth certificate as a single document to prove the date and place of birth of a person born on or after the date of commencement of the Registration of Births and Deaths (Amendment) Act, 2023, for **admission to an educational institution**, issuance of driving licence, preparation of voter list, marriage registration, appointment to a post in central or state government or a local body or public sector undertaking or in any statutory or autonomous body under the central or state government. >It will help create a **national and state-level database** of registered births and deaths which eventually would ensure efficient and transparent delivery of public services and social benefits, and digital registration. ***To get more context and to folllow the chronology of policy direction, you can see the below news stories*** ###Indian Express ##August 8, 2023 #[Registration of Births & Deaths (Amendment) Bill passed in RS](https://indianexpress.com/article/india/registration-of-births-deaths-amendment-bill-passed-in-rs-8881518/) >Rajya Sabha on Monday passed a Bill that allows the use of a birth certificate as a single document for **admission to an educational institution**, issuance of a driving licence, preparation of voter list, Aadhaar number, registration of marriage or appointment to a government job. ###Indian Express ##August 1, 2023 #[Lok Sabha passes Registration of Births and Deaths Bill by voice vote amid Oppn din](https://indianexpress.com/article/india/lok-sabha-passes-registration-of-births-and-deaths-bill-voice-vote-8871344/) >The Registration of Births and Deaths (Amendment) Bill makes provisions for digital registration and electronic delivery of certificates of births and deaths for the benefit of public at large. >It also aims to create a **national and state-level database** of registered births and deaths, which would help in updating other databases resulting in efficient and transparent delivery of public services and social benefits. It also makes provisions for collection of Aadhaar numbers of parents and informants, if available, in case of birth registration. ###PRS Legislative Research ## July 26, 2023 #[Bill Summary - The Registration of Births and Deaths Amendment Bill, 2023](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bill_Summary_Registration_of_Births_and_Deaths_\\(Amendment\\)_Bill_2023.pdf) >Connecting database: The Bill states that the national database may be made available to other authorities preparing or maintaining other databases. Such databases include: (i) population register, (ii) electoral rolls, (iii) ration card, and (iv) any other national databases as notified. The use of the national database must be approved by the central government. Similarly, the state database may be made available to authorities dealing with other state databases, subject to. state government’s approval. >Use of birth certificate: The Bill requires the use of birth and death certificates to prove the date and place of birth for persons born on or after this Bill comes into effect. The information will be used for purposes including: (i) **admission to an educational institution**, (ii) **preparation of voter list**, (iii) appointment to a government post, and (iv) any other purpose determined by the central government. ###Economic Times ##Apr 26, 2023 #[Aadhaar vetting by private entities against Supreme Court ruling: Experts](https://economictimes.indiatimes.com/tech/technology/aadhaar-vetting-by-private-entities-against-supreme-court-ruling-experts/articleshow/99769150.cms) >Former Supreme Court judge BN Srikrishna told ET: “The Supreme Court has already examined this aspect. It says it should not be done (allowing private entities to perform Aadhaar authentication). Now the government cannot issue a rule and overcome the Supreme Court judgement. Supreme Court judgement can only be overcome in a proper parliamentary enactment, if passed.” >The government cannot overcome the Supreme Court judgement by amending the IT rules, said Srikrishna, who headed a ten-member committee that released the first draft of the Personal Data Protection Bill in 2018. >“**The SC has said private entities cannot perform Aadhaar authentication**. No number of amendments to the IT Rules will help it. They will have to pass a special Act or amend the IT Act itself. That is the only way it can be done, otherwise it cannot be done,” he explained. ###***Older news stories*** ###Indian Express ##September 26, 2018 #[Supreme Court rules Aadhaar not mandatory for bank accounts, mobile numbers, school admissions](https://indianexpress.com/article/india/aadhaar-verdict-supreme-court-judgment-uidai-5374829/) >While the majority judgment, written by Justice AK Sikri in concurrence with CJI Dipak Misra and Justice AM Khanwilkar, upheld seeding of PAN with Aadhaar, **it set aside linking Aadhaar to bank accounts and mobile phone numbers**. In his concurring decision, Justice Bhushan said the Central government had given sufficient reasons to uphold Section 7 of Aadhaar Act, which deals with grant of subsidies and welfare benefits. >Ruling that Aadhaar was **not compulsory for school admissions**, the SC said **no child could be denied benefits of any scheme for not having Aadhaar number. “CBSE, NEET, UGC cannot make Aadhaar mandatory, also it is not compulsory for school admissions**,” Justice AK Sikri, who is part of the five-judge bench that heard a clutch of petitions challenging the constitutional validity of the Aadhaar Act, said. ###Indian Express ##September 26, 2018 #[Full text: Supreme Court Aadhaar judgment](https://indianexpress.com/article/india/aadhaar-verdict-full-text-judgment-supreme-court-order-5374794/) Read [full judgement](https://www.scribd.com/document/389491704/Supreme-Court-Aadhaar-Verdict) on Scribd",
    "light_cleaned_comments": "Thanks for writing this post. Too bad that no one is following the SC ruling of 2018. I think the rule implies that it's *sufficient*, not *needed* (at least on paper). My cousin who didn't have his own adhaar, made one 3 months back. The application is still not accepted and is pending for approval since then. I know it probably due to his age factor (18+), but we had all necessary documents. Wonder if this will help him out. Tl;dr This applicable only for those born in and after October 2023."
}