{
    "id": "15en9xl",
    "title": "Zomato Gold mini scam",
    "url": "https://www.reddit.com/gallery/15en9xl",
    "selftext": "Same items added. Left one is a Zomato gold screenshot, right one is no membership. Somehow GST is different even though same items are added. Furthermore, no membership account gets the same order roughly 120 Rs cheaper (after applying a coupon which is unavailable for gold members). Even if we remove  72 Rs delivery charges, it is still expensive on Gold by around 50 Rs",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690826529.0,
    "convurl": "https://i.redd.it/npc14q6dbcfb1.jpg",
    "comments": [
        "Laal hai 🔴laal hai 🔴….. Sara khela laal hai !!",
        "Hmmm, thnx for sharing this\n\nI also want to add that GST on NIC is generally high, like I have seen this high GST now a few times. You should try buying this physically too, you might get for a low price.\n\nYou should probably contact the customer service of zomato too, they might help if this is a glitch or something, or this might be a slight fraud they are doing with customers.",
        "Uninstalled zomato."
    ],
    "cleaned_text": "zomato gold mini scam items added left one zomato gold screenshot right one membership somehow gst different even though items added furthermore membership account gets order roughly rs cheaper applying coupon unavailable gold members even remove rs delivery charges still expensive gold around rs ",
    "cleaned_title": "zomato gold mini scam",
    "cleaned_selftext": "items added left one zomato gold screenshot right one membership somehow gst different even though items added furthermore membership account gets order roughly rs cheaper applying coupon unavailable gold members even remove rs delivery charges still expensive gold around rs",
    "cleaned_comments": "laal hai laal hai sara khela laal hai hmmm thnx sharing also want add gst nic generally high like seen high gst times try buying physically might get low price probably contact customer service zomato might help glitch something might slight fraud customers uninstalled zomato",
    "light_cleaned_title": "Zomato Gold mini scam",
    "light_cleaned_selftext": "Same items added. Left one is a Zomato gold screenshot, right one is no membership. Somehow GST is different even though same items are added. Furthermore, no membership account gets the same order roughly 120 Rs cheaper (after applying a coupon which is unavailable for gold members). Even if we remove 72 Rs delivery charges, it is still expensive on Gold by around 50 Rs",
    "light_cleaned_comments": "Laal hai 🔴laal hai 🔴….. Sara khela laal hai !! Hmmm, thnx for sharing this I also want to add that GST on NIC is generally high, like I have seen this high GST now a few times. You should try buying this physically too, you might get for a low price. You should probably contact the customer service of zomato too, they might help if this is a glitch or something, or this might be a slight fraud they are doing with customers. Uninstalled zomato."
}