{
    "id": "1ara9wo",
    "title": "Top 5 States who pays highest Direct Tax in India",
    "url": "https://finxfactor.com/how-maharashtra-leads-indias-direct-tax-collection/",
    "selftext": "Maharashtra pays the highest direct tax of INR 600,000 crores. No other state even come close to it.",
    "flair": "Policy/Economy",
    "score": 13,
    "num_comments": 5,
    "created_utc": 1707983188.0,
    "convurl": "https://external-preview.redd.it/UwkW165q4GU7tW4-3EfYPyjafRmFjWdhkkcb4q_bzKs.jpg?auto=webp&s=cb7713c4663234f7f03fd7bc668991d20b696e30",
    "comments": [
        "Expected. Isn't it?",
        "Yes, Expected. Looks difficult for any other state to come even close to it in next decade as well. I thought, bangalore software and start-up guys must be earning good but looks all in paper money 🤪..many start-ups later shift Office to Mumbai for financing; probably.",
        "This will be function of corporate headquarters address.  ",
        " Maharashtra should fight for separate nation!\n\n/s"
    ],
    "cleaned_text": "top states pays highest direct tax india maharashtra pays highest direct tax inr crores state even come close ",
    "cleaned_title": "top states pays highest direct tax india",
    "cleaned_selftext": "maharashtra pays highest direct tax inr crores state even come close",
    "cleaned_comments": "expected isnt yes expected looks difficult state come even close next decade well thought bangalore software startup guys must earning good looks paper money many startups later shift office mumbai financing probably function corporate headquarters address maharashtra fight separate nation",
    "light_cleaned_title": "Top 5 States who pays highest Direct Tax in India",
    "light_cleaned_selftext": "Maharashtra pays the highest direct tax of INR 600,000 crores. No other state even come close to it.",
    "light_cleaned_comments": "Expected. Isn't it? Yes, Expected. Looks difficult for any other state to come even close to it in next decade as well. I thought, bangalore software and start-up guys must be earning good but looks all in paper money 🤪..many start-ups later shift Office to Mumbai for financing; probably. This will be function of corporate headquarters address. Maharashtra should fight for separate nation! /s"
}