{
    "id": "16nc6ef",
    "title": "Parliament Watch Dispatches: an appreciation post for r/india",
    "url": "https://www.reddit.com/r/india/comments/16nc6ef/parliament_watch_dispatches_an_appreciation_post/",
    "selftext": "Hi, this is a appreciation post for the r/india community.\n\nI'm an old-timer here on Reddit India. This forum, honestly, is one big reason I started doing what I do right now.\n\n7 years ago, I used to do a series here called \"[Last Week in Parliament](https://www.reddit.com/r/india/comments/4h3ioz/last_week_in_the_indian_parliament_april_25_april/)\", where I gave updates on what is happening in the India Parliament, written in a fun consumable way. Back then I was working with an MP and had to do it anonymously, so Reddit was the best option. Strangely enough, an editor from newslaundry saw these posts and asked me to write for them. [So I did](https://www.newslaundry.com/2016/12/03/democracy-died-and-no-one-noticed).\n\nThat was my first foray into the public space and it's been a long journey since then. I am making this post because right now, it feels like I'm leveling up a bit, but also going back to what I used to do on this forum: Watch Parliament and tell you wtf is happening.\n\nStarted a youtube channel a month ago and I've been following the current session of Parliament closely. Now, Last week in Parliament is a daily video update and I thought it would be appropriate to share it on the forum where the idea first originated.\n\n[**Dispatch #1**](https://youtu.be/4fl8Sy4bSms?si=c2erq4K1p0THXER6)**: no country for parliamentary reforms**  \n[**Dispatch #2**](https://youtu.be/NlTTBYJv9Yc?si=wSIHIlL8Th0LnBMq)**: adarniya modiji's imperial march**\n\nI have no demands, no asks, just wanted to post this here and express how much I appreciate this community. This is where it all started for me afterall.  \n\n\nRegards,  \nKumbhakaran  \n",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695184842.0,
    "convurl": "https://external-preview.redd.it/2YRlGCSK3vxhlMYQ5MOiJ7ejJ4Vj2ET2TknhD0jPwQM.jpg",
    "comments": [
        "Hey Megh,Good to know that you're a fellow Redditor. Love the work that you guys do at Newslaundry. Hope to see you guys become the next HuffPost!!!\n\nGood Luck. Btw,I support to keep News Free.",
        "Well it’s always good to have good objective coverage of the parliamentary sessions. The way the current news channels work, it’s upto the guerrillas to keep things together. I’m curious to know if you post written summaries of your posts and give links to all the reference / research materials ?",
        "It's fun to watch India's most important yet under-rated reality show this way.\n\nKeep up the good work.",
        "dude ur kumbhkarna now ? \n\n Indrajit would have been more apt"
    ],
    "cleaned_text": "parliament watch dispatches appreciation post rindia hi appreciation post rindia community im oldtimer reddit india forum honestly one big reason started right years ago used series called last week parliamenthttpswwwredditcomrindiacommentshiozlastweekintheindianparliamentaprilapril gave updates happening india parliament written fun consumable way back working mp anonymously reddit best option strangely enough editor newslaundry saw posts asked write didhttpswwwnewslaundrycomdemocracydiedandnoonenoticed first foray public space long journey since making post right feels like im leveling bit also going back used forum watch parliament tell wtf happening started youtube channel month ago ive following current session parliament closely last week parliament daily video update thought would appropriate share forum idea first originated dispatch httpsyoutubeflsybsmssicerqkpthxer country parliamentary reforms dispatch httpsyoutubenlttbyjvycsiwsihillthlnbmq adarniya modijis imperial march demands asks wanted post express much appreciate community started afterall regards kumbhakaran ",
    "cleaned_title": "parliament watch dispatches appreciation post rindia",
    "cleaned_selftext": "hi appreciation post rindia community im oldtimer reddit india forum honestly one big reason started right years ago used series called last week parliamenthttpswwwredditcomrindiacommentshiozlastweekintheindianparliamentaprilapril gave updates happening india parliament written fun consumable way back working mp anonymously reddit best option strangely enough editor newslaundry saw posts asked write didhttpswwwnewslaundrycomdemocracydiedandnoonenoticed first foray public space long journey since making post right feels like im leveling bit also going back used forum watch parliament tell wtf happening started youtube channel month ago ive following current session parliament closely last week parliament daily video update thought would appropriate share forum idea first originated dispatch httpsyoutubeflsybsmssicerqkpthxer country parliamentary reforms dispatch httpsyoutubenlttbyjvycsiwsihillthlnbmq adarniya modijis imperial march demands asks wanted post express much appreciate community started afterall regards kumbhakaran",
    "cleaned_comments": "hey meghgood know youre fellow redditor love work guys newslaundry hope see guys become next huffpost good luck btwi support keep news free well always good good objective coverage parliamentary sessions way current news channels work upto guerrillas keep things together im curious know post written summaries posts give links reference research materials fun watch indias important yet underrated reality show way keep good work dude ur kumbhkarna indrajit would apt",
    "light_cleaned_title": "Parliament Watch Dispatches: an appreciation post for r/india",
    "light_cleaned_selftext": "Hi, this is a appreciation post for the r/india community. I'm an old-timer here on Reddit India. This forum, honestly, is one big reason I started doing what I do right now. 7 years ago, I used to do a series here called \"[Last Week in Parliament](https://www.reddit.com/r/india/comments/4h3ioz/last_week_in_the_indian_parliament_april_25_april/)\", where I gave updates on what is happening in the India Parliament, written in a fun consumable way. Back then I was working with an MP and had to do it anonymously, so Reddit was the best option. Strangely enough, an editor from newslaundry saw these posts and asked me to write for them. [So I did](https://www.newslaundry.com/2016/12/03/democracy-died-and-no-one-noticed). That was my first foray into the public space and it's been a long journey since then. I am making this post because right now, it feels like I'm leveling up a bit, but also going back to what I used to do on this forum: Watch Parliament and tell you wtf is happening. Started a youtube channel a month ago and I've been following the current session of Parliament closely. Now, Last week in Parliament is a daily video update and I thought it would be appropriate to share it on the forum where the idea first originated. [**Dispatch #1**](https://youtu.be/4fl8Sy4bSms?si=c2erq4K1p0THXER6)**: no country for parliamentary reforms** [**Dispatch #2**](https://youtu.be/NlTTBYJv9Yc?si=wSIHIlL8Th0LnBMq)**: adarniya modiji's imperial march** I have no demands, no asks, just wanted to post this here and express how much I appreciate this community. This is where it all started for me afterall. Regards, Kumbhakaran",
    "light_cleaned_comments": "Hey Megh,Good to know that you're a fellow Redditor. Love the work that you guys do at Newslaundry. Hope to see you guys become the next HuffPost!!! Good Luck. Btw,I support to keep News Free. Well it’s always good to have good objective coverage of the parliamentary sessions. The way the current news channels work, it’s upto the guerrillas to keep things together. I’m curious to know if you post written summaries of your posts and give links to all the reference / research materials ? It's fun to watch India's most important yet under-rated reality show this way. Keep up the good work. dude ur kumbhkarna now ? Indrajit would have been more apt"
}