{
    "id": "15e5v4v",
    "title": "Unlike China, India Cannot Be an Economic Superpower | by Ashoka Mody",
    "url": "https://www.project-syndicate.org/commentary/india-economic-boom-is-overhyped-by-ashoka-mody-2023-07?barrier=accesspaylog",
    "selftext": "Interesting read",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 29,
    "created_utc": 1690777178.0,
    "convurl": "https://external-preview.redd.it/7idr451dxxwMkCD9QG6vPKh5ypOOmvEMQ1WZt4rN0GU.jpg?auto=webp&s=d1181ff777e45a13147daa7faf35cc206fa9d29d",
    "comments": [
        ">To be sure, market liberalization greatly helped Chinese and Indian growth. But China built its successful development strategy on the twin pillars of human capital and gender equality, areas where India has lagged far behind.",
        "> Beginning in the mid-1980s, the prevailing belief among Indian and international observers was that the authoritarian Chinese regime would mismanage its economy, while democratic India would emerge as the bigger and more developed of the two.\n\n:(\n\n> The differences have been long in the making. In 1981, the World Bank contrasted China’s “outstandingly high” life expectancy of 64 years to India’s 51 years. Chinese citizens, it noted, were better fed than their Indian counterparts. Moreover, China provided nearly universal health care and its citizens – including women – enjoyed higher rates of primary education. \n\ndamn\n\n> While China’s female labor-force participation rate has decreased to roughly 62% from around 80% in 1990, India’s has fallen over the same period from 32% to around 25%. Especially in urban areas, violence against women has deterred Indian women from entering the workforce. \n\nJesus\n\n> China is also better prepared for future opportunities. Seven Chinese universities are ranked among the world’s top 100, with Tsinghua and Peking among the top 20. Tsinghua is considered the world’s leading university for computer science, while Peking is ranked ninth. Likewise, nine Chinese universities are among the top 50 globally in mathematics. By contrast, no Indian university, including the celebrated Indian Institutes of Technology, is ranked among the world’s top 100.\n\ngetting roasted here man",
        "You should be the new tldr bot. /s",
        "Banana yolo",
        "Lol no China built it's economy on cheap labour and hyper financialization.",
        "Experts have been predicting the end of China for decades. China still manages to do alright.",
        "U don't need to be an expert.\n\nThe fundamental problem with China is that it is a supply concentrated economy. They rely on 2 things for growth.\n\n1. Buyers\n\n2. US guaranteed maritime security (for a stable environment)\n\nBoth are on their way out. First world countries are getting older hence a lower consumer base and the US sees no benefit in spending its own money making China richer so it is receding from the world.\n\nI'm not concerned about growth. I'm genuinely concerned about the humanitarian crisis that will ensue when China completely implodes. They have a long history of authoritarian driven implosions. This one will be no different.",
        "I understand your concerns, but I am confident China will do alright. There's a lot of anti-china propaganda floating and has been for a long time. \n\nChina has built a fast and flexible bureaucracy guided by a decisive leadership. They have proven to have long term vision and political will to make things work.\n\nIMO China will be alright",
        "Yes.\n\nDriven by the unshakeable faith in your dogma. Contrary to all facts and reality :)",
        "Haha. Lets agree to disagree",
        "Lol sure mate.\n\nBecause the 2 positions are clearly equally valid. \n\nRegardless of data :)",
        "I've read too many dommsayer reports on China, full of \"facts and reality\" to take more of it seriously.",
        "Human capital and gender equality here both translate to cheap labor",
        "True",
        "> female labor-force participation rate has decreased to roughly 62% from around 80%\n\nPeople don't realize how mindboggling absurd this metric was. Not even West reached this figure for Women at it's peak developing phase and it drops post development anyway so today it no where near high 70% either.\n\nNever has a country in human history put women in labor-force at that scale as PRC under Deng did. And this happened because of the Social/Gender reforms passed in 50s (by force & top-down since Society wasn't actually ready for it).\n\nEven today China tops even OECD countries in Women's contribution to GDP (it was around 42% few years back, India is under 20%).\n\nAshoka Mody, his recent work though fair and gets many things right but his fundamental model is still old school. He still believes India can make it under the system of Liberal Democracy, which is a dogma since it NEVER worked for anyone ever during their developing cycle.\n\nIndia is trying to be the 1st in human history. Which is not impossible but without a track record of delivering even on other factors, it's a high stakes risk/sell.",
        "If Peter Zeihan said Sun is a type of Star, it should be triple questioned and checked to make sure if that really is the case.\n\nAnd if someone references Zeihan in a serious debate and esp on China, that person is automatically discredited for being a fool that lacks critical cognitive g-factor to engage on subject domain.",
        "True, people comparing Asian tigers / China to India don't understand how every method that those countries used to develop themselves has been relentlessly opposed in India in the name of democracy.",
        "Ok Varun. Very insightful analysis",
        "Tell me which year in the last 30 years China was NOT screwed according to these China \"experts\"?",
        "I see the China bots have paid my comment a visit.\n\nDon't know what Ur gaining by fooling urself. The fundamentals of the Chinese economy are as solid as quicksand. I've explained below",
        "Total",
        "Yello",
        "Nope.\n\nChina is screwed.\n\nJust read this: https://www.barnesandnoble.com/w/the-end-of-the-world-is-just-the-beginning-peter-zeihan/1140487926",
        "all new to you ?",
        "well maybe, just maybe Chinese men have certain level of lazy-assness so women have to pick up the slack, if only to earn more.",
        "so India also had/has cheap/cheaper labour, what of it ?",
        "only idiots buy/read that guys \"books\"",
        "For a while around 90s China also was like 1 of 2 or maybe only country in the world where Female Suicide rate was higher than Men.\n\nExplanations given were a few but none seemed comprehensive on their own (thing like easier access to industrial, heavy-duty scale poisons which can be agri-based drugs, etc. Or society-culture factors, etc). It was outlier but then it normalized and not it's back to how it's in rest of the world.\n\nHowever, whatever metric one uses to chart that period of Chinese history, it is without question that Women played an outsized role, possibly greater than had been played by women in ANY human society ever in history.",
        "Except that this one is solid logic. U can't make money when nobody's buying"
    ],
    "cleaned_text": "unlike china india economic superpower ashoka mody interesting read ",
    "cleaned_title": "unlike china india economic superpower ashoka mody",
    "cleaned_selftext": "interesting read",
    "cleaned_comments": "sure market liberalization greatly helped chinese indian growth china built successful development strategy twin pillars human capital gender equality areas india lagged far behind beginning mids prevailing belief among indian international observers authoritarian chinese regime would mismanage economy democratic india would emerge bigger developed two differences long making world bank contrasted chinas outstandingly high life expectancy years indias years chinese citizens noted better fed indian counterparts moreover china provided nearly universal health care citizens including women enjoyed higher rates primary education damn chinas female laborforce participation rate decreased roughly around indias fallen period around especially urban areas violence women deterred indian women entering workforce jesus china also better prepared future opportunities seven chinese universities ranked among worlds top tsinghua peking among top tsinghua considered worlds leading university computer science peking ranked ninth likewise nine chinese universities among top globally mathematics contrast indian university including celebrated indian institutes technology ranked among worlds top getting roasted man new tldr bot banana yolo lol china built economy cheap labour hyper financialization experts predicting end china decades china still manages alright u dont need expert fundamental problem china supply concentrated economy rely things growth buyers us guaranteed maritime security stable environment way first world countries getting older hence lower consumer base us sees benefit spending money making china richer receding world im concerned growth im genuinely concerned humanitarian crisis ensue china completely implodes long history authoritarian driven implosions one different understand concerns confident china alright theres lot antichina propaganda floating long time china built fast flexible bureaucracy guided decisive leadership proven long term vision political make things work imo china alright yes driven unshakeable faith dogma contrary facts reality haha lets agree disagree lol sure mate positions clearly equally valid regardless data ive read many dommsayer reports china full facts reality take seriously human capital gender equality translate cheap labor true female laborforce participation rate decreased roughly around people dont realize mindboggling absurd metric even west reached figure women peak developing phase drops post development anyway today near high either never country human history put women laborforce scale prc deng happened socialgender reforms passed force topdown since society wasnt actually ready even today china tops even oecd countries womens contribution gdp around years back india ashoka mody recent work though fair gets many things right fundamental model still old school still believes india make system liberal democracy dogma since never worked anyone ever developing cycle india trying st human history impossible without track record delivering even factors high stakes risksell peter zeihan said sun type star triple questioned checked make sure really case someone references zeihan serious debate esp china person automatically discredited fool lacks critical cognitive gfactor engage subject domain true people comparing asian tigers china india dont understand every method countries used develop relentlessly opposed india name democracy ok varun insightful analysis tell year last years china screwed according china experts see china bots paid comment visit dont know ur gaining fooling urself fundamentals chinese economy solid quicksand ive explained total yello nope china screwed read new well maybe maybe chinese men certain level lazyassness women pick slack earn india also hadhas cheapcheaper labour idiots buyread guys books around china also like maybe country world female suicide rate higher men explanations given none seemed comprehensive thing like easier access industrial heavyduty scale poisons agribased drugs etc societyculture factors etc outlier normalized back rest world however whatever metric one uses chart period chinese history without question women played outsized role possibly greater played women human society ever history except one solid logic u cant make money nobodys buying",
    "light_cleaned_title": "Unlike China, India Cannot Be an Economic Superpower | by Ashoka Mody",
    "light_cleaned_selftext": "Interesting read",
    "light_cleaned_comments": ">To be sure, market liberalization greatly helped Chinese and Indian growth. But China built its successful development strategy on the twin pillars of human capital and gender equality, areas where India has lagged far behind. > Beginning in the mid-1980s, the prevailing belief among Indian and international observers was that the authoritarian Chinese regime would mismanage its economy, while democratic India would emerge as the bigger and more developed of the two. :( > The differences have been long in the making. In 1981, the World Bank contrasted China’s “outstandingly high” life expectancy of 64 years to India’s 51 years. Chinese citizens, it noted, were better fed than their Indian counterparts. Moreover, China provided nearly universal health care and its citizens – including women – enjoyed higher rates of primary education. damn > While China’s female labor-force participation rate has decreased to roughly 62% from around 80% in 1990, India’s has fallen over the same period from 32% to around 25%. Especially in urban areas, violence against women has deterred Indian women from entering the workforce. Jesus > China is also better prepared for future opportunities. Seven Chinese universities are ranked among the world’s top 100, with Tsinghua and Peking among the top 20. Tsinghua is considered the world’s leading university for computer science, while Peking is ranked ninth. Likewise, nine Chinese universities are among the top 50 globally in mathematics. By contrast, no Indian university, including the celebrated Indian Institutes of Technology, is ranked among the world’s top 100. getting roasted here man You should be the new tldr bot. /s Banana yolo Lol no China built it's economy on cheap labour and hyper financialization. Experts have been predicting the end of China for decades. China still manages to do alright. U don't need to be an expert. The fundamental problem with China is that it is a supply concentrated economy. They rely on 2 things for growth. 1. Buyers 2. US guaranteed maritime security (for a stable environment) Both are on their way out. First world countries are getting older hence a lower consumer base and the US sees no benefit in spending its own money making China richer so it is receding from the world. I'm not concerned about growth. I'm genuinely concerned about the humanitarian crisis that will ensue when China completely implodes. They have a long history of authoritarian driven implosions. This one will be no different. I understand your concerns, but I am confident China will do alright. There's a lot of anti-china propaganda floating and has been for a long time. China has built a fast and flexible bureaucracy guided by a decisive leadership. They have proven to have long term vision and political will to make things work. IMO China will be alright Yes. Driven by the unshakeable faith in your dogma. Contrary to all facts and reality :) Haha. Lets agree to disagree Lol sure mate. Because the 2 positions are clearly equally valid. Regardless of data :) I've read too many dommsayer reports on China, full of \"facts and reality\" to take more of it seriously. Human capital and gender equality here both translate to cheap labor True > female labor-force participation rate has decreased to roughly 62% from around 80% People don't realize how mindboggling absurd this metric was. Not even West reached this figure for Women at it's peak developing phase and it drops post development anyway so today it no where near high 70% either. Never has a country in human history put women in labor-force at that scale as PRC under Deng did. And this happened because of the Social/Gender reforms passed in 50s (by force & top-down since Society wasn't actually ready for it). Even today China tops even OECD countries in Women's contribution to GDP (it was around 42% few years back, India is under 20%). Ashoka Mody, his recent work though fair and gets many things right but his fundamental model is still old school. He still believes India can make it under the system of Liberal Democracy, which is a dogma since it NEVER worked for anyone ever during their developing cycle. India is trying to be the 1st in human history. Which is not impossible but without a track record of delivering even on other factors, it's a high stakes risk/sell. If Peter Zeihan said Sun is a type of Star, it should be triple questioned and checked to make sure if that really is the case. And if someone references Zeihan in a serious debate and esp on China, that person is automatically discredited for being a fool that lacks critical cognitive g-factor to engage on subject domain. True, people comparing Asian tigers / China to India don't understand how every method that those countries used to develop themselves has been relentlessly opposed in India in the name of democracy. Ok Varun. Very insightful analysis Tell me which year in the last 30 years China was NOT screwed according to these China \"experts\"? I see the China bots have paid my comment a visit. Don't know what Ur gaining by fooling urself. The fundamentals of the Chinese economy are as solid as quicksand. I've explained below Total Yello Nope. China is screwed. Just read this: all new to you ? well maybe, just maybe Chinese men have certain level of lazy-assness so women have to pick up the slack, if only to earn more. so India also had/has cheap/cheaper labour, what of it ? only idiots buy/read that guys \"books\" For a while around 90s China also was like 1 of 2 or maybe only country in the world where Female Suicide rate was higher than Men. Explanations given were a few but none seemed comprehensive on their own (thing like easier access to industrial, heavy-duty scale poisons which can be agri-based drugs, etc. Or society-culture factors, etc). It was outlier but then it normalized and not it's back to how it's in rest of the world. However, whatever metric one uses to chart that period of Chinese history, it is without question that Women played an outsized role, possibly greater than had been played by women in ANY human society ever in history. Except that this one is solid logic. U can't make money when nobody's buying"
}