{
    "id": "1edk6ae",
    "title": "Karmayogi email spam",
    "url": "https://i.redd.it/dgy41r5d73fd1.jpeg",
    "selftext": "Does anybody know what this Karmayogi is? I don’t know why they sent this to me(a few more emails like this). Absolutely no idea why a gov.in email would keep spamming people. I don’t even live in India any longer. ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1722097279.0,
    "convurl": "https://i.redd.it/dgy41r5d73fd1.jpeg",
    "comments": [
        "This seems like a case of someone mistakenly submitting a wrong email address, rather than intentional spam.    \nKarmayogi is a portal for government officers to undergo mid-career training and upskilling.",
        "Looks like it. I replied and they responded that someone used my email with some other number. I told them to delete my email."
    ],
    "cleaned_text": "karmayogi email spam anybody know karmayogi dont know sent mea emails like absolutely idea govin email would keep spamming people dont even live india longer ",
    "cleaned_title": "karmayogi email spam",
    "cleaned_selftext": "anybody know karmayogi dont know sent mea emails like absolutely idea govin email would keep spamming people dont even live india longer",
    "cleaned_comments": "seems like case someone mistakenly submitting wrong email address rather intentional spam karmayogi portal government officers undergo midcareer training upskilling looks like replied responded someone used email number told delete email",
    "light_cleaned_title": "Karmayogi email spam",
    "light_cleaned_selftext": "Does anybody know what this Karmayogi is? I don’t know why they sent this to me(a few more emails like this). Absolutely no idea why a gov.in email would keep spamming people. I don’t even live in India any longer.",
    "light_cleaned_comments": "This seems like a case of someone mistakenly submitting a wrong email address, rather than intentional spam. Karmayogi is a portal for government officers to undergo mid-career training and upskilling. Looks like it. I replied and they responded that someone used my email with some other number. I told them to delete my email."
}