{
    "id": "1ckryxi",
    "title": "Delhi Boy Sexually Assaulted By Classmates With A Stick, Intestine Damaged",
    "url": "https://www.ndtv.com/delhi-news/delhi-boy-sexually-assaulted-by-classmates-with-a-stick-intestine-damaged-5592627",
    "selftext": "Power kids ruining human lives for fun. And they will roam as free adults tomorrow.",
    "flair": "Crime",
    "score": 77,
    "num_comments": 10,
    "created_utc": 1714917777,
    "convurl": "https://external-preview.redd.it/f4hQFJ3ItonhkalSGf6GFrsLskUt_BBumMfq0spjBHA.jpg?auto=webp&s=99038182b3696b250e4487f16a53d24ebab34d7e",
    "comments": [
        "These culprits from affluent families are potential future criminals, they should be named and shamed because the system will surely let them evade.",
        "Agreed. Parents would probably be too egoistic and protective of their child to take any necessary actions. \n\nAlso I've to add- early exposure to pornographic content IS a big reason why an incident like this has come to light.",
        "Yes absolutely. Also unfortunately I feel these kids may have been exposed to such grotesque concept through [these kind](https://youtu.be/97xzHnobq3c) of TV shows.",
        "That clip's a nightmare... can't imagine what the poor boy would have to go through irl",
        "Bruh only class 8th and students allready addicted to porn and do this shit? Put all of them in Juvenile!",
        "What is wrong with people now a days.\n\nI think over exposure to porn at a younger age causes come brain damage. It creates some place in head where doing all this heinous, beyond words crimes as normal or as a think which can be done.\n\nThey lack basic morality and empathy.\n\nI hope they are tried as adults and given harshest punishment possible. The physiological damage may  heal with time but psychological damage is irreparable at such a young age. How the hell they could even think of doing this.",
        "Wow. This is terrible. It happened in March and we are hearing about it now. This should have made headlines right away. The kid is going to have life long complications from this ,apart from the mental trauma.  He kept it quiet *ten* days.  I'm wonder if this was a homophobic attack where the other kids ( the monsters) assumed he was gay or maybe he actually is and they got wind of it.  Name those who did it , release their pictures ,shame them for life because it takes a considerable level of sociopathy to even think of this.  They are quite likely to repeat it in one wy or the other",
        "indeed that is big possibility. Teens like these feed on bullying others, and being in control. God knows what kind of 'contribution' will they make to the society as adults",
        "Why don't they publicise the name of culprits wtf!?",
        "Probably the culprits belong to affluent families",
        "Other countries: Teaches sex ed early \nIndia : Makes sex ed a taboo\nAlso India : SA of girl is rape\n                   But for boy it's SA\n\nAlso on a side note, I have known kids of 6th and 7th making 69 jokes. Gives enough clue about situation of this country"
    ],
    "cleaned_text": "delhi boy sexually assaulted classmates stick intestine damaged power kids ruining human lives fun roam free adults tomorrow ",
    "cleaned_title": "delhi boy sexually assaulted classmates stick intestine damaged",
    "cleaned_selftext": "power kids ruining human lives fun roam free adults tomorrow",
    "cleaned_comments": "culprits affluent families potential future criminals named shamed system surely let evade agreed parents would probably egoistic protective child take necessary actions also ive add early exposure pornographic content big reason incident like come light yes absolutely also unfortunately feel kids may exposed grotesque concept kindhttpsyoutubexzhnobqc tv shows clips nightmare cant imagine poor boy would go irl bruh class th students allready addicted porn shit put juvenile wrong people days think exposure porn younger age causes come brain damage creates place head heinous beyond words crimes normal think done lack basic morality empathy hope tried adults given harshest punishment possible physiological damage may heal time psychological damage irreparable young age hell could even think wow terrible happened march hearing made headlines right away kid going life long complications apart mental trauma kept quiet ten days im wonder homophobic attack kids monsters assumed gay maybe actually got wind name release pictures shame life takes considerable level sociopathy even think quite likely repeat one wy indeed big possibility teens like feed bullying others control god knows kind contribution make society adults dont publicise name culprits wtf probably culprits belong affluent families countries teaches sex ed early india makes sex ed taboo also india sa girl rape boy sa also side note known kids th th making jokes gives enough clue situation country",
    "light_cleaned_title": "Delhi Boy Sexually Assaulted By Classmates With A Stick, Intestine Damaged",
    "light_cleaned_selftext": "Power kids ruining human lives for fun. And they will roam as free adults tomorrow.",
    "light_cleaned_comments": "These culprits from affluent families are potential future criminals, they should be named and shamed because the system will surely let them evade. Agreed. Parents would probably be too egoistic and protective of their child to take any necessary actions. Also I've to add- early exposure to pornographic content IS a big reason why an incident like this has come to light. Yes absolutely. Also unfortunately I feel these kids may have been exposed to such grotesque concept through [these kind](https://youtu.be/97xzHnobq3c) of TV shows. That clip's a nightmare... can't imagine what the poor boy would have to go through irl Bruh only class 8th and students allready addicted to porn and do this shit? Put all of them in Juvenile! What is wrong with people now a days. I think over exposure to porn at a younger age causes come brain damage. It creates some place in head where doing all this heinous, beyond words crimes as normal or as a think which can be done. They lack basic morality and empathy. I hope they are tried as adults and given harshest punishment possible. The physiological damage may heal with time but psychological damage is irreparable at such a young age. How the hell they could even think of doing this. Wow. This is terrible. It happened in March and we are hearing about it now. This should have made headlines right away. The kid is going to have life long complications from this ,apart from the mental trauma. He kept it quiet *ten* days. I'm wonder if this was a homophobic attack where the other kids ( the monsters) assumed he was gay or maybe he actually is and they got wind of it. Name those who did it , release their pictures ,shame them for life because it takes a considerable level of sociopathy to even think of this. They are quite likely to repeat it in one wy or the other indeed that is big possibility. Teens like these feed on bullying others, and being in control. God knows what kind of 'contribution' will they make to the society as adults Why don't they publicise the name of culprits wtf!? Probably the culprits belong to affluent families Other countries: Teaches sex ed early India : Makes sex ed a taboo Also India : SA of girl is rape But for boy it's SA Also on a side note, I have known kids of 6th and 7th making 69 jokes. Gives enough clue about situation of this country"
}