{
    "id": "161q1o0",
    "title": "Fact Check on The teacher urging the hindu students to beat hindu students",
    "url": "https://www.reddit.com/r/india/comments/161q1o0/fact_check_on_the_teacher_urging_the_hindu/",
    "selftext": "FactMyth:-\nhttps://www.factmyths.com/2023/08/claim-of-hindu-children-thrashing-muslim-child-in-up-muzaffarnagar-school-is-misleading.html?m=.      (The link is in Hindi)\n\nBullet Points:-\n\n1. पड़ताल में हमने सबसे पहले देखा कि सोशल मीडिया यूजर इस वीडियो को मंसूरपुर थाना क्षेत्र के खुब्बापुर गांव में 'नेहा पब्लिक स्कूल' का बता रहे हैं। इसीलिए हमने एक स्थानीय पत्रकार की मदद से स्कूल की शिक्षिका तृप्ति त्यागी से सम्पर्क किया। उन्होंने बताया कि यह मामला उन्ही के स्कूल का है लेकिन वीडियो को गलत सन्दर्भ के साथ शेयर किया जा रहा है। \n\n2. शिक्षिका तृप्ति त्यागी ने हमे बताया कि वीडियो में वो कहती है, 'जितने भी मोमडन(मुस्लिम) बच्चे हैं, इनकी माएं मायके चली जाएँ(जाती हैं), इससे बच्चों की पढाई का नुकसान होता है।' पड़ताल में हमने देखा कि मैडम के बयान के बाद वीडियो बनाने वाला शख्स भी कहता है, 'सही कह रहे जी, पढाई खराब होती है।'\n\n3. तृप्ति त्यागी ने हमे बताया, 'वीडियो में जिस छात्र को मारा गया है, वो दो दिन से टेबिल(पहाड़ा) याद करके नहीं आ रहा था। इसीलिए उन्होंने दूसरे छात्रों से छात्र को थप्पड़ मारने को कहा था। लेकिन मैंने हिंदू बच्चों से मुस्लिम को नहीं पिटवाया है, थप्पड़ मारने वाले छात्रों में दो छात्र मुस्लिम समुदाय से हैं।' तृप्ति त्यागी ने हमे दो मुस्लिम छात्रों के नाम भी बताएं लेकिन उनकी निजता का ध्यान रखते हुए हम यहाँ उनका उल्लेख नहीं कर रहे हैं।\n\n\nHence the message conveyed by the video was completely. Please fact check any post you find lurking on twitter.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693040636.0,
    "convurl": "https://external-preview.redd.it/JMja0hAHwnHXmfEd2Z5y6hNjTYhpOjBFPeR2Z80Zvcs.jpg?auto=webp&s=2901dd5ff9b072d07721d260efa8ddcb36753f2e",
    "comments": [
        "stop being an asshole...and keep practising it everyday"
    ],
    "cleaned_text": "fact check teacher urging hindu students beat hindu students factmyth link hindi bullet points hence message conveyed video completely please fact check post find lurking twitter ",
    "cleaned_title": "fact check teacher urging hindu students beat hindu students",
    "cleaned_selftext": "factmyth link hindi bullet points hence message conveyed video completely please fact check post find lurking twitter",
    "cleaned_comments": "stop assholeand keep practising everyday",
    "light_cleaned_title": "Fact Check on The teacher urging the hindu students to beat hindu students",
    "light_cleaned_selftext": "FactMyth:- (The link is in Hindi) Bullet Points:- 1. पड़ताल में हमने सबसे पहले देखा कि सोशल मीडिया यूजर इस वीडियो को मंसूरपुर थाना क्षेत्र के खुब्बापुर गांव में 'नेहा पब्लिक स्कूल' का बता रहे हैं। इसीलिए हमने एक स्थानीय पत्रकार की मदद से स्कूल की शिक्षिका तृप्ति त्यागी से सम्पर्क किया। उन्होंने बताया कि यह मामला उन्ही के स्कूल का है लेकिन वीडियो को गलत सन्दर्भ के साथ शेयर किया जा रहा है। 2. शिक्षिका तृप्ति त्यागी ने हमे बताया कि वीडियो में वो कहती है, 'जितने भी मोमडन(मुस्लिम) बच्चे हैं, इनकी माएं मायके चली जाएँ(जाती हैं), इससे बच्चों की पढाई का नुकसान होता है।' पड़ताल में हमने देखा कि मैडम के बयान के बाद वीडियो बनाने वाला शख्स भी कहता है, 'सही कह रहे जी, पढाई खराब होती है।' 3. तृप्ति त्यागी ने हमे बताया, 'वीडियो में जिस छात्र को मारा गया है, वो दो दिन से टेबिल(पहाड़ा) याद करके नहीं आ रहा था। इसीलिए उन्होंने दूसरे छात्रों से छात्र को थप्पड़ मारने को कहा था। लेकिन मैंने हिंदू बच्चों से मुस्लिम को नहीं पिटवाया है, थप्पड़ मारने वाले छात्रों में दो छात्र मुस्लिम समुदाय से हैं।' तृप्ति त्यागी ने हमे दो मुस्लिम छात्रों के नाम भी बताएं लेकिन उनकी निजता का ध्यान रखते हुए हम यहाँ उनका उल्लेख नहीं कर रहे हैं। Hence the message conveyed by the video was completely. Please fact check any post you find lurking on twitter.",
    "light_cleaned_comments": "stop being an asshole...and keep practising it everyday"
}