{
    "id": "13i9z1m",
    "title": "Hey /r/India it’s music producer, DJ & ping pong enthusiast KSHMR here, AMA!",
    "url": "https://www.reddit.com/r/india/comments/13i9z1m/hey_rindia_its_music_producer_dj_ping_pong/",
    "selftext": "What's up /r/India! So excited to finally be doing this AMA w/ you guys.\n\nMy new album with talented artists from all corners of Indian hip-hop is on the way, and much of my music as KSHMR has been inspired by my Indian roots and heritage. The first single 'Haath Varthi' with MC Stan and Phenom dropped a few days ago.\n\nAsk me anything you want to know about me, the album, music past and present, or my life/career! \n\nEDIT: Thanks /r/India for all of your questions! This is the end of my AMA for now -- hope to do one again soon. Keep in touch w/ me on social media and stay tuned for more music coming very soon...\n\nhttps://preview.redd.it/0lyl6etm900b1.jpg?width=2316&format=pjpg&auto=webp&v=enabled&s=1690722ec5bebfcea56f42fcd9537add0dc08178",
    "flair": "AskIndia",
    "score": 430,
    "num_comments": 225,
    "created_utc": 1684161010.0,
    "convurl": "https://b.thumbs.redditmedia.com/WWq70rhylyzy_40hsJnhkrVxPLPgeKzX1MnrzrNZVgM.jpg",
    "comments": [
        "You seem to hold a deep fascination for music technology and tools. Can you share a time when a particular piece of music tech or software had a significant impact on your sound or style?",
        "hey kshmr big fan here :)  \njust wanted to know what do you consider your own best song?",
        "Hi! Relevant to your picture: what are your favourite headphones for listening to music & tuning out the world",
        "Your reverb plugin 'KSHMR Reverb' has been in development since April 2020. What was the most challenging aspect of this process and how did you overcome it?",
        "what was your inspiration for this album?",
        "What advice do you have to aspiring musicians?",
        "The development of your reverb plugin involved overcoming challenges related to transients. Can you tell us more about this process and the lessons you learned from it?",
        "How you came up with the name \"Karam” \nTotally love the meaning of the word.",
        "You've mentioned that Tiesto is skilled at incorporating young people into his process to keep the sound fresh. Do you have a similar approach, and if so, how do you incorporate new ideas into your work?",
        "Can you tell us about any upcoming collaborations you have in the works?",
        "You have a rich history with Splice and your packs are often one of the most downloaded. What's your process when creating a new pack?",
        "Hey kshmr, first of very excited for your album.\nSecond, how can budding artist contact you to share their music to you. Thanks.",
        "Can you share more about your experiences with your KSHMR label on Splice and how it's influenced your music and your contributions to the producer community?",
        "Next Song of Karam Album",
        "In which month we can expect to hear the whole album\"Karam\"",
        "When can we see track list of the upcoming album?",
        "You mentioned \"the discovery of new sounds\" as your favorite part of music. Can you give an example of a new sound or technique that you've recently discovered and incorporated into your work?",
        "Yooo Niles!\n\nLoved Haath Varthi!! When are you releasing the whole album bro?\n\nAlso any potential collaboration with Ritviz in the works?",
        "Tracklist of karam album?",
        "You were also a huge inspiration for my track 'Brahmastra'! Would love to get your opinion on it :)\n\nhttps://open.spotify.com/track/3Hl3W3AFHpVSU8gVmG2Zk4?si=pziklFqBSRylDmC6NrGbSA",
        "Hi. Been a fan since Cataracs days. Missed you in Bombay. Any chance you're coming back to India for one fo your shows?",
        "How many songs are there in the album?  My guess is 13-15 and When you are dropping the track list.",
        "How did the collaboration with MC Stan come about, and what was it like working together on 'Haath Varthi'?",
        "Coming for sunburn this year?",
        "Frankly I got nothing to ask, but I think this is the best moment I've gotten yet to get noticed by you. I just wanted to thank you, from your sample packs to your tutorials to your podcasts and especially your songs have helped me and probably million others to even start making music. It's been 5 years now, I don't think there's been a day of making music where I havent chosen a sound from the sounds of kshmr sample banks. Hope to match your levels one day, working everyday to my make dream a reality. Thanks once again. Lots of love from Mumbai. Also I hope I can meet you one day😭 lmao started fan boy-ing heavy.",
        "Hey Niles,\n\nAny plans on coming to Sri Lanka?\n\nLoved your last album even bought myself the vinyl 😊 Expecting a banger album \n\nLove from Sri Lanka",
        "Nothing to ask, but we'll collab in future.  \nI will be the next big thing in DHH for sure..  \nBest of luck for your 1st DHH album 'KARAM'",
        "WHEN IS KARAM COMING OUT ????",
        "You've recently launched your own record label, Dharma Worldwide. What inspired you to start your own label?",
        "BRO WHY DIDN'T YOU INCLUDE FRAPPE ASH (1/2 HALF OF A DUO NAMED FULL POWER IN WHICH YUNGSTA IS ALSO A PART OF) IN YOUR ALBUM KARAM. RN HE IS TOP 5 DHH ARTIST AND YOU SHOULD LISTEN TO HIS DISCOGRAPHY TO UNDERSTAND WHAT I AM SAYING !!",
        "I can see that you are on Reddit for 7 years! So let me ask some Reddit-based questions :\n\n1. How did you discover Reddit?\n2. Which are your favourite subreddits\n3. How popular is Reddit with your industry peers ?\n4. Is MC stan on Reddit too ? :P",
        "hey, a huge fan of your work. Looking forward to your next album with desi rappers featuring my favs\n\n1.my question to you is for how long were you working in the album and how was the whole process while interacting with rappers and exploring a new genre diffrent from what you usually do\n\n2. How do you discover all the DHH rappers and who are your most favorite ones\n\n3. I remeber you tweeting about krsna's say my name and talking about him in afaiks podcast. So can we expect a song in the album with him and was the whole vibe in studio as both of you are KPs and share a similar background...",
        "Only coming there if you are there !",
        "You've been very open about your struggles with mental health in the past. How has music helped you cope with these challenges?",
        "Can we expect a collab with young stunners in future?",
        "Many DJs and producers have a specific moment or song that sparked their interest in electronic music. What was that moment for you? Was there a specific track or artist that made you realize this was the path you wanted to pursue?",
        "You've held a high place on DJ Mag's Top 100 DJs poll for several years. How does it feel to achieve such recognition? And how does this recognition influence or put pressure on your creative process?",
        "Hey KSHMR, I have to know: how was it to experience the wild success of Like A G6?! you couldn't go to a single club in in the 2010s without hearing in multiple times a night, and it still goes hard to this day",
        "Hey KSHMR, Can we expect some drill tunes with DHH artists from you ?",
        "Big fan of all you’ve created in these years, putting India on the map. Love the story concept of the upcoming album Karam. \nQuestion- How did you feel working with artists that rap in Hindi(no offence, but a language that you haven’t got the best grasp on)? Was it difficult in the sense that you weren’t able to fully understand the meaning behind their verses?",
        "Be on the new skrillex album kshmr",
        "How do Karam and Harmonica Andromeda differ in terms of influences along with your progression as an artist from then till now?",
        "You have performed at numerous music festivals like Coachella, Tomorrowland, EDC, Ultra, and Sunburn. \n\nCan you share some of your most memorable experiences from these performances?",
        "Hello KSHMR, How can a music producer in India grow right now and is there a way to send you beats or melody to get collabs with you? Also love your track Voices it's my favourite.",
        "Apologies if you get this question often but will the 8-bit versions of a few Harmonica Andromeda tracks ever see the light of day?\n\nI remember you mentioned it in an interview and it had me super intrigued with what it would sound like lol",
        "Can you talk about your decision to transition from being part of The Cataracs to becoming Kshmr? \n\nWhat led to this change, and how did it affect your music?",
        "Your collaboration with Tiesto on \"Secrets\" was a significant hit. How did this collaboration come about, and what was the process of creating this track with such a renowned artist?",
        "Hey kshmr....\n\nBig fan of ur works ...\nI'm a jee aspirant and wannabe music producer at the same time... I'm at 12 th standard currently and there is unbearable pressure all around me ... Which mainly includes living upto the expectations basically... But I don't wanna leave behind the passion of producing music...as you stated in the documentary that your grandfather wanted you to be a professor or MBA like ur father... But you still managed to get into music...my question is...how did you convince yourself to come into passion in spite of that career pressure exerted by ur elders?",
        "are you performing this years tommorowland?",
        "Harmonica Andromeda has a very unique sound. What inspired you to create such a diverse range of genres in this album?",
        "First of all i am a huge fan of yours ,I was thinking to make a artwork for you ,where can I send it to you when it's complete?",
        "ye melody itni chocolaty kyun hai sir ?",
        "Yo Niles \n\nFirst of all Congratulations for Haath Varthi , it's trending at #1 on yt music\n\nI wanted to know if there's some artist that you wished to have on Karam , apart from the ones who are already a part of it ! \n\nAlso what can your EDM fans expect after the Hip-Hop album ....like your artistic approach towards a particular genre \n\nAre there some pending collaborations with other edm producers ? If yes with whom ? \n\nThank you :))",
        "Hey KSHMR, First of all a Big Thanks for this AMA. And coming towards my Questions.\n\n1. How did you bring these many DHH Artists together for the Album?\n\n2. When is the tacklist gonna drop?\n\nEagerly waiting for KARAM!!!",
        "Will there be visuals for each song on the album? Like there was for HA?\n\nAlso what is your favourite Dr. Dre beat? Would love to know!",
        "I’ve gone with the Sony WH-1000 XM series (they’re on 5 now I believe)",
        "Q) Are we going to get a tracklist of KARAM or singles gonna drop one after another ‼️‼️\nMusic production on haath varti was phenomenal 🙌",
        "Hey KSHMR,\nSome people say that we're just copying west's hiphop culture without adding something new or Indian element to it. What's your take on that.\nBtw best wishes for your Upcoming Album.\nAnd don't release more snippets from the album.",
        "Yoo, KSHMR, i have been listening to your work for the last 2 years, you're absolutely crazy at music production, ekdam mast. HAATH VARTHI's music part 🫡.\n\nI'm hyped asf for your album KARAM, in the recent live on IG you've mentioned that track list will not be out soon, also the album will be out within 3 months as you've mentioned too;\n\nI've three questions:) :\n\n1. When can I or any folk who is hyped asf can expect the complete tracks list, within a month? Also how's your experience working with DHH artists, did you have any plans on picking specific artists for this album?\n\n2. Gonna rap again?\n\n3. Hyderabad kab aaraheyy ho?\n\nMidnight lion walk, blood in the water 🛐\n\nI'm actually listening to \"around the world\" now, coincidence at its best, hehehe.",
        "Will we be witnessing a KR$NA X KSHMR in KARAM",
        "How many songs are gonna be there in the forthcoming 'KARAM' album?",
        "Hey #kshmr Big Fan🙌 of you & your style of doing Music from the time of Cataracs, \n\n**1 Question i am asking in every insta live you do:-- will you ever drop that Remix Song which had a Saxophone melody( you showed on 📷insta live, you also showed 'Bruk It Down' & 'Get With Nobody'  on that live)",
        "Next track ?",
        "Hey KSHMR, big fan and much love to you. When will you do a Collab with Martin Garrix?",
        "yep! i own those since last year. they don't fold up but that's not an issue for me, i like their design",
        "Man with your desi hip-hop coming in a few months , I feel so regretful that Sidhu Moose Wala isn't here today with us ! Would have loved to see you 2 work together:( \n\n\nCould we get to see you work with some Punjabi artists like Diljit, Shubh etc in future ( ik you've got one track Riar Saab and I'm super excited for it as well )",
        "Interesting question, as it changes, but I’ll go with Wildcard because:\n\n- the chorus is super catchy\n- it has really diverse musical elements: Indian, jazz, big room EDM and they all blend quite nicely\n- there is irregular / chromatic musicality in the second verse especially\n- the drop goes mental whenever I play it live",
        "More info will be out sooner, but I would say a full one in about 6 weeks",
        "Hey kshmr i love you so much man just wanted to know will you ever release flutes away cause we have been waiting for so long",
        "What role did Represent play in your album?",
        "Not a question but Album launch idea, do a live stream on samay's with all the artist hour before the release play games n shit or whatever that will engage people n will hype people right before release ❤",
        "How did you get so many rappers on the album?",
        "KSHMR huge fan!! When are you coming to Hyderabad? Since the last show of yours was cancelled due to COVID.",
        "\\- are you ever going to make a shift back to your electro/big room house roots?\n\n\\- what's the best part about using ableton (as far as i know, this is your DAW of choice), and if you used any in the past how was your user experience with them / why did you drop them?\n\n\\- did you learn/study any musical education? how'd you get into music in the first place?\n\n\\- have you been to australia or malaysia before?\n\n\\- who are your inspirations?\n\nbig fan of your style and filling of the niches btw, keep it up !",
        "Love your music",
        "Wow thank you so much! Tell the people running events there to book me :) no plans as of yet",
        "Unrelated but,\nSamsung S23 ultra vs iPhone 14 Pro Max",
        "Hey KSHMR i am a big fan of yours and you are my favourite producer/dj. My question is that would you be trying to produce new genres of edm like bigroom techno or maybe uplifting trance since these two are really popular right now. Love your work can't wait for the full album and other songs !",
        "Saw you at feedingindia mumbai last December. Great music!",
        ">I’ve gone with the Sony WH-1000 XM series (they’re on 5 now I believe)\n\nI have the same one. They are so good with sound quality. 8 microphones too I think.",
        "In the whole music making process, which part is the most enjoyable for you?",
        "I spent a lot of time after seeing Gully Boy getting acquainted with rappers in India and Stan's name was unavoidable. I listened to the whole Insaan album and realized there was something very special about him... So I asked my team to link me up and we booked a session. It was only one day but we managed to get through two songs and he was a very sweet, kind person. Very open minded",
        "Is the other mc stan collab a commercial one like this one ? I wish it's lyrically better",
        "Karam is a concept album, and it has a story that we learn through the interludes: we’re told of a poor boy who forms a gang and rises to power. For each song on the album, I invited the artists to choose a moment in our character’s journey and use that as inspiration. Each song reflects the boy's karam (deeds) and, by the end of the story, he can't escape the consequence of them",
        "Do you recommend me to buy dharma worldwide subscription as I have only basic knowledge in music production? \nCannot wait to see you in Poland this year, it feels like a dream came true🇵🇱",
        "What does your name mean?",
        "You killed it at the production btw",
        "My process is this:\n\n\\- Layout the goals, what new types of sounds I want to include\n\n\\- Get a talented group of producers together in a house who record drums and instruments, and do sound design\n\n\\- Spend weeks in studios with instrument players from around the world\n\n\\- Add new sounds and process existing ones for 1.5 years or until my hair falls out\n\n\\- Swear to myself I'll never make another pack again\n\n\\- Repeat",
        "Just smile if krsna is there in Album 😏",
        "Thanks. I was inspired by my own diverse taste in music, which I had previously simplified into genres like EDM and pop. In the case of HA I allowed my creativity to run free and sometimes fit multiple genres into one tune",
        "Just smile if krsna is there in Album 😏",
        "Just smile if krsna is there in Album?😏",
        "Hi!! Are you planning on rescheduling your live set in San Francisco? Also would you ever consider doing a trance set?",
        "Any advice for up and coming artists. As someone who loves playing the guitar and hopefully good at it, I always wanted to start a band but never found the group.\n\nIs it advisable for me to start a solo project first?",
        "Any advice for up and coming artists. As someone who loves playing the guitar and hopefully good at it, I always wanted to start a band but never found the group.\n\nIs it advisable for me to start a solo project first?",
        "Any advice for up and coming artists. As someone who loves playing the guitar and hopefully good at it, I always wanted to start a band but never found the group.\n\nIs it advisable for me to start a solo project first?",
        "I think all artists find the question \"what was your inspiration for \\_\\_\\_\\_?\" to be very.... uninspired\n\nBut in the case of KARAM I guess it goes back to Gully Boy, when I became very excited about the HH scene in India. And my interest in hip hop goes back to the very beginning of my interest in music",
        "How did you get the Idea of your stage name and why the place name?",
        "How did you get the idea of your stage name and why the place name?",
        "Hey KSHMR, I loved your song in Garena free fire, Any plans on tours?",
        "Who is your current non edm producer?",
        "Were you working on some track with showtek which was related to fifa or football ? Was looking forward to it",
        "Hii KSHMR a hugeee fan of your music\nWhen are u coming to Pune \nId love to come to your show :)",
        "Collab with young stunners or divine  when ?",
        "Recs for mixing headphones?",
        "Hey KSHMR! I can't contain my excitement for your upcoming album Karam! The anticipation is real. Also Haath Varthi is an absolute banger!! Here’s a couple of things I’m curious to know- \n\n1. What was the most memorable experience or inspiration that influenced your music production style?\n\n2. What's the most memorable show or performance you've ever had?\n\n3. Are there any collaborations or dream collaborations you have in mind for future projects? \n\n4. What advice would you give to someone looking to develop their own unique sound as an upcoming music producer?",
        "Bro when will you be in Delhi next",
        "I'm a Korean fan. I have a lot of questions.\n\nI want to know even though I am not good at English.\n\n&#x200B;\n\n1. I'm curious about MBTI TEST TYPE.\n\n2. Do you have a favorite Kpop song?\n\n3. Do you have a favorite Japanese animation? As far as I know, I like Final Fantasy 7.\n\n4. Did you quit smoking?\n\n5.I wonder what kind of god you believe in",
        "A big part of it was my partner David leaving the group... I tried to be \"The Cataracs\" by myself for a while but soon felt it was puttering out and I needed something new. I was already falling in love with dance music and tried my hand in producing it. The truth is dance music is much diff than other genres (arguably harder) because the beat needs to really stand on its own without need for a vocal to be entertaining. But I'm so glad that I made the shift as it allowed me a lot of freedom and creativity",
        "One in particular yes :) and it's one of my favs from the album",
        "Hey Niles! huge fan here since 2015 \n\nI still listen to Welcome to KSHMR VOL 7\n\nPlease release the REEZ & KSHMR - ID (12:50 Mark)\n\nThanks for reading this",
        "The most challenging aspect was consistent transient recognition.\n\nFor those who don't know, transients are spikes in sound volume, which should signify a new \"hit\" or \"note\". Accurately identifying transients was core to the special FX in KSHMR Reverb, and it turns out that the human ear has an easier time doing this than a computer. But, in the end, we got close to perfect :)",
        "Big fan here. Just to say Hi! Found you while listening to Jammu in an Uber in Chicago in 2015. Now I blast your songs on my headphones while working in a small town in India. Lots of love! Keep rocking.",
        "In addition to producing music, you've also released sound packs for other producers to use. What inspired you to share these resources, and how do you feel about the idea of other artists using your sounds in their own work?",
        "You've launched Dharma Worldwide, a sublabel of Spinnin' Records. What was your vision behind creating this platform, and how does it align with your overall music career?",
        "Sending you love, thanks bro",
        "Thanks, that was a wild ride. It opened many doors for me and I'm very thankful to David and Dev for it... I think without that song my life would have been very different",
        "I never completed them but here are the V1s: [https://www.dropbox.com/sh/bwmp1ubbptsuyv3/AABYAooStnXtq25dCQ0Vw1c2a?dl=0](https://www.dropbox.com/sh/bwmp1ubbptsuyv3/AABYAooStnXtq25dCQ0Vw1c2a?dl=0)",
        "Do you have any advice for someone who wants to pursue a career in music production?",
        "Thank you, I can't really comment on ppl I wished to have. Not everything is 100% yet still\n\nEDM fans can expect an evolved sound, but in many ways a return to darker, more dance oriented music that I'm excited to play live -- less poppy / vocal focused",
        "Yes there will at least be a visualizer for each song. Dre has so many good beats but the one that first comes to mind is Xxplosive",
        "Would have loved to work with Sidhu, very sad indeed\n\nYes the one with Riar is a standout and I would love to work with Shubh! Watching him very closely atm",
        "They helped orchestrate the entire project. My good friend Aayushman helped connect me to all the artists and devise a plan, and Sankalp was my right hand man through each and every day. They are one hell of a team.",
        "I was helped greatly by Aayushman and the REPRESENT team, in addition to me reaching out to people on IG etc.",
        "Would love to hear about a crazy fan moment!",
        "Yea 100% there is actually a series on Dharma Worldwide where I start from the very beginning and explain the basic concepts of music production. Try it out!\n\nSee you in Poland :)",
        "Kashmir\n\nWhere my paternal family is from",
        "Gonna do an India tour when the album drops",
        "The other song with MC stan is Mumble or what ?",
        "100% that would be Kontakt, I think incorporating real world instruments has been at the core of my sound",
        "1. you\n2. gotta\n3. wait\n4. just\n5. a\n6. little\n7. bit\n8. longer\n9. my\n10. friend",
        "HEY KSHMR A BIGGEST FAN OF YOURS. YOUR PICTURE IS IN MY SMALL STUDIO AS GOD, INSPIRATION FOR MAKING MUSIC. WHO IS YOUR INSPIRATION ?",
        "Hey the best way is on [www.dharmaworldwide.com](https://www.dharmaworldwide.com) in the demo submissions page",
        "We remember you bringing your Dadaji twice to the stage at Sunburn, is there any song dedicated to him in the album?",
        "Flutes Away became \"Hymn of Reflection\" on Lion Across The Field\n\n[https://www.youtube.com/watch?v=1FmvYnFha6w](https://www.youtube.com/watch?v=1FmvYnFha6w)\n\nThere is no other version.. That's the one",
        "Hey KSHMR, First off HUGE FAN. I've been following you're music since many many years. I was super excited when I saw your name announced in the Ultra Music lineup ( Bangalore) and got the tickets as early as possible. That being said i felt the set to be underwhelming, I dont mean to cause any disrespect, the music played were amazing, but I feel i was expecting something else. I felt that the indian remixes were unnecessary because you have SO MANY songs of your own merit that could blow literally anyone away. So my question is, were you trying to cater the Indian Audience differently or were you experimenting something new ?\n\nAgain huge FAN and hope to see you again in India 🥰😊",
        "Hey Niles! Will the Bay Area live experience show that got canceled come back? Was looking forward to it, so I'm hoping another one comes through!\n\nOn another note, as a producer, is there any sounds or music tracks from movie soundtracks or video games that you've sampled from? Or maybe even just generally really dig?\n\nMuch love 🙏",
        "What do you like the most about music?",
        "BRO BRRROOO BROOOOOOROOROROROO",
        "When Niles met Kshmr zone & Welcome to KSHMR ! 👀",
        "Bro love the music on \" close your eyes\"  that song remains in all of my playlists. Love your music.my question would be, What is your favourite Indian dish?",
        "I just want to ask, a year ago you mentioned that you would be working on a second album (not the hip hop one) that project is still alive?",
        "Hi KSHMR. I just want to say thank you for your amazing music. My brother, sister and even my mum likes your music. Always rooting for you:)",
        "I know this question is kind of shallow. But do you follow a religion? Given how fundamentalist people of Kashmir are. I don’t mean to offend you btw. Just a genuine question.",
        "Music is challenging to my mental health in many ways, but it also brings me so much joy and it’s my place to create and express myself. Growing up, listening to artists I loved was a big emotional release for me",
        "Growing up , listening to kshmr was a big emotional release for me :)",
        "Hey Kshmr what's your chess rating now?",
        "How was your experience working with Mass Appeal ?",
        "Hey Kshmr. Just wanted to know the story behind your stage name?",
        "\nHey man\nCan you tell us about  the Collab with KR$NA??\nLike how you guys connected and stuff..",
        "Hey niles , I’ve been a hardcore fan of yours for a long time.\nWhich side of yours did you actually feel you’re being yourself at its peak, is it mvi, dreamz, the old bigroom style, the indian style or your more WESTERN EDM style?\nEver since you’ve been into the transition to a Western EDM type of vibe, you’ve massively lost your views and streams, is it safe to say that it is one of the main reasons for a KSHMR comeback to the Indian style? And safe to say you’re gonna dive more into it ?\nBig fan BTW tried to explain my question as thoroughly as possible :))))))",
        "How was your experience working with armaan malik?",
        "ANDDD plans on the next producer meet in delhi pls :’))))))))",
        "Alsu u/kshmrmusic , do you remember my username:PP",
        "Any plans on collaborating with nucleya or ritviz? Man, they both are so good. Have you heard of ritviz?",
        "WHAT BROO BHAII I WANT MY ANSWERS 😭😭",
        "Hey KSHMR what’s your plan on launching any songs with AFROJACK,i think if you both would work together then the outcome would be a greatest banger of all BTW your biggest fan wanna meet you so badly someday ❤️‍🔥 Love U KSHMR",
        "What's the one/few classic Indian instrument sounds/samples you haven't used it in any onf your track yet, that you are looking forward to use it in your upcoming tracks.",
        "Hey KSHMR please Upload full 1 HR set of ROAD TO ULTRA MUMBAI please witnessed the best set ever and to make it more rememberable we need it JAMES HYPE uploaded it Please we need yours Too",
        "I used your samples before I heard your songs, which was before I knew what you looked like haha.   \n\nI see posters for festivals you play in but have never had the chance to attend your show live. Which is your favorite venue where you played?    \n\nHuge fan man, keep being awesome🙏🔥",
        "How about a collab with Pritam, i honestly want to hear what that would sound like, i believe both of you have the same workflow and vibes in music, he has a lot of electronic influence in Bollywood songs and you have a lot of indian influence in electronic music, that makes a perfect pair, \nAlso another question, with the EDM scene evolving so fast, what are your predictions about what genre would have a massive impact in the coming time?",
        "Man i missed your AMA session. Will go through the post.\nYou are awesome ❤️",
        "Bro shall have done the qna at Indian hip-hop heads subreddit much better",
        "What are your views on your sample packs being so popular in the K-POP industry? And do you get any royalties for those? Love your music <3",
        "Hey KSHMR! Bigg fan since Jammu, Karate, and Secrets and have seldom missed an episode of Lesons of KSHMR. Just wanted tell you, you're such a great inspiration and just such an amazing producer. Always have been in awe of your music, the way you write it, the thinking that goes behind it and will always be. Thankyou for existing and being such an idol for me to look up to! Wishing you all the love!  \n \nFor the sake of asking, is there any specific genre you'd like to explore in the near future?",
        "I would not get these headphones for the microphone. They are terrible",
        "Are you vanilla Kashmir or occupied by Pakistan?",
        "Hello KSHMR . I just want to say that I love your music, it improved my music taste and expectations a lot . I have been following you since you released the single shiva and created the dharma worldwide .Harmonica Andromeda was also amazing , it was a unforgettable moment when I listened to it for the first time .\n\n&#x200B;\n\nI just want to ask that are you Dreamz and The MVI . Cus the music is so cool that I can't find similar style anywhere . \n\nI have kind of Grown out of just listening to EDM and shifted towards math rock and instrumental . But I always to listen to you irrespective of genre .",
        "You've had a huge influence on my playlist over the years . I love your stuff. \n\nI wanted to ask if your inspirations have changed as the years went by or are you still drawing from that well?",
        "What’s the history with your unreleased song ‘into the fire’? Will it ever be released?",
        "Wow it’s hard to think of an Indian instrument I haven’t used… but there are so many loops in Sounds of KSHMR Vol. 4 that I could imagine making a song with. Each melody was like my baby, I love them all",
        "In puzzles: 2554\n\nIn games: 1226",
        "Get me the old KSHMR, I wanna say Hi",
        "Great team, helped me with important decisions and to understand the hip-hop scene better — and of course, an honor to be releasing on the same label as Nas and Divine.",
        "Yes, most definitely. After this hip-hop album I will be focusing on dance music, and there’s already a lot in the works on that side of things.",
        "Bro do a music with Don diablo",
        "Thank you! My favorite is Tandoori chicken",
        "Yes, for sure, it will mostly likely happen towards the end of the year around October.\n\nI made a remix of the Gladiator song “Now We Are Free” and I think that whole soundtrack is amazing. I also love John Williams, he’s just on another level. And Final Fantasy composer Nobuo Uematsu is my favorite from the video game world. FF7 >>>>",
        "I wanted a platform to put out music I love, as well as a place for producers to learn and get resources. It aligns well with my philosophy of sharing as much as I can! All my packs and tutorials can be found at www.dharmaworldwide.com",
        "Yes I want to know this one. Is it because he's an artist from Kashmir?",
        "At least I am better than you at something hahaha",
        "I would guarantee it haha",
        "too old ig",
        "He is dreamz",
        "Is there any way I can interview you regarding your new album? I am a journalist with News18..",
        "Wow what a coincidence. Have been listening to all your tracks for last couple of days in loop. Love your work!!! No matter how many times I listen to it I never get bored.",
        "Went to your show at the end of last year in New City Gas. Had a blast. \nI really loved the different Indian cultural icons you showed in your projections on the screen.\nI smuggled some edibles in my shoe, too (in a packet ofc). Fun times.",
        "Niles really damn man. But I can't hear flutes away in that. But anyways thank you niles for answering. I saw you say this in fb Livestream bit we all thought you were confused",
        "When's ur album dropping i really can't wait for it anymore?? Btw big fan❤️",
        "Just watched the 'HAATH VARTHI' music video, it's dope man!! Video editing is top notch, I guess I have never seen such a good visual Indian music video.",
        "Your song \"Bombay Dreams\" made me realise that I had fallen in love with the love of my life. I still remember that moment, this song was newly released. I was standing by the bed listening to this song and feeling tears in my eyes, getting the realisation that i was falling hard in love with somebody :)",
        "Hey kshmr 🥺🥺🥺 big fan brother\nKaram album date???",
        "I love wildcard the most too! That, Dharma, and Mandala.",
        "BRO I LOVE YOU",
        "Hey KSHMR! Big Fan here , would you ever perform in South India?",
        "if you were to step into the music industry today, what you would've done differently this time?\n\nany tips for a newbie just installing fl studio or something similar to start producing music out of curiosity and interest?",
        "Are music schools worth it? What's the most important thing to really make it into the scene as a artist? I'm a young music producer",
        "Wildcard original mix. Was my first KSHMR song and glad to say it became my favorite very fast.",
        "KSHMR CAME HERE???",
        "Yessss mines wildcard too 🧡",
        "He already told the story behind his Name in his podcast with a YouTube channel called AFAIK.",
        "Got to know you from the game Free Fire, love your songs man!",
        "Hello!!\nHuge fan of yours ever since Dharma came out!!!\nI’ve used so many of your sounds for my FLPs and they’re amazing!!!\nI wanted to know how I could send you a project of mine that I know for sure you would love! And to make more interesting, it’s also got a little taste of South Indian music!!\nWill eagerly wait for your reply!!!",
        "Ping pong? You mean table tennis?",
        "Mine was Bombay dreams",
        "Thank you for everything you've done for the community and huge congratulations on your new releases. Your music is something someone remembers over a lot of tracks that sounds like just noise to me. I'm an audiophile from India and I love to deep dive into different styles of music to increase my creativity as a dubstep lover. I know you are a producer nerd who works all day and night to make sure that your style never goes out of time. I have a long list of questions only if you could take the time to answer but I hope wherever you are, you are going to inspire. \n\n\n1. How do you approach using sound design as a tool to create a sonic landscape in your music? What are your thoughts on using microtonality and exotic scales to achieve ethnic and dark sounds?\n\n2. When you start working on a track, which part of the arrangement do you usually begin with? Do you have any specific techniques or approaches to structuring your compositions?\n\n3. Could you share your best tip for arranging a track effectively? How do you ensure that the different elements in your arrangement work together cohesively?\n\n4. When it comes to writing melodic structures, what is your approach? Do you have any techniques or strategies that you find particularly useful in creating captivating melodies?\n\n5. With your diverse taste in music, how do you manage to handle various influences without getting overwhelmed? Do you have any methods or mindset that help you maintain a sense of cohesiveness in your work?\n\n6. When working on a track, how do you determine when it is finally done? How do you satisfy yourself and know that you've achieved your desired sound and arrangement?\n( answer these in any manner or sequence you're comfortable with )",
        "Hey KSHMR! Big fan here.\n\nI've been producing big room and free style EDM tracks for a year now, but I'm facing a challenge. \n\nWhenever I try to create a melody or verse, it ends up blending with existing melodies in my mind.\n\nHow do you craft your melodies and find inspiration for unique ones like the ones in your big room tracks? \n\nI've put in a lot of effort, but I haven't been able to create catchy melodies like yours. Any advice would be much appreciated. Thanks!",
        "I am saking the same thing here i think he should reply",
        "We know that in your album \"Harmónica Andromeda\" each song has a small story that in general all together tell only one. My question is, what is the story that the songs \"Dusty Fairytale, Slow, Tupinamba, You Don't Need To Ask and Come to life\" tell us?",
        "Very Interesting. Although being pure American of Indian descent, he drew inspiration for his name from his grandparents and named his stage name after the state of J&K. His dad immigrated from Kashmir to the US who's a Kashmiri Brahmin. \n\nI wonder if he did that during the forced exile of Kashmir refugees. If that's the reason for his son's stage name then KSMR has true respect for Kashmir's history.",
        "Indians are calling table tennis, ping pong now",
        "A"
    ],
    "cleaned_text": "hey rindia music producer dj ping pong enthusiast kshmr ama whats rindia excited finally ama w guys new album talented artists corners indian hiphop way much music kshmr inspired indian roots heritage first single haath varthi mc stan phenom dropped days ago ask anything want know album music past present lifecareer edit thanks rindia questions end ama hope one soon keep touch w social media stay tuned music coming soon ",
    "cleaned_title": "hey rindia music producer dj ping pong enthusiast kshmr ama",
    "cleaned_selftext": "whats rindia excited finally ama w guys new album talented artists corners indian hiphop way much music kshmr inspired indian roots heritage first single haath varthi mc stan phenom dropped days ago ask anything want know album music past present lifecareer edit thanks rindia questions end ama hope one soon keep touch w social media stay tuned music coming soon",
    "cleaned_comments": "seem hold deep fascination music technology tools share time particular piece music tech software significant impact sound style hey kshmr big fan wanted know consider best song hi relevant picture favourite headphones listening music tuning world reverb plugin kshmr reverb development since april challenging aspect process overcome inspiration album advice aspiring musicians development reverb plugin involved overcoming challenges related transients tell us process lessons learned came name karam totally love meaning word youve mentioned tiesto skilled incorporating young people process keep sound fresh similar approach incorporate new ideas work tell us upcoming collaborations works rich history splice packs often one downloaded whats process creating new pack hey kshmr first excited album second budding artist contact share music thanks share experiences kshmr label splice influenced music contributions producer community next song karam album month expect hear whole albumkaram see track list upcoming album mentioned discovery new sounds favorite part music give example new sound technique youve recently discovered incorporated work yooo niles loved haath varthi releasing whole album bro also potential collaboration ritviz works tracklist karam album also huge inspiration track brahmastra would love get opinion hi fan since cataracs days missed bombay chance youre coming back india one fo shows many songs album guess dropping track list collaboration mc stan come like working together haath varthi coming sunburn year frankly got nothing ask think best moment ive gotten yet get noticed wanted thank sample packs tutorials podcasts especially songs helped probably million others even start making music years dont think theres day making music havent chosen sound sounds kshmr sample banks hope match levels one day working everyday make dream reality thanks lots love mumbai also hope meet one day lmao started fan boying heavy hey niles plans coming sri lanka loved last album even bought vinyl expecting banger album love sri lanka nothing ask well collab future next big thing dhh sure best luck st dhh album karam karam coming youve recently launched record label dharma worldwide inspired start label bro didnt include frappe ash half duo named full power yungsta also part album karam rn top dhh artist listen discography understand saying see reddit years let ask redditbased questions discover reddit favourite subreddits popular reddit industry peers mc stan reddit p hey huge fan work looking forward next album desi rappers featuring favs question long working album whole process interacting rappers exploring new genre diffrent usually discover dhh rappers favorite ones remeber tweeting krsnas say name talking afaiks podcast expect song album whole vibe studio kps share similar background coming youve open struggles mental health past music helped cope challenges expect collab young stunners future many djs producers specific moment song sparked interest electronic music moment specific track artist made realize path wanted pursue youve held high place dj mags top djs poll several years feel achieve recognition recognition influence put pressure creative process hey kshmr know experience wild success like g couldnt go single club without hearing multiple times night still goes hard day hey kshmr expect drill tunes dhh artists big fan youve created years putting india map love story concept upcoming album karam question feel working artists rap hindino offence language havent got best grasp difficult sense werent able fully understand meaning behind verses new skrillex album kshmr karam harmonica andromeda differ terms influences along progression artist till performed numerous music festivals like coachella tomorrowland edc ultra sunburn share memorable experiences performances hello kshmr music producer india grow right way send beats melody get collabs also love track voices favourite apologies get question often bit versions harmonica andromeda tracks ever see light day remember mentioned interview super intrigued would sound like lol talk decision transition part cataracs becoming kshmr led change affect music collaboration tiesto secrets significant hit collaboration come process creating track renowned artist hey kshmr big fan ur works im jee aspirant wannabe music producer time im th standard currently unbearable pressure around mainly includes living upto expectations basically dont wan na leave behind passion producing musicas stated documentary grandfather wanted professor mba like ur father still managed get musicmy question ishow convince come passion spite career pressure exerted ur elders performing years tommorowland harmonica andromeda unique sound inspired create diverse range genres album first huge fan thinking make artwork send complete ye melody itni chocolaty kyun hai sir yo niles first congratulations haath varthi trending yt music wanted know theres artist wished karam apart ones already part also edm fans expect hiphop album like artistic approach towards particular genre pending collaborations edm producers yes thank hey kshmr first big thanks ama coming towards questions bring many dhh artists together album tacklist gon na drop eagerly waiting karam visuals song album like ha also favourite dr dre beat would love know ive gone sony wh xm series theyre believe q going get tracklist karam singles gon na drop one another music production haath varti phenomenal hey kshmr people say copying wests hiphop culture without adding something new indian element whats take btw best wishes upcoming album dont release snippets album yoo kshmr listening work last years youre absolutely crazy music production ekdam mast haath varthis music part im hyped asf album karam recent live ig youve mentioned track list soon also album within months youve mentioned ive three questions folk hyped asf expect complete tracks list within month also hows experience working dhh artists plans picking specific artists album gon na rap hyderabad kab aaraheyy ho midnight lion walk blood water im actually listening around world coincidence best hehehe witnessing krna x kshmr karam many songs gon na forthcoming karam album hey kshmr big fan style music time cataracs question asking every insta live ever drop remix song saxophone melody showed insta live also showed bruk get nobody live next track hey kshmr big fan much love collab martin garrix yep since last year dont fold thats issue like design man desi hiphop coming months feel regretful sidhu moose wala isnt today us would loved see work together could get see work punjabi artists like diljit shubh etc future ik youve got one track riar saab im super excited well interesting question changes ill go wildcard chorus super catchy really diverse musical elements indian jazz big room edm blend quite nicely irregular chromatic musicality second verse especially drop goes mental whenever play live info sooner would say full one weeks hey kshmr love much man wanted know ever release flutes away cause waiting long role represent play album question album launch idea live stream samays artist hour release play games n shit whatever engage people n hype people right release get many rappers album kshmr huge fan coming hyderabad since last show cancelled due covid ever going make shift back electrobig room house roots whats best part using ableton far know daw choice used past user experience drop learnstudy musical education howd get music first place australia malaysia inspirations big fan style filling niches btw keep love music wow thank much tell people running events book plans yet unrelated samsung ultra vs iphone pro max hey kshmr big fan favourite producerdj question would trying produce new genres edm like bigroom techno maybe uplifting trance since two really popular right love work cant wait full album songs saw feedingindia mumbai last december great music ive gone sony wh xm series theyre believe one good sound quality microphones think whole music making process part enjoyable spent lot time seeing gully boy getting acquainted rappers india stans name unavoidable listened whole insaan album realized something special asked team link booked session one day managed get two songs sweet kind person open minded mc stan collab commercial one like one wish lyrically better karam concept album story learn interludes told poor boy forms gang rises power song album invited artists choose moment characters journey use inspiration song reflects boys karam deeds end story cant escape consequence recommend buy dharma worldwide subscription basic knowledge music production wait see poland year feels like dream came true name mean killed production btw process layout goals new types sounds want include get talented group producers together house record drums instruments sound design spend weeks studios instrument players around world add new sounds process existing ones years hair falls swear ill never make another pack repeat smile krsna album thanks inspired diverse taste music previously simplified genres like edm pop case ha allowed creativity run free sometimes fit multiple genres one tune smile krsna album smile krsna album hi planning rescheduling live set san francisco also would ever consider trance set advice coming artists someone loves playing guitar hopefully good always wanted start band never found group advisable start solo project first advice coming artists someone loves playing guitar hopefully good always wanted start band never found group advisable start solo project first advice coming artists someone loves playing guitar hopefully good always wanted start band never found group advisable start solo project first think artists find question inspiration uninspired case karam guess goes back gully boy became excited hh scene india interest hip hop goes back beginning interest music get idea stage name place name get idea stage name place name hey kshmr loved song garena free fire plans tours current non edm producer working track showtek related fifa football looking forward hii kshmr hugeee fan music u coming pune id love come show collab young stunners divine recs mixing headphones hey kshmr cant contain excitement upcoming album karam anticipation real also haath varthi absolute banger heres couple things im curious know memorable experience inspiration influenced music production style whats memorable show performance youve ever collaborations dream collaborations mind future projects advice would give someone looking develop unique sound upcoming music producer bro delhi next im korean fan lot questions want know even though good english xb im curious mbti test type favorite kpop song favorite japanese animation far know like final fantasy quit smoking wonder kind god believe big part partner david leaving group tried cataracs soon felt puttering needed something new already falling love dance music tried hand producing truth dance music much diff genres arguably harder beat needs really stand without need vocal entertaining im glad made shift allowed lot freedom creativity one particular yes one favs album hey niles huge fan since still listen welcome kshmr vol please release reez kshmr id mark thanks reading challenging aspect consistent transient recognition dont know transients spikes sound volume signify new hit note accurately identifying transients core special fx kshmr reverb turns human ear easier time computer end got close perfect big fan say hi found listening jammu uber chicago blast songs headphones working small town india lots love keep rocking addition producing music youve also released sound packs producers use inspired share resources feel idea artists using sounds work youve launched dharma worldwide sublabel spinnin records vision behind creating platform align overall music career sending love thanks bro thanks wild ride opened many doors im thankful david dev think without song life would different never completed vs httpswwwdropboxcomshbwmpubbptsuyvaabyaoostnxtqdcqvwcadlhttpswwwdropboxcomshbwmpubbptsuyvaabyaoostnxtqdcqvwcadl advice someone wants pursue career music production thank cant really comment ppl wished everything yet still edm fans expect evolved sound many ways return darker dance oriented music im excited play live less poppy vocal focused yes least visualizer song dre many good beats one first comes mind xxplosive would loved work sidhu sad indeed yes one riar standout would love work shubh watching closely atm helped orchestrate entire project good friend aayushman helped connect artists devise plan sankalp right hand man every day one hell team helped greatly aayushman represent team addition reaching people ig etc would love hear crazy fan moment yea actually series dharma worldwide start beginning explain basic concepts music production try see poland kashmir paternal family gon na india tour album drops song mc stan mumble would kontakt think incorporating real world instruments core sound got ta wait little bit longer friend hey kshmr biggest fan picture small studio god inspiration making music inspiration hey best way wwwdharmaworldwidecomhttpswwwdharmaworldwidecom demo submissions page remember bringing dadaji twice stage sunburn song dedicated album flutes away became hymn reflection lion across field httpswwwyoutubecomwatchvfmvynfhawhttpswwwyoutubecomwatchvfmvynfhaw version thats one hey kshmr first huge fan ive following youre music since many many years super excited saw name announced ultra music lineup bangalore got tickets early possible said felt set underwhelming dont mean cause disrespect music played amazing feel expecting something else felt indian remixes unnecessary many songs merit could blow literally anyone away question trying cater indian audience differently experimenting something new huge fan hope see india hey niles bay area live experience show got canceled come back looking forward im hoping another one comes another note producer sounds music tracks movie soundtracks video games youve sampled maybe even generally really dig much love like music bro brrrooo brooooooroorororoo niles met kshmr zone welcome kshmr bro love music close eyes song remains playlists love musicmy question would favourite indian dish want ask year ago mentioned would working second album hip hop one project still alive hi kshmr want say thank amazing music brother sister even mum likes music always rooting know question kind shallow follow religion given fundamentalist people kashmir dont mean offend btw genuine question music challenging mental health many ways also brings much joy place create express growing listening artists loved big emotional release growing listening kshmr big emotional release hey kshmr whats chess rating experience working mass appeal hey kshmr wanted know story behind stage name hey man tell us collab krna like guys connected stuff hey niles ive hardcore fan long time side actually feel youre peak mvi dreamz old bigroom style indian style western edm style ever since youve transition western edm type vibe youve massively lost views streams safe say one main reasons kshmr comeback indian style safe say youre gon na dive big fan btw tried explain question thoroughly possible experience working armaan malik anddd plans next producer meet delhi pls alsu ukshmrmusic remember usernamepp plans collaborating nucleya ritviz man good heard ritviz broo bhaii want answers hey kshmr whats plan launching songs afrojacki think would work together outcome would greatest banger btw biggest fan wan na meet badly someday love u kshmr whats onefew classic indian instrument soundssamples havent used onf track yet looking forward use upcoming tracks hey kshmr please upload full hr set road ultra mumbai please witnessed best set ever make rememberable need james hype uploaded please need used samples heard songs knew looked like haha see posters festivals play never chance attend show live favorite venue played huge fan man keep awesome collab pritam honestly want hear would sound like believe workflow vibes music lot electronic influence bollywood songs lot indian influence electronic music makes perfect pair also another question edm scene evolving fast predictions genre would massive impact coming time man missed ama session go post awesome bro shall done qna indian hiphop heads subreddit much better views sample packs popular kpop industry get royalties love music hey kshmr bigg fan since jammu karate secrets seldom missed episode lesons kshmr wanted tell youre great inspiration amazing producer always awe music way write thinking goes behind always thankyou existing idol look wishing love sake asking specific genre youd like explore near future would get headphones microphone terrible vanilla kashmir occupied pakistan hello kshmr want say love music improved music taste expectations lot following since released single shiva created dharma worldwide harmonica andromeda also amazing unforgettable moment listened first time xb want ask dreamz mvi cus music cool cant find similar style anywhere kind grown listening edm shifted towards math rock instrumental always listen irrespective genre youve huge influence playlist years love stuff wanted ask inspirations changed years went still drawing well whats history unreleased song fire ever released wow hard think indian instrument havent used many loops sounds kshmr vol could imagine making song melody like baby love puzzles games get old kshmr wan na say hi great team helped important decisions understand hiphop scene better course honor releasing label nas divine yes definitely hiphop album focusing dance music theres already lot works side things bro music diablo thank favorite tandoori chicken yes sure mostly likely happen towards end year around october made remix gladiator song free think whole soundtrack amazing also love john williams hes another level final fantasy composer nobuo uematsu favorite video game world ff wanted platform put music love well place producers learn get resources aligns well philosophy sharing much packs tutorials found yes want know one hes artist kashmir least better something hahaha would guarantee haha old ig dreamz way interview regarding new album journalist news wow coincidence listening tracks last couple days loop love work matter many times listen never get bored went show end last year new city gas blast really loved different indian cultural icons showed projections screen smuggled edibles shoe packet ofc fun times niles really damn man cant hear flutes away anyways thank niles answering saw say fb livestream bit thought confused whens ur album dropping really cant wait anymore btw big fan watched haath varthi music video dope man video editing top notch guess never seen good visual indian music video song bombay dreams made realise fallen love love life still remember moment song newly released standing bed listening song feeling tears eyes getting realisation falling hard love somebody hey kshmr big fan brother karam album date love wildcard dharma mandala bro love hey kshmr big fan would ever perform south india step music industry today wouldve done differently time tips newbie installing fl studio something similar start producing music curiosity interest music schools worth whats important thing really make scene artist im young music producer wildcard original mix first kshmr song glad say became favorite fast kshmr came yessss mines wildcard already told story behind name podcast youtube channel called afaik got know game free fire love songs man hello huge fan ever since dharma came ive used many sounds flps theyre amazing wanted know could send project mine know sure would love make interesting also got little taste south indian music eagerly wait reply ping pong mean table tennis mine bombay dreams thank everything youve done community huge congratulations new releases music something someone remembers lot tracks sounds like noise im audiophile india love deep dive different styles music increase creativity dubstep lover know producer nerd works day night make sure style never goes time long list questions could take time answer hope wherever going inspire approach using sound design tool create sonic landscape music thoughts using microtonality exotic scales achieve ethnic dark sounds start working track part arrangement usually begin specific techniques approaches structuring compositions could share best tip arranging track effectively ensure different elements arrangement work together cohesively comes writing melodic structures approach techniques strategies find particularly useful creating captivating melodies diverse taste music manage handle various influences without getting overwhelmed methods mindset help maintain sense cohesiveness work working track determine finally done satisfy know youve achieved desired sound arrangement answer manner sequence youre comfortable hey kshmr big fan ive producing big room free style edm tracks year im facing challenge whenever try create melody verse ends blending existing melodies mind craft melodies find inspiration unique ones like ones big room tracks ive put lot effort havent able create catchy melodies like advice would much appreciated thanks saking thing think reply know album harmnica andromeda song small story general together tell one question story songs dusty fairytale slow tupinamba dont need ask come life tell us interesting although pure american indian descent drew inspiration name grandparents named stage name state jk dad immigrated kashmir us whos kashmiri brahmin wonder forced exile kashmir refugees thats reason sons stage name ksmr true respect kashmirs history indians calling table tennis ping pong",
    "light_cleaned_title": "Hey /r/India it’s music producer, DJ & ping pong enthusiast KSHMR here, AMA!",
    "light_cleaned_selftext": "What's up /r/India! So excited to finally be doing this AMA w/ you guys. My new album with talented artists from all corners of Indian hip-hop is on the way, and much of my music as KSHMR has been inspired by my Indian roots and heritage. The first single 'Haath Varthi' with MC Stan and Phenom dropped a few days ago. Ask me anything you want to know about me, the album, music past and present, or my life/career! EDIT: Thanks /r/India for all of your questions! This is the end of my AMA for now -- hope to do one again soon. Keep in touch w/ me on social media and stay tuned for more music coming very soon...",
    "light_cleaned_comments": "You seem to hold a deep fascination for music technology and tools. Can you share a time when a particular piece of music tech or software had a significant impact on your sound or style? hey kshmr big fan here :) just wanted to know what do you consider your own best song? Hi! Relevant to your picture: what are your favourite headphones for listening to music & tuning out the world Your reverb plugin 'KSHMR Reverb' has been in development since April 2020. What was the most challenging aspect of this process and how did you overcome it? what was your inspiration for this album? What advice do you have to aspiring musicians? The development of your reverb plugin involved overcoming challenges related to transients. Can you tell us more about this process and the lessons you learned from it? How you came up with the name \"Karam” Totally love the meaning of the word. You've mentioned that Tiesto is skilled at incorporating young people into his process to keep the sound fresh. Do you have a similar approach, and if so, how do you incorporate new ideas into your work? Can you tell us about any upcoming collaborations you have in the works? You have a rich history with Splice and your packs are often one of the most downloaded. What's your process when creating a new pack? Hey kshmr, first of very excited for your album. Second, how can budding artist contact you to share their music to you. Thanks. Can you share more about your experiences with your KSHMR label on Splice and how it's influenced your music and your contributions to the producer community? Next Song of Karam Album In which month we can expect to hear the whole album\"Karam\" When can we see track list of the upcoming album? You mentioned \"the discovery of new sounds\" as your favorite part of music. Can you give an example of a new sound or technique that you've recently discovered and incorporated into your work? Yooo Niles! Loved Haath Varthi!! When are you releasing the whole album bro? Also any potential collaboration with Ritviz in the works? Tracklist of karam album? You were also a huge inspiration for my track 'Brahmastra'! Would love to get your opinion on it :) Hi. Been a fan since Cataracs days. Missed you in Bombay. Any chance you're coming back to India for one fo your shows? How many songs are there in the album? My guess is 13-15 and When you are dropping the track list. How did the collaboration with MC Stan come about, and what was it like working together on 'Haath Varthi'? Coming for sunburn this year? Frankly I got nothing to ask, but I think this is the best moment I've gotten yet to get noticed by you. I just wanted to thank you, from your sample packs to your tutorials to your podcasts and especially your songs have helped me and probably million others to even start making music. It's been 5 years now, I don't think there's been a day of making music where I havent chosen a sound from the sounds of kshmr sample banks. Hope to match your levels one day, working everyday to my make dream a reality. Thanks once again. Lots of love from Mumbai. Also I hope I can meet you one day😭 lmao started fan boy-ing heavy. Hey Niles, Any plans on coming to Sri Lanka? Loved your last album even bought myself the vinyl 😊 Expecting a banger album Love from Sri Lanka Nothing to ask, but we'll collab in future. I will be the next big thing in DHH for sure.. Best of luck for your 1st DHH album 'KARAM' WHEN IS KARAM COMING OUT ???? You've recently launched your own record label, Dharma Worldwide. What inspired you to start your own label? BRO WHY DIDN'T YOU INCLUDE FRAPPE ASH (1/2 HALF OF A DUO NAMED FULL POWER IN WHICH YUNGSTA IS ALSO A PART OF) IN YOUR ALBUM KARAM. RN HE IS TOP 5 DHH ARTIST AND YOU SHOULD LISTEN TO HIS DISCOGRAPHY TO UNDERSTAND WHAT I AM SAYING !! I can see that you are on Reddit for 7 years! So let me ask some Reddit-based questions : 1. How did you discover Reddit? 2. Which are your favourite subreddits 3. How popular is Reddit with your industry peers ? 4. Is MC stan on Reddit too ? :P hey, a huge fan of your work. Looking forward to your next album with desi rappers featuring my favs 1.my question to you is for how long were you working in the album and how was the whole process while interacting with rappers and exploring a new genre diffrent from what you usually do 2. How do you discover all the DHH rappers and who are your most favorite ones 3. I remeber you tweeting about krsna's say my name and talking about him in afaiks podcast. So can we expect a song in the album with him and was the whole vibe in studio as both of you are KPs and share a similar background... Only coming there if you are there ! You've been very open about your struggles with mental health in the past. How has music helped you cope with these challenges? Can we expect a collab with young stunners in future? Many DJs and producers have a specific moment or song that sparked their interest in electronic music. What was that moment for you? Was there a specific track or artist that made you realize this was the path you wanted to pursue? You've held a high place on DJ Mag's Top 100 DJs poll for several years. How does it feel to achieve such recognition? And how does this recognition influence or put pressure on your creative process? Hey KSHMR, I have to know: how was it to experience the wild success of Like A G6?! you couldn't go to a single club in in the 2010s without hearing in multiple times a night, and it still goes hard to this day Hey KSHMR, Can we expect some drill tunes with DHH artists from you ? Big fan of all you’ve created in these years, putting India on the map. Love the story concept of the upcoming album Karam. Question- How did you feel working with artists that rap in Hindi(no offence, but a language that you haven’t got the best grasp on)? Was it difficult in the sense that you weren’t able to fully understand the meaning behind their verses? Be on the new skrillex album kshmr How do Karam and Harmonica Andromeda differ in terms of influences along with your progression as an artist from then till now? You have performed at numerous music festivals like Coachella, Tomorrowland, EDC, Ultra, and Sunburn. Can you share some of your most memorable experiences from these performances? Hello KSHMR, How can a music producer in India grow right now and is there a way to send you beats or melody to get collabs with you? Also love your track Voices it's my favourite. Apologies if you get this question often but will the 8-bit versions of a few Harmonica Andromeda tracks ever see the light of day? I remember you mentioned it in an interview and it had me super intrigued with what it would sound like lol Can you talk about your decision to transition from being part of The Cataracs to becoming Kshmr? What led to this change, and how did it affect your music? Your collaboration with Tiesto on \"Secrets\" was a significant hit. How did this collaboration come about, and what was the process of creating this track with such a renowned artist? Hey kshmr.... Big fan of ur works ... I'm a jee aspirant and wannabe music producer at the same time... I'm at 12 th standard currently and there is unbearable pressure all around me ... Which mainly includes living upto the expectations basically... But I don't wanna leave behind the passion of producing music...as you stated in the documentary that your grandfather wanted you to be a professor or MBA like ur father... But you still managed to get into music...my question is...how did you convince yourself to come into passion in spite of that career pressure exerted by ur elders? are you performing this years tommorowland? Harmonica Andromeda has a very unique sound. What inspired you to create such a diverse range of genres in this album? First of all i am a huge fan of yours ,I was thinking to make a artwork for you ,where can I send it to you when it's complete? ye melody itni chocolaty kyun hai sir ? Yo Niles First of all Congratulations for Haath Varthi , it's trending at #1 on yt music I wanted to know if there's some artist that you wished to have on Karam , apart from the ones who are already a part of it ! Also what can your EDM fans expect after the Hip-Hop album ....like your artistic approach towards a particular genre Are there some pending collaborations with other edm producers ? If yes with whom ? Thank you :)) Hey KSHMR, First of all a Big Thanks for this AMA. And coming towards my Questions. 1. How did you bring these many DHH Artists together for the Album? 2. When is the tacklist gonna drop? Eagerly waiting for KARAM!!! Will there be visuals for each song on the album? Like there was for HA? Also what is your favourite Dr. Dre beat? Would love to know! I’ve gone with the Sony WH-1000 XM series (they’re on 5 now I believe) Q) Are we going to get a tracklist of KARAM or singles gonna drop one after another ‼️‼️ Music production on haath varti was phenomenal 🙌 Hey KSHMR, Some people say that we're just copying west's hiphop culture without adding something new or Indian element to it. What's your take on that. Btw best wishes for your Upcoming Album. And don't release more snippets from the album. Yoo, KSHMR, i have been listening to your work for the last 2 years, you're absolutely crazy at music production, ekdam mast. HAATH VARTHI's music part 🫡. I'm hyped asf for your album KARAM, in the recent live on IG you've mentioned that track list will not be out soon, also the album will be out within 3 months as you've mentioned too; I've three questions:) : 1. When can I or any folk who is hyped asf can expect the complete tracks list, within a month? Also how's your experience working with DHH artists, did you have any plans on picking specific artists for this album? 2. Gonna rap again? 3. Hyderabad kab aaraheyy ho? Midnight lion walk, blood in the water 🛐 I'm actually listening to \"around the world\" now, coincidence at its best, hehehe. Will we be witnessing a KR$NA X KSHMR in KARAM How many songs are gonna be there in the forthcoming 'KARAM' album? Hey #kshmr Big Fan🙌 of you & your style of doing Music from the time of Cataracs, **1 Question i am asking in every insta live you do:-- will you ever drop that Remix Song which had a Saxophone melody( you showed on 📷insta live, you also showed 'Bruk It Down' & 'Get With Nobody' on that live) Next track ? Hey KSHMR, big fan and much love to you. When will you do a Collab with Martin Garrix? yep! i own those since last year. they don't fold up but that's not an issue for me, i like their design Man with your desi hip-hop coming in a few months , I feel so regretful that Sidhu Moose Wala isn't here today with us ! Would have loved to see you 2 work together:( Could we get to see you work with some Punjabi artists like Diljit, Shubh etc in future ( ik you've got one track Riar Saab and I'm super excited for it as well ) Interesting question, as it changes, but I’ll go with Wildcard because: - the chorus is super catchy - it has really diverse musical elements: Indian, jazz, big room EDM and they all blend quite nicely - there is irregular / chromatic musicality in the second verse especially - the drop goes mental whenever I play it live More info will be out sooner, but I would say a full one in about 6 weeks Hey kshmr i love you so much man just wanted to know will you ever release flutes away cause we have been waiting for so long What role did Represent play in your album? Not a question but Album launch idea, do a live stream on samay's with all the artist hour before the release play games n shit or whatever that will engage people n will hype people right before release ❤ How did you get so many rappers on the album? KSHMR huge fan!! When are you coming to Hyderabad? Since the last show of yours was cancelled due to COVID. \\- are you ever going to make a shift back to your electro/big room house roots? \\- what's the best part about using ableton (as far as i know, this is your DAW of choice), and if you used any in the past how was your user experience with them / why did you drop them? \\- did you learn/study any musical education? how'd you get into music in the first place? \\- have you been to australia or malaysia before? \\- who are your inspirations? big fan of your style and filling of the niches btw, keep it up ! Love your music Wow thank you so much! Tell the people running events there to book me :) no plans as of yet Unrelated but, Samsung S23 ultra vs iPhone 14 Pro Max Hey KSHMR i am a big fan of yours and you are my favourite producer/dj. My question is that would you be trying to produce new genres of edm like bigroom techno or maybe uplifting trance since these two are really popular right now. Love your work can't wait for the full album and other songs ! Saw you at feedingindia mumbai last December. Great music! >I’ve gone with the Sony WH-1000 XM series (they’re on 5 now I believe) I have the same one. They are so good with sound quality. 8 microphones too I think. In the whole music making process, which part is the most enjoyable for you? I spent a lot of time after seeing Gully Boy getting acquainted with rappers in India and Stan's name was unavoidable. I listened to the whole Insaan album and realized there was something very special about him... So I asked my team to link me up and we booked a session. It was only one day but we managed to get through two songs and he was a very sweet, kind person. Very open minded Is the other mc stan collab a commercial one like this one ? I wish it's lyrically better Karam is a concept album, and it has a story that we learn through the interludes: we’re told of a poor boy who forms a gang and rises to power. For each song on the album, I invited the artists to choose a moment in our character’s journey and use that as inspiration. Each song reflects the boy's karam (deeds) and, by the end of the story, he can't escape the consequence of them Do you recommend me to buy dharma worldwide subscription as I have only basic knowledge in music production? Cannot wait to see you in Poland this year, it feels like a dream came true🇵🇱 What does your name mean? You killed it at the production btw My process is this: \\- Layout the goals, what new types of sounds I want to include \\- Get a talented group of producers together in a house who record drums and instruments, and do sound design \\- Spend weeks in studios with instrument players from around the world \\- Add new sounds and process existing ones for 1.5 years or until my hair falls out \\- Swear to myself I'll never make another pack again \\- Repeat Just smile if krsna is there in Album 😏 Thanks. I was inspired by my own diverse taste in music, which I had previously simplified into genres like EDM and pop. In the case of HA I allowed my creativity to run free and sometimes fit multiple genres into one tune Just smile if krsna is there in Album 😏 Just smile if krsna is there in Album?😏 Hi!! Are you planning on rescheduling your live set in San Francisco? Also would you ever consider doing a trance set? Any advice for up and coming artists. As someone who loves playing the guitar and hopefully good at it, I always wanted to start a band but never found the group. Is it advisable for me to start a solo project first? Any advice for up and coming artists. As someone who loves playing the guitar and hopefully good at it, I always wanted to start a band but never found the group. Is it advisable for me to start a solo project first? Any advice for up and coming artists. As someone who loves playing the guitar and hopefully good at it, I always wanted to start a band but never found the group. Is it advisable for me to start a solo project first? I think all artists find the question \"what was your inspiration for \\_\\_\\_\\_?\" to be very.... uninspired But in the case of KARAM I guess it goes back to Gully Boy, when I became very excited about the HH scene in India. And my interest in hip hop goes back to the very beginning of my interest in music How did you get the Idea of your stage name and why the place name? How did you get the idea of your stage name and why the place name? Hey KSHMR, I loved your song in Garena free fire, Any plans on tours? Who is your current non edm producer? Were you working on some track with showtek which was related to fifa or football ? Was looking forward to it Hii KSHMR a hugeee fan of your music When are u coming to Pune Id love to come to your show :) Collab with young stunners or divine when ? Recs for mixing headphones? Hey KSHMR! I can't contain my excitement for your upcoming album Karam! The anticipation is real. Also Haath Varthi is an absolute banger!! Here’s a couple of things I’m curious to know- 1. What was the most memorable experience or inspiration that influenced your music production style? 2. What's the most memorable show or performance you've ever had? 3. Are there any collaborations or dream collaborations you have in mind for future projects? 4. What advice would you give to someone looking to develop their own unique sound as an upcoming music producer? Bro when will you be in Delhi next I'm a Korean fan. I have a lot of questions. I want to know even though I am not good at English. &#x200B; 1. I'm curious about MBTI TEST TYPE. 2. Do you have a favorite Kpop song? 3. Do you have a favorite Japanese animation? As far as I know, I like Final Fantasy 7. 4. Did you quit smoking? 5.I wonder what kind of god you believe in A big part of it was my partner David leaving the group... I tried to be \"The Cataracs\" by myself for a while but soon felt it was puttering out and I needed something new. I was already falling in love with dance music and tried my hand in producing it. The truth is dance music is much diff than other genres (arguably harder) because the beat needs to really stand on its own without need for a vocal to be entertaining. But I'm so glad that I made the shift as it allowed me a lot of freedom and creativity One in particular yes :) and it's one of my favs from the album Hey Niles! huge fan here since 2015 I still listen to Welcome to KSHMR VOL 7 Please release the REEZ & KSHMR - ID (12:50 Mark) Thanks for reading this The most challenging aspect was consistent transient recognition. For those who don't know, transients are spikes in sound volume, which should signify a new \"hit\" or \"note\". Accurately identifying transients was core to the special FX in KSHMR Reverb, and it turns out that the human ear has an easier time doing this than a computer. But, in the end, we got close to perfect :) Big fan here. Just to say Hi! Found you while listening to Jammu in an Uber in Chicago in 2015. Now I blast your songs on my headphones while working in a small town in India. Lots of love! Keep rocking. In addition to producing music, you've also released sound packs for other producers to use. What inspired you to share these resources, and how do you feel about the idea of other artists using your sounds in their own work? You've launched Dharma Worldwide, a sublabel of Spinnin' Records. What was your vision behind creating this platform, and how does it align with your overall music career? Sending you love, thanks bro Thanks, that was a wild ride. It opened many doors for me and I'm very thankful to David and Dev for it... I think without that song my life would have been very different I never completed them but here are the V1s: [https://www.dropbox.com/sh/bwmp1ubbptsuyv3/AABYAooStnXtq25dCQ0Vw1c2a?dl=0](https://www.dropbox.com/sh/bwmp1ubbptsuyv3/AABYAooStnXtq25dCQ0Vw1c2a?dl=0) Do you have any advice for someone who wants to pursue a career in music production? Thank you, I can't really comment on ppl I wished to have. Not everything is 100% yet still EDM fans can expect an evolved sound, but in many ways a return to darker, more dance oriented music that I'm excited to play live -- less poppy / vocal focused Yes there will at least be a visualizer for each song. Dre has so many good beats but the one that first comes to mind is Xxplosive Would have loved to work with Sidhu, very sad indeed Yes the one with Riar is a standout and I would love to work with Shubh! Watching him very closely atm They helped orchestrate the entire project. My good friend Aayushman helped connect me to all the artists and devise a plan, and Sankalp was my right hand man through each and every day. They are one hell of a team. I was helped greatly by Aayushman and the REPRESENT team, in addition to me reaching out to people on IG etc. Would love to hear about a crazy fan moment! Yea 100% there is actually a series on Dharma Worldwide where I start from the very beginning and explain the basic concepts of music production. Try it out! See you in Poland :) Kashmir Where my paternal family is from Gonna do an India tour when the album drops The other song with MC stan is Mumble or what ? 100% that would be Kontakt, I think incorporating real world instruments has been at the core of my sound 1. you 2. gotta 3. wait 4. just 5. a 6. little 7. bit 8. longer 9. my 10. friend HEY KSHMR A BIGGEST FAN OF YOURS. YOUR PICTURE IS IN MY SMALL STUDIO AS GOD, INSPIRATION FOR MAKING MUSIC. WHO IS YOUR INSPIRATION ? Hey the best way is on [www.dharmaworldwide.com](https://www.dharmaworldwide.com) in the demo submissions page We remember you bringing your Dadaji twice to the stage at Sunburn, is there any song dedicated to him in the album? Flutes Away became \"Hymn of Reflection\" on Lion Across The Field [https://www.youtube.com/watch?v=1FmvYnFha6w](https://www.youtube.com/watch?v=1FmvYnFha6w) There is no other version.. That's the one Hey KSHMR, First off HUGE FAN. I've been following you're music since many many years. I was super excited when I saw your name announced in the Ultra Music lineup ( Bangalore) and got the tickets as early as possible. That being said i felt the set to be underwhelming, I dont mean to cause any disrespect, the music played were amazing, but I feel i was expecting something else. I felt that the indian remixes were unnecessary because you have SO MANY songs of your own merit that could blow literally anyone away. So my question is, were you trying to cater the Indian Audience differently or were you experimenting something new ? Again huge FAN and hope to see you again in India 🥰😊 Hey Niles! Will the Bay Area live experience show that got canceled come back? Was looking forward to it, so I'm hoping another one comes through! On another note, as a producer, is there any sounds or music tracks from movie soundtracks or video games that you've sampled from? Or maybe even just generally really dig? Much love 🙏 What do you like the most about music? BRO BRRROOO BROOOOOOROOROROROO When Niles met Kshmr zone & Welcome to KSHMR ! 👀 Bro love the music on \" close your eyes\" that song remains in all of my playlists. Love your music.my question would be, What is your favourite Indian dish? I just want to ask, a year ago you mentioned that you would be working on a second album (not the hip hop one) that project is still alive? Hi KSHMR. I just want to say thank you for your amazing music. My brother, sister and even my mum likes your music. Always rooting for you:) I know this question is kind of shallow. But do you follow a religion? Given how fundamentalist people of Kashmir are. I don’t mean to offend you btw. Just a genuine question. Music is challenging to my mental health in many ways, but it also brings me so much joy and it’s my place to create and express myself. Growing up, listening to artists I loved was a big emotional release for me Growing up , listening to kshmr was a big emotional release for me :) Hey Kshmr what's your chess rating now? How was your experience working with Mass Appeal ? Hey Kshmr. Just wanted to know the story behind your stage name? Hey man Can you tell us about the Collab with KR$NA?? Like how you guys connected and stuff.. Hey niles , I’ve been a hardcore fan of yours for a long time. Which side of yours did you actually feel you’re being yourself at its peak, is it mvi, dreamz, the old bigroom style, the indian style or your more WESTERN EDM style? Ever since you’ve been into the transition to a Western EDM type of vibe, you’ve massively lost your views and streams, is it safe to say that it is one of the main reasons for a KSHMR comeback to the Indian style? And safe to say you’re gonna dive more into it ? Big fan BTW tried to explain my question as thoroughly as possible :)))))) How was your experience working with armaan malik? ANDDD plans on the next producer meet in delhi pls :’)))))))) Alsu u/kshmrmusic , do you remember my username:PP Any plans on collaborating with nucleya or ritviz? Man, they both are so good. Have you heard of ritviz? WHAT BROO BHAII I WANT MY ANSWERS 😭😭 Hey KSHMR what’s your plan on launching any songs with AFROJACK,i think if you both would work together then the outcome would be a greatest banger of all BTW your biggest fan wanna meet you so badly someday ❤️‍🔥 Love U KSHMR What's the one/few classic Indian instrument sounds/samples you haven't used it in any onf your track yet, that you are looking forward to use it in your upcoming tracks. Hey KSHMR please Upload full 1 HR set of ROAD TO ULTRA MUMBAI please witnessed the best set ever and to make it more rememberable we need it JAMES HYPE uploaded it Please we need yours Too I used your samples before I heard your songs, which was before I knew what you looked like haha. I see posters for festivals you play in but have never had the chance to attend your show live. Which is your favorite venue where you played? Huge fan man, keep being awesome🙏🔥 How about a collab with Pritam, i honestly want to hear what that would sound like, i believe both of you have the same workflow and vibes in music, he has a lot of electronic influence in Bollywood songs and you have a lot of indian influence in electronic music, that makes a perfect pair, Also another question, with the EDM scene evolving so fast, what are your predictions about what genre would have a massive impact in the coming time? Man i missed your AMA session. Will go through the post. You are awesome ❤️ Bro shall have done the qna at Indian hip-hop heads subreddit much better What are your views on your sample packs being so popular in the K-POP industry? And do you get any royalties for those? Love your music <3 Hey KSHMR! Bigg fan since Jammu, Karate, and Secrets and have seldom missed an episode of Lesons of KSHMR. Just wanted tell you, you're such a great inspiration and just such an amazing producer. Always have been in awe of your music, the way you write it, the thinking that goes behind it and will always be. Thankyou for existing and being such an idol for me to look up to! Wishing you all the love! For the sake of asking, is there any specific genre you'd like to explore in the near future? I would not get these headphones for the microphone. They are terrible Are you vanilla Kashmir or occupied by Pakistan? Hello KSHMR . I just want to say that I love your music, it improved my music taste and expectations a lot . I have been following you since you released the single shiva and created the dharma worldwide .Harmonica Andromeda was also amazing , it was a unforgettable moment when I listened to it for the first time . &#x200B; I just want to ask that are you Dreamz and The MVI . Cus the music is so cool that I can't find similar style anywhere . I have kind of Grown out of just listening to EDM and shifted towards math rock and instrumental . But I always to listen to you irrespective of genre . You've had a huge influence on my playlist over the years . I love your stuff. I wanted to ask if your inspirations have changed as the years went by or are you still drawing from that well? What’s the history with your unreleased song ‘into the fire’? Will it ever be released? Wow it’s hard to think of an Indian instrument I haven’t used… but there are so many loops in Sounds of KSHMR Vol. 4 that I could imagine making a song with. Each melody was like my baby, I love them all In puzzles: 2554 In games: 1226 Get me the old KSHMR, I wanna say Hi Great team, helped me with important decisions and to understand the hip-hop scene better — and of course, an honor to be releasing on the same label as Nas and Divine. Yes, most definitely. After this hip-hop album I will be focusing on dance music, and there’s already a lot in the works on that side of things. Bro do a music with Don diablo Thank you! My favorite is Tandoori chicken Yes, for sure, it will mostly likely happen towards the end of the year around October. I made a remix of the Gladiator song “Now We Are Free” and I think that whole soundtrack is amazing. I also love John Williams, he’s just on another level. And Final Fantasy composer Nobuo Uematsu is my favorite from the video game world. FF7 >>>> I wanted a platform to put out music I love, as well as a place for producers to learn and get resources. It aligns well with my philosophy of sharing as much as I can! All my packs and tutorials can be found at Yes I want to know this one. Is it because he's an artist from Kashmir? At least I am better than you at something hahaha I would guarantee it haha too old ig He is dreamz Is there any way I can interview you regarding your new album? I am a journalist with News18.. Wow what a coincidence. Have been listening to all your tracks for last couple of days in loop. Love your work!!! No matter how many times I listen to it I never get bored. Went to your show at the end of last year in New City Gas. Had a blast. I really loved the different Indian cultural icons you showed in your projections on the screen. I smuggled some edibles in my shoe, too (in a packet ofc). Fun times. Niles really damn man. But I can't hear flutes away in that. But anyways thank you niles for answering. I saw you say this in fb Livestream bit we all thought you were confused When's ur album dropping i really can't wait for it anymore?? Btw big fan❤️ Just watched the 'HAATH VARTHI' music video, it's dope man!! Video editing is top notch, I guess I have never seen such a good visual Indian music video. Your song \"Bombay Dreams\" made me realise that I had fallen in love with the love of my life. I still remember that moment, this song was newly released. I was standing by the bed listening to this song and feeling tears in my eyes, getting the realisation that i was falling hard in love with somebody :) Hey kshmr 🥺🥺🥺 big fan brother Karam album date??? I love wildcard the most too! That, Dharma, and Mandala. BRO I LOVE YOU Hey KSHMR! Big Fan here , would you ever perform in South India? if you were to step into the music industry today, what you would've done differently this time? any tips for a newbie just installing fl studio or something similar to start producing music out of curiosity and interest? Are music schools worth it? What's the most important thing to really make it into the scene as a artist? I'm a young music producer Wildcard original mix. Was my first KSHMR song and glad to say it became my favorite very fast. KSHMR CAME HERE??? Yessss mines wildcard too 🧡 He already told the story behind his Name in his podcast with a YouTube channel called AFAIK. Got to know you from the game Free Fire, love your songs man! Hello!! Huge fan of yours ever since Dharma came out!!! I’ve used so many of your sounds for my FLPs and they’re amazing!!! I wanted to know how I could send you a project of mine that I know for sure you would love! And to make more interesting, it’s also got a little taste of South Indian music!! Will eagerly wait for your reply!!! Ping pong? You mean table tennis? Mine was Bombay dreams Thank you for everything you've done for the community and huge congratulations on your new releases. Your music is something someone remembers over a lot of tracks that sounds like just noise to me. I'm an audiophile from India and I love to deep dive into different styles of music to increase my creativity as a dubstep lover. I know you are a producer nerd who works all day and night to make sure that your style never goes out of time. I have a long list of questions only if you could take the time to answer but I hope wherever you are, you are going to inspire. 1. How do you approach using sound design as a tool to create a sonic landscape in your music? What are your thoughts on using microtonality and exotic scales to achieve ethnic and dark sounds? 2. When you start working on a track, which part of the arrangement do you usually begin with? Do you have any specific techniques or approaches to structuring your compositions? 3. Could you share your best tip for arranging a track effectively? How do you ensure that the different elements in your arrangement work together cohesively? 4. When it comes to writing melodic structures, what is your approach? Do you have any techniques or strategies that you find particularly useful in creating captivating melodies? 5. With your diverse taste in music, how do you manage to handle various influences without getting overwhelmed? Do you have any methods or mindset that help you maintain a sense of cohesiveness in your work? 6. When working on a track, how do you determine when it is finally done? How do you satisfy yourself and know that you've achieved your desired sound and arrangement? ( answer these in any manner or sequence you're comfortable with ) Hey KSHMR! Big fan here. I've been producing big room and free style EDM tracks for a year now, but I'm facing a challenge. Whenever I try to create a melody or verse, it ends up blending with existing melodies in my mind. How do you craft your melodies and find inspiration for unique ones like the ones in your big room tracks? I've put in a lot of effort, but I haven't been able to create catchy melodies like yours. Any advice would be much appreciated. Thanks! I am saking the same thing here i think he should reply We know that in your album \"Harmónica Andromeda\" each song has a small story that in general all together tell only one. My question is, what is the story that the songs \"Dusty Fairytale, Slow, Tupinamba, You Don't Need To Ask and Come to life\" tell us? Very Interesting. Although being pure American of Indian descent, he drew inspiration for his name from his grandparents and named his stage name after the state of J&K. His dad immigrated from Kashmir to the US who's a Kashmiri Brahmin. I wonder if he did that during the forced exile of Kashmir refugees. If that's the reason for his son's stage name then KSMR has true respect for Kashmir's history. Indians are calling table tennis, ping pong now A"
}