{
    "id": "1hhl7rd",
    "title": "A commentary on what ails India’s direct and indirect tax administration from an export",
    "url": "https://youtu.be/KVhh6omT7mk",
    "selftext": "\n\n1. Currently objective is revenue maximisation not growth maximisation. Though taxation is a by product of economical growth.\n2. Lack of tax certainty is more important for investors/growth than the tax rate. \n3. Simplified tax code is an oxymoron. The direct tax code is going to create more mess than clean it up. \n4. Lack of clarity and consistency in GST rules is a nightmare. \n\nAnd more. \n\nWatch the video and Datar shares interesting examples of killing the golden goose mindset that exists. \n\nRequest: Does anyone know how to get AI to create summary notes of videos? \n\nAnecdote he shares: \n- A European car marker gets 2 % revenue from India and has 98% of litigations from India. \n- A tax officer clubbed the interest income of bank and ask for GST on it. Then they clubbed all expenses and asked GST on it. \n- Another asked an export oriented manufacturing FDI to share millions of export manifest which is logistically impossible (imagine how many papers would be printed). So they decided all exports are interstate sales and hence GST needs to be paid. \n- Central government claims subsidies given by states to attract industries as income and demand income tax on it. So if Karnataka gives you 100 rs subsidy by forgoing stamp duty collection, company owes 25 rs as income tax.\n\n",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1734584047.0,
    "convurl": "https://external-preview.redd.it/TZmkPDEUsBzmcQha72_f6FhEfL_w9VGIlkAHYbYprEY.jpg?auto=webp&s=877d283af5662ab6e05282dcca2b5462c9ff3ec2",
    "comments": [],
    "cleaned_text": "commentary ails indias direct indirect tax administration export currently objective revenue maximisation growth maximisation though taxation product economical growth lack tax certainty important investorsgrowth tax rate simplified tax code oxymoron direct tax code going create mess clean lack clarity consistency gst rules nightmare watch video datar shares interesting examples killing golden goose mindset exists request anyone know get ai create summary notes videos anecdote shares european car marker gets revenue india litigations india tax officer clubbed interest income bank ask gst clubbed expenses asked gst another asked export oriented manufacturing fdi share millions export manifest logistically impossible imagine many papers would printed decided exports interstate sales hence gst needs paid central government claims subsidies given states attract industries income demand income tax karnataka gives rs subsidy forgoing stamp duty collection company owes rs income tax ",
    "cleaned_title": "commentary ails indias direct indirect tax administration export",
    "cleaned_selftext": "currently objective revenue maximisation growth maximisation though taxation product economical growth lack tax certainty important investorsgrowth tax rate simplified tax code oxymoron direct tax code going create mess clean lack clarity consistency gst rules nightmare watch video datar shares interesting examples killing golden goose mindset exists request anyone know get ai create summary notes videos anecdote shares european car marker gets revenue india litigations india tax officer clubbed interest income bank ask gst clubbed expenses asked gst another asked export oriented manufacturing fdi share millions export manifest logistically impossible imagine many papers would printed decided exports interstate sales hence gst needs paid central government claims subsidies given states attract industries income demand income tax karnataka gives rs subsidy forgoing stamp duty collection company owes rs income tax",
    "cleaned_comments": "",
    "light_cleaned_title": "A commentary on what ails India’s direct and indirect tax administration from an export",
    "light_cleaned_selftext": "1. Currently objective is revenue maximisation not growth maximisation. Though taxation is a by product of economical growth. 2. Lack of tax certainty is more important for investors/growth than the tax rate. 3. Simplified tax code is an oxymoron. The direct tax code is going to create more mess than clean it up. 4. Lack of clarity and consistency in GST rules is a nightmare. And more. Watch the video and Datar shares interesting examples of killing the golden goose mindset that exists. Request: Does anyone know how to get AI to create summary notes of videos? Anecdote he shares: - A European car marker gets 2 % revenue from India and has 98% of litigations from India. - A tax officer clubbed the interest income of bank and ask for GST on it. Then they clubbed all expenses and asked GST on it. - Another asked an export oriented manufacturing FDI to share millions of export manifest which is logistically impossible (imagine how many papers would be printed). So they decided all exports are interstate sales and hence GST needs to be paid. - Central government claims subsidies given by states to attract industries as income and demand income tax on it. So if Karnataka gives you 100 rs subsidy by forgoing stamp duty collection, company owes 25 rs as income tax.",
    "light_cleaned_comments": ""
}