{
    "id": "157e254",
    "title": "Please speak out about Manipur",
    "url": "https://www.reddit.com/r/india/comments/157e254/please_speak_out_about_manipur/",
    "selftext": "Guys speak about it to your parents, your neighbors, your family, discuss this in WhatsApp groups. The minority really needs protection from the majority community. \n\nComment on social media platforms. Remind the people of BJP wrong doings. Comment on podcasts used to whitewash the BJP Modi regime. Share posts, share stories, please please raise your voice to protect the minorities of this country, the women of this country. \n\nThe cops handed the women to the men, no one was arrested for 2 months. Kulki women protested infront of HMs residence. They met him. They all knew about this. They turned a deaf ear and went to the US and France etc. PLEASE SPEAK UP",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690116615.0,
    "convurl": "https://external-preview.redd.it/9KV9kUzvTaeqG16qEM1PfMMq8ZhTbabo_qyguRAS-4k.jpg?auto=webp&v=enabled&s=b108160686ef201c0adb00e5c57a17b047256114",
    "comments": [
        "https://www.genocidewatch.com/single-post/genocide-watch-expert-warns-of-genocide-of-muslims-in-india\n\nSome Indians were laughing at this guy and calling him India hater but seems like he’s not wrong at all",
        "Its too late. The IT cell has already started with their rubbish. My brainwashed dad believes everything was done by Muslims. \n\nIf there is any justice or karma in the world the BJP, its members, supported and it's machinery should suffer horribly for what they put our country through.",
        "What are the next states ripe for such events?",
        "They have even taken over r/manipur..it is now moderated by a radical Hindutva propagandist from Odisha who wouldn't let anyone post a different opinion.",
        "ANI out in a fake story about some rohingya Muslim being behind the riots  just long enough for  Sanghi bigots to spread it around and then apologised and took it down. They have it all worked out like a well oiled machine so hatred goes on full swing no matter what.",
        "The CM of Assam, other ‘influencers’ have started to defend and divert the topic. \n\nTomorrow is a crucial day. The PM has to be put under pressure in parliament. They have to create unrest if the PM is seen to escape questions. This is a critical moment in Indian democracy",
        "As goswami said, since it has come down to government and the opposition trying to score political brownie points then i think no real justice would prevail. It'll be just a contest of who'll gain political leverage.",
        "It feels like they keep pushing the boundary for what is acceptable. Slowly and steadily they are normalising acts of genocide. Comparing Manipur to Rajasthan is simply wrong. If you watch Karan thapars interview with the meitei chief from a month ago it’s obvious that an attempt was made to instigate this violence and in his words ‘annihilate our rivals’ was tweeter 5 days before the unrest began.",
        "Yeah, WhatsApp groups of boomers are already active with content from the infamous WhatsApp university. These people won’t change. The more impactful thing other state governments can do is supporting the displaced people by providing them shelter, food and opportunities to rebuild their livelihoods. As commoners, the best support we can provide is to treat such people with kindness. That is if they want to restart their lives elsewhere. If they want to go back, I hope the next government can provide better support.",
        "But what’s wrong with gaining meaning political leverage from this? Like the HM could’ve stopped this from happening. He became the Home Minister via electoral politics if we are to avoid this from happening then we need to use electoral politics to put a better more humane HM in place with a better PM. \n\nElectoral politics if the most effective form to bring about change in a democracy.",
        "Its your low knowledge on this subject that you claim minority suppression by majority in Manipur. \n\nBlame BJP and government all you want, but the fact is that no one is responsible for this alone, both Meities and Kukis are doing violence in the state. Cuz it was Meiti suppressing Kuki, it came out but there's tons of things still going there. Kukis are not the suppressed one here.\n\nAgain, not defending the govt or BJP, but have common sense without writing.",
        ">Remind the people of BJP wrong doings.\n\nIt's core audience voted him for that specific reason lol.",
        "Speaking will not achieve anything. Voting will, and people on reddit don't vote and are just keyboard warriors",
        "Already happened in West Bengal",
        "Why are Kukis so uncomfortable with Meitis getting ST status?",
        "Why are Kukis so uncomfortable with Meitis getting ST status?",
        "west bengal is not case of genocide. it is case of post poll violence which started in bengal under jyoti basu rule. CPIM used to use tactics of violence and now TMC is doing same. If bjp comes, then all tmc goons will join bjp . This is how politics work.",
        "HM tried to bring the communities to table. Only way forward is Modi declaring President rule in Manipur.",
        "From my readings and research it seems obvious that the influential Hindu meitei community in the state brought about a law via the HC to open tribal(Kuki catholic mostly) land up to purchase for the   Meitei. The poor tribals who live in the hill regions fear that this law has the power to wipe them out of their lands. \n\nIn their attempts to oppose this law the student association marched a protest while leaders of meitei community were instigating violence to end Kuki community. \n\nA fake rumour was spread that Kuki women were raping meitei women (a trick used by the bjp it cell) which was proven fake. Police which again has a strong meitei influence HANDED OVER WOMEN TO MEITEI MEN. the CM is meitei, they did not arrest meitei men who committed these crimes. \n\nThis is obvious oppression. What else is called oppression?",
        "I was talking about the incident that took place near the howrah district",
        "Why take the hard route working on the governance when you can easily  pump up hatred and gain votes off it.",
        "My comment was for the violence perpetrated in the state only. No one is sane or oppressed there.\n\nAs for the tribal status issue, it's a verdict given by the high court, not passed by some legislation. You can challenge it in supreme court all you want. But instigating violence just because of it is pure evil on the part of Kukis.",
        "Sadly there is nothing as such karma ,",
        "Speaking relevant facts and establishing relevant facts via conversations can influence voters. That is the point of speaking and informing others about what is going on. \n\nI studied in Scotland for a year and a half and worked prt time at a non Indian restaurant for the same time. Surrounded by non Indians mostly European colleagues it was refreshing to see how they would at the end of every shift have political discussions and try to update each other about what’s going on in both local politics and global affairs. We don’t seem to have such an approach towards political discourse.",
        "And our law and order knows nothing like justice",
        "I come from a family which has sangh backgrounds.  My mom doesn't know anything much about politics.  She respects modi a lot and view him as a god. When I explained about manipur incidents and government's role in it, she was very angry about modi. For the first time I saw this in my life. \n\nI actually view this as an achievement. People need to be gotten out of the bubble of sangh propoganda",
        "But it doesn’t look like they instigated the violence. If you refer to Karan thapars interview with the meitei chief he instigated violence with tweets asking for annihilation of the Kuki community. He said it on camera. \n\nThen in a lawless state wherein no arrests are made, police stations are looted of weapons there will be retaliation when women are being raped and paraded naked. I’m not saying the retaliation is right but it is human nature. Need strong leaders to stop it.",
        "What incident?",
        ">since it has come down to government and the opposition trying to score political brownie points\n\nStop with this false equivalence. The government has failed to do is job for 3 months while the state was burning. When opposition tried visiting, the government wasted resources to block the visit instead of protecting people. \n\nThe opposition is doing its job to raise the issue as the government continues to be complicit in violence.",
        "There is no justification for retaliation, violence is violence.\n\nAgree on political and administrative point.\n\n>....karan Thapars interview\n\nThe thing with tribals is that they don't give a fuck about media or press or their image. These type of comments just depict how they want to look the dominant one here. But the truth is, Meitei chief doesn't control every Meitei, almost some units. His statement in the media is useless, when we are seeing clear instigating by the Kuki and Naga side as  well. Again, no one is sane here and instead of protesting or rioting they could've gone to SC.",
        "Fear come election time people will forget this and vote for people who they see themselves in. The majority will vote for the BJP because they represent their community. The BJP then act as representatives of Hindus and unleash such violence against minorities. \n\nThe Hinduism is grew around is completely different to what I see today’s",
        "Guys, do watch Ravish Kumar's latest video (link below). He also says the same thing - urging people to speak up. \n\nIt is very important that we spread awareness about the amount of hatred today's politics is spreading. In all my life, I have never felt that people just hate a whole community because of their religion etc. Nowadays I see even people whom I respect have fallen to the Hate Factory & Propaganda.\n\nLink - https://youtu.be/cW8MggWnbps",
        "I honestly think that a huge chunk votes for them because they are unaware of the BJPs economic failures, social policy failures are not discussed in mainstream media. \n\nMainstream media has transformed general elections into presidential popularity contests and pitted Modi on one side and well you know of the other side and their electoral failures.",
        "Nagaland, Frontier Nagaland.",
        "The problem is even after I talk about it with them they seem to not understand how serious it is\nGov is completely successful on hiding it from people and shift there focus",
        "I totally agree with you. But I still consider this as an improvement. Atleast she didn't view modi as a god this time.",
        "There is no karma, the universe is indifferent",
        "[https://timesofindia.indiatimes.com/city/kolkata/2-women-candidates-stripped-during-west-bengal-panchayat-polls-bjp/articleshow/102024770.cms](https://timesofindia.indiatimes.com/city/kolkata/2-women-candidates-stripped-during-west-bengal-panchayat-polls-bjp/articleshow/102024770.cms)",
        "Unfortunately the congress is filled with privileged individuals who live in their comfy homes and bungalows. They do no understand the severity of our republic. \n\nIn comparison and credit where it’s due the BJP would absolutely put a lot of effort when they were in opposition. Congress is a dead party.",
        "they will.",
        "you are a hero brother, lets wake up one sangh at a time",
        "Because Meiteis getting ST would allow the encroachment of their land by a majority that is far more developed in every aspect. Keep in mind that the hills are not all habitable and.\n\nThis is a majority vs minority because the majority has the support of the government that was voted in BY the majority. The action of Police is not only suspicious already but straight up unlawful. The DGP of the State's Police was a Kuki but he was sacked on the day of the Protest, I wonder why.",
        "This happened at home.\n\nIncident 1) My mother asked why aditya thackrey has to speak about something that happened in Manipur.\nI asked her what smriti irani had to do about something that happened in delhi back in 2012 when she stayed in mumbai.\n\nIncident 2) she literally questioned herself, manipur india mein hai kya?\n\nI am glad she doesn’t have a daughter.",
        ">huge chunk\nThat huge chunk votes because of his past, nothing else.\n \nLike what is the percentage of people in India who understand the most basic of policies leave alone who are privileged enough not to care.\n\nJust watch a public rally speech and you will get to know what people vote for.\nAnd the current elected people are doing fantastic on what they were voted for.",
        "Meitei already have OBC status & EWS reservation. Why do they even want ST status? Remember that SC had to correct the wrong judgement of HC & Revert the decision that classified the Meitei as ST.",
        "How much misinformed are you. People like you are bringing religious angle to this. Kukis are not victims here calm down.",
        "people will forget now and vote, but their grandkids and the generations to come will never forgive them.\n\nAlso I swear after 20 - 30 years or so, when Gobi will be remembered as the incompetent leader that he is, the same people who currently support and defend  Gobi will be ones to say how they always knew what a POS he was and how they never understood how anybody could vote for him, meaning they will switch parties the same way MLA's and ministers do when offered project Kamal.",
        "Majority of population are confirmation biased so it's not even worth reasoning with them. It will either get deflected or turned into propaganda. The irony is only the mega corporates are the ones benefitting from their ruling while the common man does not reap any reward.\n\nBut one thing BJP are proficient at is taking advantage of destructive and constructive effects of religious prejudice.\n\nPeople need to understand that BJP are governing the State of Manipur thus they are responsible for it.",
        "https://twitter.com/zoo_bear/status/1682435788980768768?t=N3frLM34et1c9RVYuZ3wZA&s=19",
        "First, you didn't answer my question. Second, Meitis claim themselves to be the indigenous tribe of Manipur, and demand ST status so as to protect their land, and culture.\nNow, why do Kukis have problem with Meitis wanting to protect their culture? Meitis never demanded for exclusion of Kukis from their land while Kukis have formed their own authority in Churachandpur after kicking out all Meitis, and renamed it as Lamka.",
        "> The cops handed the women \n\nIs this bit verified?",
        "So you mean to say that 80% of the land, doesn't matter if it's habitable or not belong to Kukis? And that Meitis should stick the 20% land in valleys no matter how crowded it gets? Do Kukis have more of a claim on the land of Manipur then Meitis? Given Meitis are the original tribe of Manipur.",
        "I have no information on this.",
        "Why do Meiteis want ST Status even when being classified as OBC? And good for the Kukis to fight back to protect their rights and land 👍",
        "This is true of some of my friends. I d say 30%, which is a huge number",
        "Okh then. Last man standing wins.",
        "I hope the men who did this get harsh punisht. But long term I hope for fair laws. No reservations. No you can buy land here, but not there. If it's fair, plus give some help to people to study, make farms in hills (can do it, with a little machinery to dog, process like home compost ....) So point is help people but don't make unfair long term laws. \n\nThen root cause resentment will come down. People who lose privileges won't like but long run let us be a progressive equal rights and oppsitunities. No excuses",
        "No it is not entirely your moms fault. Unfortunately we as humans are the products of our environment. Your mom like millions in our country have been made subject to lie after lie and propaganda after propaganda. When you tell a lie enough times it’s takes the form of the truth. \n\nThroughout the 9 years the image of the PM has been created in such a way that he cannot be criticised. That what happens in India shouldn’t be criticised. It’s ‘anti India’ to discuss the bad things. Instead, focus on the good. 9 years ago your mom would’ve have a completely different approach to criticism of state and state leaders. That rational thought process has been systematically wiped out of us.",
        "I am appalled by this hypocrisy\n\nDo you believe only one community suffered at the hands of another? \n\nDo you believe women from the majority community are living life like queens?\n\nNo you idiots, every innocent in Manipur is in danger and it's not a matter of communities at this point, stop this hypocrisy to further your own goal and sympathies equally or don't do it at all.",
        "finally found a sane comment.",
        "> My brainwashed dad believes everything was done by Muslims.\n\nTurn it around on them, ask them that how come their super hero Modiji could not prevent this. how will he save other Hindus then.",
        "Don't you know? \"Majority\" community can't be victims. \n\n\nSad you're getting downvoted for telling the truth",
        "This just shows your ignorance and lack of knowledge. Of the 80%, 30-40% or even smaller is inhabited by Kukis whilst Nagas are the dominant hill tribe. (https://sarayutrust.org/2023/07/07/the-false-lines-of-manipur/amp/)\n\nNot to mention, there are numerous forest reserves where the hill tribes cannot settle in. \n\nMeiteis never truly moved beyond the foothills. That is why the Maharaja of Manipur didn't object when Kukis started moving into the uninhabited hills adjacent to the valley.\n\nLet me ask you this - Can you say it is your land if you didn't live in it nor own it?",
        "People here raising voices will leave their brain at home while voting, if you voted for these monsters you are all partially responsible.",
        "Well if you google, population density of Manipur is just 123 per sq. km compared to 29000 per sq. km of Delhi. It is not a scarcity. Once needs are fulfilled greeds take over and it transforms into terrible form when it is infused with power. Meities are involved in majority of all socio economic and political activites happening in the state. With Meities getting ST SC quota, Kukis will struggle to get Government jobs or other white collar jobs in their own state. Remember Meities control the valley, lifeline of the state, the commercial hub. Equality is good if everyone has got equal opportunity but when one party is underprivileged we need equity.\n\nBesides if you look at history, Meities were given the option to opt for SC/ST quota but they declined. But now since it can amplify their advantage they are pushing for it since they have the means as well.\n\nWell Meities will thrive for their own benefit which is not wrong but Government should have not entertain such an agenda in first place. This whole proposals pushed by some partial individuals with high authorities are the reason for such a failure.",
        "That is what the woman that survived the gangrape stated in an interview.",
        "Ig ik who you're talking about. He's mentioned in a comment that his sagei / salai is mangang, so I believe he's meetei",
        "no. he's lying.he only came up with that after me and several others exposed him. he cannot even write a coherent line in meiteilon without using translation app. he didn't know about the salai taret ki firal.all his posts are based off whatever he could find on google. both him and u/FrankfurtSupremacy guy are fake meiteis.he has deleted the posts and comments where i exposed him and permanently banned me and the others.",
        "I think a meitei dominated police force not arresting meitei men for sexually abusing and parading Kuki women naked for more than 2 months is overwhelming evidence to suggest that the meitei community is dominating and attempting to wipe out Kuki community. \n\nI do agree with you every innocent in Manipur is in danger right now. Evidently the Kuki women does not have the support of local police to protect them. It’s tragic.",
        "Dude even I used to hate when someone points a finger towards our nation, but looks like we are, in fact, doing things wrong and it's not all propaganda. We getting mass brainwashed to vote for this sh*t of a party was the propaganda many of us fell to.",
        "This was their attempt to cry wolf",
        "The second incident boils my blood. Then they get offended when people here don't even want to call themselves Indians. 🙃",
        "Why?",
        "Why don’t we collectively raid r/place and write save manipur to get international attention? That is the only way the government will learn, when foreign media will malign them.",
        "Great job you guys! \n\nTo lie on an anonymous platform requires special cowardice and this indicates how hard they are trying to push their agenda.",
        "yeah but we got banned and he became the mod...such is life.",
        "Wish opposition had a strong country level face. The biggest concern is that the incidents occuring doesn't affect majority of people \"directly\" so they will try to keep the status quo as long as possible instead of taking risk voting a new leader.",
        "Huge population really messes things up. My brother has been victim of the hyper competitiveness so much that he only earns around 50k while destroying his mind and body daily. He would rather see the world burn and enjoy rather than push himself further fighting for the \"justice\" he doesn't even know will have an outcome or not, and majority of indians are like my brother",
        "As per 2011 census, only 17% of Manipur population comes under OBC and that is shared with other minorities like Muslims. Most meiteis are general caste especially those living in valley. The ST status is not so much of Meiteis buying land in hills but rather having to protect the 9% of valley that they are confined to. Remember anyone from India can buy and live in the valley. Kukis, Nagas, other non manipuris all live and buy land in it so the land that meitei could call their homeland will decrease in a decade or two and they will become minorities in their own land. Look at from this perspective too.",
        "Yes, please do speak up but do remain neutral. Both sides have suffered to a great extent. I have seen so many independent thinkers tweeting and sharing news about only one side based on their political stance. This isnt about Bjp vs Congress neither it is about Christians vs Hindus. This is an outbreak of a long brewing tension between two communities. Please, I beg of you, remain neutral.",
        "I am neutral and request everyone to remain neutral. However THIS IS DEFINETLY ABOUT THE FAIULER OF THE BJP IN BOTH STATE AND CENTRE. This has shades of 2002 Gujrat all over it. It’s a disgrace these guys are legally allowed to govern. They’re criminals",
        "The most divisive thread I have seen in my 3 years in reddit. We all know Manipur is suffering but spreading this kind of divisive ideas will not benefit anyone. \n\nRather than doing Majority vs minority, Sanghi vs Liberals, Old generation vs new generation, Modi vs anti-modi, Bjp vs anti-bjp in the comments I request you to discuss the solution.",
        "True that the government has failed. But don’t believe that the people on both sides are fighting based on their political stance, they are fighting for their lives. A lot of outsiders come in and try to push their political agenda and earn brownie points but the common people don’t care about all those. They just want normalcy. Bring everyone who committed violence to be tried and prosecuted and let the judicial apparatus handle the rulings of the ST status. What we need is for you guys to speak up about the Government’s silence on this matter for so long. They need to push for talks, visit Manipur and discuss every possible angle to bring an amicable solution.",
        "Normalcy comes with a change in govt with competent minds in solving issues. That is what we need to talk about. Governance is everything and the BJP is failing at governance and providing normalcy. So yeah what you talk about is only possible with good people in charge. Which clearly isn’t the bjp. So let’s start by saying fuck off the the BJP? For everyone’s good?",
        "The Imphal valley comprises of only about 10% of the total land area. While it houses more then 65% of the total population, including most of the 53% Meitis(and decreasing), as well as Kukis and Nagas. So where is the equity for Meitis? Were Kukis stopped from Imphal valley? Then what supposed advantage are you talking about.",
        "Better governance is the solution? Competent people in power who will want the best interest of everyone? And Not just selective justice which is what the bjp seems to be doing at both state and centre. So yeah solutions are plenty when people capable of providing them are in power. Not when brain dead uneducated PMs visit the world while the state is burning.",
        "Definitely yes, I myself voted for CPI because the person who ran under that was a genuinely good person and an intellect. I am against a lot of BJPs idealogies but now it's not the time for that. We need centre to step up even if it's too late but we can't wait for the next term when Congress is in power to do that. Everyone will remember and they should remember of the ruling party's failure and we should show them during the elections but definitely not now while the state is burning.",
        "Stop this minority majority nonsense. What's happening is terrible and should be beyond politics. This is a disgrace and should not even be something about clubs. Also the so called minority were the ones to start this stupidity. They are well armed and have done equally if not worse things to the matei. Again this is just so you know and this matter should be on humanity and not on politics. Both MUST stop this barbaric behaviour which makes humans look worse than wild animals",
        "My fear is everyone won’t remember hence the need to keep the convnersation alive. We forgot kathua.",
        "Unfortunately that generation never paid attention to what was taught in textbooks. I’m a millennial and we were constantly taught about population control in textbooks but culturally the previous generation never cared about population control etc. they just wanted us to get good marks in math, science and become engineers.",
        "So even by your figures:-\nMeitis=10-12% land mostly Imphal Valley\nKukis=30-40% land of hills\nWhere is the Equity?\nNot being ST was their choice. Now being ST is also their choice. Why do Kukis have an issue with it when Nagas don't. And since most of that land is already occupied or reserved, then what are Kukis so insecure about.",
        "The conversation needs to be alive but the political crux needs to be secondary, the sufferings of the people need to be the primary topic.",
        "Strong evidence to suggest the meitei community leader threatened to wipe out Kuki community 5 days before the unrest began so yeah I doubt the Kuki started it. And when a community uses rape as a weapon against women of another community and the police takes no action to stop it (for two months) the oppressed community will take matters into their hands to defend/retaliate. It’s a complete failure of governance. It’s got to stop.",
        "That's the average population density. Meitis live in crowded Imphal valley with population density of 992 inhabitants/Sq Km while the population density of hills is 44 person per Sq Km.\nThe greed you're talking about certainly doesn't apply on Meitis.",
        "One of my colleagues was acting shocked on reading about how long it has been since Internet blackout in Manipur. He is a Modi worshipper, turns out he didn't even know that there is a BJP govt in Manipur. He couldn't believe it, said that what's going on is not possible with a BJP government. For his satisfaction I looked it up in front of him and showed him the proof. I hope he questions more things going forward. This is a classic example of how media has failed our country.",
        "Again, your lack of knowledge is showing again.\n\nThe Nagas were part of the Protest back in May.",
        "Nagas aren't fighting.",
        "Not asking in a sarcastic or rhetorical tone or anything, and am not defending anyone, just for my own reference and knowledge, why are people saying BJP is to blame? Genuinely asking, what hand did they have in this? and what could they have done to prevent this.",
        "Yeah, I truly wonder why they're fighting the hill tribe with the lesser population whose insurgents are under-funded since the 90s and in SoO agreement. But the other tribe that has a much higher population and one of the biggest and well armed insurgent group (NSCN) which isn't under the SoO aren't being bothered.\n\nWe'll never know ig",
        "Ravish Kumar wrote a very moving piece on the need to speak up. Must read.",
        "which state?",
        "Do you understand the role governance plays in the welfare of people? Do you realise the powers state and central ministers have to control riots and stop them? Do you realise failure in using those powers is an act of negligence and can be used to even punish said ministers in democracies? \n\nDo you the know the political party governing Manipur? Do you know that the police failed to catch those culprits whose faces could be seen in the video for TWO WHOLE MONTHS? Do you then realise that it probably meant that these rioters and abuser’s were probably guaranteed impunity by govt officials? The same BJP govt officials. Do you know that the Kuki community women protested infront of Amit shahs residence? Which probably means he was aware of the atrocities? Which probably meant the PM knew despite which he went to the US and France",
        "A political issue requires a political solution. Stop distracting with platitudes of 'humanities' those who chose to parade women and rape them and kill their men abandoned humanity two months back.\n\nAnd by political solution - I mean real implementation of change in government, hearing out demands and coming to a solution that works based on the material conditions of Manipur. BJP has shown it is unfit to do that. The politics of the tribes requires a council of representatives of all tribes that have stake. BJP and their majoritrian, dominating politics cannot and will not implement that. The way the CM of Manipur has been speaking shows his incompetence, arrogance and impunity. It is appalling that he has not been sacked. There is failure on the state's part.",
        "The solution is for the CM to step down first of all. Second is to have a council of tribes as a governance model instead of a single political party dominating. The politics of north -east is incompatible with mainland way of doing things.",
        "Kuki women were sexually assaulted and paraded naked by meitei men who were not arrested by a police force majorly comprising of the meitei tribe and you’re saying kukis are not the victims? On what basis?",
        "Subscribe to, like and view the sh#t out of as much liberal, progressive, atheist and independent and credible journalists' youtube videos, preferably from your parents' accounts, or if not, from your own account. Perhaps, even share the videos.                 \nCan't really see any other way their wretched machinery can be countered.",
        "Yeah my mom also said that she hated modi now. She was modi leaning before.",
        "May be you can open a new alternate sub for the meanwhile and ban those people! \n\nIt'll be a lot of work but it will be great if every bit of information, the good and the bad, regarding MN is in one place. It will make things clearer and may be somebody can figure out things hidden in plain sight. \n\nI know it's a long shot but since government isn't doing anything but waiting for more blood to shed, we can give it a try.",
        ">May be you can open a new alternate sub and ban those people! \n\nwe have, it's called r/Manipur_ but the other one has more members since it is the original sub and not many people know what happened.",
        "my brainwashed dad literally starts fighting me with abusive words to defend his oh so valuable PM to the point he starts abusing with words",
        "my brainwashed dad literally starts fighting me with abusive words to defend his oh so valuable PM to the point he starts abusing with words",
        "source?",
        "Thank you for raising awareness.",
        "Dumbass thinks that this whole issue started at this point. No, it started far before that. You are only considering this as the start of the issue. To burst your bubble it is not. This is one of the many atrocities happening from many days. You know who started all this fights. Kukis. Seems like you are not grasping that. It is rather unfortunate of what happened to her. But you are twisting the whole narrative saying the kukis are innocent. Because you have an agenda. Bigots should learn some shit before posting.",
        ">“The Manipur incident is highly unfortunate, we condemn it.But what has happened in West Bengal is equally shameful. \n\nThis is dictionary definition of whataboutery.\n\nIf these incidents happened, they're shameful indeed. However, they're not equally shameful as bjp allowing a state to burn for 3 months, during which, by its own cm's admission,  100s of firs for rape, murder, arson etc. have been filed, and the government has chosen to act in exactly none of them till videos go viral.\n\nKnowing bjp, they've added extra masala to make post poll violence to look like sexual violence in order to draw the false equivalence.",
        "No, you certainly don't. Because if you acknowledged that this is made up bullshit by bjp to distract from the horrific violence bjp has allowed to continue unabated in Manipur for 3 months, you'd have to acknowledge your heinous mentality that got you to indulge in such whataboutery. \n\nCompare the response of the dgp in this tweet with that of the Manipur chief minister, and tell us whether you think you are capable of noticing the difference between  the thorough investigations in Bengal and the litany of excuses and indignant handwaving in Manipur.",
        "Hey we look alike",
        "You are making it out as if meitei are all aggressors and kuki are all innocent. People from both tribes have suffered and died but you want to play the minority card here. You can totally blame BJP but saying “minority needs protection from majority” is stretching it too far.\nI wonder what your response was when you saw kanhaiya getting beheaded in Jaipur by couple of muslim fanatics? Did you think majority was in danger then and needed protection from muslims?",
        "TF do you think Police can do there tho? Barge into a group of armed militants and snatch that woman away like Chulbul Pandey. This is real life and situation is way too nuanced, Just read the accounts of army-men working to restore peace and sort of problems they are facing.",
        "Problem is everyone in this country has turned into all talk and no action ... The Modi led government is waiting for things to cooldown or something bigger to happen for people to divert their attention from this topic.\n\nThings are so low, they won't even allow manipur to be discussed in parliament",
        "What an idiot you are who still wants to do both sideism and God knows for what. Just say you want to support rapists. Ground reports from print have not shown any metei women cases. If these meiteis want to say that the ground reporting is not neutral then they are giving the typical BJP smokescreen that media is anti Hindu. I haven't even seen these meiteis demanding president rule. If they were genuinely under such threat and fear they would have asked that. To top it all , meitei group of women vigilantes called meira paibi are blocking supplies to kuki areas, handing over kuki women to male mobs, forcing army to release terrorists. Why should this community get any support now tell me.",
        "People please speak about manipur and also read about it more. Karan Thapar has interviewed people from both sides and trust me meiteis are not coming off looking good. Print has done ground reporting and even written plenty of articles which can tell you how rotten meiteis are. Please hit where it matters, support for kukis and calling out meitis. Otherwise you are not really caring for manipur and only happy that you got something to pin Modi on. As for modi , he should lose in 2024.",
        "They are an under developed minority tribe who the current cm seems to show hatred for by always calling them encroachers, illegal immigrants etc. Without gaining their trust how can you go about giving st status to the most affluent valley people. Why should they not have the right to atleast have a peaceful protest. ST will also mean that meiteis will eat up their jobs. If the issue is about going to hills then meiteis and the cm should have shown more love and understanding",
        "You are the dumbass who is supporting rapists and bigots. You want to still trust this meitei community after they spread fake news about their women raped. Are you even watching or reading anything or just lapping up like a dog whatever meitei shit is posted on twitter. Meiteis don't want president rule and even tore resignation letter of N Biren. They are forcing army to release their terrorists by using their women to do tamasha. Their women are also handing out kuki women to male mobs. Is this any signs of a community that is just defending or suffering. Idiot.",
        "There’s a quote from one piece by a villain: “whoever wins the war (basically has the power) becomes justice”.",
        "There’s already a mosque they’ve targeted. Gyanvapsi will take the headlines",
        "Isn’t their job to put their lives on the line to protect us? Ok they were cowards when it happened but why were there no arrests for two months? Absolutely unacceptable. Shows that the culprits acted with impunity. They were told no arrests will be made",
        "The hills are not all habitable.",
        "When kanhaiya was beheaded the culprits were caught within a day or two with terrorism charges. Culprits here were NOT CAUGHT FOR TWO MONTHS. Despite overwhelming evidence. do you see the difference? The police force is mostly made of majority meitei community. Very obvious what is going on.",
        "I’m sorry about this. Wish things were better for everyone",
        "No it's not their jobs to put their lives on line, Literally no one owes you or anyone else their lives. They failed the day riots began and now they stand aside then wait till normalcy.\n\nHow are they supposed to make arrest where there is armed resistance? You expect army to fight Meities, Antagonize the government (the govt has already messed up enough) thus runing any chance of a peace talk and a compromise EVER!!\n\nThankgod diplomats don't take recommendation from Reddit.",
        "Wow a complete lack of knowledge of the roles and responsibilities of state authorities like police forces, armies and govt ministries like home. \n\nThe role of the police is absolutely to put their lives on the line to protect us. That’s what they did when terrorists attacked us in mumbai 26/11. Where was the armed resistance after the video surfaced? They were arrested within hours. It’s obvious what is going on here.",
        "It's still battle between tribes and not terrorist groups unless the government listens to complete and utter idiots like you and turn them into one. \n\nI've 100% their official job profile and it definitely doesn't say that they have to put civilian lives before theirs.",
        "Social Media BJP IT cells And Our Godi Media already started playing game to save the image of Biswaguru Or 56 inch..\nManipur Cm will protest against to tarnished the image..\nBip already crying look at other state..\nOld unlces defending Biswaguru.by saying its Not PM work. He is world leader.\n\ngovt don't care as hardly 2 MP seats is there.",
        "Not even an appeal by the ruling parties to maintain peace. What did I missed?",
        "No keep talking about it. Don’t let them forget",
        "https://www.hindustantimes.com/videos/manipur-may-4-horror-victim-narrates-terrifying-ordeal-says-police-left-us-with-mob-details-101689926859489.html\n\nTop link on a quick Google",
        "Makes sense. Was not previously aware, thanks for informing me.",
        "Propaganda machine working overtime"
    ],
    "cleaned_text": "please speak manipur guys speak parents neighbors family discuss whatsapp groups minority really needs protection majority community comment social media platforms remind people bjp wrong doings comment podcasts used whitewash bjp modi regime share posts share stories please please raise voice protect minorities country women country cops handed women men one arrested months kulki women protested infront hms residence met knew turned deaf ear went us france etc please speak ",
    "cleaned_title": "please speak manipur",
    "cleaned_selftext": "guys speak parents neighbors family discuss whatsapp groups minority really needs protection majority community comment social media platforms remind people bjp wrong doings comment podcasts used whitewash bjp modi regime share posts share stories please please raise voice protect minorities country women country cops handed women men one arrested months kulki women protested infront hms residence met knew turned deaf ear went us france etc please speak",
    "cleaned_comments": "indians laughing guy calling india hater seems like hes wrong late cell already started rubbish brainwashed dad believes everything done muslims justice karma world bjp members supported machinery suffer horribly put country next states ripe events even taken rmanipurit moderated radical hindutva propagandist odisha wouldnt let anyone post different opinion ani fake story rohingya muslim behind riots long enough sanghi bigots spread around apologised took worked like well oiled machine hatred goes full swing matter cm assam influencers started defend divert topic tomorrow crucial day pm put pressure parliament create unrest pm seen escape questions critical moment indian democracy goswami said since come government opposition trying score political brownie points think real justice would prevail itll contest wholl gain political leverage feels like keep pushing boundary acceptable slowly steadily normalising acts genocide comparing manipur rajasthan simply wrong watch karan thapars interview meitei chief month ago obvious attempt made instigate violence words annihilate rivals tweeter days unrest began yeah whatsapp groups boomers already active content infamous whatsapp university people wont change impactful thing state governments supporting displaced people providing shelter food opportunities rebuild livelihoods commoners best support provide treat people kindness want restart lives elsewhere want go back hope next government provide better support whats wrong gaining meaning political leverage like hm couldve stopped happening became home minister via electoral politics avoid happening need use electoral politics put better humane hm place better pm electoral politics effective form bring change democracy low knowledge subject claim minority suppression majority manipur blame bjp government want fact one responsible alone meities kukis violence state cuz meiti suppressing kuki came theres tons things still going kukis suppressed one defending govt bjp common sense without writing remind people bjp wrong doings core audience voted specific reason lol speaking achieve anything voting people reddit dont vote keyboard warriors already happened west bengal kukis uncomfortable meitis getting st status kukis uncomfortable meitis getting st status west bengal case genocide case post poll violence started bengal jyoti basu rule cpim used use tactics violence tmc bjp comes tmc goons join bjp politics work hm tried bring communities table way forward modi declaring president rule manipur readings research seems obvious influential hindu meitei community state brought law via hc open tribalkuki catholic mostly land purchase meitei poor tribals live hill regions fear law power wipe lands attempts oppose law student association marched protest leaders meitei community instigating violence end kuki community fake rumour spread kuki women raping meitei women trick used bjp cell proven fake police strong meitei influence handed women meitei men cm meitei arrest meitei men committed crimes obvious oppression else called oppression talking incident took place near howrah district take hard route working governance easily pump hatred gain votes comment violence perpetrated state one sane oppressed tribal status issue verdict given high court passed legislation challenge supreme court want instigating violence pure evil part kukis sadly nothing karma speaking relevant facts establishing relevant facts via conversations influence voters point speaking informing others going studied scotland year half worked prt time non indian restaurant time surrounded non indians mostly european colleagues refreshing see would end every shift political discussions try update whats going local politics global affairs dont seem approach towards political discourse law order knows nothing like justice come family sangh backgrounds mom doesnt know anything much politics respects modi lot view god explained manipur incidents governments role angry modi first time saw life actually view achievement people need gotten bubble sangh propoganda doesnt look like instigated violence refer karan thapars interview meitei chief instigated violence tweets asking annihilation kuki community said camera lawless state wherein arrests made police stations looted weapons retaliation women raped paraded naked im saying retaliation right human nature need strong leaders stop incident since come government opposition trying score political brownie points stop false equivalence government failed job months state burning opposition tried visiting government wasted resources block visit instead protecting people opposition job raise issue government continues complicit violence justification retaliation violence violence agree political administrative point karan thapars interview thing tribals dont give fuck media press image type comments depict want look dominant one truth meitei chief doesnt control every meitei almost units statement media useless seeing clear instigating kuki naga side well one sane instead protesting rioting couldve gone sc fear come election time people forget vote people see majority vote bjp represent community bjp act representatives hindus unleash violence minorities hinduism grew around completely different see todays guys watch ravish kumars latest video link also says thing urging people speak important spread awareness amount hatred todays politics spreading life never felt people hate whole community religion etc nowadays see even people respect fallen hate factory propaganda link honestly think huge chunk votes unaware bjps economic failures social policy failures discussed mainstream media mainstream media transformed general elections presidential popularity contests pitted modi one side well know side electoral failures nagaland frontier nagaland problem even talk seem understand serious gov completely successful hiding people shift focus totally agree still consider improvement atleast didnt view modi god time karma universe indifferent httpstimesofindiaindiatimescomcitykolkatawomencandidatesstrippedduringwestbengalpanchayatpollsbjparticleshowcmshttpstimesofindiaindiatimescomcitykolkatawomencandidatesstrippedduringwestbengalpanchayatpollsbjparticleshowcms unfortunately congress filled privileged individuals live comfy homes bungalows understand severity republic comparison credit due bjp would absolutely put lot effort opposition congress dead party hero brother lets wake one sangh time meiteis getting st would allow encroachment land majority far developed every aspect keep mind hills habitable majority vs minority majority support government voted majority action police suspicious already straight unlawful dgp states police kuki sacked day protest wonder happened home incident mother asked aditya thackrey speak something happened manipur asked smriti irani something happened delhi back stayed mumbai incident literally questioned manipur india mein hai kya glad doesnt daughter huge chunk huge chunk votes past nothing else like percentage people india understand basic policies leave alone privileged enough care watch public rally speech get know people vote current elected people fantastic voted meitei already obc status ews reservation even want st status remember sc correct wrong judgement hc revert decision classified meitei st much misinformed people like bringing religious angle kukis victims calm people forget vote grandkids generations come never forgive also swear years gobi remembered incompetent leader people currently support defend gobi ones say always knew pos never understood anybody could vote meaning switch parties way mlas ministers offered project kamal majority population confirmation biased even worth reasoning either get deflected turned propaganda irony mega corporates ones benefitting ruling common man reap reward one thing bjp proficient taking advantage destructive constructive effects religious prejudice people need understand bjp governing state manipur thus responsible first didnt answer question second meitis claim indigenous tribe manipur demand st status protect land culture kukis problem meitis wanting protect culture meitis never demanded exclusion kukis land kukis formed authority churachandpur kicking meitis renamed lamka cops handed women bit verified mean say land doesnt matter habitable belong kukis meitis stick land valleys matter crowded gets kukis claim land manipur meitis given meitis original tribe manipur information meiteis want st status even classified obc good kukis fight back protect rights land true friends say huge number okh last man standing wins hope men get harsh punisht long term hope fair laws reservations buy land fair plus give help people study make farms hills little machinery dog process like home compost point help people dont make unfair long term laws root cause resentment come people lose privileges wont like long run let us progressive equal rights oppsitunities excuses entirely moms fault unfortunately humans products environment mom like millions country made subject lie lie propaganda propaganda tell lie enough times takes form truth throughout years image pm created way criticised happens india shouldnt criticised anti india discuss bad things instead focus good years ago mom wouldve completely different approach criticism state state leaders rational thought process systematically wiped us appalled hypocrisy believe one community suffered hands another believe women majority community living life like queens idiots every innocent manipur danger matter communities point stop hypocrisy goal sympathies equally dont finally found sane comment brainwashed dad believes everything done muslims turn around ask come super hero modiji could prevent save hindus dont know majority community cant victims sad youre getting downvoted telling truth shows ignorance lack knowledge even smaller inhabited kukis whilst nagas dominant hill tribe httpssarayutrustorgthefalselinesofmanipuramp mention numerous forest reserves hill tribes settle meiteis never truly moved beyond foothills maharaja manipur didnt object kukis started moving uninhabited hills adjacent valley let ask say land didnt live people raising voices leave brain home voting voted monsters partially responsible well google population density manipur per sq km compared per sq km delhi scarcity needs fulfilled greeds take transforms terrible form infused power meities involved majority socio economic political activites happening state meities getting st sc quota kukis struggle get government jobs white collar jobs state remember meities control valley lifeline state commercial hub equality good everyone got equal opportunity one party underprivileged need equity besides look history meities given option opt scst quota declined since amplify advantage pushing since means well well meities thrive benefit wrong government entertain agenda first place whole proposals pushed partial individuals high authorities reason failure woman survived gangrape stated interview ig ik youre talking hes mentioned comment sagei salai mangang believe hes meetei hes lyinghe came several others exposed even write coherent line meiteilon without using translation app didnt know salai taret ki firalall posts based whatever could find google ufrankfurtsupremacy guy fake meiteishe deleted posts comments exposed permanently banned others think meitei dominated police force arresting meitei men sexually abusing parading kuki women naked months overwhelming evidence suggest meitei community dominating attempting wipe kuki community agree every innocent manipur danger right evidently kuki women support local police protect tragic dude even used hate someone points finger towards nation looks like fact things wrong propaganda getting mass brainwashed vote sht party propaganda many us fell attempt cry wolf second incident boils blood get offended people dont even want call indians dont collectively raid rplace write save manipur get international attention way government learn foreign media malign great job guys lie anonymous platform requires special cowardice indicates hard trying push agenda yeah got banned became modsuch life wish opposition strong country level face biggest concern incidents occuring doesnt affect majority people directly try keep status quo long possible instead taking risk voting new leader huge population really messes things brother victim hyper competitiveness much earns around k destroying mind body daily would rather see world burn enjoy rather push fighting justice doesnt even know outcome majority indians like brother per census manipur population comes obc shared minorities like muslims meiteis general caste especially living valley st status much meiteis buying land hills rather protect valley confined remember anyone india buy live valley kukis nagas non manipuris live buy land land meitei could call homeland decrease decade two become minorities land look perspective yes please speak remain neutral sides suffered great extent seen many independent thinkers tweeting sharing news one side based political stance isnt bjp vs congress neither christians vs hindus outbreak long brewing tension two communities please beg remain neutral neutral request everyone remain neutral however definetly faiuler bjp state centre shades gujrat disgrace guys legally allowed govern theyre criminals divisive thread seen years reddit know manipur suffering spreading kind divisive ideas benefit anyone rather majority vs minority sanghi vs liberals old generation vs new generation modi vs antimodi bjp vs antibjp comments request discuss solution true government failed dont believe people sides fighting based political stance fighting lives lot outsiders come try push political agenda earn brownie points common people dont care want normalcy bring everyone committed violence tried prosecuted let judicial apparatus handle rulings st status need guys speak governments silence matter long need push talks visit manipur discuss every possible angle bring amicable solution normalcy comes change govt competent minds solving issues need talk governance everything bjp failing governance providing normalcy yeah talk possible good people charge clearly isnt bjp lets start saying fuck bjp everyones good imphal valley comprises total land area houses total population including meitisand decreasing well kukis nagas equity meitis kukis stopped imphal valley supposed advantage talking better governance solution competent people power want best interest everyone selective justice bjp seems state centre yeah solutions plenty people capable providing power brain dead uneducated pms visit world state burning definitely yes voted cpi person ran genuinely good person intellect lot bjps idealogies time need centre step even late cant wait next term congress power everyone remember remember ruling partys failure show elections definitely state burning stop minority majority nonsense whats happening terrible beyond politics disgrace even something clubs also called minority ones start stupidity well armed done equally worse things matei know matter humanity politics must stop barbaric behaviour makes humans look worse wild animals fear everyone wont remember hence need keep convnersation alive forgot kathua unfortunately generation never paid attention taught textbooks im millennial constantly taught population control textbooks culturally previous generation never cared population control etc wanted us get good marks math science become engineers even figures meitis land mostly imphal valley kukis land hills equity st choice st also choice kukis issue nagas dont since land already occupied reserved kukis insecure conversation needs alive political crux needs secondary sufferings people need primary topic strong evidence suggest meitei community leader threatened wipe kuki community days unrest began yeah doubt kuki started community uses rape weapon women another community police takes action stop two months oppressed community take matters hands defendretaliate complete failure governance got stop thats average population density meitis live crowded imphal valley population density inhabitantssq km population density hills person per sq km greed youre talking certainly doesnt apply meitis one colleagues acting shocked reading long since internet blackout manipur modi worshipper turns didnt even know bjp govt manipur couldnt believe said whats going possible bjp government satisfaction looked front showed proof hope questions things going forward classic example media failed country lack knowledge showing nagas part protest back may nagas arent fighting asking sarcastic rhetorical tone anything defending anyone reference knowledge people saying bjp blame genuinely asking hand could done prevent yeah truly wonder theyre fighting hill tribe lesser population whose insurgents underfunded since soo agreement tribe much higher population one biggest well armed insurgent group nscn isnt soo arent bothered well never know ig ravish kumar wrote moving piece need speak must read state understand role governance plays welfare people realise powers state central ministers control riots stop realise failure using powers act negligence used even punish said ministers democracies know political party governing manipur know police failed catch culprits whose faces could seen video two whole months realise probably meant rioters abusers probably guaranteed impunity govt officials bjp govt officials know kuki community women protested infront amit shahs residence probably means aware atrocities probably meant pm knew despite went us france political issue requires political solution stop distracting platitudes humanities chose parade women rape kill men abandoned humanity two months back political solution mean real implementation change government hearing demands coming solution works based material conditions manipur bjp shown unfit politics tribes requires council representatives tribes stake bjp majoritrian dominating politics implement way cm manipur speaking shows incompetence arrogance impunity appalling sacked failure states part solution cm step first second council tribes governance model instead single political party dominating politics north east incompatible mainland way things kuki women sexually assaulted paraded naked meitei men arrested police force majorly comprising meitei tribe youre saying kukis victims basis subscribe like view sht much liberal progressive atheist independent credible journalists youtube videos preferably parents accounts account perhaps even share videos cant really see way wretched machinery countered yeah mom also said hated modi modi leaning may open new alternate sub meanwhile ban people itll lot work great every bit information good bad regarding mn one place make things clearer may somebody figure things hidden plain sight know long shot since government isnt anything waiting blood shed give try may open new alternate sub ban people called rmanipur one members since original sub many people know happened brainwashed dad literally starts fighting abusive words defend oh valuable pm point starts abusing words brainwashed dad literally starts fighting abusive words defend oh valuable pm point starts abusing words source thank raising awareness dumbass thinks whole issue started point started far considering start issue burst bubble one many atrocities happening many days know started fights kukis seems like grasping rather unfortunate happened twisting whole narrative saying kukis innocent agenda bigots learn shit posting manipur incident highly unfortunate condemn itbut happened west bengal equally shameful dictionary definition whataboutery incidents happened theyre shameful indeed however theyre equally shameful bjp allowing state burn months cms admission firs rape murder arson etc filed government chosen act exactly none till videos go viral knowing bjp theyve added extra masala make post poll violence look like sexual violence order draw false equivalence certainly dont acknowledged made bullshit bjp distract horrific violence bjp allowed continue unabated manipur months youd acknowledge heinous mentality got indulge whataboutery compare response dgp tweet manipur chief minister tell us whether think capable noticing difference thorough investigations bengal litany excuses indignant handwaving manipur hey look alike making meitei aggressors kuki innocent people tribes suffered died want play minority card totally blame bjp saying minority needs protection majority stretching far wonder response saw kanhaiya getting beheaded jaipur couple muslim fanatics think majority danger needed protection muslims tf think police tho barge group armed militants snatch woman away like chulbul pandey real life situation way nuanced read accounts armymen working restore peace sort problems facing problem everyone country turned talk action modi led government waiting things cooldown something bigger happen people divert attention topic things low wont even allow manipur discussed parliament idiot still wants sideism god knows say want support rapists ground reports print shown metei women cases meiteis want say ground reporting neutral giving typical bjp smokescreen media anti hindu havent even seen meiteis demanding president rule genuinely threat fear would asked top meitei group women vigilantes called meira paibi blocking supplies kuki areas handing kuki women male mobs forcing army release terrorists community get support tell people please speak manipur also read karan thapar interviewed people sides trust meiteis coming looking good print done ground reporting even written plenty articles tell rotten meiteis please hit matters support kukis calling meitis otherwise really caring manipur happy got something pin modi modi lose developed minority tribe current cm seems show hatred always calling encroachers illegal immigrants etc without gaining trust go giving st status affluent valley people right atleast peaceful protest st also mean meiteis eat jobs issue going hills meiteis cm shown love understanding dumbass supporting rapists bigots want still trust meitei community spread fake news women raped even watching reading anything lapping like dog whatever meitei shit posted twitter meiteis dont want president rule even tore resignation letter n biren forcing army release terrorists using women tamasha women also handing kuki women male mobs signs community defending suffering idiot theres quote one piece villain whoever wins war basically power becomes justice theres already mosque theyve targeted gyanvapsi take headlines isnt job put lives line protect us ok cowards happened arrests two months absolutely unacceptable shows culprits acted impunity told arrests made hills habitable kanhaiya beheaded culprits caught within day two terrorism charges culprits caught two months despite overwhelming evidence see difference police force mostly made majority meitei community obvious going im sorry wish things better everyone jobs put lives line literally one owes anyone else lives failed day riots began stand aside wait till normalcy supposed make arrest armed resistance expect army fight meities antagonize government govt already messed enough thus runing chance peace talk compromise ever thankgod diplomats dont take recommendation reddit wow complete lack knowledge roles responsibilities state authorities like police forces armies govt ministries like home role police absolutely put lives line protect us thats terrorists attacked us mumbai armed resistance video surfaced arrested within hours obvious going still battle tribes terrorist groups unless government listens complete utter idiots like turn one ive official job profile definitely doesnt say put civilian lives social media bjp cells godi media already started playing game save image biswaguru inch manipur cm protest tarnished image bip already crying look state old unlces defending biswaguruby saying pm work world leader govt dont care hardly mp seats even appeal ruling parties maintain peace missed keep talking dont let forget top link quick google makes sense previously aware thanks informing propaganda machine working overtime",
    "light_cleaned_title": "Please speak out about Manipur",
    "light_cleaned_selftext": "Guys speak about it to your parents, your neighbors, your family, discuss this in WhatsApp groups. The minority really needs protection from the majority community. Comment on social media platforms. Remind the people of BJP wrong doings. Comment on podcasts used to whitewash the BJP Modi regime. Share posts, share stories, please please raise your voice to protect the minorities of this country, the women of this country. The cops handed the women to the men, no one was arrested for 2 months. Kulki women protested infront of HMs residence. They met him. They all knew about this. They turned a deaf ear and went to the US and France etc. PLEASE SPEAK UP",
    "light_cleaned_comments": "Some Indians were laughing at this guy and calling him India hater but seems like he’s not wrong at all Its too late. The IT cell has already started with their rubbish. My brainwashed dad believes everything was done by Muslims. If there is any justice or karma in the world the BJP, its members, supported and it's machinery should suffer horribly for what they put our country through. What are the next states ripe for such events? They have even taken over r/manipur..it is now moderated by a radical Hindutva propagandist from Odisha who wouldn't let anyone post a different opinion. ANI out in a fake story about some rohingya Muslim being behind the riots just long enough for Sanghi bigots to spread it around and then apologised and took it down. They have it all worked out like a well oiled machine so hatred goes on full swing no matter what. The CM of Assam, other ‘influencers’ have started to defend and divert the topic. Tomorrow is a crucial day. The PM has to be put under pressure in parliament. They have to create unrest if the PM is seen to escape questions. This is a critical moment in Indian democracy As goswami said, since it has come down to government and the opposition trying to score political brownie points then i think no real justice would prevail. It'll be just a contest of who'll gain political leverage. It feels like they keep pushing the boundary for what is acceptable. Slowly and steadily they are normalising acts of genocide. Comparing Manipur to Rajasthan is simply wrong. If you watch Karan thapars interview with the meitei chief from a month ago it’s obvious that an attempt was made to instigate this violence and in his words ‘annihilate our rivals’ was tweeter 5 days before the unrest began. Yeah, WhatsApp groups of boomers are already active with content from the infamous WhatsApp university. These people won’t change. The more impactful thing other state governments can do is supporting the displaced people by providing them shelter, food and opportunities to rebuild their livelihoods. As commoners, the best support we can provide is to treat such people with kindness. That is if they want to restart their lives elsewhere. If they want to go back, I hope the next government can provide better support. But what’s wrong with gaining meaning political leverage from this? Like the HM could’ve stopped this from happening. He became the Home Minister via electoral politics if we are to avoid this from happening then we need to use electoral politics to put a better more humane HM in place with a better PM. Electoral politics if the most effective form to bring about change in a democracy. Its your low knowledge on this subject that you claim minority suppression by majority in Manipur. Blame BJP and government all you want, but the fact is that no one is responsible for this alone, both Meities and Kukis are doing violence in the state. Cuz it was Meiti suppressing Kuki, it came out but there's tons of things still going there. Kukis are not the suppressed one here. Again, not defending the govt or BJP, but have common sense without writing. >Remind the people of BJP wrong doings. It's core audience voted him for that specific reason lol. Speaking will not achieve anything. Voting will, and people on reddit don't vote and are just keyboard warriors Already happened in West Bengal Why are Kukis so uncomfortable with Meitis getting ST status? Why are Kukis so uncomfortable with Meitis getting ST status? west bengal is not case of genocide. it is case of post poll violence which started in bengal under jyoti basu rule. CPIM used to use tactics of violence and now TMC is doing same. If bjp comes, then all tmc goons will join bjp . This is how politics work. HM tried to bring the communities to table. Only way forward is Modi declaring President rule in Manipur. From my readings and research it seems obvious that the influential Hindu meitei community in the state brought about a law via the HC to open tribal(Kuki catholic mostly) land up to purchase for the Meitei. The poor tribals who live in the hill regions fear that this law has the power to wipe them out of their lands. In their attempts to oppose this law the student association marched a protest while leaders of meitei community were instigating violence to end Kuki community. A fake rumour was spread that Kuki women were raping meitei women (a trick used by the bjp it cell) which was proven fake. Police which again has a strong meitei influence HANDED OVER WOMEN TO MEITEI MEN. the CM is meitei, they did not arrest meitei men who committed these crimes. This is obvious oppression. What else is called oppression? I was talking about the incident that took place near the howrah district Why take the hard route working on the governance when you can easily pump up hatred and gain votes off it. My comment was for the violence perpetrated in the state only. No one is sane or oppressed there. As for the tribal status issue, it's a verdict given by the high court, not passed by some legislation. You can challenge it in supreme court all you want. But instigating violence just because of it is pure evil on the part of Kukis. Sadly there is nothing as such karma , Speaking relevant facts and establishing relevant facts via conversations can influence voters. That is the point of speaking and informing others about what is going on. I studied in Scotland for a year and a half and worked prt time at a non Indian restaurant for the same time. Surrounded by non Indians mostly European colleagues it was refreshing to see how they would at the end of every shift have political discussions and try to update each other about what’s going on in both local politics and global affairs. We don’t seem to have such an approach towards political discourse. And our law and order knows nothing like justice I come from a family which has sangh backgrounds. My mom doesn't know anything much about politics. She respects modi a lot and view him as a god. When I explained about manipur incidents and government's role in it, she was very angry about modi. For the first time I saw this in my life. I actually view this as an achievement. People need to be gotten out of the bubble of sangh propoganda But it doesn’t look like they instigated the violence. If you refer to Karan thapars interview with the meitei chief he instigated violence with tweets asking for annihilation of the Kuki community. He said it on camera. Then in a lawless state wherein no arrests are made, police stations are looted of weapons there will be retaliation when women are being raped and paraded naked. I’m not saying the retaliation is right but it is human nature. Need strong leaders to stop it. What incident? >since it has come down to government and the opposition trying to score political brownie points Stop with this false equivalence. The government has failed to do is job for 3 months while the state was burning. When opposition tried visiting, the government wasted resources to block the visit instead of protecting people. The opposition is doing its job to raise the issue as the government continues to be complicit in violence. There is no justification for retaliation, violence is violence. Agree on political and administrative point. >....karan Thapars interview The thing with tribals is that they don't give a fuck about media or press or their image. These type of comments just depict how they want to look the dominant one here. But the truth is, Meitei chief doesn't control every Meitei, almost some units. His statement in the media is useless, when we are seeing clear instigating by the Kuki and Naga side as well. Again, no one is sane here and instead of protesting or rioting they could've gone to SC. Fear come election time people will forget this and vote for people who they see themselves in. The majority will vote for the BJP because they represent their community. The BJP then act as representatives of Hindus and unleash such violence against minorities. The Hinduism is grew around is completely different to what I see today’s Guys, do watch Ravish Kumar's latest video (link below). He also says the same thing - urging people to speak up. It is very important that we spread awareness about the amount of hatred today's politics is spreading. In all my life, I have never felt that people just hate a whole community because of their religion etc. Nowadays I see even people whom I respect have fallen to the Hate Factory & Propaganda. Link - I honestly think that a huge chunk votes for them because they are unaware of the BJPs economic failures, social policy failures are not discussed in mainstream media. Mainstream media has transformed general elections into presidential popularity contests and pitted Modi on one side and well you know of the other side and their electoral failures. Nagaland, Frontier Nagaland. The problem is even after I talk about it with them they seem to not understand how serious it is Gov is completely successful on hiding it from people and shift there focus I totally agree with you. But I still consider this as an improvement. Atleast she didn't view modi as a god this time. There is no karma, the universe is indifferent [https://timesofindia.indiatimes.com/city/kolkata/2-women-candidates-stripped-during-west-bengal-panchayat-polls-bjp/articleshow/102024770.cms](https://timesofindia.indiatimes.com/city/kolkata/2-women-candidates-stripped-during-west-bengal-panchayat-polls-bjp/articleshow/102024770.cms) Unfortunately the congress is filled with privileged individuals who live in their comfy homes and bungalows. They do no understand the severity of our republic. In comparison and credit where it’s due the BJP would absolutely put a lot of effort when they were in opposition. Congress is a dead party. they will. you are a hero brother, lets wake up one sangh at a time Because Meiteis getting ST would allow the encroachment of their land by a majority that is far more developed in every aspect. Keep in mind that the hills are not all habitable and. This is a majority vs minority because the majority has the support of the government that was voted in BY the majority. The action of Police is not only suspicious already but straight up unlawful. The DGP of the State's Police was a Kuki but he was sacked on the day of the Protest, I wonder why. This happened at home. Incident 1) My mother asked why aditya thackrey has to speak about something that happened in Manipur. I asked her what smriti irani had to do about something that happened in delhi back in 2012 when she stayed in mumbai. Incident 2) she literally questioned herself, manipur india mein hai kya? I am glad she doesn’t have a daughter. >huge chunk That huge chunk votes because of his past, nothing else. Like what is the percentage of people in India who understand the most basic of policies leave alone who are privileged enough not to care. Just watch a public rally speech and you will get to know what people vote for. And the current elected people are doing fantastic on what they were voted for. Meitei already have OBC status & EWS reservation. Why do they even want ST status? Remember that SC had to correct the wrong judgement of HC & Revert the decision that classified the Meitei as ST. How much misinformed are you. People like you are bringing religious angle to this. Kukis are not victims here calm down. people will forget now and vote, but their grandkids and the generations to come will never forgive them. Also I swear after 20 - 30 years or so, when Gobi will be remembered as the incompetent leader that he is, the same people who currently support and defend Gobi will be ones to say how they always knew what a POS he was and how they never understood how anybody could vote for him, meaning they will switch parties the same way MLA's and ministers do when offered project Kamal. Majority of population are confirmation biased so it's not even worth reasoning with them. It will either get deflected or turned into propaganda. The irony is only the mega corporates are the ones benefitting from their ruling while the common man does not reap any reward. But one thing BJP are proficient at is taking advantage of destructive and constructive effects of religious prejudice. People need to understand that BJP are governing the State of Manipur thus they are responsible for it. First, you didn't answer my question. Second, Meitis claim themselves to be the indigenous tribe of Manipur, and demand ST status so as to protect their land, and culture. Now, why do Kukis have problem with Meitis wanting to protect their culture? Meitis never demanded for exclusion of Kukis from their land while Kukis have formed their own authority in Churachandpur after kicking out all Meitis, and renamed it as Lamka. > The cops handed the women Is this bit verified? So you mean to say that 80% of the land, doesn't matter if it's habitable or not belong to Kukis? And that Meitis should stick the 20% land in valleys no matter how crowded it gets? Do Kukis have more of a claim on the land of Manipur then Meitis? Given Meitis are the original tribe of Manipur. I have no information on this. Why do Meiteis want ST Status even when being classified as OBC? And good for the Kukis to fight back to protect their rights and land 👍 This is true of some of my friends. I d say 30%, which is a huge number Okh then. Last man standing wins. I hope the men who did this get harsh punisht. But long term I hope for fair laws. No reservations. No you can buy land here, but not there. If it's fair, plus give some help to people to study, make farms in hills (can do it, with a little machinery to dog, process like home compost ....) So point is help people but don't make unfair long term laws. Then root cause resentment will come down. People who lose privileges won't like but long run let us be a progressive equal rights and oppsitunities. No excuses No it is not entirely your moms fault. Unfortunately we as humans are the products of our environment. Your mom like millions in our country have been made subject to lie after lie and propaganda after propaganda. When you tell a lie enough times it’s takes the form of the truth. Throughout the 9 years the image of the PM has been created in such a way that he cannot be criticised. That what happens in India shouldn’t be criticised. It’s ‘anti India’ to discuss the bad things. Instead, focus on the good. 9 years ago your mom would’ve have a completely different approach to criticism of state and state leaders. That rational thought process has been systematically wiped out of us. I am appalled by this hypocrisy Do you believe only one community suffered at the hands of another? Do you believe women from the majority community are living life like queens? No you idiots, every innocent in Manipur is in danger and it's not a matter of communities at this point, stop this hypocrisy to further your own goal and sympathies equally or don't do it at all. finally found a sane comment. > My brainwashed dad believes everything was done by Muslims. Turn it around on them, ask them that how come their super hero Modiji could not prevent this. how will he save other Hindus then. Don't you know? \"Majority\" community can't be victims. Sad you're getting downvoted for telling the truth This just shows your ignorance and lack of knowledge. Of the 80%, 30-40% or even smaller is inhabited by Kukis whilst Nagas are the dominant hill tribe. (https://sarayutrust.org/2023/07/07/the-false-lines-of-manipur/amp/) Not to mention, there are numerous forest reserves where the hill tribes cannot settle in. Meiteis never truly moved beyond the foothills. That is why the Maharaja of Manipur didn't object when Kukis started moving into the uninhabited hills adjacent to the valley. Let me ask you this - Can you say it is your land if you didn't live in it nor own it? People here raising voices will leave their brain at home while voting, if you voted for these monsters you are all partially responsible. Well if you google, population density of Manipur is just 123 per sq. km compared to 29000 per sq. km of Delhi. It is not a scarcity. Once needs are fulfilled greeds take over and it transforms into terrible form when it is infused with power. Meities are involved in majority of all socio economic and political activites happening in the state. With Meities getting ST SC quota, Kukis will struggle to get Government jobs or other white collar jobs in their own state. Remember Meities control the valley, lifeline of the state, the commercial hub. Equality is good if everyone has got equal opportunity but when one party is underprivileged we need equity. Besides if you look at history, Meities were given the option to opt for SC/ST quota but they declined. But now since it can amplify their advantage they are pushing for it since they have the means as well. Well Meities will thrive for their own benefit which is not wrong but Government should have not entertain such an agenda in first place. This whole proposals pushed by some partial individuals with high authorities are the reason for such a failure. That is what the woman that survived the gangrape stated in an interview. Ig ik who you're talking about. He's mentioned in a comment that his sagei / salai is mangang, so I believe he's meetei no. he's lying.he only came up with that after me and several others exposed him. he cannot even write a coherent line in meiteilon without using translation app. he didn't know about the salai taret ki firal.all his posts are based off whatever he could find on google. both him and u/FrankfurtSupremacy guy are fake meiteis.he has deleted the posts and comments where i exposed him and permanently banned me and the others. I think a meitei dominated police force not arresting meitei men for sexually abusing and parading Kuki women naked for more than 2 months is overwhelming evidence to suggest that the meitei community is dominating and attempting to wipe out Kuki community. I do agree with you every innocent in Manipur is in danger right now. Evidently the Kuki women does not have the support of local police to protect them. It’s tragic. Dude even I used to hate when someone points a finger towards our nation, but looks like we are, in fact, doing things wrong and it's not all propaganda. We getting mass brainwashed to vote for this sh*t of a party was the propaganda many of us fell to. This was their attempt to cry wolf The second incident boils my blood. Then they get offended when people here don't even want to call themselves Indians. 🙃 Why? Why don’t we collectively raid r/place and write save manipur to get international attention? That is the only way the government will learn, when foreign media will malign them. Great job you guys! To lie on an anonymous platform requires special cowardice and this indicates how hard they are trying to push their agenda. yeah but we got banned and he became the mod...such is life. Wish opposition had a strong country level face. The biggest concern is that the incidents occuring doesn't affect majority of people \"directly\" so they will try to keep the status quo as long as possible instead of taking risk voting a new leader. Huge population really messes things up. My brother has been victim of the hyper competitiveness so much that he only earns around 50k while destroying his mind and body daily. He would rather see the world burn and enjoy rather than push himself further fighting for the \"justice\" he doesn't even know will have an outcome or not, and majority of indians are like my brother As per 2011 census, only 17% of Manipur population comes under OBC and that is shared with other minorities like Muslims. Most meiteis are general caste especially those living in valley. The ST status is not so much of Meiteis buying land in hills but rather having to protect the 9% of valley that they are confined to. Remember anyone from India can buy and live in the valley. Kukis, Nagas, other non manipuris all live and buy land in it so the land that meitei could call their homeland will decrease in a decade or two and they will become minorities in their own land. Look at from this perspective too. Yes, please do speak up but do remain neutral. Both sides have suffered to a great extent. I have seen so many independent thinkers tweeting and sharing news about only one side based on their political stance. This isnt about Bjp vs Congress neither it is about Christians vs Hindus. This is an outbreak of a long brewing tension between two communities. Please, I beg of you, remain neutral. I am neutral and request everyone to remain neutral. However THIS IS DEFINETLY ABOUT THE FAIULER OF THE BJP IN BOTH STATE AND CENTRE. This has shades of 2002 Gujrat all over it. It’s a disgrace these guys are legally allowed to govern. They’re criminals The most divisive thread I have seen in my 3 years in reddit. We all know Manipur is suffering but spreading this kind of divisive ideas will not benefit anyone. Rather than doing Majority vs minority, Sanghi vs Liberals, Old generation vs new generation, Modi vs anti-modi, Bjp vs anti-bjp in the comments I request you to discuss the solution. True that the government has failed. But don’t believe that the people on both sides are fighting based on their political stance, they are fighting for their lives. A lot of outsiders come in and try to push their political agenda and earn brownie points but the common people don’t care about all those. They just want normalcy. Bring everyone who committed violence to be tried and prosecuted and let the judicial apparatus handle the rulings of the ST status. What we need is for you guys to speak up about the Government’s silence on this matter for so long. They need to push for talks, visit Manipur and discuss every possible angle to bring an amicable solution. Normalcy comes with a change in govt with competent minds in solving issues. That is what we need to talk about. Governance is everything and the BJP is failing at governance and providing normalcy. So yeah what you talk about is only possible with good people in charge. Which clearly isn’t the bjp. So let’s start by saying fuck off the the BJP? For everyone’s good? The Imphal valley comprises of only about 10% of the total land area. While it houses more then 65% of the total population, including most of the 53% Meitis(and decreasing), as well as Kukis and Nagas. So where is the equity for Meitis? Were Kukis stopped from Imphal valley? Then what supposed advantage are you talking about. Better governance is the solution? Competent people in power who will want the best interest of everyone? And Not just selective justice which is what the bjp seems to be doing at both state and centre. So yeah solutions are plenty when people capable of providing them are in power. Not when brain dead uneducated PMs visit the world while the state is burning. Definitely yes, I myself voted for CPI because the person who ran under that was a genuinely good person and an intellect. I am against a lot of BJPs idealogies but now it's not the time for that. We need centre to step up even if it's too late but we can't wait for the next term when Congress is in power to do that. Everyone will remember and they should remember of the ruling party's failure and we should show them during the elections but definitely not now while the state is burning. Stop this minority majority nonsense. What's happening is terrible and should be beyond politics. This is a disgrace and should not even be something about clubs. Also the so called minority were the ones to start this stupidity. They are well armed and have done equally if not worse things to the matei. Again this is just so you know and this matter should be on humanity and not on politics. Both MUST stop this barbaric behaviour which makes humans look worse than wild animals My fear is everyone won’t remember hence the need to keep the convnersation alive. We forgot kathua. Unfortunately that generation never paid attention to what was taught in textbooks. I’m a millennial and we were constantly taught about population control in textbooks but culturally the previous generation never cared about population control etc. they just wanted us to get good marks in math, science and become engineers. So even by your figures:- Meitis=10-12% land mostly Imphal Valley Kukis=30-40% land of hills Where is the Equity? Not being ST was their choice. Now being ST is also their choice. Why do Kukis have an issue with it when Nagas don't. And since most of that land is already occupied or reserved, then what are Kukis so insecure about. The conversation needs to be alive but the political crux needs to be secondary, the sufferings of the people need to be the primary topic. Strong evidence to suggest the meitei community leader threatened to wipe out Kuki community 5 days before the unrest began so yeah I doubt the Kuki started it. And when a community uses rape as a weapon against women of another community and the police takes no action to stop it (for two months) the oppressed community will take matters into their hands to defend/retaliate. It’s a complete failure of governance. It’s got to stop. That's the average population density. Meitis live in crowded Imphal valley with population density of 992 inhabitants/Sq Km while the population density of hills is 44 person per Sq Km. The greed you're talking about certainly doesn't apply on Meitis. One of my colleagues was acting shocked on reading about how long it has been since Internet blackout in Manipur. He is a Modi worshipper, turns out he didn't even know that there is a BJP govt in Manipur. He couldn't believe it, said that what's going on is not possible with a BJP government. For his satisfaction I looked it up in front of him and showed him the proof. I hope he questions more things going forward. This is a classic example of how media has failed our country. Again, your lack of knowledge is showing again. The Nagas were part of the Protest back in May. Nagas aren't fighting. Not asking in a sarcastic or rhetorical tone or anything, and am not defending anyone, just for my own reference and knowledge, why are people saying BJP is to blame? Genuinely asking, what hand did they have in this? and what could they have done to prevent this. Yeah, I truly wonder why they're fighting the hill tribe with the lesser population whose insurgents are under-funded since the 90s and in SoO agreement. But the other tribe that has a much higher population and one of the biggest and well armed insurgent group (NSCN) which isn't under the SoO aren't being bothered. We'll never know ig Ravish Kumar wrote a very moving piece on the need to speak up. Must read. which state? Do you understand the role governance plays in the welfare of people? Do you realise the powers state and central ministers have to control riots and stop them? Do you realise failure in using those powers is an act of negligence and can be used to even punish said ministers in democracies? Do you the know the political party governing Manipur? Do you know that the police failed to catch those culprits whose faces could be seen in the video for TWO WHOLE MONTHS? Do you then realise that it probably meant that these rioters and abuser’s were probably guaranteed impunity by govt officials? The same BJP govt officials. Do you know that the Kuki community women protested infront of Amit shahs residence? Which probably means he was aware of the atrocities? Which probably meant the PM knew despite which he went to the US and France A political issue requires a political solution. Stop distracting with platitudes of 'humanities' those who chose to parade women and rape them and kill their men abandoned humanity two months back. And by political solution - I mean real implementation of change in government, hearing out demands and coming to a solution that works based on the material conditions of Manipur. BJP has shown it is unfit to do that. The politics of the tribes requires a council of representatives of all tribes that have stake. BJP and their majoritrian, dominating politics cannot and will not implement that. The way the CM of Manipur has been speaking shows his incompetence, arrogance and impunity. It is appalling that he has not been sacked. There is failure on the state's part. The solution is for the CM to step down first of all. Second is to have a council of tribes as a governance model instead of a single political party dominating. The politics of north -east is incompatible with mainland way of doing things. Kuki women were sexually assaulted and paraded naked by meitei men who were not arrested by a police force majorly comprising of the meitei tribe and you’re saying kukis are not the victims? On what basis? Subscribe to, like and view the sh#t out of as much liberal, progressive, atheist and independent and credible journalists' youtube videos, preferably from your parents' accounts, or if not, from your own account. Perhaps, even share the videos. Can't really see any other way their wretched machinery can be countered. Yeah my mom also said that she hated modi now. She was modi leaning before. May be you can open a new alternate sub for the meanwhile and ban those people! It'll be a lot of work but it will be great if every bit of information, the good and the bad, regarding MN is in one place. It will make things clearer and may be somebody can figure out things hidden in plain sight. I know it's a long shot but since government isn't doing anything but waiting for more blood to shed, we can give it a try. >May be you can open a new alternate sub and ban those people! we have, it's called r/Manipur_ but the other one has more members since it is the original sub and not many people know what happened. my brainwashed dad literally starts fighting me with abusive words to defend his oh so valuable PM to the point he starts abusing with words my brainwashed dad literally starts fighting me with abusive words to defend his oh so valuable PM to the point he starts abusing with words source? Thank you for raising awareness. Dumbass thinks that this whole issue started at this point. No, it started far before that. You are only considering this as the start of the issue. To burst your bubble it is not. This is one of the many atrocities happening from many days. You know who started all this fights. Kukis. Seems like you are not grasping that. It is rather unfortunate of what happened to her. But you are twisting the whole narrative saying the kukis are innocent. Because you have an agenda. Bigots should learn some shit before posting. >“The Manipur incident is highly unfortunate, we condemn it.But what has happened in West Bengal is equally shameful. This is dictionary definition of whataboutery. If these incidents happened, they're shameful indeed. However, they're not equally shameful as bjp allowing a state to burn for 3 months, during which, by its own cm's admission, 100s of firs for rape, murder, arson etc. have been filed, and the government has chosen to act in exactly none of them till videos go viral. Knowing bjp, they've added extra masala to make post poll violence to look like sexual violence in order to draw the false equivalence. No, you certainly don't. Because if you acknowledged that this is made up bullshit by bjp to distract from the horrific violence bjp has allowed to continue unabated in Manipur for 3 months, you'd have to acknowledge your heinous mentality that got you to indulge in such whataboutery. Compare the response of the dgp in this tweet with that of the Manipur chief minister, and tell us whether you think you are capable of noticing the difference between the thorough investigations in Bengal and the litany of excuses and indignant handwaving in Manipur. Hey we look alike You are making it out as if meitei are all aggressors and kuki are all innocent. People from both tribes have suffered and died but you want to play the minority card here. You can totally blame BJP but saying “minority needs protection from majority” is stretching it too far. I wonder what your response was when you saw kanhaiya getting beheaded in Jaipur by couple of muslim fanatics? Did you think majority was in danger then and needed protection from muslims? TF do you think Police can do there tho? Barge into a group of armed militants and snatch that woman away like Chulbul Pandey. This is real life and situation is way too nuanced, Just read the accounts of army-men working to restore peace and sort of problems they are facing. Problem is everyone in this country has turned into all talk and no action ... The Modi led government is waiting for things to cooldown or something bigger to happen for people to divert their attention from this topic. Things are so low, they won't even allow manipur to be discussed in parliament What an idiot you are who still wants to do both sideism and God knows for what. Just say you want to support rapists. Ground reports from print have not shown any metei women cases. If these meiteis want to say that the ground reporting is not neutral then they are giving the typical BJP smokescreen that media is anti Hindu. I haven't even seen these meiteis demanding president rule. If they were genuinely under such threat and fear they would have asked that. To top it all , meitei group of women vigilantes called meira paibi are blocking supplies to kuki areas, handing over kuki women to male mobs, forcing army to release terrorists. Why should this community get any support now tell me. People please speak about manipur and also read about it more. Karan Thapar has interviewed people from both sides and trust me meiteis are not coming off looking good. Print has done ground reporting and even written plenty of articles which can tell you how rotten meiteis are. Please hit where it matters, support for kukis and calling out meitis. Otherwise you are not really caring for manipur and only happy that you got something to pin Modi on. As for modi , he should lose in 2024. They are an under developed minority tribe who the current cm seems to show hatred for by always calling them encroachers, illegal immigrants etc. Without gaining their trust how can you go about giving st status to the most affluent valley people. Why should they not have the right to atleast have a peaceful protest. ST will also mean that meiteis will eat up their jobs. If the issue is about going to hills then meiteis and the cm should have shown more love and understanding You are the dumbass who is supporting rapists and bigots. You want to still trust this meitei community after they spread fake news about their women raped. Are you even watching or reading anything or just lapping up like a dog whatever meitei shit is posted on twitter. Meiteis don't want president rule and even tore resignation letter of N Biren. They are forcing army to release their terrorists by using their women to do tamasha. Their women are also handing out kuki women to male mobs. Is this any signs of a community that is just defending or suffering. Idiot. There’s a quote from one piece by a villain: “whoever wins the war (basically has the power) becomes justice”. There’s already a mosque they’ve targeted. Gyanvapsi will take the headlines Isn’t their job to put their lives on the line to protect us? Ok they were cowards when it happened but why were there no arrests for two months? Absolutely unacceptable. Shows that the culprits acted with impunity. They were told no arrests will be made The hills are not all habitable. When kanhaiya was beheaded the culprits were caught within a day or two with terrorism charges. Culprits here were NOT CAUGHT FOR TWO MONTHS. Despite overwhelming evidence. do you see the difference? The police force is mostly made of majority meitei community. Very obvious what is going on. I’m sorry about this. Wish things were better for everyone No it's not their jobs to put their lives on line, Literally no one owes you or anyone else their lives. They failed the day riots began and now they stand aside then wait till normalcy. How are they supposed to make arrest where there is armed resistance? You expect army to fight Meities, Antagonize the government (the govt has already messed up enough) thus runing any chance of a peace talk and a compromise EVER!! Thankgod diplomats don't take recommendation from Reddit. Wow a complete lack of knowledge of the roles and responsibilities of state authorities like police forces, armies and govt ministries like home. The role of the police is absolutely to put their lives on the line to protect us. That’s what they did when terrorists attacked us in mumbai 26/11. Where was the armed resistance after the video surfaced? They were arrested within hours. It’s obvious what is going on here. It's still battle between tribes and not terrorist groups unless the government listens to complete and utter idiots like you and turn them into one. I've 100% their official job profile and it definitely doesn't say that they have to put civilian lives before theirs. Social Media BJP IT cells And Our Godi Media already started playing game to save the image of Biswaguru Or 56 inch.. Manipur Cm will protest against to tarnished the image.. Bip already crying look at other state.. Old unlces defending Biswaguru.by saying its Not PM work. He is world leader. govt don't care as hardly 2 MP seats is there. Not even an appeal by the ruling parties to maintain peace. What did I missed? No keep talking about it. Don’t let them forget Top link on a quick Google Makes sense. Was not previously aware, thanks for informing me. Propaganda machine working overtime"
}