{
    "id": "1eva8y6",
    "title": "Doctors/ healthcare workers deserve to be treated with respect. Period.",
    "url": "https://www.reddit.com/r/india/comments/1eva8y6/doctors_healthcare_workers_deserve_to_be_treated/",
    "selftext": "^(I've been trying to post my thoughts from the past few months and I've tried to format the post as much as possible.)\n\nLately I've noticed people being extremely un-reasonable and harbouring hate for the healthcare professionals and it pains me to see this. \n\nYes, doctors and hospitals do charge money for \"everything\" because, at end of the day salaries need to be paid and mouths to be fed. It's high time people stop being entitled asses and expect everything to be done free of cost.\n\nWhile I am probably biased in favour of the doctors, but hear me out\n\nfrom the past 2 yeas I am not keeping well, have underwent 5 surgeries, pending one more surgery with multiple hospitalizations and regular interaction with healthcare professionals.   \n\nYes, I have come across 2 not so good doctors out of which one did botch up my surgery, but in all fairness, it was my mistake too for not doing my research and going with a random doctor just because he is from the same hospital. \n\nBut, I have seen tens of doctors and all of them have been extremely kind, sympathetic and accommodating. \n\nThese doctors are Gods / angels for me, keeping me alive against all odds.\n\nI have the personal numbers of some of these doctors and nowadays, most of the time my concerns are answered and medications and tests prescribed **Free of cost.**\n\nIt does take them time and **Knowledge** to go through the tablets I am taking and to ensure the medicines are safe to be prescribed.  They need not do it and can simple ask me to come visit them in the hospital or charge fees for their time. \n\nAlso two doctors that I am close to have been extremely kind and does ensure I get the max discount for each test/ scan etc and mostly don't charge consultation fees every time I go see him in their clinics.\n\nThey have every right to charge for the care and service provided. \n\nAnd honestly it's a free market, if you feel the doctor is too expensive, go to a different one. \n\nI have been admitted and visited the hospital enough number of times to know most of the staff I've interacted with. \n\nAnd I was honestly surprised and  felt disgusted when I spoke to the nursing staff and learned that even ~~people~~  men who are injured or have been operated, even in that state they do things that's gross and is sexual harassment. \n\nSadly the staff doesn't make noise and report it. \n\nSo we need to do a clean-up of the society, but where to start from?\n\nA lot of stuff is not going right. \n\nWhy do people feel entitled enough to \"Demand\" everything for cheap / free even when they can afford it, or regardless.\n\nWhy do people have the attitude of \"I've paid for it, so I can do whatever the f I want\"\n\nWhat's the logic behind some men feeling empowered enough to \"accidentally\" touch the nursing staff, or behaving wrongly even when they are injured and/ or  have been operated? \n\nI can only imaging what they are capable of doing when they are fit and fine. \n\n  \nI honestly think doctors should refuse to treat some people. \n\nFor example, i have some relatives who don't know anything about my health condition but have come to the conclusion that the doctors are killing me with tablets and stuff for money and think none of my surgeries was needed.\n\nHeck i had a fall and injured my neck and there was no saying if i would be back to normal. I had lost the ability to control my urine, lost the ability to walk properly, lost proper bowel control, had speech issues etc and we did consult multiple doctors and it was pretty clear that this was serious.\n\nThere was no guarantee that i could ever walk, and just to sum it up it was pretty serious and avoiding the surgery meant death. \n\nAfter the surgery I have never recovered and in fact I am in a freefall into a bottomless pit and the doctors are trying everything they can to make me feel better, to reduce pain and suffering. None of these relatives have bothered to ask how I am doing, if I need something etc but blindly blame the doctors. \n\nEven when i did try to defend it, all I hear is \"doctors use these medical terms to scare you and you are not well because of the tablets you are taking\"\n\nYes tablets have side effects, but they are necessary. If I take these tablets, I might die of side-effects someday, but if I don't take these tabs I wont live either.\n\nI do remember a reel I saw from the Kapil Sharma show where the doctor character says something on the lines of when the patient needs blood nobody comes forward but if he dies, these people pop out of air and bet up the doctor. \n\nBut these same people who hate doctors take their parents to hospitals when their parents or children are unwell. \n\nWhile the supreme court [refused to make a separate law](http://livelaw.in/top-stories/law-already-in-place-supreme-court-refuses-to-entertain-plea-to-prevent-violence-against-doctors-263147) to protect doctors and argued they can use other existing laws, it doesn't make sense. ",
    "flair": "Rant / Vent",
    "score": 13,
    "num_comments": 16,
    "created_utc": 1723990470.0,
    "convurl": "https://external-preview.redd.it/Clxle_TurDRZR4z1AXhJHso_I-1PI-C_C1vfuxgAefg.jpg?auto=webp&s=f811c9201eeae351f30225438f8ca43860c32271",
    "comments": [
        "Why not conservancy workers'?  Or IT workers ? Or Plumbers ? Social workers ?\n\nNo need to either treat anyone disrespectfully or with  flying deference",
        "Every good person deserve respect, brother.\n\nOne of my relative was admitted to a Govt. hospital. Senior doctor prescribed a medicine which we could not find in Jan Aushadhi Kendra or something like that. We went out hospital premises and wondered around the town until we learnt that the doctor has prescribed a Digene syrup from a particular manufacture which was exclusively available to a medical shop that he owned.\n\nThis was not the only instance. Same thing happened around me three times. It is not like I don't like doctors, I always have respect regarding everyone I meet, but incidents like this have me having trust issues, man.",
        "Every human needs to be treated with basic respect and humanity no matter the gender, profession, culture or whatever",
        "Yes i agree. Edited",
        "I agree, I am am not wrong, you can use apps like 1mg to find similar or alternate brands and check if that works.  And yes there could be some shady stuff and conflict of interest in this case. The government must step up and have some control in this regard.",
        "Not really...\nHave you seen the private sector doctors \n4000 rs worth medicines\n500 rs worth consultation \n\nThe government hospital doctors, good ones are arare and they'll be able to give you much cheaper generic drugs\n\nSure the doctor who lost her life deserves sympathy, and in that veil, hides the malpractices of several others\n\nAll men are...  \nAll doctors are...",
        "A doctor here. Sometimes generic drugs are cheaper but not necessarily better. Some drugs are costlier as the raw material required is of better quality, the absorption is better because of the technology used and so on..",
        "Respect yes, blind respect no. I know of doctors who understand the financial situations of their patients and keep costs to a minimum. At the same time I have also been unlucky enough to have consulted with doctors who want to extract the cost of their shiny new equipment from my bank account.",
        "This!\n\nCan't agree more. I stick to the prescribed meds especially for cardiac issues and neurological issues because of the same reason.",
        "Most of the things you just said are incoherent rambling.",
        "Jan Aushadhi sucks ass bro. It's probably okay to buy digene from it but never any antibiotics or other actual drugs.",
        "Don't fall for the generic drug bs. Quality control in Jan Aushadhi is non existent.",
        "Avoid jan aushadhi \n\nNd alll others generics are good",
        "Could I ask \nFor what illness does this happen most of the times...",
        ">Doctors/ healthcare workers deserve to be treated with respect.\n\nCompared to everyone else?"
    ],
    "cleaned_text": "doctors healthcare workers deserve treated respect period ive trying post thoughts past months ive tried format post much possible lately ive noticed people extremely unreasonable harbouring hate healthcare professionals pains see yes doctors hospitals charge money everything end day salaries need paid mouths fed high time people stop entitled asses expect everything done free cost probably biased favour doctors hear past yeas keeping well underwent surgeries pending one surgery multiple hospitalizations regular interaction healthcare professionals yes come across good doctors one botch surgery fairness mistake research going random doctor hospital seen tens doctors extremely kind sympathetic accommodating doctors gods angels keeping alive odds personal numbers doctors nowadays time concerns answered medications tests prescribed free cost take time knowledge go tablets taking ensure medicines safe prescribed need simple ask come visit hospital charge fees time also two doctors close extremely kind ensure get max discount test scan etc mostly dont charge consultation fees every time go see clinics every right charge care service provided honestly free market feel doctor expensive go different one admitted visited hospital enough number times know staff ive interacted honestly surprised felt disgusted spoke nursing staff learned even people men injured operated even state things thats gross sexual harassment sadly staff doesnt make noise report need cleanup society start lot stuff going right people feel entitled enough demand everything cheap free even afford regardless people attitude ive paid whatever f want whats logic behind men feeling empowered enough accidentally touch nursing staff behaving wrongly even injured operated imaging capable fit fine honestly think doctors refuse treat people example relatives dont know anything health condition come conclusion doctors killing tablets stuff money think none surgeries needed heck fall injured neck saying would back normal lost ability control urine lost ability walk properly lost proper bowel control speech issues etc consult multiple doctors pretty clear serious guarantee could ever walk sum pretty serious avoiding surgery meant death surgery never recovered fact freefall bottomless pit doctors trying everything make feel better reduce pain suffering none relatives bothered ask need something etc blindly blame doctors even try defend hear doctors use medical terms scare well tablets taking yes tablets side effects necessary take tablets might die sideeffects someday dont take tabs wont live either remember reel saw kapil sharma show doctor character says something lines patient needs blood nobody comes forward dies people pop air bet doctor people hate doctors take parents hospitals parents children unwell supreme court refused make separate lawhttplivelawintopstorieslawalreadyinplacesupremecourtrefusestoentertainpleatopreventviolenceagainstdoctors protect doctors argued use existing laws doesnt make sense ",
    "cleaned_title": "doctors healthcare workers deserve treated respect period",
    "cleaned_selftext": "ive trying post thoughts past months ive tried format post much possible lately ive noticed people extremely unreasonable harbouring hate healthcare professionals pains see yes doctors hospitals charge money everything end day salaries need paid mouths fed high time people stop entitled asses expect everything done free cost probably biased favour doctors hear past yeas keeping well underwent surgeries pending one surgery multiple hospitalizations regular interaction healthcare professionals yes come across good doctors one botch surgery fairness mistake research going random doctor hospital seen tens doctors extremely kind sympathetic accommodating doctors gods angels keeping alive odds personal numbers doctors nowadays time concerns answered medications tests prescribed free cost take time knowledge go tablets taking ensure medicines safe prescribed need simple ask come visit hospital charge fees time also two doctors close extremely kind ensure get max discount test scan etc mostly dont charge consultation fees every time go see clinics every right charge care service provided honestly free market feel doctor expensive go different one admitted visited hospital enough number times know staff ive interacted honestly surprised felt disgusted spoke nursing staff learned even people men injured operated even state things thats gross sexual harassment sadly staff doesnt make noise report need cleanup society start lot stuff going right people feel entitled enough demand everything cheap free even afford regardless people attitude ive paid whatever f want whats logic behind men feeling empowered enough accidentally touch nursing staff behaving wrongly even injured operated imaging capable fit fine honestly think doctors refuse treat people example relatives dont know anything health condition come conclusion doctors killing tablets stuff money think none surgeries needed heck fall injured neck saying would back normal lost ability control urine lost ability walk properly lost proper bowel control speech issues etc consult multiple doctors pretty clear serious guarantee could ever walk sum pretty serious avoiding surgery meant death surgery never recovered fact freefall bottomless pit doctors trying everything make feel better reduce pain suffering none relatives bothered ask need something etc blindly blame doctors even try defend hear doctors use medical terms scare well tablets taking yes tablets side effects necessary take tablets might die sideeffects someday dont take tabs wont live either remember reel saw kapil sharma show doctor character says something lines patient needs blood nobody comes forward dies people pop air bet doctor people hate doctors take parents hospitals parents children unwell supreme court refused make separate lawhttplivelawintopstorieslawalreadyinplacesupremecourtrefusestoentertainpleatopreventviolenceagainstdoctors protect doctors argued use existing laws doesnt make sense",
    "cleaned_comments": "conservancy workers workers plumbers social workers need either treat anyone disrespectfully flying deference every good person deserve respect brother one relative admitted govt hospital senior doctor prescribed medicine could find jan aushadhi kendra something like went hospital premises wondered around town learnt doctor prescribed digene syrup particular manufacture exclusively available medical shop owned instance thing happened around three times like dont like doctors always respect regarding everyone meet incidents like trust issues man every human needs treated basic respect humanity matter gender profession culture whatever yes agree edited agree wrong use apps like mg find similar alternate brands check works yes could shady stuff conflict interest case government must step control regard really seen private sector doctors rs worth medicines rs worth consultation government hospital doctors good ones arare theyll able give much cheaper generic drugs sure doctor lost life deserves sympathy veil hides malpractices several others men doctors doctor sometimes generic drugs cheaper necessarily better drugs costlier raw material required better quality absorption better technology used respect yes blind respect know doctors understand financial situations patients keep costs minimum time also unlucky enough consulted doctors want extract cost shiny new equipment bank account cant agree stick prescribed meds especially cardiac issues neurological issues reason things said incoherent rambling jan aushadhi sucks ass bro probably okay buy digene never antibiotics actual drugs dont fall generic drug bs quality control jan aushadhi non existent avoid jan aushadhi nd alll others generics good could ask illness happen times doctors healthcare workers deserve treated respect compared everyone else",
    "light_cleaned_title": "Doctors/ healthcare workers deserve to be treated with respect. Period.",
    "light_cleaned_selftext": "^(I've been trying to post my thoughts from the past few months and I've tried to format the post as much as possible.) Lately I've noticed people being extremely un-reasonable and harbouring hate for the healthcare professionals and it pains me to see this. Yes, doctors and hospitals do charge money for \"everything\" because, at end of the day salaries need to be paid and mouths to be fed. It's high time people stop being entitled asses and expect everything to be done free of cost. While I am probably biased in favour of the doctors, but hear me out from the past 2 yeas I am not keeping well, have underwent 5 surgeries, pending one more surgery with multiple hospitalizations and regular interaction with healthcare professionals. Yes, I have come across 2 not so good doctors out of which one did botch up my surgery, but in all fairness, it was my mistake too for not doing my research and going with a random doctor just because he is from the same hospital. But, I have seen tens of doctors and all of them have been extremely kind, sympathetic and accommodating. These doctors are Gods / angels for me, keeping me alive against all odds. I have the personal numbers of some of these doctors and nowadays, most of the time my concerns are answered and medications and tests prescribed **Free of cost.** It does take them time and **Knowledge** to go through the tablets I am taking and to ensure the medicines are safe to be prescribed. They need not do it and can simple ask me to come visit them in the hospital or charge fees for their time. Also two doctors that I am close to have been extremely kind and does ensure I get the max discount for each test/ scan etc and mostly don't charge consultation fees every time I go see him in their clinics. They have every right to charge for the care and service provided. And honestly it's a free market, if you feel the doctor is too expensive, go to a different one. I have been admitted and visited the hospital enough number of times to know most of the staff I've interacted with. And I was honestly surprised and felt disgusted when I spoke to the nursing staff and learned that even ~~people~~ men who are injured or have been operated, even in that state they do things that's gross and is sexual harassment. Sadly the staff doesn't make noise and report it. So we need to do a clean-up of the society, but where to start from? A lot of stuff is not going right. Why do people feel entitled enough to \"Demand\" everything for cheap / free even when they can afford it, or regardless. Why do people have the attitude of \"I've paid for it, so I can do whatever the f I want\" What's the logic behind some men feeling empowered enough to \"accidentally\" touch the nursing staff, or behaving wrongly even when they are injured and/ or have been operated? I can only imaging what they are capable of doing when they are fit and fine. I honestly think doctors should refuse to treat some people. For example, i have some relatives who don't know anything about my health condition but have come to the conclusion that the doctors are killing me with tablets and stuff for money and think none of my surgeries was needed. Heck i had a fall and injured my neck and there was no saying if i would be back to normal. I had lost the ability to control my urine, lost the ability to walk properly, lost proper bowel control, had speech issues etc and we did consult multiple doctors and it was pretty clear that this was serious. There was no guarantee that i could ever walk, and just to sum it up it was pretty serious and avoiding the surgery meant death. After the surgery I have never recovered and in fact I am in a freefall into a bottomless pit and the doctors are trying everything they can to make me feel better, to reduce pain and suffering. None of these relatives have bothered to ask how I am doing, if I need something etc but blindly blame the doctors. Even when i did try to defend it, all I hear is \"doctors use these medical terms to scare you and you are not well because of the tablets you are taking\" Yes tablets have side effects, but they are necessary. If I take these tablets, I might die of side-effects someday, but if I don't take these tabs I wont live either. I do remember a reel I saw from the Kapil Sharma show where the doctor character says something on the lines of when the patient needs blood nobody comes forward but if he dies, these people pop out of air and bet up the doctor. But these same people who hate doctors take their parents to hospitals when their parents or children are unwell. While the supreme court [refused to make a separate law](http://livelaw.in/top-stories/law-already-in-place-supreme-court-refuses-to-entertain-plea-to-prevent-violence-against-doctors-263147) to protect doctors and argued they can use other existing laws, it doesn't make sense.",
    "light_cleaned_comments": "Why not conservancy workers'? Or IT workers ? Or Plumbers ? Social workers ? No need to either treat anyone disrespectfully or with flying deference Every good person deserve respect, brother. One of my relative was admitted to a Govt. hospital. Senior doctor prescribed a medicine which we could not find in Jan Aushadhi Kendra or something like that. We went out hospital premises and wondered around the town until we learnt that the doctor has prescribed a Digene syrup from a particular manufacture which was exclusively available to a medical shop that he owned. This was not the only instance. Same thing happened around me three times. It is not like I don't like doctors, I always have respect regarding everyone I meet, but incidents like this have me having trust issues, man. Every human needs to be treated with basic respect and humanity no matter the gender, profession, culture or whatever Yes i agree. Edited I agree, I am am not wrong, you can use apps like 1mg to find similar or alternate brands and check if that works. And yes there could be some shady stuff and conflict of interest in this case. The government must step up and have some control in this regard. Not really... Have you seen the private sector doctors 4000 rs worth medicines 500 rs worth consultation The government hospital doctors, good ones are arare and they'll be able to give you much cheaper generic drugs Sure the doctor who lost her life deserves sympathy, and in that veil, hides the malpractices of several others All men are... All doctors are... A doctor here. Sometimes generic drugs are cheaper but not necessarily better. Some drugs are costlier as the raw material required is of better quality, the absorption is better because of the technology used and so on.. Respect yes, blind respect no. I know of doctors who understand the financial situations of their patients and keep costs to a minimum. At the same time I have also been unlucky enough to have consulted with doctors who want to extract the cost of their shiny new equipment from my bank account. This! Can't agree more. I stick to the prescribed meds especially for cardiac issues and neurological issues because of the same reason. Most of the things you just said are incoherent rambling. Jan Aushadhi sucks ass bro. It's probably okay to buy digene from it but never any antibiotics or other actual drugs. Don't fall for the generic drug bs. Quality control in Jan Aushadhi is non existent. Avoid jan aushadhi Nd alll others generics are good Could I ask For what illness does this happen most of the times... >Doctors/ healthcare workers deserve to be treated with respect. Compared to everyone else?"
}