{
    "id": "15yy157",
    "title": "The Great Taxation Cog: Perpetually Grinded Middle Class",
    "url": "https://shreyashs.substack.com/p/the-great-taxation-cog-perpetually?utm_source=substack&publication_id=1808798&post_id=136308714&utm_medium=email&utm_content=share&triggerShare=true&isFreemail=false",
    "selftext": "Ranting it out",
    "flair": "Rant / Vent",
    "score": 8,
    "num_comments": 5,
    "created_utc": 1692780659,
    "convurl": "https://external-preview.redd.it/3s_l5jyFM6pnZa2AKpw764B4g4MwHhjoQHkI98OtVz4.jpg?auto=webp&s=5d410adf0b5daaee7affe3f47882918dc733a173",
    "comments": [
        "Middle class is govt's bitch and govt should squeez every tit of the middle class. \n\nAnd Middle class will happily vote for the govt with a huge hard on. \n\nThis is a fair deal for the middle class.",
        "Indoctrination in our country starts from an early age, we aren't taught to question, just accept. \n\nThat acceptance to the current landscape fuelled with the Roman circus of religion makes it's easy for the 1% to screw us in any position they prefer.\n\nSo unless we teach the newer generation to look beyond the veil, the machine will keep on running.",
        "Another article wining about the \"middle class\".\n\nThese clowns never stop to think that the authors is himself wealthy. Not middle class, wealthy. The real indian middle class is one financial disaster away from poverty. Yes, poverty. You and i will be broke if we lose all our money. The real middle class will slide straight back to poverty.",
        "I am the author. I am not wealthy. I am not whining.\n\nI can detail out my life for you, but I doubt that will change anything.\n\nThough I don't agree that the \"real\" middle class slides into poverty, the real middle class when faced with financial disaster, goes back to the end of the line to grind it back, because if they got into \"poverty\" they might actually get some benefits (this comes from experience).",
        "> I am not wealthy\n\nby whose standards? By indian standards, chances are, you are in the richest 5% of the country.",
        "Then I guess I should follow your example and sit idly by and gatekeep others."
    ],
    "cleaned_text": "great taxation cog perpetually grinded middle class ranting ",
    "cleaned_title": "great taxation cog perpetually grinded middle class",
    "cleaned_selftext": "ranting",
    "cleaned_comments": "middle class govts bitch govt squeez every tit middle class middle class happily vote govt huge hard fair deal middle class indoctrination country starts early age arent taught question accept acceptance current landscape fuelled roman circus religion makes easy screw us position prefer unless teach newer generation look beyond veil machine keep running another article wining middle class clowns never stop think authors wealthy middle class wealthy real indian middle class one financial disaster away poverty yes poverty broke lose money real middle class slide straight back poverty author wealthy whining detail life doubt change anything though dont agree real middle class slides poverty real middle class faced financial disaster goes back end line grind back got poverty might actually get benefits comes experience wealthy whose standards indian standards chances richest country guess follow example sit idly gatekeep others",
    "light_cleaned_title": "The Great Taxation Cog: Perpetually Grinded Middle Class",
    "light_cleaned_selftext": "Ranting it out",
    "light_cleaned_comments": "Middle class is govt's bitch and govt should squeez every tit of the middle class. And Middle class will happily vote for the govt with a huge hard on. This is a fair deal for the middle class. Indoctrination in our country starts from an early age, we aren't taught to question, just accept. That acceptance to the current landscape fuelled with the Roman circus of religion makes it's easy for the 1% to screw us in any position they prefer. So unless we teach the newer generation to look beyond the veil, the machine will keep on running. Another article wining about the \"middle class\". These clowns never stop to think that the authors is himself wealthy. Not middle class, wealthy. The real indian middle class is one financial disaster away from poverty. Yes, poverty. You and i will be broke if we lose all our money. The real middle class will slide straight back to poverty. I am the author. I am not wealthy. I am not whining. I can detail out my life for you, but I doubt that will change anything. Though I don't agree that the \"real\" middle class slides into poverty, the real middle class when faced with financial disaster, goes back to the end of the line to grind it back, because if they got into \"poverty\" they might actually get some benefits (this comes from experience). > I am not wealthy by whose standards? By indian standards, chances are, you are in the richest 5% of the country. Then I guess I should follow your example and sit idly by and gatekeep others."
}