{
    "id": "14nzaks",
    "title": "Class 6 boy staying in Kadapa school hostel dies, parents allege foul play",
    "url": "https://www.thehindu.com/news/national/andhra-pradesh/class-6-boy-staying-in-kadapa-school-hostel-dies-parents-allege-foul-play/article67030775.ece",
    "selftext": "The photos which are not included in the article show bruises on the lower abdomen and discoloration around the navel are, bruised and bloodied knuckles and a gash above the buttocks area.",
    "flair": "Crime",
    "score": 18,
    "num_comments": 3,
    "created_utc": 1688228982.0,
    "convurl": "https://external-preview.redd.it/7Uzk6KLECkTEAJ9RTx1-8QsRtxQMgGFL7NcKrCHBj_w.jpg",
    "comments": [
        "Update:\nProceedings of the District Education officer\nY S R district\nPresent : Y Raghava Reddy\nBAEd (NCERT), MA& M Ed\nRc\nNo\nA&I/2023\nDated 01/07/2023.\nSub:- Death of a student by name Mr Suhaith of 6th class at B Sridhar\nReddy School , Khajipet , YDR district - It was a suspicious death as\nreported in the media as there are some injuries- ordering for\nimmediate closure of the school and constituting a 5 man committee\nenquiry chaired by AD-MDM - orders - issued.\nRef: Message in social media\n2. Report from the ME0, Khajipet\nThe attention of the management of Beeram Sreedhar Reddy school\nKhajipet is invited to the subject cited above where a student by\nname Mr Suhaith of 6th class died . As seen from the photos of the\nboy having injuries on the body, it is almost a suspicious death for\nwhich the management is totally held responsible\nIn view of the above the following actions are taken\n1. The school is closed and other statutory permissions are withdrawn with immediate\neffect.\n2. The 5 man committee is constituted with AD- MDM as chairman and MEO-1& 2,Dy E O\n<adapa and Tahsildar as the members to conduct detailed inquiry\n3. The MEOs -1 &2 shall take responsibility to inform parents to take boarding students\nome and conduct parents meeting tomorrow to shift students to schools of their choice\n4. The MEO-1 shall file the complaint with the police as it is a suspicious death\nHence the proceedings shall be acknowledged\n(Raghava Reddy Yeddula)\nDEO.\nTo\nThe corespondent of the school\nThe HM of the school\nThe MEO I & II of Kazipet,\nThe AD -MDM of this office\nThe Tahsildar , Khajipet\nThe Dy EO, Kadapa\nCopy submitted to the RJDSE, Kadapa for information,\nCopy submitted to the CSE, Amaravathi",
        "Awful news. This should get more attention."
    ],
    "cleaned_text": "class boy staying kadapa school hostel dies parents allege foul play photos included article show bruises lower abdomen discoloration around navel bruised bloodied knuckles gash buttocks area ",
    "cleaned_title": "class boy staying kadapa school hostel dies parents allege foul play",
    "cleaned_selftext": "photos included article show bruises lower abdomen discoloration around navel bruised bloodied knuckles gash buttocks area",
    "cleaned_comments": "update proceedings district education officer r district present raghava reddy baed ncert ed rc ai dated sub death student name mr suhaith th class b sridhar reddy school khajipet ydr district suspicious death reported media injuries ordering immediate closure school constituting man committee enquiry chaired admdm orders issued ref message social media report khajipet attention management beeram sreedhar reddy school khajipet invited subject cited student name mr suhaith th class died seen photos boy injuries body almost suspicious death management totally held responsible view following actions taken school closed statutory permissions withdrawn immediate effect man committee constituted ad mdm chairman meo dy e adapa tahsildar members conduct detailed inquiry meos shall take responsibility inform parents take boarding students ome conduct parents meeting tomorrow shift students schools choice meo shall file complaint police suspicious death hence proceedings shall acknowledged raghava reddy yeddula deo corespondent school hm school meo ii kazipet ad mdm office tahsildar khajipet dy eo kadapa copy submitted rjdse kadapa information copy submitted cse amaravathi awful news get attention",
    "light_cleaned_title": "Class 6 boy staying in Kadapa school hostel dies, parents allege foul play",
    "light_cleaned_selftext": "The photos which are not included in the article show bruises on the lower abdomen and discoloration around the navel are, bruised and bloodied knuckles and a gash above the buttocks area.",
    "light_cleaned_comments": "Update: Proceedings of the District Education officer Y S R district Present : Y Raghava Reddy BAEd (NCERT), MA& M Ed Rc No A&I/2023 Dated 01/07/2023. Sub:- Death of a student by name Mr Suhaith of 6th class at B Sridhar Reddy School , Khajipet , YDR district - It was a suspicious death as reported in the media as there are some injuries- ordering for immediate closure of the school and constituting a 5 man committee enquiry chaired by AD-MDM - orders - issued. Ref: Message in social media 2. Report from the ME0, Khajipet The attention of the management of Beeram Sreedhar Reddy school Khajipet is invited to the subject cited above where a student by name Mr Suhaith of 6th class died . As seen from the photos of the boy having injuries on the body, it is almost a suspicious death for which the management is totally held responsible In view of the above the following actions are taken 1. The school is closed and other statutory permissions are withdrawn with immediate effect. 2. The 5 man committee is constituted with AD- MDM as chairman and MEO-1& 2,Dy E O <adapa and Tahsildar as the members to conduct detailed inquiry 3. The MEOs -1 &2 shall take responsibility to inform parents to take boarding students ome and conduct parents meeting tomorrow to shift students to schools of their choice 4. The MEO-1 shall file the complaint with the police as it is a suspicious death Hence the proceedings shall be acknowledged (Raghava Reddy Yeddula) DEO. To The corespondent of the school The HM of the school The MEO I & II of Kazipet, The AD -MDM of this office The Tahsildar , Khajipet The Dy EO, Kadapa Copy submitted to the RJDSE, Kadapa for information, Copy submitted to the CSE, Amaravathi Awful news. This should get more attention."
}