{
    "id": "fxprae",
    "title": "SC issues notice in FMP's petition seeking restoration of 4G internet in J&amp;K during COVID-19 crisis",
    "url": "https://www.reddit.com/r/india/comments/fxprae/sc_issues_notice_in_fmps_petition_seeking/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/ez9fp6o2mrr41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=8321de6fea93331bdee6b452fb7f61a38c7d9960\n\n### Tl;dr\n\nFoundation for Media Professionals had filed a petition before the Supreme Court for restoration of 4G internet services in Jammu &amp; Kashmir on 31 March 2020. The petition was finally listed for hearing today i.e. 9 April 2020 before a 3 judge bench of NV Ramana J., Subhash Reddy J. and BR Gavai J. During the hearing, the bench issued notice and the matter will be heard next after one week. \n\n### Background\n\nFoundation for Media Professionals had filed a petition before the Supreme Court for restoration of 4G internet services in Jammu and Kashmir on 31 March 2020. The petition contended that the internet slowdown in Jammu &amp; Kashmir during the COVID-19 crisis violated fundamental rights to healthcare, education, livelihood and justice guaranteed by the Constitution of India. \n\nDespite the COVID-19 crisis gripping the country, the government has continued directing internet service providers to slow down internet speed in Jammu &amp; Kashmir to 2G by citing security concerns. The most recent of these orders issued under the Telecom Suspension Rules 2017 was issued on [**03 April 2020**](http://jkhome.nic.in/22(TSTS)of2020.pdf) and it is due to expire on 15 April 2020.\n\n2G is an outdated technology which was phased out in 2008 with the launch of 3G, and most modern websites and applications are too heavy to properly run on a 2G internet connection. While 4G internet services provide download speed of 150-300 Mbps, 2G internet services only provide download speed of upto 384 Kbps.\n\n&amp;#x200B;\n\n[J&amp;K Doctor's Tweet](https://preview.redd.it/e1f5q5p6mrr41.png?width=640&amp;format=png&amp;auto=webp&amp;s=61108bdc3b92f1d06a78a65a45332d2067dca842)\n\nDue to denial of 4G internet services, healthcare professionals and ordinary people in Jammu &amp; Kashmir have been unable to access the latest information about treatment and management of COVID-19 and relief measures. Further, patients are forced to flock to hospitals, which are hotbeds of infection, to consult doctors about COVID-19 and other ailments. This is because 2G internet services cannot support telemedicine which requires video to visually examine the patient. \n\n&amp;#x200B;\n\n[J&amp;K Teacher's Tweet](https://preview.redd.it/ybr8hgv8mrr41.png?width=298&amp;format=png&amp;auto=webp&amp;s=506f18b04aa10488edac202d812b8740ff515a54)\n\nIn addition to its impact on healthcare, the internet slowdown in Jammu &amp; Kashmir is also preventing children from continuing their education through online tools. Children in the region have already suffered major disruption to their education due to the communication shutdown and lockdown imposed on 05 August 2019 after abrogation of Article 370. The COVID-19 crisis has forced schools to shut down again after re-opening earlier this year.\n\nThe government has fully embraced use of technology to combat the pandemic and it has launched a COVID-19 dashboard, WhatsApp chatbot and contact tracing app to widely disseminate accurate and latest information to the public and track spread of the disease. However, at 2G speed, the people of Jammu &amp; Kashmir may be unable to access life saving information through these tools. For instance, the WhatsApp chatbot responds to queries with text, infographics and videos but downloading images and videos is difficult without 4G internet services.\n\n### Hearing before Supreme Court\n\nDuring today's hearing, a 3 judge bench of NV Ramana J., Subhash Reddy J. and BR Gavai J. issued notice to the standing counsel of Jammu &amp; Kashmir and listed the matter for hearing after one week. This was the same bench which had earlier decided [***Anuradha Bhasin v. Union of India***](https://internetfreedom.in/scs-judgement-on-kashmir-communication-is-just-the-beginning/), which related to the communication shutdown imposed in Jammu &amp; Kashmir on 05 August 2019.\n\nSenior Advocate, Mr. Huzefa Ahmadi represented the Foundation for Media Professionals during the hearing and we are extremely grateful to him for his efforts. We would also like to thank the wider legal team comprising of Advocate on Record, Shadan Farasat and Advocates, Vrinda Bhandari, Jahnavi Sindhu, Gautam Bhatia and Devdutta Mukhopadhyay who worked on this petition. IFF’s Executive Director and Advocate, Apar Gupta was also personally present with the Senior Advocate during today’s hearing which happened via video conferencing.  \n\n\n### Important Documents\n\n1. Writ petition filed by FMP ([**link**](https://drive.google.com/file/d/1u8T6zldNXlabjA0igdXObA55fyX2_4Bz/view?usp=sharing))  \n\n\n### We’re in this for the long haul. Support sustained advocacy against internet shutdowns by [becoming an IFF member today.](https://internetfreedom.in/donate/) And don’t forget to [join our Forum](https://forum.internetfreedom.in/) for closer dialogue with the IFF staff and community about technology, society and law!",
    "flair": "Policy/Economy",
    "score": 21,
    "num_comments": 0,
    "created_utc": 1586426337,
    "convurl": "https://b.thumbs.redditmedia.com/YpxdFNNQeeFv_KmRU5H0nsqv2hay5ca_HptEp31bq4s.jpg",
    "comments": [],
    "cleaned_text": "sc issues notice fmps petition seeking restoration g internet jampk covid crisis ampxb tldr foundation media professionals filed petition supreme court restoration g internet services jammu amp kashmir march petition finally listed hearing today ie april judge bench nv ramana j subhash reddy j br gavai j hearing bench issued notice matter heard next one week background foundation media professionals filed petition supreme court restoration g internet services jammu kashmir march petition contended internet slowdown jammu amp kashmir covid crisis violated fundamental rights healthcare education livelihood justice guaranteed constitution india despite covid crisis gripping country government continued directing internet service providers slow internet speed jammu amp kashmir g citing security concerns recent orders issued telecom suspension rules issued april httpjkhomenicintstsofpdf due expire april g outdated technology phased launch g modern websites applications heavy properly run g internet connection g internet services provide download speed mbps g internet services provide download speed upto kbps ampxb jampk doctors tweethttpspreviewredditefqpmrrpngwidthampformatpngampautowebpampsbdcbfdaaaddca due denial g internet services healthcare professionals ordinary people jammu amp kashmir unable access latest information treatment management covid relief measures patients forced flock hospitals hotbeds infection consult doctors covid ailments g internet services support telemedicine requires video visually examine patient ampxb jampk teachers tweethttpspreviewredditybrhgvmrrpngwidthampformatpngampautowebpampsfbaaedacdbffa addition impact healthcare internet slowdown jammu amp kashmir also preventing children continuing education online tools children region already suffered major disruption education due communication shutdown lockdown imposed august abrogation article covid crisis forced schools shut reopening earlier year government fully embraced use technology combat pandemic launched covid dashboard whatsapp chatbot contact tracing app widely disseminate accurate latest information public track spread disease however g speed people jammu amp kashmir may unable access life saving information tools instance whatsapp chatbot responds queries text infographics videos downloading images videos difficult without g internet services hearing supreme court todays hearing judge bench nv ramana j subhash reddy j br gavai j issued notice standing counsel jammu amp kashmir listed matter hearing one week bench earlier decided anuradha bhasin v union indiahttpsinternetfreedominscsjudgementonkashmircommunicationisjustthebeginning related communication shutdown imposed jammu amp kashmir august senior advocate mr huzefa ahmadi represented foundation media professionals hearing extremely grateful efforts would also like thank wider legal team comprising advocate record shadan farasat advocates vrinda bhandari jahnavi sindhu gautam bhatia devdutta mukhopadhyay worked petition iffs executive director advocate apar gupta also personally present senior advocate todays hearing happened via video conferencing important documents writ petition filed fmp linkhttpsdrivegooglecomfiledutzldnxlabjaigdxobafyxbzviewuspsharing long haul support sustained advocacy internet shutdowns becoming iff member todayhttpsinternetfreedomindonate dont forget join forumhttpsforuminternetfreedomin closer dialogue iff staff community technology society law ",
    "cleaned_title": "sc issues notice fmps petition seeking restoration g internet jampk covid crisis",
    "cleaned_selftext": "ampxb tldr foundation media professionals filed petition supreme court restoration g internet services jammu amp kashmir march petition finally listed hearing today ie april judge bench nv ramana j subhash reddy j br gavai j hearing bench issued notice matter heard next one week background foundation media professionals filed petition supreme court restoration g internet services jammu kashmir march petition contended internet slowdown jammu amp kashmir covid crisis violated fundamental rights healthcare education livelihood justice guaranteed constitution india despite covid crisis gripping country government continued directing internet service providers slow internet speed jammu amp kashmir g citing security concerns recent orders issued telecom suspension rules issued april httpjkhomenicintstsofpdf due expire april g outdated technology phased launch g modern websites applications heavy properly run g internet connection g internet services provide download speed mbps g internet services provide download speed upto kbps ampxb jampk doctors tweethttpspreviewredditefqpmrrpngwidthampformatpngampautowebpampsbdcbfdaaaddca due denial g internet services healthcare professionals ordinary people jammu amp kashmir unable access latest information treatment management covid relief measures patients forced flock hospitals hotbeds infection consult doctors covid ailments g internet services support telemedicine requires video visually examine patient ampxb jampk teachers tweethttpspreviewredditybrhgvmrrpngwidthampformatpngampautowebpampsfbaaedacdbffa addition impact healthcare internet slowdown jammu amp kashmir also preventing children continuing education online tools children region already suffered major disruption education due communication shutdown lockdown imposed august abrogation article covid crisis forced schools shut reopening earlier year government fully embraced use technology combat pandemic launched covid dashboard whatsapp chatbot contact tracing app widely disseminate accurate latest information public track spread disease however g speed people jammu amp kashmir may unable access life saving information tools instance whatsapp chatbot responds queries text infographics videos downloading images videos difficult without g internet services hearing supreme court todays hearing judge bench nv ramana j subhash reddy j br gavai j issued notice standing counsel jammu amp kashmir listed matter hearing one week bench earlier decided anuradha bhasin v union indiahttpsinternetfreedominscsjudgementonkashmircommunicationisjustthebeginning related communication shutdown imposed jammu amp kashmir august senior advocate mr huzefa ahmadi represented foundation media professionals hearing extremely grateful efforts would also like thank wider legal team comprising advocate record shadan farasat advocates vrinda bhandari jahnavi sindhu gautam bhatia devdutta mukhopadhyay worked petition iffs executive director advocate apar gupta also personally present senior advocate todays hearing happened via video conferencing important documents writ petition filed fmp linkhttpsdrivegooglecomfiledutzldnxlabjaigdxobafyxbzviewuspsharing long haul support sustained advocacy internet shutdowns becoming iff member todayhttpsinternetfreedomindonate dont forget join forumhttpsforuminternetfreedomin closer dialogue iff staff community technology society law",
    "cleaned_comments": "",
    "light_cleaned_title": "SC issues notice in FMP's petition seeking restoration of 4G internet in J&amp;K during COVID-19 crisis",
    "light_cleaned_selftext": "### Tl;dr Foundation for Media Professionals had filed a petition before the Supreme Court for restoration of 4G internet services in Jammu &amp; Kashmir on 31 March 2020. The petition was finally listed for hearing today i.e. 9 April 2020 before a 3 judge bench of NV Ramana J., Subhash Reddy J. and BR Gavai J. During the hearing, the bench issued notice and the matter will be heard next after one week. ### Background Foundation for Media Professionals had filed a petition before the Supreme Court for restoration of 4G internet services in Jammu and Kashmir on 31 March 2020. The petition contended that the internet slowdown in Jammu &amp; Kashmir during the COVID-19 crisis violated fundamental rights to healthcare, education, livelihood and justice guaranteed by the Constitution of India. Despite the COVID-19 crisis gripping the country, the government has continued directing internet service providers to slow down internet speed in Jammu &amp; Kashmir to 2G by citing security concerns. The most recent of these orders issued under the Telecom Suspension Rules 2017 was issued on [**03 April 2020**](http://jkhome.nic.in/22(TSTS)of2020.pdf) and it is due to expire on 15 April 2020. 2G is an outdated technology which was phased out in 2008 with the launch of 3G, and most modern websites and applications are too heavy to properly run on a 2G internet connection. While 4G internet services provide download speed of 150-300 Mbps, 2G internet services only provide download speed of upto 384 Kbps.  [J&amp;K Doctor's Tweet](https://preview.redd.it/e1f5q5p6mrr41.png?width=640&amp;format=png&amp;auto=webp&amp;s=61108bdc3b92f1d06a78a65a45332d2067dca842) Due to denial of 4G internet services, healthcare professionals and ordinary people in Jammu &amp; Kashmir have been unable to access the latest information about treatment and management of COVID-19 and relief measures. Further, patients are forced to flock to hospitals, which are hotbeds of infection, to consult doctors about COVID-19 and other ailments. This is because 2G internet services cannot support telemedicine which requires video to visually examine the patient.  [J&amp;K Teacher's Tweet](https://preview.redd.it/ybr8hgv8mrr41.png?width=298&amp;format=png&amp;auto=webp&amp;s=506f18b04aa10488edac202d812b8740ff515a54) In addition to its impact on healthcare, the internet slowdown in Jammu &amp; Kashmir is also preventing children from continuing their education through online tools. Children in the region have already suffered major disruption to their education due to the communication shutdown and lockdown imposed on 05 August 2019 after abrogation of Article 370. The COVID-19 crisis has forced schools to shut down again after re-opening earlier this year. The government has fully embraced use of technology to combat the pandemic and it has launched a COVID-19 dashboard, WhatsApp chatbot and contact tracing app to widely disseminate accurate and latest information to the public and track spread of the disease. However, at 2G speed, the people of Jammu &amp; Kashmir may be unable to access life saving information through these tools. For instance, the WhatsApp chatbot responds to queries with text, infographics and videos but downloading images and videos is difficult without 4G internet services. ### Hearing before Supreme Court During today's hearing, a 3 judge bench of NV Ramana J., Subhash Reddy J. and BR Gavai J. issued notice to the standing counsel of Jammu &amp; Kashmir and listed the matter for hearing after one week. This was the same bench which had earlier decided [***Anuradha Bhasin v. Union of India***](https://internetfreedom.in/scs-judgement-on-kashmir-communication-is-just-the-beginning/), which related to the communication shutdown imposed in Jammu &amp; Kashmir on 05 August 2019. Senior Advocate, Mr. Huzefa Ahmadi represented the Foundation for Media Professionals during the hearing and we are extremely grateful to him for his efforts. We would also like to thank the wider legal team comprising of Advocate on Record, Shadan Farasat and Advocates, Vrinda Bhandari, Jahnavi Sindhu, Gautam Bhatia and Devdutta Mukhopadhyay who worked on this petition. IFF’s Executive Director and Advocate, Apar Gupta was also personally present with the Senior Advocate during today’s hearing which happened via video conferencing. ### Important Documents 1. Writ petition filed by FMP ([**link**](https://drive.google.com/file/d/1u8T6zldNXlabjA0igdXObA55fyX2_4Bz/view?usp=sharing)) ### We’re in this for the long haul. Support sustained advocacy against internet shutdowns by [becoming an IFF member today.](https://internetfreedom.in/donate/) And don’t forget to [join our Forum](https://forum.internetfreedom.in/) for closer dialogue with the IFF staff and community about technology, society and law!",
    "light_cleaned_comments": ""
}