{
    "id": "1h4xtvp",
    "title": "Uber’s dirty business model",
    "url": "https://www.statista.com/statistics/1456770/uber-india-net-profit-loss/#:~:text=Net%20profit%20or%20loss%20of%20Uber%20India%20FY%202019%2D2023&text=In%20financial%20year%202023%2C%20the,previous%20year%20of%2058%20percent",
    "selftext": "Today (2 Dec) I was at Bangalore airport and booked uber Go. It was 1 hr wait time to get uber go but 10-15 minutes for go sedan and 5 minutes for premium. Uber deliberately pushing customers to change from go to sedan / premium. There support staff standing there asking passengers to upgrade to get taxi early.\nThe reason for this is uber is loss making in India. ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1733154122.0,
    "convurl": "https://external-preview.redd.it/CSMIQUOReOABBDk49eKjwFkygOQx1_BPFq-Xf7o7SLA.jpg?auto=webp&s=c31729254e6061fdf8839e9e953e78bb9a518cb7",
    "comments": [],
    "cleaned_text": "ubers dirty business model today dec bangalore airport booked uber go hr wait time get uber go minutes go sedan minutes premium uber deliberately pushing customers change go sedan premium support staff standing asking passengers upgrade get taxi early reason uber loss making india ",
    "cleaned_title": "ubers dirty business model",
    "cleaned_selftext": "today dec bangalore airport booked uber go hr wait time get uber go minutes go sedan minutes premium uber deliberately pushing customers change go sedan premium support staff standing asking passengers upgrade get taxi early reason uber loss making india",
    "cleaned_comments": "",
    "light_cleaned_title": "Uber’s dirty business model",
    "light_cleaned_selftext": "Today (2 Dec) I was at Bangalore airport and booked uber Go. It was 1 hr wait time to get uber go but 10-15 minutes for go sedan and 5 minutes for premium. Uber deliberately pushing customers to change from go to sedan / premium. There support staff standing there asking passengers to upgrade to get taxi early. The reason for this is uber is loss making in India.",
    "light_cleaned_comments": ""
}