{
    "id": "1beidgh",
    "title": "Is this a new scam of any sort?",
    "url": "https://www.reddit.com/gallery/1beidgh",
    "selftext": "Last year around November, I received a message from an unknown number on WhatsApp claiming that I had met him at the airport and paid his can fare of 1600rs. I had done few solo travels at that point, however i was sure I never paid for anyone's can fare. He kept insisting that we spoke and I paid it via cash and that now, he wants to pay me back via GPAY. I said no and blocked him. Today, I received a similar message from this guy. Attaching the screenshots of my conversation. I wanted to keep playing the game a bit more, but kids had to go to school. So blocked him.",
    "flair": "Rant / Vent",
    "score": 6,
    "num_comments": 7,
    "created_utc": 1710413366.0,
    "convurl": "https://i.redd.it/u27mk1235aoc1.png",
    "comments": [
        "First time I am seeing this scam tbh. But whenever I get a msg from an unknown number i do not reply to it. I would quickly check Truecaller and if i hav no idea who it is then i wouldn't even bother responding. As fun as it is messing with the scammers, I feel like its better not to get involved at all.",
        "holy shit you got married and had kids just so you could avoid hooking up with that guy? now that's dedication /j",
        "Probably just recycled scam. Maybe if you agree he will send 16000 \"accidentally\". You will also get a SMS about amount transfer designed to look like real bank message. Then he will ask to transfer the balance amount",
        "The couple's photo from insta be like \"hmari shaktiyon ka galat istemaal hora h \"",
        "不不不",
        "cant tell if that's sarcasm or nah"
    ],
    "cleaned_text": "new scam sort last year around november received message unknown number whatsapp claiming met airport paid fare rs done solo travels point however sure never paid anyones fare kept insisting spoke paid via cash wants pay back via gpay said blocked today received similar message guy attaching screenshots conversation wanted keep playing game bit kids go school blocked ",
    "cleaned_title": "new scam sort",
    "cleaned_selftext": "last year around november received message unknown number whatsapp claiming met airport paid fare rs done solo travels point however sure never paid anyones fare kept insisting spoke paid via cash wants pay back via gpay said blocked today received similar message guy attaching screenshots conversation wanted keep playing game bit kids go school blocked",
    "cleaned_comments": "first time seeing scam tbh whenever get msg unknown number reply would quickly check truecaller hav idea wouldnt even bother responding fun messing scammers feel like better get involved holy shit got married kids could avoid hooking guy thats dedication j probably recycled scam maybe agree send accidentally also get sms amount transfer designed look like real bank message ask transfer balance amount couples photo insta like hmari shaktiyon ka galat istemaal hora h cant tell thats sarcasm nah",
    "light_cleaned_title": "Is this a new scam of any sort?",
    "light_cleaned_selftext": "Last year around November, I received a message from an unknown number on WhatsApp claiming that I had met him at the airport and paid his can fare of 1600rs. I had done few solo travels at that point, however i was sure I never paid for anyone's can fare. He kept insisting that we spoke and I paid it via cash and that now, he wants to pay me back via GPAY. I said no and blocked him. Today, I received a similar message from this guy. Attaching the screenshots of my conversation. I wanted to keep playing the game a bit more, but kids had to go to school. So blocked him.",
    "light_cleaned_comments": "First time I am seeing this scam tbh. But whenever I get a msg from an unknown number i do not reply to it. I would quickly check Truecaller and if i hav no idea who it is then i wouldn't even bother responding. As fun as it is messing with the scammers, I feel like its better not to get involved at all. holy shit you got married and had kids just so you could avoid hooking up with that guy? now that's dedication /j Probably just recycled scam. Maybe if you agree he will send 16000 \"accidentally\". You will also get a SMS about amount transfer designed to look like real bank message. Then he will ask to transfer the balance amount The couple's photo from insta be like \"hmari shaktiyon ka galat istemaal hora h \" 不不不 cant tell if that's sarcasm or nah"
}