{
    "id": "153o3c3",
    "title": "Now they want OTT to be sanskari too",
    "url": "https://www.reddit.com/r/india/comments/153o3c3/now_they_want_ott_to_be_sanskari_too/",
    "selftext": "&#x200B;\n\nHollywood movies and American TV shows are bringing out nude scenes after nude scenes recently, be it a bunch of nude fight scenes in No Hard Feelings, The Foundation season-2, a shocking nude frontal scene in Joy Ride or even the erstwhile prude director Christopher Nolan's Oppenheimer's supposedly long nude sex scene.\n\nThere's no use of paying to watch such movies in theatres in India because they will be straight-up edited out. Our CBFC can't handle such vulgarity to be shown to our sanskari citizens.\n\nAnd they keep cutting scenes of Indian films in the name of not hurting sentiments\n\n[https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/arjun-rampal-and-diljit-dosanjhs-film-ghallughara-gets-a-certificate-with-21-cuts-from-the-cbfc/articleshow/101490793.cms?from=mdr](https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/arjun-rampal-and-diljit-dosanjhs-film-ghallughara-gets-a-certificate-with-21-cuts-from-the-cbfc/articleshow/101490793.cms?from=mdr)\n\nI don't know why Selmon Bhoi is hosting the Big Boss 2 OTT where he wants everything family-friendly. He doesn't even want a kiss on OTT platform!\n\nThe I&B Ministry now wants the OTT to be sanskari too and has asked them not to spread \"vulgarity and abuse\"\n\n[https://economictimes.indiatimes.com/industry/media/entertainment/media/will-not-allow-ott-platforms-to-demean-indian-culture-society-in-name-of-creative-freedom-anurag-thakur/articleshow/101869438.cms?from=mdr](https://economictimes.indiatimes.com/industry/media/entertainment/media/will-not-allow-ott-platforms-to-demean-indian-culture-society-in-name-of-creative-freedom-anurag-thakur/articleshow/101869438.cms?from=mdr)\n\nWhy are they so worried about fictional vulgarity and abuse shown on screen when they can't even condemn those who do vulgar crimes in real life?\n\n&#x200B;",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689752150.0,
    "convurl": "https://external-preview.redd.it/qUYye1mFZbVqw-IBhq-p_gElV4QvwtFNbst_QZH5_Ek.jpg?auto=webp&s=257d05c64bf761421a5e72d0c6e38173d2c8c34b",
    "comments": [
        "It’s not about morality, it’s about having absolute control over citizens. What we watch, what we eat, what we hear.\n\nMaking sex a taboo and not exposing to it is going to create more problems than solutions.",
        "Just watch p0rn if you are so horny."
    ],
    "cleaned_text": "want ott sanskari xb hollywood movies american tv shows bringing nude scenes nude scenes recently bunch nude fight scenes hard feelings foundation season shocking nude frontal scene joy ride even erstwhile prude director christopher nolans oppenheimers supposedly long nude sex scene theres use paying watch movies theatres india straightup edited cbfc cant handle vulgarity shown sanskari citizens keep cutting scenes indian films name hurting sentiments httpstimesofindiaindiatimescomentertainmenthindibollywoodnewsarjunrampalanddiljitdosanjhsfilmghallugharagetsacertificatewithcutsfromthecbfcarticleshowcmsfrommdrhttpstimesofindiaindiatimescomentertainmenthindibollywoodnewsarjunrampalanddiljitdosanjhsfilmghallugharagetsacertificatewithcutsfromthecbfcarticleshowcmsfrommdr dont know selmon bhoi hosting big boss ott wants everything familyfriendly doesnt even want kiss ott platform ib ministry wants ott sanskari asked spread vulgarity abuse httpseconomictimesindiatimescomindustrymediaentertainmentmediawillnotallowottplatformstodemeanindianculturesocietyinnameofcreativefreedomanuragthakurarticleshowcmsfrommdrhttpseconomictimesindiatimescomindustrymediaentertainmentmediawillnotallowottplatformstodemeanindianculturesocietyinnameofcreativefreedomanuragthakurarticleshowcmsfrommdr worried fictional vulgarity abuse shown screen cant even condemn vulgar crimes real life xb ",
    "cleaned_title": "want ott sanskari",
    "cleaned_selftext": "xb hollywood movies american tv shows bringing nude scenes nude scenes recently bunch nude fight scenes hard feelings foundation season shocking nude frontal scene joy ride even erstwhile prude director christopher nolans oppenheimers supposedly long nude sex scene theres use paying watch movies theatres india straightup edited cbfc cant handle vulgarity shown sanskari citizens keep cutting scenes indian films name hurting sentiments httpstimesofindiaindiatimescomentertainmenthindibollywoodnewsarjunrampalanddiljitdosanjhsfilmghallugharagetsacertificatewithcutsfromthecbfcarticleshowcmsfrommdrhttpstimesofindiaindiatimescomentertainmenthindibollywoodnewsarjunrampalanddiljitdosanjhsfilmghallugharagetsacertificatewithcutsfromthecbfcarticleshowcmsfrommdr dont know selmon bhoi hosting big boss ott wants everything familyfriendly doesnt even want kiss ott platform ib ministry wants ott sanskari asked spread vulgarity abuse httpseconomictimesindiatimescomindustrymediaentertainmentmediawillnotallowottplatformstodemeanindianculturesocietyinnameofcreativefreedomanuragthakurarticleshowcmsfrommdrhttpseconomictimesindiatimescomindustrymediaentertainmentmediawillnotallowottplatformstodemeanindianculturesocietyinnameofcreativefreedomanuragthakurarticleshowcmsfrommdr worried fictional vulgarity abuse shown screen cant even condemn vulgar crimes real life xb",
    "cleaned_comments": "morality absolute control citizens watch eat hear making sex taboo exposing going create problems solutions watch prn horny",
    "light_cleaned_title": "Now they want OTT to be sanskari too",
    "light_cleaned_selftext": "&#x200B; Hollywood movies and American TV shows are bringing out nude scenes after nude scenes recently, be it a bunch of nude fight scenes in No Hard Feelings, The Foundation season-2, a shocking nude frontal scene in Joy Ride or even the erstwhile prude director Christopher Nolan's Oppenheimer's supposedly long nude sex scene. There's no use of paying to watch such movies in theatres in India because they will be straight-up edited out. Our CBFC can't handle such vulgarity to be shown to our sanskari citizens. And they keep cutting scenes of Indian films in the name of not hurting sentiments [https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/arjun-rampal-and-diljit-dosanjhs-film-ghallughara-gets-a-certificate-with-21-cuts-from-the-cbfc/articleshow/101490793.cms?from=mdr](https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/arjun-rampal-and-diljit-dosanjhs-film-ghallughara-gets-a-certificate-with-21-cuts-from-the-cbfc/articleshow/101490793.cms?from=mdr) I don't know why Selmon Bhoi is hosting the Big Boss 2 OTT where he wants everything family-friendly. He doesn't even want a kiss on OTT platform! The I&B Ministry now wants the OTT to be sanskari too and has asked them not to spread \"vulgarity and abuse\" [https://economictimes.indiatimes.com/industry/media/entertainment/media/will-not-allow-ott-platforms-to-demean-indian-culture-society-in-name-of-creative-freedom-anurag-thakur/articleshow/101869438.cms?from=mdr](https://economictimes.indiatimes.com/industry/media/entertainment/media/will-not-allow-ott-platforms-to-demean-indian-culture-society-in-name-of-creative-freedom-anurag-thakur/articleshow/101869438.cms?from=mdr) Why are they so worried about fictional vulgarity and abuse shown on screen when they can't even condemn those who do vulgar crimes in real life? &#x200B;",
    "light_cleaned_comments": "It’s not about morality, it’s about having absolute control over citizens. What we watch, what we eat, what we hear. Making sex a taboo and not exposing to it is going to create more problems than solutions. Just watch p0rn if you are so horny."
}