{
    "id": "17stoot",
    "title": "Rental scammers",
    "url": "https://www.reddit.com/gallery/17stoot",
    "selftext": "So a friend of mine put her house on rent and put Irup on nobroker.com\n\nBeen getting calls willing to pay the full deposit without even looking at the place.  They say that their family like it and are willing to pay and then will tell you their \"captain\" will call you back for the transfer. And then you get a call saying that the military will transfer the amount through a reverse transaction.  Basically you bank transfer them half your deposit abs they claim twice the amount will come back.  \n\nSo I took down their account details and ifsc to know where they are located and am putting them down in the pictures.  If anyone can do something about it then please do stop them.",
    "flair": "Crime",
    "score": 7,
    "num_comments": 5,
    "created_utc": 1699706875.0,
    "convurl": "https://i.redd.it/qzdr1w07tpzb1.jpg",
    "comments": [
        "Send an email to your bank including all information and reporting that the particular account might be involved in a scam. Forward it to the ombudsman and cybercrime division of your city. Unfortunately there's nothing more you can do.",
        "This happened to me 1.5 years back, strange that its still there",
        "Just got another call. Got it all on video messing around with them lmao. Got a new accounts detail as well"
    ],
    "cleaned_text": "rental scammers friend mine put house rent put irup nobrokercom getting calls willing pay full deposit without even looking place say family like willing pay tell captain call back transfer get call saying military transfer amount reverse transaction basically bank transfer half deposit abs claim twice amount come back took account details ifsc know located putting pictures anyone something please stop ",
    "cleaned_title": "rental scammers",
    "cleaned_selftext": "friend mine put house rent put irup nobrokercom getting calls willing pay full deposit without even looking place say family like willing pay tell captain call back transfer get call saying military transfer amount reverse transaction basically bank transfer half deposit abs claim twice amount come back took account details ifsc know located putting pictures anyone something please stop",
    "cleaned_comments": "send email bank including information reporting particular account might involved scam forward ombudsman cybercrime division city unfortunately theres nothing happened years back strange still got another call got video messing around lmao got new accounts detail well",
    "light_cleaned_title": "Rental scammers",
    "light_cleaned_selftext": "So a friend of mine put her house on rent and put Irup on nobroker.com Been getting calls willing to pay the full deposit without even looking at the place. They say that their family like it and are willing to pay and then will tell you their \"captain\" will call you back for the transfer. And then you get a call saying that the military will transfer the amount through a reverse transaction. Basically you bank transfer them half your deposit abs they claim twice the amount will come back. So I took down their account details and ifsc to know where they are located and am putting them down in the pictures. If anyone can do something about it then please do stop them.",
    "light_cleaned_comments": "Send an email to your bank including all information and reporting that the particular account might be involved in a scam. Forward it to the ombudsman and cybercrime division of your city. Unfortunately there's nothing more you can do. This happened to me 1.5 years back, strange that its still there Just got another call. Got it all on video messing around with them lmao. Got a new accounts detail as well"
}