{
    "id": "1397zy2",
    "title": "Bi-Weekly Books & Reading Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/1397zy2/biweekly_books_reading_discussion_thread/",
    "selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories!\n\nDid you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations!\n\nCheck out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related.\n\nAlso, visit r/Bharat, to read and share well-written, insightful long-form articles about India.\n\nr/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)!\n\n**Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/obor0v8vx8n61.png?width=1487&format=png&auto=webp&v=enabled&s=26bc0642916d86c8e02a80ae0eb06417f74c209f",
    "flair": "Scheduled",
    "score": 3,
    "num_comments": 2,
    "created_utc": 1683336611.0,
    "convurl": "https://external-preview.redd.it/4-MB5BkKm6EYrEla9dN9w0T2n_gnXtFrCL-kOTKmNbI.jpg",
    "comments": [
        "Currently reading \"on writing well\" by William Zinsser, as the title suggests it have lot of good advices on writing. Additionally he have included snippets from his favorite books which is nudging me to read non-fiction more. My rating - 5 star"
    ],
    "cleaned_text": "biweekly books reading discussion thread bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly books reading discussion thread",
    "cleaned_selftext": "bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall",
    "cleaned_comments": "currently reading writing well william zinsser title suggests lot good advices writing additionally included snippets favorite books nudging read nonfiction rating star",
    "light_cleaned_title": "Bi-Weekly Books & Reading Discussion Thread",
    "light_cleaned_selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories! Did you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations! Check out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related. Also, visit r/Bharat, to read and share well-written, insightful long-form articles about India. r/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)! **Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Currently reading \"on writing well\" by William Zinsser, as the title suggests it have lot of good advices on writing. Additionally he have included snippets from his favorite books which is nudging me to read non-fiction more. My rating - 5 star"
}