{
    "id": "18xe1qm",
    "title": "Odds of police cracking a missing persons case! NCRB 2022 data",
    "url": "https://i.redd.it/hto6msfml6ac1.jpeg",
    "selftext": "Source : https://ncrb.gov.in/uploads/nationalcrimerecordsbureau/custom/ciiyearwise2022/1701608543CrimeinIndia2022Book3.pdf",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1704268627.0,
    "convurl": "https://i.redd.it/hto6msfml6ac1.jpeg",
    "comments": [
        "50 % is too high for India, this data is definitely not true",
        "punjab is even worse than up and bihar.",
        "Never getting lost again....",
        "You have to start checking in Canada to increase numbers in punjab",
        "The issue with missing cases is, if people were found or came back on their own they won't report it back. Police would continue to search or leave it on their database to get piled up. I think it might be because of this the percentage is so low.",
        "Punjab police busy doing challan",
        "Great job Telangana police !!"
    ],
    "cleaned_text": "odds police cracking missing persons case ncrb data source ",
    "cleaned_title": "odds police cracking missing persons case ncrb data",
    "cleaned_selftext": "source",
    "cleaned_comments": "high india data definitely true punjab even worse bihar never getting lost start checking canada increase numbers punjab issue missing cases people found came back wont report back police would continue search leave database get piled think might percentage low punjab police busy challan great job telangana police",
    "light_cleaned_title": "Odds of police cracking a missing persons case! NCRB 2022 data",
    "light_cleaned_selftext": "Source :",
    "light_cleaned_comments": "50 % is too high for India, this data is definitely not true punjab is even worse than up and bihar. Never getting lost again.... You have to start checking in Canada to increase numbers in punjab The issue with missing cases is, if people were found or came back on their own they won't report it back. Police would continue to search or leave it on their database to get piled up. I think it might be because of this the percentage is so low. Punjab police busy doing challan Great job Telangana police !!"
}