{
    "id": "168wm7g",
    "title": "Delusional and Malicious Whatsapp Forwards",
    "url": "https://www.reddit.com/r/india/comments/168wm7g/delusional_and_malicious_whatsapp_forwards/",
    "selftext": "I saw this flaming piece of rubbish on whatsapp today. People are willing to believe literally anything except the truth. It got me wondering what exactly do these mfs get out of creating stuff like this? Is it plain malice?  \n\n\nhttps://preview.redd.it/pzpnp672i1mb1.jpg?width=420&format=pjpg&auto=webp&s=e7a2b52591cc2f450a139316e5dfebb6743c5f54\n\n&#x200B;",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693746547.0,
    "convurl": "https://b.thumbs.redditmedia.com/wmQjvS4G9epSloESTP-jFIOiFRPRpdXkflWKW6mozEE.jpg",
    "comments": [
        "“ Subah 5 baje uth jao, sab thik ho jaayega”",
        "How do people not realize this is pure satire",
        "The first point has hint of truth. Research more about cancer starving.",
        "That high 5 emoji (used as namaste emoji in India) is the tell-tale sign of a fake Whatsapp forward",
        "Maybe its a case of broken clock getting it right. I wouldn't go with WhatsApp forward information over prescribed chemo...",
        "Satire is different. This is fake news.",
        "Source: Written in vedas.",
        "No... it's from Meri Lund research",
        "People buy drinking 🐄 urine to cure cancer ,yeh toh kuch bhi nahin hein ..",
        "\"🙏🏻\" is not explicitly a high-five. It's named `folded-hands` and can be used in either context.",
        "\"mobile use karna kam karo\"",
        "It has also been declared as the best emoji by the UN 🙏🏻",
        "Not gonna lie, tempted to send it to a few of my family groups",
        "I thought it was meant to be comedic, which people misunderstood and real news",
        ">How do people not realize this is pure satire\n\nHave you met ..... \"people\"?!",
        "It genuinely hurts me to see shit like this, my dad died of cancer in 2020, fuck whoever wrote this piece of shit fake news",
        "It genuinely hurts me to see shit like this, my dad died of cancer in 2020, fuck whoever wrote this piece of shit fake news",
        "Wtf. Many people would believe this shit and won't go for treatment.😐",
        "“The Cancer will die, and so will you”",
        "WhatsApp unkill in the making...",
        "Recently a Dr from India won Magsaysay Award for his work on cancer treatment of poor. \n\nBullshit like this is not only an insult to many many people who suffer from this horrible disease but also to the healthcare workers and researchers who are fighting it.\n\nAlso, it may make people who might be in early stages of this disease to actually not take correct treatment and lose their chance of cure.\n\nInterested people may read about Steve Jobs' cancer journey. It is soo sad.",
        "Sadly no, I am a discord and Reddit mod and I haven't touched grass or gone outside in 8 years",
        "Some people be wildin"
    ],
    "cleaned_text": "delusional malicious whatsapp forwards saw flaming piece rubbish whatsapp today people willing believe literally anything except truth got wondering exactly mfs get creating stuff like plain malice xb ",
    "cleaned_title": "delusional malicious whatsapp forwards",
    "cleaned_selftext": "saw flaming piece rubbish whatsapp today people willing believe literally anything except truth got wondering exactly mfs get creating stuff like plain malice xb",
    "cleaned_comments": "subah baje uth jao sab thik ho jaayega people realize pure satire first point hint truth research cancer starving high emoji used namaste emoji india telltale sign fake whatsapp forward maybe case broken clock getting right wouldnt go whatsapp forward information prescribed chemo satire different fake news source written vedas meri lund research people buy drinking urine cure cancer yeh toh kuch bhi nahin hein explicitly highfive named foldedhands used either context mobile use karna kam karo also declared best emoji un gon na lie tempted send family groups thought meant comedic people misunderstood real news people realize pure satire met people genuinely hurts see shit like dad died cancer fuck whoever wrote piece shit fake news genuinely hurts see shit like dad died cancer fuck whoever wrote piece shit fake news wtf many people would believe shit wont go treatment cancer die whatsapp unkill making recently dr india magsaysay award work cancer treatment poor bullshit like insult many many people suffer horrible disease also healthcare workers researchers fighting also may make people might early stages disease actually take correct treatment lose chance cure interested people may read steve jobs cancer journey soo sad sadly discord reddit mod havent touched grass gone outside years people wildin",
    "light_cleaned_title": "Delusional and Malicious Whatsapp Forwards",
    "light_cleaned_selftext": "I saw this flaming piece of rubbish on whatsapp today. People are willing to believe literally anything except the truth. It got me wondering what exactly do these mfs get out of creating stuff like this? Is it plain malice? &#x200B;",
    "light_cleaned_comments": "“ Subah 5 baje uth jao, sab thik ho jaayega” How do people not realize this is pure satire The first point has hint of truth. Research more about cancer starving. That high 5 emoji (used as namaste emoji in India) is the tell-tale sign of a fake Whatsapp forward Maybe its a case of broken clock getting it right. I wouldn't go with WhatsApp forward information over prescribed chemo... Satire is different. This is fake news. Source: Written in vedas. No... it's from Meri Lund research People buy drinking 🐄 urine to cure cancer ,yeh toh kuch bhi nahin hein .. \"🙏🏻\" is not explicitly a high-five. It's named `folded-hands` and can be used in either context. \"mobile use karna kam karo\" It has also been declared as the best emoji by the UN 🙏🏻 Not gonna lie, tempted to send it to a few of my family groups I thought it was meant to be comedic, which people misunderstood and real news >How do people not realize this is pure satire Have you met ..... \"people\"?! It genuinely hurts me to see shit like this, my dad died of cancer in 2020, fuck whoever wrote this piece of shit fake news It genuinely hurts me to see shit like this, my dad died of cancer in 2020, fuck whoever wrote this piece of shit fake news Wtf. Many people would believe this shit and won't go for treatment.😐 “The Cancer will die, and so will you” WhatsApp unkill in the making... Recently a Dr from India won Magsaysay Award for his work on cancer treatment of poor. Bullshit like this is not only an insult to many many people who suffer from this horrible disease but also to the healthcare workers and researchers who are fighting it. Also, it may make people who might be in early stages of this disease to actually not take correct treatment and lose their chance of cure. Interested people may read about Steve Jobs' cancer journey. It is soo sad. Sadly no, I am a discord and Reddit mod and I haven't touched grass or gone outside in 8 years Some people be wildin"
}