{
    "id": "16ezmqk",
    "title": "Passport renewal query",
    "url": "https://www.reddit.com/r/india/comments/16ezmqk/passport_renewal_query/",
    "selftext": "Hello everyone!\n\nI want to renew my passport (expired in March 2023 and I am renewing it within three years of expiry).\n\nI am unsure of what all documents to a) upload and b) carry on the day of appointment.\n\nI tried calling their help desk, but the agent on the other side wasn't very helpful (and low key rude).\n\nI read the FAQs and it says that I just need to a) upload and b) carry the old passport, and c) non-ECR docs, as applicable.\n\nCan someone, who went through the renewal process, please help me with this?\n\nThank you!\n\n[Note on the document upload screen.](https://preview.redd.it/h3km3dkqdfnb1.png?width=401&format=png&auto=webp&s=db6d6704851575b3d67255e49a3e22ef38fedd2d)\n\n[Documents required as per the document advisor](https://preview.redd.it/tzkh5usudfnb1.png?width=711&format=png&auto=webp&s=31879799282ec1a2a952b7a04df5e0a533003d35)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694350537.0,
    "convurl": "https://b.thumbs.redditmedia.com/j9v3Hxx5ZHNMJnNNPt8M-eLOFF567rRHLSAqkNDBOHA.jpg",
    "comments": [
        "The instruction booklet lists all the documents you need for different scenarios: https://passportindia.gov.in/AppOnlineProject/pdf/ApplicationformInstructionBooklet-V3.0.pdf\n\nStart from Table 2 and match your scenario. \"Re-issue\" = renew. It lists the document numbers you need. Then look up the details of those document or declaration numbers in Table 3.",
        "Seems like my address is same as the older one, all I need is a self attested copy of old passport and nothing else.",
        "At a minimum. There are govt officers sitting in those centres and they have all the discretionary power to ask you anything.\n\nWhen I went for renewal, I took:\n\n1) Expiring passport\n\n2) Photos\n\n3) *Every* identity doc I had with self-attested copies because interacting with them only once is better than interacting with them twice!\n\n3) 10th marks card for DOB/age\n\n4) Voter ID, aadhar, PAN card, DL for identity + address",
        "Got it, so I'll carry these docs.",
        "Don't forget a stapler! https://www.youtube.com/watch?v=2wtbQUaC9mE",
        "Are photos required for renewal?",
        "What if the address isn't the same!",
        "Did they ask for Non-ECR proof (10th/12th) for renewal of a non-ECR passport?\n\nI have all documents with me except 10th/12th, which are in a different city. Is that mandatory if my old passport is already non-ECR?",
        "Yes, they did.\n\nCheck for alternative documents."
    ],
    "cleaned_text": "passport renewal query hello everyone want renew passport expired march renewing within three years expiry unsure documents upload b carry day appointment tried calling help desk agent side wasnt helpful low key rude read faqs says need upload b carry old passport c nonecr docs applicable someone went renewal process please help thank note document upload screenhttpspreviewreddithkmdkqdfnbpngwidthformatpngautowebpsdbdbdeaeeffeddd documents required per document advisorhttpspreviewreddittzkhusudfnbpngwidthformatpngautowebpsecaabadfead ",
    "cleaned_title": "passport renewal query",
    "cleaned_selftext": "hello everyone want renew passport expired march renewing within three years expiry unsure documents upload b carry day appointment tried calling help desk agent side wasnt helpful low key rude read faqs says need upload b carry old passport c nonecr docs applicable someone went renewal process please help thank note document upload screenhttpspreviewreddithkmdkqdfnbpngwidthformatpngautowebpsdbdbdeaeeffeddd documents required per document advisorhttpspreviewreddittzkhusudfnbpngwidthformatpngautowebpsecaabadfead",
    "cleaned_comments": "instruction booklet lists documents need different scenarios start table match scenario reissue renew lists document numbers need look details document declaration numbers table seems like address older one need self attested copy old passport nothing else minimum govt officers sitting centres discretionary power ask anything went renewal took expiring passport photos every identity doc selfattested copies interacting better interacting twice th marks card dobage voter id aadhar pan card dl identity address got ill carry docs dont forget stapler photos required renewal address isnt ask nonecr proof thth renewal nonecr passport documents except thth different city mandatory old passport already nonecr yes check alternative documents",
    "light_cleaned_title": "Passport renewal query",
    "light_cleaned_selftext": "Hello everyone! I want to renew my passport (expired in March 2023 and I am renewing it within three years of expiry). I am unsure of what all documents to a) upload and b) carry on the day of appointment. I tried calling their help desk, but the agent on the other side wasn't very helpful (and low key rude). I read the FAQs and it says that I just need to a) upload and b) carry the old passport, and c) non-ECR docs, as applicable. Can someone, who went through the renewal process, please help me with this? Thank you! [Note on the document upload screen.](https://preview.redd.it/h3km3dkqdfnb1.png?width=401&format=png&auto=webp&s=db6d6704851575b3d67255e49a3e22ef38fedd2d) [Documents required as per the document advisor](https://preview.redd.it/tzkh5usudfnb1.png?width=711&format=png&auto=webp&s=31879799282ec1a2a952b7a04df5e0a533003d35)",
    "light_cleaned_comments": "The instruction booklet lists all the documents you need for different scenarios: Start from Table 2 and match your scenario. \"Re-issue\" = renew. It lists the document numbers you need. Then look up the details of those document or declaration numbers in Table 3. Seems like my address is same as the older one, all I need is a self attested copy of old passport and nothing else. At a minimum. There are govt officers sitting in those centres and they have all the discretionary power to ask you anything. When I went for renewal, I took: 1) Expiring passport 2) Photos 3) *Every* identity doc I had with self-attested copies because interacting with them only once is better than interacting with them twice! 3) 10th marks card for DOB/age 4) Voter ID, aadhar, PAN card, DL for identity + address Got it, so I'll carry these docs. Don't forget a stapler! Are photos required for renewal? What if the address isn't the same! Did they ask for Non-ECR proof (10th/12th) for renewal of a non-ECR passport? I have all documents with me except 10th/12th, which are in a different city. Is that mandatory if my old passport is already non-ECR? Yes, they did. Check for alternative documents."
}