{
    "id": "18gqw6i",
    "title": "How China cleaned its filthy air while India continues to choke - ET EnergyWorld",
    "url": "https://energy.economictimes.indiatimes.com/news/coal/how-china-cleaned-its-filthy-air-while-india-continues-to-choke/105840705",
    "selftext": "All the cries in Delhi around pollution die the moment AQI goes below 400, where in fact it consistently remains in high 300s. \nEveryone seems to be just fine with bad air quality. It’s s astonishing how we don’t understand it’s impact on our kids life, parents health and our own health.",
    "flair": "Policy/Economy",
    "score": 30,
    "num_comments": 3,
    "created_utc": 1702401146.0,
    "convurl": "https://external-preview.redd.it/k5Pp_TFNG8wYQv0gFlks3dwtQsbsFFseqYrIL5tmVvE.jpg?auto=webp&s=0694cebc1f793e4eac495b424a660af7c19ba43b",
    "comments": [
        "India can if they want to. It’s definitely not stubble. The whole winter you can sense smog.",
        "I think the rich have industrial air purifiers at home and at the office, luxury cars and air pollution masks so their exposure to.the polluted air is so limited it is a minor inconvenience to them.\n\nAnd if any health issue arises, they have access to the best healthcare facilities. \n\nIt is the poor and the lower middle class which suffers extensively and have their lifespan reduced and their lungs impacted.",
        "Actually most of the pollution is vehicle exhaust, India still uses 20 year old diesel trucks and most of the cargo is transported via roads rather than railways."
    ],
    "cleaned_text": "china cleaned filthy air india continues choke et energyworld cries delhi around pollution die moment aqi goes fact consistently remains high everyone seems fine bad air quality astonishing dont understand impact kids life parents health health ",
    "cleaned_title": "china cleaned filthy air india continues choke et energyworld",
    "cleaned_selftext": "cries delhi around pollution die moment aqi goes fact consistently remains high everyone seems fine bad air quality astonishing dont understand impact kids life parents health health",
    "cleaned_comments": "india want definitely stubble whole winter sense smog think rich industrial air purifiers home office luxury cars air pollution masks exposure tothe polluted air limited minor inconvenience health issue arises access best healthcare facilities poor lower middle class suffers extensively lifespan reduced lungs impacted actually pollution vehicle exhaust india still uses year old diesel trucks cargo transported via roads rather railways",
    "light_cleaned_title": "How China cleaned its filthy air while India continues to choke - ET EnergyWorld",
    "light_cleaned_selftext": "All the cries in Delhi around pollution die the moment AQI goes below 400, where in fact it consistently remains in high 300s. Everyone seems to be just fine with bad air quality. It’s s astonishing how we don’t understand it’s impact on our kids life, parents health and our own health.",
    "light_cleaned_comments": "India can if they want to. It’s definitely not stubble. The whole winter you can sense smog. I think the rich have industrial air purifiers at home and at the office, luxury cars and air pollution masks so their exposure to.the polluted air is so limited it is a minor inconvenience to them. And if any health issue arises, they have access to the best healthcare facilities. It is the poor and the lower middle class which suffers extensively and have their lifespan reduced and their lungs impacted. Actually most of the pollution is vehicle exhaust, India still uses 20 year old diesel trucks and most of the cargo is transported via roads rather than railways."
}