{
    "id": "1bljthe",
    "title": "Are SC/ST people getting more hate because of reservation?",
    "url": "https://www.reddit.com/gallery/1bljthe",
    "selftext": "gen z urban uc casteism is solely a product of reservations. Can't expect ppl to consistently score 90%+ marks and lose to people scoring 37% and still not care. What do you guys think?",
    "flair": "Rant / Vent",
    "score": 6,
    "num_comments": 25,
    "created_utc": 1711168673.0,
    "convurl": "https://i.redd.it/8sjlnt20j0qc1.jpg",
    "comments": [
        "I believe the people of SC and ST who have raised their living standard ( government should make some standards) should be exempted from reservations.",
        "Who cares about UCs.. They are a minority community",
        "It’s not due to reservations but it’s due that even if the family have good social status still they are availing reservations and there are more candidates who needs it. So in my college there was this guy he was the first one from his family to get graduated from college and no one said anything for him as everyone knew his hardship. But on the other hand there was this girl her father owned 2 factory in tier 2 city so which means she was rich and still was using reservation",
        "Yes, of course. GC are so hateful towards SC/ST. They keep their mouth sut towards OBC. Because if they mess with obc they'll ll get into trouble no matter who they are. Even technically they should be hateful towards obc only but they won't be. spineless chaddis in internet will mock Dr.BR and reservations.",
        "Can you really blame them though. Think about it from the mindset of an 18 year old, UC candidate must score below 1000 AIR to get into a top college, while they are in the same class with 20K+ rank mates...   \nIt would be demoralizing.",
        "But they carry same attitude even when get to 30 y old",
        "Same people whose parents would do honour killing if they found their child dating an SC/ST person, are the ones who complain about reservation.",
        "Reservation is largely fair imo. Most people belonging to lower castes do face discrimination to this day and aren't well of barring a tiny minority. It's just the tiny minority that these UC kids see and erroneously conclude that reservation is basically vote-bank politics tactic. Which it might be ofc to a certain extent. But it largely isn't. Also, the overall net outcome of reservation is that the people getting seats are deserving and there are a few people who get reservation despite being economically well off and not having faced any sort of discrimination ever. So, ofc there are shortcomings in this arrangement. Shouldn't we think of better alternatives to make it fairer instead of demanding reservation be quashed and hating on lower castes. Also, it is worth asking to what degree should relaxation in terms of marks be given rather than asking for an all-out removal of any sort of caste-based discrimination. \n\n\nThis whole reservation debate, assuming the caste hatred amongst Gen Z is purely due to that, is because of a difference in the exposure. Kids who have witnessed the discrimination firsthand or belong to lower caste themselves do know that it's needed to a certain extent. Kids who live in urban bubbles and are further fed the casteist propaganda ofc oppose reservation vehemently.",
        "reservation increased more racism than usual fr",
        "I disagree. Let us accept that being hateful is in our nature. We just don’t want to see the actual truth and make reasons to hate. Saying reservation is the reason for hate is just cheating our conscience. \n\nI am not from SC/ST community, but am willing to accept what is truth. Caste hates exist irrespective of the economic status. A state in USA recently brought an act against caste discrimination due to us Indians. \n\nHate against Muslims and Sikhs have increased recently even when there is no reservation. \n\nPeople from Bihar receives most hate within India and Bihar doesn’t get any reservation. Whatever Biharis achieve is due to their hard work. \n\nWe Indians cry when we receive hate from many other countries but hypocritically do the same thing inside the country.",
        "What wrong they said ?",
        "Let me put it this way , they are still getting hate. Likr they used to before reservation ever existed. Reservation is not the culprits here Savarna Bigots are.",
        "Oh fuck off...",
        "EWS",
        "Fuck off this was has been an issue since 1000s of years.",
        "The people who take advantage of reservation despite being very well off are outright scum. Government should have properly implemented this to prevent its misuse.\n\n\nRecently there was a case of fake pwd certificate. THE GUY got a seat in IIT MADRAS by a fake pwd certificate. I hate this shit. This guy just took a seat of a disabled candidate, he also has a youtube channel with 300k subscribers. he was exposed in jeeneetards sub.\n\n\nThe people who need reservation are not able to utilise it properly while vile people like him take advantage of it.",
        "It isn't an India specific problem. You haven't been outside India perhaps. Or maybe never looked enough for the kind of discrimination that happens outside. Sure, India is worse than many countries. But I beg to disagree that being hateful is in our nature.",
        "They're 18 preparing for NEET/JEE and other similar exams where the cutoffs for SC/ST goes 10 times below UR. Also, they still get these benefits even if they're top capitalists and highly influential.",
        "My friend has neighbors, wife is a doctor, husband is a JE, still they have reservation. Shouldn't it be terminated after a certain annual income? Now, this is what triggers me.",
        "There is a harsh truth you need to hear. I have seen so many well off  people availing the SC ST reservation in IITs. Apart from the seat itself (which is the most important here), they also pay zero tuition fee and zero hostel fee. On top of that they get a scholarship which means they get about 20k per semester in stipend (the IITs basically pay them to study there)\n\nDespite all this, a lot of reservation candidates drop out of college because they can't complete the courses (you can check this with any of your friends at IITs). The curriculum is too tough for many of them.\n\nConsidering that the entrance exams after 12th are the only chance in life for many poor general students to lift their families out of poverty, I think the hate towards the wealthy SC ST families availing reservation is justified.",
        "Absolutely right bro. I lived in Ranchi (Capital of Jharkhand). It is a city of tribal people and what i experienced there makes me hate these tribal people. When i was in college, the Jharkhand government used to provide scholarships to OBC/SC/ST but only to those who comes from EWS (Economic weaker section). Apart from a few OBC and SC, all these ST people coming to college on KTM with fake income certificate and applying for scholarship. \n\nI am not against reservation. I just hate the part where people who have already achieved social and financial status and are still applying for reservation.",
        "Agreed with you. Being hateful is a human nature. It exists irrespective of geography and community. I just was focusing on India in my comment in general and hence the misunderstanding.",
        "Well, the whole “shystum” cares for UCs. Don’t get upset.",
        "Caste based reservation is a complete non sense. It should be income based, poor people have troubles irrespective of the caste they belong to.",
        "Absolutely agree\n\n\nThe people who take advantage of reservation despite being very well off are outright scum. Government should have properly implemented this to prevent its misuse. Recently there was a case of fake pwd certificate. THE GUY got a seat in IIT MADRAS by a fake pwd certificate. I hate this shit. This guy just took a seat of a disabled candidate, he also has a youtube channel with 300k subscribers. he was exposed in jeeneetards sub. The people who need reservation are not able to utilise it properly while vile people like him take advantage of it.",
        "I hate it more when people support their wrong doings to support the reservation.",
        "That's because even a year wasted will affect your whole life. Not only college but in jobs and even promotions a GEN category has to sacrifice his talents his whole life. It's actually very frustrating for a GEN category student. Our whole life, we feel that we are talented and hardworking and we are not able to utilise our abilities.\nWe can't describe it in words about how we feel due to reservations.\nThis frustration unfortunately comes through verbal abuse.",
        "No",
        "Reason for reservations was never financial. It exists because of social discrimination. \nWant to end reservations? then marry people from SC and ST communities and until you can't see them as a potential partner or a member of your family just stop complaining about reservations.",
        "[https://thewire.in/education/casteism-rampant-higher-education-institutions-wilfully-neglected-study](https://thewire.in/education/casteism-rampant-higher-education-institutions-wilfully-neglected-study)\n\nAs per the study, the opposition to reservation is used by the so-called high castes to supposedly ‘save merit’ while discrediting, discriminating and humiliating people from oppressed social backgrounds for exercising their due right. However, this argument to ‘save merit’ is totally absent in the case of management quota or paid seats.\n\nIn fact, some students who got admitted through reservation were among the top 10 in various examinations, the study says. However, the caste-based discrimination against them doesn’t stop, even after they have proven their ‘merit’.\n\nFurther, the study underscores the failure of the implementation and non-compliance of various UGC regulations, government and court reports on the issue by the Indian higher education institutions leading to a large number of drop-outs and even suicides by those affected.\n\nAt the same time, the study deals with the issue of privatisation of higher education in India at the expense of public education which has adversely affected the overall prospects for oppressed social groups to break their vicious cycle of exploitation. The lack of the policy of reservation to ensure social justice and representation of the oppressed combined with exorbitant fees makes such private education institutions inaccessible and exclusive.",
        "Same thing man like they behave like entitled brat under the name of dr Babasaheb Ambedkar. If they read him they’ll understand why he gave the reservations in the first place. I respect that guy for the hardship he went through and still achieved something great"
    ],
    "cleaned_text": "scst people getting hate reservation gen z urban uc casteism solely product reservations cant expect ppl consistently score marks lose people scoring still care guys think ",
    "cleaned_title": "scst people getting hate reservation",
    "cleaned_selftext": "gen z urban uc casteism solely product reservations cant expect ppl consistently score marks lose people scoring still care guys think",
    "cleaned_comments": "believe people sc st raised living standard government make standards exempted reservations cares ucs minority community due reservations due even family good social status still availing reservations candidates needs college guy first one family get graduated college one said anything everyone knew hardship hand girl father owned factory tier city means rich still using reservation yes course gc hateful towards scst keep mouth sut towards obc mess obc theyll get trouble matter even technically hateful towards obc wont spineless chaddis internet mock drbr reservations really blame though think mindset year old uc candidate must score air get top college class k rank mates would demoralizing carry attitude even get old people whose parents would honour killing found child dating scst person ones complain reservation reservation largely fair imo people belonging lower castes face discrimination day arent well barring tiny minority tiny minority uc kids see erroneously conclude reservation basically votebank politics tactic might ofc certain extent largely isnt also overall net outcome reservation people getting seats deserving people get reservation despite economically well faced sort discrimination ever ofc shortcomings arrangement shouldnt think better alternatives make fairer instead demanding reservation quashed hating lower castes also worth asking degree relaxation terms marks given rather asking allout removal sort castebased discrimination whole reservation debate assuming caste hatred amongst gen z purely due difference exposure kids witnessed discrimination firsthand belong lower caste know needed certain extent kids live urban bubbles fed casteist propaganda ofc oppose reservation vehemently reservation increased racism usual fr disagree let us accept hateful nature dont want see actual truth make reasons hate saying reservation reason hate cheating conscience scst community willing accept truth caste hates exist irrespective economic status state usa recently brought act caste discrimination due us indians hate muslims sikhs increased recently even reservation people bihar receives hate within india bihar doesnt get reservation whatever biharis achieve due hard work indians cry receive hate many countries hypocritically thing inside country wrong said let put way still getting hate likr used reservation ever existed reservation culprits savarna bigots oh fuck ews fuck issue since years people take advantage reservation despite well outright scum government properly implemented prevent misuse recently case fake pwd certificate guy got seat iit madras fake pwd certificate hate shit guy took seat disabled candidate also youtube channel k subscribers exposed jeeneetards sub people need reservation able utilise properly vile people like take advantage isnt india specific problem havent outside india perhaps maybe never looked enough kind discrimination happens outside sure india worse many countries beg disagree hateful nature theyre preparing neetjee similar exams cutoffs scst goes times ur also still get benefits even theyre top capitalists highly influential friend neighbors wife doctor husband je still reservation shouldnt terminated certain annual income triggers harsh truth need hear seen many well people availing sc st reservation iits apart seat important also pay zero tuition fee zero hostel fee top get scholarship means get k per semester stipend iits basically pay study despite lot reservation candidates drop college cant complete courses check friends iits curriculum tough many considering entrance exams th chance life many poor general students lift families poverty think hate towards wealthy sc st families availing reservation justified absolutely right bro lived ranchi capital jharkhand city tribal people experienced makes hate tribal people college jharkhand government used provide scholarships obcscst comes ews economic weaker section apart obc sc st people coming college ktm fake income certificate applying scholarship reservation hate part people already achieved social financial status still applying reservation agreed hateful human nature exists irrespective geography community focusing india comment general hence misunderstanding well whole shystum cares ucs dont get upset caste based reservation complete non sense income based poor people troubles irrespective caste belong absolutely agree people take advantage reservation despite well outright scum government properly implemented prevent misuse recently case fake pwd certificate guy got seat iit madras fake pwd certificate hate shit guy took seat disabled candidate also youtube channel k subscribers exposed jeeneetards sub people need reservation able utilise properly vile people like take advantage hate people support wrong doings support reservation thats even year wasted affect whole life college jobs even promotions gen category sacrifice talents whole life actually frustrating gen category student whole life feel talented hardworking able utilise abilities cant describe words feel due reservations frustration unfortunately comes verbal abuse reason reservations never financial exists social discrimination want end reservations marry people sc st communities cant see potential partner member family stop complaining reservations httpsthewireineducationcasteismrampanthighereducationinstitutionswilfullyneglectedstudyhttpsthewireineducationcasteismrampanthighereducationinstitutionswilfullyneglectedstudy per study opposition reservation used socalled high castes supposedly save merit discrediting discriminating humiliating people oppressed social backgrounds exercising due right however argument save merit totally absent case management quota paid seats fact students got admitted reservation among top various examinations study says however castebased discrimination doesnt stop even proven merit study underscores failure implementation noncompliance various ugc regulations government court reports issue indian higher education institutions leading large number dropouts even suicides affected time study deals issue privatisation higher education india expense public education adversely affected overall prospects oppressed social groups break vicious cycle exploitation lack policy reservation ensure social justice representation oppressed combined exorbitant fees makes private education institutions inaccessible exclusive thing man like behave like entitled brat name dr babasaheb ambedkar read theyll understand gave reservations first place respect guy hardship went still achieved something great",
    "light_cleaned_title": "Are SC/ST people getting more hate because of reservation?",
    "light_cleaned_selftext": "gen z urban uc casteism is solely a product of reservations. Can't expect ppl to consistently score 90%+ marks and lose to people scoring 37% and still not care. What do you guys think?",
    "light_cleaned_comments": "I believe the people of SC and ST who have raised their living standard ( government should make some standards) should be exempted from reservations. Who cares about UCs.. They are a minority community It’s not due to reservations but it’s due that even if the family have good social status still they are availing reservations and there are more candidates who needs it. So in my college there was this guy he was the first one from his family to get graduated from college and no one said anything for him as everyone knew his hardship. But on the other hand there was this girl her father owned 2 factory in tier 2 city so which means she was rich and still was using reservation Yes, of course. GC are so hateful towards SC/ST. They keep their mouth sut towards OBC. Because if they mess with obc they'll ll get into trouble no matter who they are. Even technically they should be hateful towards obc only but they won't be. spineless chaddis in internet will mock Dr.BR and reservations. Can you really blame them though. Think about it from the mindset of an 18 year old, UC candidate must score below 1000 AIR to get into a top college, while they are in the same class with 20K+ rank mates... It would be demoralizing. But they carry same attitude even when get to 30 y old Same people whose parents would do honour killing if they found their child dating an SC/ST person, are the ones who complain about reservation. Reservation is largely fair imo. Most people belonging to lower castes do face discrimination to this day and aren't well of barring a tiny minority. It's just the tiny minority that these UC kids see and erroneously conclude that reservation is basically vote-bank politics tactic. Which it might be ofc to a certain extent. But it largely isn't. Also, the overall net outcome of reservation is that the people getting seats are deserving and there are a few people who get reservation despite being economically well off and not having faced any sort of discrimination ever. So, ofc there are shortcomings in this arrangement. Shouldn't we think of better alternatives to make it fairer instead of demanding reservation be quashed and hating on lower castes. Also, it is worth asking to what degree should relaxation in terms of marks be given rather than asking for an all-out removal of any sort of caste-based discrimination. This whole reservation debate, assuming the caste hatred amongst Gen Z is purely due to that, is because of a difference in the exposure. Kids who have witnessed the discrimination firsthand or belong to lower caste themselves do know that it's needed to a certain extent. Kids who live in urban bubbles and are further fed the casteist propaganda ofc oppose reservation vehemently. reservation increased more racism than usual fr I disagree. Let us accept that being hateful is in our nature. We just don’t want to see the actual truth and make reasons to hate. Saying reservation is the reason for hate is just cheating our conscience. I am not from SC/ST community, but am willing to accept what is truth. Caste hates exist irrespective of the economic status. A state in USA recently brought an act against caste discrimination due to us Indians. Hate against Muslims and Sikhs have increased recently even when there is no reservation. People from Bihar receives most hate within India and Bihar doesn’t get any reservation. Whatever Biharis achieve is due to their hard work. We Indians cry when we receive hate from many other countries but hypocritically do the same thing inside the country. What wrong they said ? Let me put it this way , they are still getting hate. Likr they used to before reservation ever existed. Reservation is not the culprits here Savarna Bigots are. Oh fuck off... EWS Fuck off this was has been an issue since 1000s of years. The people who take advantage of reservation despite being very well off are outright scum. Government should have properly implemented this to prevent its misuse. Recently there was a case of fake pwd certificate. THE GUY got a seat in IIT MADRAS by a fake pwd certificate. I hate this shit. This guy just took a seat of a disabled candidate, he also has a youtube channel with 300k subscribers. he was exposed in jeeneetards sub. The people who need reservation are not able to utilise it properly while vile people like him take advantage of it. It isn't an India specific problem. You haven't been outside India perhaps. Or maybe never looked enough for the kind of discrimination that happens outside. Sure, India is worse than many countries. But I beg to disagree that being hateful is in our nature. They're 18 preparing for NEET/JEE and other similar exams where the cutoffs for SC/ST goes 10 times below UR. Also, they still get these benefits even if they're top capitalists and highly influential. My friend has neighbors, wife is a doctor, husband is a JE, still they have reservation. Shouldn't it be terminated after a certain annual income? Now, this is what triggers me. There is a harsh truth you need to hear. I have seen so many well off people availing the SC ST reservation in IITs. Apart from the seat itself (which is the most important here), they also pay zero tuition fee and zero hostel fee. On top of that they get a scholarship which means they get about 20k per semester in stipend (the IITs basically pay them to study there) Despite all this, a lot of reservation candidates drop out of college because they can't complete the courses (you can check this with any of your friends at IITs). The curriculum is too tough for many of them. Considering that the entrance exams after 12th are the only chance in life for many poor general students to lift their families out of poverty, I think the hate towards the wealthy SC ST families availing reservation is justified. Absolutely right bro. I lived in Ranchi (Capital of Jharkhand). It is a city of tribal people and what i experienced there makes me hate these tribal people. When i was in college, the Jharkhand government used to provide scholarships to OBC/SC/ST but only to those who comes from EWS (Economic weaker section). Apart from a few OBC and SC, all these ST people coming to college on KTM with fake income certificate and applying for scholarship. I am not against reservation. I just hate the part where people who have already achieved social and financial status and are still applying for reservation. Agreed with you. Being hateful is a human nature. It exists irrespective of geography and community. I just was focusing on India in my comment in general and hence the misunderstanding. Well, the whole “shystum” cares for UCs. Don’t get upset. Caste based reservation is a complete non sense. It should be income based, poor people have troubles irrespective of the caste they belong to. Absolutely agree The people who take advantage of reservation despite being very well off are outright scum. Government should have properly implemented this to prevent its misuse. Recently there was a case of fake pwd certificate. THE GUY got a seat in IIT MADRAS by a fake pwd certificate. I hate this shit. This guy just took a seat of a disabled candidate, he also has a youtube channel with 300k subscribers. he was exposed in jeeneetards sub. The people who need reservation are not able to utilise it properly while vile people like him take advantage of it. I hate it more when people support their wrong doings to support the reservation. That's because even a year wasted will affect your whole life. Not only college but in jobs and even promotions a GEN category has to sacrifice his talents his whole life. It's actually very frustrating for a GEN category student. Our whole life, we feel that we are talented and hardworking and we are not able to utilise our abilities. We can't describe it in words about how we feel due to reservations. This frustration unfortunately comes through verbal abuse. No Reason for reservations was never financial. It exists because of social discrimination. Want to end reservations? then marry people from SC and ST communities and until you can't see them as a potential partner or a member of your family just stop complaining about reservations. [https://thewire.in/education/casteism-rampant-higher-education-institutions-wilfully-neglected-study](https://thewire.in/education/casteism-rampant-higher-education-institutions-wilfully-neglected-study) As per the study, the opposition to reservation is used by the so-called high castes to supposedly ‘save merit’ while discrediting, discriminating and humiliating people from oppressed social backgrounds for exercising their due right. However, this argument to ‘save merit’ is totally absent in the case of management quota or paid seats. In fact, some students who got admitted through reservation were among the top 10 in various examinations, the study says. However, the caste-based discrimination against them doesn’t stop, even after they have proven their ‘merit’. Further, the study underscores the failure of the implementation and non-compliance of various UGC regulations, government and court reports on the issue by the Indian higher education institutions leading to a large number of drop-outs and even suicides by those affected. At the same time, the study deals with the issue of privatisation of higher education in India at the expense of public education which has adversely affected the overall prospects for oppressed social groups to break their vicious cycle of exploitation. The lack of the policy of reservation to ensure social justice and representation of the oppressed combined with exorbitant fees makes such private education institutions inaccessible and exclusive. Same thing man like they behave like entitled brat under the name of dr Babasaheb Ambedkar. If they read him they’ll understand why he gave the reservations in the first place. I respect that guy for the hardship he went through and still achieved something great"
}