{
    "id": "16d59rp",
    "title": "DM who brought water to Uttar Pradesh village shunted out, put on waiting list",
    "url": "https://indianexpress.com/article/cities/lucknow/dm-who-brought-water-to-uttar-pradesh-village-shunted-out-put-on-waiting-list-8929657/",
    "selftext": "Non paywalled link: https://12ft.io/proxy?q=https%3A%2F%2Findianexpress.com%2Farticle%2Fcities%2Flucknow%2Fdm-who-brought-water-to-uttar-pradesh-village-shunted-out-put-on-waiting-list-8929657%2F+++",
    "flair": "Politics",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1694163226.0,
    "convurl": "https://external-preview.redd.it/AqXPRQ7WqEi2tRFE-yO6YPMi_cQiU-orm0xuAktz17o.jpg?auto=webp&s=d2715604dfbf17168d228811b7a113e7e5f573cd",
    "comments": [
        "Punished for not singing supreme leader's praises\n\n>Following the “jal pujan”, local BJP leader Vipul Singh, the district’s vice-president of the party, had written a letter to Chief Minister Yogi Adityanath, complaining about Mittal. Speaking to The Indian Express, Singh said, “Lahuria village has had water issues for ages and tankers have to be deployed. It is under the ‘Har Ghar Jal Yojana’ that the Prime Minister and Chief Minister launched the scheme here and water reached the village. It is the District Magistrate’s responsibility to ensure that the scheme is implemented and water reaches villages. But the inauguration has to be done by someone from the government. This is the protocol, and culture too. The local MLA, MP, and others were not invited.Now, if such a thing is done, it is something to feel bad about.”\n\n>On September 4, the pipe supplying water to the village was broken by “anti-social elements” and the supply stopped once again. Though the village head filed a police complaint, for now Lahuria Dah has no choice but to wait, once more, for water.\n\n\n>for villagers, news of Mittal’s transfer has been just as bitter..... “like a loved one had left, and chulhas were not lit that night”.\n\n>Lahuria Dah ... population of around 1,500 ... falls in the most backward regions of eastern UP. ......inhabited mostly by members of the Dalit community, with some Yadav and Baniya homes.\n\n>Kaushalendra Kumar Gupta, the village head for Devhat, which comprises 15 small villages including Lahuria Dah, said most of the funds meant for development are spent on providing water through tankers to that village. “One tanker that comes here costs Rs 800. And generally, eight-ten tankers are needed each day. In summer, the need increases to 10-15. Devhat gram sabha is currently in debt of Rs 20 lakh because we have been paying for water from private tankers,” said Gupta (47), who was elected village head in 2021.\n\n>“Since becoming pradhan, I have written to everyone – MP, MLA, ministers. But no one heard us. False promises were made. The new DM came and I wrote to her, and she came here on November 2 last year. She promised she would give us water. And today, you can see that each house has taps and a water connection,”\n\n>Such has been the reputation of Lahuria Dah that outsiders refrain from marrying their sons and daughters to residents of the village. “After all, everyone knows the village doesn’t have water,” ...... “Divya madam ne jo kar diya who koi nahi kar pata (No one else could have done what she did).”\n\n>Lahuria Dah falls under Mirzapur Lok Sabha constituency and Chhanbey Assembly constituency – both with BJP ally Apna Dal (S). While Mirzapur MP is Union Minister Anupriya Patel, Chhanbey’s MLA is Rinki Kol.\n\n>On the day of her farewell, villagers of Lahuria Dah arranged five cars to take 30-40 people to the district headquarters, while people from across Mirzapur gathered to thank her. A video clip showed rose petals being showered on her, and a tearful Mittal thanking people.\n\n>Mittal, who has an MBA from IIM Bangalore and did her B.Tech from IIT Delhi, had quit her job as an exotic derivatives trader in London to join the civil services. “What do I say? This is an emotional moment for me… I am very happy that water has reached the village,” she told mediapersons earlier.",
        "Hence, look after what's best for your family. The country isn't going to thank you for all your work.",
        "No good deed go unpunished in Kartavya Kal",
        "We're in bad situation because good people don't speak and bad people get to enjoy.",
        "Water tanker lobby took steps to save their business.\n\nI fear this model might become more widespread in the coming decade in rural India.",
        "The people did thank her though. its the corruption that's holding her back. But you have to face hurdles to achieve something good everywhere.",
        "Mittal, who has an MBA from IIM Bangalore and did her B.Tech from IIT Delhi, had quit her job as an exotic derivatives trader in London to join the civil services."
    ],
    "cleaned_text": "dm brought water uttar pradesh village shunted put waiting list non paywalled link ",
    "cleaned_title": "dm brought water uttar pradesh village shunted put waiting list",
    "cleaned_selftext": "non paywalled link",
    "cleaned_comments": "punished singing supreme leaders praises following jal pujan local bjp leader vipul singh districts vicepresident party written letter chief minister yogi adityanath complaining mittal speaking indian express singh said lahuria village water issues ages tankers deployed har ghar jal yojana prime minister chief minister launched scheme water reached village district magistrates responsibility ensure scheme implemented water reaches villages inauguration done someone government protocol culture local mla mp others invitednow thing done something feel bad september pipe supplying water village broken antisocial elements supply stopped though village head filed police complaint lahuria dah choice wait water villagers news mittals transfer bitter like loved one left chulhas lit night lahuria dah population around falls backward regions eastern inhabited mostly members dalit community yadav baniya homes kaushalendra kumar gupta village head devhat comprises small villages including lahuria dah said funds meant development spent providing water tankers village one tanker comes costs rs generally eightten tankers needed day summer need increases devhat gram sabha currently debt rs lakh paying water private tankers said gupta elected village head since becoming pradhan written everyone mp mla ministers one heard us false promises made new dm came wrote came november last year promised would give us water today see house taps water connection reputation lahuria dah outsiders refrain marrying sons daughters residents village everyone knows village doesnt water divya madam ne jo kar diya koi nahi kar pata one else could done lahuria dah falls mirzapur lok sabha constituency chhanbey assembly constituency bjp ally apna dal mirzapur mp union minister anupriya patel chhanbeys mla rinki kol day farewell villagers lahuria dah arranged five cars take people district headquarters people across mirzapur gathered thank video clip showed rose petals showered tearful mittal thanking people mittal mba iim bangalore btech iit delhi quit job exotic derivatives trader london join civil services say emotional moment happy water reached village told mediapersons earlier hence look whats best family country isnt going thank work good deed go unpunished kartavya kal bad situation good people dont speak bad people get enjoy water tanker lobby took steps save business fear model might become widespread coming decade rural india people thank though corruption thats holding back face hurdles achieve something good everywhere mittal mba iim bangalore btech iit delhi quit job exotic derivatives trader london join civil services",
    "light_cleaned_title": "DM who brought water to Uttar Pradesh village shunted out, put on waiting list",
    "light_cleaned_selftext": "Non paywalled link:",
    "light_cleaned_comments": "Punished for not singing supreme leader's praises >Following the “jal pujan”, local BJP leader Vipul Singh, the district’s vice-president of the party, had written a letter to Chief Minister Yogi Adityanath, complaining about Mittal. Speaking to The Indian Express, Singh said, “Lahuria village has had water issues for ages and tankers have to be deployed. It is under the ‘Har Ghar Jal Yojana’ that the Prime Minister and Chief Minister launched the scheme here and water reached the village. It is the District Magistrate’s responsibility to ensure that the scheme is implemented and water reaches villages. But the inauguration has to be done by someone from the government. This is the protocol, and culture too. The local MLA, MP, and others were not invited.Now, if such a thing is done, it is something to feel bad about.” >On September 4, the pipe supplying water to the village was broken by “anti-social elements” and the supply stopped once again. Though the village head filed a police complaint, for now Lahuria Dah has no choice but to wait, once more, for water. >for villagers, news of Mittal’s transfer has been just as bitter..... “like a loved one had left, and chulhas were not lit that night”. >Lahuria Dah ... population of around 1,500 ... falls in the most backward regions of eastern UP. ......inhabited mostly by members of the Dalit community, with some Yadav and Baniya homes. >Kaushalendra Kumar Gupta, the village head for Devhat, which comprises 15 small villages including Lahuria Dah, said most of the funds meant for development are spent on providing water through tankers to that village. “One tanker that comes here costs Rs 800. And generally, eight-ten tankers are needed each day. In summer, the need increases to 10-15. Devhat gram sabha is currently in debt of Rs 20 lakh because we have been paying for water from private tankers,” said Gupta (47), who was elected village head in 2021. >“Since becoming pradhan, I have written to everyone – MP, MLA, ministers. But no one heard us. False promises were made. The new DM came and I wrote to her, and she came here on November 2 last year. She promised she would give us water. And today, you can see that each house has taps and a water connection,” >Such has been the reputation of Lahuria Dah that outsiders refrain from marrying their sons and daughters to residents of the village. “After all, everyone knows the village doesn’t have water,” ...... “Divya madam ne jo kar diya who koi nahi kar pata (No one else could have done what she did).” >Lahuria Dah falls under Mirzapur Lok Sabha constituency and Chhanbey Assembly constituency – both with BJP ally Apna Dal (S). While Mirzapur MP is Union Minister Anupriya Patel, Chhanbey’s MLA is Rinki Kol. >On the day of her farewell, villagers of Lahuria Dah arranged five cars to take 30-40 people to the district headquarters, while people from across Mirzapur gathered to thank her. A video clip showed rose petals being showered on her, and a tearful Mittal thanking people. >Mittal, who has an MBA from IIM Bangalore and did her B.Tech from IIT Delhi, had quit her job as an exotic derivatives trader in London to join the civil services. “What do I say? This is an emotional moment for me… I am very happy that water has reached the village,” she told mediapersons earlier. Hence, look after what's best for your family. The country isn't going to thank you for all your work. No good deed go unpunished in Kartavya Kal We're in bad situation because good people don't speak and bad people get to enjoy. Water tanker lobby took steps to save their business. I fear this model might become more widespread in the coming decade in rural India. The people did thank her though. its the corruption that's holding her back. But you have to face hurdles to achieve something good everywhere. Mittal, who has an MBA from IIM Bangalore and did her B.Tech from IIT Delhi, had quit her job as an exotic derivatives trader in London to join the civil services."
}