{
    "id": "16bepio",
    "title": "This is how Indian Illegal immigrants enter USA. Sick mentality.",
    "url": "https://youtu.be/SPZycfHax0k?si=JPp2UYwmSZsLLw49",
    "selftext": "Mostly people from the northern belt (Punjab, Haryana, Gujurat) take this illegal route. Just search \"Donkey Process\" on YouTube and you'll find hundreds of videos related to this topic. This guy has an entire channel revolving around this topic. Vlogs and stuff. And people in the comment are congratulating and wishing him luck lmao. I can't wrap my head around it",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693989139.0,
    "convurl": "https://external-preview.redd.it/4NDCpNrmQ9_uPc0DQubZlgpWNDPbwu7dOkBMCv8dkIo.jpg?auto=webp&s=df3dc66b8aaa049dba45f6c74d2d109aab07bf36",
    "comments": [
        "Just go to canada"
    ],
    "cleaned_text": "indian illegal immigrants enter usa sick mentality mostly people northern belt punjab haryana gujurat take illegal route search donkey process youtube youll find hundreds videos related topic guy entire channel revolving around topic vlogs stuff people comment congratulating wishing luck lmao cant wrap head around ",
    "cleaned_title": "indian illegal immigrants enter usa sick mentality",
    "cleaned_selftext": "mostly people northern belt punjab haryana gujurat take illegal route search donkey process youtube youll find hundreds videos related topic guy entire channel revolving around topic vlogs stuff people comment congratulating wishing luck lmao cant wrap head around",
    "cleaned_comments": "go canada",
    "light_cleaned_title": "This is how Indian Illegal immigrants enter USA. Sick mentality.",
    "light_cleaned_selftext": "Mostly people from the northern belt (Punjab, Haryana, Gujurat) take this illegal route. Just search \"Donkey Process\" on YouTube and you'll find hundreds of videos related to this topic. This guy has an entire channel revolving around this topic. Vlogs and stuff. And people in the comment are congratulating and wishing him luck lmao. I can't wrap my head around it",
    "light_cleaned_comments": "Just go to canada"
}