{
    "id": "1aoy07y",
    "title": "Budget Session 2024: A Digital Rights Review",
    "url": "https://www.reddit.com/r/india/comments/1aoy07y/budget_session_2024_a_digital_rights_review/",
    "selftext": " \n\n[https:\\/\\/internetfreedom.in\\/donate\\/](https://preview.redd.it/06st1vwl45ic1.png?width=1600&format=png&auto=webp&s=eb300349bc57e06c3d24a18bc939dda3f8132edd)\n\n## tl;dr\n\nBoth houses of the Parliament were adjourned  sine die on February 10, 2024, concluding the 2024 Budget Session one  day after the scheduled end date of February 09, and the last  parliamentary session for the 17th Lok Sabha. During this Session, 10  new bills were introduced for passing, of which 12 were passed by both  houses, 1 pending passage in the Rajya Sabha, with a total of 24 bills  pending after the conclusion of the session. The Union Interim Budget  for 2024-25 was presented and passed. We see increased budgetary  allocations in the budget for MeitY, MHA, MIB and DoT as compared to the  2023-2024 Budget, which is a good starting point for building and  implementing robust digital systems. Discussions on the floor of the  parliament spanned several issues, including those relevant to digital  rights and freedoms.\n\n## Background\n\nThe 15th  Parliamentary Session of the 17th Lok Sabha was adjourned sine die on  February 10, 2024, concluding one day after the scheduled end date of  February 09. This marks the last parliamentary sitting for the 17th Lok  Sabha, as we prepare to elect a new government in the upcoming general  elections. In the session, Union Minister Nirmala Sitharaman presented  the Union Interim Budget for the Financial Year (“FY”) 2024-2025, which  was passed in both houses. The budget is an interim allocation of funds  until India forms a new union government in the 2024 Lok Sabha  elections, post which a full budget will be placed in both houses for  deliberation again in July 2024. A cumulative sum of ₹1,43,337.88 Cr has  been allotted to the Ministry of Electronics and Information Technology  (MeitY), the Ministry of Information and Broadcasting (MIB), the  Department of Telecommunications (DoT), and Ministry of Home Affairs  (MHA). See our detailed analysis of the budget for these ministries in [this blogpost](https://internetfreedom.in/budget-2024-part-ii/?ref=static.internetfreedom.in).\n\nBoth  houses introduced 10 bills, passed 12 and withdrew none. The bills  passed in both houses and now awaiting presidential assent include the  Finance Bill, 2024 which gives effect to tax proposals of the central  government for the year 2024-25 and 5 Appropriation Bills. The other  bills passed are the Water (Prevention and Control of Pollution),  Amendment Bill, 2024, Public Examination (Prevention of Unfair Means)  Bill, 2024, Jammu and Kashmir Local Bodies Laws (Amendment) Bill, 2024,  Constitution (Scheduled Tribes) Order (Amendment) Bill, 2024,  Constitution (Scheduled Castes and Scheduled Tribes) Orders (Amendment)  Bill, 2024, Constitution (Jammu and Kashmir) Scheduled Castes Order  (Amendment) Bill, 2023; Constitution (Jammu and Kashmir) Scheduled  Tribes Order (Amendment) Bill, 2023. Read more about this session’s  legislative business [here](https://prsindia.org/files/parliament/session_track/2024/session_wrap/Session_Wrap-Budget_Session_2024.pdf?ref=static.internetfreedom.in).\n\nThe  Lok Sabha and Rajya Sabha observed productivity rates of 148% and 137%  respectively. However, a majority of their time (44-47%) was spent  discussing non-legislative business, and a fraction of time (8-9%)  actually went into discussing and answering questions. While the Union  Interim Budget was passed after 7 hours 6 minutes of discussion in the  Lok Sabha and 6 hours 37 minutes discussion in the Rajya Sabha, both  houses spent between 3-5 hours discussing agenda item 'Historic  construction of Shree Ram Temple and Pran Pratishta' on the final day of  the Parliament. These statistics are available [here](https://prsindia.org/sessiontrack/budget-session-2024/productivity?ref=static.internetfreedom.in) and [here](https://prsindia.org/sessiontrack/budget-session-2024/important-issues?ref=static.internetfreedom.in).\n\n## Quick overview: Union Interim Budget 2024-25\n\nUnion  Interim Budget for FY 2024-25 has cumulatively allotted ₹1,43,337.88 Cr  to the Ministry of Electronics and Information Technology (MeitY), the  Ministry of Information and Broadcasting (MIB), the Department of  Telecommunications (DoT), and Ministry of Home Affairs (MHA). A glance  at Ministry-wise Budget Estimates (“BE”) and Revised Estimates (“RE”)  shows us that for the MeitY, allocation in BE 2024-2025 (₹21,385.15 Cr)  saw an increase of 48.28% as compared to the RE of 2023-24 (₹14,421.25  Cr); for the MHA, allocation in BE 2024-2025 (₹5733.51 crores) saw an  increase of 11.97% as compared to the RE of 2023-24 (₹5120.78 Cr), for  the MIB, allocation in BE 2024-2025 (₹4342.55 Cr) saw a decrease of  2.41% as compared to the RE of 2023-24 (₹4449.76 Cr), for the DoT,  allocation in BE 2024-2025 (₹1,11,876.67 Cr) saw an increase of 13.74%  as compared to the RE of 2023-24 (₹98,359.41 Cr).\n\nAn enormous  17.15% increase in total planned capital expenditure of DoT, MeitY, MHA,  and MIB (₹1,43,337.88 Cr) over the RE of 2023-24 (₹1,22,351.2 Cr) can  be observed, stemming largely from a 48.28% increase in the Ministry of  Electronics and Information Technology (MeitY). The increment can be  attributed to MeitY’s capital allocation towards the Modified Programme  for Development of Semiconductors and Display Manufacturing Ecosystem in  India, which saw a whopping 359.1% increase as compared to 2023-24.\n\n## Ministry-wise overview\n\n1. **MeitY:** The  total budgetary allocation for MeitY in the Budget for 2024-2025 is  ₹21385.2 Cr, which is a 29.2% increase from the previous financial  year’s budget. The increase is even higher when compared to the RE of  2023-2024, i.e., a year-on-year change of 48.28%. This is in contrast to  the budgetary trends we witnessed in 2021, 2022 and 2023, where there  was underutilisation of the budget. \n\nhttps://preview.redd.it/vnnzg3q545ic1.png?width=661&format=png&auto=webp&s=316893745e8c8a98aef02510c800444f32d0d5fb\n\n&#x200B;\n\n* **DoT**: In 2024-25, the Department  (which operates under the Ministry of Communications) has been allocated  a whopping ₹111876.6 Cr, which is 14.65% increase over the budget  allocated in 2023-24 (₹97579.05 Cr) and 13.74% over the RE for 2023-24  (₹98359.41 Cr). Notably, no funds have been allocated for the defence  spectrum, for which DoT estimated a large amount of ₹2285.32 Cr last  year, but utilised only 13.8% of it (₹315.55 Cr).\n\nhttps://preview.redd.it/76z7esge45ic1.png?width=662&format=png&auto=webp&s=e1cffbfdc79ede2ca56252b6e10f40cabfe334de\n\n&#x200B;\n\n* **MIB:** The total budgetary allocation  for MIB in 2024-25 is ₹4342.55 Cr, which is a 7.45% decrease from the  2023-2024 Budget. This cut comes after MIB seemingly was able to utilise  a higher budget allocation last year, which seems incongruent. The  allocation for Central Sector Schemes/Projects under MIB has plateaued  as compared to the BE 2023-2024.\n\nhttps://preview.redd.it/mrdj24eg45ic1.png?width=666&format=png&auto=webp&s=cb3c4243f6dc84e35908a2ab87d56282146af183\n\n&#x200B;\n\n* **MHA:** The total budgetary allocation  for MHA is 2.84% lower than what was allocated in the BE for the FY  2023-24. The allocation in the budget estimates, net of receipts and  recoveries, for MHA is ₹5733.51 Cr. Although there is a 11.97% increase  over the 2023-24 RE that was pegged at ₹5120.78 Cr, the allocation is  still 13.22% lower than what was made in 2023-24. The allocation for  planned capital expenditure has marginally dipped as compared to both  the 2023-2024 BE ( by 1.27%) and RE (by 6.21%), which is disappointing.\n\nhttps://preview.redd.it/ubdzvrwh45ic1.png?width=667&format=png&auto=webp&s=ca0e500ff48b23943cf0b5929d23326e9df3d547\n\n## Questions, answers, and discussions\n\n### Digi Yatra Implementation and data security\n\nOn  February 05, Niranjan Reddy asked the Ministry of Civil Aviation in the  Rajya Sabha for insights on passenger data collection via Digi Yatra,  measures taken to prevent unauthorised access/misuse, and whether  passengers have visibility and control over their data, incl right to  access, rectify & delete data, as well as the Ministry’s plans to  place Digi Yatra under govt oversight for enhanced security and  transparency. The Minister of State answered that the DigiYatra Central  Ecosystem prioritises privacy by design and default and all personal  passenger data is stored locally in the passenger’s smartphone wallet  itself. He added that data is shared with the origin airport for ID  validation and purged within 24 hrs post-flight departure, and that the  government ensures data security and process transparency in Digi Yatra  by maintaining passenger data locally only and purging it from the  central system. \n\nHowever, this does not solve a central issue with  DigiYatra, which lacks transparency in its data flow and sharing  practices, with vague privacy policy provisions and discrepancies in  officials' statements. Neither its nodal authority nor auditing body,  which is the Indian Computer Emergency Response Team (“CERT-in”)  falls  under the RTI Act. Read IFF’s detailed analysis on Digi Yatra [here](https://internetfreedom.in/reject-digiyatra/?ref=static.internetfreedom.in).\n\n### Regulation of deepfakes\n\nOn  February 05, Parliamentarian Harbhajan Singh asked MeitY if it is  cognizant of the risks associated with disruptive technologies such as  Artificial Intelligence (“AI”) and deepfakes, and their plans to enact  regulations in these domains. Minister of State replied that the  government’s internet policies prioritise an open, safe and accountable  online space for all “Digital Nagriks”, and that they plan to leverage  the potential of AI for innovation across sectors while being mindful of  its risks, especially in the case of deepfakes. \n\nHe stated that  as for regulation the IT (Intermediary Guidelines and Digital Media  Ethics Code) Rules, 2021 (“IT Rules, 2021”) obligate intermediaries to  promptly address misinformation, which includes deepfakes. Under these  Rules certain Grievance Appellate Committees are set up to ensure a  user-friendly redressal, and the Ministry adopts a zero-tolerance stance  on deepfakes which mandates platforms to align their terms of use and  swiftly remove prohibited content. He added that recent advisories of  the Ministry emphasise compliance with IT Rules, 2021 for  intermediaries, while users are being informed about content guidelines  and potential legal consequences. The National Cyber Crime Reporting  Portal and helpline are also available for grievance redress. \n\nAs  deepfakes took centre stage in 2023, MeitY decided to tackle the issue  head-on. However, what ensued was several conflicting statements from  MeitY and rushed interventions without deeply understanding or  consulting over the issues, which is not the best-suited response to  systemic issues like deepfakes. Read IFF’s analysis on this issue [here](https://internetfreedom.in/dealing-with-deepfakes/?ref=static.internetfreedom.in).  Further, Grievance Appellate Committees are not the solution to the  problem – they worryingly make the government an arbiter of permissible  speech on the internet and incentivise social media platforms and  intermediaries to suppress any speech unpalatable to the government.  Read more of IFF’s work on GACs under the IT Rules, 2021 [here](https://internetfreedom.in/public-brief-on-the-it-amendment-rules-2022/?ref=static.internetfreedom.in).\n\n### Internet and child mental health\n\nOn  February 02, in Lok Sabha, Parliamentarian Shashi Tharoor asked the  Ministry of Women and Child Development about their awareness of surveys  done on the mental health concerns prevalent among internet-using  children, and steps taken to address the issue, especially by the Kerala  government where the rates are worryingly high. Minister of State  answered that the government does not know of the survey, but studies  have been done by the National Commission For Protection of Child Rights  on the effects of mobile phone and internet usage on school children  which suggest similar trends. She added that the government addresses  mental health burden in children through the National Mental Health  Programme and Rashtriya Kishor Swasthya Karyakram, focused on holistic  adolescent development with mental health as a key area. This is  supported by the Ayushman Bharat School Health and Wellness Programme  and a National Tele Mental Health Programme with 34 states/UTs already  offering tele-mental health services, handling over 6,28,000 calls.\n\n### Rural connectivity and digital panchayats\n\nOn  February 06, in Lok Sabha,Parliament Damore Guman asked the Ministry of  Panchayati Raj about their plans for technological advancements in  Panchayati Raj Institutions (“PRI”), status of FTTH internet  connectivity in PRIs in Madhya Pradesh, how long until remaining Gram  Panchayats have internet access, and the Ministry’s efforts to raise  digital literacy among newly elected representatives. Minister of State  replied that eGramSwaraj app enhances transparency in Panchayat  governance, with 2.52L PRIs uploading development plans and 2.41L  completing online transactions for grants. AuditOnline ensures  accountable finances, with 2.49L audit plans created. He added that  BharatNet aims to connect all PRIs with broadband and 2,14,300 are  presently service-ready. A ‘Model Panchayat Citizens Charter’ ensures  timely services for citizens, and over 2.32L Gram Panchayats have  conducted Gram Sabha to facilitate this. On digital literacy efforts, he  stated that the revamped Rashtriya Gram Swaraj Abhiyan empowers  Panchayats through technical training for Elected Representatives,  focusing on governance capabilities and SDG localisation at grassroots level. \n\n### Regulatory scope of DPDPA\n\nOn  February 07, in Lok Sabha, Parliamentarian Tenkasi asked MeitY about  the key objectives of Digital Personal Data Protection (“DPDP”) Act  2023, its impact on personal data processing in India, and its scope to  advance India's AI adoption while safeguarding personal data. Further,  he asked how the government is ensuring companies comply with redressal  mechanisms and penalties under the Act, what steps are being taken to  educate citizens about their statutory rights and what measures are in  place to ensure compliance by data fiduciaries. Minister of State  answered that the DPDP Act focuses solely on protection of personal data  & establishes rights and duties of Data Principals and obligations  of Data Fiduciaries – including safeguarding personal data against  breaches & fostering responsible data processing practices. He added  that the Act establishes a Data Protection Board to penalise  non-compliance, ensuring accountability and imposing fines on processors  violating data protection standards and that a transition period of  6-12 mos will be provided for them to adapt and comply to the new  regime. \n\nThe DPDP Act in its current form is flawed on many  aspects – it makes personal data vulnerable to online scraping, has weak  notice requirements, gives sweeping exemptions to govt and private  actors in unclear circumstances, imposes penalties on data principals,  and so on. Further, the public consultation process for the current  version is flawed, as it was tabled and passed in the parliament without  specific consultations and though its previous version was open for  feedback from the public, the suggestions were not publicly displayed,  neither were they incorporated, at least not in a transparent manner.  IFF has done a deeper analysis on the Act, which can be [accessed here](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in).\n\n### Voter card linking with Aadhaar\n\nOn  February 09, several Lok Sabha members asked the Ministry of Law and  Justice about the number of Voter IDs linked with Aadhaar since the  Election Laws (Amendment) Act, 2021 and how consent is being obtained  for the same. They also inquired about how a voter’s Aadhaar details  will be deleted upon withdrawal of consent and if the names of voters  not linked with Aadhaar will be removed from voter lists. Further, they  asked about the measures put in place to safeguard the voter database  from misuse. Minister of State replied saying that the Election  Commission of India (“ECI”) has previously clarified that the  Representation of the People Act, 1950, as amended by the Election Laws  Act, 2021, permits Electoral Registration Officers to request Aadhaar  numbers from electors voluntarily for identity verification. He added  that starting August 01, 2022, a voluntary Aadhaar collection program  has been initiated nationwide but linking of Aadhaar with Election Photo  Identity Cards has not commenced yet. For now, submitting Aadhaar with  Voter ID is optional, with consent obtained via Form 6B. Currently there  are no provisions for deleting Aadhaar details if consent is withdrawn.  The ECI oversees electoral roll preparation and ensures data security  through multi-layered encryption.\n\n### One Nation, One Student ID\n\nOn  February 05, Parliamentarians asked the Education Ministry for clarity  on the “One Nation, One Student ID” initiative, including the objectives  of the initiative, measures to ensure student data confidentiality, and  guidelines to prevent data breaches. Minister of State for Education  replied that under the framework, a ‘registry framework’ tracks  students’ academic journeys, facilitates credit transfers, and aligns  programs with skill components. Stringent data security measures under  MeitY’s guidelines will ensure confidentiality and prevent data  breaches. IFF has previously flagged the framework for the privacy  concerns it raises, which persist despite the Minister’s assurances.  Read our analysis [here](https://internetfreedom.in/aadhaar-based-student-id-raises-alarms-for-privacy/?ref=static.internetfreedom.in).\n\nThere were other discussions that we tracked live, including on [data collection through Aarogya Setu](https://x.com/IFFonParliament/status/1755944028858675574?s=20&ref=static.internetfreedom.in), linking of [Aadhaar with health schemes](https://x.com/IFFonParliament/status/1755942437556466046?s=20&ref=static.internetfreedom.in), [leaks of Aadhaar data](https://x.com/IFFonParliament/status/1755940560345411611?s=20&ref=static.internetfreedom.in) in recent times, blocking of content on social media sites ([here](https://x.com/IFFonParliament/status/1755571146617975089?s=20&ref=static.internetfreedom.in), here), [regulation of pirated content](https://x.com/IFFonParliament/status/1754840962717671557?s=20&ref=static.internetfreedom.in), status and mechanisms under the [Broadcasting Services (Regulation) Bill, 2023](https://x.com/IFFonParliament/status/1755569289547919802?s=20&ref=static.internetfreedom.in), cybercrimes and fraud ([here](https://x.com/IFFonParliament/status/1755486608965456282?s=20&ref=static.internetfreedom.in), [here](https://x.com/IFFonParliament/status/1755481557010157760?s=20&ref=static.internetfreedom.in)), building capacity and [upskilling for Digital Public Infrastructure](https://x.com/IFFonParliament/status/1754837957712728416?s=20&ref=static.internetfreedom.in) roll-out, and the impact of [AI on the labour market](https://x.com/IFFonParliament/status/1754829447620899055?s=20&ref=static.internetfreedom.in).\n\n## Conclusion\n\nThe  Budget Session gave us one notable high, which is a marked increase in  Ministerial budgets, but other than that sustained trends from last year  – high projected estimates but underutilisation of funds. In light of  the increasing digitisation across sectors and the increasing demand for  improved digital literacy as well as access to digital services, we  hope that the fund allocation in these concerned sectors continue to  witness a positive trend. In terms of productivity, though both houses  sat for an extra day, the discussions focused on political agenda items  since this would be the last parliamentary sitting for the 17th Lok  Sabha, and the last for the incumbent government before we break for  elections in April-May 2024. Some pertinent questions were asked by  opposition members which touched upon digital rights and freedoms, but  we noted that the responses were not adequate, and data privacy concerns  for many issues remain unaddressed. We remain optimistic that the  upcoming union government will give these issues their deserved  attention and careful consideration.\n\n*This post has been drafted with assistance from Vinamra Harkar, Policy Intern, Internet Freedom Foundation.*\n\n[Link to post](https://internetfreedom.in/budget-session-2024-a-digital-rights-review/) |  [Donate Now](https://static.internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1707737727.0,
    "convurl": "https://b.thumbs.redditmedia.com/MTWc_0rxMn-kcX2hINBshtvN0ovfD5q9sPgAWxGnMbQ.jpg",
    "comments": [],
    "cleaned_text": "budget session digital rights review httpsinternetfreedomindonatehttpspreviewredditstvwlicpngwidthformatpngautowebpsebbcecdabcddafedd tldr houses parliament adjourned sine die february concluding budget session one day scheduled end date february last parliamentary session th lok sabha session new bills introduced passing passed houses pending passage rajya sabha total bills pending conclusion session union interim budget presented passed see increased budgetary allocations budget meity mha mib dot compared budget good starting point building implementing robust digital systems discussions floor parliament spanned several issues including relevant digital rights freedoms background th parliamentary session th lok sabha adjourned sine die february concluding one day scheduled end date february marks last parliamentary sitting th lok sabha prepare elect new government upcoming general elections session union minister nirmala sitharaman presented union interim budget financial year fy passed houses budget interim allocation funds india forms new union government lok sabha elections post full budget placed houses deliberation july cumulative sum cr allotted ministry electronics information technology meity ministry information broadcasting mib department telecommunications dot ministry home affairs mha see detailed analysis budget ministries blogposthttpsinternetfreedominbudgetpartiirefstaticinternetfreedomin houses introduced bills passed withdrew none bills passed houses awaiting presidential assent include finance bill gives effect tax proposals central government year appropriation bills bills passed water prevention control pollution amendment bill public examination prevention unfair means bill jammu kashmir local bodies laws amendment bill constitution scheduled tribes order amendment bill constitution scheduled castes scheduled tribes orders amendment bill constitution jammu kashmir scheduled castes order amendment bill constitution jammu kashmir scheduled tribes order amendment bill read sessions legislative business herehttpsprsindiaorgfilesparliamentsessiontracksessionwrapsessionwrapbudgetsessionpdfrefstaticinternetfreedomin lok sabha rajya sabha observed productivity rates respectively however majority time spent discussing nonlegislative business fraction time actually went discussing answering questions union interim budget passed hours minutes discussion lok sabha hours minutes discussion rajya sabha houses spent hours discussing agenda item historic construction shree ram temple pran pratishta final day parliament statistics available herehttpsprsindiaorgsessiontrackbudgetsessionproductivityrefstaticinternetfreedomin herehttpsprsindiaorgsessiontrackbudgetsessionimportantissuesrefstaticinternetfreedomin quick overview union interim budget union interim budget fy cumulatively allotted cr ministry electronics information technology meity ministry information broadcasting mib department telecommunications dot ministry home affairs mha glance ministrywise budget estimates revised estimates shows us meity allocation cr saw increase compared cr mha allocation crores saw increase compared cr mib allocation cr saw decrease compared cr dot allocation cr saw increase compared cr enormous increase total planned capital expenditure dot meity mha mib cr cr observed stemming largely increase ministry electronics information technology meity increment attributed meitys capital allocation towards modified programme development semiconductors display manufacturing ecosystem india saw whopping increase compared ministrywise overview meity total budgetary allocation meity budget cr increase previous financial years budget increase even higher compared ie yearonyear change contrast budgetary trends witnessed underutilisation budget xb dot department operates ministry communications allocated whopping cr increase budget allocated cr cr notably funds allocated defence spectrum dot estimated large amount cr last year utilised cr xb mib total budgetary allocation mib cr decrease budget cut comes mib seemingly able utilise higher budget allocation last year seems incongruent allocation central sector schemesprojects mib plateaued compared xb mha total budgetary allocation mha lower allocated fy allocation budget estimates net receipts recoveries mha cr although increase pegged cr allocation still lower made allocation planned capital expenditure marginally dipped compared disappointing questions answers discussions digi yatra implementation data security february niranjan reddy asked ministry civil aviation rajya sabha insights passenger data collection via digi yatra measures taken prevent unauthorised accessmisuse whether passengers visibility control data incl right access rectify delete data well ministrys plans place digi yatra govt oversight enhanced security transparency minister state answered digiyatra central ecosystem prioritises privacy design default personal passenger data stored locally passengers smartphone wallet added data shared origin airport id validation purged within hrs postflight departure government ensures data security process transparency digi yatra maintaining passenger data locally purging central system however solve central issue digiyatra lacks transparency data flow sharing practices vague privacy policy provisions discrepancies officials statements neither nodal authority auditing body indian computer emergency response team certin falls rti act read iffs detailed analysis digi yatra herehttpsinternetfreedominrejectdigiyatrarefstaticinternetfreedomin regulation deepfakes february parliamentarian harbhajan singh asked meity cognizant risks associated disruptive technologies artificial intelligence ai deepfakes plans enact regulations domains minister state replied governments internet policies prioritise open safe accountable online space digital nagriks plan leverage potential ai innovation across sectors mindful risks especially case deepfakes stated regulation intermediary guidelines digital media ethics code rules rules obligate intermediaries promptly address misinformation includes deepfakes rules certain grievance appellate committees set ensure userfriendly redressal ministry adopts zerotolerance stance deepfakes mandates platforms align terms use swiftly remove prohibited content added recent advisories ministry emphasise compliance rules intermediaries users informed content guidelines potential legal consequences national cyber crime reporting portal helpline also available grievance redress deepfakes took centre stage meity decided tackle issue headon however ensued several conflicting statements meity rushed interventions without deeply understanding consulting issues bestsuited response systemic issues like deepfakes read iffs analysis issue herehttpsinternetfreedomindealingwithdeepfakesrefstaticinternetfreedomin grievance appellate committees solution problem worryingly make government arbiter permissible speech internet incentivise social media platforms intermediaries suppress speech unpalatable government read iffs work gacs rules herehttpsinternetfreedominpublicbriefontheitamendmentrulesrefstaticinternetfreedomin internet child mental health february lok sabha parliamentarian shashi tharoor asked ministry women child development awareness surveys done mental health concerns prevalent among internetusing children steps taken address issue especially kerala government rates worryingly high minister state answered government know survey studies done national commission protection child rights effects mobile phone internet usage school children suggest similar trends added government addresses mental health burden children national mental health programme rashtriya kishor swasthya karyakram focused holistic adolescent development mental health key area supported ayushman bharat school health wellness programme national tele mental health programme statesuts already offering telemental health services handling calls rural connectivity digital panchayats february lok sabhaparliament damore guman asked ministry panchayati raj plans technological advancements panchayati raj institutions pri status ftth internet connectivity pris madhya pradesh long remaining gram panchayats internet access ministrys efforts raise digital literacy among newly elected representatives minister state replied egramswaraj app enhances transparency panchayat governance l pris uploading development plans l completing online transactions grants auditonline ensures accountable finances l audit plans created added bharatnet aims connect pris broadband presently serviceready model panchayat citizens charter ensures timely services citizens l gram panchayats conducted gram sabha facilitate digital literacy efforts stated revamped rashtriya gram swaraj abhiyan empowers panchayats technical training elected representatives focusing governance capabilities sdg localisation grassroots level regulatory scope dpdpa february lok sabha parliamentarian tenkasi asked meity key objectives digital personal data protection dpdp act impact personal data processing india scope advance indias ai adoption safeguarding personal data asked government ensuring companies comply redressal mechanisms penalties act steps taken educate citizens statutory rights measures place ensure compliance data fiduciaries minister state answered dpdp act focuses solely protection personal data establishes rights duties data principals obligations data fiduciaries including safeguarding personal data breaches fostering responsible data processing practices added act establishes data protection board penalise noncompliance ensuring accountability imposing fines processors violating data protection standards transition period mos provided adapt comply new regime dpdp act current form flawed many aspects makes personal data vulnerable online scraping weak notice requirements gives sweeping exemptions govt private actors unclear circumstances imposes penalties data principals public consultation process current version flawed tabled passed parliament without specific consultations though previous version open feedback public suggestions publicly displayed neither incorporated least transparent manner iff done deeper analysis act accessed herehttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin voter card linking aadhaar february several lok sabha members asked ministry law justice number voter ids linked aadhaar since election laws amendment act consent obtained also inquired voters aadhaar details deleted upon withdrawal consent names voters linked aadhaar removed voter lists asked measures put place safeguard voter database misuse minister state replied saying election commission india eci previously clarified representation people act amended election laws act permits electoral registration officers request aadhaar numbers electors voluntarily identity verification added starting august voluntary aadhaar collection program initiated nationwide linking aadhaar election photo identity cards commenced yet submitting aadhaar voter id optional consent obtained via form b currently provisions deleting aadhaar details consent withdrawn eci oversees electoral roll preparation ensures data security multilayered encryption one nation one student id february parliamentarians asked education ministry clarity one nation one student id initiative including objectives initiative measures ensure student data confidentiality guidelines prevent data breaches minister state education replied framework registry framework tracks students academic journeys facilitates credit transfers aligns programs skill components stringent data security measures meitys guidelines ensure confidentiality prevent data breaches iff previously flagged framework privacy concerns raises persist despite ministers assurances read analysis herehttpsinternetfreedominaadhaarbasedstudentidraisesalarmsforprivacyrefstaticinternetfreedomin discussions tracked live including data collection aarogya setuhttpsxcomiffonparliamentstatussrefstaticinternetfreedomin linking aadhaar health schemeshttpsxcomiffonparliamentstatussrefstaticinternetfreedomin leaks aadhaar datahttpsxcomiffonparliamentstatussrefstaticinternetfreedomin recent times blocking content social media sites herehttpsxcomiffonparliamentstatussrefstaticinternetfreedomin regulation pirated contenthttpsxcomiffonparliamentstatussrefstaticinternetfreedomin status mechanisms broadcasting services regulation bill httpsxcomiffonparliamentstatussrefstaticinternetfreedomin cybercrimes fraud herehttpsxcomiffonparliamentstatussrefstaticinternetfreedomin herehttpsxcomiffonparliamentstatussrefstaticinternetfreedomin building capacity upskilling digital public infrastructurehttpsxcomiffonparliamentstatussrefstaticinternetfreedomin rollout impact ai labour markethttpsxcomiffonparliamentstatussrefstaticinternetfreedomin conclusion budget session gave us one notable high marked increase ministerial budgets sustained trends last year high projected estimates underutilisation funds light increasing digitisation across sectors increasing demand improved digital literacy well access digital services hope fund allocation concerned sectors continue witness positive trend terms productivity though houses sat extra day discussions focused political agenda items since would last parliamentary sitting th lok sabha last incumbent government break elections aprilmay pertinent questions asked opposition members touched upon digital rights freedoms noted responses adequate data privacy concerns many issues remain unaddressed remain optimistic upcoming union government give issues deserved attention careful consideration post drafted assistance vinamra harkar policy intern internet freedom foundation link posthttpsinternetfreedominbudgetsessionadigitalrightsreview donate nowhttpsstaticinternetfreedomindonate ",
    "cleaned_title": "budget session digital rights review",
    "cleaned_selftext": "httpsinternetfreedomindonatehttpspreviewredditstvwlicpngwidthformatpngautowebpsebbcecdabcddafedd tldr houses parliament adjourned sine die february concluding budget session one day scheduled end date february last parliamentary session th lok sabha session new bills introduced passing passed houses pending passage rajya sabha total bills pending conclusion session union interim budget presented passed see increased budgetary allocations budget meity mha mib dot compared budget good starting point building implementing robust digital systems discussions floor parliament spanned several issues including relevant digital rights freedoms background th parliamentary session th lok sabha adjourned sine die february concluding one day scheduled end date february marks last parliamentary sitting th lok sabha prepare elect new government upcoming general elections session union minister nirmala sitharaman presented union interim budget financial year fy passed houses budget interim allocation funds india forms new union government lok sabha elections post full budget placed houses deliberation july cumulative sum cr allotted ministry electronics information technology meity ministry information broadcasting mib department telecommunications dot ministry home affairs mha see detailed analysis budget ministries blogposthttpsinternetfreedominbudgetpartiirefstaticinternetfreedomin houses introduced bills passed withdrew none bills passed houses awaiting presidential assent include finance bill gives effect tax proposals central government year appropriation bills bills passed water prevention control pollution amendment bill public examination prevention unfair means bill jammu kashmir local bodies laws amendment bill constitution scheduled tribes order amendment bill constitution scheduled castes scheduled tribes orders amendment bill constitution jammu kashmir scheduled castes order amendment bill constitution jammu kashmir scheduled tribes order amendment bill read sessions legislative business herehttpsprsindiaorgfilesparliamentsessiontracksessionwrapsessionwrapbudgetsessionpdfrefstaticinternetfreedomin lok sabha rajya sabha observed productivity rates respectively however majority time spent discussing nonlegislative business fraction time actually went discussing answering questions union interim budget passed hours minutes discussion lok sabha hours minutes discussion rajya sabha houses spent hours discussing agenda item historic construction shree ram temple pran pratishta final day parliament statistics available herehttpsprsindiaorgsessiontrackbudgetsessionproductivityrefstaticinternetfreedomin herehttpsprsindiaorgsessiontrackbudgetsessionimportantissuesrefstaticinternetfreedomin quick overview union interim budget union interim budget fy cumulatively allotted cr ministry electronics information technology meity ministry information broadcasting mib department telecommunications dot ministry home affairs mha glance ministrywise budget estimates revised estimates shows us meity allocation cr saw increase compared cr mha allocation crores saw increase compared cr mib allocation cr saw decrease compared cr dot allocation cr saw increase compared cr enormous increase total planned capital expenditure dot meity mha mib cr cr observed stemming largely increase ministry electronics information technology meity increment attributed meitys capital allocation towards modified programme development semiconductors display manufacturing ecosystem india saw whopping increase compared ministrywise overview meity total budgetary allocation meity budget cr increase previous financial years budget increase even higher compared ie yearonyear change contrast budgetary trends witnessed underutilisation budget xb dot department operates ministry communications allocated whopping cr increase budget allocated cr cr notably funds allocated defence spectrum dot estimated large amount cr last year utilised cr xb mib total budgetary allocation mib cr decrease budget cut comes mib seemingly able utilise higher budget allocation last year seems incongruent allocation central sector schemesprojects mib plateaued compared xb mha total budgetary allocation mha lower allocated fy allocation budget estimates net receipts recoveries mha cr although increase pegged cr allocation still lower made allocation planned capital expenditure marginally dipped compared disappointing questions answers discussions digi yatra implementation data security february niranjan reddy asked ministry civil aviation rajya sabha insights passenger data collection via digi yatra measures taken prevent unauthorised accessmisuse whether passengers visibility control data incl right access rectify delete data well ministrys plans place digi yatra govt oversight enhanced security transparency minister state answered digiyatra central ecosystem prioritises privacy design default personal passenger data stored locally passengers smartphone wallet added data shared origin airport id validation purged within hrs postflight departure government ensures data security process transparency digi yatra maintaining passenger data locally purging central system however solve central issue digiyatra lacks transparency data flow sharing practices vague privacy policy provisions discrepancies officials statements neither nodal authority auditing body indian computer emergency response team certin falls rti act read iffs detailed analysis digi yatra herehttpsinternetfreedominrejectdigiyatrarefstaticinternetfreedomin regulation deepfakes february parliamentarian harbhajan singh asked meity cognizant risks associated disruptive technologies artificial intelligence ai deepfakes plans enact regulations domains minister state replied governments internet policies prioritise open safe accountable online space digital nagriks plan leverage potential ai innovation across sectors mindful risks especially case deepfakes stated regulation intermediary guidelines digital media ethics code rules rules obligate intermediaries promptly address misinformation includes deepfakes rules certain grievance appellate committees set ensure userfriendly redressal ministry adopts zerotolerance stance deepfakes mandates platforms align terms use swiftly remove prohibited content added recent advisories ministry emphasise compliance rules intermediaries users informed content guidelines potential legal consequences national cyber crime reporting portal helpline also available grievance redress deepfakes took centre stage meity decided tackle issue headon however ensued several conflicting statements meity rushed interventions without deeply understanding consulting issues bestsuited response systemic issues like deepfakes read iffs analysis issue herehttpsinternetfreedomindealingwithdeepfakesrefstaticinternetfreedomin grievance appellate committees solution problem worryingly make government arbiter permissible speech internet incentivise social media platforms intermediaries suppress speech unpalatable government read iffs work gacs rules herehttpsinternetfreedominpublicbriefontheitamendmentrulesrefstaticinternetfreedomin internet child mental health february lok sabha parliamentarian shashi tharoor asked ministry women child development awareness surveys done mental health concerns prevalent among internetusing children steps taken address issue especially kerala government rates worryingly high minister state answered government know survey studies done national commission protection child rights effects mobile phone internet usage school children suggest similar trends added government addresses mental health burden children national mental health programme rashtriya kishor swasthya karyakram focused holistic adolescent development mental health key area supported ayushman bharat school health wellness programme national tele mental health programme statesuts already offering telemental health services handling calls rural connectivity digital panchayats february lok sabhaparliament damore guman asked ministry panchayati raj plans technological advancements panchayati raj institutions pri status ftth internet connectivity pris madhya pradesh long remaining gram panchayats internet access ministrys efforts raise digital literacy among newly elected representatives minister state replied egramswaraj app enhances transparency panchayat governance l pris uploading development plans l completing online transactions grants auditonline ensures accountable finances l audit plans created added bharatnet aims connect pris broadband presently serviceready model panchayat citizens charter ensures timely services citizens l gram panchayats conducted gram sabha facilitate digital literacy efforts stated revamped rashtriya gram swaraj abhiyan empowers panchayats technical training elected representatives focusing governance capabilities sdg localisation grassroots level regulatory scope dpdpa february lok sabha parliamentarian tenkasi asked meity key objectives digital personal data protection dpdp act impact personal data processing india scope advance indias ai adoption safeguarding personal data asked government ensuring companies comply redressal mechanisms penalties act steps taken educate citizens statutory rights measures place ensure compliance data fiduciaries minister state answered dpdp act focuses solely protection personal data establishes rights duties data principals obligations data fiduciaries including safeguarding personal data breaches fostering responsible data processing practices added act establishes data protection board penalise noncompliance ensuring accountability imposing fines processors violating data protection standards transition period mos provided adapt comply new regime dpdp act current form flawed many aspects makes personal data vulnerable online scraping weak notice requirements gives sweeping exemptions govt private actors unclear circumstances imposes penalties data principals public consultation process current version flawed tabled passed parliament without specific consultations though previous version open feedback public suggestions publicly displayed neither incorporated least transparent manner iff done deeper analysis act accessed herehttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin voter card linking aadhaar february several lok sabha members asked ministry law justice number voter ids linked aadhaar since election laws amendment act consent obtained also inquired voters aadhaar details deleted upon withdrawal consent names voters linked aadhaar removed voter lists asked measures put place safeguard voter database misuse minister state replied saying election commission india eci previously clarified representation people act amended election laws act permits electoral registration officers request aadhaar numbers electors voluntarily identity verification added starting august voluntary aadhaar collection program initiated nationwide linking aadhaar election photo identity cards commenced yet submitting aadhaar voter id optional consent obtained via form b currently provisions deleting aadhaar details consent withdrawn eci oversees electoral roll preparation ensures data security multilayered encryption one nation one student id february parliamentarians asked education ministry clarity one nation one student id initiative including objectives initiative measures ensure student data confidentiality guidelines prevent data breaches minister state education replied framework registry framework tracks students academic journeys facilitates credit transfers aligns programs skill components stringent data security measures meitys guidelines ensure confidentiality prevent data breaches iff previously flagged framework privacy concerns raises persist despite ministers assurances read analysis herehttpsinternetfreedominaadhaarbasedstudentidraisesalarmsforprivacyrefstaticinternetfreedomin discussions tracked live including data collection aarogya setuhttpsxcomiffonparliamentstatussrefstaticinternetfreedomin linking aadhaar health schemeshttpsxcomiffonparliamentstatussrefstaticinternetfreedomin leaks aadhaar datahttpsxcomiffonparliamentstatussrefstaticinternetfreedomin recent times blocking content social media sites herehttpsxcomiffonparliamentstatussrefstaticinternetfreedomin regulation pirated contenthttpsxcomiffonparliamentstatussrefstaticinternetfreedomin status mechanisms broadcasting services regulation bill httpsxcomiffonparliamentstatussrefstaticinternetfreedomin cybercrimes fraud herehttpsxcomiffonparliamentstatussrefstaticinternetfreedomin herehttpsxcomiffonparliamentstatussrefstaticinternetfreedomin building capacity upskilling digital public infrastructurehttpsxcomiffonparliamentstatussrefstaticinternetfreedomin rollout impact ai labour markethttpsxcomiffonparliamentstatussrefstaticinternetfreedomin conclusion budget session gave us one notable high marked increase ministerial budgets sustained trends last year high projected estimates underutilisation funds light increasing digitisation across sectors increasing demand improved digital literacy well access digital services hope fund allocation concerned sectors continue witness positive trend terms productivity though houses sat extra day discussions focused political agenda items since would last parliamentary sitting th lok sabha last incumbent government break elections aprilmay pertinent questions asked opposition members touched upon digital rights freedoms noted responses adequate data privacy concerns many issues remain unaddressed remain optimistic upcoming union government give issues deserved attention careful consideration post drafted assistance vinamra harkar policy intern internet freedom foundation link posthttpsinternetfreedominbudgetsessionadigitalrightsreview donate nowhttpsstaticinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "Budget Session 2024: A Digital Rights Review",
    "light_cleaned_selftext": "[https:\\/\\/internetfreedom.in\\/donate\\/](https://preview.redd.it/06st1vwl45ic1.png?width=1600&format=png&auto=webp&s=eb300349bc57e06c3d24a18bc939dda3f8132edd) ## tl;dr Both houses of the Parliament were adjourned sine die on February 10, 2024, concluding the 2024 Budget Session one day after the scheduled end date of February 09, and the last parliamentary session for the 17th Lok Sabha. During this Session, 10 new bills were introduced for passing, of which 12 were passed by both houses, 1 pending passage in the Rajya Sabha, with a total of 24 bills pending after the conclusion of the session. The Union Interim Budget for 2024-25 was presented and passed. We see increased budgetary allocations in the budget for MeitY, MHA, MIB and DoT as compared to the 2023-2024 Budget, which is a good starting point for building and implementing robust digital systems. Discussions on the floor of the parliament spanned several issues, including those relevant to digital rights and freedoms. ## Background The 15th Parliamentary Session of the 17th Lok Sabha was adjourned sine die on February 10, 2024, concluding one day after the scheduled end date of February 09. This marks the last parliamentary sitting for the 17th Lok Sabha, as we prepare to elect a new government in the upcoming general elections. In the session, Union Minister Nirmala Sitharaman presented the Union Interim Budget for the Financial Year (“FY”) 2024-2025, which was passed in both houses. The budget is an interim allocation of funds until India forms a new union government in the 2024 Lok Sabha elections, post which a full budget will be placed in both houses for deliberation again in July 2024. A cumulative sum of ₹1,43,337.88 Cr has been allotted to the Ministry of Electronics and Information Technology (MeitY), the Ministry of Information and Broadcasting (MIB), the Department of Telecommunications (DoT), and Ministry of Home Affairs (MHA). See our detailed analysis of the budget for these ministries in [this blogpost](https://internetfreedom.in/budget-2024-part-ii/?ref=static.internetfreedom.in). Both houses introduced 10 bills, passed 12 and withdrew none. The bills passed in both houses and now awaiting presidential assent include the Finance Bill, 2024 which gives effect to tax proposals of the central government for the year 2024-25 and 5 Appropriation Bills. The other bills passed are the Water (Prevention and Control of Pollution), Amendment Bill, 2024, Public Examination (Prevention of Unfair Means) Bill, 2024, Jammu and Kashmir Local Bodies Laws (Amendment) Bill, 2024, Constitution (Scheduled Tribes) Order (Amendment) Bill, 2024, Constitution (Scheduled Castes and Scheduled Tribes) Orders (Amendment) Bill, 2024, Constitution (Jammu and Kashmir) Scheduled Castes Order (Amendment) Bill, 2023; Constitution (Jammu and Kashmir) Scheduled Tribes Order (Amendment) Bill, 2023. Read more about this session’s legislative business [here](https://prsindia.org/files/parliament/session_track/2024/session_wrap/Session_Wrap-Budget_Session_2024.pdf?ref=static.internetfreedom.in). The Lok Sabha and Rajya Sabha observed productivity rates of 148% and 137% respectively. However, a majority of their time (44-47%) was spent discussing non-legislative business, and a fraction of time (8-9%) actually went into discussing and answering questions. While the Union Interim Budget was passed after 7 hours 6 minutes of discussion in the Lok Sabha and 6 hours 37 minutes discussion in the Rajya Sabha, both houses spent between 3-5 hours discussing agenda item 'Historic construction of Shree Ram Temple and Pran Pratishta' on the final day of the Parliament. These statistics are available [here](https://prsindia.org/sessiontrack/budget-session-2024/productivity?ref=static.internetfreedom.in) and [here](https://prsindia.org/sessiontrack/budget-session-2024/important-issues?ref=static.internetfreedom.in). ## Quick overview: Union Interim Budget 2024-25 Union Interim Budget for FY 2024-25 has cumulatively allotted ₹1,43,337.88 Cr to the Ministry of Electronics and Information Technology (MeitY), the Ministry of Information and Broadcasting (MIB), the Department of Telecommunications (DoT), and Ministry of Home Affairs (MHA). A glance at Ministry-wise Budget Estimates (“BE”) and Revised Estimates (“RE”) shows us that for the MeitY, allocation in BE 2024-2025 (₹21,385.15 Cr) saw an increase of 48.28% as compared to the RE of 2023-24 (₹14,421.25 Cr); for the MHA, allocation in BE 2024-2025 (₹5733.51 crores) saw an increase of 11.97% as compared to the RE of 2023-24 (₹5120.78 Cr), for the MIB, allocation in BE 2024-2025 (₹4342.55 Cr) saw a decrease of 2.41% as compared to the RE of 2023-24 (₹4449.76 Cr), for the DoT, allocation in BE 2024-2025 (₹1,11,876.67 Cr) saw an increase of 13.74% as compared to the RE of 2023-24 (₹98,359.41 Cr). An enormous 17.15% increase in total planned capital expenditure of DoT, MeitY, MHA, and MIB (₹1,43,337.88 Cr) over the RE of 2023-24 (₹1,22,351.2 Cr) can be observed, stemming largely from a 48.28% increase in the Ministry of Electronics and Information Technology (MeitY). The increment can be attributed to MeitY’s capital allocation towards the Modified Programme for Development of Semiconductors and Display Manufacturing Ecosystem in India, which saw a whopping 359.1% increase as compared to 2023-24. ## Ministry-wise overview 1. **MeitY:** The total budgetary allocation for MeitY in the Budget for 2024-2025 is ₹21385.2 Cr, which is a 29.2% increase from the previous financial year’s budget. The increase is even higher when compared to the RE of 2023-2024, i.e., a year-on-year change of 48.28%. This is in contrast to the budgetary trends we witnessed in 2021, 2022 and 2023, where there was underutilisation of the budget. &#x200B; * **DoT**: In 2024-25, the Department (which operates under the Ministry of Communications) has been allocated a whopping ₹111876.6 Cr, which is 14.65% increase over the budget allocated in 2023-24 (₹97579.05 Cr) and 13.74% over the RE for 2023-24 (₹98359.41 Cr). Notably, no funds have been allocated for the defence spectrum, for which DoT estimated a large amount of ₹2285.32 Cr last year, but utilised only 13.8% of it (₹315.55 Cr). &#x200B; * **MIB:** The total budgetary allocation for MIB in 2024-25 is ₹4342.55 Cr, which is a 7.45% decrease from the 2023-2024 Budget. This cut comes after MIB seemingly was able to utilise a higher budget allocation last year, which seems incongruent. The allocation for Central Sector Schemes/Projects under MIB has plateaued as compared to the BE 2023-2024. &#x200B; * **MHA:** The total budgetary allocation for MHA is 2.84% lower than what was allocated in the BE for the FY 2023-24. The allocation in the budget estimates, net of receipts and recoveries, for MHA is ₹5733.51 Cr. Although there is a 11.97% increase over the 2023-24 RE that was pegged at ₹5120.78 Cr, the allocation is still 13.22% lower than what was made in 2023-24. The allocation for planned capital expenditure has marginally dipped as compared to both the 2023-2024 BE ( by 1.27%) and RE (by 6.21%), which is disappointing. ## Questions, answers, and discussions ### Digi Yatra Implementation and data security On February 05, Niranjan Reddy asked the Ministry of Civil Aviation in the Rajya Sabha for insights on passenger data collection via Digi Yatra, measures taken to prevent unauthorised access/misuse, and whether passengers have visibility and control over their data, incl right to access, rectify & delete data, as well as the Ministry’s plans to place Digi Yatra under govt oversight for enhanced security and transparency. The Minister of State answered that the DigiYatra Central Ecosystem prioritises privacy by design and default and all personal passenger data is stored locally in the passenger’s smartphone wallet itself. He added that data is shared with the origin airport for ID validation and purged within 24 hrs post-flight departure, and that the government ensures data security and process transparency in Digi Yatra by maintaining passenger data locally only and purging it from the central system. However, this does not solve a central issue with DigiYatra, which lacks transparency in its data flow and sharing practices, with vague privacy policy provisions and discrepancies in officials' statements. Neither its nodal authority nor auditing body, which is the Indian Computer Emergency Response Team (“CERT-in”) falls under the RTI Act. Read IFF’s detailed analysis on Digi Yatra [here](https://internetfreedom.in/reject-digiyatra/?ref=static.internetfreedom.in). ### Regulation of deepfakes On February 05, Parliamentarian Harbhajan Singh asked MeitY if it is cognizant of the risks associated with disruptive technologies such as Artificial Intelligence (“AI”) and deepfakes, and their plans to enact regulations in these domains. Minister of State replied that the government’s internet policies prioritise an open, safe and accountable online space for all “Digital Nagriks”, and that they plan to leverage the potential of AI for innovation across sectors while being mindful of its risks, especially in the case of deepfakes. He stated that as for regulation the IT (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (“IT Rules, 2021”) obligate intermediaries to promptly address misinformation, which includes deepfakes. Under these Rules certain Grievance Appellate Committees are set up to ensure a user-friendly redressal, and the Ministry adopts a zero-tolerance stance on deepfakes which mandates platforms to align their terms of use and swiftly remove prohibited content. He added that recent advisories of the Ministry emphasise compliance with IT Rules, 2021 for intermediaries, while users are being informed about content guidelines and potential legal consequences. The National Cyber Crime Reporting Portal and helpline are also available for grievance redress. As deepfakes took centre stage in 2023, MeitY decided to tackle the issue head-on. However, what ensued was several conflicting statements from MeitY and rushed interventions without deeply understanding or consulting over the issues, which is not the best-suited response to systemic issues like deepfakes. Read IFF’s analysis on this issue [here](https://internetfreedom.in/dealing-with-deepfakes/?ref=static.internetfreedom.in). Further, Grievance Appellate Committees are not the solution to the problem – they worryingly make the government an arbiter of permissible speech on the internet and incentivise social media platforms and intermediaries to suppress any speech unpalatable to the government. Read more of IFF’s work on GACs under the IT Rules, 2021 [here](https://internetfreedom.in/public-brief-on-the-it-amendment-rules-2022/?ref=static.internetfreedom.in). ### Internet and child mental health On February 02, in Lok Sabha, Parliamentarian Shashi Tharoor asked the Ministry of Women and Child Development about their awareness of surveys done on the mental health concerns prevalent among internet-using children, and steps taken to address the issue, especially by the Kerala government where the rates are worryingly high. Minister of State answered that the government does not know of the survey, but studies have been done by the National Commission For Protection of Child Rights on the effects of mobile phone and internet usage on school children which suggest similar trends. She added that the government addresses mental health burden in children through the National Mental Health Programme and Rashtriya Kishor Swasthya Karyakram, focused on holistic adolescent development with mental health as a key area. This is supported by the Ayushman Bharat School Health and Wellness Programme and a National Tele Mental Health Programme with 34 states/UTs already offering tele-mental health services, handling over 6,28,000 calls. ### Rural connectivity and digital panchayats On February 06, in Lok Sabha,Parliament Damore Guman asked the Ministry of Panchayati Raj about their plans for technological advancements in Panchayati Raj Institutions (“PRI”), status of FTTH internet connectivity in PRIs in Madhya Pradesh, how long until remaining Gram Panchayats have internet access, and the Ministry’s efforts to raise digital literacy among newly elected representatives. Minister of State replied that eGramSwaraj app enhances transparency in Panchayat governance, with 2.52L PRIs uploading development plans and 2.41L completing online transactions for grants. AuditOnline ensures accountable finances, with 2.49L audit plans created. He added that BharatNet aims to connect all PRIs with broadband and 2,14,300 are presently service-ready. A ‘Model Panchayat Citizens Charter’ ensures timely services for citizens, and over 2.32L Gram Panchayats have conducted Gram Sabha to facilitate this. On digital literacy efforts, he stated that the revamped Rashtriya Gram Swaraj Abhiyan empowers Panchayats through technical training for Elected Representatives, focusing on governance capabilities and SDG localisation at grassroots level. ### Regulatory scope of DPDPA On February 07, in Lok Sabha, Parliamentarian Tenkasi asked MeitY about the key objectives of Digital Personal Data Protection (“DPDP”) Act 2023, its impact on personal data processing in India, and its scope to advance India's AI adoption while safeguarding personal data. Further, he asked how the government is ensuring companies comply with redressal mechanisms and penalties under the Act, what steps are being taken to educate citizens about their statutory rights and what measures are in place to ensure compliance by data fiduciaries. Minister of State answered that the DPDP Act focuses solely on protection of personal data & establishes rights and duties of Data Principals and obligations of Data Fiduciaries – including safeguarding personal data against breaches & fostering responsible data processing practices. He added that the Act establishes a Data Protection Board to penalise non-compliance, ensuring accountability and imposing fines on processors violating data protection standards and that a transition period of 6-12 mos will be provided for them to adapt and comply to the new regime. The DPDP Act in its current form is flawed on many aspects – it makes personal data vulnerable to online scraping, has weak notice requirements, gives sweeping exemptions to govt and private actors in unclear circumstances, imposes penalties on data principals, and so on. Further, the public consultation process for the current version is flawed, as it was tabled and passed in the parliament without specific consultations and though its previous version was open for feedback from the public, the suggestions were not publicly displayed, neither were they incorporated, at least not in a transparent manner. IFF has done a deeper analysis on the Act, which can be [accessed here](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in). ### Voter card linking with Aadhaar On February 09, several Lok Sabha members asked the Ministry of Law and Justice about the number of Voter IDs linked with Aadhaar since the Election Laws (Amendment) Act, 2021 and how consent is being obtained for the same. They also inquired about how a voter’s Aadhaar details will be deleted upon withdrawal of consent and if the names of voters not linked with Aadhaar will be removed from voter lists. Further, they asked about the measures put in place to safeguard the voter database from misuse. Minister of State replied saying that the Election Commission of India (“ECI”) has previously clarified that the Representation of the People Act, 1950, as amended by the Election Laws Act, 2021, permits Electoral Registration Officers to request Aadhaar numbers from electors voluntarily for identity verification. He added that starting August 01, 2022, a voluntary Aadhaar collection program has been initiated nationwide but linking of Aadhaar with Election Photo Identity Cards has not commenced yet. For now, submitting Aadhaar with Voter ID is optional, with consent obtained via Form 6B. Currently there are no provisions for deleting Aadhaar details if consent is withdrawn. The ECI oversees electoral roll preparation and ensures data security through multi-layered encryption. ### One Nation, One Student ID On February 05, Parliamentarians asked the Education Ministry for clarity on the “One Nation, One Student ID” initiative, including the objectives of the initiative, measures to ensure student data confidentiality, and guidelines to prevent data breaches. Minister of State for Education replied that under the framework, a ‘registry framework’ tracks students’ academic journeys, facilitates credit transfers, and aligns programs with skill components. Stringent data security measures under MeitY’s guidelines will ensure confidentiality and prevent data breaches. IFF has previously flagged the framework for the privacy concerns it raises, which persist despite the Minister’s assurances. Read our analysis [here](https://internetfreedom.in/aadhaar-based-student-id-raises-alarms-for-privacy/?ref=static.internetfreedom.in). There were other discussions that we tracked live, including on [data collection through Aarogya Setu](https://x.com/IFFonParliament/status/1755944028858675574?s=20&ref=static.internetfreedom.in), linking of [Aadhaar with health schemes](https://x.com/IFFonParliament/status/1755942437556466046?s=20&ref=static.internetfreedom.in), [leaks of Aadhaar data](https://x.com/IFFonParliament/status/1755940560345411611?s=20&ref=static.internetfreedom.in) in recent times, blocking of content on social media sites ([here](https://x.com/IFFonParliament/status/1755571146617975089?s=20&ref=static.internetfreedom.in), here), [regulation of pirated content](https://x.com/IFFonParliament/status/1754840962717671557?s=20&ref=static.internetfreedom.in), status and mechanisms under the [Broadcasting Services (Regulation) Bill, 2023](https://x.com/IFFonParliament/status/1755569289547919802?s=20&ref=static.internetfreedom.in), cybercrimes and fraud ([here](https://x.com/IFFonParliament/status/1755486608965456282?s=20&ref=static.internetfreedom.in), [here](https://x.com/IFFonParliament/status/1755481557010157760?s=20&ref=static.internetfreedom.in)), building capacity and [upskilling for Digital Public Infrastructure](https://x.com/IFFonParliament/status/1754837957712728416?s=20&ref=static.internetfreedom.in) roll-out, and the impact of [AI on the labour market](https://x.com/IFFonParliament/status/1754829447620899055?s=20&ref=static.internetfreedom.in). ## Conclusion The Budget Session gave us one notable high, which is a marked increase in Ministerial budgets, but other than that sustained trends from last year – high projected estimates but underutilisation of funds. In light of the increasing digitisation across sectors and the increasing demand for improved digital literacy as well as access to digital services, we hope that the fund allocation in these concerned sectors continue to witness a positive trend. In terms of productivity, though both houses sat for an extra day, the discussions focused on political agenda items since this would be the last parliamentary sitting for the 17th Lok Sabha, and the last for the incumbent government before we break for elections in April-May 2024. Some pertinent questions were asked by opposition members which touched upon digital rights and freedoms, but we noted that the responses were not adequate, and data privacy concerns for many issues remain unaddressed. We remain optimistic that the upcoming union government will give these issues their deserved attention and careful consideration. *This post has been drafted with assistance from Vinamra Harkar, Policy Intern, Internet Freedom Foundation.* [Link to post](https://internetfreedom.in/budget-session-2024-a-digital-rights-review/) | [Donate Now](https://static.internetfreedom.in/donate)",
    "light_cleaned_comments": ""
}