{
    "id": "1h79h0i",
    "title": "I've visualized statewise data on prevalence of underweight, wasted and stunted children under 5 years as per NFHS-5 survey ",
    "url": "https://www.reddit.com/gallery/1h79h0i",
    "selftext": "Source: Press Information Bureau (Pib) of India\nhttps://pib.gov.in/PressReleasePage.aspx?PRID=1806601",
    "flair": "Policy/Economy",
    "score": 57,
    "num_comments": 11,
    "created_utc": 1733406250.0,
    "convurl": "https://i.redd.it/v0y87hcqa15e1.png",
    "comments": [
        "To download the maps or see it interactively, visit respective links:\n1. https://datawrapper.dwcdn.net/pkTVD/1/\n2. https://datawrapper.dwcdn.net/7ZQwv/1/\n3. https://datawrapper.dwcdn.net/eoqNt/1/",
        "Kem Cho?",
        "You tell me, kasa aahe tumi? Sab thik? :)",
        "Something something Fake News something something Conspiracy against India something something Soros something something Anti national",
        "how dare you, this is gonna push the narrative that we should give freebies to people, all those kids under 5 deserve to be malnourished , how dare you say that a MINIMUM of 12% of kids in every state are malnourished, very anti national India is a perfect country and we've abolished poverty and ambani adani etc should be getting government money and tax breaks, not FREEBIES for the poor.",
        "Also FYI the modi government completely defunded the Integrated Child Development Services program (the primary government scheme for feeding children under the age of 5 and mothers) in 2016 and later. One of the biggest tragedies for children in our country\n\n\n https://www.thehindu.com/news/national/\nHuge-budget-cut-for-child-health-interventions/article60529622.ece",
        "finally something positive for panjab",
        "Gujju decency in protein showcased. Typical gujju looks like Jay Shah. Never won any Olympic medals but gets maximum money for sports infrastructure.",
        "Yes right. I thought of making a composite rank map including all 3 data. It turned out Punjab did perform one of the best in the calculations of mine. But I didn't post it because I didn't find it very reliable. I had just ranked all states and then found best performing ones combining all. \n\nI needed more suggestions on how to combine these data if possible so we statistically make sense.",
        "the infographic on that page you linked reports a 7% decrease. Is that what you're talking about?",
        "It has a lot of positives, you just need to open your eyes"
    ],
    "cleaned_text": "ive visualized statewise data prevalence underweight wasted stunted children years per nfhs survey source press information bureau pib india ",
    "cleaned_title": "ive visualized statewise data prevalence underweight wasted stunted children years per nfhs survey",
    "cleaned_selftext": "source press information bureau pib india",
    "cleaned_comments": "download maps see interactively visit respective links kem cho tell kasa aahe tumi sab thik something something fake news something something conspiracy india something something soros something something anti national dare gon na push narrative give freebies people kids deserve malnourished dare say minimum kids every state malnourished anti national india perfect country weve abolished poverty ambani adani etc getting government money tax breaks freebies poor also fyi modi government completely defunded integrated child development services program primary government scheme feeding children age mothers later one biggest tragedies children country hugebudgetcutforchildhealthinterventionsarticleece finally something positive panjab gujju decency protein showcased typical gujju looks like jay shah never olympic medals gets maximum money sports infrastructure yes right thought making composite rank map including data turned punjab perform one best calculations mine didnt post didnt find reliable ranked states found best performing ones combining needed suggestions combine data possible statistically make sense infographic page linked reports decrease youre talking lot positives need open eyes",
    "light_cleaned_title": "I've visualized statewise data on prevalence of underweight, wasted and stunted children under 5 years as per NFHS-5 survey",
    "light_cleaned_selftext": "Source: Press Information Bureau (Pib) of India",
    "light_cleaned_comments": "To download the maps or see it interactively, visit respective links: 1. 2. 3. Kem Cho? You tell me, kasa aahe tumi? Sab thik? :) Something something Fake News something something Conspiracy against India something something Soros something something Anti national how dare you, this is gonna push the narrative that we should give freebies to people, all those kids under 5 deserve to be malnourished , how dare you say that a MINIMUM of 12% of kids in every state are malnourished, very anti national India is a perfect country and we've abolished poverty and ambani adani etc should be getting government money and tax breaks, not FREEBIES for the poor. Also FYI the modi government completely defunded the Integrated Child Development Services program (the primary government scheme for feeding children under the age of 5 and mothers) in 2016 and later. One of the biggest tragedies for children in our country Huge-budget-cut-for-child-health-interventions/article60529622.ece finally something positive for panjab Gujju decency in protein showcased. Typical gujju looks like Jay Shah. Never won any Olympic medals but gets maximum money for sports infrastructure. Yes right. I thought of making a composite rank map including all 3 data. It turned out Punjab did perform one of the best in the calculations of mine. But I didn't post it because I didn't find it very reliable. I had just ranked all states and then found best performing ones combining all. I needed more suggestions on how to combine these data if possible so we statistically make sense. the infographic on that page you linked reports a 7% decrease. Is that what you're talking about? It has a lot of positives, you just need to open your eyes"
}