{
    "id": "14ntitd",
    "title": "r/*Urgent* I am at a place with no vets around, need help to save my kitten",
    "url": "https://www.reddit.com/r/india/comments/14ntitd/rurgent_i_am_at_a_place_with_no_vets_around_need/",
    "selftext": "I am at a tier 3 and pretty much I called up all vets and none are available or wants to take a look at cat or dog. \n\nPlease help me save my kitten, it’s one month old was completely well but been very sick since morning.\n\nUpdate1: Here’s him. \n\nhttps://imgur.com/a/Bklv1T7 at around 10pm on 1st July IST. \n\nThe symptoms are he doesn’t seem to move barely seems to have energy seems to be really weak \n\nLays like this all this time hasn’t even changed his position and doesn’t seem to move on his own at all, he does occasionally kick his hind legs. \n\nDoesn’t seem to open his eyes. \n\nThere’s a wheezing sound to breathing, here’s the sound he making. \n\nhttps://voca.ro/1gQO1qe8TP82\n\nUpdate2: one of the other kitten is also sick now same symptoms 23:15pm IST 1st July 2023\n\nUpdate3: both the kitten passed away early this morning. 2nd July 2023 9AM IST\n\nPS; Thank you everyone for your help",
    "flair": "AskIndia",
    "score": 76,
    "num_comments": 66,
    "created_utc": 1688213295.0,
    "convurl": "https://external-preview.redd.it/l0fDJE0pR14rW_k9lxcrEYPpwIrbdbBQ7dJPBXMSP3E.jpg?auto=webp&s=71e205708743c1688443bce523d4451beb3f4c4c",
    "comments": [
        "It's weird to know that a vet doesn't want to treat your kitten. There must be someone or some NGO kind of thing that could help you nearby.\n\nDon't lose hope Mate.",
        "Some vet refuse to treat cat and dogs they only treat goat cow etc, uk specially in tier 3s like this it’s hard to find a doctor I tried multiple one I couldn’t reach tho one doesn’t live here any longer and another said he doesn’t treat cats and dogs. \n\nI am now trying to find a vet",
        "Some YouTube vets do online/WhatsApp consultation",
        "Please name someone if you can, link me up I am actively trying to find a vet here",
        "Can you DM? I can give a vets number...",
        "Dmed",
        "https://youtu.be/hxrUG_MDFS0\n\nThere are numbers in the video description and also one comment .",
        "What are the symptoms of the kitten?",
        "He is just not seem to move or is eating he does eat when I feed him.\n\nHe is not moving at all just laying down on one place other than that there’s this hiccups thing and noise he making occasionally.\n\nReally not sure what I should do at this point.\n\nThis morning if found him in a state a bit better sitting on a wet surface i immediately took him dried him and he was able to stand a bit, but won’t move at all now conditions just seem to get worse.\n\nI have been searching for a vet where I am to take a look at him but no luck yet, so far.\n\nhttps://preview.redd.it/4jv70oq0kd9b1.jpeg?width=3024&format=pjpg&auto=webp&v=enabled&s=12eed32f3e5374ffb85817e5bcbe3a473cd9905a",
        "Are there any major cities nearby? This seems like an emergency. I think it's best if you can drive him there. How is his breathing? Which city are you located at?",
        "He does seem to breath, I am at Nabadwip closest city is Kolkata it’s roughly 4 hours by car",
        "I contacted some Vet YouTubers they said to take him to vet clinic. I am trying too.",
        "Do you have access to a car? I would strongly recommend you go to Kolkata. \nhttp://www.furofeathers.com/\nThat one seems to have 24*7 emergency care, you can take your kitten now.",
        "I don’t have access to car at the moment but I am arranging stuff, waiting for my last light here pretty much who said they could help with the vet. If not I leave with him.\n\nHonestly even short on cash at the moment for car stuff but arranging. Let’s see.",
        "Last light?",
        "*Hope. that the person might be able to arrange a vet to see him.",
        "Did the kitten have loose stool before?",
        "I am not sure honestly, since his mother nurses them.",
        "Okay, you can also try r/askvet",
        "You don't need to go to a tier 1 city. Look for a tier 2 city or so.",
        "The health problem is not clearly mentioned.",
        "Cause I don’t know what’s the problem is.",
        "Symptoms please .",
        "Problem with tier 2s are this doctors ain’t listened on some list or google or have a clinic often times and it’s from word of mouth.",
        "Hey op is he drinking anything??\n\nWhat are the symptoms state please",
        "He can’t move just lays like this doesn’t eat he is eating tho when we feed him. \n\nThat’s the only symptom I found him this morning on wet floor if that’s helps, he couldn’t stand up",
        "I listened to him very closely he does seem to have a wheezing sound to his breath",
        "Take him to a vet asap, try finding if there are vets near you in r/vet or r/AskVet",
        "He is drinking I gave him milk he does feed with spoon a bit, that’s all he doesn’t seem to move and is getting weak by every passing moment",
        "Yes, many kittens in my area suffer the same fate. I really want to help them but since I don't have anything to help. I just accept it as survival of the fittest. Most of adult one's dies too but by the hands of the dogs which come along with the garbage collector. I really hope you save that kitty. I suppose you are capable of pulling it of from the hands of fate.",
        "Cfbr",
        "Brother I am sorry to say this but I think your kitten is about to pass on. The best you can do now, given your situation, is to just keep her warm and near you. Let it pass away peacefully. \n\nMight be some infection, might be something genetic, might just be failure to thrive. \n\nNo way to know, at least not in this country. \n\n9/10 vets give absolute Zero fucks. And that one vet will be like finding a needle in a haystack. \n\nJust make the cat comfortable.",
        "I think so to, this is it. I can’t stop crying, I am keeping them warm, they are with there mother, I am trying to get them as comfortable as I can. \n\nYeah my experience with vets been really bad. I will never be able to forget about this vet who could have taken a look could have done something when things were not this worse, but absolutely did nothing.\n\nHumanity is really, turned on making me into a villain.",
        "Hey OP. I am so sorry. If you are saying the other kitten is sick I wonder if it's parvo virus. It's highly contagious. And please OP. Don't feel bad. You tried your very best. If you can, please take the other kitty to the vet tomorrow. I really hope they both pull through.",
        "I hope so, I really hope so that they can make it tho the night. The other kitten is sick as well detoreated extremely fast as well.\n\nI am praying but, I have this feeling they will not make tho",
        "1. Nabadwip veterinary hospital, Malanchapara - https://g.co/kgs/obBnw6\n(Review say's they treat pet's)\n\n\n2. Dr. Sourav Pal veterinary service - https://g.co/kgs/8GrtK8\n(Review say's they treat pet's)\n\nIf you can travel to Krishnanagar then here are some options.\n\nA. Cure and care veterinary clinic - https://g.co/kgs/WtBW78\n(Review say's they treat pet's)\n\nB. Animal health care - https://g.co/kgs/qxce86\n(Review say's they treat pet's)",
        "Cessna is 24/7 I think ?",
        "Who ever left that comment, regarding the hospital yeah I tried calling the doctor there, as well as a friends dad is a veterinarian doctor at the hospital. \n\nI couldn’t reach them, also someone i knows dog almost died there due to wrong treatment. Couple years back.",
        "Did you try Dr Pets app? That's what I used last time when my pet was sick. Send pics/vids to vet and talk to them on phone. Pay online.",
        "For the love of god don't feed cats milk. Any milk that's not cat milk is harmful. Give them boiled chicken. Your case though might be something else. To deteriorate so fast they both consumed something poisonous, like chocolate/coffee.",
        "Give him some glucose there is cat glucose available \nMight he has consumed some animal that he hasn’t able to digest\nIs something coming out of his mouth?",
        "Dude I know this, by milk I meant kitten formula I have got that cause I nurse babies sometimes.\n\n\nThey probably ate something poisonous but I can’t think of anything nor did I found anything that might be poisonous.",
        "There’s nothing coming out of his mouth, I am not sure if he had consumed something that he can’t digest, so not ruling that out anything’s a possibility.",
        "All the vets I talked to told me this, they need clinical attention there is no clinic that keeps pets or that much infra around here for pets or good medical treatment. \n\nThey passed away early this morning.",
        "Rule No. 1 - ALWAYS REMEMBER - If you try to pet an animal, take it to a vet first. Specially if they are newborn.",
        "Sorry my friend! Could it be that they ate something poisonous?",
        "I highly doubt, but I can’t eliminate any possibilities.",
        "Sorry to hear they passed away same thing happened to me as I was late to notice this behaviour, whenever kittens don't eat and show lethargic behaviour they mostly have worms or cat fever which is very contagious, so get them dewormed you have to give half or quater of a tablet every three month and at this stage saline and some antibiotics injection and ors water the kitten will recover in 2,3 days. Just a query even tire 3 cities have govt veterinary hospital did you try that?",
        "I did no body was available as well as calls went unanswered to work and doctors private number",
        "Just give them deworming tablet half or quarter of the tablet depending on their weight, also it's very cheap, that will solve most if their issues.",
        "This is the case with govt hospital  idiots never pick up calls also depends when you are calling, they are always open though morning until 1 than Evening from 4-7  Sunday closed, you should have gone regardless.",
        "Last time I contacted someone from the hospital was 2 years ago before yesterday when a cat of mine had got into a car accident they said they only treated cows and goats. That’s the thing. Then you will go to google and find cats being treated 3 years ago.",
        "Oh I'm so sorry to hear that mate. They had someone trying to care for them during their last moments - take solace in knowing that their suffering has now ended.",
        "Oh, but this is more of giving antibiotics and saline so should have worked out. Coz it's less of an operation so...just make sure if in future you get kittens give them deworming since or if you won't be able to get them vaccinated, coz they contract worms from anywhere or mostly rats.",
        "Noted",
        "Oh ok, sorry to hear they passed away. From nabadwip, Krishnanagar would have been the closest with some vet options. Kolkata has state govt Vet hospitals in Belgachia. Seeing how they deteriorated rapidly can't say either would have worked out.",
        "I should have taken them to Kolkata from the very beginning, it’s really is my fault for wasting time. \n\nI couldn’t even face the sight of their dead bodies, yet I kept staring at them still hoping they will come back alive. All tho they are dead I know it. \n\nThis tears just won’t stop. \n\nthe problem is all the vets in the area I tried were unavailable, didn’t pick up or straight refused and there are more vets probably and they ain’t listed on google. That’s the biggest problem I faced.",
        "I am so sorry brother",
        "I am sorry, wish I could have helped you and the kittens more.",
        "Everything that could go wrong went wrong, yesterday, and things have only turned for the worse today. These 2 kittens were part of a litter of 4, the first kitten had died after falling from the second floor, in an unfortunate accident, when nobody was seeing them except their mother. \n\nThese two died under the weird circumstances and this evening the last of the litter cant be found anywhere in the house, it seems his mother had taken him out in the garden last spotted. \n\nTried searching for 7 hours today but nowhere to be found. The July has just begun and already so many tragedies have taken place. I don't know what to do anymore. Can't even close my eyes without thinking of them, crying won't stop, they could have easily been alive right now if I had not tried to find a vet around this area and left for Kolkata by any means immediately. \n\nmy loved ones just seem to leave me it, seems. everybody.",
        "🫂",
        "Theres no guarantee it would have worked. The rocky road could have made things worse. You would have also missed taking the other cat that got sick later. Don't beat yourself up, you were there to console them was one of the safest option could be done for the situation.",
        "Any updates?",
        "On the kittens? Passed away. They had severe upper respiratory tract infection, pneumonia.",
        "Were you able to find a vet? That's so unfortunate."
    ],
    "cleaned_text": "rurgent place vets around need help save kitten tier pretty much called vets none available wants take look cat dog please help save kitten one month old completely well sick since morning update heres around pm st july ist symptoms doesnt seem move barely seems energy seems really weak lays like time hasnt even changed position doesnt seem move occasionally kick hind legs doesnt seem open eyes theres wheezing sound breathing heres sound making update one kitten also sick symptoms pm ist st july update kitten passed away early morning nd july ist ps thank everyone help ",
    "cleaned_title": "rurgent place vets around need help save kitten",
    "cleaned_selftext": "tier pretty much called vets none available wants take look cat dog please help save kitten one month old completely well sick since morning update heres around pm st july ist symptoms doesnt seem move barely seems energy seems really weak lays like time hasnt even changed position doesnt seem move occasionally kick hind legs doesnt seem open eyes theres wheezing sound breathing heres sound making update one kitten also sick symptoms pm ist st july update kitten passed away early morning nd july ist ps thank everyone help",
    "cleaned_comments": "weird know vet doesnt want treat kitten must someone ngo kind thing could help nearby dont lose hope mate vet refuse treat cat dogs treat goat cow etc uk specially tier like hard find doctor tried multiple one couldnt reach tho one doesnt live longer another said doesnt treat cats dogs trying find vet youtube vets onlinewhatsapp consultation please name someone link actively trying find vet dm give vets number dmed numbers video description also one comment symptoms kitten seem move eating eat feed moving laying one place theres hiccups thing noise making occasionally really sure point morning found state bit better sitting wet surface immediately took dried able stand bit wont move conditions seem get worse searching vet take look luck yet far major cities nearby seems like emergency think best drive breathing city located seem breath nabadwip closest city kolkata roughly hours car contacted vet youtubers said take vet clinic trying access car would strongly recommend go kolkata one seems emergency care take kitten dont access car moment arranging stuff waiting last light pretty much said could help vet leave honestly even short cash moment car stuff arranging lets see last light hope person might able arrange vet see kitten loose stool sure honestly since mother nurses okay also try raskvet dont need go tier city look tier city health problem clearly mentioned cause dont know whats problem symptoms please problem tier doctors aint listened list google clinic often times word mouth hey op drinking anything symptoms state please cant move lays like doesnt eat eating tho feed thats symptom found morning wet floor thats helps couldnt stand listened closely seem wheezing sound breath take vet asap try finding vets near rvet raskvet drinking gave milk feed spoon bit thats doesnt seem move getting weak every passing moment yes many kittens area suffer fate really want help since dont anything help accept survival fittest adult ones dies hands dogs come along garbage collector really hope save kitty suppose capable pulling hands fate cfbr brother sorry say think kitten pass best given situation keep warm near let pass away peacefully might infection might something genetic might failure thrive way know least country vets give absolute zero fucks one vet like finding needle haystack make cat comfortable think cant stop crying keeping warm mother trying get comfortable yeah experience vets really bad never able forget vet could taken look could done something things worse absolutely nothing humanity really turned making villain hey op sorry saying kitten sick wonder parvo virus highly contagious please op dont feel bad tried best please take kitty vet tomorrow really hope pull hope really hope make tho night kitten sick well detoreated extremely fast well praying feeling make tho nabadwip veterinary hospital malanchapara review says treat pets dr sourav pal veterinary service review says treat pets travel krishnanagar options cure care veterinary clinic review says treat pets b animal health care review says treat pets cessna think ever left comment regarding hospital yeah tried calling doctor well friends dad veterinarian doctor hospital couldnt reach also someone knows dog almost died due wrong treatment couple years back try dr pets app thats used last time pet sick send picsvids vet talk phone pay online love god dont feed cats milk milk thats cat milk harmful give boiled chicken case though might something else deteriorate fast consumed something poisonous like chocolatecoffee give glucose cat glucose available might consumed animal hasnt able digest something coming mouth dude know milk meant kitten formula got cause nurse babies sometimes probably ate something poisonous cant think anything found anything might poisonous theres nothing coming mouth sure consumed something cant digest ruling anythings possibility vets talked told need clinical attention clinic keeps pets much infra around pets good medical treatment passed away early morning rule always remember try pet animal take vet first specially newborn sorry friend could ate something poisonous highly doubt cant eliminate possibilities sorry hear passed away thing happened late notice behaviour whenever kittens dont eat show lethargic behaviour mostly worms cat fever contagious get dewormed give half quater tablet every three month stage saline antibiotics injection ors water kitten recover days query even tire cities govt veterinary hospital try body available well calls went unanswered work doctors private number give deworming tablet half quarter tablet depending weight also cheap solve issues case govt hospital idiots never pick calls also depends calling always open though morning evening sunday closed gone regardless last time contacted someone hospital years ago yesterday cat mine got car accident said treated cows goats thats thing go google find cats treated years ago oh im sorry hear mate someone trying care last moments take solace knowing suffering ended oh giving antibiotics saline worked coz less operation sojust make sure future get kittens give deworming since wont able get vaccinated coz contract worms anywhere mostly rats noted oh ok sorry hear passed away nabadwip krishnanagar would closest vet options kolkata state govt vet hospitals belgachia seeing deteriorated rapidly cant say either would worked taken kolkata beginning really fault wasting time couldnt even face sight dead bodies yet kept staring still hoping come back alive tho dead know tears wont stop problem vets area tried unavailable didnt pick straight refused vets probably aint listed google thats biggest problem faced sorry brother sorry wish could helped kittens everything could go wrong went wrong yesterday things turned worse today kittens part litter first kitten died falling second floor unfortunate accident nobody seeing except mother two died weird circumstances evening last litter cant found anywhere house seems mother taken garden last spotted tried searching hours today nowhere found july begun already many tragedies taken place dont know anymore cant even close eyes without thinking crying wont stop could easily alive right tried find vet around area left kolkata means immediately loved ones seem leave seems everybody theres guarantee would worked rocky road could made things worse would also missed taking cat got sick later dont beat console one safest option could done situation updates kittens passed away severe upper respiratory tract infection pneumonia able find vet thats unfortunate",
    "light_cleaned_title": "r/*Urgent* I am at a place with no vets around, need help to save my kitten",
    "light_cleaned_selftext": "I am at a tier 3 and pretty much I called up all vets and none are available or wants to take a look at cat or dog. Please help me save my kitten, it’s one month old was completely well but been very sick since morning. Update1: Here’s him. at around 10pm on 1st July IST. The symptoms are he doesn’t seem to move barely seems to have energy seems to be really weak Lays like this all this time hasn’t even changed his position and doesn’t seem to move on his own at all, he does occasionally kick his hind legs. Doesn’t seem to open his eyes. There’s a wheezing sound to breathing, here’s the sound he making. Update2: one of the other kitten is also sick now same symptoms 23:15pm IST 1st July 2023 Update3: both the kitten passed away early this morning. 2nd July 2023 9AM IST PS; Thank you everyone for your help",
    "light_cleaned_comments": "It's weird to know that a vet doesn't want to treat your kitten. There must be someone or some NGO kind of thing that could help you nearby. Don't lose hope Mate. Some vet refuse to treat cat and dogs they only treat goat cow etc, uk specially in tier 3s like this it’s hard to find a doctor I tried multiple one I couldn’t reach tho one doesn’t live here any longer and another said he doesn’t treat cats and dogs. I am now trying to find a vet Some YouTube vets do online/WhatsApp consultation Please name someone if you can, link me up I am actively trying to find a vet here Can you DM? I can give a vets number... Dmed There are numbers in the video description and also one comment . What are the symptoms of the kitten? He is just not seem to move or is eating he does eat when I feed him. He is not moving at all just laying down on one place other than that there’s this hiccups thing and noise he making occasionally. Really not sure what I should do at this point. This morning if found him in a state a bit better sitting on a wet surface i immediately took him dried him and he was able to stand a bit, but won’t move at all now conditions just seem to get worse. I have been searching for a vet where I am to take a look at him but no luck yet, so far. Are there any major cities nearby? This seems like an emergency. I think it's best if you can drive him there. How is his breathing? Which city are you located at? He does seem to breath, I am at Nabadwip closest city is Kolkata it’s roughly 4 hours by car I contacted some Vet YouTubers they said to take him to vet clinic. I am trying too. Do you have access to a car? I would strongly recommend you go to Kolkata. That one seems to have 24*7 emergency care, you can take your kitten now. I don’t have access to car at the moment but I am arranging stuff, waiting for my last light here pretty much who said they could help with the vet. If not I leave with him. Honestly even short on cash at the moment for car stuff but arranging. Let’s see. Last light? *Hope. that the person might be able to arrange a vet to see him. Did the kitten have loose stool before? I am not sure honestly, since his mother nurses them. Okay, you can also try r/askvet You don't need to go to a tier 1 city. Look for a tier 2 city or so. The health problem is not clearly mentioned. Cause I don’t know what’s the problem is. Symptoms please . Problem with tier 2s are this doctors ain’t listened on some list or google or have a clinic often times and it’s from word of mouth. Hey op is he drinking anything?? What are the symptoms state please He can’t move just lays like this doesn’t eat he is eating tho when we feed him. That’s the only symptom I found him this morning on wet floor if that’s helps, he couldn’t stand up I listened to him very closely he does seem to have a wheezing sound to his breath Take him to a vet asap, try finding if there are vets near you in r/vet or r/AskVet He is drinking I gave him milk he does feed with spoon a bit, that’s all he doesn’t seem to move and is getting weak by every passing moment Yes, many kittens in my area suffer the same fate. I really want to help them but since I don't have anything to help. I just accept it as survival of the fittest. Most of adult one's dies too but by the hands of the dogs which come along with the garbage collector. I really hope you save that kitty. I suppose you are capable of pulling it of from the hands of fate. Cfbr Brother I am sorry to say this but I think your kitten is about to pass on. The best you can do now, given your situation, is to just keep her warm and near you. Let it pass away peacefully. Might be some infection, might be something genetic, might just be failure to thrive. No way to know, at least not in this country. 9/10 vets give absolute Zero fucks. And that one vet will be like finding a needle in a haystack. Just make the cat comfortable. I think so to, this is it. I can’t stop crying, I am keeping them warm, they are with there mother, I am trying to get them as comfortable as I can. Yeah my experience with vets been really bad. I will never be able to forget about this vet who could have taken a look could have done something when things were not this worse, but absolutely did nothing. Humanity is really, turned on making me into a villain. Hey OP. I am so sorry. If you are saying the other kitten is sick I wonder if it's parvo virus. It's highly contagious. And please OP. Don't feel bad. You tried your very best. If you can, please take the other kitty to the vet tomorrow. I really hope they both pull through. I hope so, I really hope so that they can make it tho the night. The other kitten is sick as well detoreated extremely fast as well. I am praying but, I have this feeling they will not make tho 1. Nabadwip veterinary hospital, Malanchapara - (Review say's they treat pet's) 2. Dr. Sourav Pal veterinary service - (Review say's they treat pet's) If you can travel to Krishnanagar then here are some options. A. Cure and care veterinary clinic - (Review say's they treat pet's) B. Animal health care - (Review say's they treat pet's) Cessna is 24/7 I think ? Who ever left that comment, regarding the hospital yeah I tried calling the doctor there, as well as a friends dad is a veterinarian doctor at the hospital. I couldn’t reach them, also someone i knows dog almost died there due to wrong treatment. Couple years back. Did you try Dr Pets app? That's what I used last time when my pet was sick. Send pics/vids to vet and talk to them on phone. Pay online. For the love of god don't feed cats milk. Any milk that's not cat milk is harmful. Give them boiled chicken. Your case though might be something else. To deteriorate so fast they both consumed something poisonous, like chocolate/coffee. Give him some glucose there is cat glucose available Might he has consumed some animal that he hasn’t able to digest Is something coming out of his mouth? Dude I know this, by milk I meant kitten formula I have got that cause I nurse babies sometimes. They probably ate something poisonous but I can’t think of anything nor did I found anything that might be poisonous. There’s nothing coming out of his mouth, I am not sure if he had consumed something that he can’t digest, so not ruling that out anything’s a possibility. All the vets I talked to told me this, they need clinical attention there is no clinic that keeps pets or that much infra around here for pets or good medical treatment. They passed away early this morning. Rule No. 1 - ALWAYS REMEMBER - If you try to pet an animal, take it to a vet first. Specially if they are newborn. Sorry my friend! Could it be that they ate something poisonous? I highly doubt, but I can’t eliminate any possibilities. Sorry to hear they passed away same thing happened to me as I was late to notice this behaviour, whenever kittens don't eat and show lethargic behaviour they mostly have worms or cat fever which is very contagious, so get them dewormed you have to give half or quater of a tablet every three month and at this stage saline and some antibiotics injection and ors water the kitten will recover in 2,3 days. Just a query even tire 3 cities have govt veterinary hospital did you try that? I did no body was available as well as calls went unanswered to work and doctors private number Just give them deworming tablet half or quarter of the tablet depending on their weight, also it's very cheap, that will solve most if their issues. This is the case with govt hospital idiots never pick up calls also depends when you are calling, they are always open though morning until 1 than Evening from 4-7 Sunday closed, you should have gone regardless. Last time I contacted someone from the hospital was 2 years ago before yesterday when a cat of mine had got into a car accident they said they only treated cows and goats. That’s the thing. Then you will go to google and find cats being treated 3 years ago. Oh I'm so sorry to hear that mate. They had someone trying to care for them during their last moments - take solace in knowing that their suffering has now ended. Oh, but this is more of giving antibiotics and saline so should have worked out. Coz it's less of an operation so...just make sure if in future you get kittens give them deworming since or if you won't be able to get them vaccinated, coz they contract worms from anywhere or mostly rats. Noted Oh ok, sorry to hear they passed away. From nabadwip, Krishnanagar would have been the closest with some vet options. Kolkata has state govt Vet hospitals in Belgachia. Seeing how they deteriorated rapidly can't say either would have worked out. I should have taken them to Kolkata from the very beginning, it’s really is my fault for wasting time. I couldn’t even face the sight of their dead bodies, yet I kept staring at them still hoping they will come back alive. All tho they are dead I know it. This tears just won’t stop. the problem is all the vets in the area I tried were unavailable, didn’t pick up or straight refused and there are more vets probably and they ain’t listed on google. That’s the biggest problem I faced. I am so sorry brother I am sorry, wish I could have helped you and the kittens more. Everything that could go wrong went wrong, yesterday, and things have only turned for the worse today. These 2 kittens were part of a litter of 4, the first kitten had died after falling from the second floor, in an unfortunate accident, when nobody was seeing them except their mother. These two died under the weird circumstances and this evening the last of the litter cant be found anywhere in the house, it seems his mother had taken him out in the garden last spotted. Tried searching for 7 hours today but nowhere to be found. The July has just begun and already so many tragedies have taken place. I don't know what to do anymore. Can't even close my eyes without thinking of them, crying won't stop, they could have easily been alive right now if I had not tried to find a vet around this area and left for Kolkata by any means immediately. my loved ones just seem to leave me it, seems. everybody. 🫂 Theres no guarantee it would have worked. The rocky road could have made things worse. You would have also missed taking the other cat that got sick later. Don't beat yourself up, you were there to console them was one of the safest option could be done for the situation. Any updates? On the kittens? Passed away. They had severe upper respiratory tract infection, pneumonia. Were you able to find a vet? That's so unfortunate."
}