{
    "id": "1ccaoxd",
    "title": "Why so much hoopla on wealth distribution.. When it is already happening ?",
    "url": "https://www.reddit.com/r/india/comments/1ccaoxd/why_so_much_hoopla_on_wealth_distribution_when_it/",
    "selftext": "\nI mean... Whether we like it or not... wealth is getting distributed even now... But in the upwards direction.  \n\nSee this report.. . we are already paying double of the actual coal price to Adani ji.... And that's only one aspect of \"distribution\" https://www.ft.com/content/7aadb3d7-4a03-44ba-a01e-8ddd8bce29ed\n\nElectoral bonds was another massive wealth distribution scheme.\nAlso, Widening of Wealth inequality is well documented as well. \n\nSo.. Yeah.. It is happening already and with increasing rate. \n\nAnother bizarre thing is that middle class is up in arms about it while referring to itself as wealthy! \nFfs... Our Chillar is not wealth!\nI mean from our PoV it surely is... But when we talk about wealth tax ... We talk about super rich. \n\nAnd i think govt should seriously explore wealth tax and inheritance tax so that some burden can be eased off from us middle class...this is the only way to tax these rich politicians, farmers and businessmen who have accumulated wealth by gaming the system. \n\nAlready as salaried class we are paying a version of wealth tax.. 50 lakh se upar salary.. Boom.. surcharge.. 1 cr se upar salary.. Boom.. Another surcharge. Direct + indirect mila ke 40%-45%tax chala jaata hai. \n\nHence We should welcome all discussions around taxation which will widen the net. \n\n\nTypo in heading. Cannot edit. \n",
    "flair": "Policy/Economy",
    "score": 6,
    "num_comments": 8,
    "created_utc": 1713995376.0,
    "convurl": "https://external-preview.redd.it/Yf6bdjiGBg_Hywt20bUx1dVbdaUvFsTjk96iEzyQXg4.jpg?auto=webp&s=519f3ec5eeff7165d20fdfe1ecfff8fa298440cd",
    "comments": [
        "> Another bizarre thing is that middle class is up in arms about it while referring to itself as wealthy! Ffs... Our Chillar is not wealth! I mean from our PoV it surely is... But when we talk about wealth tax ... We talk about super rich.\n\nMany of them dream that they will sharktank their way into that 1% and do not want the dream version of themselves to be taxed \"unfairly\". Since they had to work hard to earn their \"wealth\" they assume the rich had to do the same and are therefore deserving of it. Since people generally care more about fairness than equality, their minds find it unfair to heavily tax the super rich, especially in the last decade where they have been put on a pedestal. Just see how Ambanis were talked about in early 2010s vs now.  \n\n____\n\nYou might find this interesting:\n\n> Understanding attitudes to inequality\n\n\n> https://www.nature.com/articles/s41562-017-0166",
        "The problem is that you can never make the truly wealthy pay. They have too many options. If Europeans couldn't do it, how do you think India will? Most of Europe abandoned a wealth tax because it was very hard to enforce. Plus it causes capital flight (ask Sweeden ) so the investment atmosphere becomes worse. Such taxes only extract wealth from the top 20% or so, most on reddit easily fit into that group. Plus growth reduces. \n\nAlso, a wealth tax wouldn't really stop any of the activities you mentioned. So it essentially just add to it. \n\nInheritance tax would be really bad, in India most wealth is held within the family structure. Plus for most people the only safety net they have is money earned by previous generations. \n\n\nPlus, a wealth tax would make accumulation of wealth very hard for those in the first generation wealthy. Old money will never pay, India had huge taxes before the 90s on inheritance, etc , Tatas, Ambanis, Birlas, Wadias, Hudujas, etc still exist. But new money will have to pay, since they don't have the circles or armies of lawyers and  accounts to save them. In lot of high tax Europe this is how it is, there are dynasties with shit tonne of money and before anybody can try to reach them, they are taxed plus suddenly compition laws start to apply.",
        "A person with wealth is an individual. Individuals have autonomy and rights. There are countries without inheritance tax. Individual decides to take his capital via innumerable tax code loopholes to other countries to secure his wealth for future generations. You and clown policy makers shocked pikachu face !",
        "Because the super rich won’t pay. They’ll set up trusts or park money outside the country. Rest of them will continue using black money and not declare anything.\n\nWhat will the government do? Tax the middle class and upper middle class then. Even those with 50-60L of wealth will be taxed because from statistics even they will be 1% of India.\n\nAs you said, it’s already happening with the income taxes. The rich use businesses to deduct expenses, claim depreciation and IGST or just fake receipts. The middle and upper middle class on the other hand pays tax, surcharge and cess.",
        "In the past we had rich people contributing to society - schools, research institutes, hospitals . Probably they had seen suffering more closely and decided to improve situation \n\nCurrent super, especially one make mine from real estate, rich live a luxurious life with no sensitivity to society .  ",
        "Yes South wealth distributed to one North state",
        "1% is an idiom, it doesn't literally mean the 1% because that differs by country."
    ],
    "cleaned_text": "much hoopla wealth distribution already happening mean whether like wealth getting distributed even upwards direction see report already paying double actual coal price adani ji thats one aspect distribution electoral bonds another massive wealth distribution scheme also widening wealth inequality well documented well yeah happening already increasing rate another bizarre thing middle class arms referring wealthy ffs chillar wealth mean pov surely talk wealth tax talk super rich think govt seriously explore wealth tax inheritance tax burden eased us middle classthis way tax rich politicians farmers businessmen accumulated wealth gaming system already salaried class paying version wealth tax lakh se upar salary boom surcharge cr se upar salary boom another surcharge direct indirect mila ke tax chala jaata hai hence welcome discussions around taxation widen net typo heading edit ",
    "cleaned_title": "much hoopla wealth distribution already happening",
    "cleaned_selftext": "mean whether like wealth getting distributed even upwards direction see report already paying double actual coal price adani ji thats one aspect distribution electoral bonds another massive wealth distribution scheme also widening wealth inequality well documented well yeah happening already increasing rate another bizarre thing middle class arms referring wealthy ffs chillar wealth mean pov surely talk wealth tax talk super rich think govt seriously explore wealth tax inheritance tax burden eased us middle classthis way tax rich politicians farmers businessmen accumulated wealth gaming system already salaried class paying version wealth tax lakh se upar salary boom surcharge cr se upar salary boom another surcharge direct indirect mila ke tax chala jaata hai hence welcome discussions around taxation widen net typo heading edit",
    "cleaned_comments": "another bizarre thing middle class arms referring wealthy ffs chillar wealth mean pov surely talk wealth tax talk super rich many dream sharktank way want dream version taxed unfairly since work hard earn wealth assume rich therefore deserving since people generally care fairness equality minds find unfair heavily tax super rich especially last decade put pedestal see ambanis talked early vs might find interesting understanding attitudes inequality problem never make truly wealthy pay many options europeans couldnt think india europe abandoned wealth tax hard enforce plus causes capital flight ask sweeden investment atmosphere becomes worse taxes extract wealth top reddit easily fit group plus growth reduces also wealth tax wouldnt really stop activities mentioned essentially add inheritance tax would really bad india wealth held within family structure plus people safety net money earned previous generations plus wealth tax would make accumulation wealth hard first generation wealthy old money never pay india huge taxes inheritance etc tatas ambanis birlas wadias hudujas etc still exist new money pay since dont circles armies lawyers accounts save lot high tax europe dynasties shit tonne money anybody try reach taxed plus suddenly compition laws start apply person wealth individual individuals autonomy rights countries without inheritance tax individual decides take capital via innumerable tax code loopholes countries secure wealth future generations clown policy makers shocked pikachu face super rich wont pay theyll set trusts park money outside country rest continue using black money declare anything government tax middle class upper middle class even l wealth taxed statistics even india said already happening income taxes rich use businesses deduct expenses claim depreciation igst fake receipts middle upper middle class hand pays tax surcharge cess past rich people contributing society schools research institutes hospitals probably seen suffering closely decided improve situation current super especially one make mine real estate rich live luxurious life sensitivity society yes south wealth distributed one north state idiom doesnt literally mean differs country",
    "light_cleaned_title": "Why so much hoopla on wealth distribution.. When it is already happening ?",
    "light_cleaned_selftext": "I mean... Whether we like it or not... wealth is getting distributed even now... But in the upwards direction. See this report.. . we are already paying double of the actual coal price to Adani ji.... And that's only one aspect of \"distribution\" Electoral bonds was another massive wealth distribution scheme. Also, Widening of Wealth inequality is well documented as well. So.. Yeah.. It is happening already and with increasing rate. Another bizarre thing is that middle class is up in arms about it while referring to itself as wealthy! Ffs... Our Chillar is not wealth! I mean from our PoV it surely is... But when we talk about wealth tax ... We talk about super rich. And i think govt should seriously explore wealth tax and inheritance tax so that some burden can be eased off from us middle class...this is the only way to tax these rich politicians, farmers and businessmen who have accumulated wealth by gaming the system. Already as salaried class we are paying a version of wealth tax.. 50 lakh se upar salary.. Boom.. surcharge.. 1 cr se upar salary.. Boom.. Another surcharge. Direct + indirect mila ke 40%-45%tax chala jaata hai. Hence We should welcome all discussions around taxation which will widen the net. Typo in heading. Cannot edit.",
    "light_cleaned_comments": "> Another bizarre thing is that middle class is up in arms about it while referring to itself as wealthy! Ffs... Our Chillar is not wealth! I mean from our PoV it surely is... But when we talk about wealth tax ... We talk about super rich. Many of them dream that they will sharktank their way into that 1% and do not want the dream version of themselves to be taxed \"unfairly\". Since they had to work hard to earn their \"wealth\" they assume the rich had to do the same and are therefore deserving of it. Since people generally care more about fairness than equality, their minds find it unfair to heavily tax the super rich, especially in the last decade where they have been put on a pedestal. Just see how Ambanis were talked about in early 2010s vs now. ____ You might find this interesting: > Understanding attitudes to inequality > The problem is that you can never make the truly wealthy pay. They have too many options. If Europeans couldn't do it, how do you think India will? Most of Europe abandoned a wealth tax because it was very hard to enforce. Plus it causes capital flight (ask Sweeden ) so the investment atmosphere becomes worse. Such taxes only extract wealth from the top 20% or so, most on reddit easily fit into that group. Plus growth reduces. Also, a wealth tax wouldn't really stop any of the activities you mentioned. So it essentially just add to it. Inheritance tax would be really bad, in India most wealth is held within the family structure. Plus for most people the only safety net they have is money earned by previous generations. Plus, a wealth tax would make accumulation of wealth very hard for those in the first generation wealthy. Old money will never pay, India had huge taxes before the 90s on inheritance, etc , Tatas, Ambanis, Birlas, Wadias, Hudujas, etc still exist. But new money will have to pay, since they don't have the circles or armies of lawyers and accounts to save them. In lot of high tax Europe this is how it is, there are dynasties with shit tonne of money and before anybody can try to reach them, they are taxed plus suddenly compition laws start to apply. A person with wealth is an individual. Individuals have autonomy and rights. There are countries without inheritance tax. Individual decides to take his capital via innumerable tax code loopholes to other countries to secure his wealth for future generations. You and clown policy makers shocked pikachu face ! Because the super rich won’t pay. They’ll set up trusts or park money outside the country. Rest of them will continue using black money and not declare anything. What will the government do? Tax the middle class and upper middle class then. Even those with 50-60L of wealth will be taxed because from statistics even they will be 1% of India. As you said, it’s already happening with the income taxes. The rich use businesses to deduct expenses, claim depreciation and IGST or just fake receipts. The middle and upper middle class on the other hand pays tax, surcharge and cess. In the past we had rich people contributing to society - schools, research institutes, hospitals . Probably they had seen suffering more closely and decided to improve situation Current super, especially one make mine from real estate, rich live a luxurious life with no sensitivity to society . Yes South wealth distributed to one North state 1% is an idiom, it doesn't literally mean the 1% because that differs by country."
}