{
    "id": "p8idhe",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/p8idhe/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 20,
    "num_comments": 52,
    "created_utc": 1629509416,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Hey you guys.. so recently I finished a French show called \"Dix pour cent\" or \"Call My Agent\". It's on Netflix and it's pretty cool. The characters have a good development and it's not just focussed on one person, and I like that. So it's a show about a Talent Firm and it's agents, their relationship with actors, writers, producers and how they're trying to keep the firm afloat, while their work lives get mixed with their personal (of course). Camille Cottin acted brilliantly and is being recognised internationally!! She totally deserves it!\n\nThey will prolly come up with another season soon, but this was a good ending, they sort of tied up the loose ends, but I can't wait to watch when the new season drops of course.",
        "For Sherlock Holmes fans here, many Sherlock Holmes movies are now colorized and available on you tube.",
        "Watching Psych for the first time! Pretty good show to pass time. Don't know why I never watched it earlier",
        "link please",
        "https://www.youtube.com/results?search_query=sherlock+holmes+colorized+movies+\n\nBasil Rathbone movies from 40s are mostly now in colour.",
        "Yup, definitely captivating. I mentioned in the last thread.",
        "Revisited rezero s2 p1, didnt get the same goosebumps I had while watching for the first time but was amazing\n\nThe soundtracks, the voice acting and the whole tense atmosphere felt so great\n\n10/10 would recommend people to watch it",
        "So everyone on reddit always said hindi series on television were really bad so I never saw them. I only ever saw English series. \n\nRecently came across Crime Patrol Satark, its quite good.",
        "'Crime patrol satark ' which is produced by optimystix is good other production companies '  'crime patrol dial 100' etc is bad.",
        "yeah satark and dastak are based on real stories apparently, the others are made up",
        "Ted Lasso ftw",
        "will rewatch \"have a good trip\" on netflix today\n\nalso excited for the upcoming inspiration4 documentary",
        "Watched Undekhi on Sony LIV. Was terrified whole time",
        "Dastak and satrak and specially there old episodes are best. They covered scams roberry and many other type of crime. But after that they become monotonous with episode based on adultery, murder and rape.",
        "Binged The Brink.. Hilarious geo political satire starring Jack Black and Tim Robbins..",
        "Bingeing on Nordic noir. Started with Katla, continued with The Valhalla Murders, planning to see Trapped now.\n\nAny other such tv series or movies that portrays iceland and other nordic countries in its glory?",
        "Bron/Broen",
        "Trapped is good on Netflix",
        "Black Sunday by Mario Bava is the vintage horror movie I've always wanted.",
        "I never realised how tall Tim Robbins is, until I watched that show.",
        "that TV show with Jeremy Brett starring as Sherlock Holmes is a must watch. They stayed true to the novels/stories in that series.\n\nhttps://en.wikipedia.org/wiki/Sherlock_Holmes_(1984_TV_series)",
        "I only watched one of its episodes because it had Monica Bellucci haha.",
        "Oh hell yes!",
        "Documentary about Goa from France24 TV Channel.\n\nhttps://www.youtube.com/watch?v=0CtovCZVI6A",
        "Jeremy Brett is the best Holmes I feel, a notch slightly above Basil Rathbone.",
        "You know what, Rebecca is chatting with Ted on the new dating app.",
        "Mentalist is better",
        "Watched it long ago",
        "its an average series and the last 4 episodes were stretched a lot.",
        "Lol I love how this shit is triggering the ted lasso sub- few people are having a meltdown.\n\nBut it’s such a good show 30 minutes of constant smiling while watching is rare for a tv show.",
        "Mystery genre based  tv series and YT channels batao 😤😤😤\n\nLemmino was good",
        "Straight from my heart- great podcast for poetry lovers.",
        "Comparing apples to oranges. Not every deck of cards is uno.\n\nPsych is at times nonsensical and at times meta-humour. Mentalist is a standard procedural, albeit interesting at times. Psych in fact mentions Mentalist multiple times (in a good light lest you get worried).",
        "I remember reading that the show was cancelled. The recent interest sparked talks of a movie though",
        "If you prefer watching another french series, Au service de la France or A very secret service is quite cool.",
        "Oh yes, it was recommended me to and I did start it, and I'm sure it's a good show.. I'm just not in that state of mind to watch it rn. \nBut I will restart it soon :))",
        "Ayee spoiler alertt!",
        "Its a great show! I enjoyed it a lot",
        "Binge watching peep show. funniest show I have ever seen.",
        "You gotta check out Reignbot, Nexpo and Nightmind. All youtube channels and they deal with some fun topics",
        "Oi, I am just speculating (In Roy Kent's voice).",
        "Desperate for some tips for south indian or north eastern films. Can't swallow bollywood or most indies without at least some indigestion. My neighbour is from kerela and supposedly an artist but every time I bring this up with him, he just hands me a stack of his mother's appams, I have no idea what that has to do with movies. Somebody help.",
        "Hindi dubbed marathi tv serial 'raat ka hai khel saara ' on zee5",
        "\"Bell bottom\" is utter dogshit.. Not because I am anti-canadian. \n\nThe film sucks from beginning to end...",
        "Saw Mimi recently! It was good.",
        "Shershaah too..",
        "From this year, check out \"The Great Indian Kitchen\" (Malayalam). It should be on Amazon Prime Video.\n\nExcerpt from Wikipedia:\n\n*The Great Indian Kitchen is a 2021 Indian Malayalam-language drama film written and directed by Jeo Baby. The film tells the story of a newly wed woman who struggles to be the submissive wife that her husband and his family expect her to be.*",
        "Not sure about the glory part, but check these out on Netflix:\n\n\\* Occupied (Norwegian/English/Russian)\n\n\\* Borgen (Danish)",
        "Haha. You're welcome 😄",
        "I was wrong 😝",
        "Memories of a Murderer: The Nilsen Tapes  \nIt was alright, quite a grim tale"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "hey guys recently finished french show called dix pour cent call agent netflix pretty cool characters good development focussed one person like show talent firm agents relationship actors writers producers theyre trying keep firm afloat work lives get mixed personal course camille cottin acted brilliantly recognised internationally totally deserves prolly come another season soon good ending sort tied loose ends cant wait watch new season drops course sherlock holmes fans many sherlock holmes movies colorized available tube watching psych first time pretty good show pass time dont know never watched earlier link please basil rathbone movies mostly colour yup definitely captivating mentioned last thread revisited rezero p didnt get goosebumps watching first time amazing soundtracks voice acting whole tense atmosphere felt great would recommend people watch everyone reddit always said hindi series television really bad never saw ever saw english series recently came across crime patrol satark quite good crime patrol satark produced optimystix good production companies crime patrol dial etc bad yeah satark dastak based real stories apparently others made ted lasso ftw rewatch good trip netflix today also excited upcoming inspiration documentary watched undekhi sony liv terrified whole time dastak satrak specially old episodes best covered scams roberry many type crime become monotonous episode based adultery murder rape binged brink hilarious geo political satire starring jack black tim robbins bingeing nordic noir started katla continued valhalla murders planning see trapped tv series movies portrays iceland nordic countries glory bronbroen trapped good netflix black sunday mario bava vintage horror movie ive always wanted never realised tall tim robbins watched show tv show jeremy brett starring sherlock holmes must watch stayed true novelsstories series watched one episodes monica bellucci haha oh hell yes documentary goa france tv channel jeremy brett best holmes feel notch slightly basil rathbone know rebecca chatting ted new dating app mentalist better watched long ago average series last episodes stretched lot lol love shit triggering ted lasso sub people meltdown good show minutes constant smiling watching rare tv show mystery genre based tv series yt channels batao lemmino good straight heart great podcast poetry lovers comparing apples oranges every deck cards uno psych times nonsensical times metahumour mentalist standard procedural albeit interesting times psych fact mentions mentalist multiple times good light lest get worried remember reading show cancelled recent interest sparked talks movie though prefer watching another french series au service de la france secret service quite cool oh yes recommended start im sure good show im state mind watch rn restart soon ayee spoiler alertt great show enjoyed lot binge watching peep show funniest show ever seen got ta check reignbot nexpo nightmind youtube channels deal fun topics oi speculating roy kents voice desperate tips south indian north eastern films cant swallow bollywood indies without least indigestion neighbour kerela supposedly artist every time bring hands stack mothers appams idea movies somebody help hindi dubbed marathi tv serial raat ka hai khel saara zee bell bottom utter dogshit anticanadian film sucks beginning end saw mimi recently good shershaah year check great indian kitchen malayalam amazon prime video excerpt wikipedia great indian kitchen indian malayalamlanguage drama film written directed jeo baby film tells story newly wed woman struggles submissive wife husband family expect sure glory part check netflix occupied norwegianenglishrussian borgen danish haha youre welcome wrong memories murderer nilsen tapes alright quite grim tale",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Hey you guys.. so recently I finished a French show called \"Dix pour cent\" or \"Call My Agent\". It's on Netflix and it's pretty cool. The characters have a good development and it's not just focussed on one person, and I like that. So it's a show about a Talent Firm and it's agents, their relationship with actors, writers, producers and how they're trying to keep the firm afloat, while their work lives get mixed with their personal (of course). Camille Cottin acted brilliantly and is being recognised internationally!! She totally deserves it! They will prolly come up with another season soon, but this was a good ending, they sort of tied up the loose ends, but I can't wait to watch when the new season drops of course. For Sherlock Holmes fans here, many Sherlock Holmes movies are now colorized and available on you tube. Watching Psych for the first time! Pretty good show to pass time. Don't know why I never watched it earlier link please Basil Rathbone movies from 40s are mostly now in colour. Yup, definitely captivating. I mentioned in the last thread. Revisited rezero s2 p1, didnt get the same goosebumps I had while watching for the first time but was amazing The soundtracks, the voice acting and the whole tense atmosphere felt so great 10/10 would recommend people to watch it So everyone on reddit always said hindi series on television were really bad so I never saw them. I only ever saw English series. Recently came across Crime Patrol Satark, its quite good. 'Crime patrol satark ' which is produced by optimystix is good other production companies ' 'crime patrol dial 100' etc is bad. yeah satark and dastak are based on real stories apparently, the others are made up Ted Lasso ftw will rewatch \"have a good trip\" on netflix today also excited for the upcoming inspiration4 documentary Watched Undekhi on Sony LIV. Was terrified whole time Dastak and satrak and specially there old episodes are best. They covered scams roberry and many other type of crime. But after that they become monotonous with episode based on adultery, murder and rape. Binged The Brink.. Hilarious geo political satire starring Jack Black and Tim Robbins.. Bingeing on Nordic noir. Started with Katla, continued with The Valhalla Murders, planning to see Trapped now. Any other such tv series or movies that portrays iceland and other nordic countries in its glory? Bron/Broen Trapped is good on Netflix Black Sunday by Mario Bava is the vintage horror movie I've always wanted. I never realised how tall Tim Robbins is, until I watched that show. that TV show with Jeremy Brett starring as Sherlock Holmes is a must watch. They stayed true to the novels/stories in that series. I only watched one of its episodes because it had Monica Bellucci haha. Oh hell yes! Documentary about Goa from France24 TV Channel. Jeremy Brett is the best Holmes I feel, a notch slightly above Basil Rathbone. You know what, Rebecca is chatting with Ted on the new dating app. Mentalist is better Watched it long ago its an average series and the last 4 episodes were stretched a lot. Lol I love how this shit is triggering the ted lasso sub- few people are having a meltdown. But it’s such a good show 30 minutes of constant smiling while watching is rare for a tv show. Mystery genre based tv series and YT channels batao 😤😤😤 Lemmino was good Straight from my heart- great podcast for poetry lovers. Comparing apples to oranges. Not every deck of cards is uno. Psych is at times nonsensical and at times meta-humour. Mentalist is a standard procedural, albeit interesting at times. Psych in fact mentions Mentalist multiple times (in a good light lest you get worried). I remember reading that the show was cancelled. The recent interest sparked talks of a movie though If you prefer watching another french series, Au service de la France or A very secret service is quite cool. Oh yes, it was recommended me to and I did start it, and I'm sure it's a good show.. I'm just not in that state of mind to watch it rn. But I will restart it soon :)) Ayee spoiler alertt! Its a great show! I enjoyed it a lot Binge watching peep show. funniest show I have ever seen. You gotta check out Reignbot, Nexpo and Nightmind. All youtube channels and they deal with some fun topics Oi, I am just speculating (In Roy Kent's voice). Desperate for some tips for south indian or north eastern films. Can't swallow bollywood or most indies without at least some indigestion. My neighbour is from kerela and supposedly an artist but every time I bring this up with him, he just hands me a stack of his mother's appams, I have no idea what that has to do with movies. Somebody help. Hindi dubbed marathi tv serial 'raat ka hai khel saara ' on zee5 \"Bell bottom\" is utter dogshit.. Not because I am anti-canadian. The film sucks from beginning to end... Saw Mimi recently! It was good. Shershaah too.. From this year, check out \"The Great Indian Kitchen\" (Malayalam). It should be on Amazon Prime Video. Excerpt from Wikipedia: *The Great Indian Kitchen is a 2021 Indian Malayalam-language drama film written and directed by Jeo Baby. The film tells the story of a newly wed woman who struggles to be the submissive wife that her husband and his family expect her to be.* Not sure about the glory part, but check these out on Netflix: \\* Occupied (Norwegian/English/Russian) \\* Borgen (Danish) Haha. You're welcome 😄 I was wrong 😝 Memories of a Murderer: The Nilsen Tapes It was alright, quite a grim tale"
}