{
    "id": "14bppdn",
    "title": "Is Yogi Adityanath's Comic Book better than the Legendary Bal Narendra? | Manuj Chawla",
    "url": "https://youtu.be/jFwluPtF3Ok",
    "selftext": "Ajay To Yogi Adityanath is a deeply dull and weirdly funny comic that will give the legendary Bal Narendra comic a run for its money. However, I’m a Bal Narendra OG fan forever.\n\nAjay To Yogi Adityanath - Fascinating Story of Grit, Determination, and Hardwork, yes that’s the full name - Was launched in 51+ schools of Uttar Pradesh on the 5th of June, the 51st birthday of, Chief Minister Yogi Adityanath, and who know maybe one day the BJP and Modi Government will make it a part of the curriculum. Lol. #Ajay2Yogi",
    "flair": "Politics",
    "score": 6,
    "num_comments": 1,
    "created_utc": 1687004276.0,
    "convurl": "https://external-preview.redd.it/D5UrK6EHwhSh5zGm9LkM-EshbjjgvyPWz8jnd13KFdE.jpg?auto=webp&v=enabled&s=28a1fcb4ca54734a2cf0f831a3e7209cd9807c32",
    "comments": [
        "This is so good lmao"
    ],
    "cleaned_text": "yogi adityanaths comic book better legendary bal narendra manuj chawla ajay yogi adityanath deeply dull weirdly funny comic give legendary bal narendra comic run money however im bal narendra og fan forever ajay yogi adityanath fascinating story grit determination hardwork yes thats full name launched schools uttar pradesh th june st birthday chief minister yogi adityanath know maybe one day bjp modi government make part curriculum lol ajayyogi ",
    "cleaned_title": "yogi adityanaths comic book better legendary bal narendra manuj chawla",
    "cleaned_selftext": "ajay yogi adityanath deeply dull weirdly funny comic give legendary bal narendra comic run money however im bal narendra og fan forever ajay yogi adityanath fascinating story grit determination hardwork yes thats full name launched schools uttar pradesh th june st birthday chief minister yogi adityanath know maybe one day bjp modi government make part curriculum lol ajayyogi",
    "cleaned_comments": "good lmao",
    "light_cleaned_title": "Is Yogi Adityanath's Comic Book better than the Legendary Bal Narendra? | Manuj Chawla",
    "light_cleaned_selftext": "Ajay To Yogi Adityanath is a deeply dull and weirdly funny comic that will give the legendary Bal Narendra comic a run for its money. However, I’m a Bal Narendra OG fan forever. Ajay To Yogi Adityanath - Fascinating Story of Grit, Determination, and Hardwork, yes that’s the full name - Was launched in 51+ schools of Uttar Pradesh on the 5th of June, the 51st birthday of, Chief Minister Yogi Adityanath, and who know maybe one day the BJP and Modi Government will make it a part of the curriculum. Lol. #Ajay2Yogi",
    "light_cleaned_comments": "This is so good lmao"
}