{
    "id": "1dsd38r",
    "title": "Bengal police nab man assaulting woman publicly at Chopra in viral video  ",
    "url": "https://www.thehindu.com/news/national/west-bengal/bengal-police-nab-man-assaulting-woman-publicly-at-chopra-in-viral-video/article68352931.ece",
    "selftext": "The West Bengal police on Sunday filed a suo motu case and arrested one person in connection with a video where a person is seen beating a woman at Chopra in the Islampur area of Uttar Dinajpur district.",
    "flair": "Crime",
    "score": 21,
    "num_comments": 5,
    "created_utc": 1719785662.0,
    "convurl": "https://external-preview.redd.it/XpoPQ2l_xnXIanQweBjWLLUvx-0c3SvRX5T9uJhyL7M.jpg?auto=webp&s=4aee419f8d7396dc8d07d489662614ce33eaf2ea",
    "comments": [
        "Enough with this appeasement politics. We actually need to uplift muslims economically and socially otherwise these things will continue happening. Non upper class muslim females have non-existent human rights. Also I am glad that at least people are not out on the street to demand to not arrest the criminal  unlike some other states.",
        "Yahan aab sare log gayab ho jaenge",
        "I am here, wdym? Kaun gayab ho rha hai bhai?",
        "I am here, wdym? Kaun gayab ho rha hai bhai? There is a huge problem with bigots like you. Here I am who hate Sanghis as much as I hate radical muslims calling a spade a spade, calling out congress for their appeasement, but you guys can't get ahead of your false dichotomy. Its always us vs them for you santras."
    ],
    "cleaned_text": "bengal police nab man assaulting woman publicly chopra viral video west bengal police sunday filed suo motu case arrested one person connection video person seen beating woman chopra islampur area uttar dinajpur district ",
    "cleaned_title": "bengal police nab man assaulting woman publicly chopra viral video",
    "cleaned_selftext": "west bengal police sunday filed suo motu case arrested one person connection video person seen beating woman chopra islampur area uttar dinajpur district",
    "cleaned_comments": "enough appeasement politics actually need uplift muslims economically socially otherwise things continue happening non upper class muslim females nonexistent human rights also glad least people street demand arrest criminal unlike states yahan aab sare log gayab ho jaenge wdym kaun gayab ho rha hai bhai wdym kaun gayab ho rha hai bhai huge problem bigots like hate sanghis much hate radical muslims calling spade spade calling congress appeasement guys cant get ahead false dichotomy always us vs santras",
    "light_cleaned_title": "Bengal police nab man assaulting woman publicly at Chopra in viral video",
    "light_cleaned_selftext": "The West Bengal police on Sunday filed a suo motu case and arrested one person in connection with a video where a person is seen beating a woman at Chopra in the Islampur area of Uttar Dinajpur district.",
    "light_cleaned_comments": "Enough with this appeasement politics. We actually need to uplift muslims economically and socially otherwise these things will continue happening. Non upper class muslim females have non-existent human rights. Also I am glad that at least people are not out on the street to demand to not arrest the criminal unlike some other states. Yahan aab sare log gayab ho jaenge I am here, wdym? Kaun gayab ho rha hai bhai? I am here, wdym? Kaun gayab ho rha hai bhai? There is a huge problem with bigots like you. Here I am who hate Sanghis as much as I hate radical muslims calling a spade a spade, calling out congress for their appeasement, but you guys can't get ahead of your false dichotomy. Its always us vs them for you santras."
}