{
    "id": "sf6gv3",
    "title": "Bi-Weekly Books &amp; Reading Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/sf6gv3/biweekly_books_reading_discussion_thread/",
    "selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories!\n\nDid you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations!\n\nCheck out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related.\n\nAlso, visit r/Bharat, to read and share well-written, insightful long-form articles about India.\n\nr/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)!\n\n**Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/obor0v8vx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=bdf0b44db553b7c8c9f4a76aca3943d1728f7d3c",
    "flair": "Scheduled",
    "score": 3,
    "num_comments": 8,
    "created_utc": 1643419814,
    "convurl": "https://b.thumbs.redditmedia.com/G10pPAeYZwZEedYOfXMHFyMUf1vUzsTUCesUgBtivCQ.jpg",
    "comments": [
        "Caught fever last week, ended up finishing two books while lying inside blanket.  (Last two books of 'Of blood and bone' trilogy. They're good one time read, but not as good as expected. )          \nMe - 1, Fever - 0 .",
        "Am currently reading 'Nilanjan Mukhopadhyay - The Demolition and the Verdict'. Deals in detail with the history of the Ayodhya dispute. It is an interesting read but at times his passing between pre-1991 episodes to those leading to the events leading up to the Supreme Court verdict can happen abruptly leaving one confused about what one is reading about. There is a lot of clutter that could have been done away with or presented in a way that leads to the main thrust of the argument.\n\nNevertheless it is pretty informative. It deals with an important aspect which I too felt the Supreme Court had overlooked - the seeming lack of references to an actual temple at Ayodhya or pilgrimages to Ayodhya in the texts of that time. From the facts it would appear that the mosque was built over the ruins of a Buddhsit temple. The court overlooked the representation from the Buddhists in its final verdict.",
        "Currently reading Good Omens. Anyone else’s attention span gone for a toss? I could have knocked it off back in school in like 2 days. I’ve been at it for a month now, would rather meme or reddit 😭",
        "Finished “Crime and Punishment” last week. It’s a great read, full of philosophical and psychological questions.\n\nStarted The Ship of Magic and it has been amazing so far. Robin Hobb’s world building and character development is unparalleled.",
        "Relatable",
        "Finished Chetan Bhagat’s “400 days”. People can say whatever they want but this is his best book i’ve read till date.",
        "Reading Red Rising series by Pierce Brown.\nNovel is set in distant future where humans have colonised the entire solar system. However to get to this point, a rigid and oppressive societal system has been erected where the society is divided into different colours with each having their own roles (similar to the caste system in India but much more rigid and oppressive due to technological advancement). The golds are at the top, destined to rule while the reds at the bottom, the caste of people relegated to live like moles and labour for the rest of the society.\n\nThe main character Darrow is a red living in Mars. His job is to mine helium 3 so that one day the surface is hospitable for future generations. Though he is only 16, he is married to his wife Eo whom is loves dearly. (The reds marry young and die young down in the mines). The reds live in abject poverty but they are a tough and proud clan. They have been told that they pioneers on Mars, making the place hospitable for human life which is essential for the survival of the human race. \n\nDarrow's wife Eo happens to be a rebel. She knows that they have been lied to and oppressed though brute force, systemic scarcity of resources and propaganda. Darrow's life turns upside down when he and his wife are arrested due to trespassing into an area restricted to the bronze administrators. Eo is executed and he is next on the list. But then he is saved by a revolutionary group known as Sons of Ares. The Sons of Ares have a plan for Darrow. Due to his intelligence dexterity and constitution, he is selected to undergo genetic surgery to turn him into a gold and infiltrate the Institute, an academy which produces top leaders of the system. Darrow's goal is to rise as high as he can within Gold ranks so that he can assist in the eventual revolution.\n\nI absolutely adore this series. There are 5 books written till now, with the last one scheduled to release this year. The cutthroat competition between the golds is reminiscent to the Hunger games. The politics, action, character development makes the story very compelling. Especially in the second book titled Golden Son where every chapter feels like it ends on a cliffhanger and I can't help but continue reading.",
        "Started reading English, August. Been good so far"
    ],
    "cleaned_text": "biweekly books amp reading discussion thread bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly books amp reading discussion thread",
    "cleaned_selftext": "bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "caught fever last week ended finishing two books lying inside blanket last two books blood bone trilogy theyre good one time read good expected fever currently reading nilanjan mukhopadhyay demolition verdict deals detail history ayodhya dispute interesting read times passing pre episodes leading events leading supreme court verdict happen abruptly leaving one confused one reading lot clutter could done away presented way leads main thrust argument nevertheless pretty informative deals important aspect felt supreme court overlooked seeming lack references actual temple ayodhya pilgrimages ayodhya texts time facts would appear mosque built ruins buddhsit temple court overlooked representation buddhists final verdict currently reading good omens anyone elses attention span gone toss could knocked back school like days ive month would rather meme reddit finished crime punishment last week great read full philosophical psychological questions started ship magic amazing far robin hobbs world building character development unparalleled relatable finished chetan bhagats days people say whatever want best book ive read till date reading red rising series pierce brown novel set distant future humans colonised entire solar system however get point rigid oppressive societal system erected society divided different colours roles similar caste system india much rigid oppressive due technological advancement golds top destined rule reds bottom caste people relegated live like moles labour rest society main character darrow red living mars job mine helium one day surface hospitable future generations though married wife eo loves dearly reds marry young die young mines reds live abject poverty tough proud clan told pioneers mars making place hospitable human life essential survival human race darrows wife eo happens rebel knows lied oppressed though brute force systemic scarcity resources propaganda darrows life turns upside wife arrested due trespassing area restricted bronze administrators eo executed next list saved revolutionary group known sons ares sons ares plan darrow due intelligence dexterity constitution selected undergo genetic surgery turn gold infiltrate institute academy produces top leaders system darrows goal rise high within gold ranks assist eventual revolution absolutely adore series books written till last one scheduled release year cutthroat competition golds reminiscent hunger games politics action character development makes story compelling especially second book titled golden son every chapter feels like ends cliffhanger cant help continue reading started reading english august good far",
    "light_cleaned_title": "Bi-Weekly Books &amp; Reading Discussion Thread",
    "light_cleaned_selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories! Did you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations! Check out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related. Also, visit r/Bharat, to read and share well-written, insightful long-form articles about India. r/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)! **Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Caught fever last week, ended up finishing two books while lying inside blanket. (Last two books of 'Of blood and bone' trilogy. They're good one time read, but not as good as expected. ) Me - 1, Fever - 0 . Am currently reading 'Nilanjan Mukhopadhyay - The Demolition and the Verdict'. Deals in detail with the history of the Ayodhya dispute. It is an interesting read but at times his passing between pre-1991 episodes to those leading to the events leading up to the Supreme Court verdict can happen abruptly leaving one confused about what one is reading about. There is a lot of clutter that could have been done away with or presented in a way that leads to the main thrust of the argument. Nevertheless it is pretty informative. It deals with an important aspect which I too felt the Supreme Court had overlooked - the seeming lack of references to an actual temple at Ayodhya or pilgrimages to Ayodhya in the texts of that time. From the facts it would appear that the mosque was built over the ruins of a Buddhsit temple. The court overlooked the representation from the Buddhists in its final verdict. Currently reading Good Omens. Anyone else’s attention span gone for a toss? I could have knocked it off back in school in like 2 days. I’ve been at it for a month now, would rather meme or reddit 😭 Finished “Crime and Punishment” last week. It’s a great read, full of philosophical and psychological questions. Started The Ship of Magic and it has been amazing so far. Robin Hobb’s world building and character development is unparalleled. Relatable Finished Chetan Bhagat’s “400 days”. People can say whatever they want but this is his best book i’ve read till date. Reading Red Rising series by Pierce Brown. Novel is set in distant future where humans have colonised the entire solar system. However to get to this point, a rigid and oppressive societal system has been erected where the society is divided into different colours with each having their own roles (similar to the caste system in India but much more rigid and oppressive due to technological advancement). The golds are at the top, destined to rule while the reds at the bottom, the caste of people relegated to live like moles and labour for the rest of the society. The main character Darrow is a red living in Mars. His job is to mine helium 3 so that one day the surface is hospitable for future generations. Though he is only 16, he is married to his wife Eo whom is loves dearly. (The reds marry young and die young down in the mines). The reds live in abject poverty but they are a tough and proud clan. They have been told that they pioneers on Mars, making the place hospitable for human life which is essential for the survival of the human race. Darrow's wife Eo happens to be a rebel. She knows that they have been lied to and oppressed though brute force, systemic scarcity of resources and propaganda. Darrow's life turns upside down when he and his wife are arrested due to trespassing into an area restricted to the bronze administrators. Eo is executed and he is next on the list. But then he is saved by a revolutionary group known as Sons of Ares. The Sons of Ares have a plan for Darrow. Due to his intelligence dexterity and constitution, he is selected to undergo genetic surgery to turn him into a gold and infiltrate the Institute, an academy which produces top leaders of the system. Darrow's goal is to rise as high as he can within Gold ranks so that he can assist in the eventual revolution. I absolutely adore this series. There are 5 books written till now, with the last one scheduled to release this year. The cutthroat competition between the golds is reminiscent to the Hunger games. The politics, action, character development makes the story very compelling. Especially in the second book titled Golden Son where every chapter feels like it ends on a cliffhanger and I can't help but continue reading. Started reading English, August. Been good so far"
}