{
    "id": "1eti2zx",
    "title": "Got harassed by a family while driving yesterday",
    "url": "https://www.reddit.com/gallery/1eti2zx",
    "selftext": "So something ‘interesting’ happened last evening. We were in a narrow lane and a vehicle appeared in front of us.\n\nThe man, let’s call him Mr. Snob, sits in the car for 2 minutes and does nothing.\n\nHere’s Mr. Snob’s logic to clear the way:\n- Get out of the car in Sallu bhai style, roll up sleeves to intimidate his ‘opponent’\n- Demand a roll down of the window. Since apne ko apni jaan pyaari thi, we didn’t.\n- His ego wouldn’t let him take a reverse, so naturally, we don’t own a license\n- Hatchback frens take note, It apparently is a rule that ‘Smaller cars let bigger cars pass.’ We should buy a big car to be eligible to talk to him.\n\nBy this time, his wife comes out of the car. Let’s call her ‘certified glass breaker’\n- Gets her three kids out to play the sympathy card, She says we should go back because they have a family 🤡 I feel bad for the kids btw\n- We try to reason that there’s no space, but amma of patriarchy has to be pativrata, threatens to break our glass because they didn’t give ‘permission’ to take their video. She assumed we had given the permission to be harassed.\n- Mr. Snob then placed three heavy stones so that we don’t go ahead, took a reverse and left. We commend his efforts xD\n\nMoral of the story: Some people can’t afford class :)",
    "flair": "Rant / Vent",
    "score": 1757,
    "num_comments": 211,
    "created_utc": 1723790980.0,
    "convurl": "https://i.redd.it/mx7hukfl3zid1.jpg",
    "comments": [
        "Aise logo ke thopde hide nahi karne chahiye.",
        "Community guidelines 🥲",
        "nouveau riche",
        "😂💯",
        "itna drama karne ka time tha",
        "🥲🥲",
        "Just to deal with such man-child and woman-child on the roads, it is recommended to have:   \n  \n1. Dashcams installed front and back.  \n2. Dial 112, even if inconvenient, make it 'costlier' for them to act out like this.",
        "Bro full sauce do",
        "Link to the video: https://drive.google.com/drive/folders/1ltPvnEzUxomeAe7ggtynqrVZ0xoPL69I",
        "Added a video in the comments",
        "We only have it at the back. Planning to get one at the front. \n\nWe are considering reaching out to the police. Let’s see.",
        "1. Get it done expediently.  \n2. If feasible, you should reach out to police and get these people some lesson, I hope you were able to record/note their number-plate.",
        "Have the number plate with me",
        "Hire him for manual labour.",
        "Love this 😂😂",
        "Love this 😂",
        "Bhai aunty ke hath mea iphone",
        "She just wanted to show off her emi iphone",
        "Why is the video pixelated?",
        "Their kids are in the video.",
        "Yepp",
        "what to say XUV700 people. Big car gets out bigger egos. JK",
        "Take help from u/st_broseph or his team when you reach out to police.",
        "She specifically got it out the second time",
        "We don’t win ego battles on the street cause it comes down to who has more to lose. \n\nThat being said, woulda loved to see you drive over those tiny stones and show him how effective his savant level tactics are 😂",
        "I get all this. They were really stupid. But why didn’t you just give way. They are stupid don’t mean you have to be too.",
        "Taali ikk haath se nahi bajti :P",
        "How did you guys manage to go ahead after the labourer did his not so good job?\n\nAlso, I checked the video... In the last second of the video you can see the car's registration no. I tried searching for the owner details, but couldn't find any results.\n\nI think you should trim the video in order to hide the car no.",
        "Lol xD",
        "There wasn’t any way to give. Other cars were parked. Also, the difference was that they were bullies.",
        "If one hands of the taali meant standing up to bullies, I’m glad I was a part of it.",
        "Ah okay. I sometimes feel like time is more important than teaching these people a lesson. They are not worth it",
        "It doesn't work anymore?",
        "I’ll get that removed, thanks. Thought it was blurred.\n\nSome construction workers present there helped us move the stones.",
        "I’ll get that removed, thanks. Thought it was blurred.\n\nSome construction workers present there helped us move the stones.",
        "Community guidelines should be relaxed in such events - these educated illiterates need to be name shamed.",
        "Glad he didn't decide to throw those stones at your car. Nowadays people would do even that",
        "Was horrified when he picked up the stone, thought he’d do exactly that",
        "lekin doosra photo hdr hai, noice",
        ":(",
        "Just give space on the road and go ahead. You move a little bit and ask him to do samething. That's how you live in a society. Just blocking the 2-way road and putting others in a bad light will make life tougher.",
        "their behaviour is obviously fiendish, but why couldn’t you have moved OP? j curious",
        "The audible wtf when he picked up a stone and placed it in front of your car 😂",
        "Gadi me agar kuch altu faltu pda hota toh window neeche karke fek ke Marni thi",
        "I hope people like them never drive on hilly roads. It'll be a nightmare.",
        "Reason I'm saving up for a tank. Just remove the barrel and roll.",
        "JK but fr sometimes. I’ve seen people with expensive cars demand the right of way just because I was on a scooter.",
        "Guy clearly tried to block you from driving away. \n\n\nContact a lawyer and make him pay OP.",
        "Lemme guess! \n\nBangalore?",
        "There's just no space sometimes on some roads............see that construction site in the photo? They're the culprit. They dump a bunch of materials on the road and road side, both traffic and pedestrians are inconvenienced now.",
        "Sad for kids because how they will grow such toxic ego in future with these types of parents 🥲",
        "As they say money can't buy CLASS .",
        "Exactly!",
        "Hahaha xD point noted",
        "Yes I can see that. where can you dump construction materials then? Isnt it obvious it should be on side of road? \n\nI'm saying both had moved aside. If he is reluctant for first move you could have initiated it rather than escalating the issue. Straight blocking his way and pointing his SUV car, his ego, his wife doesn't solve the issue!!",
        "We are considering this",
        "I was shitting bricks at that point. I see the irony yes. :p",
        "😂🙌🏻",
        "Can’t imagine!",
        "Ego battles come down to who has more to lose. Well said! Tq",
        "Are we that infamous xD",
        "THIS!",
        "Man, some people are just born to argue huh",
        "Drop their location",
        "I thought getting a body cam XD full pov dikhega lol",
        "> where can you dump construction materials then? Isnt it obvious it should be on side of road? \n\nOn the construction site...........and also don't just dump them on the road. When rain comes, these things get washed away and all over the place, causing problems for everyone.",
        "Tell me this is Bengaluru without telling me this is Bengaluru",
        "Why couldn’t you guys take a reverse ? Was it a one way street and he was in the wrong direction ? Was it easier for him to take a reverse or for you guys?",
        "Bro 😭 now I need to buy a construction site too with land. Construction doesn't happen for all years just few month or 1 year. \n\nYou are problem if you find others are also having problem because you have the problem.",
        "I once drove through some narrow roads. I was about to emerge out from one road onto a narrow 4 way intersection.\n\nThen one idiot SUV driver promptly turned into my road, and there was no space. I asked him to back out, it would be easy for him to back out into the 4 way intersection, whereas there was a long line of vehicles behind me with absolutely no space. He refused, got out of his vehicle and insisted I squeeze my car into some narrow gap on the left where it could get scratched. He refused to budge even though he could have resolved the situation in a few seconds. Also there was literally zero space for him to go the way he wanted to go anyway, it was just impossible. Narrow road, with a few parked bikes and a long row of vehicles blocking the way.\n\nThe idiot would not relent. I gave up and went over to the left. Scratched my car slightly. The idiot SUV driver drove straight into a row of bikes parked right in front of him. I don't know what the idiot was thinking. Literally no way for him to go.",
        "Hahaha xD",
        "\"Who gave permission to record?\"\n\nProceeds to record y'all in return\n\n\"You don't know how to drive\"\n\nProceeds to return to passenger seat\n\n\"Just because y'all are girls we should move\"\n\n......\n\nYou get the pattern.\n\n\nContradictions ki Mata",
        "It was a narrow residential lane. Us going back had vehicles parked. Then going back had a slightly wider road where we could pass.",
        "Please carry a baseball bat with you and keep it in the car.",
        "She was definitely high on something",
        "🙈",
        "Some good old Mysore mango",
        "Aah! Must be a Bangalore local.",
        "I have faced this many times but escalation like this I never experienced because I try to negotiate and move on.",
        "are you dumb? it's not legal to dump construction material on public property. It's people like you who trash the public sites and then act like you own the public area too coz you're building something near it.",
        "Bro don't insult savants this couple got no more than 2 braincells combined",
        "Will be default guess based on language and car number plate",
        "Op's side of story",
        "Where is this? As in which city?",
        "Damn, the guy looks more like hired help than her husband 😂\n\nGreat job handling it peacefully.",
        "Tulu language?",
        "Also record interactions if not through camera as audio recordings.",
        "Haha thanks! :)",
        "Who’s a savant?",
        "🍀🍀",
        "Ikr lol.. and she was trying so hard to act like she's the boss! 😂",
        "😂😂",
        "What the hell! I’m sorry this happened to you. Some people are plain jerks",
        "What are you even talking about, sir? Your material should be placed within your own construction site.",
        "Please find the other person, I want them to read this and then defend their harassment :)",
        "How's that gonna happen ma'am.?  Like how can you park your car if there isn't no parking space in your home? Or everytime you won't park inside home if you just visit relative or frnd home because you know you would be there for few minutes.",
        "Reminded me of an incident 2.5 yrs back, in feb 2022, my father was driving a car and we were seated and then we took a turn to a not-so narrow lane and we were half way up but then a car came from the opposite side and he refused to reverse(he could have reversed because he was on the end of the lane) but didn't but my father is a very cool natured man. he didn't create a scene and simply took it upon himself and cleared the traffic, the order man then apologized to him and then we moved on...",
        "That guy literally came out of his car, brought his wife and kid out, shouted, lifted 3 stones only to reverse and go back.\n\n  \nWhat an Idiot!",
        "First pic is giving BAHAAR AAAAA vibes.",
        "Well logically someone in a \"big\" car should give way to scooters and small cars cause they are one causing inconvenience by bringing those SUVs in small lanes",
        "People have so much time these days, also thought he took the stone to smash your window. Glad he didn’t.",
        "With that car, not even rich. Bas mummi ki FD thudwa Di hogi kyoki ladle ko badi gaddi chahiye thi",
        "Share the video and pics online.",
        "Makes sense but some people driving these luxury cars often have a sense of entitlement about them.",
        "Well, the law requires you to always park your vehicle such that it doesn't disrupt the traffic. Same with the construction materials.\n\nAlso, victim blaming isn't cool in 2024 :)",
        "Before we jump into any conclusion \n1. Between both the cars, who could easily give way or could reverse the car?\n\nI don't justify the couple's behaviour but we really don't know who is at fault.",
        "Why is he holding a cinder block?\n\nLooks like a trained gunda.\nNot his first time for sure.",
        "Don't know why you're being downvoted but this the the right way. It's not your responsibility to give sense to every idiot out there. Just given them way, adjust your car, and move on peacefully saving time.",
        "Whoever was at fault on the road, the least the couple could do was be polite and negotiate,, not threaten with such sense of entitlement.",
        "Same law permits if you are parking temporarily and same with construction materials. \n\nDisplaying victim card isn't cool from many years.!!",
        "The funniest part for me was when he started reversing, the couple spent more time reversing because the guy doesn't know how to do it properly xD",
        "What is this location? Seems like Bangalore \nHad an interesting incident myself yesterday",
        "Japanese video?",
        "You can share a link to the government document that says you can temporarily disrupt traffic (upto 6 months - 1 year) with construction materials or parking.\n\nAnd yet it seems like you're trying to make a victim out of the clear abusers in this case. Victim card much? :)",
        "Aunty ka face reveal kardete 🤡🥵",
        "You only work on to know legal documents to store construction materials on road side. Why I need to prove you I'm right. Documents are available in portal. Do some work on this on your own.\n\nNow I need ask for a video before this fight starts by the way you are showing Victim card.",
        "Ded 🤣",
        "Arey yaar xD",
        "Get well soon :)",
        "Get a proper diagnosis :)",
        "Bhai tere pas iPhone kaise aya. Tum to chhoti gadi wale ho na? /s",
        "You handled it wonderfully considering how much brian_fucking it is to drive in india because of S holes like these",
        "I wish :’)",
        "He must have lost his balance after all the heavy lifting with the stones",
        "Placed it in the middle of the road so that we don’t move",
        "Classic example of entitlement and lack of self-awareness, hoping Mr. Snob and his family learned a valuable lesson in humility that day!",
        "FD thodi thi bhai 🥲",
        "Does 112 really work? I once called it coz there was a guy beating up a girl in front of my house and it didn't work. Just kept ringing",
        "Lekin chutki tho bajtha hain",
        "I hope this post reaches them 🙈",
        "Was it less distance for you to move back or for the other car?",
        "It was easier for them. Our side had vehicles parked and a dead end",
        "you need to put the video with faces and upload. least you can do is shame them",
        "Hmm, madam has an iPhone but still reacts cheaply.",
        "In my use case, and surprisingly, I have had to use 112/100 a lot; it has worked well. These days, that 112-Himmat app is also really good.",
        "Not all women",
        "I have broken tail lights and hit on right side which was against wall for my car. And it was all done when it was parked, under a tree, in front of my colleagues home, who happen to stay at Koramangala.",
        "That’s the country. Not some people",
        "Why obscure faces? No expectations of privacy in public places.",
        "Why have you blurred their faces?",
        "Bro upload it to imgur. Google rate limited viewing",
        "He uploaded a video.",
        "I feel sorry for the kids , can’t imagine how their behaviour will be after being raised by such idiots",
        "https://preview.redd.it/am7tr5rk71jd1.jpeg?width=800&format=pjpg&auto=webp&s=3d8e26d7c9c21749769368d5f906cf9751189431\n\nYou can use construction skip bins to store your stuff.",
        "Bangalore",
        "Touching your car without your permission and threatening you is a non bailable offense.",
        "There was enough space if they had planned it well. 2 SUVs could have passed",
        "Shouldn't hide their idiot faces",
        "Shouldn't hide their idiot faces",
        "To Mr. Snob - bhai 3 heavy stone utthane ki mehnat kari isse accha reverse leke jaane deta OP ko and fir tere liye raasta clear ho jata.\nRoad manners are hard to explain these days. \nSabko jaldi hey pata nai kis baat ki😇",
        "This app sounds helpful. Will download it!",
        "Can someone please tell me how can i legally buy a gun for \"safety purposes\"",
        "Idk man. The most cowardly type are those who don’t wanna come out of the car, peaceful settle it rather they’d hide like a mama’s kid and record everything and show one sided story on social media. The most cowardly kind they’re.",
        "Word 🙌🏻",
        "🥹🥹",
        "Arey kal waale bhaiyya, did I finally find you? xD \n\nP.S: Try being a woman in a country like India :) It not cowardice, it’s the unsafe environment that keeps us in our seats and record the harassment so that there’s enough proof.",
        "Hahaha cute :p",
        "Start recording the suspects or drive away",
        "You can't unless there is a genuine need, gun laws are really strict in India.",
        "What about air guns or blanks?",
        "Air guns with lower caliber are allowed but higher caliber do need some licensing.",
        "Guessed so. Things are getting out of hand here. It's so sad.",
        "Laathi = Bhains",
        "GTA India",
        "Must have ruined your day\nSorry op",
        "Do you have an out of state number plate? These days BLR is competing with Gurgaon, its actually beaten Haryana by a margin by now 🤣",
        "Bangalore?",
        "Damn, crazy fuckers. They deserve each other.",
        "Dude, fuck off. Any sane person wouldn't come out. \n\nShe's a woman, btw, so it'd be even more unsafe.",
        "These beggars getting out of control!",
        "Damn, the guy is lifting a huge stone for what!!!",
        "Rakhi",
        "I only found 112 india app in Play Store. No himmat to be seen.",
        "and why did u censor their faces\n\nname and shame bro\n\nor show and shame",
        "So both of you were stuck in a one-lane road basically. How did you decide they need to reverse? From an etiquette perspective, whoever has less reversing to do should have reversed.",
        "We need 2nd amendment like usa",
        "The application has been rebranded.",
        "https://preview.redd.it/bffdb277l2jd1.jpeg?width=3096&format=pjpg&auto=webp&s=91e3e352d023910e9c71738fe98b22e58aa659d2",
        "Why hide the faces man?\n\nThey didn't give you the permission to record, did they mention anything about not putting their faces on reddit and publically defame them?🤡",
        "Bangalore lagta hai.",
        "Oh lol",
        "The fact that they own an iPhone, what about the fact: use your brains?",
        "Woman ke haath mein iPhone and gold bracelet and phir bhi dhamki de rahi hai aur unka Car shayad se Mahindra ka lag raha hai",
        "Well written... And kudos for not losing cool while holding your ground",
        "dashcam footage?",
        "Lego addicted angry citizen took reverse and left",
        "Many people don’t have common sense and simply stupid. Not sure what they would be teaching their kids - most likely how to become bullies.",
        "I'm confused....what happened and what was their reason?",
        "Is using pepper spray legal in India?",
        "Exactly.. chapri class mindset",
        "I think you meant *your car was harassed*",
        "Yep, the sense of entitlement they have driving on roads they probably evade paying taxes to",
        "Yup :(",
        "Hehe, lowkey proud of the write-up, thanks :’)",
        "Baccho ko lego blocks nahi khareed paya, toh gussa tha",
        "Legal or not, I keep one :/",
        "I can spot a Kannadiga from far.",
        "wouldn't the Indian police just say \"ye number likhiye, aur wapas aaisa kuch ho to iss number pe call kijiyega\"\n(a girl told her story on insta reels. She got slapped by some random dude who was trying to harass her. And when she went to the police station to complain, this is how she was treated as)",
        "I love how all of us guessed right",
        "He owns a Mahindra, what did you expect from such owners?",
        "Let me give you a possibly needless explanation here.  \n  \nIn the Indian police system, the SHO or DCP/SP of an area does not get rewarded for solving X number of crimes/cases; they kind of get punished or at least scolded for having that X number of crimes in their area of operation in the first place.  \nThis results in police being hesitant in registering complaints and largely depending on stalling or settlement in the police station, the latter being an important tool in a lot of cases.  \nThe amount and type of their funding depend on this, which gets especially troublesome in tier 2-3 areas for policemen.  \n  \nNow, sure, we should have a better system in place, yes.  \nBut while that happens, we should work with the system we have.  \n  \nYou do not go to the police station to register your complaint; you call 100/112 to have the police come to your place.  \nIf you are a girl (and now in many cities, men as well), you use WhatsApp or email. If none of these work, you use Indian speed post to send your complaint with a receipt. In essence, you create an irrefutable paper trail showing that you lodged/attempted to lodge a complaint.  \nIt is your right to file a police complaint, using sections 173-175 of the BNSS (to the DCP, Magistrate), which can compel the most stubborn SHO (and DCP) to register your complaint in cognizable matters.  \n  \nI hope this helps.",
        "Had to be Bangalore :)",
        "Why censor?",
        "Where was this?? Definitely not Delhi.others in you wouldn’t have been alive to write this story",
        "On the road,all Indians are uneducated and classless",
        "Agree, because OP didn't back down either - both are egotistic idiots, OP just has more free time it seems.\n\nI've been there once, on a two lane road with vehicles parked. I was coming from a dead end towards a T and a cab driver was inching towards me. Not knowing where he wants to go (or if he wants to stop) I entered the narrow section, he too naturally decided to accelerate after I did and then blocked me. I didn't back out either since everything I know seemed to tell me he should've let me go (I entered first, his side was wider, etc). I was still an idiot.\n\nPresent me would just back down, I don't have nothing to prove to anyone - just want to get home safe. There are too many idiots for me to risk my well being to argue with nowadays.",
        "After reading this I understand that,\nMy English is weaker than your cars glass 😭",
        "Tf",
        "My guy talks in points\n(It's not a exam bro)",
        "https://preview.redd.it/s18i3f9xhfjd1.jpeg?width=299&format=pjpg&auto=webp&s=ed0bdb9eaad0bd1e5199b3b52c7d38c47184d782",
        "And they driving scorpioN, like come on. How childish. take effect to place bricks front of your car.",
        "Ouch hahaha xD this was Bangalore"
    ],
    "cleaned_text": "got harassed family driving yesterday something interesting happened last evening narrow lane vehicle appeared front us man lets call mr snob sits car minutes nothing heres mr snobs logic clear way get car sallu bhai style roll sleeves intimidate opponent demand roll window since apne ko apni jaan pyaari thi didnt ego wouldnt let take reverse naturally dont license hatchback frens take note apparently rule smaller cars let bigger cars pass buy big car eligible talk time wife comes car lets call certified glass breaker gets three kids play sympathy card says go back family feel bad kids btw try reason theres space amma patriarchy pativrata threatens break glass didnt give permission take video assumed given permission harassed mr snob placed three heavy stones dont go ahead took reverse left commend efforts xd moral story people cant afford class ",
    "cleaned_title": "got harassed family driving yesterday",
    "cleaned_selftext": "something interesting happened last evening narrow lane vehicle appeared front us man lets call mr snob sits car minutes nothing heres mr snobs logic clear way get car sallu bhai style roll sleeves intimidate opponent demand roll window since apne ko apni jaan pyaari thi didnt ego wouldnt let take reverse naturally dont license hatchback frens take note apparently rule smaller cars let bigger cars pass buy big car eligible talk time wife comes car lets call certified glass breaker gets three kids play sympathy card says go back family feel bad kids btw try reason theres space amma patriarchy pativrata threatens break glass didnt give permission take video assumed given permission harassed mr snob placed three heavy stones dont go ahead took reverse left commend efforts xd moral story people cant afford class",
    "cleaned_comments": "aise logo ke thopde hide nahi karne chahiye community guidelines nouveau riche itna drama karne ka time tha deal manchild womanchild roads recommended dashcams installed front back dial even inconvenient make costlier act like bro full sauce link video added video comments back planning get one front considering reaching police lets see get done expediently feasible reach police get people lesson hope able recordnote numberplate number plate hire manual labour love love bhai aunty ke hath mea iphone wanted show emi iphone video pixelated kids video yepp say xuv people big car gets bigger egos jk take help ustbroseph team reach police specifically got second time dont win ego battles street cause comes lose said woulda loved see drive tiny stones show effective savant level tactics get really stupid didnt give way stupid dont mean taali ikk haath se nahi bajti p guys manage go ahead labourer good job also checked video last second video see cars registration tried searching owner details couldnt find results think trim video order hide car lol xd wasnt way give cars parked also difference bullies one hands taali meant standing bullies im glad part ah okay sometimes feel like time important teaching people lesson worth doesnt work anymore ill get removed thanks thought blurred construction workers present helped us move stones ill get removed thanks thought blurred construction workers present helped us move stones community guidelines relaxed events educated illiterates need name shamed glad didnt decide throw stones car nowadays people would even horrified picked stone thought hed exactly lekin doosra photo hdr hai noice give space road go ahead move little bit ask samething thats live society blocking way road putting others bad light make life tougher behaviour obviously fiendish couldnt moved op j curious audible wtf picked stone placed front car gadi agar kuch altu faltu pda hota toh window neeche karke fek ke marni thi hope people like never drive hilly roads itll nightmare reason im saving tank remove barrel roll jk fr sometimes ive seen people expensive cars demand right way scooter guy clearly tried block driving away contact lawyer make pay op lem guess bangalore theres space sometimes roadssee construction site photo theyre culprit dump bunch materials road road side traffic pedestrians inconvenienced sad kids grow toxic ego future types parents say money cant buy class exactly hahaha xd point noted yes see dump construction materials isnt obvious side road im saying moved aside reluctant first move could initiated rather escalating issue straight blocking way pointing suv car ego wife doesnt solve issue considering shitting bricks point see irony yes p cant imagine ego battles come lose well said tq infamous xd man people born argue huh drop location thought getting body cam xd full pov dikhega lol dump construction materials isnt obvious side road construction siteand also dont dump road rain comes things get washed away place causing problems everyone tell bengaluru without telling bengaluru couldnt guys take reverse one way street wrong direction easier take reverse guys bro need buy construction site land construction doesnt happen years month year problem find others also problem problem drove narrow roads emerge one road onto narrow way intersection one idiot suv driver promptly turned road space asked back would easy back way intersection whereas long line vehicles behind absolutely space refused got vehicle insisted squeeze car narrow gap left could get scratched refused budge even though could resolved situation seconds also literally zero space go way wanted go anyway impossible narrow road parked bikes long row vehicles blocking way idiot would relent gave went left scratched car slightly idiot suv driver drove straight row bikes parked right front dont know idiot thinking literally way go hahaha xd gave permission record proceeds record yall return dont know drive proceeds return passenger seat yall girls move get pattern contradictions ki mata narrow residential lane us going back vehicles parked going back slightly wider road could pass please carry baseball bat keep car definitely high something good old mysore mango aah must bangalore local faced many times escalation like never experienced try negotiate move dumb legal dump construction material public property people like trash public sites act like public area coz youre building something near bro dont insult savants couple got braincells combined default guess based language car number plate ops side story city damn guy looks like hired help husband great job handling peacefully tulu language also record interactions camera audio recordings haha thanks whos savant ikr lol trying hard act like shes boss hell im sorry happened people plain jerks even talking sir material placed within construction site please find person want read defend harassment hows gon na happen maam like park car isnt parking space home everytime wont park inside home visit relative frnd home know would minutes reminded incident yrs back feb father driving car seated took turn notso narrow lane half way car came opposite side refused reversehe could reversed end lane didnt father cool natured man didnt create scene simply took upon cleared traffic order man apologized moved guy literally came car brought wife kid shouted lifted stones reverse go back idiot first pic giving bahaar aaaaa vibes well logically someone big car give way scooters small cars cause one causing inconvenience bringing suvs small lanes people much time days also thought took stone smash window glad didnt car even rich bas mummi ki fd thudwa di hogi kyoki ladle ko badi gaddi chahiye thi share video pics online makes sense people driving luxury cars often sense entitlement well law requires always park vehicle doesnt disrupt traffic construction materials also victim blaming isnt cool jump conclusion cars could easily give way could reverse car dont justify couples behaviour really dont know fault holding cinder block looks like trained gunda first time sure dont know youre downvoted right way responsibility give sense every idiot given way adjust car move peacefully saving time whoever fault road least couple could polite negotiate threaten sense entitlement law permits parking temporarily construction materials displaying victim card isnt cool many years funniest part started reversing couple spent time reversing guy doesnt know properly xd location seems like bangalore interesting incident yesterday japanese video share link government document says temporarily disrupt traffic upto months year construction materials parking yet seems like youre trying make victim clear abusers case victim card much aunty ka face reveal kardete work know legal documents store construction materials road side need prove im right documents available portal work need ask video fight starts way showing victim card ded arey yaar xd get well soon get proper diagnosis bhai tere pas iphone kaise aya tum chhoti gadi wale ho na handled wonderfully considering much brianfucking drive india holes like wish must lost balance heavy lifting stones placed middle road dont move classic example entitlement lack selfawareness hoping mr snob family learned valuable lesson humility day fd thodi thi bhai really work called coz guy beating girl front house didnt work kept ringing lekin chutki tho bajtha hain hope post reaches less distance move back car easier side vehicles parked dead end need put video faces upload least shame hmm madam iphone still reacts cheaply use case surprisingly use lot worked well days himmat app also really good women broken tail lights hit right side wall car done parked tree front colleagues home happen stay koramangala thats country people obscure faces expectations privacy public places blurred faces bro upload imgur google rate limited viewing uploaded video feel sorry kids cant imagine behaviour raised idiots use construction skip bins store stuff bangalore touching car without permission threatening non bailable offense enough space planned well suvs could passed shouldnt hide idiot faces shouldnt hide idiot faces mr snob bhai heavy stone utthane ki mehnat kari isse accha reverse leke jaane deta op ko fir tere liye raasta clear ho jata road manners hard explain days sabko jaldi hey pata nai kis baat ki app sounds helpful download someone please tell legally buy gun safety purposes idk man cowardly type dont wan na come car peaceful settle rather theyd hide like mamas kid record everything show one sided story social media cowardly kind theyre word arey kal waale bhaiyya finally find xd ps try woman country like india cowardice unsafe environment keeps us seats record harassment theres enough proof hahaha cute p start recording suspects drive away cant unless genuine need gun laws really strict india air guns blanks air guns lower caliber allowed higher caliber need licensing guessed things getting hand sad laathi bhains gta india must ruined day sorry op state number plate days blr competing gurgaon actually beaten haryana margin bangalore damn crazy fuckers deserve dude fuck sane person wouldnt come shes woman btw itd even unsafe beggars getting control damn guy lifting huge stone rakhi found india app play store himmat seen u censor faces name shame bro show shame stuck onelane road basically decide need reverse etiquette perspective whoever less reversing reversed need nd amendment like usa application rebranded hide faces man didnt give permission record mention anything putting faces reddit publically defame bangalore lagta hai oh lol fact iphone fact use brains woman ke haath mein iphone gold bracelet phir bhi dhamki de rahi hai aur unka car shayad se mahindra ka lag raha hai well written kudos losing cool holding ground dashcam footage lego addicted angry citizen took reverse left many people dont common sense simply stupid sure would teaching kids likely become bullies im confusedwhat happened reason using pepper spray legal india exactly chapri class mindset think meant car harassed yep sense entitlement driving roads probably evade paying taxes yup hehe lowkey proud writeup thanks baccho ko lego blocks nahi khareed paya toh gussa tha legal keep one spot kannadiga far wouldnt indian police say ye number likhiye aur wapas aaisa kuch ho iss number pe call kijiyega girl told story insta reels got slapped random dude trying harass went police station complain treated love us guessed right owns mahindra expect owners let give possibly needless explanation indian police system sho dcpsp area get rewarded solving x number crimescases kind get punished least scolded x number crimes area operation first place results police hesitant registering complaints largely depending stalling settlement police station latter important tool lot cases amount type funding depend gets especially troublesome tier areas policemen sure better system place yes happens work system go police station register complaint call police come place girl many cities men well use whatsapp email none work use indian speed post send complaint receipt essence create irrefutable paper trail showing lodgedattempted lodge complaint right file police complaint using sections bnss dcp magistrate compel stubborn sho dcp register complaint cognizable matters hope helps bangalore censor definitely delhiothers wouldnt alive write story roadall indians uneducated classless agree op didnt back either egotistic idiots op free time seems ive two lane road vehicles parked coming dead end towards cab driver inching towards knowing wants go wants stop entered narrow section naturally decided accelerate blocked didnt back either since everything know seemed tell shouldve let go entered first side wider etc still idiot present would back dont nothing prove anyone want get home safe many idiots risk well argue nowadays reading understand english weaker cars glass tf guy talks points exam bro driving scorpion like come childish take effect place bricks front car ouch hahaha xd bangalore",
    "light_cleaned_title": "Got harassed by a family while driving yesterday",
    "light_cleaned_selftext": "So something ‘interesting’ happened last evening. We were in a narrow lane and a vehicle appeared in front of us. The man, let’s call him Mr. Snob, sits in the car for 2 minutes and does nothing. Here’s Mr. Snob’s logic to clear the way: - Get out of the car in Sallu bhai style, roll up sleeves to intimidate his ‘opponent’ - Demand a roll down of the window. Since apne ko apni jaan pyaari thi, we didn’t. - His ego wouldn’t let him take a reverse, so naturally, we don’t own a license - Hatchback frens take note, It apparently is a rule that ‘Smaller cars let bigger cars pass.’ We should buy a big car to be eligible to talk to him. By this time, his wife comes out of the car. Let’s call her ‘certified glass breaker’ - Gets her three kids out to play the sympathy card, She says we should go back because they have a family 🤡 I feel bad for the kids btw - We try to reason that there’s no space, but amma of patriarchy has to be pativrata, threatens to break our glass because they didn’t give ‘permission’ to take their video. She assumed we had given the permission to be harassed. - Mr. Snob then placed three heavy stones so that we don’t go ahead, took a reverse and left. We commend his efforts xD Moral of the story: Some people can’t afford class :)",
    "light_cleaned_comments": "Aise logo ke thopde hide nahi karne chahiye. Community guidelines 🥲 nouveau riche 😂💯 itna drama karne ka time tha 🥲🥲 Just to deal with such man-child and woman-child on the roads, it is recommended to have: 1. Dashcams installed front and back. 2. Dial 112, even if inconvenient, make it 'costlier' for them to act out like this. Bro full sauce do Link to the video: Added a video in the comments We only have it at the back. Planning to get one at the front. We are considering reaching out to the police. Let’s see. 1. Get it done expediently. 2. If feasible, you should reach out to police and get these people some lesson, I hope you were able to record/note their number-plate. Have the number plate with me Hire him for manual labour. Love this 😂😂 Love this 😂 Bhai aunty ke hath mea iphone She just wanted to show off her emi iphone Why is the video pixelated? Their kids are in the video. Yepp what to say XUV700 people. Big car gets out bigger egos. JK Take help from u/st_broseph or his team when you reach out to police. She specifically got it out the second time We don’t win ego battles on the street cause it comes down to who has more to lose. That being said, woulda loved to see you drive over those tiny stones and show him how effective his savant level tactics are 😂 I get all this. They were really stupid. But why didn’t you just give way. They are stupid don’t mean you have to be too. Taali ikk haath se nahi bajti :P How did you guys manage to go ahead after the labourer did his not so good job? Also, I checked the video... In the last second of the video you can see the car's registration no. I tried searching for the owner details, but couldn't find any results. I think you should trim the video in order to hide the car no. Lol xD There wasn’t any way to give. Other cars were parked. Also, the difference was that they were bullies. If one hands of the taali meant standing up to bullies, I’m glad I was a part of it. Ah okay. I sometimes feel like time is more important than teaching these people a lesson. They are not worth it It doesn't work anymore? I’ll get that removed, thanks. Thought it was blurred. Some construction workers present there helped us move the stones. I’ll get that removed, thanks. Thought it was blurred. Some construction workers present there helped us move the stones. Community guidelines should be relaxed in such events - these educated illiterates need to be name shamed. Glad he didn't decide to throw those stones at your car. Nowadays people would do even that Was horrified when he picked up the stone, thought he’d do exactly that lekin doosra photo hdr hai, noice :( Just give space on the road and go ahead. You move a little bit and ask him to do samething. That's how you live in a society. Just blocking the 2-way road and putting others in a bad light will make life tougher. their behaviour is obviously fiendish, but why couldn’t you have moved OP? j curious The audible wtf when he picked up a stone and placed it in front of your car 😂 Gadi me agar kuch altu faltu pda hota toh window neeche karke fek ke Marni thi I hope people like them never drive on hilly roads. It'll be a nightmare. Reason I'm saving up for a tank. Just remove the barrel and roll. JK but fr sometimes. I’ve seen people with expensive cars demand the right of way just because I was on a scooter. Guy clearly tried to block you from driving away. Contact a lawyer and make him pay OP. Lemme guess! Bangalore? There's just no space sometimes on some roads............see that construction site in the photo? They're the culprit. They dump a bunch of materials on the road and road side, both traffic and pedestrians are inconvenienced now. Sad for kids because how they will grow such toxic ego in future with these types of parents 🥲 As they say money can't buy CLASS . Exactly! Hahaha xD point noted Yes I can see that. where can you dump construction materials then? Isnt it obvious it should be on side of road? I'm saying both had moved aside. If he is reluctant for first move you could have initiated it rather than escalating the issue. Straight blocking his way and pointing his SUV car, his ego, his wife doesn't solve the issue!! We are considering this I was shitting bricks at that point. I see the irony yes. :p 😂🙌🏻 Can’t imagine! Ego battles come down to who has more to lose. Well said! Tq Are we that infamous xD THIS! Man, some people are just born to argue huh Drop their location I thought getting a body cam XD full pov dikhega lol > where can you dump construction materials then? Isnt it obvious it should be on side of road? On the construction site...........and also don't just dump them on the road. When rain comes, these things get washed away and all over the place, causing problems for everyone. Tell me this is Bengaluru without telling me this is Bengaluru Why couldn’t you guys take a reverse ? Was it a one way street and he was in the wrong direction ? Was it easier for him to take a reverse or for you guys? Bro 😭 now I need to buy a construction site too with land. Construction doesn't happen for all years just few month or 1 year. You are problem if you find others are also having problem because you have the problem. I once drove through some narrow roads. I was about to emerge out from one road onto a narrow 4 way intersection. Then one idiot SUV driver promptly turned into my road, and there was no space. I asked him to back out, it would be easy for him to back out into the 4 way intersection, whereas there was a long line of vehicles behind me with absolutely no space. He refused, got out of his vehicle and insisted I squeeze my car into some narrow gap on the left where it could get scratched. He refused to budge even though he could have resolved the situation in a few seconds. Also there was literally zero space for him to go the way he wanted to go anyway, it was just impossible. Narrow road, with a few parked bikes and a long row of vehicles blocking the way. The idiot would not relent. I gave up and went over to the left. Scratched my car slightly. The idiot SUV driver drove straight into a row of bikes parked right in front of him. I don't know what the idiot was thinking. Literally no way for him to go. Hahaha xD \"Who gave permission to record?\" Proceeds to record y'all in return \"You don't know how to drive\" Proceeds to return to passenger seat \"Just because y'all are girls we should move\" ...... You get the pattern. Contradictions ki Mata It was a narrow residential lane. Us going back had vehicles parked. Then going back had a slightly wider road where we could pass. Please carry a baseball bat with you and keep it in the car. She was definitely high on something 🙈 Some good old Mysore mango Aah! Must be a Bangalore local. I have faced this many times but escalation like this I never experienced because I try to negotiate and move on. are you dumb? it's not legal to dump construction material on public property. It's people like you who trash the public sites and then act like you own the public area too coz you're building something near it. Bro don't insult savants this couple got no more than 2 braincells combined Will be default guess based on language and car number plate Op's side of story Where is this? As in which city? Damn, the guy looks more like hired help than her husband 😂 Great job handling it peacefully. Tulu language? Also record interactions if not through camera as audio recordings. Haha thanks! :) Who’s a savant? 🍀🍀 Ikr lol.. and she was trying so hard to act like she's the boss! 😂 😂😂 What the hell! I’m sorry this happened to you. Some people are plain jerks What are you even talking about, sir? Your material should be placed within your own construction site. Please find the other person, I want them to read this and then defend their harassment :) How's that gonna happen ma'am.? Like how can you park your car if there isn't no parking space in your home? Or everytime you won't park inside home if you just visit relative or frnd home because you know you would be there for few minutes. Reminded me of an incident 2.5 yrs back, in feb 2022, my father was driving a car and we were seated and then we took a turn to a not-so narrow lane and we were half way up but then a car came from the opposite side and he refused to reverse(he could have reversed because he was on the end of the lane) but didn't but my father is a very cool natured man. he didn't create a scene and simply took it upon himself and cleared the traffic, the order man then apologized to him and then we moved on... That guy literally came out of his car, brought his wife and kid out, shouted, lifted 3 stones only to reverse and go back. What an Idiot! First pic is giving BAHAAR AAAAA vibes. Well logically someone in a \"big\" car should give way to scooters and small cars cause they are one causing inconvenience by bringing those SUVs in small lanes People have so much time these days, also thought he took the stone to smash your window. Glad he didn’t. With that car, not even rich. Bas mummi ki FD thudwa Di hogi kyoki ladle ko badi gaddi chahiye thi Share the video and pics online. Makes sense but some people driving these luxury cars often have a sense of entitlement about them. Well, the law requires you to always park your vehicle such that it doesn't disrupt the traffic. Same with the construction materials. Also, victim blaming isn't cool in 2024 :) Before we jump into any conclusion 1. Between both the cars, who could easily give way or could reverse the car? I don't justify the couple's behaviour but we really don't know who is at fault. Why is he holding a cinder block? Looks like a trained gunda. Not his first time for sure. Don't know why you're being downvoted but this the the right way. It's not your responsibility to give sense to every idiot out there. Just given them way, adjust your car, and move on peacefully saving time. Whoever was at fault on the road, the least the couple could do was be polite and negotiate,, not threaten with such sense of entitlement. Same law permits if you are parking temporarily and same with construction materials. Displaying victim card isn't cool from many years.!! The funniest part for me was when he started reversing, the couple spent more time reversing because the guy doesn't know how to do it properly xD What is this location? Seems like Bangalore Had an interesting incident myself yesterday Japanese video? You can share a link to the government document that says you can temporarily disrupt traffic (upto 6 months - 1 year) with construction materials or parking. And yet it seems like you're trying to make a victim out of the clear abusers in this case. Victim card much? :) Aunty ka face reveal kardete 🤡🥵 You only work on to know legal documents to store construction materials on road side. Why I need to prove you I'm right. Documents are available in portal. Do some work on this on your own. Now I need ask for a video before this fight starts by the way you are showing Victim card. Ded 🤣 Arey yaar xD Get well soon :) Get a proper diagnosis :) Bhai tere pas iPhone kaise aya. Tum to chhoti gadi wale ho na? /s You handled it wonderfully considering how much brian_fucking it is to drive in india because of S holes like these I wish :’) He must have lost his balance after all the heavy lifting with the stones Placed it in the middle of the road so that we don’t move Classic example of entitlement and lack of self-awareness, hoping Mr. Snob and his family learned a valuable lesson in humility that day! FD thodi thi bhai 🥲 Does 112 really work? I once called it coz there was a guy beating up a girl in front of my house and it didn't work. Just kept ringing Lekin chutki tho bajtha hain I hope this post reaches them 🙈 Was it less distance for you to move back or for the other car? It was easier for them. Our side had vehicles parked and a dead end you need to put the video with faces and upload. least you can do is shame them Hmm, madam has an iPhone but still reacts cheaply. In my use case, and surprisingly, I have had to use 112/100 a lot; it has worked well. These days, that 112-Himmat app is also really good. Not all women I have broken tail lights and hit on right side which was against wall for my car. And it was all done when it was parked, under a tree, in front of my colleagues home, who happen to stay at Koramangala. That’s the country. Not some people Why obscure faces? No expectations of privacy in public places. Why have you blurred their faces? Bro upload it to imgur. Google rate limited viewing He uploaded a video. I feel sorry for the kids , can’t imagine how their behaviour will be after being raised by such idiots You can use construction skip bins to store your stuff. Bangalore Touching your car without your permission and threatening you is a non bailable offense. There was enough space if they had planned it well. 2 SUVs could have passed Shouldn't hide their idiot faces Shouldn't hide their idiot faces To Mr. Snob - bhai 3 heavy stone utthane ki mehnat kari isse accha reverse leke jaane deta OP ko and fir tere liye raasta clear ho jata. Road manners are hard to explain these days. Sabko jaldi hey pata nai kis baat ki😇 This app sounds helpful. Will download it! Can someone please tell me how can i legally buy a gun for \"safety purposes\" Idk man. The most cowardly type are those who don’t wanna come out of the car, peaceful settle it rather they’d hide like a mama’s kid and record everything and show one sided story on social media. The most cowardly kind they’re. Word 🙌🏻 🥹🥹 Arey kal waale bhaiyya, did I finally find you? xD P.S: Try being a woman in a country like India :) It not cowardice, it’s the unsafe environment that keeps us in our seats and record the harassment so that there’s enough proof. Hahaha cute :p Start recording the suspects or drive away You can't unless there is a genuine need, gun laws are really strict in India. What about air guns or blanks? Air guns with lower caliber are allowed but higher caliber do need some licensing. Guessed so. Things are getting out of hand here. It's so sad. Laathi = Bhains GTA India Must have ruined your day Sorry op Do you have an out of state number plate? These days BLR is competing with Gurgaon, its actually beaten Haryana by a margin by now 🤣 Bangalore? Damn, crazy fuckers. They deserve each other. Dude, fuck off. Any sane person wouldn't come out. She's a woman, btw, so it'd be even more unsafe. These beggars getting out of control! Damn, the guy is lifting a huge stone for what!!! Rakhi I only found 112 india app in Play Store. No himmat to be seen. and why did u censor their faces name and shame bro or show and shame So both of you were stuck in a one-lane road basically. How did you decide they need to reverse? From an etiquette perspective, whoever has less reversing to do should have reversed. We need 2nd amendment like usa The application has been rebranded. Why hide the faces man? They didn't give you the permission to record, did they mention anything about not putting their faces on reddit and publically defame them?🤡 Bangalore lagta hai. Oh lol The fact that they own an iPhone, what about the fact: use your brains? Woman ke haath mein iPhone and gold bracelet and phir bhi dhamki de rahi hai aur unka Car shayad se Mahindra ka lag raha hai Well written... And kudos for not losing cool while holding your ground dashcam footage? Lego addicted angry citizen took reverse and left Many people don’t have common sense and simply stupid. Not sure what they would be teaching their kids - most likely how to become bullies. I'm confused....what happened and what was their reason? Is using pepper spray legal in India? Exactly.. chapri class mindset I think you meant *your car was harassed* Yep, the sense of entitlement they have driving on roads they probably evade paying taxes to Yup :( Hehe, lowkey proud of the write-up, thanks :’) Baccho ko lego blocks nahi khareed paya, toh gussa tha Legal or not, I keep one :/ I can spot a Kannadiga from far. wouldn't the Indian police just say \"ye number likhiye, aur wapas aaisa kuch ho to iss number pe call kijiyega\" (a girl told her story on insta reels. She got slapped by some random dude who was trying to harass her. And when she went to the police station to complain, this is how she was treated as) I love how all of us guessed right He owns a Mahindra, what did you expect from such owners? Let me give you a possibly needless explanation here. In the Indian police system, the SHO or DCP/SP of an area does not get rewarded for solving X number of crimes/cases; they kind of get punished or at least scolded for having that X number of crimes in their area of operation in the first place. This results in police being hesitant in registering complaints and largely depending on stalling or settlement in the police station, the latter being an important tool in a lot of cases. The amount and type of their funding depend on this, which gets especially troublesome in tier 2-3 areas for policemen. Now, sure, we should have a better system in place, yes. But while that happens, we should work with the system we have. You do not go to the police station to register your complaint; you call 100/112 to have the police come to your place. If you are a girl (and now in many cities, men as well), you use WhatsApp or email. If none of these work, you use Indian speed post to send your complaint with a receipt. In essence, you create an irrefutable paper trail showing that you lodged/attempted to lodge a complaint. It is your right to file a police complaint, using sections 173-175 of the BNSS (to the DCP, Magistrate), which can compel the most stubborn SHO (and DCP) to register your complaint in cognizable matters. I hope this helps. Had to be Bangalore :) Why censor? Where was this?? Definitely not Delhi.others in you wouldn’t have been alive to write this story On the road,all Indians are uneducated and classless Agree, because OP didn't back down either - both are egotistic idiots, OP just has more free time it seems. I've been there once, on a two lane road with vehicles parked. I was coming from a dead end towards a T and a cab driver was inching towards me. Not knowing where he wants to go (or if he wants to stop) I entered the narrow section, he too naturally decided to accelerate after I did and then blocked me. I didn't back out either since everything I know seemed to tell me he should've let me go (I entered first, his side was wider, etc). I was still an idiot. Present me would just back down, I don't have nothing to prove to anyone - just want to get home safe. There are too many idiots for me to risk my well being to argue with nowadays. After reading this I understand that, My English is weaker than your cars glass 😭 Tf My guy talks in points (It's not a exam bro) And they driving scorpioN, like come on. How childish. take effect to place bricks front of your car. Ouch hahaha xD this was Bangalore"
}