{
    "id": "16iqvq6",
    "title": "Can someone please explain how the fck is this being allowed on YouTube?",
    "url": "https://www.reddit.com/r/india/comments/16iqvq6/can_someone_please_explain_how_the_fck_is_this/",
    "selftext": "Recently, I have seen a lot of movie channels uploading 10-15 mins long movie clips on their channel and are monetized. So, I thought to do it myself but guess what, I got a copyright claim. \n\nNow I understand the creative commons license but I have checked, the clips of movies that they are uploading are not available on YT under creative commons license. I know they are somehow able to escape the copyright issue but just unable to understand how. \n\nThese are some channels:\n\n[https://www.youtube.com/@HanseeMazaak/videos](https://www.youtube.com/@HanseeMazaak/videos)\n\n[https://www.youtube.com/@sochorecords](https://www.youtube.com/@sochorecords) (the channel name was previously Rider Studios)\n\n[https://www.youtube.com/@lomaahipaankhao](https://www.youtube.com/@lomaahipaankhao)\n\n[https://www.youtube.com/watch?v=Kz23rOgt3H8](https://www.youtube.com/watch?v=Kz23rOgt3H8) (this was previously known as Aryan Music)\n\nThere are other channels too.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694718298.0,
    "convurl": "https://external-preview.redd.it/rXN1PjNX25tgHpbCK1ZolbcETa71FUY700wnSTK6OVE.jpg?auto=webp&s=fe31f5cca6ea950464b6063c7e0a99012732c6da",
    "comments": [
        "Asking for a friend"
    ],
    "cleaned_text": "someone please explain fck allowed youtube recently seen lot movie channels uploading mins long movie clips channel monetized thought guess got copyright claim understand creative commons license checked clips movies uploading available yt creative commons license know somehow able escape copyright issue unable understand channels httpswwwyoutubecomhanseemazaakvideoshttpswwwyoutubecomhanseemazaakvideos httpswwwyoutubecomsochorecordshttpswwwyoutubecomsochorecords channel name previously rider studios httpswwwyoutubecomlomaahipaankhaohttpswwwyoutubecomlomaahipaankhao httpswwwyoutubecomwatchvkzrogthhttpswwwyoutubecomwatchvkzrogth previously known aryan music channels ",
    "cleaned_title": "someone please explain fck allowed youtube",
    "cleaned_selftext": "recently seen lot movie channels uploading mins long movie clips channel monetized thought guess got copyright claim understand creative commons license checked clips movies uploading available yt creative commons license know somehow able escape copyright issue unable understand channels httpswwwyoutubecomhanseemazaakvideoshttpswwwyoutubecomhanseemazaakvideos httpswwwyoutubecomsochorecordshttpswwwyoutubecomsochorecords channel name previously rider studios httpswwwyoutubecomlomaahipaankhaohttpswwwyoutubecomlomaahipaankhao httpswwwyoutubecomwatchvkzrogthhttpswwwyoutubecomwatchvkzrogth previously known aryan music channels",
    "cleaned_comments": "asking friend",
    "light_cleaned_title": "Can someone please explain how the fck is this being allowed on YouTube?",
    "light_cleaned_selftext": "Recently, I have seen a lot of movie channels uploading 10-15 mins long movie clips on their channel and are monetized. So, I thought to do it myself but guess what, I got a copyright claim. Now I understand the creative commons license but I have checked, the clips of movies that they are uploading are not available on YT under creative commons license. I know they are somehow able to escape the copyright issue but just unable to understand how. These are some channels: [https://www.youtube.com/@HanseeMazaak/videos](https://www.youtube.com/@HanseeMazaak/videos) [https://www.youtube.com/@sochorecords](https://www.youtube.com/@sochorecords) (the channel name was previously Rider Studios) [https://www.youtube.com/@lomaahipaankhao](https://www.youtube.com/@lomaahipaankhao) [https://www.youtube.com/watch?v=Kz23rOgt3H8](https://www.youtube.com/watch?v=Kz23rOgt3H8) (this was previously known as Aryan Music) There are other channels too.",
    "light_cleaned_comments": "Asking for a friend"
}