{
    "id": "14nnwsd",
    "title": "Destruction of Print Media",
    "url": "https://www.reddit.com/gallery/14nnwsd",
    "selftext": "I have been reading the Hindu for the past year, and it is astonishing how a newspaper so respected and accorded with value by academics around the country has succumbed to the clutches of advertisements.\n\nThey have started to run full front page ads, and almost every page is filled with them\n\nI woke up today, picked up the paper and found almost the entire second and third page (slide 3) filled with ads, using columns which were reserved for city news. \n\nI honestly think that reporting in the Hindu is still outstanding and their editorials are just [insert chef's kiss]. But it is saddening to see how the print media is suffering in a time when the TV media is just retarded.",
    "flair": "Rant / Vent",
    "score": 10,
    "num_comments": 8,
    "created_utc": 1688193635.0,
    "convurl": "https://i.redd.it/018nmsfcua9b1.png",
    "comments": [
        "More and more people have given up on reading newspapers. Even people who actually read news articles, prefer reading them online rather than subscribing to a physical copy. These print newspapers need profit someway. Not saying it's right but it is what it is",
        "Bro The Hindu is one of newspapers which have least no. of circulation throughout the country.\n\nThey have to print ads in order to make money.\nIf we all are gonna start paying donations to the credible news sources, then maybe they will tone down the number of the ads that they have to print.",
        "Print media is still 100 times better than electronic media.",
        "Try Times of India.",
        "How do you think they will pay for expenses?"
    ],
    "cleaned_text": "destruction print media reading hindu past year astonishing newspaper respected accorded value academics around country succumbed clutches advertisements started run full front page ads almost every page filled woke today picked paper found almost entire second third page slide filled ads using columns reserved city news honestly think reporting hindu still outstanding editorials insert chefs kiss saddening see print media suffering time tv media retarded ",
    "cleaned_title": "destruction print media",
    "cleaned_selftext": "reading hindu past year astonishing newspaper respected accorded value academics around country succumbed clutches advertisements started run full front page ads almost every page filled woke today picked paper found almost entire second third page slide filled ads using columns reserved city news honestly think reporting hindu still outstanding editorials insert chefs kiss saddening see print media suffering time tv media retarded",
    "cleaned_comments": "people given reading newspapers even people actually read news articles prefer reading online rather subscribing physical copy print newspapers need profit someway saying right bro hindu one newspapers least circulation throughout country print ads order make money gon na start paying donations credible news sources maybe tone number ads print print media still times better electronic media try times india think pay expenses",
    "light_cleaned_title": "Destruction of Print Media",
    "light_cleaned_selftext": "I have been reading the Hindu for the past year, and it is astonishing how a newspaper so respected and accorded with value by academics around the country has succumbed to the clutches of advertisements. They have started to run full front page ads, and almost every page is filled with them I woke up today, picked up the paper and found almost the entire second and third page (slide 3) filled with ads, using columns which were reserved for city news. I honestly think that reporting in the Hindu is still outstanding and their editorials are just [insert chef's kiss]. But it is saddening to see how the print media is suffering in a time when the TV media is just retarded.",
    "light_cleaned_comments": "More and more people have given up on reading newspapers. Even people who actually read news articles, prefer reading them online rather than subscribing to a physical copy. These print newspapers need profit someway. Not saying it's right but it is what it is Bro The Hindu is one of newspapers which have least no. of circulation throughout the country. They have to print ads in order to make money. If we all are gonna start paying donations to the credible news sources, then maybe they will tone down the number of the ads that they have to print. Print media is still 100 times better than electronic media. Try Times of India. How do you think they will pay for expenses?"
}