{
    "id": "15a2wrk",
    "title": "Are politicians pushing India to be like Saad Alavi's Pakistan?",
    "url": "https://www.reddit.com/r/india/comments/15a2wrk/are_politicians_pushing_india_to_be_like_saad/",
    "selftext": "The way various things are shaping up in India makes one feel that Saad Alavi's song '[Aapne Sabse Pehle Ghabrana Nahi](https://www.youtube.com/watch?v=_DRi1rzdz_E)' applicable to India as well.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690370176.0,
    "convurl": "https://external-preview.redd.it/10Vy6J8sa-MqL7tv4Tt3WhNazzIMW4FOfeQD9Ex0WsY.jpg?auto=webp&s=3cc17c45790705f08203a5377e0991e85c3296f1",
    "comments": [
        "What's his song about?",
        "It is about how their erstwhile Prime Minister Imran Khan was insensitive to the citizen's welfare. It looks like during the Covid Imran addressed the citizens with 'There is nothing to be afraid at all'. And this was the phrase that was picked up this artist (political commentator) adding thoughts about inflation, corruption etc which are ripping the spine of citizens.",
        "Imran khan and modi are 2 peas in a pod\n\nBoth a populist, alt right, extremely religious, sociopaths."
    ],
    "cleaned_text": "politicians pushing india like saad alavis pakistan way various things shaping india makes one feel saad alavis song aapne sabse pehle ghabrana nahihttpswwwyoutubecomwatchvdrirzdze applicable india well ",
    "cleaned_title": "politicians pushing india like saad alavis pakistan",
    "cleaned_selftext": "way various things shaping india makes one feel saad alavis song aapne sabse pehle ghabrana nahihttpswwwyoutubecomwatchvdrirzdze applicable india well",
    "cleaned_comments": "whats song erstwhile prime minister imran khan insensitive citizens welfare looks like covid imran addressed citizens nothing afraid phrase picked artist political commentator adding thoughts inflation corruption etc ripping spine citizens imran khan modi peas pod populist alt right extremely religious sociopaths",
    "light_cleaned_title": "Are politicians pushing India to be like Saad Alavi's Pakistan?",
    "light_cleaned_selftext": "The way various things are shaping up in India makes one feel that Saad Alavi's song '[Aapne Sabse Pehle Ghabrana Nahi](https://www.youtube.com/watch?v=_DRi1rzdz_E)' applicable to India as well.",
    "light_cleaned_comments": "What's his song about? It is about how their erstwhile Prime Minister Imran Khan was insensitive to the citizen's welfare. It looks like during the Covid Imran addressed the citizens with 'There is nothing to be afraid at all'. And this was the phrase that was picked up this artist (political commentator) adding thoughts about inflation, corruption etc which are ripping the spine of citizens. Imran khan and modi are 2 peas in a pod Both a populist, alt right, extremely religious, sociopaths."
}