{
    "id": "1h6ukdm",
    "title": "Exposing a Punjabi-Origin Builder, brother of Gippy Grewal Scamming Families in Australia – A Cry for Justice",
    "url": "https://www.reddit.com/r/india/comments/1h6ukdm/exposing_a_punjabiorigin_builder_brother_of_gippy/",
    "selftext": "[https://9now.nine.com.au/a-current-affair/nsw-alaxia-group/9ba96399-d2ef-4d81-8376-a3c139b49aff](https://9now.nine.com.au/a-current-affair/nsw-alaxia-group/9ba96399-d2ef-4d81-8376-a3c139b49aff)  \n  \nI’ve simply had enough. Yet again, another story has surfaced about a Punjabi-origin home builder in Australia scamming hardworking families, all while living a luxurious life funded by their victims. One heartbreaking case involves a family with an autistic daughter whose lives have been completely devastated by this scam. To make matters worse, this builder is the brother of well-known Punjabi actor Gippy Grewal.\n\nI know this might ruffle feathers, but I also want to call out the pattern. Scams like these are disturbingly common among some Punjabi builders and tradesmen in Australia. I can list countless examples of these individuals scamming hardworking families, many of whom are from ethnic Asian backgrounds (Indians, Nepalese). They prey on the trust of their own communities, \"look he is from my country\".\n\nTo be clear, not all Punjabis are scammers, but the overrepresentation in these types of crimes is undeniable. If they’re not dodging home-building contracts, they’re involved in shady trades (plumbing, electrical), wage theft, or worker exploitation in restaurants. It’s gotten so bad that I’ve stopped dealing with any Indian businesses in Australia, even for groceries.\n\nWhat does this do to our community’s reputation? It damages it severely. And yet, we don’t take a stand. Instead of holding these scammers accountable and socially boycotting them, we eagerly share the occasional good news about successful Indians abroad, pretending it reflects all of us. The truth is, most of us are not like that, but the actions of a few are enough to tarnish our collective image.\n\nThis isn’t just an Australian issue, it’s worse in Canada. Punjabi origin truckers are heavily involved in drug trafficking across Canada and the U.S. and this and numerous other damming stories are feeding into growing racism against Indians abroad. There’s a reason Australia restricted student visa applications from regions like Punjab, Haryana, and Gujarat.\n\nIn this particular case, the builder’s connection to a famous actor might be the only leverage for justice. If this post goes viral, the associated shame could pressure them into accountability. These families deserve justice, and this reality needs to be exposed so Indian media picks it up and dismantles the facade of “hardworking Indians.”\n\n**Please share this post and help these families get the justice they deserve. Let’s make this viral. That’s all I ask.**",
    "flair": "Rant / Vent",
    "score": 32,
    "num_comments": 7,
    "created_utc": 1733354849.0,
    "convurl": "https://external-preview.redd.it/UF3kcU-KfcUExlze_5RfYtZW5Qz9SbY_9ffMq9U5LFI.jpg?auto=webp&s=94486633f7ae981808194d36ad061a7d7b1d517f",
    "comments": [
        "You have not said Punjabi  too many times. Maybe you can fit in some more.",
        "As much as I hate it myself, this is the unfortunate reality of the situation. There are dedicated facebook groups here in Australia now, to potentially warn other people engaging with businesses such as him.",
        "I am a Punjabi in Canada and yes, even if he wrote Punjabi in every single statement it would still be not enough. It’s shameful to see the Punjabis following and bringing the worst corrupt practices to these beautiful countries.",
        "ohh so you decided to finally open your eyes. Its similar in Canada sure there are some good and honest punjabi's and gujju but majority is after your money. This corruption is what unites us. There was this case in Bc or Alberta where one Punjabi sikh and other pakistani muslim ran an real estate business, they were so good at the game that whenever the client would come by their office, they would see them praying to their god and that made all the client sign off all sorts of paper without even reading.   \n  \nI mean i dont blame the client as honest and hardworking people easily trust people because they think others are like them but oh boy, they forget that humanity comes with all sorts of variation.",
        "Its not like I have opened my eyes today but it has affected me enough to write a post on an Indian subreddit. Scamming from a family who are already struggling with an autistic daughter is the kind of lows that this society is not used to.  \n  \nI want to tell my fellow Indians what our community is upto because we are only fed feel good stories by the media and not stories like these.",
        "There are crooks, cheats, thugs etc from all ethnicities. \n\nBTW I'm not punjabi & I think Its unfair to point fingers at one community.",
        "Instead of bashing anyone or any ethnicity we should look at the good in all. \n\nDuring Covid Lockdown, floods in Australia, fires in western Canada, wars in the middle east. It was the Sikhs/ Punjabis who stepped up to provide aid. Heck they even rented helicopters in Australia to deliver aid. Setup a bakery in Syria in the middle of the conflict to feed the public where international organizations stayed away, Check out the work Khalsa aid has done or is doing. Very recently they gave the largest donation ever in Canadian History to the food bank in Ottawa. \n\nNot only the Sikhs, there are people all over the world who are doing good. I mention the Sikhs. \n\nI have worked with them and respect them a lot."
    ],
    "cleaned_text": "exposing punjabiorigin builder brother gippy grewal scamming families australia cry justice httpsnowninecomauacurrentaffairnswalaxiagroupbadefdacbaffhttpsnowninecomauacurrentaffairnswalaxiagroupbadefdacbaff ive simply enough yet another story surfaced punjabiorigin home builder australia scamming hardworking families living luxurious life funded victims one heartbreaking case involves family autistic daughter whose lives completely devastated scam make matters worse builder brother wellknown punjabi actor gippy grewal know might ruffle feathers also want call pattern scams like disturbingly common among punjabi builders tradesmen australia list countless examples individuals scamming hardworking families many ethnic asian backgrounds indians nepalese prey trust communities look country clear punjabis scammers overrepresentation types crimes undeniable theyre dodging homebuilding contracts theyre involved shady trades plumbing electrical wage theft worker exploitation restaurants gotten bad ive stopped dealing indian businesses australia even groceries communitys reputation damages severely yet dont take stand instead holding scammers accountable socially boycotting eagerly share occasional good news successful indians abroad pretending reflects us truth us like actions enough tarnish collective image isnt australian issue worse canada punjabi origin truckers heavily involved drug trafficking across canada us numerous damming stories feeding growing racism indians abroad theres reason australia restricted student visa applications regions like punjab haryana gujarat particular case builders connection famous actor might leverage justice post goes viral associated shame could pressure accountability families deserve justice reality needs exposed indian media picks dismantles facade hardworking indians please share post help families get justice deserve lets make viral thats ask ",
    "cleaned_title": "exposing punjabiorigin builder brother gippy grewal scamming families australia cry justice",
    "cleaned_selftext": "httpsnowninecomauacurrentaffairnswalaxiagroupbadefdacbaffhttpsnowninecomauacurrentaffairnswalaxiagroupbadefdacbaff ive simply enough yet another story surfaced punjabiorigin home builder australia scamming hardworking families living luxurious life funded victims one heartbreaking case involves family autistic daughter whose lives completely devastated scam make matters worse builder brother wellknown punjabi actor gippy grewal know might ruffle feathers also want call pattern scams like disturbingly common among punjabi builders tradesmen australia list countless examples individuals scamming hardworking families many ethnic asian backgrounds indians nepalese prey trust communities look country clear punjabis scammers overrepresentation types crimes undeniable theyre dodging homebuilding contracts theyre involved shady trades plumbing electrical wage theft worker exploitation restaurants gotten bad ive stopped dealing indian businesses australia even groceries communitys reputation damages severely yet dont take stand instead holding scammers accountable socially boycotting eagerly share occasional good news successful indians abroad pretending reflects us truth us like actions enough tarnish collective image isnt australian issue worse canada punjabi origin truckers heavily involved drug trafficking across canada us numerous damming stories feeding growing racism indians abroad theres reason australia restricted student visa applications regions like punjab haryana gujarat particular case builders connection famous actor might leverage justice post goes viral associated shame could pressure accountability families deserve justice reality needs exposed indian media picks dismantles facade hardworking indians please share post help families get justice deserve lets make viral thats ask",
    "cleaned_comments": "said punjabi many times maybe fit much hate unfortunate reality situation dedicated facebook groups australia potentially warn people engaging businesses punjabi canada yes even wrote punjabi every single statement would still enough shameful see punjabis following bringing worst corrupt practices beautiful countries ohh decided finally open eyes similar canada sure good honest punjabis gujju majority money corruption unites us case bc alberta one punjabi sikh pakistani muslim ran real estate business good game whenever client would come office would see praying god made client sign sorts paper without even reading mean dont blame client honest hardworking people easily trust people think others like oh boy forget humanity comes sorts variation like opened eyes today affected enough write post indian subreddit scamming family already struggling autistic daughter kind lows society used want tell fellow indians community upto fed feel good stories media stories like crooks cheats thugs etc ethnicities btw im punjabi think unfair point fingers one community instead bashing anyone ethnicity look good covid lockdown floods australia fires western canada wars middle east sikhs punjabis stepped provide aid heck even rented helicopters australia deliver aid setup bakery syria middle conflict feed public international organizations stayed away check work khalsa aid done recently gave largest donation ever canadian history food bank ottawa sikhs people world good mention sikhs worked respect lot",
    "light_cleaned_title": "Exposing a Punjabi-Origin Builder, brother of Gippy Grewal Scamming Families in Australia – A Cry for Justice",
    "light_cleaned_selftext": "[https://9now.nine.com.au/a-current-affair/nsw-alaxia-group/9ba96399-d2ef-4d81-8376-a3c139b49aff](https://9now.nine.com.au/a-current-affair/nsw-alaxia-group/9ba96399-d2ef-4d81-8376-a3c139b49aff) I’ve simply had enough. Yet again, another story has surfaced about a Punjabi-origin home builder in Australia scamming hardworking families, all while living a luxurious life funded by their victims. One heartbreaking case involves a family with an autistic daughter whose lives have been completely devastated by this scam. To make matters worse, this builder is the brother of well-known Punjabi actor Gippy Grewal. I know this might ruffle feathers, but I also want to call out the pattern. Scams like these are disturbingly common among some Punjabi builders and tradesmen in Australia. I can list countless examples of these individuals scamming hardworking families, many of whom are from ethnic Asian backgrounds (Indians, Nepalese). They prey on the trust of their own communities, \"look he is from my country\". To be clear, not all Punjabis are scammers, but the overrepresentation in these types of crimes is undeniable. If they’re not dodging home-building contracts, they’re involved in shady trades (plumbing, electrical), wage theft, or worker exploitation in restaurants. It’s gotten so bad that I’ve stopped dealing with any Indian businesses in Australia, even for groceries. What does this do to our community’s reputation? It damages it severely. And yet, we don’t take a stand. Instead of holding these scammers accountable and socially boycotting them, we eagerly share the occasional good news about successful Indians abroad, pretending it reflects all of us. The truth is, most of us are not like that, but the actions of a few are enough to tarnish our collective image. This isn’t just an Australian issue, it’s worse in Canada. Punjabi origin truckers are heavily involved in drug trafficking across Canada and the U.S. and this and numerous other damming stories are feeding into growing racism against Indians abroad. There’s a reason Australia restricted student visa applications from regions like Punjab, Haryana, and Gujarat. In this particular case, the builder’s connection to a famous actor might be the only leverage for justice. If this post goes viral, the associated shame could pressure them into accountability. These families deserve justice, and this reality needs to be exposed so Indian media picks it up and dismantles the facade of “hardworking Indians.” **Please share this post and help these families get the justice they deserve. Let’s make this viral. That’s all I ask.**",
    "light_cleaned_comments": "You have not said Punjabi too many times. Maybe you can fit in some more. As much as I hate it myself, this is the unfortunate reality of the situation. There are dedicated facebook groups here in Australia now, to potentially warn other people engaging with businesses such as him. I am a Punjabi in Canada and yes, even if he wrote Punjabi in every single statement it would still be not enough. It’s shameful to see the Punjabis following and bringing the worst corrupt practices to these beautiful countries. ohh so you decided to finally open your eyes. Its similar in Canada sure there are some good and honest punjabi's and gujju but majority is after your money. This corruption is what unites us. There was this case in Bc or Alberta where one Punjabi sikh and other pakistani muslim ran an real estate business, they were so good at the game that whenever the client would come by their office, they would see them praying to their god and that made all the client sign off all sorts of paper without even reading. I mean i dont blame the client as honest and hardworking people easily trust people because they think others are like them but oh boy, they forget that humanity comes with all sorts of variation. Its not like I have opened my eyes today but it has affected me enough to write a post on an Indian subreddit. Scamming from a family who are already struggling with an autistic daughter is the kind of lows that this society is not used to. I want to tell my fellow Indians what our community is upto because we are only fed feel good stories by the media and not stories like these. There are crooks, cheats, thugs etc from all ethnicities. BTW I'm not punjabi & I think Its unfair to point fingers at one community. Instead of bashing anyone or any ethnicity we should look at the good in all. During Covid Lockdown, floods in Australia, fires in western Canada, wars in the middle east. It was the Sikhs/ Punjabis who stepped up to provide aid. Heck they even rented helicopters in Australia to deliver aid. Setup a bakery in Syria in the middle of the conflict to feed the public where international organizations stayed away, Check out the work Khalsa aid has done or is doing. Very recently they gave the largest donation ever in Canadian History to the food bank in Ottawa. Not only the Sikhs, there are people all over the world who are doing good. I mention the Sikhs. I have worked with them and respect them a lot."
}