{
    "id": "15gb1hd",
    "title": "Help regarding my asus gaming laptop !!!",
    "url": "https://www.reddit.com/r/india/comments/15gb1hd/help_regarding_my_asus_gaming_laptop/",
    "selftext": " Few months ago i bought this laptop from Flipkart (ASUS TUF F15) and everything is working fine but the only problem is that i by mistake popped the ALT key out of my keyboard while cleaning it and i was unable to put it back in so i contacted ASUS india. They sent their engineer at my home but he denied to put the key back in and said \"YEH TOOT GYI HAI\". They told that a new keyboard will be replaced which is costing me around 7200INR. So is there a way where i can get it done in any cheaper ? Also laptop is under warranty. Please do let me know if anything can be done except getting the whole keyboard replaced. \n\nhttps://preview.redd.it/sooecxvqnpfb1.jpg?width=720&format=pjpg&auto=webp&s=b3d3f9db6ada57292aab9703c3d6c50cbefebc47",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690988110.0,
    "convurl": "https://b.thumbs.redditmedia.com/xFYgXTZI_Fsq7B3uamFl1MHV2ocm_KE7N3fsQ0wFtlo.jpg",
    "comments": [
        "Scam kar rahe hai aapko. Normally a key is held by a metal piece that attaches to backy of the key and there is some silicone that helps in the bouncing back of the key when pressed. Take it to a local shop to get it repaired or watch YouTube videos. YouTube had a lot of videos regarding this. You might be able to fix the key by replacing it with a key from another keyboard. If nothing works just screw the alt there is another alt on the other side of the keyboard use that.",
        "but local shop pe le jane se warranty toh void nahi ho jaegi ?"
    ],
    "cleaned_text": "help regarding asus gaming laptop months ago bought laptop flipkart asus tuf f everything working fine problem mistake popped alt key keyboard cleaning unable put back contacted asus india sent engineer home denied put key back said yeh toot gyi hai told new keyboard replaced costing around inr way get done cheaper also laptop warranty please let know anything done except getting whole keyboard replaced ",
    "cleaned_title": "help regarding asus gaming laptop",
    "cleaned_selftext": "months ago bought laptop flipkart asus tuf f everything working fine problem mistake popped alt key keyboard cleaning unable put back contacted asus india sent engineer home denied put key back said yeh toot gyi hai told new keyboard replaced costing around inr way get done cheaper also laptop warranty please let know anything done except getting whole keyboard replaced",
    "cleaned_comments": "scam kar rahe hai aapko normally key held metal piece attaches backy key silicone helps bouncing back key pressed take local shop get repaired watch youtube videos youtube lot videos regarding might able fix key replacing key another keyboard nothing works screw alt another alt side keyboard use local shop pe le jane se warranty toh void nahi ho jaegi",
    "light_cleaned_title": "Help regarding my asus gaming laptop !!!",
    "light_cleaned_selftext": "Few months ago i bought this laptop from Flipkart (ASUS TUF F15) and everything is working fine but the only problem is that i by mistake popped the ALT key out of my keyboard while cleaning it and i was unable to put it back in so i contacted ASUS india. They sent their engineer at my home but he denied to put the key back in and said \"YEH TOOT GYI HAI\". They told that a new keyboard will be replaced which is costing me around 7200INR. So is there a way where i can get it done in any cheaper ? Also laptop is under warranty. Please do let me know if anything can be done except getting the whole keyboard replaced.",
    "light_cleaned_comments": "Scam kar rahe hai aapko. Normally a key is held by a metal piece that attaches to backy of the key and there is some silicone that helps in the bouncing back of the key when pressed. Take it to a local shop to get it repaired or watch YouTube videos. YouTube had a lot of videos regarding this. You might be able to fix the key by replacing it with a key from another keyboard. If nothing works just screw the alt there is another alt on the other side of the keyboard use that. but local shop pe le jane se warranty toh void nahi ho jaegi ?"
}