{
    "id": "1ae19h1",
    "title": "Aren't the dividers supposed to be black and yellow ? These were painted over.",
    "url": "https://v.redd.it/mlhpijt92ffc1",
    "selftext": "I do not know if there are any laws regarding this. There are some international guidelines I found while googling but that's pretty much it. Can't do anything but it's so sad that it's funny. ",
    "flair": "Law & Courts",
    "score": 39,
    "num_comments": 6,
    "created_utc": 1706550331.0,
    "convurl": "https://external-preview.redd.it/OHJpcWZvajkyZmZjMaaqu-5GpQtFgLp2GcRxWn1821izYuositJz6cHeuYeh.png?format=pjpg&auto=webp&s=53ce93ba6b8355274c01dc251e86dc6756125cc6",
    "comments": [
        "Wait for some years, tumhare gaand bhi rang dega Mudi",
        "That is apt, actually. A saffron divider dividing the country...",
        "Not kidding, I've started absolutely hating the orange colour lately.",
        "What an eye sore. Indian babus and PWDs know nothing about aesthetics.",
        "Gen z people trying to complain in every situation... Bro thrre is a divider that the best thing to have, don't react abnormally",
        "The post was about the color, not about the divider. And it's not the best thing. It's called the bare minimum. Don't cocksuck the govt for doing the least of what they are supposed to.",
        "Orange is the best colour and you're wrong if you disagree. Even a traitor.",
        "Rang de tu mohe geruaaaa",
        "Ye PWD nahi bro. It's the anpadhs running the PWD. These people think engineer bewakoof hai kyuki hum Bina padhe likhe unke upar hai. India is about to become the next pakistan. Same religious politics. Same hate spewing ministers. Same uneducated population. Same ambition to get the past time back. We are walking backwards. Wishing for ram Raj in today's time.",
        "I know right. Rang do sab kesari.",
        "He has BJPs lemon chus in his mouth. Can't think straight. How did you even reach the gen z angle. OP didn't tell you his age. Maybe he's your father's age.",
        "😂😂",
        "I m not that politically controversial",
        "🤣",
        "+1",
        "It's a nice initiative, no cost to repaint it .\n Just get unemployed up ppl in line give them Juban kesari and you are good to go."
    ],
    "cleaned_text": "arent dividers supposed black yellow painted know laws regarding international guidelines found googling thats pretty much cant anything sad funny ",
    "cleaned_title": "arent dividers supposed black yellow painted",
    "cleaned_selftext": "know laws regarding international guidelines found googling thats pretty much cant anything sad funny",
    "cleaned_comments": "wait years tumhare gaand bhi rang dega mudi apt actually saffron divider dividing country kidding ive started absolutely hating orange colour lately eye sore indian babus pwds know nothing aesthetics gen z people trying complain every situation bro thrre divider best thing dont react abnormally post color divider best thing called bare minimum dont cocksuck govt least supposed orange best colour youre wrong disagree even traitor rang de tu mohe geruaaaa ye pwd nahi bro anpadhs running pwd people think engineer bewakoof hai kyuki hum bina padhe likhe unke upar hai india become next pakistan religious politics hate spewing ministers uneducated population ambition get past time back walking backwards wishing ram raj todays time know right rang sab kesari bjps lemon chus mouth cant think straight even reach gen z angle op didnt tell age maybe hes fathers age politically controversial nice initiative cost repaint get unemployed ppl line give juban kesari good go",
    "light_cleaned_title": "Aren't the dividers supposed to be black and yellow ? These were painted over.",
    "light_cleaned_selftext": "I do not know if there are any laws regarding this. There are some international guidelines I found while googling but that's pretty much it. Can't do anything but it's so sad that it's funny.",
    "light_cleaned_comments": "Wait for some years, tumhare gaand bhi rang dega Mudi That is apt, actually. A saffron divider dividing the country... Not kidding, I've started absolutely hating the orange colour lately. What an eye sore. Indian babus and PWDs know nothing about aesthetics. Gen z people trying to complain in every situation... Bro thrre is a divider that the best thing to have, don't react abnormally The post was about the color, not about the divider. And it's not the best thing. It's called the bare minimum. Don't cocksuck the govt for doing the least of what they are supposed to. Orange is the best colour and you're wrong if you disagree. Even a traitor. Rang de tu mohe geruaaaa Ye PWD nahi bro. It's the anpadhs running the PWD. These people think engineer bewakoof hai kyuki hum Bina padhe likhe unke upar hai. India is about to become the next pakistan. Same religious politics. Same hate spewing ministers. Same uneducated population. Same ambition to get the past time back. We are walking backwards. Wishing for ram Raj in today's time. I know right. Rang do sab kesari. He has BJPs lemon chus in his mouth. Can't think straight. How did you even reach the gen z angle. OP didn't tell you his age. Maybe he's your father's age. 😂😂 I m not that politically controversial 🤣 +1 It's a nice initiative, no cost to repaint it . Just get unemployed up ppl in line give them Juban kesari and you are good to go."
}