{
    "id": "13luyj9",
    "title": "'Prima facie no manipulation by Adani Group': Supreme Court panel on Hindenburg report",
    "url": "https://www.hindustantimes.com/india-news/prima-facie-no-manipulation-by-adani-group-sc-panel-on-hindenburg-report-101684487370342.html",
    "selftext": "What do you guys think? Seems to me like the 6 member panelists are gonna be rich soon.",
    "flair": "Law & Courts",
    "score": 22,
    "num_comments": 3,
    "created_utc": 1684501584.0,
    "convurl": "https://external-preview.redd.it/vfd_9Hdp6mvaHswppqrYrlKEM8NEClJ76r8Z8zY2qQU.jpg?auto=webp&v=enabled&s=40ea5053a90acb1963284693a0d4a8c213a38231",
    "comments": [
        "LOL. Whitewash",
        "Not surprised at all,  i would have been surprised if they found something fishy.",
        "So we're to believe that the family of known frauds has nothing to do with the absurdly high market demand for their stocks?\n\nPrima facie one thing is clear that nothing would could come out of this until the Adani Union Government is in power."
    ],
    "cleaned_text": "prima facie manipulation adani group supreme court panel hindenburg report guys think seems like member panelists gon na rich soon ",
    "cleaned_title": "prima facie manipulation adani group supreme court panel hindenburg report",
    "cleaned_selftext": "guys think seems like member panelists gon na rich soon",
    "cleaned_comments": "lol whitewash surprised would surprised found something fishy believe family known frauds nothing absurdly high market demand stocks prima facie one thing clear nothing would could come adani union government power",
    "light_cleaned_title": "'Prima facie no manipulation by Adani Group': Supreme Court panel on Hindenburg report",
    "light_cleaned_selftext": "What do you guys think? Seems to me like the 6 member panelists are gonna be rich soon.",
    "light_cleaned_comments": "LOL. Whitewash Not surprised at all, i would have been surprised if they found something fishy. So we're to believe that the family of known frauds has nothing to do with the absurdly high market demand for their stocks? Prima facie one thing is clear that nothing would could come out of this until the Adani Union Government is in power."
}