{
    "id": "14le8xv",
    "title": "Hatred against a particular community.",
    "url": "https://www.reddit.com/gallery/14le8xv",
    "selftext": "I'm in class 11 right now and this is our school group where a holiday message for Eid was sent by the teacher, there are some students in my class who do things like hindu-muslim controversy. Recently they spammed bhagwa flag in this eid holiday message.\n\nCan we have a solution to solve this hatred against a particular community.",
    "flair": "AskIndia",
    "score": 99,
    "num_comments": 59,
    "created_utc": 1687970126.0,
    "convurl": "https://i.redd.it/e5wmj6osds8b1.png",
    "comments": [
        "Let it be. At this point, many of us have gotten used to it.",
        "You want to solve the problem of hatred?\n\n* When you are old enough, register to vote.\n\n* Vote out the party in power if they are communal and polarising. Do this for all levels of elections. Repeat this step all your life.\n\n* Complete your education. Become financially independent.\n\n* Call out people who deal in hatred or at least ostracise them. This could be people in your life or the media, politicians and their corporate overlords.\n\n* Find others like yourself. Work together and support each other. Hate is easier to rally around than basic human decency.\n\n* Be an informed citizen, develop a scientific temperament and always be vigil if you want to live in a democracy. \n\n* If you see someone who's on the fence, talk to them and convince them to do the above as well.",
        "Screenshot all the hateful shit these kids will say and when the time comes report them to the companies they’re gonna join. \n\nThat’s how you bring these lowlifes in line.",
        "Look at kids in America and Europe fighting the right fight, meanwhile kids here...",
        "What right fight? Kids in America are shooting each other dead. Kids in Europe are getting high on weed.",
        "⛳⛳⛳⛳⛳⛳⛳\n\n\n/ sarcasm",
        "This is straight up ignorance.   \n\n\n [Younger Western Europeans more progressive in social, political views than older groups | Pew Research Center](https://www.pewresearch.org/short-reads/2018/10/30/younger-western-europeans-more-socially-and-politically-progressive/)   \n\n\n [Young people are more engaged with politics. That's bad news for Republicans - Los Angeles Times (latimes.com)](https://www.latimes.com/politics/newsletter/2021-04-23/surge-political-engagement-youth-problem-for-gop-essential-politics)   \n\n\n> Kids in America are shooting each other dead.  \n\n [March For Our Lives](https://marchforourlives.com/)",
        "They are doing this in front of the teacher? Is the teacher not doing anything? Get the teachers support and complain to the principal or higher ups,",
        "Until there are actual consequences for this behaviour, there won't be any change. These kids will grow up and continue this cycle of hatred in more harmful ways. Ignorance often leads to indirect encouragement and assurance.",
        "Wow, i used to think that Only this generation is doomed but nah our future doesn't seem any better either.",
        "Bhaiii ,heavy joke kar diya aapne",
        "India has no concept of micro aggressions. People get away with rape and murder with the right connections and the right surname.",
        "They will all lie to their grandkids  like uncle Hans from Argentina",
        "Kids in America are doing gender fluid , all whites are racist bullshit.  They are basically a left wing version of these fools . The truth is today's world is polarized.  No place for sensible decisions",
        "+1",
        "gaad liya jhanda?",
        "TIL bhagwa translates to red.",
        "I was going to say okay unkil then I saw your profile and you're in 11th standard. So I won't say anything since your brain isn't developed enough to think properly, but I'd advise you to research and know about a topic properly before making such sweeping statements.",
        "You can start by naming this 'particular community'.  I'm confused - are you talking about black lesbians?",
        "I don't think anybody over the age of 3 would find my statement about western wokeism outrageous . I hate modi and hindu nationalism but saying things like gender doesn't exist is stupid .",
        "It's funny how the dude's talking about shit he knows jack shit about lmao. I'm also in 11th standard, but I live the US, he's probably got all his information from like the Indian equivalent of Fox News.",
        "herd mentality, alas there isnt much to do other than not giving them the attention that they are very desperate for,",
        "I remember once a guy from my class ( Hindu) got in a fight with another guy ( Muslim) on our class GC.He said something Islamophobic and  he was kicked from the GC and never added back. This was around 3 years ago, wtf has happened in 3 years?",
        "Beta tujo yeh badi badi hinge maar raha haina...I used to do the same until I came to the us...right wing political commentators ke reaction videos and podcasts dekhe you have developed a serious bias bro.\n\nAmerica isn't anything like you make it to be. You need to come to the us to see it for what it is...it's so rich and most people have such a high standard of living you'll be shocked.\n\n\nFucking 500-600 pound( morbid fatties) people are able to live an excellent life without working a day because of social security and food stamps. That's what the us government is doing for its people.\n\nIndian life sucks honestly...entire life ghis ghis ke nikal deti hai middle class with stress.\n\nTaking a debt at 1 percent interest in usa is as easy as taking a dump in the morning. Yaha India main gaand laga dete hai Bank waale with interest .\n\nTu Jo usa ko mazaak main le Raha haina...it's laughable at best coz even in its worst form us is 10000x better than india.",
        "Don't engage in this things just focus on study atb",
        "Who said gender didn’t exist? If you are talking about gender fluid people then it’s the idea that gender is a spectrum not that it doesn’t exist",
        "I have observed these mentally closely in last few months. People who like to spew venom, enjoy when others oppose them. That's their adrenaline. Never argue with them, reply them, or try to correct them, they're past that stage.\n\nIf i were you, I would have spammed them with more Eid greetings and pictures of Hindu-Muslim celebrating each others festivals. They hate this simple trick.",
        "I highly doubt companies care about this stuff except maybe mncs which lets be honest, people wasting their energy on this bs aren't gonna make it.",
        "It will take a couple of generations to get out of this mess. Why do you think almost everyone's kids & grand kids in the party are abroad?",
        "Why do people make such a big deal about group chats",
        "In my college days only thing we did in GC was fooling around, exchanging notes during exams, and deciding about group bunks. Didn't have whatsapp during my school days.",
        "Did you just ignore all the arguments the previous commentator provided and resort to what-aboutery? Yeah, you aren't aware of the truth at all. All this anger you have, use it to do research. Actual one, not internet surfing.",
        "Sadly, the hate is bigger than the teachers nowadays, \n\nIf the teacher tries to confront them, they will probably screenshot that and frame the teacher instead...\n\n\nHe or she might lost her job",
        "Apko eid mubarak chote vai",
        "Vote to which party exactly?all parties are the same .they just have different votebank",
        "Sirf jhanda badalta hai, danda wahi rehta hai!\nThe current regime needs to go atleast for the upcoming term, if that doesnt happen, expect this shit to go unabated and even accelerated for the next 5 years the least.",
        "That's I am asking for an opposition party seriously.i will be tiring 18 this nov.but people forget that BJP is in power because opposition parties are pure shit and have reduced the bar so low.even I thought of aap at a point but their titlment towards temples for votebank and governance in Punjab made me believe they wil go to any length to get in power.",
        "Reporting the post",
        "That’s the fun part. In India EVERY news channel is Fox News.",
        "Don't be surprised if there's a mini group separately where they applaud that fellow & freely stew in the hate together.",
        "bro never went to USA and straight away here with what he sees from instagram reels. It's like saying all indians shit on streets based on some people",
        "Red flag",
        "so many red flags. Crossbreeds !",
        "I hate that I comepletely agree with you 😡",
        "The best I can do is improve my conversational skills and show people the truth. (To those who have the capacity to understand) and work hard while these people waste time.",
        "Although there is some truth to it. You seem to be a pride supporter but even you would agree that, They seem to be holding a lot of power in America.",
        "europe yes\n\nbut america the kids are more divided then ever. There is a rise in conservative in some kids because they are tired of wokesm being forced on them. Aka kids stomping on pride flags. \n\nOn the other side, the classrooms are very diverse and because of that lots of kids are not being racist compared to before. \n\nI have also read that minorities over there tend to be more conservative than white people. \n\nAmerica is a huge mix bag who voted trump to be president lol.",
        "Nature and time sorts things out on its own.",
        "We had WhatsApp in my school days and it consisted of the popular kids kicking you out if you dare say anything they didn’t like. Most of the quieter and studious types didn’t join these groups and still met up for hangouts.",
        "Op parhai karle yaha bakchod jaise hatred mat faila",
        "People were much humble those days, I was the fat kid in my school and absolutely noone bullied me. In my 11th std I had really bad haemorrhoids I wasn't able to sit and was standing half of the time everyone in my class knew and nobody made fun of me. Teachers and my classmates were extremely understanding of my pain. \n\nIt's in college when I first experienced bullying due to my weight and that too died down after 2 months."
    ],
    "cleaned_text": "hatred particular community im class right school group holiday message eid sent teacher students class things like hindumuslim controversy recently spammed bhagwa flag eid holiday message solution solve hatred particular community ",
    "cleaned_title": "hatred particular community",
    "cleaned_selftext": "im class right school group holiday message eid sent teacher students class things like hindumuslim controversy recently spammed bhagwa flag eid holiday message solution solve hatred particular community",
    "cleaned_comments": "let point many us gotten used want solve problem hatred old enough register vote vote party power communal polarising levels elections repeat step life complete education become financially independent call people deal hatred least ostracise could people life media politicians corporate overlords find others like work together support hate easier rally around basic human decency informed citizen develop scientific temperament always vigil want live democracy see someone whos fence talk convince well screenshot hateful shit kids say time comes report companies theyre gon na join thats bring lowlifes line look kids america europe fighting right fight meanwhile kids right fight kids america shooting dead kids europe getting high weed sarcasm straight ignorance younger western europeans progressive social political views older groups pew research centerhttpswwwpewresearchorgshortreadsyoungerwesterneuropeansmoresociallyandpoliticallyprogressive young people engaged politics thats bad news republicans los angeles times latimescomhttpswwwlatimescompoliticsnewslettersurgepoliticalengagementyouthproblemforgopessentialpolitics kids america shooting dead march liveshttpsmarchforourlivescom front teacher teacher anything get teachers support complain principal higher ups actual consequences behaviour wont change kids grow continue cycle hatred harmful ways ignorance often leads indirect encouragement assurance wow used think generation doomed nah future doesnt seem better either bhaiii heavy joke kar diya aapne india concept micro aggressions people get away rape murder right connections right surname lie grandkids like uncle hans argentina kids america gender fluid whites racist bullshit basically left wing version fools truth todays world polarized place sensible decisions gaad liya jhanda til bhagwa translates red going say okay unkil saw profile youre th standard wont say anything since brain isnt developed enough think properly id advise research know topic properly making sweeping statements start naming particular community im confused talking black lesbians dont think anybody age would find statement western wokeism outrageous hate modi hindu nationalism saying things like gender doesnt exist stupid funny dudes talking shit knows jack shit lmao im also th standard live us hes probably got information like indian equivalent fox news herd mentality alas isnt much giving attention desperate remember guy class hindu got fight another guy muslim class gche said something islamophobic kicked gc never added back around years ago wtf happened years beta tujo yeh badi badi hinge maar raha hainai used came usright wing political commentators ke reaction videos podcasts dekhe developed serious bias bro america isnt anything like make need come us see isits rich people high standard living youll shocked fucking pound morbid fatties people able live excellent life without working day social security food stamps thats us government people indian life sucks honestlyentire life ghis ghis ke nikal deti hai middle class stress taking debt percent interest usa easy taking dump morning yaha india main gaand laga dete hai bank waale interest tu jo usa ko mazaak main le raha hainaits laughable best coz even worst form us x better india dont engage things focus study atb said gender didnt exist talking gender fluid people idea gender spectrum doesnt exist observed mentally closely last months people like spew venom enjoy others oppose thats adrenaline never argue reply try correct theyre past stage would spammed eid greetings pictures hindumuslim celebrating others festivals hate simple trick highly doubt companies care stuff except maybe mncs lets honest people wasting energy bs arent gon na make take couple generations get mess think almost everyones kids grand kids party abroad people make big deal group chats college days thing gc fooling around exchanging notes exams deciding group bunks didnt whatsapp school days ignore arguments previous commentator provided resort whataboutery yeah arent aware truth anger use research actual one internet surfing sadly hate bigger teachers nowadays teacher tries confront probably screenshot frame teacher instead might lost job apko eid mubarak chote vai vote party exactlyall parties different votebank sirf jhanda badalta hai danda wahi rehta hai current regime needs go atleast upcoming term doesnt happen expect shit go unabated even accelerated next years least thats asking opposition party seriouslyi tiring novbut people forget bjp power opposition parties pure shit reduced bar loweven thought aap point titlment towards temples votebank governance punjab made believe wil go length get power reporting post thats fun part india every news channel fox news dont surprised theres mini group separately applaud fellow freely stew hate together bro never went usa straight away sees instagram reels like saying indians shit streets based people red flag many red flags crossbreeds hate comepletely agree best improve conversational skills show people truth capacity understand work hard people waste time although truth seem pride supporter even would agree seem holding lot power america europe yes america kids divided ever rise conservative kids tired wokesm forced aka kids stomping pride flags side classrooms diverse lots kids racist compared also read minorities tend conservative white people america huge mix bag voted trump president lol nature time sorts things whatsapp school days consisted popular kids kicking dare say anything didnt like quieter studious types didnt join groups still met hangouts op parhai karle yaha bakchod jaise hatred mat faila people much humble days fat kid school absolutely noone bullied th std really bad haemorrhoids wasnt able sit standing half time everyone class knew nobody made fun teachers classmates extremely understanding pain college first experienced bullying due weight died months",
    "light_cleaned_title": "Hatred against a particular community.",
    "light_cleaned_selftext": "I'm in class 11 right now and this is our school group where a holiday message for Eid was sent by the teacher, there are some students in my class who do things like hindu-muslim controversy. Recently they spammed bhagwa flag in this eid holiday message. Can we have a solution to solve this hatred against a particular community.",
    "light_cleaned_comments": "Let it be. At this point, many of us have gotten used to it. You want to solve the problem of hatred? * When you are old enough, register to vote. * Vote out the party in power if they are communal and polarising. Do this for all levels of elections. Repeat this step all your life. * Complete your education. Become financially independent. * Call out people who deal in hatred or at least ostracise them. This could be people in your life or the media, politicians and their corporate overlords. * Find others like yourself. Work together and support each other. Hate is easier to rally around than basic human decency. * Be an informed citizen, develop a scientific temperament and always be vigil if you want to live in a democracy. * If you see someone who's on the fence, talk to them and convince them to do the above as well. Screenshot all the hateful shit these kids will say and when the time comes report them to the companies they’re gonna join. That’s how you bring these lowlifes in line. Look at kids in America and Europe fighting the right fight, meanwhile kids here... What right fight? Kids in America are shooting each other dead. Kids in Europe are getting high on weed. ⛳⛳⛳⛳⛳⛳⛳ / sarcasm This is straight up ignorance. [Younger Western Europeans more progressive in social, political views than older groups | Pew Research Center](https://www.pewresearch.org/short-reads/2018/10/30/younger-western-europeans-more-socially-and-politically-progressive/) [Young people are more engaged with politics. That's bad news for Republicans - Los Angeles Times (latimes.com)](https://www.latimes.com/politics/newsletter/2021-04-23/surge-political-engagement-youth-problem-for-gop-essential-politics) > Kids in America are shooting each other dead. [March For Our Lives](https://marchforourlives.com/) They are doing this in front of the teacher? Is the teacher not doing anything? Get the teachers support and complain to the principal or higher ups, Until there are actual consequences for this behaviour, there won't be any change. These kids will grow up and continue this cycle of hatred in more harmful ways. Ignorance often leads to indirect encouragement and assurance. Wow, i used to think that Only this generation is doomed but nah our future doesn't seem any better either. Bhaiii ,heavy joke kar diya aapne India has no concept of micro aggressions. People get away with rape and murder with the right connections and the right surname. They will all lie to their grandkids like uncle Hans from Argentina Kids in America are doing gender fluid , all whites are racist bullshit. They are basically a left wing version of these fools . The truth is today's world is polarized. No place for sensible decisions +1 gaad liya jhanda? TIL bhagwa translates to red. I was going to say okay unkil then I saw your profile and you're in 11th standard. So I won't say anything since your brain isn't developed enough to think properly, but I'd advise you to research and know about a topic properly before making such sweeping statements. You can start by naming this 'particular community'. I'm confused - are you talking about black lesbians? I don't think anybody over the age of 3 would find my statement about western wokeism outrageous . I hate modi and hindu nationalism but saying things like gender doesn't exist is stupid . It's funny how the dude's talking about shit he knows jack shit about lmao. I'm also in 11th standard, but I live the US, he's probably got all his information from like the Indian equivalent of Fox News. herd mentality, alas there isnt much to do other than not giving them the attention that they are very desperate for, I remember once a guy from my class ( Hindu) got in a fight with another guy ( Muslim) on our class GC.He said something Islamophobic and he was kicked from the GC and never added back. This was around 3 years ago, wtf has happened in 3 years? Beta tujo yeh badi badi hinge maar raha haina...I used to do the same until I came to the us...right wing political commentators ke reaction videos and podcasts dekhe you have developed a serious bias bro. America isn't anything like you make it to be. You need to come to the us to see it for what it is...it's so rich and most people have such a high standard of living you'll be shocked. Fucking 500-600 pound( morbid fatties) people are able to live an excellent life without working a day because of social security and food stamps. That's what the us government is doing for its people. Indian life sucks honestly...entire life ghis ghis ke nikal deti hai middle class with stress. Taking a debt at 1 percent interest in usa is as easy as taking a dump in the morning. Yaha India main gaand laga dete hai Bank waale with interest . Tu Jo usa ko mazaak main le Raha haina...it's laughable at best coz even in its worst form us is 10000x better than india. Don't engage in this things just focus on study atb Who said gender didn’t exist? If you are talking about gender fluid people then it’s the idea that gender is a spectrum not that it doesn’t exist I have observed these mentally closely in last few months. People who like to spew venom, enjoy when others oppose them. That's their adrenaline. Never argue with them, reply them, or try to correct them, they're past that stage. If i were you, I would have spammed them with more Eid greetings and pictures of Hindu-Muslim celebrating each others festivals. They hate this simple trick. I highly doubt companies care about this stuff except maybe mncs which lets be honest, people wasting their energy on this bs aren't gonna make it. It will take a couple of generations to get out of this mess. Why do you think almost everyone's kids & grand kids in the party are abroad? Why do people make such a big deal about group chats In my college days only thing we did in GC was fooling around, exchanging notes during exams, and deciding about group bunks. Didn't have whatsapp during my school days. Did you just ignore all the arguments the previous commentator provided and resort to what-aboutery? Yeah, you aren't aware of the truth at all. All this anger you have, use it to do research. Actual one, not internet surfing. Sadly, the hate is bigger than the teachers nowadays, If the teacher tries to confront them, they will probably screenshot that and frame the teacher instead... He or she might lost her job Apko eid mubarak chote vai Vote to which party exactly?all parties are the same .they just have different votebank Sirf jhanda badalta hai, danda wahi rehta hai! The current regime needs to go atleast for the upcoming term, if that doesnt happen, expect this shit to go unabated and even accelerated for the next 5 years the least. That's I am asking for an opposition party seriously.i will be tiring 18 this nov.but people forget that BJP is in power because opposition parties are pure shit and have reduced the bar so low.even I thought of aap at a point but their titlment towards temples for votebank and governance in Punjab made me believe they wil go to any length to get in power. Reporting the post That’s the fun part. In India EVERY news channel is Fox News. Don't be surprised if there's a mini group separately where they applaud that fellow & freely stew in the hate together. bro never went to USA and straight away here with what he sees from instagram reels. It's like saying all indians shit on streets based on some people Red flag so many red flags. Crossbreeds ! I hate that I comepletely agree with you 😡 The best I can do is improve my conversational skills and show people the truth. (To those who have the capacity to understand) and work hard while these people waste time. Although there is some truth to it. You seem to be a pride supporter but even you would agree that, They seem to be holding a lot of power in America. europe yes but america the kids are more divided then ever. There is a rise in conservative in some kids because they are tired of wokesm being forced on them. Aka kids stomping on pride flags. On the other side, the classrooms are very diverse and because of that lots of kids are not being racist compared to before. I have also read that minorities over there tend to be more conservative than white people. America is a huge mix bag who voted trump to be president lol. Nature and time sorts things out on its own. We had WhatsApp in my school days and it consisted of the popular kids kicking you out if you dare say anything they didn’t like. Most of the quieter and studious types didn’t join these groups and still met up for hangouts. Op parhai karle yaha bakchod jaise hatred mat faila People were much humble those days, I was the fat kid in my school and absolutely noone bullied me. In my 11th std I had really bad haemorrhoids I wasn't able to sit and was standing half of the time everyone in my class knew and nobody made fun of me. Teachers and my classmates were extremely understanding of my pain. It's in college when I first experienced bullying due to my weight and that too died down after 2 months."
}