{
    "id": "1dj4e8j",
    "title": "Fake news about Anant Ambani and Hindustan Times on Instagram ad. How does this get past regulations?",
    "url": "https://www.reddit.com/gallery/1dj4e8j",
    "selftext": "Found this sponsored ad on Instagram that leads to this fake impersonation of Hindustan Times article on a random url. The article is all about this fake interview of anant ambani where he disclosed his secret for getting rich. Was a hilarious read. But on a more serious read, how does something like this get passed on as an Instagram ad? Is there no regulation for stuff like this?",
    "flair": "Crime",
    "score": 27,
    "num_comments": 13,
    "created_utc": 1718752316.0,
    "convurl": "https://i.redd.it/otbdy6c2xe7d1.jpg",
    "comments": [
        "https://preview.redd.it/gceq7vn6ye7d1.jpeg?width=1179&format=pjpg&auto=webp&s=6d5b0c6ac77632e56b9e0aa6c57715e6fa9399af\n\nThe sponsor also points to newslaundry.com for added credibility. WTH is going on?!",
        "Surprisingly very good English for a scam. They are targeting those educated people who voted for the BJP ig.",
        "Yeah, that’s some 8-bands English.",
        "I’m guessing ChatGPT?",
        "Honestly, this is one of those fake news I don’t care about. This might just be some rage bait. It’s nothing compared to the fake news that tries to bend our political and cultural future.",
        "Dude check the domain name it's a fake page don't click on anything on the page, impressive that they made an exact replica of the news site",
        "I got modiji call asking for money for recounting of votes",
        "Variations of this ad have appeared with Kirti Sanon and some cricketer also. It's just a spam account",
        "Money 🤑. You will also see such stupid ads on reddit nowadays",
        "Ye mera samsoong ka number hai. mujhe chaar baje phone kar.",
        "It’s more of high tech wizardry. It’s a genre of ads run by Israeli forex trading/gambling companies (which mostly are dodgy tbh) to acquire users that will deposit and trade/game on their platforms. Typically they get banned by insta but advertisers are very sophisticated and use something called black hat ads. We use ai to generate this crap these days so it’s possible to generate 1000’s of variations of similar ads (with anant, modi, dhruv whoever based on online trend signals from social media monitors) and then deploy them at scale and figure out who likes what (based on age, sex, location, time, interests etc) and then spend.. basically if you engaged with the ad about anant ambani or god forbid clicked it, you’re going to bombarded with similar ads (retargeting)"
    ],
    "cleaned_text": "fake news anant ambani hindustan times instagram ad get past regulations found sponsored ad instagram leads fake impersonation hindustan times article random url article fake interview anant ambani disclosed secret getting rich hilarious read serious read something like get passed instagram ad regulation stuff like ",
    "cleaned_title": "fake news anant ambani hindustan times instagram ad get past regulations",
    "cleaned_selftext": "found sponsored ad instagram leads fake impersonation hindustan times article random url article fake interview anant ambani disclosed secret getting rich hilarious read serious read something like get passed instagram ad regulation stuff like",
    "cleaned_comments": "sponsor also points newslaundrycom added credibility wth going surprisingly good english scam targeting educated people voted bjp ig yeah thats bands english im guessing chatgpt honestly one fake news dont care might rage bait nothing compared fake news tries bend political cultural future dude check domain name fake page dont click anything page impressive made exact replica news site got modiji call asking money recounting votes variations ad appeared kirti sanon cricketer also spam account money also see stupid ads reddit nowadays ye mera samsoong ka number hai mujhe chaar baje phone kar high tech wizardry genre ads run israeli forex tradinggambling companies mostly dodgy tbh acquire users deposit tradegame platforms typically get banned insta advertisers sophisticated use something called black hat ads use ai generate crap days possible generate variations similar ads anant modi dhruv whoever based online trend signals social media monitors deploy scale figure likes based age sex location time interests etc spend basically engaged ad anant ambani god forbid clicked youre going bombarded similar ads retargeting",
    "light_cleaned_title": "Fake news about Anant Ambani and Hindustan Times on Instagram ad. How does this get past regulations?",
    "light_cleaned_selftext": "Found this sponsored ad on Instagram that leads to this fake impersonation of Hindustan Times article on a random url. The article is all about this fake interview of anant ambani where he disclosed his secret for getting rich. Was a hilarious read. But on a more serious read, how does something like this get passed on as an Instagram ad? Is there no regulation for stuff like this?",
    "light_cleaned_comments": "The sponsor also points to newslaundry.com for added credibility. WTH is going on?! Surprisingly very good English for a scam. They are targeting those educated people who voted for the BJP ig. Yeah, that’s some 8-bands English. I’m guessing ChatGPT? Honestly, this is one of those fake news I don’t care about. This might just be some rage bait. It’s nothing compared to the fake news that tries to bend our political and cultural future. Dude check the domain name it's a fake page don't click on anything on the page, impressive that they made an exact replica of the news site I got modiji call asking for money for recounting of votes Variations of this ad have appeared with Kirti Sanon and some cricketer also. It's just a spam account Money 🤑. You will also see such stupid ads on reddit nowadays Ye mera samsoong ka number hai. mujhe chaar baje phone kar. It’s more of high tech wizardry. It’s a genre of ads run by Israeli forex trading/gambling companies (which mostly are dodgy tbh) to acquire users that will deposit and trade/game on their platforms. Typically they get banned by insta but advertisers are very sophisticated and use something called black hat ads. We use ai to generate this crap these days so it’s possible to generate 1000’s of variations of similar ads (with anant, modi, dhruv whoever based on online trend signals from social media monitors) and then deploy them at scale and figure out who likes what (based on age, sex, location, time, interests etc) and then spend.. basically if you engaged with the ad about anant ambani or god forbid clicked it, you’re going to bombarded with similar ads (retargeting)"
}