{
    "id": "17qhn4p",
    "title": "Amit Shah narrowly escapes as his vehicle comes in contact with power cable in Rajasthan's Nagaur",
    "url": "https://www.deccanherald.com/elections/rajasthan/amit-shah-narrowly-escapes-as-his-vehicle-comes-in-contact-with-power-cable-in-rajasthans-nagaur-2761011",
    "selftext": "Such is state of affairs, even these lords aren't safe.",
    "flair": "Politics",
    "score": 523,
    "num_comments": 87,
    "created_utc": 1699434201.0,
    "convurl": "https://external-preview.redd.it/_SCZ8Nn8mcz4ep7KJG0-hiftqktYoXJAVjw_6m1ATeA.jpg?auto=webp&s=ce85d64b1fd3e4a282a1df43b6a43ba6ade313e0",
    "comments": [
        "Sambhal k re baaba abi or opposition party k MLA khareedne baki hai re agar govt nai bani to",
        "Better luck next time, India.",
        "Power cables escaped Shah... 😹😹😹",
        "Bruh",
        "Bye bye someone's job.",
        "Thank goodness. Had anything happened to him, godi media would have blamed the muslims.",
        "Electrons were chanting Allahu akbar",
        "nt",
        "Bad people always somehow live long.",
        ">Bye bye someone's job.\n\nRajasthan's CM's probably",
        "Godi media: Jihadi cables attempting to kill hindus",
        "Sounds like a joke, but there would be at least one channel that would find a Muslim name who lives nearby/installed the wires/was just passing through there and put it on the Muslims in general. \n\nIf not today, then maybe give it a few more years and we'll get there.",
        "ISI : SHIT... MISSION ABORTED!!!",
        "Klpd",
        "Thats a revolving chair anyway",
        "Lol",
        "Amit Shah 1 India 0",
        "For once he faces the same issues as common people",
        "Taar jihad",
        "Real title is always in comments",
        "They’ll still do",
        "🥁🥁 tssssss",
        "Cable failed me",
        "So close...",
        "200-400 extra lelete bijli vibhaag walon.. kya yaar.",
        "Pure Gold. \n\nCalling Shah to charge you with UAPA.",
        "I'm sure it was the nucleus as the electrons were scattered in the potholes.",
        "You're charged with UAPA",
        "Stark reality of this world.",
        "Shocking news!!",
        "Cable Jihad",
        "I mean this was a INC ruled state. Headlines write themselves.",
        "More like musical chair?",
        "'we're so back'\n\n'it's so over'",
        "Now the power cable is going to be summoned by ED very soon 💀",
        "Unlawful Amit Power Attack",
        "Nice one mate. \nIt's all three, unlawful, powerful and an attack",
        ">Bye bye someone's job.\n\nBye bye someone.",
        "Hopefully next time, India will be luckier.",
        "What a missed chance",
        "Would've been one dramatic twist right before 2024 elections. \n\nSimilar to Sanjay Gandhi dying in an abrupt plane crash, or Reddy in 2009",
        "And Nehru’s ghost.",
        "Our national grid has always been a let down.",
        "how were amit shah and da power cable in the same horizontal field ? or did the wire fall on him?",
        "Shit yaaaaar...",
        "We were this close to greatness.",
        "Because of the visionary leadership of pm. Nd modi, amit shah's life is extended",
        "“Such is the sad state of affairs” yep I mean it’s an INC state, bound to be absolute trash in any development or utility metric",
        "Common people wouldn't have the audacity to tear power cables in broad daylight. You think having your own stage in the middle of the road that can even drive is an abuse of power the rest of us can do?",
        "You mean IB and RAW",
        "Cable has a certain height. Or is it that BJP states don't have power cables even in 2023?\n\nAnyone planning a route will know that and go accordingly and build the rath also accordingly. Who do you think did all that? Blame Congress for your stupid raths?",
        "Anti-national power cable.",
        "Bijli mistri is missing after this news.",
        "Some khalistanis or muslims would have dropped the power cable on purpose but their plan got foiled. /s",
        "If he's smart he can raise this issue in campaign",
        "Sachin Pilot dancing somewhere",
        "Naah gimme the location, imma electrocute and torture the power cable for not doing the one job!",
        "For now, just wait until the power cable goes on a morning walk and dies of cardiac arrest.",
        "that's too bad",
        "Damn, such a near miss. Would've been a real shame if we list our beloved home minister.",
        "Blame the poor infrastructure. Maybe those cables never had current flowing through them.......",
        "There's still the BeardFather........but one thing at a time.",
        "Sounds like an attack that luffy would name.",
        "The comments here are kind of horrifying. You may not like Amit Shah, neither do I. But can we stop wishing for someone's death?",
        "shit",
        "mission failed, we will get him next time",
        "Literally nothing is going to happen to you if a power cable touches your vehicle.",
        "No matter how far",
        "Sadly",
        "I can just imagine evryone being shocked when they found out"
    ],
    "cleaned_text": "amit shah narrowly escapes vehicle comes contact power cable rajasthans nagaur state affairs even lords arent safe ",
    "cleaned_title": "amit shah narrowly escapes vehicle comes contact power cable rajasthans nagaur",
    "cleaned_selftext": "state affairs even lords arent safe",
    "cleaned_comments": "sambhal k baaba abi opposition party k mla khareedne baki hai agar govt nai bani better luck next time india power cables escaped shah bruh bye bye someones job thank goodness anything happened godi media would blamed muslims electrons chanting allahu akbar nt bad people always somehow live long bye bye someones job rajasthans cms probably godi media jihadi cables attempting kill hindus sounds like joke would least one channel would find muslim name lives nearbyinstalled wireswas passing put muslims general today maybe give years well get isi shit mission aborted klpd thats revolving chair anyway lol amit shah india faces issues common people taar jihad real title always comments theyll still tssssss cable failed close extra lelete bijli vibhaag walon kya yaar pure gold calling shah charge uapa im sure nucleus electrons scattered potholes youre charged uapa stark reality world shocking news cable jihad mean inc ruled state headlines write like musical chair back power cable going summoned ed soon unlawful amit power attack nice one mate three unlawful powerful attack bye bye someones job bye bye someone hopefully next time india luckier missed chance wouldve one dramatic twist right elections similar sanjay gandhi dying abrupt plane crash reddy nehrus ghost national grid always let amit shah da power cable horizontal field wire fall shit yaaaaar close greatness visionary leadership pm nd modi amit shahs life extended sad state affairs yep mean inc state bound absolute trash development utility metric common people wouldnt audacity tear power cables broad daylight think stage middle road even drive abuse power rest us mean ib raw cable certain height bjp states dont power cables even anyone planning route know go accordingly build rath also accordingly think blame congress stupid raths antinational power cable bijli mistri missing news khalistanis muslims would dropped power cable purpose plan got foiled hes smart raise issue campaign sachin pilot dancing somewhere naah gim location imma electrocute torture power cable one job wait power cable goes morning walk dies cardiac arrest thats bad damn near miss wouldve real shame list beloved home minister blame poor infrastructure maybe cables never current flowing theres still beardfatherbut one thing time sounds like attack luffy would name comments kind horrifying may like amit shah neither stop wishing someones death shit mission failed get next time literally nothing going happen power cable touches vehicle matter far sadly imagine evryone shocked found",
    "light_cleaned_title": "Amit Shah narrowly escapes as his vehicle comes in contact with power cable in Rajasthan's Nagaur",
    "light_cleaned_selftext": "Such is state of affairs, even these lords aren't safe.",
    "light_cleaned_comments": "Sambhal k re baaba abi or opposition party k MLA khareedne baki hai re agar govt nai bani to Better luck next time, India. Power cables escaped Shah... 😹😹😹 Bruh Bye bye someone's job. Thank goodness. Had anything happened to him, godi media would have blamed the muslims. Electrons were chanting Allahu akbar nt Bad people always somehow live long. >Bye bye someone's job. Rajasthan's CM's probably Godi media: Jihadi cables attempting to kill hindus Sounds like a joke, but there would be at least one channel that would find a Muslim name who lives nearby/installed the wires/was just passing through there and put it on the Muslims in general. If not today, then maybe give it a few more years and we'll get there. ISI : SHIT... MISSION ABORTED!!! Klpd Thats a revolving chair anyway Lol Amit Shah 1 India 0 For once he faces the same issues as common people Taar jihad Real title is always in comments They’ll still do 🥁🥁 tssssss Cable failed me So close... 200-400 extra lelete bijli vibhaag walon.. kya yaar. Pure Gold. Calling Shah to charge you with UAPA. I'm sure it was the nucleus as the electrons were scattered in the potholes. You're charged with UAPA Stark reality of this world. Shocking news!! Cable Jihad I mean this was a INC ruled state. Headlines write themselves. More like musical chair? 'we're so back' 'it's so over' Now the power cable is going to be summoned by ED very soon 💀 Unlawful Amit Power Attack Nice one mate. It's all three, unlawful, powerful and an attack >Bye bye someone's job. Bye bye someone. Hopefully next time, India will be luckier. What a missed chance Would've been one dramatic twist right before 2024 elections. Similar to Sanjay Gandhi dying in an abrupt plane crash, or Reddy in 2009 And Nehru’s ghost. Our national grid has always been a let down. how were amit shah and da power cable in the same horizontal field ? or did the wire fall on him? Shit yaaaaar... We were this close to greatness. Because of the visionary leadership of pm. Nd modi, amit shah's life is extended “Such is the sad state of affairs” yep I mean it’s an INC state, bound to be absolute trash in any development or utility metric Common people wouldn't have the audacity to tear power cables in broad daylight. You think having your own stage in the middle of the road that can even drive is an abuse of power the rest of us can do? You mean IB and RAW Cable has a certain height. Or is it that BJP states don't have power cables even in 2023? Anyone planning a route will know that and go accordingly and build the rath also accordingly. Who do you think did all that? Blame Congress for your stupid raths? Anti-national power cable. Bijli mistri is missing after this news. Some khalistanis or muslims would have dropped the power cable on purpose but their plan got foiled. /s If he's smart he can raise this issue in campaign Sachin Pilot dancing somewhere Naah gimme the location, imma electrocute and torture the power cable for not doing the one job! For now, just wait until the power cable goes on a morning walk and dies of cardiac arrest. that's too bad Damn, such a near miss. Would've been a real shame if we list our beloved home minister. Blame the poor infrastructure. Maybe those cables never had current flowing through them....... There's still the BeardFather........but one thing at a time. Sounds like an attack that luffy would name. The comments here are kind of horrifying. You may not like Amit Shah, neither do I. But can we stop wishing for someone's death? shit mission failed, we will get him next time Literally nothing is going to happen to you if a power cable touches your vehicle. No matter how far Sadly I can just imagine evryone being shocked when they found out"
}