{
    "id": "rdo7si",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/rdo7si/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 9,
    "num_comments": 10,
    "created_utc": 1639186212,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Don't F**k With Cats",
        "\"Jaane tu ya Jaane na\"was ahead of its time and one of the better attempts at incorporating magical realism.",
        "Recently watched 'Don't Breathe'...\n\nMy my... What crazy ride!",
        "Thinking of watching these two movies : The fountain and Another Round.\n\nAlso thinking of watching The Wheel of Time.",
        "who doesn't want to watch Mads Mikkelsen going crazy after 3-4 rounds.\n\nedit : crazy",
        "The Last Duel.. what a movie !",
        "I’ve been watching The Expanse on Amazon Prime lately. It’s a great visual feat for SciFi lovers. The show is set in the future where humans have colonized other planets in the solar system. The lady who’s running things on Earth is shown to be an Indian. She wears elaborate Sarees and Indian accessories all the time, kind of like Rekha’s. She’s got a pretty important character in the show. It kind of felt good even if that casting choice was made in the name of diversity.",
        "A pretty good movie with an excellent soundtrack by an A.R. Rahman who was at the creative peak of his career. But certainly not \"ahead of its time\".",
        "Where did it have magical realism?",
        "People having conversations with Naseerudin shah's portrait as if it was nothing out of the ordinary."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "dont fk cats jaane tu ya jaane nawas ahead time one better attempts incorporating magical realism recently watched dont breathe crazy ride thinking watching two movies fountain another round also thinking watching wheel time doesnt want watch mads mikkelsen going crazy rounds edit crazy last duel movie ive watching expanse amazon prime lately great visual feat scifi lovers show set future humans colonized planets solar system lady whos running things earth shown indian wears elaborate sarees indian accessories time kind like rekhas shes got pretty important character show kind felt good even casting choice made name diversity pretty good movie excellent soundtrack ar rahman creative peak career certainly ahead time magical realism people conversations naseerudin shahs portrait nothing ordinary",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Don't F**k With Cats \"Jaane tu ya Jaane na\"was ahead of its time and one of the better attempts at incorporating magical realism. Recently watched 'Don't Breathe'... My my... What crazy ride! Thinking of watching these two movies : The fountain and Another Round. Also thinking of watching The Wheel of Time. who doesn't want to watch Mads Mikkelsen going crazy after 3-4 rounds. edit : crazy The Last Duel.. what a movie ! I’ve been watching The Expanse on Amazon Prime lately. It’s a great visual feat for SciFi lovers. The show is set in the future where humans have colonized other planets in the solar system. The lady who’s running things on Earth is shown to be an Indian. She wears elaborate Sarees and Indian accessories all the time, kind of like Rekha’s. She’s got a pretty important character in the show. It kind of felt good even if that casting choice was made in the name of diversity. A pretty good movie with an excellent soundtrack by an A.R. Rahman who was at the creative peak of his career. But certainly not \"ahead of its time\". Where did it have magical realism? People having conversations with Naseerudin shah's portrait as if it was nothing out of the ordinary."
}