{
    "id": "1es0gln",
    "title": "Assam college cancels advisory asking women doctors to avoid going out at night",
    "url": "https://www.indiatoday.in/india/story/assam-silchar-medical-college-hospital-advisory-women-doctors-kolkata-rape-2581990-2024-08-14",
    "selftext": "Assam's Silchar Medical College and Hospital (SMCH) has cancelled an advisory asking women doctors, students and staff to avoid going out in sparsely populated areas at night amid massive backlash. The advisory was issued amid a nationwide outrage over the rape and murder of a trainee doctor at Kolkata's RG Kar Medical College and Hospital.\n\nA tweet by the Assam Chief Minister's Office said the advisory, issued on August 12, was cancelled. \"A new advisory will be issued in this regard soon, following NMC (National Medical Commission) norms and government directives,\" the CMO tweeted.",
    "flair": "Crime",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1723638916.0,
    "convurl": "https://external-preview.redd.it/Ch1h_AC2Xi457o9cMnvJloGhfsTA-QsQ8AGXhfYY8b8.jpg?auto=webp&s=10a5569326db80acb7a8c58ac98bce51a553f8c3",
    "comments": [],
    "cleaned_text": "assam college cancels advisory asking women doctors avoid going night assams silchar medical college hospital smch cancelled advisory asking women doctors students staff avoid going sparsely populated areas night amid massive backlash advisory issued amid nationwide outrage rape murder trainee doctor kolkatas rg kar medical college hospital tweet assam chief ministers office said advisory issued august cancelled new advisory issued regard soon following nmc national medical commission norms government directives cmo tweeted ",
    "cleaned_title": "assam college cancels advisory asking women doctors avoid going night",
    "cleaned_selftext": "assams silchar medical college hospital smch cancelled advisory asking women doctors students staff avoid going sparsely populated areas night amid massive backlash advisory issued amid nationwide outrage rape murder trainee doctor kolkatas rg kar medical college hospital tweet assam chief ministers office said advisory issued august cancelled new advisory issued regard soon following nmc national medical commission norms government directives cmo tweeted",
    "cleaned_comments": "",
    "light_cleaned_title": "Assam college cancels advisory asking women doctors to avoid going out at night",
    "light_cleaned_selftext": "Assam's Silchar Medical College and Hospital (SMCH) has cancelled an advisory asking women doctors, students and staff to avoid going out in sparsely populated areas at night amid massive backlash. The advisory was issued amid a nationwide outrage over the rape and murder of a trainee doctor at Kolkata's RG Kar Medical College and Hospital. A tweet by the Assam Chief Minister's Office said the advisory, issued on August 12, was cancelled. \"A new advisory will be issued in this regard soon, following NMC (National Medical Commission) norms and government directives,\" the CMO tweeted.",
    "light_cleaned_comments": ""
}